{
    "category": "St-Petersburg", 
    "entity": "Tsarskoye-Selo-State-Museum-Preserve", 
    "avg_rating_stars": 4.722689075630252, 
    "review_count": 119, 
    "rating_stats": {
        "poor": 0, 
        "average": 4, 
        "terrible": 2, 
        "very_good": 17, 
        "excellent": 96
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "very beautiful. the palace it self very beautiful, the history about Pushkin is nothing compare to, the amber room you will not find in other place. big park makes you feel very comfortable to spend time with your love ones enjoying the nice weather."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Nicely kept and restored. Tsarkoye Selo is a great attraction to visit. All the gardens and palaces are nicely kept and there are a lot of different buildings and different styles of architecture to see. Definitely worth a visit and a full walk around all the gardens."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Beautiful place. A brilliant composition of nature, architecture and history. Romanovs' residence for almost 100 years, the place where Pushkin studied and simply a nice place for a park walk."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "You need to see it at least once in your life. This place is amazing. It was created to rival Versailles but I'm not sure it isn't better. Was the summer palace of Catherine the Great and apart from the gardens, you can find opera singers performing live in the houses nearby. The palace itself is worthy of enchanted dreams. A must be done in your route through the world."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Amazing. Unbelievable. Words can't describe it.. WOW !!! Catherine Palace is so amazing, it is hard to describe in words ... so it is best to experience it. The scale, size, detail, and intricacy of the architecture is amazing. The grounds are amazing. A wonderful experience. The palace gets very busy with large crowds, so come early, especially to get tickets to tour the inside of the palace. Unfortunately, we got there shortly after noon, and they were already sold out of all tickets for the interior tours. You can easily access the town of Pushkin by train from St. Petersburg, so a \"tour\" is not necessary. The Palace is several blocks from the train station. Catherine Palace is a MUST see."
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "Impressive. This is out of the city. It can be reached by train and bus, but it easier to get a lift if you can. It is a large area, beautiful gardens and the Catherine Cathedral. I went late in the afternoon and there was hardly anyone there. It was open until 8pm."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Only in My Dreams? Not!. Nearly a half century ago I dreamed of waltzing in the grand ballroom of the Romanov's summer palace, Tsarskoeye Selo, as I read Massie's Nicholas and Alexandra. Never did I expect to enjoy its spendor outside my imagination. Yet here I am, surrounded in this one room by more splendor than in all sixty of my previous years combined. It's all I ever envisioned -- and more.As I toured room after room of gilt (okay, really over-the-top gilt) and opulence, my head traveled between the many books I'd read about the family, trying to reconcile the fact I was physically there with my then-certainty I'd never see, in person, any of what I read. Having a tour guide who verbally connected rooms and historical events was priceless.I appreciated the beauty of the restoration even more courtesy of the contrast between the photos of the palace after its destruction by the Bolsheviks and additional images of the painstaking procedures used to restore the palace to its original splendor. Warning -- there's a great deal of walking. But for Russian history buffs, Tsarskoye Selo is a St Petersburg must."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Catherine Palace is a MUST see!. You have to go there if you're in St. Pete. It's an entire day excursion. We took public buses without speaking the language, for very cheaply and without any problems (to/from). The place is stunning! There were no lines when we went- we also went through a side door close to where the public bus drops you. Like the Peterhof, the museum is gorgeous, but the gardens are where you want to spend most of your time. So much to see. Also takes student discount."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Almost Impossible to Fathom. Everyone has heard of Versailles, the enormous palace and grounds of Louis XIV near Paris. But what if there were a dozen of him, each creating his or her own palace of similar proportions. Ridiculous? No, it's here.Tsarkoye Selo is a large area with lots of Tsarist palaces and grounds. Perhaps the greatest of these is the Catherine Palace (one of Peter the Great's children, not Catherine the Great). We've reviewed that separately, but this is a large area with many palaces. It's also close to more modern attractions like the restaurant where Vladimir Putin spent his 50th birthday.This is a window into a world from the 18th and 19th centuries that few of us can imagine."
        }, 
        {
            "index": 10, 
            "rating": "3", 
            "review": "Three stars because of very poor admin organisation. We visited this museum for my birthday. The mess started in the train station in St. Petersbourg. We asked at the information desk which desk sells tickets for Tsarskoye Selo and they said any in the train station. So after more than half an hour of queue we discovered that there was only one desk on the tracks selling tickets for this attraction so we waited for nothing and then we almost missed the train. It was a rainy day so that did not helped our mood either. From the train station you need to take a bus (good luck with that if you don't speak Russian) until the Palace. There you have a bit of walking to do, just follow the other tourists. Ok, now you arrived at the queue for the tickets to enter in the Museum Park. Be patient. After you buy this tickets you either have the option of visiting the park and go back to St. Petersbourg or to queue around 4 (four!!!) hours to enter the museum. There are no online tickets (sic!) In the park you have a small restauration in case you'll become hungry. We made it in almost the last group to enter. It is a very interesting full of history place to visit but at 5pm after standing in the rain so many hours our attention was almost lost."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Gorgeous Katherine Park And Palace. Gorgeous Katherine Park And Palace only in not rainy day.Big tour in wonderful park may be good for 3 hours and even more.great views,nature and monuments"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Nice to contrast with Peterhof. More of a free flowing park, compared to Piters gridded layout. Really enjoyed the diverse sections and constructs"
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Catherine the Great. Catherine's Palace was built as a summer residence for the Russian Empress Catherine the Great. It is located in Pushkin ( till 1917 named Tsarskoye Selo and also known as “Tsar's Village\"), about 25 km south of St. Petersburg.During World War II all the buildings were deliberately destroyed by German soldiers when they retreated after the failed siege of Leningrad. However, before it was gone so far, the major part of the valuable contents was brought in safety by Russian registrars, except the so-called. Amber Room. This was taken away by the Nazis and has been disappeared since. After the war, the palace was gradually rebuilt The palace is known for its large ballroom with a beautiful painted ceiling and numerous distinctive decorated smaller rooms. Remarkable are the large stoves with Delft blue tiles. The palace was designed by the Italian architect Bartolomeo Rastrelli in lavish rococo style, which Catherine didn’t like. For her personal residence she ordered to build a modest building in the Greek style. The palace is now open to visit. One can visit the venues and the extensive collection of artifacts (such as books, porcelain, chairs and clothes ). The walls of the amber room were lined with artfully carved amber panels. This \"Amber Room of the Czar\" was throughout Eastern Europe famous for its beauty. Its disappearance has given rise to the legend that the Amber Room was hidden in a train in the Owl Mountains in Poland in WałbrzychThe Soviet government, as well as countless adventurers have spared no effort after April 1945 to find the amber panels. This was done on the basis of numerous studies and theories, and in the most diverse places, far beyond Kaliningrad. In 1997, German police seized the aforementioned stone mosaic and later in the same year a commode that had been in the Catherine Palace at the Amber Room. In August 2015 there were all kind of speculations in the press about the location of the train, but the treasure was never foundreconstruction of the room was completed on may 31 2003 and has been opened By Vladimir Putin on the same day as the 300th anniversary of St-Petersburg"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "just wow. such an interesting stories, Pushkin mood, great palace of Katherine. really enjoyable place. everyday tours work from the city center."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Absolutely fabulous.. We visited Tsarskoye Selo and the Catherine Palace recently and it was the highlight of our trip to Russia. It is a palace and much, much more, so steeped in the history of the Romanov family that it is atmospheric in the extreme. Well, worth a visit. In fact, don't dream of going to St. Petersburg without visiting here. Located in the town of Pushikin, it is just half an hour or so away from the city centre."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "WOW! and to think it has all been rebuilt since WWII. A bit crowded because it was a national holiday, but it was well worth it to see this national treasure."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Catherine's Summer Palace. Immense and luxurious, the palace and its grounds shouldn't be missed. There is a \"short\" tour (only 15 rooms, including the restored Amber Room), which attracts less of a line (and, from what I could see, no tour groups, which abound at this place, and provides an ample sample of what country life meant to Catherine and her successors - - opulence. The grounds are stunning, and don't miss the bath house."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "amazing glitz. we booked a guide before we arrived for the holiday. got passed queues in and also for the toilets. palace is jaw dropping"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Breathtaking. When you see photographs of the destruction following the German occupation in World War 2 & walk around this incredible palace it is simply breathtaking , stunningly beautiful restoration. The Amber Room & interiors are superb."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "One of the most beautiful gardens in the world!. And the ballroom will take your breath away. I like the different buildings in the garden in particular, but also the thin and long shape of the castle, allowing you to see out both windows, on both side at the same time."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "great. intresting museum,great location also and what artifacts, a must visit to this place. at pushkin which is not too far."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "A beautiful park filled with summer palaces of the Imperial family. I loved The Cottage, which is original and was virtually undamaged and therefore remains as it was. It is intimate and very personal"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "A glimpse into the personal as well as the ceremonial lives of the Romanov dynasty. We came here the same day we went to Peterhof, which might have been a bit too rich, but here we got a better (if still limited) glimpse into the personal lives of the later Romanovs. Also absolutely stunning, by the way!"
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Refreshingly beautiful. Gold and art and facts and palaces and the time spent in them can be overwhelming. Fortunately, that's not the case here. The tour is long enough to become acquainted with the palace and it's history and to see the most famous parts, but it isn't a mind-numbing amount of information or time. Both the palace and the grounds are stupendous in any season."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Incredible place. Thoroughly enjoyed your visit and would definitely visit again. Beautiful walks by lakes and down tree lined avenues to bathing houses and summer houses."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Sleigh ride in the park in the snow!. What could be more romantic? Have to book in advance, from their web page, but it was pure magic. Very good communication from their web pages-booked also the amber workshop which was very interesting."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Very Lovely. For nature and culture lovers Parks are great and architecture is superior Walking around is a must Picture of love and care of the nature and preservation from Russian state"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Spectacular in the heart of winter.. With a blanket of snow and frost covered trees, the gardens are spectacular. Inside, the weather has kept the crowds to a minimum. Make sure to pick up a handset to guide yourself around the building. To see everything would take day but if you don't have that time, a taxi or hotel car will take your there, wait a couple of hours and take you back for under R6,000."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Tsarskoye Selo, state Museum reserve. The history of the Museum-reserve \"Tsarskoe Selo\" begins with the liberation of the Novgorod lands from the Swedes. On Swedish maps this place is listed as Saris hoff (in translation from Finnish — \"the manor on an elevated spot\"), and in Russian-\"Sarskaya Myza\" (in the future called Tsarskoe Selo). After Northern war the manor was given to Alexander Danilovich Menshikov, appointed by the Governor General of the liberated territory. In 1710 by order of Peter the manor passed to his future wife Catherine Alexeevna.In 1710-1720, the fate of Tsarskoye Selo – is beginning to build the Imperial residence, which is surrounded by many villages and homes for the Palace servants. Soon Sarskaya Myza was being called Sarskoye Selo, and with the beginning of construction of the Palace she received the title of Tsarskoye Selo.The Palace and Park ensemble \"Tsar's Village\" — a brilliant monument of world architecture and landscape art XVIII — beginning of XX century. On site are the best examples of architecture of Baroque and classicism. Here appeared the first in the Russian capital interiors, decorated in art Nouveau style. Guests and residents on the territory of the state Museum-preserve \"Tsarskoye Selo\" will be able to see the palaces, parks, bridges and pavilions, created in the period of great Empire and restored. GMZ \"Tsarskoe Selo\" conducts active exhibition and excursion activities."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Simply gorgeous!. I love Tsarskoye Selo & have now visited 5 times - Peterhof is simply stunning. We spent a lovely morning and part of the afternoon strolling through the park and also visited the Cottage Palace (some cottage!) and Peterhof Grand Palace. The grounds are huge and simply stunning - the fountains are absolutely amazing. This venue can be quite crowded during the height of the tourist season (June - August) but as we visited in late September, we had the place almost to ourselves. Lovely!"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "I had my hour in paradise!. I loved it! Besides the beautiful not so big, but Russian style richly furnished palace, the garden is a dram with its waterfalls, which go straight to Baltic Sea. I liked the Tzar table with its a little big and rough silverware, looked like there will be an official dinner coming."
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Recommended With Groups. Very stressful entrance as you never know how much time can be spent there quequeing., but as soon as you are in , you are following the groups in front and pressed by the groups behind. If the guide is good, you will manage this elegantly and get the best impression.The park requires the attention too and is mostly beautifil in late spring, summer and early autumn."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Wonderful! Worth visiting. An hour of walking through the park is like a fairytale. Come earlier to grab a tickets for Catherine's Palace because the number of visitors is limited... It is an hour and a half away long ride from St. Peterburg but it's definitely worth visiting."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Nice. Used as a summer palace for Tzars and now a museum with a huge park. A great place to walk in the summer"
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Park is better than museum. It takes about 1.5 hours to get there by public transport from Saint Petersburg but is not difficult. The park is beautiful in both winter and summer. It has a lot of statues and fountains. The museum is not bad but nothing compared to the Hermitage"
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "A Winter Wonderland. I had wanted to visit since studying Russian History years ago and it did not disappoint!. We visitied in early February and it really was a winter wonderland, plus you dont get the crowds that you would get in high season, We spent hours just walking around the snowy grounds before going into the Palace itself. We took public transport from St Petersburg which was the metro and then a bus, it took quite a while but was so cheap, about 30pence each on the bus I think and we enjoyed the ride through the snowy St Petersburg Suburbs."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Pushkin's palace.. This is also known as Pushkin's palace. The buildings and gardens are beautiful. Don't miss the amber room."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "come and stay. I can't even list all the beautiful pavillons and buildings next to the palaces that are worth a look in and around the estate. what I like most is that so many people obiously come here to simply spend a wonderful day in a beautiful park. I've seen families having some kind of a picknick in the vast grounds of the park. of course not in the part designed in the baroque style, but alexander park is as spacious that you always find a calm spot."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Place over the rainbow. It brings you this amasing, light and fresh feeling of happiness and balance. Yes, there are a lot of tourists, yes, sometimes you are almost shocked by a burger kiosk next to a historic palace... But you dont care - you are inside the fairy tale. Every little step, every stone, building or even tree is where it should be. Everything is connected and in harmony. Visit the turkish bath, walk around the lake, peek inside one of many palaces - it is indeed absolutely joyful and peaceful. Get there - just to see what is the essence of Russia. Touch the soul of it. Oh, no, I am not paid for writing this - I was there last summer for the first time and I fell in love. And by all means hire a coach - two horses coach that will take you around."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "You won't be disappointed.. With the recent restorations now open, the museum is top of the list for taking business visitors to us in St Petersburg.Only issue is the journey time, but avoiding rush hour helps a lot."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Amazing place. Renovated after devastation in II WW to a gem which looks like a movie set. Vividly coloured, with lots of gold plated surfaces, and now with Amber room (beautiful, but not original one which was stolen and then disappeared end of II WW) reopened, with fantastic parquet and fantastic park around it, this is one of the highlights when visiting St. Petersburg."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Place of enchanting beauty. Most beautiful and enchanting gardens. Go when the weather is nice, and plan to spend a whole day. Enjoy!"
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Martha Stewart's got nothing on the Romanov Women for Decorating!. The well restored palace and lovely landscaped and meandering designed grounds are worth putting up with the crowds but do get yourself a good guide to get the inside scoop...and scoop there is from Elizabeths decorating to the the Nazi bombings to the restored Amber room."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Beautiful. Go early to avoid the queues, well worth it. Also you can hire a buggy to take you around the park with excursion, you can see everything in a timely manner and relax at the same time"
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Nice place in summer. You should go there in summer. Palaceis huge and very nice. Amber room is amazing. During nice weather is nice to have a walk in gardens."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "The secret to speedy admittance is Booth 3.. The lines are impossible. However, for 1500 rubles, one can obtain what in Russian is known as a \"comfort\" ticket at Booth 3. Not only are the lines at Booth 3 drastically shorter, but this ticket permits one to walk right in at any time through a side entrance rather than waiting on line for a timed entry."
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Go early, long queues later.. Go in summer. Must visit the amber room. No photography allowed inside this room though. More than one palace and parks in the same grounds."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "come in any season and be blown away!. no matter the season - of course summer makes the symmetrical gardens and fountains look the more beautiful - there is just an amazing grandeur and splendor in this meticulously renovated array of previously destroyed palaces and buildings, parks and gardens, that house the original art which was safely stored away and protected from damage. if you are in for a bit of adventure on how to get to this place, which is about an hour's drive from the center of StPb, get a ticket from one of the many russian tour vendors in front of gozdiny dvor department store/metro station on nevskii prospekt. it's cheaper and you get to go in earlier than int'l tours, except for VIPgroups. at least that's what i've experienced. pay attention to the time when you are supposed to be back at the bus, get your own museum hearing device, and join the group walking in. then you are on your own for the rest of the visit. unless you understand russian, you won't get much of the explanation along the way to palace grounds, but you get to be shortcutted thru the inner court yard entrance of catherine's summer palace, past all the tours coming in from the other side.leave some time to stroll thru the gardens and parks before returning to your bus. you'll recognize your tour leader, anxiously making sure you are coming back on the right bus ;-)"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Bling and Amber. Poignant.the building was badly damaged during the war and has been extensively repaired with new mouldings and wall coverings. Much of the material on display is original having been packed upi by the staff and sent safety. The Amber Room is astounding. It is essentially walls covered in panels of amber mosaic. It took years to reconstruct after the original was removed by the Nazis and sent away. So much to take in. Good shops."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "AKA Catherine's palace. The amber room! No photos allowed in this room but images are burned into my memory of this and all the other fabulous rooms. Catherine The Great's carriages are all in Moscow--would have been a nice addition to have had some of them on site. Again, how beautifully restored this palace is. The video of how the artists worked on the amber room for years to recreate it from the ashes of Nazi destruction are informative."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Don't miss it!. This is one of the places that you have to visit while in St. Petersburg. Be aware on how you get here: I recommend the bus, not the train, as the bus leaves you close to entrance. The tickets are with a fixed entry hour for the Catherine's Palace, so don't miss it and go there early if you want to be sure you'll get inside. The interiors are gorgeous. take the time to visit the buildings in the park. I recommend the baths, as they are something different. Take audio guide, unless you want to finish quickly the tour."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "A Must See. The summer palace of Catherine the Great is a must see. The lovely palace has the world's first stone handicapped ramp for an aging Catherine, sauna and bath houses, symmetrical gardens, a lovely summer walkway."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Beautiful place!. Tsarskoye Selo or Tsar's Village, if to translate, is located in the South of St.Petersburg. It is one of the most famous former summer residences of Russian Tsar's.The crown jewel of this residence is the breathtaking Catherine Palace, believed by some to house the eighth wonder of the world - the world famous Amber room bedecked with authentic Russian amber from floor to ceiling , while the opulent golden decor in every room will not let you forget this palace.Closed on Tuesday."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Country residence of the tsars. Unfortunately severely damaged during WW2 but very well restored. Usual rococo decoration, similar to the Peterhof palace. Nice environment with lakes and other buildings."
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Given the early season visit, still very nice.. Wasn't sure what to expect here and was pleasantly surprised. We visited in early April and the gardens were therefore not fully out (there were indeed only the least crocuses to be seen), I would like to visit again in the summer to see the grounds in all of their beauty. The need to wear shoe covers to protect the wood floors seems odd, but not really a hassle. the finishes of the palace were quite impressive and in many ways more interesting than those in the Hermitage."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Excellently restored home of the Tsars. I visited this on a snowy day in 2015. The grounds were breathtaking, and the Palace itself very beautiful. There are many original features, although some of them have been heavily restored. The gold ballroom is stunning, and the private apartments are well worth a look. Like many Russian museums, it specialises in guided tours. If this is not your thing, get an audioguide."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "fascinating. Palace beautiful, everything was reconstructed after the German mindless destruction, so that every smallest detail is authentic. Amber Room - without comment. Park is amazing. For this excursion should be separated all day."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Magical. This palace is beautiful inside and out. We went at nighttime to a New Year's Eve ball and the palace was beautifully lit. One of the highlights inside is the Amber room. Though the Germans stole the amber during WWII, the Russians have done their best to duplicate what the room looked like. The grand ballroom is stunning."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "The Most incredible St Petersburg Palace. This place makes Versailles look desparately plain, you cannot imagine the opulence and beauty, dont miss the Candle lit ballroom, the gardens are also run, but you need almost a full day to see both, or you can combine it with a tour to both Tsarski Selo (formerly Pushkin) with an additional visit to Pavlovsk"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Beautiful and Peaceful. If Peterhof is a great and amazing, Tsarskoye Selo is beautiful and peaceful. Since we visit there in winter, the garden is covered by thick snow. But still a beautiful garden."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "The famous residence of Russian Tzars. For me it's more famous with its Litseum where Pushkin and dekabrists stidied and where great cultural and literatural were created"
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Wealth and taste for music. Another palace but this one has a very nice theater. The ship stayed two full days but we would have need at least a full week to appreciate all the wealth this city is well preserving"
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Impressive Palace!. Located 25 km. from St. Petersburg, and in the now called Pushkin Town, Tsarskoye Sélo Museum is worth the visit. There is two different styles inside : baroque and neoclassic according to the wishes of different Tsars and Tsarinas. You can take pictures in almost every room, except the magnificent Amber Room...The Hall of Mirrors is huge and impressive... You can see the 5 gold domes Church of Annunciation but is under reconstruction as so many other rooms are after the WW II . The gardens , fountains, statues and lake give such a beautiful and romantic scenary....you just enjoy so much! .There are two different souvenir shops in the Palace, and several ones by the restaurants nearby. They are closed on Mondays, and closing time is at 5:00 p.m."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Lovely, just plan for bathroom lines. Honestly had a wonderful time just wandering around the grounds enjoying everything, just fair warning to get it all out on the hydrofoil since there's only one set of bathrooms on the grounds (probably more if you go to the castle, but we didn't do this), and you can wait a good 20-30 minutes on a busy day."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Well-worth the visit. We visited in October and the autumn colours were amazing. It was a little cold, but worth every minute."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Amazing. Make sure you don't miss seeing this palace. The grounds and gardens are beautiful with places to sit and just take it all in. The Amber room is stunning and worth going in to see it. It was crowed but you have to make the best of it. The little town is also very quaint."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Get inside tour to the fountains if you can. What a place to visit both inside and out. The ground are great with some good places to snack and sit. The inside tour of the fountains add some fun and understanding if you can get it."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Beautiful. Very beautuful but unfortunately the palace is under construction and you can see just a part of it. The gardens are wonderful! I went in october...oh..the colours"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "STUNNING. It was beautiful. The Amber room is so unbelievable. The ballroom, the gardens and all....it took my breathaway. There is no air conditioning in the palace so be prepared when visiting it can get stuffy. Also, there are lines to go from one room to another. Which is good in a way because once you are in the room, you have some room to look and experience it without being smooshed and rushed. A wonderful place of history and beauty."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Once again absolutely amazing.. Make the effort and come here it is just beyond belief for its beauty. Though as everywhere else, rather overrun with tourists."
        }, 
        {
            "index": 71, 
            "rating": "1", 
            "review": "Duplicate listing - same as Catherine Palace and Park. I don't actually think this is terrible in the slightest. On the contrary, it is excellent and I reviewed the Catherine Palace and Park as 5* and it's definitely THE place to visit in terms of St. Petersburg's outlying areas. However, I find it really annoying that on Trip Advisor, two identical attractions (Tsarskoye Selo basically encompasses the Catherine Palace and Park) are reviewed separately and exist as different landmarks so at least one of them should come down in the ratings. If you go to Pushkin, you will see all of this for sure and you'll have a wonderful time. So this is just a cry against the ranking system, trying to make it more efficient for travellers who might not realise that this is basically the same and end up reserving too much time for both."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Go and see!. All the Russian palaces are rich and very beautiful. The Amber Room in Catharina II palace is, in itself, worth the visit. The town of Tsarskoye Selo is beautifully located and it is easy to see why it was the last Czar's family favourite place."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Beautiful palace and exquisite Amber room. Visiting this palce was one of the high lights of our trip so far! If your willing to wait in line for an hour or so it is well worth the wait, especially the tour of the inside. The staircase was remarkable which leads up to an even more astounding ball room almost completely covered in gold. But the highlight was not this room or even the dining room but the Amber room which was hands down the nicest and most vibrant room I've ever been it. I highly recommend visit this palce if you ever have the chance!"
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Beautiful place. The palace is not too big but the garden is huge so takes a while to go around, should go well rested. The only guided tours in the palace are in Russian. The marshrutka busses from the Moskovskaya station are pretty often and takes about half an hour to get there. Definetely worth a visit but if you don't have much time in the city choose Peterhof."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "beautifull.... Extraordinary place. Oppulence but each tiny detail it is extraordinarely defined and worked. Very fine level of art. A real proof of the high level of rafinement that was developed at the court ."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Amazing but poorly organised. We got there early morning. We took the marshrutka mini bus from the square at the Moskovskaya metro station. If you do not read Cyrillic ask for Tsarskoe selo and they will point you to the proper one, if not look for K342. Price is around EUR 0.80 and drivers drive like cray but is the quickest way, around 20 min. It is useful to buy ticket online as it will safe you one line. As we went in the summer we had the chance to walk the gardens while it was relatively mild weather as it was early morning. Then the pain! The only one slot for tourists that are not in groups is from 12 to 14h. There one other at 16h. The queue starts forming around 11 h but at 12 it gets cray. People start pushing and jumping the queue. It was horrible, total chaos. And all this under the scorching sun. Actually there is a possibility to bend the queue in the shady side of the alley, but thinking about visitors needs is outside Russian priorities. Tourists are treated like cattle. Inside everyone is attached to a group but it is so chaotic that people walk in all directions and is very crowded. You have to jostle for every square inch. The palace itself is truly amazing with the banquet hall and the amber room the highlights. Everything was demolished during WW2 and is magnificently restored, worth the wait and the annoyances."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Stunning a must see!. To get here we took a taxi which cost 800 roubles one way and took around 35 minutes. We didn't go as part of tour but decided to go ourselves. To avoid long queues pre-book your tickets through the official site and note down your order number. We were then able to pick up the tickets from 12 at a kiosk (by the church gate) without having to wait in a long line. Beware you will not be allowed to take in bottled water and larger backpacks have to be stored in the cloakroom. If you speak Russian you can join a group inside, where you will be given headphones and listen to the tour guide as you walk though the palace. We however decided to walk through ourselves as we have already read extensively about the palace. Before entering the rooms you will have to put on disposable show covers, which are free. During our visit only 10 rooms were open including the amber room and the rest were closed. It was nevertheless stunning. We spent about an hour and a half going through the rooms as there were many groups and the flow of people is regulated so sometimes you will have to wait to be let through. After visiting the palace we made our way to the gardens. There are many pathways you can take around and smaller pavilions to visit. The lakes have stunning views and there is also a small Chinese pavilion on the outskirts."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Catherines Palace. Hard to describe. Another example of the opulence that existed at that time. A summer palace with outstanding parquet floors and ornate decor."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "Worth a visit. The Palace is opulent and the grounds amazing. I'd recommend taking a packed lunch and making a day of it. We went on a tour and it was rushed. We had only 40 mins to see the park which is wholly inadequate. Don't go on a Monday if you can help it as the queue took 45 mins and we where herded through at speed. This is my second visit to Pushkin and I'd recommend for travellers with time to do research to make their own way there by bus and take a packed lunch. If you do a bit of research on the net, this is one tour where you can pass on the guide and do it relatively inexpensively.The town of Pushkin is lovely and, again, if you make a day of it, I'd recommend going there for dinner before heading back to SPB.If you only have a few days in SPB, in my opinion, I would not go to Pushkin. But others and the guidebooks seem to have a different view."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Tremendous, clean and absolutely gorgeous. Tsarskoye Selo is simply the grandest complex I have ever witnessed. We had to wear little booties so we wouldn't scratch the original floor! It is simply gorgeous and home of the famed Amber Room, which is worth every moment."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Wonderful palace. Wonderful palace rebuilded after 2 World War, it's far from the city center, around 30min driving. It's a magnificent palace where you can see a bit how does the Czars lived. Fantastic, don't loose it."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Must see!. The domain is not the easiest to get to but well worth the visit! I went there more than 10 years ago and still remember it very well :)We - a group of youngsters back then - went by public transport.Once there we mostly enjoyed the grandeur of the buildings and the relaxing walks around the pond.Would most certainly want to return if I ever get the time."
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "Visit the palace for the Amber Room. Getting there was no problem--I took the Pushkin minibus from Moscovaskaya metro station. However, on arrival, I had to first stand in line for nearly 45 min. to buy the entrance ticket to the complex. On entering the grounds, I had to immediately stand in another line this time for almost 2 hours before the palace opened for individual tourists at 12 noon. It was very frustrating! If I had come later, the line would have been much longer. Once inside the palace, I was disappointed to discover that only about 10-12 rooms were open. I was told they keep everything open only in winter (I was there in June). However, the Amber Room is just stunning, and it's worth going to Tsarskoye Selo just for it. Although the room has been completely reconstructed after the war, it remains an exquisite work of art. "
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "beautiful place. the place was just wonderful!! i was there in beginning of june, i loved both the palace and the park. however it was quite crowded, which i of course expected :)) i was with a group so we had our tickets booked, but i saw there quite a long queue of those who havent booked their tickets in advance. and what was great that it was possible to make photographs there (expect of the amber room )"
        }, 
        {
            "index": 85, 
            "rating": "3", 
            "review": "Supposedly better in spring/autumn. We were there in July (Wednesday) and it was terrible! Not the palace itself of course but the crowd! Half an hour waiting in a queue outside, then another queue to buy tickets and finally... yes, one more queue to get through control. Then we (willingly) added 10 mins waiting for the guide (instead going independently). More than 1 hour in total. Then we were towed through all the magnificent halls by a very tired guide (we waited till afternoon hoping for the crowd to disperse a bit) within just 30 mins surrounded by other groups humming constantly around us. It was like in a mall during bargain sale.Do not take me wrong: the palace is really magnificent - there is a lot of gold, amber, marble and expensive wood around and when you add Peterhof, Winter Palace and other near tzar's residences (Oranienbaum, Strelnya...) to it you will easily understand why the bolshevik revolution broke out and succeded in Russia and not somewhere else. But to appreciate it you need to visit in in spring or autum as we were told by the ticket-office clerk. The park on the other hand is relatively quiet and really nice to visit. The same with \"Agate rooms\" - new exhibition of private tzarina's Catherine II wing."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Arrange the palace visit beforehand. Unlike Peterhoff, this museum complex is amazing the whole year around. Both the palace and the park are stunning.Of all the palaces in the area around St Petersburg, Catherine's palace is probably the most beautiful. It houses the famous Amber Room, which is truly one of a kind. Besides, the Grand Hall is also worth seing. At the same time, you can imagine that this place is very popular and there are always lines to see it. Of all the the places in St Petersburg, this one really needs some arrangement in advance. Otherwise, you'd stand in line for hours and ruin your own impression of it. Here I must say that I'm a representative of a company which can arrange such a visit in advance, but in this review I'm only expressing my opinion, not trying to advertise the company I'm working for.The park is also worth seeing. Don't miss listening to a Russian choir in one of the pavilions, the Grotto, which is situated next to the big lake.You can also enter the Hermitage pavilion, which is interesting from the technical point of view. When it functioned, the guests would go straight to the second floor as they entered, and the servants waited downstairs. When the guests were ready to eat, the table would be lifted up from downstairs already served. All those 200-years old mechanisms are preserved there.If you get impressed with amber and want to buy some, in the palace (to the right from the park entrance) there is a very good amber store with probably the best prices in the area."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Great experience. This palace is a must see in St. Petersburg. The place was destroyed by nazis and took a huge effort to rebuild and it is perfect. You can feel the Tsar atmosphere and walk through the Tsar's gardens."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Massive queues. I loved my trip to Catherine Palace and thanks to Trip Advisor friends got there easily by public transport however the queue to get in was 1 hour and then once inside there was A LOT of jostling with tour guides etc and very little instruction in English where to pick up the audio guide etc. Saying that once we got passed these hurdles we had a wonderful visit and the palace is a must see."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Not to be missed. Unbelievably, breathtakingly beautiful. I've seen photographs and documentaries about this palace, but until you've actually been there, you have no sense of the scale of the palace or the grounds and no concept of the beauty inside. The level of opulence is difficult to describe. The Amber Room alone is worth the trip. We were a group of five and had a private guide- definitely worth doing, as we didn't have to wait for hours on line to get tickets or be rushed through with a big group."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Don't miss this one! The Amber Room is magnificent! (So is the rest of the palace!). The beauty of this palace--and the Amber Room in particular--can almost bring one to tears--especially if you are aware of the history of the mystery of the loss of the original and its whereabouts today. Seeing it is a memory that I will keep always. The Amber Room was the personal highlight of my St. Petersburg visit. Pictures cannot describe the intricacy of the amber mosaics and sculptures in this room..(and you can't take pictures inside it!) A tour to this palace with a guide in high season is a must--we were shepherded past a large group of \"singles\" waiting to enter and guided into a \"back\" door--ahead of the mob--and had the entire palace relatively to ourselves until we reached the Amber Room where we had to wait--but even then, our group of 13 had the room to ourselves for those few precious minutes allotted to our tour group. (glad I wasn't in the group of 40 who were ahead of us!)"
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Must visit Day Trip!!!!!. Tsarskoye Selo (Pushkin) is a town about an hour from St. Petersburg. The main highlights of this famous town include the Catherine Palace/Gardens and the Pavlovsk Palace/Gardens. We chose a guided tour with our favorite guide Marina S. Wilson (marinaswilson@st-petersburg-visit.com). The tour is the Imperial Residences: tour of Tsarskoe Selo(Pushkin) & Pavlovsk> about a 6 hr. guided tour with pre-booked entries into both palaces/gardens.The Catherine Palace is amazing with the incredible baroque architecture and design. The famous Amber Room is spectacular, and the rest of the palace is gorgeous.The Pavlovsk Palace is a definite contrast with its exquisite classical style. Both imperial residences reflect the history and architecture of the tsars' private lives.Thrilled that we had the opportunity to have Marina as a guide who is so knowledgeable, and who definitely enhanced our visit."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Unbelievable. I have seen some wonders but the AMBER room in particular is something I will always remember. Again more time if possible as we were on a guided tour."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Definitely worth the day-trip. This Russian version of Versailles is worth the day trip. We took public transport - a walk to Vitebsky Railway Terminal, then a half hour train ride to Pushkin followed by a bus ride (buses ran every 5-10 minutes). A little Russian language knowledge was a definite help although we had friendly help along the way, including being told not to take the private minibus (presumably more expensive). Public transport gave us a little look at suburbia. Unfortunately it rained so some of the outdoor exhibits were closed. The gardens were still worth seeing and of course St Katherine's palace with the spectacular amber room was unforgettable. We were able to get home to the city centre for some shopping in the evening."
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Tsarkoye Selo (Pushkin) worth seeing it;. Not as great as Peterhof (Petergof) but surely Worth seiing it if you stay one week in St. Petersburg. If You stay less (4 days) better visit Peterhof."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Catherine's Palace a must see. My favorite tourist stop in or near St. Petersburg. The grounds are beautiful and well-maintained. The Amber Room is breath-taking. Very much considered the Russian version of Versailles."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "The famous Amber room. If you know a little bit of history, you would have heard of the Amber Room of this palace, stollen by German army in WWII - beautifully restored and available for your viewing pleasure! A must see!"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Little wonderful city..... Visit this small town with big history and culture, take a tour which will help you understand history of the road that takes you to the town...enjoy it"
        }, 
        {
            "index": 98, 
            "rating": "3", 
            "review": "Fantastic, but the line to get a ticket is disgraceful!!!!. Check your guidebook for the back gates... the two main entrances are crazy crazy on busy days... at least two little used gates. Again the local train is great to use and easy to pick up the bus at the station of just walk for 20/25 mins."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "You really need time to appreciate. Good collection of paintings collected by a private wealthy business man now a state gallery. Interesting paintings but one really needs time to appreciate them."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "History of the Excesses of a Czarina. When viewing a palace like this, one understands why there was a Russian Revolution.The building originally a modest getaway became a monstrous palace a few czarinas down the track. It is an outstanding example of royal history, great rooms depicting life in Czarist times and beautiful gardens. All demonstrate the wealth and power required to do this.Worth a visit but behind the Beaty remember the pain of serfs who built and maintained this."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Tsarskoye Selo the Summer Palace. It is very impressive, especially when one goes up the main staircase, which was decorated with fresh white flowers. It is interesting the contrasts of the ornate and the more \"simple rooms\" which are still extremely elegant, wonderful furniture and beautiful paintings. It is a must see you get the feeling of the Russian Tzars, somehow, it makes it more real."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Nice and Quite. After visiting some of the other attractions in St. Petersburg it was very nice to visit Tsarskoye Selo where there weren't any crowds of pushing people. We had a chance to explore the palace and gain an understanding of the history. The guide that we had was excellent and made the visit so much more interesting."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Better that Petergof. We (me and my wife) liked it much more than Petergof. Partly because the castle is much more prominent, park easier to approach (not so many trees blocking visibility) and much, much fewer tourists there. Hire a car with a driver – it's about 30-45 minutes drive, and it takes about 2 hours on site."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Make a day of it.. We hired a private guide to visit Tsarskoye Selo located approximately one hour outside of SPb. It was a lovely autumn day and I was thrilled to see how many Russians were also visiting. The queue was quite long for off season but I think this was due to the weather and all those wanting to get out of the city for the weekend. That said, probably best to visit on a weekday although with a private guide, one does not have to stand in queue.What is most amazing about this building is that it has been painstakingly rebuilt and restored after being extensively bombed during WWII. I find this a testament to the character of the citizens of SPb and their love of and respect for their history. The restoration started during the Stalin era and lasted for decades throughout the Soviet regime. I do not know whether Moscow supported such endeavours or if this was a monumental task set by SPb alone but it is impressive none-the-less and the skilled craftsmen did a fantastic job.After touring the main palace, we walked the grounds where we enjoyed seeing the foliage hats that people were making. Supposedly this an autumn tradition in this area and they are lovely to see. We also had the opportunity to listen to an acappella group of four gentlemen who sang under a vaulted ceiling of one of the buildings on the grounds near the palace. They are extremely talented and even offer a CD to purchase if one so wishes (which we did and it's quite good). Without our guide Natasha, we would never have discovered them.Definitely worth the trip!Hint: make a whole day of it and do not miss Alexander's Palace which is also on the grounds."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "A must see attraction. Quite a way out of town, we got there via a combination of Metro subway and suburban train, then a bus, quite a long journey going about it solo and for those less inclined to face the challenge of public transport an arranged tour may be an easier option.The Palace is well worth seeing, beautifully presented.The grounds are just as enjoyable though and quite easy to walk around for hours taking it all in. Visiting this venue, and Peterhoff, make it less relevant of the need to stay next to Nevsky Prospect in St P."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Tsar Nikolas preferred summer home. This was really nice, particularly compared with the excesses of the Catherine Palace. The final few rooms were rather Art Nouveau, Arts and Crafts in style. Rather tasteful and full of family items."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Old times, not to recover. Beautifull palce. Nice to see this epoch which would never return. Great paintings, great veiews. Must to see being there."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Essentially the same thing as the Catherine Palace and Park. This is the Russian name for the grounds of the palace and surrounding park, and 5 stars isn't a high enough rating - something no-one should miss on a trip to Saint Petersburg, or really western Russia in general"
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Beautiful. Visited as part of a tour. Lovely drive to get out to the Palace and definitely worth a visit.Building itself is beautiful and all rooms are decorated in traditional style if not in the original deco. A lot of attention has gone into the detail of the building and its rooms and I would highly recommend it."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Required Romanov. It's epic. It's fantastic. It's so much more than a pretty house. It's HISTORY. But it's also where the siblings Romanov lived and it does not disappoint. The photos of them on the Imperial yacht? In their matching sailor stripes? RUSSIAN HISTORY AND STRIPES! Together? It's kind of my everything all at once."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Have to do it while visiting Saint Petersburg, especially if you like Imperial History.. It's a must. I've always gone, for 22 years. Tsarskoye Selo is a Russian city, Puskin about 30 - 40 minutes from Saint Petersburg. This place is an old Imperial city, where the Tzars built palaces and got away from city life. The famous Russian poet, Alexander Pushkin was raised in this city. Still to this day, going to Pushkin is like stepping back in time. When I go, I usually plan for a whole day trip. Go early in the morning to walk the grounds of the palaces. Then go to see the amber room of Catherine's Palace. Then have a stop at Alexander Palace to look at the family life of the last tzar. Pavel's Palace is also worth a visit - especially if you want to understand the amount of damage done during WWII. In late afternoon, take some time at one if the city's cafes. Or do as the Russians do - in the summer, find a lovely place on the preserve and have a picnic. In the winter - take the time to ski or snow board on the grounds. I personally love the city during the winter - the cozy cafes, the steamy delicious borscht, and horse drawn sleds by Pavel's Palace."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "As luxurious as Peterhof at a cheaper price. It might not boast being beside the sea and it's gardens are not as manicured and engineered but it has a more relaxed character and presents a lusher walk through the park and near the lake. The newly refurbished amber room in Catherine's palace is an impressive demonstration of the opulence of the Russian Monarchy.It costs significantly less than Peterhof, so if you're deciding between the two I'd pick Tsarskoye Selo and its parks and palaces. It's also a lot more accessible from the city by public transport."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Catherine park. Catherine park is a wonderful place to visit in summer, a lot of pavilions present you the 300 hunderet history of the residence"
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "The “Amber room Palace”. About 25 km South from St. Petersburg, best connection via commuter train from Vitebsk railway Station (return ticket for approx. 8 dollars), the stop is called Pushkin.Great baroque Catherine Palace and amazing English style of the park are taking the breath away. Have to admit, that even the palace was almost totally destroyed during World War II, reconstruction teams made the great job and it is hardly recognizable. Reconstructions are still on the way so there are several limitations in the park and palace but it is definitely worth to see / queue. The Amber room inside the palace (even not the original one from the past), is the unique decoration made from natural amber in the world."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "My favorite of the entire cruise!. Catherine's Palace was offered as an evening shore excursion adventure. Yes, we were tired after a day touring, but I am so glad we signed up for this one. It turned out to be my favorite spot of an 11 day cruise to 7 countries! First, we were greeted by champagne and a band, then tour of the Palace with a flutist and a harpsichord, then a string quartet and dancers, going outside again to a band and dancers, and then dinner and more entertainment followed by the carriage museum. Wow. Go!"
        }, 
        {
            "index": 116, 
            "rating": "3", 
            "review": "Gold, gold and gold.... To my personal opinion, this palace is not as attractive as Yusupov palace or Pavlovsk palace. I did not meet style or elegance there, I thought about. I understand that it was the residence of the Russian tsars and the main idea of this place was to impress, to astonish, to press with the luxury and greatness. And they succeeded in this. A lot of things are made of gold, gold is everywhere. If you are looking for this, you will be satisfied. I was not. Nevertheless, from the historical point of view it is interesting to visit the place, where important historical decisions of Russian royal dinasty were taken. And I want to add, that what I liked the most in this complex, it was the park. That was really interesting for me, with all geometrically planned lawns, secret places, pathes, settled in rows trees and bushes, pools, ornaments of flowers. That was amazing!"
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Fantastic palace!. Thoroughly enjoyed our visit here in December 2012. Would recommend anyone visiting in the winter - it was so quiet we almost had it to ourselves. All the rooms were available to us, which is not usually the case. The decor is fascinating and astonishing to see. Pity you cannot take photos in the amber room, but I suppose they have to make money selling you a picture (10RUB - which was not that expensive for a post card). Would recommend as a must see attraction on a St Petersburg visit."
        }, 
        {
            "index": 118, 
            "rating": "1", 
            "review": "POOR MANAGEMENT!!!. The reason I give only one point is because of a terrible management. They are not interested in tourists at all. They treat you like a cattle. Two hours in line outside, a battle in the wardrobe, and a tour which is given on a level of a schoolchild repeating a boring lesson."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Unique place with a lot of places to visit.. Tsarskoye Selo or Pushkin has lots of places to visit - five huge parks, three emperor's palaces, many small museums, churches, cathedrals. If you want to go a little bit off the beaten tourist road, come to visit Pushkin. It is an easy place to visit - just take a suberb train from Saint-Petersburg and in an hour you are there!"
        }
    ]
}