{
    "category": "St-Petersburg", 
    "entity": "Anichkov-Bridge", 
    "avg_rating_stars": 4.359605911330049, 
    "review_count": 203, 
    "rating_stats": {
        "poor": 0, 
        "average": 24, 
        "terrible": 2, 
        "very_good": 74, 
        "excellent": 103
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "4", 
            "review": "Beautiful Bridge. This bridge is on Nevsky Prospekt. The architecture is amazing and the statues of the horsemen are impressive. With the river flowing underneath you cannot help but just stroll over this famous bridge. A must in St Petersburg."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Unforgettable Bridge. I keep returning to this historical bridge with extraordinary statues and great views. It is full of complicated history, but bursting with the contemporary everyday life."
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "attractive bridge & useful landmark. The bridge is very attractive & the bronze statues of horsemen beautiful. It provided a handy landmark for us as it was just a few minutes' walk away from our hotel, and leads on to Nevsky Prospekt. It's also where one finds the ticket office & starting point for the (at time of writing) only English language boat trip along the canals - which is well worth doing."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "A river runs under it. Anichkov Bridge is Petersburg’s oldest and most famous bridge, which crosses Fontanka Canal/River. It is an essential element of Nevsky Prospekt, a major artery similar to Andrassy in Budapest. Originally constructed in 1715 (61 years before the American Revolution, and 168 years before Brooklyn Bridge), Peter the Great ordered its construction and named it after engineer Mikhail Anichkov. Nothing remains of that incarnation, and the current bridge was built in 1841, reconstructed in 1906. The four famous horse sculptures were added in 1849, and Anichkov Bridge has the most celebrated ornate iron railings in Petersburg. Anichkov Bridge is mentioned in the works of Dostoevsky, Pushkin, and Gogol. For those who think it’s just a bridge, consider the historic ramification here, and for Charles Bridge in Prague. Besides, Faberge Museum is a block away. Without this bridge, visitors would have to walk miles to experience such attractions as Church of the Savior on Spilled Blood, Hermitage & Winter Palace, and a host of other historic attractions just beyond Anichkov Bridge. But I enjoyed it for the attraction it is. It is the iconic bridge of Petersburg, and is featured in paintings. For those like me, who are travel budget challenged, there is no cost, so why not enjoy? Perhaps this is why it's TripAdvisor rated #20 of 1,662 Things To Do in Petersburg."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Beautiful Downtown Bridge with Horse Sculptures. We drove over this important bridge with our guide and it is an impressive piece of architecture in its own right. What really makes it famous are the giant full size horse sculptures. This is another example of unnecessary beauty added to something mundane that you see so many times in Russia."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Impressive!. A piece of art at the very heart of St. Petersburg. Klodt statues are one of the most recognizable symbols of Petersburg. A must-see spot."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Bridge of Horses. Our Guide called this the bridge of Horses, it wasn't until we got back to Australia that I found out its real name. A must see"
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "When you walk on Nevsky this is a must to walk through. A nice impressive bridge to see when you walk on St. Peterburg main Nevsky Prospect. take a close look on the beatiful horses."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Large bridge with 4 horse statues. The good photo of this bridge is in the four statues of horses, each in different stages of their training. You can also see the damage from World War II, but that doesn't make a very good picture."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "Great historic bridge. This is pure history...this is the bridge that survived the siege during the battle of Leningrad in WW2, you can see the damage in one of the columns from one of the 150000 bombshells dropped during the war (look for the bronze plaque)"
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "photo op. Great place to stop to look at the city skyline and take a picture. Big is magnificent - but it is still just a bridge?"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Another interesting Bridge. All of the bridges are different and each has its own beauty. It is lovely to walk along the canals in the early evening and see all the boats and people out for a stroll."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Traversed many times. As one of the many bridges across the River Neva this is one of the more photographed and is the link to both sides of the river of Nevsky Prospect. Great views down the river."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Wonderful bridge. The view, the horses, the people and a lot of history - this is what makes this place such famous in the city."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Famous Bridge!. Anichkov Bridge is one of the most famous bridges in St. Petersburg. It was built in 1785 of wood and is named after the engineer of the first bridge - Mikhail Anichkov. The current stone bridge was built in 1841 and reconstructed in 1906. The bridge is famous for its four horse sculptures designed by sculptor Baron Peter Klodt von Urgensburg. The Horse Tamers represent four different stages of taming a horse. Free"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "HIstory. The history of this city is so amazing - the preservation of the horses so clever. People watching is great fun too."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "One of the city's icons. Hundreds of years after it was built, this bridge with its iconic horse statues still conveys the very spirit of this grand city."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Good for photos. Small bridge with many sight seeing around. Good for taking some photos. Evening is the best time where this place looks beautiful."
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Nice View!. Nice place to visit in St Petersburg! Makes a great location for some excellent photos and a lovely view of the river."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Anichokov Bridge Canal- mini Venice. SBP tours took us on a boat ride, which included a ride under the Anichokov Bridge. The boat ride and the canal reminded me of Venice, Italy."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "One of the most popular bridges in St. Petersburg. This bridge is famous for its sculptures and adds to the whole impression about the city. History lovers will like this object of art."
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Taming a horse. This was a quick photo stop on the embankment which is showing the different stages of taming a horse with beautiful views along the embankment. It was our first stop if we did not have a guide we would not have understood the significance of the area. MAKE SURE YOU HAVE A GUIDE"
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "An interesting Walk by. Interesting bridge but unless you're a bridge freak don't go out of your way to see it. Can be viewed from the river too if you take a boat trip."
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "See it from both land and water. Like many bridges in SP, this one is handsome, especially when viewed from an open tour boat. The horses are exceptionally handsome."
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Australian Travellers. Wonderful view of this bridge from our channel cruise. Later as we drove along Nevsky Avenue we crossed over it so saw it from two perspectives. It is the oldest bridge in this city and spans the Fontankar River. Originally built of wood it was later built of stone with beautiful cast iron railings and 2 magnificent horse statues at each end of the bridge. From the water it looks quite regal!"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Iconic. This iconic bridge has a prominent place on Nevskiy Avenue. If you are wandering around St. Petersburg you will likely cross it several times. The Horse Tamers on every corner of the bridge give it a regal appearance. The horses were removed from the Academy of Arts building as they were replaced by Egyptian sphinxes when someone got the idea to relocate the horses to Nevsky Prospekt. Two were placed on the west side of the bridge and in 1851 two more sculptures were installed. Just north of the bridge a gilded coat of arms stands above the central wrought iron gates of the Sheremetev Palace."
        }, 
        {
            "index": 27, 
            "rating": "3", 
            "review": "As Long as You are Walking Along the NP. A nice bridge like so many in St.P. Yes, the horses are nice. Not worth a trip. But as long as you are enjoying a walk along the Nevsky Prospect, you can enjoy some picture taking here. Also, at least one canal boat operator his just below the bridge and this operator offers a couple of tours a day with English narrative."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "A great place to visit. One of the great many bridges in St Petersburg, but probably the most beautiful with four wonderful horses on its edges. Iconic!"
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "The oldest bridge. The oldest and most famous bridge across the Fontanka River. The Horse Tamers, designed by the Russian sculptor, Baron Peter Klodt von Jurgensburg"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Four horses, in the four corners of a wonderful bridge over the Neva.. Our visit to St Petersburgh was amazing. This is, after Seville, the most beautiful city in the world. I would say it is even more beautiful than Seville."
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "Interesting!. What makes this bridge special are the four scultures at its corners. Collectively, they represent stages of \"the mastering of horse by man\".\nImposing and detailed, the sculptures make this a landmark bridge in SPB!"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Practical & Beautiful. There are many bridges over the canals of St Petersburg , this one is my favourite. Built in 1841 & rebuilt in 1906. The 4 horses date from 1850. This bridge is mentioned in the work of Pushkin , Gogol & Dostoevsky. The horse sculptures , The Horse Tamers , were buried in the nearby gardens in 1941 during the 2nd World War. I walked across it countless times & it never stopped being impressive."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Most famous passage of Nevsky Prospekt over the water body. That it is, in this case , the very renown and oldest bridge across the Fontanka River, which is, as a matter of fact, a canal with the inlet and outlet in River Great Neva. We crossed Anichkov Bridge several times, as we had undertaken our pleasant ramblings from our Hotel Moscow, in the Alexander Nevsky Square, toward the Admiralty building on the Admiralty bank of river Neva. And always, again and again we admired to its elegant features and lines. Thinking only of, how it started with the wooden construction in 1715 -1716, ordered by Peter the Great, and named after its engineer, Mikhail Anichkov. Then developped into the three-span stone drawbridge with the most celebrated ornate iron railings in Sankt Petersburg.And of course, here there are the four wonderful horse sculptures, that became one of the Sankt Petersburg landmarks.Amazing !"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "City Landmark. This bridge is one of the architectural highlights of Nevsky Prospekt, and essential viewing for any visitor to St. Petersburg, both for the spectacular views of the surrounding palaces from the vantage point of its humped back, and for the famous sculptures - the Horse Tamers - that crown its four corners. Other decorations on the bridge are almost equally striking. Great opportunities for photographic memories."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Very Cool Bridge. It's not just that it has really cool statues and railings. It also has a killer view. It's making me say more but what else is there to say?"
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Just a must-see in St. Petersbusrg. There is not much to say about this bridge, you can read a little about it in Wikipedia. But this is an absolutely must-visit place, because it is located in the very heart of the city."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Try ignoring all the people selling river tours and enjoy the view :-). If you prefer walking in St.Petersburg, which is definitely a smart choice to experience this city, you are bound to cross Anichkov Bridge at least once. The four statues on the corners attract many tourists by a silly legend that the emperor's face was secretly portrayed in a place highly inappropriate for royalty, and many groups go around the four horsemen closely examining the hind legs of the horses. Forget this silly idea and take a look around - Fontanka is quite lovely and is worth a detour from Nevsky, the bridge is a masterpiece, so take a few minutes to enjoy it and take pictures."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Anichkov Bridge. This bridge is on Nevskiy Avenue. This is the main avenue that has restaurants, museums, shopping plazas, all around the bridge. An absolute must to see."
        }, 
        {
            "index": 39, 
            "rating": "3", 
            "review": "Bridge. When you go back to your hotel, well for us anyway you pass this statue as cross the Fontanka river.It's one off many statues, inSt Petesburg."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Take a look to the beautiful statues in this bridge. This bridge on Nevsky Prospect is the oldest bridge over the Fontanka river. The statues in each end of the bridge represent scenes of the process of taming a horse. The bridge has solid cast iron fences on the sides. It is one of the highlights in the city and offer beatiful views over the river and buildings on the Fontanka's embankment."
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Beautiful statues and river is amazing. The statues have meaning but the view of the river is also worth noting. Look for the face under one of the horses. You may have to google what that means."
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "Nice statue of horse with man. It's nice to see if you walk over the street from the right there you have boat trips to go through St Petersburg."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "passing by. we were told of this Bridge and what the 4 statues represent, they are the four processes of taming a horse, excellent bronzes."
        }, 
        {
            "index": 44, 
            "rating": "3", 
            "review": "Nice bridge views. Bridge itself isn't as big as I expected but otherwise it's beautiful! I enjoyed nice views every single time I passed by. It gives you a nice perspective to see all the beautiful palaces and buildings along the Fontanka river embankment- by day and by night! Don't miss the Fabergé museum only a stone throw away :-)"
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "The popular name of the bridge. In the 19th century citizens of St. Petersburg called this bridge \"The Bridge of 18 Balls\".\nYou can count it: 4 young men, 4 horses and 1 policeman, who constantly walked here."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "One of the most beautiful bridges in St. Petersburg. One of the most beautiful bridges in St. Petersburg, which is great to see on your walk on Nevskii Prospect. You can take better pictures from Fontanka River."
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Famuous but usual bridge. This is most famous bridge across the Fontanka River but I did not like it.\nI know that is one of the most famous place where you must be but...some spectacular decorations? It has. celebrated ornate iron railings? It has.\nBut it has not a soul. Now it is just a bridge!"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "One of the first and most famous bridges. One of the first and most famous bridges in St. Petersburg - Anichkov Bridge crossing Nevsky Avenue bridge over the Fontanka with his adorable horse sculptures - the most memorable.\nNow Anichkov bridge has a length of nearly 55 meters, the width - 37.9 meters."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "More than a bridge. If you're in St. Peterburg and walk along the way Nevsky prospect you can hardly skip this famous bridge. At first it doesn't seem to be a brdige as it is pretty small and quite wide, like the prospect. But the beautiful horse sculptures make you stop.The longer you watch them the more you admire them. Each of the four are different. But all of them are about the power, the struggle between man and horse and the victory of man. Stop and look at each of them, it worth."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Humanities Struggle To Tame Nature. We stayed right by this bridge at the Anichkov Hotel (Apartments) so it was a good locator when we needed directions..........and the statues are pretty good too even if they are a bit too proper!!"
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Only If You're Nearby. If you're close by (we were at the Faberge Museum down the street) it's worth swinging by but I wouldn't go out of my way to see it."
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Interesting memorials. On Nevsky Prospekt it is a small bridge over a canal but the main features are the 4 horse sculptures at each end"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Must see for all ages. The bridge is unofficial symbol of the city, kids love it, statues are very dynamic and powerful, stunning impression during day light or night."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "A touch of Empire!. I saw this bridge first from a boat tour, but then had to walk back on my own to get good pictures of the statues at either end. This was my favorite bridge in St. Petersburg - a little bit of grandeur that typifies the way the city's history sits like a transparency across the modern."
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Pretty Pretty. Lovely little bridge. Locals visit all the time. Many tourists there Short visit and nice place to take pictures"
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Awesome Experience. Nice and Cleaned Street I love this city where i got nice experience...\nThey maintained old structure and giving vintage feel all over city."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Check the ornaments. The bridge is the oldest bridge crossing Fontanka river. It is famous for its four horses, but many ignore those ornaments in iron railings. If you have read books by Dostoevsky or Pushkin, you can imagine yourself into their books on this bridge."
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "Great statues. You will fall upon this bridge if strolling round the City\nGreat for a photo stop\nWe visited when the river was iced over and covered in snow so very picturesque"
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "wonderful. this is an amazing bridge and lot of interesting building around ,I loved to see it and canal very intersting I would recomend to visit this bridge"
        }, 
        {
            "index": 60, 
            "rating": "3", 
            "review": "Famous for Its Horses. The statues were recently restored and it was quite a ceremony to istall them back= the citizens could watch the procession.Now the statues are back to the public lifeThey were originally made by famous Klodt who also known for horse quadriga on the top of the Bolshoi Theatre in Moscow."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "The horses of Baron Klodt!. The horses of Baron Klodt! A place for guests and residents of St. Petersburg special and solemn.The splendor of sculpted bronze horses tearing the will - symbolically and beautifully.It's a gift!"
        }, 
        {
            "index": 62, 
            "rating": "3", 
            "review": "The bridge itself is beautiful but located in very overcrowded part of the city. HOrses which became almost the symbol of Nvski, walking there you'll never miss this bridge. but Nevski is very overcrowded place, even by night. Dont'expect any relaxing experience"
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "You will not miss it. To walk down Nevskiy is something out of question, and if you have a good guide with you he/she will explain alot about every building or bridge you pass by... The same with this beautiful bridge...One of many around, but like all of them with its unique history, mystery and beauty."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Beautiful bit of Russian culture. We didn't stop here much, it was the junction we passed daily though. We loved the idea of the story told by the 4 scultpures. The bridge stretches over the Fontanka river which was alongside our hotel which was a few hundred yards from this bridge along the Fontanka. There's enough on Google to explain this bridge in full but our guide told us they are sequential and show man's control of either his enemy or maybe nature metaphorically."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "history. again beautiful clean and must have cost a mint you always feel the history and the workmanship I love it so much just off the bridge you can have a hot coffee"
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Lovely and interesting bridge. Bridge located in the center of the city on the most famous Nevsky Prospect. There are 4 monuments that are sculpture of horses on its four corners. It is the most famous and one of eldest (300 years ago) bridges in St. Petersburg.It can be a star also of your boat trip."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "The Taming. Historical bridge with the four monuments depicting the taming of a wild horse.The Fontanka river run's under the bridge.Reconstructed a few times and damaged during the war with a plaque on one of the pedestal's depicting this.Our guide told us that on one of the horse monuments the sculptor created a face of his nemesis on its undercarriage (crown jewels ).You can't miss this bridge as it's on Nevski Prospect. ."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "very pretty. another beautiful bride to see while in peter. we walked all the way around these bridges and found them to be amazingly pretty with lots of art to see along the way"
        }, 
        {
            "index": 69, 
            "rating": "4", 
            "review": "Lovely statues. The 4 statues at the bridge are all horses/handlers but each is different. Very nice works of art but not worth walking here from the Neva unless you want to shop along the way or see the Faberge museum which is nearby (and both of these activities are highly recommended). You can also view these statues from a canal ride."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Spectacular Equestrain Bronzes. Four of the best equestrian bronzes in the world, very good understanding of equine anatomy and movement. One of the highlights of St Petersburg for me."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Interesting to see. Four statues show the stages in taming / breaking in a horse. An interesting place to linger and take a rest before moving on to the next attraction !!"
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "In city center. Located on nevsky prospect avenue ;very beautiful avenue in heart of city near so many tourist attractions ."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Klodt's legacy to posterity. Sculpted by the GermanPyotr Klodt in the 1840s , these astounding statues were first brought to my notice in the introduction to St Petersburg in Ayn Rand's classic '' We the living '' . It was a dream come true to actually appreciate the beauty of this dynamic art . The horses were apparently buried during the Leningrad siege to prevent damage . There is a post in this forum about one of the horses being different . I did not get the hint but was told of this by the local guide .Take note of the southwestern horse's genitals [ the first horse to the right as you approach the bridge from the Admirality side ] ;unlike those of his anatomically correct companions , the genitals of this one are apparently created in the image of the sculptor's unfaithful wife's lover [ another version has it that it is Napoleon's profile . I had no way of verifying this hilarious fact as I had to leave St Petersburg - do so if you can !!"
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "St Petersburg by water. Just under the bridge is a dock where you can board a boat for a couple of hours. It travels through most of the canals and out into the river and it is an amazing way to see the city of St Petersburg. If you're there when it's cold make sure you rug up. Although there are blankets on the boat the wind chill factor makes it seem a lot colder."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Bridge of the sixteen balls!. Popular name for this bridge, according to our guide, counting all horses and riders.The statues are all different. Amazing."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Beautiful statutes. Anichkov Bridge is known by the locals as 16 Balls due to the fact each vorner of the bridge has a bronze statute of a wild horse and a nude man! Exquisitely made carvings and the bridge is an easy landmark when you try to find your way around St. Petersburg. Directly on Nevsky Prospekt."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Comparable to Paris Alexander Bridge.. Bridge located in the center of the city on the most famous Nevsky prospect. Go to \"Gostinnin Dvor\" metro station and go north. In about 100 yards you came up to the bridge. Status of the horses and a man - struggle and power of nature (Or you could use your imagination) But any way you turn it is gorgeous. See if you could spot on different horse. It is drastically different. A?"
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "Interesting horse statues . You will most certainly come across the bridge on Nevsky Pr. There are four statues showing different stages of training a wild horse. Stop and admire the talent and stages as you walk across."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "Oldest Bridge on River Fontanka. It would not be an exaggeration if \"Anichkov Bridge\" is called the Centre of St. Petersburg because most of the Tourist activities start here. Be it a Boat Cruise in Fontanka or Neva River or starting point of Hop-on Hop-off Buses. There are beautiful sculptures on both sides of the Bridge and the Train Station for Moscow is also not very far from this Bridge on the other side of the River. If you are looking for a Boat Cruise with \"English Commentary\", this is the place where you will find it."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "beautiful. We were told on our tour that the four huge statues (4 stages of training a horse) were buried by the locals as the Germans were heading into the city. The are beautiful and huge statues and can't believe they were able to hide them!"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "A old and famous bridge. This bridge is across the Fontanka River on Nevsky Prospektat. At Each end of the bridge are two statues, huge iron statue. The entire statue ensemble symbolizes the taming of a horse."
        }, 
        {
            "index": 82, 
            "rating": "3", 
            "review": "See the Neva and surroundings. Walk acroos this bridge, it will give you nice views over the Neva, the city and all the ships that travel acroos the Neva"
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "those horses. a major sight of the city.\nthose four statues of the horse tamers that it's been decorated with are magnificent pieces of sculptural art.\nthe palaces (shuvalov -faberge-, anishkov, beloselsky-belosersky,....) facing the bridge are a speldid as the bridge itself.\na wonderful atmosphere, at day and night (when it's nicely lit)."
        }, 
        {
            "index": 84, 
            "rating": "3", 
            "review": "Nice bridhe. A lovely bridge with ice views of a remarkable city. St Petersburg. How can I struggle to reach a hundred words about a bridge but they say I must. Like everything in this city it is lovely"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Beautiful sculptures and bridge. We went by these beautiful horses so many times on our tour and were very happy that we were able to go there later and see the sculptures close up. Really beautiful and very happy they saved them in WW II."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Majestics beasts. Loved going across this bridge just to see the 4 horses rearing up showing such strength and majesty. You don't have to organise a visit, you will just pass by these horses so many times as they are on a main thoroughfare."
        }, 
        {
            "index": 87, 
            "rating": "3", 
            "review": "Anichkov Bridge. The bridge itself is ordinary but the statues. there are marvelous and each is a piece of art. Best way to see this is on foot."
        }, 
        {
            "index": 88, 
            "rating": "3", 
            "review": "Interesting venue. We walked to this bridge on our recent trip to St Petersburg and were intrigued by the statues that flank the bridge. They are really beautiful and depict an interesting relationship between man and horses. This bridge is worth seeing if you have time to go to the area."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "When you walk the Nevsky Avenue. Located on Nevsky avenue bridge over Fontana river with famous four horses. It is a short distance from the city centre."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Boat trip of Canal & River System essential part of any visit to Saint-Petersburg. Did a boat trip from Antichkov Most (with the emblematic four horse tamers on each corner of Nevsky Pr). The boat played an on-board commentary in Russian but fortunately we had our English language guide Valentina sitting with us so we got the translated version face-to-face, essential to an understanding of all the significant buildings & bridges we passed. Our boat was a flat top type, the importance of which was illustrated when we passed under bridges as low as 2.4m (many were 2.5m) - standing up was not recommended - for health reasons! The crew member on our boat at one point nonshalantly ducked his head at the last moment to avoid get it taken off. We figured we knew what he was doing & was just 'showboating' to impress the punters. Cruising the open Neva afforded good views of the impressive Peter and Paul Fortress in the river island. In the boat the canals (Fontanya, Moiky, Gribeodova) afforded good views of many of the city's best buildings."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Anichkov Bridge. There are really 4 horses along this place . Its a more of a directional site for me . It was along Nevsky Ave , by the Fontanka River where we took our river cruise . We went there on our own and waited to take the river cruise . The boat had to wait for low tide to start the cruise ."
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Lovely Bridge with statues at all four of the corners. The bridge has been artfully done with wild horses at the four posts of the bridge. they are very lifelike and the bridge runs along the Nevsky Prospect and is probably one of the more famous bridges in the city. Often photographed and graphically explicit has a nice feel to it."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "The most Beautiful bridge. This one beautiflly decorated bridge crosses your way on your walk along Nevskiy prospect. it has 4 monuments at its 4 corners. those monuments are sculpture of horses. its ironmongery is very craftly designed. it is the most famous and one of eldest bridges in st. petersburg, built initially some 300 years ago."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Wish all bridges look this way! :). The wild horses (two of which have their horseshoes and two do not) are tamed by man similar to the river with the granite-stoned shores they are meant to decorate. Thanks to the talent of the architect Piotr Klodt the bridge is very spectacular and very much coincides with the spirit of the city :))"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "More on historic. The Anichkov Bridge (Russian: Аничков мост, Anichkov Most) is the first and most famous bridge across the Fontanka River in Saint Petersburg."
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Beautiful Statues. There are 4 horse statues on this bridge. Each is of a different place in breaking a horse. Everyone loves this area. If you take a cruise you'll see if from the water as well."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "A statue on the bridge. If you're walking down Nevskiy Prospect from either end, you're bound to come across this bridge. Tourist boats pass under this bridge while on their river cruises.It's difficult to click a photo of this statue without being photo bombed because of the bridge being immensely crowded at all times during the day and sometimes at night too."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "Central bridge on Nevskiy Prospect St. Petersburg Russia.. A rather grand landmark displaying 4 horses, one on each corner of the bridge.You can see the canals and also the very wide and long Nevskiy Prospect main street through the city centre.Another frequently photograhed landmark."
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "Beautiful bridge. Beautiful bridge over the Fontanka Canal with the Horse Tamers sculptures. It´s on Nevsy Prospekt so you are likely to come acroos it as you stroll down this wonderful avenue."
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "a unique bridge in Nevsky Prospect !!. The bridge has four statues of men trying to catch some horses. you can take some good photos from the bridge as it overlooks some beautiful buildings with unique architecture."
        }, 
        {
            "index": 101, 
            "rating": "3", 
            "review": "A Bridge!. Yet another bridge, They make it out to be some special place, Its a bridge! They cross water, Gee, such an acomplishment, you crossed water, DA!"
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Lively atmosphere. Crowded and alive. Was there for the parade celebration a few Saturdays ago. And I thought that Time Square was busy."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Spectacular. The ornate ironwork on this bridge is spectacular. We saw this bridge via land and canal and both offer unique perspectives."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Great piece of engineering work. One of the most famous bridges in Saint Petersburg (a bridge athwart the Fontanka river). The four monuments of people taming the horses are quite impressive. Fun fact: the bridge is also called ”the bridge of 16 nuts”. By means of simple calculations you can understand why."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Amazing Bridge. This bridge is high light of Nevsky prospect. Four statues of horses in different pose is main attraction. It is main photo stop point for visiting tourists.\nIn close vicinity is the palace as well as boat cruise pier. Surprisingly heavy traffic goes over this four lane bridge .\nMust visit"
        }, 
        {
            "index": 106, 
            "rating": "3", 
            "review": "Worth a picture. They are nice ones but they are not that you would plan to go see them, you will pass them by and admire them when you are walking down the Nevsky"
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "My favorite bridge in the city. It's famous with the statues of horses and riders, made in Ancient Greek style. But one of the horses has human face on the interesting place..."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "This place is dear to me.... The Anichkov bridge is one of the most famous bridges in the city. The bridge stretches over the Fontanka River. No one can pass it without noticing the group of four horse sculptures by Pyotr Karlovich Klodt.\nThis place is dear to me, because my youth passed in the house next to this bridge."
        }, 
        {
            "index": 109, 
            "rating": "3", 
            "review": "Nice views of the canals and famous statues. The bridge offers nice views of the canals but what really makes this bridge interesting are the 4 horse and rider statues and the history surrounding them. It was part of our city tour but would not make a special trip to see the bridge."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Symbol of the city. Though this bridge is not very large and not a drawbridge, it is by right one of the most romantic silhouette in the city. The bridge is crowned by 4 different sculptures, that makes him unique and very recognizable."
        }, 
        {
            "index": 111, 
            "rating": "1", 
            "review": "4 horse statues make this an attraction?!. I don't understand. Unless you make a point of walking up and down Nevsky Prospect, you shouldn't make this part of your itinerary. When you pass it, you might take a photo and move on, the whole thing will be over in 30 seconds."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "The famous bridge. The bridge is famous not only because it very beautiful horsebridge. It has the story related to the one of the horse's legs."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "in the heart of the nevskiy prospect. a very well designed bridge, a good place to meet. there are a lot of touring boats around to see the canals or the reigon. you can join late night white nights tours as well.."
        }, 
        {
            "index": 114, 
            "rating": "3", 
            "review": "Good views. Some good views around here. Statues are very intricate, lots of detail and worth a quick look. Nice area to walk around. Better in the evening."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Nice view of canal and impressive sculptures. Love to stop by the bridge when walking around town. Quite a busy area on a Saturday. Take your time and enjoy the views, which get far more interesting when the sun goes down\nAll four sculpture s on the bridge are nice to see and different from each other, pick your favorite"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Russian Scupture at its Best. Examples of beautiful sculpture. The story about the horses is interesting too. Be sure to look under each horse to see the faces sculpted onto the underside of one of them."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Amazing Detail. The detail that's gone into the statues on this bridge is amazing. Even if it's just walking past them on the way to something else you have to stop and just see the time and effort they've put into the statues. Can be very busy with the cars and foot traffic however as the sun sets you get an amazing view of the skyline across St.petersburg which is certainly a great photo opportunity"
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "Loved these horses. Bridge is great. The horses and man are just awesome to look at. The detail is amazing. I would think you would tick this off as a bridge to go to and have a look at - if only for the statues."
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "Yes, it's a bridge, but...... As a bridge, it is a pretty average bridge, but it's the story behind the saving of the 4 statues that elevates it to above average. When the City was named Leningrad and the Germans were advancing on it, the local population decided to bury the four statues in a nearby location. Once the 872 day siege was lifted, the horses were dug up and replaced on their respective plinths. I like the fact that one of the plinths (with the tamed horse) still shows its battle scars."
        }, 
        {
            "index": 120, 
            "rating": "3", 
            "review": "Yep, still a bridge. Take it in as part of a walking tour of the city -- good. Come here specially just to look at the bridge -- not really."
        }, 
        {
            "index": 121, 
            "rating": "3", 
            "review": "It's a bridge!. OK it is a bridge. The time to look at the bridges is 1.00am in the morning during the White Nights celebrations. Make sure you are on the right side to be able to get home once all the bridges on the River Neva lift in harmony. It is up to you how much you love your early nights as to whether witnessing this spectacle but it is romantic event in Russia and may bring you good fortune or a partner. I think the latter has more to do with the late night drinking that goes on..."
        }, 
        {
            "index": 122, 
            "rating": "1", 
            "review": "No idea why it's so highly ranked. It's just a bridge with four horse statues. Not an architectural marvel. Not even an amazing view. If you actually take time out of your schedule to go here, you'll be disappointed. If you pass by, your memory of it will be the solitary picture on your iPhone. That's about it."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "First and the most romantic. When you walk on the Nevsky Prospect please make sure you have a few minutes to stop, enjoy and take pictures! That bridge will take your breath away. Out of 200 bridges in St. Petersburg, the Anichkov Bridge is a first bridge built across the Fontanka river and is considered to be the most romantic place in the city! The Anichkov Bridge is so famous and loved by all for its four beautiful sculptures of men and horses! They are so expressive and dynamic that you would think they are alive! And each of the sculptures are different. You will love it!"
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Powerful statues. When you stroll down Nevskiy Prospect make sure you go far enough to cross this bridge. The statues are powerful."
        }, 
        {
            "index": 125, 
            "rating": "3", 
            "review": "Not so impressive as I expected. I remember my first impression of this bridge and it was great. But I have seen it again recently. Frankly speaking, the figures are of average size and design. Worth seeing, but not breathtaking."
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "Beautiful bridge. Landmark sight, make sure you see it. As part of Nevsky Prospekt, the tourist street in St Petersburg, this is a beautiful bridge."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Beautiful horses and horsemen. This bridge is iconic in St Petersburg. It is very busy with traffic as it is on Nevsky Prospect but it spans the Fontanka and makes a pleasant focal point over the river. The river trips with English guides start at the bridge and the Faberge Museum is just a few metres away so this is quite a good way to spend a later afternoon and evening."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Beautiful!. Just on the very central part of Nevsky Prospekt, Anichkov Bridge impresses the visitor by both its own architectural beauty with the horse statues on its four corners as well as the surrounding historical sites like the Anichkov Palace and others..."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "Man taming animal.. The statues of man taming horse are on both sides of this very pretty bridge. Unfortunately we couldn't stop but the view from the car was very pretty."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "A landmark!. An old Elisejevsky food store not far away from it. One can take boat trips from there - which might be cheaper than from other places :-)"
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "Sign of Leningrad. Beautifully crafted bronze lovelies, they were protected from the worst of the ravages of the Second World War and now stand as a reminder of the defiance of a people in their city.All of the bridges give you something, a reminder of life in former times when people celebrated themselves, take them in your stride along with all the others."
        }, 
        {
            "index": 132, 
            "rating": "3", 
            "review": "A nice bridge. With so much to see would not spend a lot of time on this or any other bridge. Drive by or walk across it."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "Take photos. We were able to walk across this bridge as well as visit it on the boat tour. The bronze statues of the horses are amazing. Great history of the bridge as well."
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "A pretty little bridge. The bronze statues are excellent.The view along the channels is very pretty and worth a stop to view."
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "a very beautiful canal view. the bridge in on the nevsky prospect. it is often referred as \"the bridge with the horses\". you can witness a great perspective of the river neva and spend minutes without knowing it.you can also find variety of river touring companies there, that can provide canal tours, night tours and more..."
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "Romantic!. this is a very nice and romantic bridge.we took some photos and spent there almost 2 hours.took a boat tour on the canal.great place to visit!!!"
        }, 
        {
            "index": 137, 
            "rating": "4", 
            "review": "Great view, central location. The Anichkov bridge is very centrally located in St Petersburg, and the location of many of the canal boat tours. It also has statues on each corner of the bridge worth seeing."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Wonderful work of art. This bridge is, in my opinion, is most beautiful of many bridges of St. Petersburg ! If you take double decker bus tour they will tell you all about it!"
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Have to visit...!. Super mooie, good angle for shooting photos and sight seeing should on your list! Easy to work from to the centrum, many shops, cafe and restaurants surrounding."
        }, 
        {
            "index": 140, 
            "rating": "3", 
            "review": "Great sculptures. The horse and man sculptures on the four corners are impressive and make great pictures. The view from the bridge along the river is great and anyone walking in Nevsky P is advised to see it. (It is only about 50m form the Faberge Museum)"
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "The Opening Bridge.. I am not so sure about this Bridge, but the is a Bridge which opens up on either side, like the Bridge in London, to let the Sea traffic pass by. If this is the one, it opens past midnight. In June, it is a sight, because you still have daylight till 01.00 hrs. The bridge opens up slowly & with absolute precision. Hope it is the same Bridge I am talking about."
        }, 
        {
            "index": 142, 
            "rating": "4", 
            "review": "On Nevsky Prospekt, can't be missed!. The bridge is situated at a beautiful part of the river, and each corner depicts a man with his horse, which is steadily rearing out of his control. Interesting to see, highly recommended"
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "Impressive sculptures. Impressive bridge with impressive sculptures. These four sculptures at each corner of the bridge ar worth while seeing"
        }, 
        {
            "index": 144, 
            "rating": "3", 
            "review": "Not as spectacular as advertised. We strolled along Nevsky Prospekt, and as we enjoyed the four sculptures, we didn't think they are as spectacular as to deserve to be the 10# ranked attraction in the whole of Petersburg. So I would not recommend to go here if it takes quite a detour for you, but if you happen to be around, it is quite nice."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "a thing of beauty is a joy for ever. All four sculptures are very impressive, but especially the sculpture on the North West corner is an absolute master peace and a joy to look at."
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Living history. Well...as someone who studied Russian history, it was interesting to see the frozen river and realize that this is where Prince Yusupov and his friends tossed Rasputin's body after it was almost impossible to kill him by gunshot and poison."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Part of a great open museum. The Anichkov Bridge as a bridge in Nevsky Prospekt absolutely worth a visit.I visit this bridge for several times when I stroll in the Nevsky street in long Saint peters burgs days,with beautiful restaurants,shops and sits around."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Another must!. This is an experience.. watching how the bridge open! You can drive with your date or loved ones, and while waiting under the moon so romantic, you will see how this bridge opens. Its another must experience for us!"
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "Anichkov Bridge. Bridge is over one of the canals (I think) along Nevsky Prospect. Bronze horses (each different) on 4 corners. Nice architecture on both sides of the street."
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "Dramatic art - in the midst of one of the most bustling streets in Russia. The four statues depict men taming horses. The artistry is superb, and each conveys a dramatic vignette. Great photo op - just be sure to use common sense and don't step into the busy street. While you're there, stroll around Nevsky Prospect - an exciting street, with a lot of history. The Fontanka Canal is worth taking time to view, as well."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "4 Bronze Horses. on the 4 corner posts, in various stages of being trained/broken. The bridge is very near the Imperial Cavalry Riding School, somewhat reminiscent of Vienna. An attractive bridge in my favourite Russian city."
        }, 
        {
            "index": 152, 
            "rating": "4", 
            "review": "Place of interest. That's a monument. Very nice fugures of a man and a horse, 4 pcs., by the side of the bridge being a part of the central avenue. Hard traffic all around, that's true, noisy. If you have a walk along Nevsky Prospekt, have a stop) Nice fotos."
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "Great structure. This bridge is certainly spectacular. Except for the traffic but you can walk over to admire. The view from the bridge in the evening is great"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Horse riding across !. This is a crazy busy,busy city...bikes on the pavement and petrol fumes from so may cars...on crossing this beautiful bridge..along came a horse being riding in the traffic rush hour .,,calm and magnificent .,.forgot to mention it was on the pavement too !"
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "do not miss it. One of the famous view point on Nevskiy prospekt. Also itself is spectacular object for tourist's sightseeing, but in addition you cal kook from both sides of this bridge to attractive view to Neva river."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Anichkov Bridge. We viewed this bridge during our river cruise. It is one of the first bridges in St Petersburg. The statues of the horses and men is the first thing one notice - The Taming of the Horse."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Admire the statues of the four Horses. at each Corner of the Bridge. And the spectacular views you have in the four directions. Surely one of the most beautiful bridges (around 400) in Town."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "So many bridges. I don't think I would ever get home safely if I was left alone to wander. There are so many bridges I would be lost. They are all built with great architecture and skill. Fascinating to see."
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "A well known site along Nevsky Prospekt. This bridge over the Fontaka River, recognized by the sculpture of horses at each of the four corners of the bridge, affords a great view of the river and the many palaces along the river's embankment."
        }, 
        {
            "index": 160, 
            "rating": "4", 
            "review": "Walk past this bridge to have a good look. As with most bridges, it's not worth a special out-of-the-way trip to visit, but worth plotting a route that goes right over (or under) it. It's located close to the middle of the Nevsky Prospect, so chances are that you'll have to pass it by anyway!The bridge isn't an attraction as much as the 4 statues, 2 on each side of the bridge - the 4 stages of taming of the Horse.One of the 4 pedestals has damage on it as a result of WW2 bombings (the other three were fully restored post-war), as a memorial of the damage inflicted on the city."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "The statuary is incredible. Passed under and over this bridge and we still cannot fully grasp the artisanship that created it. Breathtaking!"
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Another place you must visit in St.Petersburg. Another place you must visit in St.Petersburg: one of a number of main symbols of this beautiful city!"
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Special Bridge. We crossed this bridge often on our 2 day tour on the Nevesky Prospect. The 4 stages of taming a horse are very realistic, a great landmark"
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "The four horsemen. These statues are so detailed. You can see the veins of the horses, the fur on one of the coverings, and the hair in the manes and tails. So well done. We loved looking at them."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Architectural highlight of Nevsky Prospekt. Anichkov Bridge is one of the architectural highlights of Nevsky Prospekt. The bridge was built by order of Peter the Great and named after its engineer, Mikhail Anichkov. The most striking decorations on Anichkov Bridge, the Horse Tamers were sculptured by Pyotr Klod. Out of 342 bridges in St. Petersburg, this one is the world's most renowned for his sculptures and beauty!"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Nothing like this in Paris. As a lover of the many bridges crossing the Seine, I have to say that Anichkov is in a class of its own. The iron work on the bridge is elegant and the four horse and rider sculptures placed on each corner are dramatic and impressive."
        }, 
        {
            "index": 167, 
            "rating": "3", 
            "review": "Not sure what the fuss is about. Walked to the bridge and not really sure what we were supposed to get from it, nothing special but needed to get to the other side of the river."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Beautiful bridge!. This bridge must be included in Nevskiy Prospect promenade! Being not so big it's beautiful in its architecture and of course horse sculptures...by the way You can see the same sculptures in Napoli (from 1846!:)) not so far from Angevin Castle - it's the gift of Russian emperor Nikolay I to King of Sicilia for hospitality of Russian empress during her Italian voyage:)"
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "Pretty crowded but gorgeous. One of the must see places in SPb. Basically in the center, it won't make you deviate from your route to/from Nevsky."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "This bridge is so unique. Did you know that St Petersburg had the most bridge city in the world,you go anywhere ,you just need to cross the bridge."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Pure history. This bridge, the first over the Fontanka River, is another fantastic opportunity to enjoy Russian history. While the fridgid winds blew around us, the driver stopped right off the bridge so we could walk on it and soak in the cold, horse tamer sculptures and sights."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Meet the city. The bridge is a pert of Nevsky prospect, where you can see all the city styles and fashions. At the same time you can study the history of sculpture, watching lodt's equestrian statues and consider going on a bout trip from under the bridge!"
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "special. Our guide driver drove over the bridge very slowly I could imagine the hooves of long past horses and fine carriages"
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Horses making visits. The horses and their handlers have made the rounds over the years. But their prominence as a landmark of this beautiful city are well deserved."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Beautiful day and night. See it on your day bus city tour and at night when it is lit.I recommend the bus/boat combo night St. Petersburg tour. You can see at night the places that are not accessible during the day due to traffic jams. Also with special light effect it is so beautiful and magnificent. The bus is very comfortable. The tour is very well guided and organized, includes a stop for hot meal at authentic Russian restaurant with good quality food."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Bridge with hidden history. We saw this bridge from above and below, the sculptures are magnificent,and it's place in the splendour of Nevsky Prospect is justified."
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "a bridge with \"hidden\" history. the sculptures of the horses are so detailed they could be running away any moment. And if you look very carefully, you'll find the head of Napoleon somewhere well hidden at a not so nice place :)"
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "Take these horses in on a stroll or boat ride on the Fontank River. This is a safe and beautiful area to walk along both in the day and at night. These four \"Horse Tamers\" sculptures have become iconic in St Petersburg on the four corners of this bridge. Something you should definitely see. And take the Canal Tour from here if you have the time, it is like being in Venice, Italy! Read more at my blog: www.mytb.org/kelleygirl"
        }, 
        {
            "index": 179, 
            "rating": "4", 
            "review": "landmark. looks special at sunset. During day, very busy, actually on the crowded side. Beware of pickpockets!"
        }, 
        {
            "index": 180, 
            "rating": "4", 
            "review": "Nice bridge. You have walk over this bridge if you are wandering along Nevski Prospekt, it is a good meeting place because of the 4 horses which adorn each corner of the bridge. If you are a coin collector, you can buy a minted coin of each of the horses (about US$80) from the Mint Shop at Peter the Great's Castle."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "One of the nicest bridges in St Petersburg. This one is definitely worth a stop while walking on Nevskiy Prospect, four different sculptures on each corner, which are supposed to symbolise a man taming an animal. Out of hundreds of bridges in St Petersburg, this one is the most memorable!"
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Wow!. This is my favourite landmark in St Petersberg! Four incredible, enormous black horses, each accompanied by a male figure are so life like and vibrant that you expect them to leap into life! Every vein is caught in time, each strand of the mane! As a huge horse lover and rider I was blown away by these statues and barely noticed the ornate railings on the bridge until possibly the third or fourth time we crossed. The whole bridge is a work of art! Don't jus walk over it - enjoy! I only discovered later that they are called the Horse Tamers."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "To feel like Anna Kerenina...don't forget the fur hat!. Anichkov Bridge is a pretty darn cool site, and experience.It's a quintessentially Russian, and iconic in feeling to walk across it, look at the sculpture, see the buildings at either end. It will bring to mind every Russian book you've read or movie you've seen.These folks knew how to show off their stuff, and how to make stuff to show off! Even though much of the iconic buildings, bridges, and monuments are in disrepair, they are still quite visually oowerful, and impressive. Bring your open eyes, your eye glasses, and yr cameras!"
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Beautiful statuary on th bridge and very intersting history. As bridges go, it's nothing special, but, the statuary and railings that decorate it are very beautiful, well worth taking some time to study them.From Wikipedia:The Horse Tamers The Horse Tamers, designed by the Russian sculptor, Baron Peter Klodt von Jurgensburg. They rank among the city's most recognizable landmarks. The theme derives from the colossal Roman marbles, often identified with the Dioscuri, prominently sited on the Quirinal Hill, Rome. Guillaume Coustou's baroque marble horse tamers for Marly-le-Roi, the Chevaux de Marly, were resited at the opening to the Champs-Elysées, Paris, at the Revolution. The St Petersburg sculptures have an interesting history. Prior to 1851, when the definitive versions were installed in the bridge, Tsar Nicholas I had given two of them to Prussian King Frederick William IV in 1842, and the other two had been sent in 1846 to Naples as a sign of gratitude for the hospitality shown to the Tsar during his trip there (see here and here). \"Petersburg lore tells of Peter Klodt's death immediately upon embarrassing discovery that tongues had been omitted on two of the four sculptural horses\"[2]. Another urban legend has it that Klodt depicted his powerful enemy's face under the tail of one of the bronze stallions. In 1941, during the Second World War, when the bridge came under heavy fire from German artillery, the sculptures were removed from their platforms and buried in the nearby Anichkov Palace garden. The bridge suffered serious damage during the war, but has been fully restored. As a memorial, the pedestal of one of the statues retains the effects of artillery fire, with a plaque explaining this to passersby. Prior to the tercentenary of Saint Petersburg, the statues were removed from the bridge again and underwent thorough restoration."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Outdoor sculpture gallery. Real art on the main avanue. The 4 horses of Klodt by Anichkov bridge make Nevsky avenue a galery of art. The bridge is surounded from various sites with great private palaces."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "So amazing to see it open. We took a boat at 12.45 to see the bridge open up. It was very special indeed, not very dark outside. The incredible structure opening up was a vision that I will never forget!"
        }, 
        {
            "index": 187, 
            "rating": "3", 
            "review": "Special at 2am. Between 1:30 and 4 in the morning the bridges of the Neva open to let the tall boats through. The bridges are covered with lights and make interesting photographs especially in July when it doesn't get very dark (white nights) and the river banks are full of people celebrating and enjoying the almost 24H daylight."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Can't see them all. There are 400 odd bridges in St Petersburg (which was basically a swamp at the Neva delta when Peter first came here). You can't see them all but have to see a few and this is one of the prettiest."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Historical. You must walk and take too much phptographs. Very central. If you have a cruise tour, it's a good idea to take some photos under the bridge."
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "Anichkov Bridge. Great View with the State hermitage Museum in the background. Excellent"
        }, 
        {
            "index": 191, 
            "rating": "3", 
            "review": "A bridge too far!. Unfortunately it was pouring rain the day we walked out to this bridge and whilst the sculptures were interesting I'm afraid it wasn't worth the walk out to it, so if it's on your way fine otherwise don't bother."
        }, 
        {
            "index": 192, 
            "rating": "3", 
            "review": "Interesting.... Historical bridge in St Petersburg, build by Peter the Great, has 2 horse sculptures at each end of the entrances. There is also beautiful cast iron railing alongside across the bridge."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Thees tree beautiful statues two on both side of the bridge ower the canal is worth to check up!. The sculptures are made buy the famous sculptor Mikhael Cloth von Jurgensburg, and for me its something especially because he was a grandfather to Jean Sibelius wife Aino Sibelius, and her brothers the painter Eero Järnefeldt, the kompsiteur Järnefeldt and writer Armas Järnefelt. All of them work in Finland."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "right near Corinthia hotel. Superb view up and down the river. Beautiful statuary."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "One of many. So many bridges with so many incredible views of the city. The four horsemen and the history of the bridge make this one you want to spend a little time visiting."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Must See. Centrally located, lovely, historic & free. Its colloquial name is the 16 Ball Bridge. Beware of gypsies in the warm months."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "What a beautiful Bridge. We visited in February when the river was frozen over. A lovely bridge with super views over the city."
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "The bridge, which keeps the history. It is a small bridge above Fontanka with 4 sculptures. You can see the damages from bombs os World War II on one of them."
        }, 
        {
            "index": 199, 
            "rating": "3", 
            "review": "nice bridge. Its hard to get exited about a bridge in St. Petes as there are so many . this is a nice bridge with the horses on each end and in a good area to visit."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Stunning. I walked across this bridge several times a day, and also saw it from the other side by passing underneath in a boat trip. Must do!"
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "Interesting bridge with an even more interesting story. While not a lot of people specifically visit bridges, in St Petersburg it's hard to avoid them. In a city of well over 300 bridges, the Anichkov bridge is worth a visit to see the beautiful horse sculptures at each end, and admire the view from the bridge, which anchors one end of the most visited part of Nevsky Prospect. It's worth starting here with the oldest bridge across the Fontanka before walking up to the Admiralty/Winter Palace at the other end of the major street.The bridge is quite lovely, of course, but we stopped because of the story associated with it -- the sculptor, annoyed with continued demands from the tsar and the workload, carved the face of his patron in the groin of one of the horses. Probably an urban legend, of course, but it certainly had us peering quite rudely at the statues!"
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Sculptures of the Anichkov bridge.. The Anichkov bridge is famous for for groups of horse tamers in its corners - all different and sometimes they say that they feature 4 stages of taming of a horse by a man. All the statues were made after models and cast by Russian sculptor baron Peter Clodt. The present design is not the genuine. For the first version baron cast 2 identical couples (one of them is still in its place in the western side, closer to the Admiralty) - but due to their high artistic quality tsar Nicholas I presented one couple to the king of Naples (where they can be seen nowadays near the Royal palace). The sculptor repeated the couple - which was later presented to the king of Prussia. Then the sculptor getting tired of repeating himself produced 2 new groups now decorating the eastern side of the bridge. Their main difference from the first groups is in lack of horseshoes. After the recent cleaning all the groups which were hidden during the Siege in 1941-44 in a nearby garden look brand new."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Small museum sculpture and a pig-iron cast decor. Anichkov Bridge is the most beautiful bridge through the river Fontanka. It is a small museum sculpture and a pig-iron cast decor under the opened sky. Anichkov Bridge is one of cards of St.-Petersburg. The bridge is named in honor of the first engineer Michail Anichkov who has constructed the bridge. Present stone Anichkov bridge has been constructed in 1841. The bridge is well-known for the sculptures \"Taming of a horse\" which has molded and remarkable sculptor Peter Klodt has cast. The bridge has a magnificent pig-iron lattice. The pig-iron openwork lattice is in a very good condition. A lot of people visit Anichkov Bridge along the Nevsky Prospekt, admiring bronze sculptures of tamers. Very beautifully Anichkov bridge against a Beloselsky-Belozersky palace looks."
        }
    ]
}