{
    "category": "St-Petersburg", 
    "entity": "The-Bath-Block", 
    "avg_rating_stars": 4.7254901960784315, 
    "review_count": 204, 
    "rating_stats": {
        "poor": 0, 
        "average": 8, 
        "terrible": 1, 
        "very_good": 36, 
        "excellent": 159
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "4", 
            "review": "Opulent and ornate. Bath Block is also known as the Peterhof State Museum Preserve. It consists of the Grand Palace, the lower garden, the fountains, and beautiful gardens. You will be amazed by this place. Everything about it speaks volumes about the way the Tsars lived. It has to be seen to be believed - truly regal and magnificent. The opulence will leave you wondering whether you were in a dream. The gardens are very well maintained and very beautiful. The fountains are something else. The Grand Cascade and the Samson fountain are the main fountains. They look grandiose, and are beautifully decorated. The fountains are switched on in the morning – and you will love the spectacular show. The fountains work without the use of pumps using instead the pressure caused by the height. A beautiful canal connects the palace to the sea. The Tsar’s visitors would then come up to the palace via this canal. Whichever way you look – it is simply stunning. The gardens resemble the French style. The beautiful flowers create a wonderful mosaic of colour.This is a must see attraction – and I thoroughly recommend it. "
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Imperial baths - spark your imagination. These are the bath houses for the imperial family. The decorations are outstanding and impressive. The quirkiness of the shower for the Czar, the opulence of the accessories for the Czarina. Definitely work your time!"
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Stunning!. Don't miss it! You can take a boat from St. Petersburg (Close to the Hermitage) and go to Peterhof Palace. Give yourself enough time. When you get there you have to buy a ticket to enter the Bath Block and a separate ticket to get into the palace. The interior of the palace is beautiful, but I personally think the gardens are more impressive. Nevertheless, if you are there, don't miss the opportunity to visit inside and have your own opinion."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Stroll and take time to imagine how Peter the Great felt there!. We took the hydrofoil so to see St.Petersburg from the Neva. We had very good weather with a lot if sun when arriving in Oeterhof, which makes the place even more shiny. There are so many fountains to discover so stroll and enjoy. We decide not to visit the Palace itself but took the little train to go to Alexandria Park. We liked it because Peterhof involves a lot of walking so sitting and enjoying the landscape was nice. Comments only in Russian but with a good guide book you can figure out what it's all about. The excursion costs 300 RUB less than 5€. Each time you want to enter a pavilion you need to pay. So choose what you exactly want to visit. Personally I found the gardens so enjoyable. There's a kind of seashore. Ah and if possible be there for the start of the fountains. This happens at 11 am. It's crowded so be there early."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Intimate Look at Royal Lifestyle. It was different from the ballrooms, formal bedrooms and public spaces of the grand palaces. The smaller, more intimate spaces used for spa treatments, baths and showers were elegant and oppulent in their own way but much more human and approachable. It is easy to understand why Peter the Great preferred this part of the Peterhof to the grand palace itself."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "The Versailles influence is undeniable and beautiful. The fountains, the park, the trees are all reminders of the influences of Versailles. I believe this is even \"grander\" because of all the gold statues. On a beautiful day this must even look more spectacular but alas our day there was cold, windy and wet."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Incredible. This is a place where pictures do not do it justice. Go and see it for yourself. It is amazingly beautiful. Too bad the workers here are so melancholy?"
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Astonishing. Go and explore the whole of the Peterhof lower park. Not only the Bath Block and the Great Cascade - all of the fountains worth seeing, some of them are real masterpices."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Out of this world. The fountains are fantastic, just out of this world. Sheer beauty, i am quiet sure Elisabeth and Catherina needed to raise taxes to finance all this!"
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "most beautiful set of fountains in Europe !. I Think it is a most beautiful set of fountains in Europe ! In 10 AM Fountain streaming beginning with classic music composition ."
        }, 
        {
            "index": 11, 
            "rating": "3", 
            "review": "luxury bath tub. not a great attraction but shows the royal style.part of the summer palace complex,with a very nice park around it outside.\nthe fountains in the indoor bath is designed as a predecessor of luxury showers."
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "Historic Site. Historical buildings and churches are centuries old. Beautiful site to visit. The artifacts are simply remarkable."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Small part of Peterhof, but very interesting. My wife liked this better than Peterhof itself. It was very interesting to see what lengths people had to go to to do what we take for granted now. But some if it was for schmooze time with the Tsar, of course!"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Looked amazing. This place was beautiful for the 5 min I saw this before the skies opened up and drenched our tour. Really wish we could have had good weather for this one."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Refreshing on a hot day. Georgeous place with amazing fountains is best enjoyed on a hot summer day. Fountains start working on 11 a.m. with nice music and lots of tourists. Definetely worth visiting, also with kids."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Awesome fountains . To me the Peterhof palace was probably a little less lavish than Versailles, but the magnificent fountains outside makes it difficult to choose between the two."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Gorgeous, gorgeous, gorgeous. Far more interesting than Marly, what money and exquisite taste could buy. Admirably and lovingly restored. Worth a trip to St Petersburg all by itself. GO!"
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Beautiful. Big and crowded, see more if you come by train or bus . Ferry takes you to lower garden and you cant access to upper garden from ferry access unless buy one more ticket to re enter or come by ferry leave by bus."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "love it. Absolutely love it. we were in a grey day but the glow of sculptures and all the fountains were \"details that made the difference\". And we played in the Tricky road :) It was a great walk."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Peterhof Park. This is the acreage around Peterhof. There are incredible gardens that you must see. It was incredible. We were there in early May and the tulip gardens were in bloom."
        }, 
        {
            "index": 21, 
            "rating": "3", 
            "review": "You need a guide or learn Russian. I have a mixed feelings about my visit to Peterhof Palace grounds. We arrived with a boat to save some time with commute. Boatride was ok, nothing too special. We were told that this would be the most picturesque way to travel to Peterhof but you basicly see mostly sea and some shipyards. You arrive straight to the lower garden (we didnt know that before hand) so you have to buy a ticket straight away to get off the dock. There are no info in English and the staff also communicate mainly in Russian so if you dont speak and/or read Russian you will probably regret that you didnt get your own guide at this point. We bought a ticket not knowing what it would include. We rushed to the castle and saw the massive lines. Line to the ticket office (yes you need a separate ticket to get inside) and line to the castle. They have different opening hours for individual turists (one at 12-14 and other after 17 something) and those who belong to a group. We decided to skip the castle in the end due price, lines and time issues. After that we realized that because we arrived with a boat straight to lower garden, we couldn't visit the other side of the castle at all! If you leave the gates you cannot return without buying a ticket back to lower garden. Confusing and annoying. We ended up going around The Bath Block and enjoying the beautiful fountains with golden statues. The place is lovely and garden is really worth seeing. And the place is huge so even without visiting the castle we spended quite a lot of time wondering around.Wear good shoes, take the whole day and have a guide or go with a guided group. Tours might feel expensive but this is not a cheap destination even if you go by yourself and its not turist friendly for foreigners. Or learn Russian, prepare yourself with rubles and be on time for the lines."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Pure beauty. The palace will remind you of Versaille, but, the gardens are magic. Go with good and comfortable walking shoes (:"
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "beautiful!. So worth the trip there. Everything imagined and more. Grounds are amazing! Be prepared for lots of walking, and not really equipted for those with mobility challenges. Don't miss for an history adventure."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "amazing. It is a beautiful place to visit with family or friends. The best way to enter the park is to come by fast boat from the center of Petersburg, it takes about 15 min. There are plenty of places to have some fun with kids, but also to enjoy the beauty of sculptures. I have not noticed any proper place to eat inside of the park, but very close to it, in the city, you will find something. If you are looking for a cheaper way to get back to Petersburg, try a bus, it will be like 6-7 times cheaper than a boat, but much longer."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Nice garden, no information signs. It is a very nice garden with beautiful statues but it is so hard to find a helpful sign for restrooms."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "amazing even turned off. we went when they had already turned the water off and were preparing everything for the winter months. was still great visit a must see even with the water off, but would love to see with it turned on . we will just have to plan another visit soon"
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Amazing. A must see in Russia,it is unbelievable to see all the beauty and all the different fountains and amazing art works"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Russian History at it's best.. A short drive out of St. Petersburg but well worth it. Peterhof reflects historic class and style. I would suggest visiting during the Spring or Summer to enjoy the numerous fountains and walk down to the sea. This is a must visit if visiting St. Petersburg which is one of my favorite destinations."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "A visit to Peterhof. We enjoyed a short stop here as part of a day tour while cruising the Baltic on Oceania Cruise Lines. Definitely recommend taking an organized private tour - SPB Tours was wonderful and took us to smaller places like this which not everyone gets a chance to see."
        }, 
        {
            "index": 30, 
            "rating": "4", 
            "review": "October visit to Peterhof. Buildings and contents are excellent but if visiting in October it is worth noting that the fountains have been drained so gardens are not at their spectacular best. Interiors are amazing and good descriptions in English. Easily accessible from central St Petersburg by metro and bus (overall 100 rubles for entire trip)."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "A nice city escape visit!!. Situated 45 minute journey Southwest of St.Pt.berg town. The palace itself had 3 section. The first section is a main museum building where shows all Peter Kings and Queens and all his kids bed chamber/ Living room / Dining room / working area etc. The 2nd section is upper garden where started from car parking and whole plantation behind the building use to used by King Peter in summer time when horse riding and stocking here.And the last section is the lower garden where all golden fountain has design descending as staircase and the lowest part built as canal dug direct connected to Baltic sea use to used by King Peter when paddle boat to here.Tips: There are couple of restaurants (Chinese/Russian food) open services in Palace."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "An Excellence!. Unbelievable, an adventurous journey through heaven in this museum, an institute full of rich art and craft, a real gold melts the heart to feel like a real king."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Beautiful- hundreds of fountains and park.. Don't miss the gorgeous fountains that start the same time every day as they play the cities anthem."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Breathtaking. Make sure you go!!! The palace and the surrounding gardens are a sight to be seen ..We took the boat over which is really the only way to go .. easy .. there are a lot of stairs to go to the palace so not easy to navigate."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "no wonder peasants revolted. included as part of greater tour; information overload; sensory overload; security everywhere; difficult to take in everything"
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Saw it done it. It is the summer palace created by Peter the Great and profusely decorated by his daughter Elizabeth. The place is kind of off site St Petersburg like and hour driving. The palace is nice but sometimes the exaggerated load of gold is just too much. The palace itself it has sevreal rroms all very well maintained and protected. The parks between the Palace and the Baltic Sea are-very nice too with the original irrigation system"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Will not disappoint. My husband and I had to decide between Peterhof or Catherine's Palace as our time was short. Even though I was disappointed we couldn't go to Catherine's Palace, I am so glad we got to Peterhof. We got there early and did go through the palace, but it wasn't as amazing as the grounds. The tour of the palace was basically a moving line and there was no time to really take in the rooms. If you went through the rooms at the Hermitage, I would recommend not going through the Palace at Peterhof if the lines are long. Also all he sights are priced \"a la carte\" So you can save some money if you don't go through the palace. The grounds are amazing enough!"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "must see, very crowded. In peak tourist season buy your tickets from internet in advance. But Entrance tickets to the Grand Peterhof Palace can only be purchased on the day of your visit at the ticket offices. The Grand Palace is very impressive and should be visited. However it is very crowded, in each room there are at least 20-30 people of organized tours, sometimes you have a big difficulty to go through. The Marly Palace and the fountains should not be missed. You can easily spend one full day at Peterhof. To gain access to Peterhof take hydrofoils departing from Hermitage embankment."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Great gardens impressive fountains. This place has very beautiful gardens (in the end of August) with a great variety of plants. The fountains are very impressive, like Tivoli in rome and Versai near Paris, and even more impressive. It is great to hang around the gardens and the palace. You can get there by bus or by boat. Very nice outdoor activity near st Petersburg"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Paris and Vienna on display in Russia. The Peterhof is one magnificent display of Western splendor, deep in the north of Russia. The fountains are stunning. The beauty of the site is only dampened by the realization that this property was destroyed by the Nazis and taken down to the skeleton. The fountains were redone first and what you see in the Peterhof is a reconstruction of the site, based on photographs. Yes, it is gorgeous. It is also around 50 years old, not 300 years like the rest of St. Petersburg."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "A Palace which must be visited. A beautiful Palace which must be visited. Many tourists though. The best way to get there is by hyrofoil which leaves every 30 minuits. Traffic in St Petersburg is terrible"
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "Nice palace, great fountains.. The palace needed complete restoration after WWII and many items are not original. However,they are nice period pieces. The fountains, modeled after Versailles, were wonderful."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "A must to see if in Russia. This was a great tour, They have done a great job re building the halls and buildings, and then fitting out with furniture and the likes of yesteryear, There is plenty of gold to see, plus plenty that they still would like to have gold leafed, and I am sure it will come as they get more money or donors !"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Spectacular fountains!. Arrived by hovercraft - beautiful walk through gardens to display of fountains - lovely experience! Left by another exit, so did not have to retrace steps!!"
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Beautiful. Beautiful gardens. You need 3+ hours to walk round it. The only thing we weren't told was that you have to pay to get in, we only found out when we arrived. If you want to go into the palace you have to pay for that separately. When you pay for the hydrofoil you're only paying for 1 way but keep your ticket and you can get a discounted return fare."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Magnificent. Half day tour go with the hydrofoil pretty gardens nice palace,a must see.better go with a guide to enjoy."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "It's the Russian version of Versailles but only better.. You must go there to see for yourself. It's the Russian version of Versailles but only better. It's about an hour travel either by car or by Hydrofoil(fast boat ride running back and force between St. Pete and Peterhof). Lots of gardens. The lower garden by the Gulf of Finland is one of kind. Take a stroll by the shoreline, wow!"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "All on a very human scale, no grandeur here, just comfort. Located in the lower gardens, this is the bath house and resting place where the czar and his family and/or guests could relax, away from the formality of the court. Very nice sauna landscape! Charming recreation of the kitchen in that period, too. Be sure to visit the Chinese garden in the back, too - although it gets its name from just a few porcelain stools, it is very nicely kept."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "A 'must see' while in St. Petersburg. Stunning architecture, beautiful grounds and the fountains that mimic Versailles are amazing considering there are no pumps or hydraulics operating them! The fountain ceremony at 1130 hrs during season is fun to watch. Try to see some of the 'secret' fountains or the 'practical joke' fountains throughout the grounds.Some reviewers suggest to travel there by the high speed boat, but be warned that during inclement weather they may not run. If you are on a schedule and planning to see Peterhof, the drive is only 45 minutes.We were on a private tour with SPB tours ( having arrived with Oceania Cruise lines) and during our ride to and from Peterhof it was a great time to discuss Modern Russia with our guide and driver.We also used this day to visit the subway en-route from the city to Peterhof, and then to Catherine's summer palace and the Amber Room - another must.A long day, but it was worth every exhausting minute!!"
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Great park!. Use the boat from the small port near Hermitage, beautiful trip just for 30 minutes. The gardens are excellent. Necessary to see it! For the way back to the city it is interesting to take the bus and metro, because you can see quite interesting suburb of Petersburg. It is easy, buy the ticket in the bus just for 58 rubles."
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Beautiful but Crowded. We went to Peterhof with a tour group. It was very beautiful, all in Baroque gold and white, with some original furniture. However the throng of people waiting to go through made it nearly impossible to enjoy what we were seeing because we had to keep walking, walking, walking- never lingering over anything, thus in reflection very little is clear. The gardens were spacious and the fountains spectacular. They were all gravity fed and worth a look."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Excellent. We travelled by catamaran from outside The Hermtage.It takes around 25 minutes and is the best to get there.It has all been said before.The gardens and the uncountable fountains are worth spending the time to walk around before entering the Palace.Once again little in other languages."
        }, 
        {
            "index": 53, 
            "rating": "3", 
            "review": "Pretty Park. Another building for the times of the Tsar's, pretty grounds and certainly worth a wander round, we had lunch in the restaurant, pretty standard fare including the obligatory shot of vodka"
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Beautiful Gardens. Well worth the visit if you are horticulturally-minded, and the gilded fountains are mesmerising.......also one is able to catch a 'Meteor' (Famous 1960's Russian hydrofoils) from the pier, back to the city centre."
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Wonderful half day trip to this UNESCO World Heritage Site. Our tour began with a hydrofoil trip to these wonderful gardens. Our knowledgeable guide filled us in on the interesting and chequered history of the palace and its fabulous gardens. The fountains were truly splendid - and we were fortunate enough to visit on a perfect August day so I am sure we experienced Peterhof at its very best.Inside the palace was interesting the rooms opulent and baroque with fantastic views over the gardens and fountains. Everywhere was very crowded which was something we came to accept during our two day tours of the key St Petersburg's attractions.Crowded or not the visit was amazing and we thoroughly enjoyed it."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Superb. The palace was originally built for Peter the Great in the early 18th century but was remodelled for his daughter Elizabeth around the 1750’s. I have been to the Peterhof a long time ago, but this time we appeared to go round a different part. Parts are closed for refurbishment. During the war the Germans more or less destroyed all the precious internal decorations, and I suppose refurbishment is a never ending process. However the lovely walk around the gardens was a new experience with lots of flowers, 150 fountains and 4 cascades, running down to the Gulf of Finland with superb views"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "History!. This was amazing place, gardens were lovely and a lot of the statues around the area were buried to hide them from the Nazis then the locals drugged them up after the war as they rebuilt the estate."
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "Unique in the world.. A must see. Shocking to learn that is was destroyed during the war and had to be completely rebuilt."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "The home of the man who changed Russia forever. This site contains the various high and low buildings used by Peter the Great - he preferred the little cottage down by the sea to think and study and the upper buildings to entertain others - a single man changed a backward country to a modern nation - visiting his home is a must when in St. Petersburg. Many fascinating things about the site (e.g., burial of statues before the Nazis arrived) and the fountains are only gravity fed..."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "a nice exhibit if you got enough time around. while visiting peterhof estate there is so much one can visit. this one is definitely worth it when you got enough time. it's not the major splendour like in the main palace though, but just as exquisite from the exhibition."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "the water is still running. it still functions.\nterrific to see the water running out of and over that beautiful design of imperial times."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Put this place on your list.. Beautiful Gardens! A must-see. Wished we had had more time but we were on a tight schedule and the guide kept telling us it was time to go."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Simply Amazing!. This has to be one of the most magnificent places in the world - even better than Versailles in my opinion."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Beautiful palace and grounds. Some people had told us it was only necessary to see the gardens at Peterhof but with a guide we found the interior was interesting as well. Lovely gardens. Allow at least two hours."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "My favorite tourist attraction.... A lot of \"serfs\" put in a full day's work...but now it is just another example of why royalty enjoys itself...but wow! Don't miss this place."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "The shear opulence of the palace is breathtaking. Fountains are beautiful and played with music in the background.. Our second visit to the Peterhof proved to be as interesting as our first 30 years ago. The lines are very long, and it was 45 minutes before we got inside the building. Worth the wait."
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Beautufl Gardens. Really interesting as with all of this wonderful garden, do not miss it, such colour and texture wonderful photography"
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "A wonderful retreat for the Tsars!. Try to visit on a good weather day as the grounds are as magnificent as the palace and well worth walking along the canal up to the Baltic coast."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Extravagance of a Czar, but you can't take pictures, and they mean it!. Fountains, parks, extravagant staterooms galore. It's a must see, rain or shine! We had a guide to show us around, and help us navigate the large summer home of Peter the Great. I will say, it's sad they don't let you take pictures, and they are militant about it. I took hundreds of pix at the Hermitage, and when I tried to sneak one iPhone pic of a stateroom, I was scolded at, not by a docent, but another guide. Someone tell me why no pictures are allowed??"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "grandeur ..and royalty. oh..... the grandeur is fabulous ...and the fountains in the gardens....crowds ..being summer time...no big bags ,,,no photos....we went by bus but returned by the hydrofoil......"
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "Must see. that's one of the places in Russia that you have to see in your vacation there. shows you the old times and the prestige of the kings and the queens in Russia.\n10/10"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "superb. the garden with this Palace are superb, we arrived just before 11:00 AM ready for the 100s of fountains to start what an awesome memory."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Deserves the trip. Fantastic landscaping. Go there with the hydrofoil (embarquement just in front of the Heremitage), it takes half an hour. The gardens are worth the trip."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Beautiful on a sunny day. The grounds here are well worth a visit and a stroll on a nice day. Might be one to skip if raining or very cold. We toured Peter's summer palace by the shore instead of the main palace. This was great as it was original --one of the only spots not bombed during the war."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Dream fountains surrounded by beautiful gardens. There are no words to describe this fantastic place! It's a dream when you are walking around the grounds admiring the 150 Peterhof fountains, each one of them are so preciously detailed and surrounded by a garden with different color flowers. You need to spend at least a day in this place in order to admire and enjoy it."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Take the Hydrofoil but beware tickets. Buy hydrofoil tickets on either side of bridge behind Hermitage. Standard tickets are 500 roubles each - but, when they run out(for middle and back of boat) they offer \"Business Class\" tickets for the front of the boat at 1500 roubles each. You can also book for return journey but must give the time of the boat on the return leg. For \" Business Class\" seats crew gave free bottles of water & coke only to Russian looking tourists - not others, laughable when you think they could be taken to the cleaners for such behaviour in the west. Strong smell of diesel in boats."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Enough nature to balance the gilt. We took the hydrofoil and had a great day at Peterhof. We had hoped to be there for the opening of the fountains. Unfortunately, we didn't get an early enough boat (and we waited about 20 minutes for the boat to leave.) As a result, we arrived in time to catch the end of the music, but not in time to watch the fountains starting up. If you want to see the start-up of the fountains I suggest you ask specifically about the arrival times.The fountains are spectacular, and walking along the paths to discover them is restorative. I'm sure others will write great descriptions.I want to mention one peculiarity of the items that require entry tickets. I was particularly interested in the construction and operation of the fountains and there is a \"Fontanes\" area that is supposed to provide explanation. Unfortunately, everything in this building (next to the church) is in Russian. The women managing this area do not speak English. After paying to enter, we were disappointed. Fortunately, there was a young man visiting from Moscow who explained some of it to us. There also is no place to sit while watching the videos or trying to figure out the schematics. You can have a great day here in the gardens without buying an extra admission. If you are suffering from not having a daily dose of Russian Baroque, go tour the palace. There is enough gold and plaster decoration there to explain the revolution."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Don't Miss Peterhof. This is a fabulous place. While very busy, it is spread out which helps. The fountains are marvelous. A visit through Peterhof is a must. We enjoyed this museum the most of the three main tourist attractions: Hermitage, Catherine's Palace, Peterhof."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Amazing park, not to be missed. A must to visit,but entry got very complicated,arrived 1.45 in the queue, to be told only Russians allowed in and we had to wait until 2.30.this was not very clear as the staff could only speak Russian.The Russians got their tickets from an outside booth and we got ours inside the museum which were dearer than the Russian tickets!we thought we might get an English travel guide,but we didn't but could hire audio handsets for around £5.once inside it was stunning."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Peterhof Museum and Palace and gorgeous grounds. What an experience to see this beautiful palace and grounds which were the summer residence of the czars in Russia. They were built very similar like Versailles in France and Schonbrunn in Vienna - a real \"must see\" for young and old."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "My Favourite St Petersburg Park. Beyond stunning. Amazing park, fountains , GILT!!! Church, palace and gardens. Fabulous views of Gulf of Finland. Mon Plaisir!!!"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Peter's Summer Residence. This is an amazing site to see. Walk the gardens and see all the fountains and gold. The grounds are beautiful."
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "Stunning gardens, fountains & vistas. Took a leisurely stroll around the gardens in the sun.....managed to avoid the crowds which can be huge!"
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "Worth the trip on the hydrofoil from central St. Petersburg. The Peterhof Museum is a nice change of pace from the bustling streets of central St. Petersburg. We took the hydrofoil boat to visit and it was very nice and informative. Definitely worth the trip"
        }, 
        {
            "index": 85, 
            "rating": "3", 
            "review": "Way too lavish, almost frustrating. The Peterhof Museum has more gold than I have ever seen anywhere, it's nice to start with but then makes you realise how some of the country is in poverty yet they have buildings with more gold than a Federal Reserve! Worth seeing but nothing special"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Gardens are accessible, but there is a steep incline. We arrived by canal boat from downtown, and I had no problem with a wheelchair. The gardens and the stories from our guide (TJ Travel) added dimension. Beware the incline from the gardens to the parking area is quite steep and is likely a problem for all but the strongest wheelchair pushers."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "The Russian Versailles. This is an absolutely gorgeous attraction. The grounds are exceptionally opulent, and they are very reminiscent of the gardens are Versailles. As soon as you arrive, the resemblance is striking, but I found Peterhof to be more interesting and accessible. Built originally by Peter the Great (although he didn't often stay here), the gardens are loaded with fountains of all shapes and sizes, and Peter showed his lighter side by putting in many trick fountains to soak and bewilder unsuspecting visitors. I found the cascading checkerboard fountain particularly interesting.The building itself was decimated during the war, but the Russians had the forethought to remove most of the important artifacts in advance of the siege and shipped them to Siberia for safe keeping. Following the war, the building itself and the contents were redone to exact, pre-way specifications. They did an amazing job. Inside and out, this place is awesome.Plan for a long visit, as you'll likely need to take the hydrofoil from St. Petersburg and spend a few hours to just get a small taste of this enormous place. Once you arrive, you won't be anxious to leave. There is no way to see it all quickly, so give yourself the luxury of time."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "My favorite destination in St. Petersburg. The outside doesn't tell much of the place. The design is not extravagant, just the yellow color on the walls made it interesting. However, the domes are covered with gold.BUT, the museum inside the Peterhof is thoughtfully arranged and well-presented. It is easy to lose track of time as you walk from one room to another.The part that you shouldn't miss is actually the beautiful garden with fountains. simply beautiful.try to see the Peterhof from the garden: priceless!"
        }, 
        {
            "index": 89, 
            "rating": "3", 
            "review": "Going for Baroque. Let me start by saying I am not a fan of Baroque. I can take a little bit but after a while....We did two full day tours of / around St. Petersburg. Day 1 included Peterhof amongst other sites, Day 2 included Catherine's Palace and the Hermitage. I could have done without Peterhof. Unless you want the full on Baroque / palace experience, I would skip the drive and this palace.I hated the crowds and the lines, I disliked the utterly mediocre lunch we were served on the grounds - probably what the Proletariat ate while under the boot of Stalin; I enjoyed the gardens, especially the gravity fed fountains.Don't get me wrong - Peterhof is fascinating but if you have limited time in the St. Petersburg area (and you are hitting Catherine's Palace anyway) then I would pass on this attraction"
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Peterhof Museum. Definitely a must do. The museum, like so many others in St Petersburg, is replete with history and artifacts."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Beautiful attraction. It's one of the most important attractions in St. Petersburg.\nEverything is beautiful and romantic especially the beautiful gardens and fountains.\nAmazing gold rooms. Fantastic decoration.\nIt's a must see attraction in St. petersburg.\nI strongly recommend that you have a tour guide to explain more and save you time."
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Beautiful, if not original. Vacation villa built by Peter the Great. The 30-room palace was bombed by the Soviets during WWII (yes, Stalin bombed his own palace to prevent its capture by Germany). Though the building as it stands today is not original, it has been nicely restored. Beautiful lower gardens with elaborate fountains and well-manicured grounds.  You could spend hours strolling the grounds.  Arrive on the 10:00 am hydrofoil and head straight to the palace to beat the tourist hordes."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Great Tourist Spot. We were in town on a cruise ship for two days and toured this establishment with Alla Tours. It is a very interesting museum and you must visit it with a guide, to be able to explain things to you. Of all the museums in St. Petersburg, this was one of the better ones."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Most Amazing Fountains!. Take the hydrofoil from St. Petersburg here...a very fun way to arrive in style...and quicker. Plus...you get to walk up to the palace from the best view. Explore the gardens as there are some trick fountains. Very fun!"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "The gardens and fountains are amazing.. The Peterhof is a must see when in St. Petersburg. The day we were there it was totally packed as the weather was sunny and warm. One of the best parts of the visit was going to the gardens which are lovely and crowded as well. As we were leaving we saw that the line was quite long just to get in to view this amazing place."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Now THAT'S a big splash!. This place is unbelievable! The Great Cascade in the back features more than 80 fountains and 250 sculptures in a spectacular setting. At 11:00 each morning, they are turned on with music to provide an intriguing water ballet. Line up early along the top or railings to get an unobstructed view, because the place will be packed by showtime. Elsewhere, the grounds are beautiful and well-manicured with paths leading in all directions, including along the canal to the Bay of Finland. You will not believe the extravagance and wealth. This place literally drips with excess."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Not to be missed.. Our friends told us we had to visit Peterhof and we are so very glad we didn't miss it. The fountains are breathtaking. The palace is beautiful, but we had to go through quickly because it was so crowded - and we were there on an early entry. If it is possible to go another time of year with less travelers I suggest doing it. But no matter what, don't miss Peterhoff."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Peterho. Lovely site - magnificent grounds and gardens and a restored palace. We got there by hydrofoil from the city - great way to go. Better if you have a guide for the history. Very crowded at weekends"
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "A must see!. Wow! What an amazing place tucked away at the other side of the bay of Finland in St. Petersburg. We were awed by the garden with its statues and fountains. The palace was not too shabby either."
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "Great outdoors. I definitely reccomend going here with a group of people, whether that be friends or young children, and to pick a nice day to go - there is lots of fun to be had outside, so sun is a necessity! Beautiful fountains and a view of the bay of Finland. Leave a whole day to go because there is quite a lot to see. Also I would recommend packing a lunch because it is quite expensive to buy food there."
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "A Dream Land. The Hydrofoil Boat tour can take you from Hermitage to Peterhof in about 45 min. The journey is very pleasant and fast. The Museum is not open on every day. Check up is must.\nIn the Garden you can see the biggest fountain system working non stop. So many fountains ..."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Tremendous experience. Quite remarkable building and tremendous collection - the set of Rembrandt paintings is probably the best outside the Rijksmuseum. Exhausting - aim to spend a full day at least there, and make sure you book on the internet."
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "Amazing park. I didn't visit the museum, just the park, but it was worth it. The main staircase with a waterfall is impressive and there are other interesting points in the park. It is located 29kms from the city and one good option is taking the hidrofoil (30 mins journey), instead of the bus which takes an hour. If you are visiting, plan a whole morning or afternoon for the visit."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Gorgeous Gardens & Fountains!. We took the high speed ferry over to the Peterhof Preserve and it was magnificent! The grounds, gardens and fountains are absolutely beautiful! There are plenty of benches to sit and relax if you have enough time. Great pictures on a beautiful day in St Petersburg! Be careful of the \"hidden\" fountains:)"
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "Loved the gardens, liked the palace. The palace is absolutely spectacular from both the inside and from the exterior. The guided tour of the inside was beautiful, but because we had been to the Catherine Palace in the morning, became a little too repetitive. Any individual room was breath taking, but after 40 such rooms we needed to get our breath back. The grounds, garden and fountains on the other hand were worth a full day. Luckily the sun was shining, which enhanced the spectacular colours of the palace and the grounds. You are obliged to wear shoe covers as you wander around the palace"
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Gardens and fountains. A must visit from St Petersburg. The gardens are spectacular especially in sunny weather. The fountains are scattered throughout the gardens with the largest and most opulent in front of the palace in the lower garden."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Baths, Fountains, Gardens, Seaside- all refreshing. The engineering of Peter the Great are all in place and quite remarkable. His designs for fountains, his commitment to gardens, jokes and a lovely lifestyle close to the bay, gives insight into this great leader."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Fountains to die for. Pick a sunny day if you can. The best part of Pterhof is outside. The fountains are stunning. Take your time to walk around and drink in the atmosphere."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Small but charming. The museum itself is very small but very stunning. However, the gardens are breath taking. I love it there."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Peterhof is a Must. Definitely worth seeing but get there early in the day before the massive crowds. Fountains don't come on until 11:00 so get there 9:30ish to walk the gardens and be there when fountains start."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Astonishing, beautiful, extraordinary. Fabulous! The queues meant we did not have long to linger, next time visit late April, when it will be quieter, but you may miss out on the glorious summer weather."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Peter the Greatness. History of Russia - do not miss this palace of Peter the Great in Peterhof. Opulence, elegance, richness, gold, art - and the role of this extravagant spending in the history of Russia is a must to all visitors to St Petersburg. It puts Versailles to shame."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Wow, a stunningly beautiful Palace. You can't go to St Petersberg without visiting this amazing Palace and famous fountains. Get a guide as it will be money well spent. Dont forget to look at the building as well as the art and furnishings."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "A Lovely Palace and Gardens. I visited this Palace on the last day of my 4 day trip to St Petersburg. The weather had been only ok but on the last day the sun came out and showed off this palace and gardens in grand style. I was amazed at the extent and opulence of the fountains and grounds of the palace and the interior of the palace and the vistas out to the coast are a wonder to behold. I would recommend a visit to the Peterhof for any visitor to St Petersburg."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "great fountains. go via hydrofoil. its faster and more picturesque, check the opening times of the big palace beforehand and preferably buy tickets online because the queues can be very long. try make it there before 11 am as the fountains start then and to classical music. worth watching"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Peterhof gardens.. Only went around the gardens but they are spectacular with dozens of fountains and statues covered in gold-leaf."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Go for the Gardens .... This place is beautiful, but the single most beautiful thing is the garden .... magnificent beyond words. The gilded statuary in the fountains is almost too much, but very Romanov of the era. Whether you see the palace or not, make certain that you visit the 400+ acres of gardens. But there's a very short blooming season, so plan well."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Try to buy tickets in advance.. The lines to buy tickets are impossibly long. Try to buy tickets in advance, possibly through an agency. It may or may not be possible to buy tickets on line."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "About 25 km out of the city at the gulf of Finland. Beatiful palace and Park, especially the fountains. Take the hydrofoil at the backside of the Hermitage direct to Petershof, 30 min and no witing time for your entrance ticket."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Definitely educational!. An unexpected and interesting insight into a very specific aspect of life as a Romanof in the 19th century!"
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Breath taking fountains. The place is about 1 hour from St Petersburg, you can either take a private tour or if you are more of an adventure seeker you can traverse on your own through metro and bus/train to reach here. The entrance is 750 RUB and additional 750 for audio guide, the guide was of not much use for me personally but make sure to take one if you are very interested in how these were build and the purpose why they were built. Though the ticket grants you to all fountains and exterior of museum, for entering inside of some attractions such as bath house or museum you need to purchase tickets. It is a must see place the fountains are truly breath taking trust me !!!!"
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "Go early.. Go early, or be prepared to stand in a long queue to get inside. The bath block is only one of the tickets. You need to buy separate tickets for each attraction. A lovely walk around the lake is free :-)"
        }, 
        {
            "index": 123, 
            "rating": "1", 
            "review": "We were treated like cattle. From room to room, we were rushed through even though our speaker was broken and we could not hear the tour guide. But another group was pressing it, so we were rushed to the other room. Rude lady bulldogs in every room watching you and tell you to go to the next room. Avoid the Palace-better photos in the web-crowded and not worth it to my mind. Charge almost twice for foreign national and double on top of it for the English translation. What a rip off, stay in the gardens, they are beautiful."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "History. Interesting to see the history........especially to hear the overturn. Too bad so much loss, during the overturn"
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Amazing fountains.. Took the Ferry from St Petersburg to Peterhoff about 3/4 hr trip. There is also a way to go by bus/car.The grounds are amazing. Natural flow fountains. AmazingPlan on spending the whole day."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "\"The Russian Versailles\". My tour of Peterhof Palace lasted 6 hours and I could have stayed much, much longer. There is so much to see. It was also my last day with my Travel All Russia group ... talk about saving the best for last!! Seeing Peterhof in the summer means getting to experience the wonderful gardens and fountains... seeing both the outside and inside equally. Being at Peterhof in the summer also means triple the crowds so being with a private guide or a smaller group guide is optimum. The large tour groups with upwards of 20 people started to get a bit too much for me as everyone is trying to position themselves for the perfect camera shot or to see artifacts up close and personal. I recommend allowing double the time and taking the time to work through all the highlights. I am grateful for our wonderful Travel All Russia guide who timed everything perfectly and so we were able to take everything in as much we could. I really loved seeing all the State rooms... especially the Picture Hall and the Divan Room and the alcove with the Empress's bed and sculpture of Catherine II's dog Zemira. I would recommend Peterhof over Catherine's Palace if both can't be done.... less crowded and more to see for sure!!"
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Different from other sites - beautiful fountains. Take hydrofoil for the experience. Short walk to the gardens and fountains. Truly different experience that complements time spent in the palaces and art museums. The fountains and grounds are definitely worth seeing. should be sure you do this on a nice day."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Gorgeous Fountains at Peterhof. Visited Perhof Gardens by Hydrofoil as part of a tour organised by Alla Tours. The immaculate gardens and fountains etc were wonderful especially as it was a bright sunny day. We simply have nothing on this scale in the UK. The gold statues glistened brightly in the water spray and sunshine. Fantastic"
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "One of the most impressive places you can imagine visiting while in St. Petersburg. There is just so much beauty, in terms of the buildings, fountains, and parklands surrounding the palace. It is simply amazing. You'll want to take the hydrofoil boat ride from St. Petersburg out to Peterhoff. Its only 1/2 hr by boat vs an hours drive and it always adds so much to the experience to take a boat instead of a bus. The place is truly a great monument to Peter the Great who designed Peterhoff's fountains to run automatically and without the use of pumps by using water that is gravity fed from uphill watersources. Just amazing and spectacular. Genius really to know that these fountains have been running without any machines or pumps for hundreds of years, flawlessly. Really, there's too much to describe and so much beauty, you'll just have to go and see it for yourself."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "A must see palace. It was quite impressive. We were there for the start of the fountains and musical accompaniment. We toured the small palace that was more intimate than the grand palace. The setting on the water and all the gardens was very memorable."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Park and Gardens are magnificent!. Plan couple hours to enjoy park and gardens. The water park with sculptured fountains restored to its glory. Aim to go when in season to actually see fountains. Simply stunning!"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Fantastic fountain. By far the most impressive part of Peterhof is the main fountain in front of the main building. The whole system is gravity driven and not pumped so its very impressive on the size and the height of the various fountains. You can get a good view of it if you come by hydrofoil and walk into the main area from the dock. They start the fountain at 10am so I suggest that you get there 20-30 min before if you want a good standing space. This is only open in the summer so if you go there in the winter you are out of luck."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Breathtaking. Russian Versale -book tickets in advance, lines for tickets to Grand PalaceThe park fountains are magical, don't miss the mini-train tour"
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Peterhof State Museum Preserve, Gardens. Peterhof Garden was a great stop! A great place for lunch break... (try the waffles they are fanstatic!) Im so glad we were able to see so much. We were amazed as we walked down into the grand fountain area. Brilliant Fountain design and Gardens. A must see better to take the whole day if possible, there is so much to see inside the palace and in the gardens. you need to take the tour that gives you both the garden and palace. I loved it I wanted more but I only saw the gardens but it was worth it!"
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Stunning. Again there was nothing that you would not like the building was stunning as was the gardens and fountains the grounds were getting planted when we arrived but all of the fountains were all on the grounds are wheel chair friendly but you would need to be fit"
        }, 
        {
            "index": 136, 
            "rating": "3", 
            "review": "Beautiful grounds. I recommend coming here by boat. The one we took leaves and returns from behind the Hermitage Museum. The ride is smooth and pleasant. The grounds of the Peterhof are spectacular and beautiful to stroll around to see all the different areas. We did not go inside the actual Palace Museum, because a) you have to stand in ridiculous lines, and b) they have different entry times for Russian citizens and foreigners (we didn't have time to wait for the foreigners entry time). And the way we found out was quite an adventure in of itself. If you want information, be weary about asking a cop because the 2 we talked to gave us totally conflicting information and they were both wrong. "
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "A Great Delight. Drive to museum complex is about 1 hr 30 min for St Petersburg. Plan to reach by 1030 AM to avoid rush for entry tickets. Please note you have to buy entry tickets for each attraction. Well maintained. Fountains offer a unique experience. Good gardens excellent sea side view. Cater for at least 5 hrs for visit. A MUST VISIT PLACE."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "stunning Peterhof. Don't miss this...it was wonderful and we didn't even do the palace itself, only the grounds. Very crowded but worth every minute"
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Must visit!. This is one of the incredible and amaizing places in this city!lots of fountains and beautiful sculptures, landscape designs etc.!Take drinks and some snacks, cauz its expenssive to buy there"
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Not to be missed!. A short boat ride across the Gulf of Finland to see how the Tsars really lived. Gold gilt fountains, Hugh park setting, historical buildings all make it a memorable day!"
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Bright and Genuine. It's very pleasant place to have a walk in summer of only the weather is good. Shining gold and genuine 19th century architectural ensemble, regular park and the Gulf of Finland gives to you high spirits for the whole weekend. t's possible to get there by hydrofoil boat (10-6p.m.) - called 'Meteors', - the fastest way (half an hour) , right from the Winter Palace pier, but it may be a little bit expensive (12 USD oneway ticket or 25 USD both ends), or by bus, or by commuter train (2USD per ticket) - to the Old Peterhof Station - 'Stariy Peterghoff' if spelled in Russian) it may take up to 1,5 hours or even more."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Beautiful. Very interesting place and so much to see. An all day adventure. Great beauty in the building and architecture."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "WOW!. The Russian Versailles, but I think better. Peter the Great built Peterhof to entertain and modeled it after Versailles like so many other palaces in Europe. IMO, I liked it better than Versailles. It is over the top glamour. You could spend an entire day here wandering around the grounds."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Peterhof-True history of Russia!. Once again a must see when visiting St Petersburg. The history of Peter the great and fountains alone make it just a incredible site. We visited some of the little buildings and were amazed at the preservation that has gone into the facilities to recreate the actual history is really amazing."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Such splender. We arrived by hydrofoil and the sun was shining we could see the palace right away but as you got closer it got more beautiful and more extravagant it really is an amazing place . The fountains get switched on at eleven with some piped music but don't push to get photos as the then stay on all day .there is so much to see here a if you are lucky with the weather it is very relaxing."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Peterhof Gardens. The gardens and fountains were breathtaking considering when the palace was built. The whole hydraulic system feeding all the fountains and lakes within the gardens are fed by gravity."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Splendid palace in amazing location. If you are going from town, definitely take the hydroplane there and back. Much faster than bus or a car and you get lovely view of the harbour. Plan to have as much time as you can, place is vast and so much to see. Pre-book your tickets to the palace itself or a guide if you can, as it gets very busy during high season."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Great monument and park. I will advise everyone that wanna visit Petergof to take a boat to get there and don't be in a hurry. Just enjoy the park and nature"
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Worth a look. Among the crowds of visitors and tour groups in the Peterhof complex, you may find you have the bath house to yourself and the ladies who look after the place. The various dressing rooms and bathrooms are decorated more simply and intimately than the main palace and give you a glimpse of how the imperial family might relax in private. The ladies who supervise the place will, with great friendliness, tell you about the place and point out things for you to look at, even though it's evident that you don't understand a word of Russian. Well worth the moderate entrance fee."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Bath houses and trick fountains. Wonderful walk by the bath houses and gardens, and the various trick fountains by sitting bench, as tree-like and flower-like fountains, by the walkways,.... Imagine the royalties in their garb, walking thru the trick fountains, Peter is a funny guy!"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Outstanding - insite into lifestyle. Beautiful and I can't help writing all the same adjectives over and over again. In site into the lavish lifestyle and resources available to the Zar."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Amazing fountains and buildings. Like the Winter Palace the Peterhof is not real Russia - it is the Russia of the aristocracy full of European taste.. We arrived via the Hydafoil, which certainly is the way to travel. On entering the lower garden and paying ,you come nearly immediatly to a breath taking magnificent fountain - all gilt and classical figures with a staircase of water. Certainly I rate the fountains better than Versaiiles. The whole grounds were impressive. All the museums needed extra money to go into them and had long lines of people waiting. Luckily we found a little museum area where the group was limited to 10 and saw lots of Peter's and wife's personal clothes and possessions. Really it seems needed to do the complex with an English speaking guide. Left the lower garden and went around the Palace to the upper garden - a few nice fountains but the major one all boarded off for repair that might be concluded any time! Had to go through turnstiles again to get back to the lower gardens for the hydrafoil. Here a real rip off forced to pay again to enter to get back to the area we had already paid to visit. If you arrive by hydrafoil forget the top gardens. Tremendous restoration and certainly a must day visit. The food cafe near the hydrafoil station serves nice quick meals."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Wonderful. Loved the grounds and fountains . Too much walking was the only bad thing my husband can't walk more than a block without sitting lots of benches was good."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "The grounds were incredible. We spent a couple of hours here and didn't even go in any buildings. It was so nice. Really impressive gardens and grounds. Definitely worth the trouble of getting to it. We could have easily spent half a day here just in the gardens."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Must visit. If you go to only one attraction outside St Petersburg make sure it's this one. The gardens are fantastic. Allow 3 hours at least for palace and gardens"
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Be Prepared. Make sure you have wonderful walking shoes so that you can cover the widely spread grounds within two hours. You need to be physically fit to walk up and down the steps to different levels of the park. Bring your cameras."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "magnificent fountains. Loved the gardens of Peterhof, very picturesque. Numerous fountains everywhere. Nifty ride to Peterhof on a high speed hydrofoil was exciting and surprisingly smooth. Good views of the city of St. Petersburg."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Grand. I now see how the other half lived, impressive place. A must see when in Russia. Worth the hour drive from SBP."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "Wonderful Anthem Ensemble Playing. While we were visiting the Peterhof Bath house there was an amazing group singing accopella. Their voices made me float on each note. The acoustics in that bath house is unbelievable!"
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Beautifully restored. The Summer palace area is very particular and loses by no means to Versailles or any other grand garden in the world. Nice restaurant too......"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Superb. The fountains are so beautiful. Take a guide and you will get lots of information. It is beautiful. Love it. Walking is great."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Peterhof. we were taken there by our excellent guide - Yelena.\nIts an amazing place. Worth seeing the extravagance of old Russian royalty. On the way, Yelena showed us the rail subway - also worth the visit."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Breathtaking fountains. A little out of the city. Easily reachable by metro and bus. A day spent admiring the fountains ,away from the city is very rejuvenating.Can easily spend a day wandering around the grounds Do see the palace also."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Must-See in Russia. This was one of the most beautiful spaces I've ever had the pleasure of viewing. You really forget you are in modern day Russia and can envision yourself in Peter's heyday. It's absolutely fantastical."
        }, 
        {
            "index": 165, 
            "rating": "4", 
            "review": "Huge collection. This museum gives the feeling that you are back on XVIII century. There is a enormeous collection of art that is nicely done."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Beautiful fountains. I always visit this place when I am in St. Petersburg. The park is very beautiful and landscaped, but authenticity is maintained. Trees are natural from this region, old and interlaced. The park is decorated with wonderful fountains. There are many slap games for children, so I recommend to have spare clothing. There are small cafes where You can sit and enjoy Your time or You can walk to the bay. Definitely it is one of the most picturesque places in St. Petersburg."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Most interesting museum I ever visited. The Bath Block is a museum telling you how the royal family clean their bodies. There are not only bathtubs, but also many other shower and bath systems."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "versailles number 2. This is the backyard of peter the great palace it should be considered with the Catherine palace and the hermitage the three must things to do when visiting the city."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "Lovely park for walking. Peterhof is very well taken care of. We did not go inside but instead walked in the beautiful park. The fountains are gorgeous. It is hard to believe that people actually lived as they did during the times of the Russian Emperors. No wonder there was a revolution."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Unbelievable. Was all brilliant, too much to take in shame we were only in petersburg for a week although will return on next visit to this mental city! everything is just massive"
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Peace and Quiet. on the edge of St. Petersburg, offering a nice trip out of the city to arrive here. One must run the gauntlet of souvenir booths on the way in, was very busy the day we were there but the size and expanse of the grounds sees to swallow up the people. The fountains offer a welcome water entertainment. We also came across a group of men performing music on the grounds, they were very entertaining. Grounds offer lots to see and places to relax and enjoy the park and gardens, A must see."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "The switching on of the fountains ceremony - a real highlight. The switching on of the fountains in the morning was a real highlight of my time in Russia. We arrived by hydrofoil after a nice trip across the gulf in time for the ceremony to the accompaniment of music. It really is quite a remarkable experience - I've lost track of how many people I've told about it :) The majestic palace & expansive Versailles like gardens were a great way to spend a day. Highly recommended."
        }, 
        {
            "index": 173, 
            "rating": "4", 
            "review": "Grand Fountains!. Splendid Water Fountains and Gardens! Enjoyed the large fountains as well as the small fountains. There were even trick fountains; so be careful if you do not want to get wet!"
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Unbelievable!. We took a hydrofoil from St Petersburg on the Gulf of Finland to the dock and walked towards the most amazing sites of our trip thus far. We arrived in time to see the fountains turned on-- apparently run by Peter's engineering ingenuity, using gravity alone. Not to be missed. Certainly the palace was magnificent. But the gardens and fountains were truly lovely. The trick fountains were whimsical and several of my traveling companions were happy to get soaked. Restorations were still going on--large and small-- as captured by one of the photographs. Very nice bathrooms, too. Also we passed several stands that claimed to grill hamburgers, which made my American mouth water--mundane as that sounds. I kept seeing everything--the magnificence, the opulence-- with an eye towards the extraordinary beauty, and the other eye towards the coming revolution. A poignant juxtaposition. Still, truly remarkable."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "worth a visit. We took the ferry to Peterhof. There is an entry charge to enter and you can't avoid it. The gardens are beautiful and the fountains are stunning. We liked the trick fountains best."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Loved It!. A 45 minute hydrofoil ride on the Gulf of Finland from the pier at The Hermitage found us at Peterhof. Go early and watch the main water fountains. These fountains are not pumped but work on gravity and water displacement. It's a WOW! The opulence and grandeur is simply amazing. Visualizing what it was like years back it must have been an awe inspiring feat and sight to behold. Spend time taking in the grounds with it's fountains and so called 'booby-trap' sprinklers and water sprays.Highly Recommended!!"
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Our favourite!. The palace itself is stunning but to me it was the gardens and the water fountains that mad the biggest impression. When the fountains were switched on I just stood in awe and wonderment! And the lake as so beautiful. The walk down the 'avenue' from the palace to the pier was lovely, and we joined our hydrofoil there which took us back to rejoin our tour bus. Just fantastic!"
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Amazing . Went there on my last night in St petersburg. .it was the closing ceremony of the fountains. . There were hundreds of people there to watch the spectacular event. . It was so moving it was like being at the closing of the Olympics. .lasers fireworks and the fountains. .it was my favorite of all the special things there I need to go back and spend a day there"
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "A moving experience. We were there on a Monday when the museum was closed. We did witness the turning on of the fountains. Initially I thought 'why bother, someone turns a tap' However I found it quite emotional, in a weird way, with loud music and the fountains bubbling and then bursting into full flow.If ever there again, I would do it again"
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Magnificent. Went there on Monday so palace was not open but the fountains were fantastic. Senior rates on hydrofoil are available but not advertised on boards so it pays to ask for it.Gardens and fountains are amazing"
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Peterhof Fountain Park. We joined a local tour and this is one of the attractions. We were so impressed with the architecture and design of all the fountains. All the gold statues were extremely outstanding and shine. We couldn't believe all the fountains were built using only the water pressure for control and there wasn't any pump involved. This was quite amazing. We only spent an hour and a half wandering the lower and upper garden. We certainly didn't have enough time to explore the details in this park. This is definitely a must see attraction."
        }, 
        {
            "index": 182, 
            "rating": "3", 
            "review": "Lovely Fountains and Grounds. They were preparing for an Evening Event so the fountains were difficult to see in all their splendor. We did not go inside Peterhof."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Fountains and palace both majestic. This and a few other major sights are integral to the St Peters burg experience. They are must see places. This palace is very beautiful and as with many others is meticulously restored and rebuilt. The fountains are what make is most noteworthy and they are turned off in form fall to spring. Be sure they are are working, because this is half of the experience."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Beauty & engineering excellence. Even in the rain this place was beautiful. I don't think I've ever seen so many fountains in one place. The gold leaf on the fountains make them glow in any sunshine. The gardens are immaculate. Too many people around!! It's somewhere that will stay in my memory for ever."
        }, 
        {
            "index": 185, 
            "rating": "4", 
            "review": "Fountains and more fountains. Peterhof is not too far from Catherine's Palace. There are over 200 acres of parkland. Fountains abound with gravity fed pumps. At 11am the largest fountain turns on with water cascading down steps. It is all quite beautiful."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Maybe my favourite. It is referred to as the Russian Versailles, I don't think it is a copy of anything it is its own original and it is beautiful! The fountains are stunning, the main are gravity fed and the valve is opened at 11am with Classic music playing, was quite lovely. The gardens themselves are also beautiful and make for a lovely walk. One thing though - watch for pickpockets! I was watching the aforementioned fountains when I was bumped, I looked down to see a small woman with her hand in an unsuspecting spectator's purse! Made short shift of that but we saw her another two times during the walk,"
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Glistening Peterhof. September sun, an Indian Summer and Peterhof in all of its splendour. To see the opulent extravagance of the Russian Czars, the beauty they created for their enjoyment is unbelievable.The memories will stay with me forever."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Trip to the Peterhof Fountains. Most people would like to visit palaces and admire their beauty. Peterhof however, is not just about the palace. The more striking and breathtaking are the beautiful fountains of this suburb. They are simply magnificient, and really grand. Every fountain is an art in itself, and standing near them can be quite refreshing during the warm summer months."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Spectacular gardens. This is one of the prettiest & most extravagant gardens we have seen in our many travels. Truly reflects the lifestyle of the tsar & his family. So much wealth concentrated into the hands of the rulers."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Peterhof. As interesting and full of gold is this palace, the most amazing to me was the outside grounds and fountains. I think someone said there was 42 different fountains. Be sure and go before they turn them off in September. We just made it."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Go see it. One of the other great sights around St Petersburg. Well worth the trip and the seeing. It is a fantastic evolution of Peter's original more simple summer palace, evolved into lots more."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Peterhof. Amazing to realize how forward thinking Peter was...we toured the upper and lower gardens on a beautiful day. The many fountains in the gardens are fascinating...do not miss the fountains coming to life at 11AM as the national anthem plays!"
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Now that's a garden!. We went by Hydrofoil to the Petrohof. The gardens are well maintained and the fountains are beautiful. Enjoyed the walking through the grounds and we lucked out that our day was sunny and warm."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Beautiful Grounds. Russia is unbelievable with its Churches and Palaces. This is another! After the tour of the Palace we walked the garden and its many fountains. The grounds are large and well kept, as are all of them. Their History is their most important product. Thank heavens that the Germans didn't destroy it. At eleven the fountains were turned on to the excitement of all. It was another treat of all."
        }, 
        {
            "index": 195, 
            "rating": "4", 
            "review": "Luxury palace. Beautifull arquitectural palace... Recommend to go by ship and return by bus.. You see the other St.Petersbourg!"
        }, 
        {
            "index": 196, 
            "rating": "4", 
            "review": "A piece of art. Place is Awesome But the charge for everything, always crowdedFountains are AwesomeToo bad u cannt take pics insideBook at Shop are so expensiveMust go!!"
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "The cascade is amazing. I spend a day at Peterhof, and we spend an hour in the palace (the queue for a ticket was endless) - the palace was nice, I'm sure that people who loves Versailles or any other Europe palaces inside would enjoy the palace as well.The Cascade is amazing and the view that are open to the sea as well, I think it's nice to take a trip in the caves to understand the mechanical part of the cascade.We also took a sandwiches with us a cup of coffee an went to eat on the sea beach, the sea doesn't clean enough to swim there but the air is clean and the breeze sometimes become cold and nice at hot day."
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "Worthwhile visit!. We were able to take the boat to see the museum which is a pleasant way to while away an afternoon. The grounds are truly lovely and the fountains are very impressive. Worth a visit! Not sure if there is a combination ticket, but if so this would be the way to go because otherwise, they charge separately for each thing - the lower garden, the other garden, the castle tour, the museum tour and the church tour are all separate. So, please do a better job than I did and research the ticket options:)"
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Beautiful and grandiose.. Everything in St Petersbourg is grandiose, but Peterhof is tasteful and serene. The gardens are beautiful and the fountains a masterpiece of water engineering. A must see."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Amazed again at Russuan History. Wow wow wow and the fountains wow... Expectacular I made the mistake of not entering because I was told it was empty so we took a tour that did not include the inside. Met some friends that did and claimed it is the best work of restoration they have ever seen in their life. Just imagine you living in that kind of wealth, strolling the gardens with a goblet of fine wine , your wife on one side and the mistress on the other :), kidding....try to return on the hydrofoil, faster and fun"
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Palace with Huge garden. You will be surprised that this place is crowded by Russian couples and Russian family. You will see Russian people's lifestyle better from here. And new thing I learnt from this place is Russian people is family oriented and very generous to those they love and those who is Russian. You need comfortable shoes to walk around and either at least 2 hours to enjoy every part of this place but it is worth your effort. Trust me!"
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Geat museum. its a great museum , although outside has very beautiful fountains. inside there is very nice historical lifestyle from Russian history. tickets available for purchase at door entrance."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "out of this world. this is a place you will stand back and look and say how do they do it it is such a nice place to relax sit look at the things on display you will not see in the uk as for the grounds first class"
        }, 
        {
            "index": 204, 
            "rating": "3", 
            "review": "Interesting building, but tours compulsory and Russian only. This building is related to the Monplaisir villa. Tickets are bought just outside (360 rubles per person). The building looks interesting but tours are compulsory and appear to be in Russian only."
        }
    ]
}