{
    "category": "St-Petersburg", 
    "entity": "The-Naval-Cathedral-of-Saint-Nicholas-in-Kronstadt", 
    "avg_rating_stars": 4.582781456953643, 
    "review_count": 151, 
    "rating_stats": {
        "poor": 2, 
        "average": 10, 
        "terrible": 0, 
        "very_good": 37, 
        "excellent": 102
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "4", 
            "review": "Gorgeous . We happened to go on a day when the second floor was open-a rare occasion apparently--even lovelier than the first floor too.\nRemember that people are worshiping; hence, the prohibition on Flash Photography & boisterous behavior."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "historical gem. if you want to hear all about the history of st Petersburg its all in this place,the burial place of most of the Russian royal families.very interesting,also extremely busy!"
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Beautiful green interior. Seeing the tombs of Peter the Great and the other czars was helpful to put some of the history into perspective. The interior wasn't nearly as ornate as others, but still very elegant and inspiring."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "My best day in Saint Petersburg. The ride from Saint Petersburg to Kronshtadt is amazing. Crossing the Gulf of Finland on the majestic roads is an experience in itself, Kronshtadt is a small naval island about 55 kms from Saint Petersburg, and has a wonderful rustic vibe attached to it. The naval cathedral is definitely one of the best churches I have seen in my life. The architecture is splendid both from the inside and outside. After the church do go to the park and the coastline, and then take a walk across the island."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Amazing, like all buildings in St Petersburg.. The one building after the other are beautiful in Sint Petersburg. Put this one on your list. Its worth the visit."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Beautiful cathedral. The exterior of this cathedral is stunning. The inside is not as astonishing as others in St Petersburg, but it is beautiful and it is used daily by worshipers."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Beautiful church on a spacious square. A truly beautiful church both from the exterior and interior perspective. The church sits on a spacious square, allowing excellent photo taking opportunities from both near and far. The inside of the church is stunning. Definitely should go as part of a Kronstadt/Peterhof outing."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Round Trip. This church is worth to see by combining the visit of Kronstadt, Oranienbaum and Peterhof. Leave St. Petersburg north and enjoy first the beautiful ride on the dam across the Gulf of Finland before entering Kotlin island. The Naval Cathedral is located in the south and can be easily accessed. Free parking possible along the streets around the church. The cathedral is beautiful from in and outside and pictures can be taken (most probably not during ceremonies). Leave the island in southern direction (Tallinn) and be cautious not to miss the exit to Lomonossow (Oranienbaum)/Peterhof. Easily to do this trip in 1 day, having seen the outskirts of St. Petersburg as well."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Beautiful Inside and Out. The Naval Cathedral is a striking building from the exterior, but the ornate interior is also worth a look. This may not rank on the same level as St. Isaac's cathedral or the Church of the Savior on Spilled blood in terms of size or opulence, but it is a living church that you will want to see.We were able to visit this Cathedral on a Sunday morning and attended a portion of a service. Whether or not you can do so, this is a living church so there are a number of considerations. First, of course, this is a house of worship so you should respect those coming here for that purpose. There is also no photography, and there is a dress code of sorts including the requirement common to Russian Orthodox churches that women wear scarves over their heads.Although you cannot take photos of the interior, they are certainly memorable, with many artistic details, icons, and elaborate trim.This is a lovely cathedral and very much worth a visit if you are in St. Petersburg."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Unexpectedly beautiful gem. Even our 16-year old son exclaimed that every next church in St Petersburg is more beautiful than the previous one at just the sight of this Cathedral. This is an unexpectedly beautiful gem in the gray city of Kronshtadt. Many unique details outside and inside. Airy, colorful masterpiece."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Cathedral of St. Nicholas. This is an active Cathedral and so photography s not allowed inside. That said, the Cathedral allows the visitor an insight into the Russian Orthodox Church and its services, Lades, please be prepared to cover your heads and to all, Please dress respectfully. The entrance is free and there is a small shop, mainly selling candles, but there are some souvenirs. Once outside, you can photograph to your hearts content."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Most beautiful interior of any orthodox church. It's very illuminated and peaceful, doesn't have the usual darkness inside of other cathedrals. You can tell this is authentic and has been for many years. It really is tied with the sailors and their lives."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Another beautiful cathedral. We were on 'information overload' when we visited this cathedral so can't remember too much about it, other than the majestic building was another display of Russian affluence."
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "Rainy days.... Because of some rainy days while our trip through Russia, we had the chance to visit the renovated Cathedral. And it's really impressiv!Inside you can find some historical relicts of former monks and there is also a kind of timetable of the past of the cathedral.The inner of Saint Nicolaus is bright shining and you can find nice icons - but never forget: there are also a lot of believers praying there.As usual women should wear a headscarf - in case you forget it, there are some you can borrow."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Very good. If you in ladies you need a scarf, but it's not oblitogiary it's a very interesting church, with good building inside and out."
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "another beautiful church. We visited during a mass, which can easily happen, as they go on for hours - unique atmosphere. No photo rule inside strictly enforced."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "The gorgeous cathedral dedicated to the fallen seamen !. Being on the Kotlin Island in Kronstadt municipality, we visited beside the Kronstadt fortress, the Naval Cathedral of Saint Nicholas as well.This Russian Orthodox cathedral was built in 1903 - 1913 and represents the main church of Russian Navy. It is consecrated to the fallen seamen. In some period of time, the cathedral was converted in the cinema, the House of Officers and the museum of the Navy.The design was done in the Neo - Byzantine architectural style.The cathedral is very beautiful outside and inside as well.There are many stunning icons in the cathedral and main altar is raised on a 4 meter high platform. The main dome is quite impressive with the golden crown set along the perimeter and the golden cross on the top. Below, there are two bell towers with the smaller domes on each of them. Not to miss when in Kronstadt !"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Beautiful Cathedral. Stunning inside and out. Beautiful architecture. Take time to look around inside. Many incredible icons."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Beautiful Cathedral, a Must Visit. As with most religious icons in Soviet Russia, this cathedral was used purposes other than spiritual. For example, it became a cinema in 1932, right after it was defaced (crosses and bells taken down) and valuables nationalized for the Soviet treasury. As a result much of the glory of the church were lost or destroyed. However, it was fully renovated in the last few years based on the existing photographs, and since Kronshtadt is now an open city, public may enjoy its beauty. It is an impressive Eastern Orthodox Cathedral unusual in the use of many subtle nautical symbols. It is free to enter, but they ask that you keep your shoulders and knees covered, in fact they provide scarfs and surrongs at the entrance. If you are in the area, you must take a moment to visit it."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Lovely archtecture. Lovely building and one of numerous in this part of the world. Again be careful of queues and pickpockets"
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Main attraction of Kronstadt. Imposing Eastern Orthodox cathedral designed to commemorate the naval history of Kronstadt. Apart from the traditional lavish interior of Russian churches, inside you can see plates with the names of Russian Baltic Fleet sailors died in the wars up to 1917."
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Another lovely place. Don't miss it.\nIt is not only the cathedral,it is the all site whixh is impressive and allow to enjoy nice visits as well as having great views on the historical centre of Sr Petersburg."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Beautiful. attractive. The main cathedral in Kronstadt. Huge, beautiful, impressive. Visiting inside - must. Important marine history place"
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "Beautiful things. Most of this collection is small, boxes, eggs, little gorgeous things to delight the eyes. Hard to think that some of these treasures were just common object for the super rich."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Naval Cathedral in Kronstadt. Visit in the late PM when the sun lights the main western facade. The interior is classic Russian Orthodox - tiles/mosaics adorn the domed ceiling. It's a bit of a drive - maybe 45 min. or longer from Peterhof - and can be toured in well under thirty minutes."
        }, 
        {
            "index": 26, 
            "rating": "4", 
            "review": "The unsung gem of St Petersburg's churches. This is a working church and has a different feel to it than the more visited churches. It has an impressive exterior and a very calm, relaxing interior with less crowds. Not on all tour guide lists but in my opinion worth a visit"
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Free entrance, unique in the area. One does not have to pay admission to enter this beautiful building. Nice from the outside, but beautiful inside. Worth the drive from Peterhof on your way back to Saint Petersburg."
        }, 
        {
            "index": 28, 
            "rating": "3", 
            "review": "Biggest one in Kronstadt. Good place for tourists, but if you are lucky. Often this church just closed. Try to call before visit. Kronstadt is boring soviet small village. Don't waste your time"
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Don't pass it by. . Functioning church with incredible history, saw a number of churches in St Petersburg this would be my favourite. Take time to see it if you can ."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "A Splendid Cathedral. A place not to be missed. Go there on a warm sunny day and enjoy the splendour of the cathedral and the square in front of it. As you approach the island look at the sun's reflecting off its golden dome. An excellent location for photography lovers!"
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "Saint Nicholas. Well worth a visit it's very interesting cathedral don't pass it by but with all of St. Petersburg you need more than two months there is so much to see"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Favorite church visited. Unique and beautiful church. Favored over more famous St. Petersburg area churches. Names of sailors lost on the walls up until 1917… touching tribute. Walk around the area if time permits... neat area... fascinating."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Functioning Church with Regular Services. We visited this church with our private tour guide during services. Nice add to our travel experience."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Must see!. Amazing place! If you have an opportunity to see it, DO IT! Unique architecture, great atmosphere. And if you can, travel where by car, using the fast-speed road along the sea!"
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Stunning exterior. A 'working' church and worth seeing particularly if a service is not on. The exterior colours are stunning"
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "A masterpiece in the center of Kronshtadt. Magnificent, truly unique and beautiful Temple, dedicated to the marine soldiers, who laid their lives in different wars"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "A grand lady by the riverside. Go there in late afternoon or early evening. The blue golden hour lighting plus the buildings flood lights, makes a good photo oppty. Did not go inside to visit"
        }, 
        {
            "index": 38, 
            "rating": "4", 
            "review": "Interesting cathedral. Overall a pretty interesting place to visit, big and well decorated. A bit on the austere side, not worth the trip out to Kronstadt alone, but throw in some forts and the museum and you have a sweet day."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Very moving. The church is immaculate. Such a beautiful morning service, I felt very lucky to watch. The choir was incredible. It reduced me to tears."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Smaller than the others but still beautiful. We visited this cathedral on the 4 hour major sites tour with viator.com. I was happy we had the chance to enter this smaller but beautiful place of worship."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "A great new Ortodox church with so much history, pride and culture. Totally worth visiting attraction with all it's surroundings, if you decide to visit Kronshtadt. Amazing, no words."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Most resort. One of the most restored classic Orthodox cathedrals on the island of Kotlin.The masterpiece of the architect Kosyakov and his school.The experience of prayer is huge,art is emotional!"
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Interesting catherdral.. This was the only cathedral that has been in use during the sovjet periode. So it is the most authentic of all. When I visit there was a funeral going on. Please be ware that it is not a tourist attraction."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "another must see. this place is beautiful at night so make plans to go by and get some night shot as well as going in for a tour during the day"
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Very beautiful!. It is a very beautiful church near the city(about an hour by bus).Near the church there are also other monuments you can see."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Small but magnificent. This Naval Cathedral has bee beautifully restored inside and outside. It is a gem of architecture (designed by V.Kosyakov)."
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "An unusual orthodox cathedral. Kronshtadt is my favorite place to go to in the suburbs. The cathedral has recently reopened to the public. The colors, the design and architecture are quite unusual for Russian orthodox churches."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Charming. I like this small town. It is not the must to see but if you have time left in the evening, this is another good choice. People are nice. I took a metro to Staraya Devaraya metro ( purple line) and once you get off the train station, turn left to bus parking lot and walks straight until reach the end and a mall named ' Мебель' , the yellow bus no 101 is there. The fee from the metro to the island is 28 rubles. You just have to get off at the end point which in at the supermarket in the center of the island. The cathedral is gorgeous and combined with the old and abandoned fortress- that is really charming. I love the sky during the sunset ( I depart from the city of St Petersburg at 15:30 and I really enjoyed my 3 hours walking around the town)"
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Amazing interior - simply impressive. Beautiful cathedral and definitely worth a visit if in Kronstadt or returning from Peterhof. The size of the dome and the feeling of space and light is inspiring."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Very nice Christian cathedral, decorated with mosaics on the marine theme. It's just a wonder of the world! The Cathedral is located on the island of Kronstadt. You can take a bus from the station in Oranienbaum or from the underground \"Black River» № K-405. The fare - 60 rubles or from the subway \"Prospect of the Enlightenment» № K-407. The fare - 60 rubles."
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Magnificent Cathedral on a very special island. It takes about 1 hour by marshrutka to get to Krohnstadt. Once your there you have complete freedom to walk around this naval island. It has an extensive and important history. The Cathedral is grand and very nice."
        }, 
        {
            "index": 52, 
            "rating": "3", 
            "review": "Overrated on TripAdvisor and skip this one. It's for Russian Naval troops who brought the battle glory to Russian Empire. It's a blue and white building. The picture on TripAdvisor is not correct. It's also overrated on TripAdvisor. I fail to see it's special quality. There are far more cathedrals in St Pete more worthy for you to see. Skip this one"
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "A cathedral for Mariners . Given the name of the cathedral I was expecting a nautical theme, however it was really over the top. Of course I mean this in an endearing way, and fortunately you're allowed to freely take pictures of this interesting place -- as long as you don't intrude during religious services. **Women, please note that they're very strict about wearing skirts, and covering up. They will make you use the ones provided"
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Be sure to listen to the story, and find it in the interior. An orthodox cathedral right?You will say, nothing unusual, but the history behind needs to be heard, and better go there with a guide. This is a must-visit during your Kronstadt experience, together with a ship travel through the bay, the walk through the city, and the dive into the old glory when this has been the most important avant-post of the Russian Empire's Baltic door"
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Place for sailors to pray. Completely restored and operational Cathedral. Impressive by it's size and glory. Build specifically for sailors to pray before going to battle, cathedral served it's purpose for centuries. It is different place. You not be able to find place like this in the world."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Good craftmanship. A spectacular church with vibrant colours, nicely restored. Has nice statues and sculptures. It has a beautiful bell tower and icons of our Lady."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "A great introduction to beautiful St. Petersburg. A great, quick, easily accesible landmark that I enjoyed a lot. A lot of history! Beautiful interior and lovelye xterior. Grounds are special, too. I loved the resident cats and of course, how they manage the property and keep it clear of vermin-lololol. A great experience and a lovely way to begin a stay in St. Petersburg."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Impressive - reminds you of Hagia Sofia. Stunning cathedral, inspired by Hagia Sofia, and much like the latter, it is awe-inspiring when you enter. It has a complicated history, because of the war (it was converted to a movie theatre; the stone slabs honouring fallen sailors were torn out of the walls and used as benches in the washrooms; the bell is in situ simply because it was too large to be destroyed. Details such as these make you curious about the history of the place and the people).The church was reconsecrated as recently as 2013, on the centennial of its construction. Beautiful. The Russian Orthodox Cathedral can handle 5000 worshippers. As a family we thought this was quite the highlight of the trip. "
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Just simply beautiful. Beautiful cathedral with multitude of amazing marine details! It is dedicated to all fallen men at sea! Located near the shore of Finnish gulf of the Baltic Sea, it's one of the places that is Worth the visit!"
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "A Must See in St. Petersburgh.. History of this very interesting. It worth a visit. This is where several royals are buried and things have been very well preserved."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "SAINT NICK's MY GUY. So glad I was able to view one of the \"minor\" ABC's (Another Beautiful Church). It is beautiful and named after my patron saint--Saint Nicholas, since Saint Nicholas Day is my birthday! Loved the turquoise, not usually a color chosen for these churches. Unique feature (per our guide) is that it is the only continuously running church in Saint Petersburg."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "such a sweet island. a beautiful island. st nicholas is stunning, majestic. the rest of the island is worth a walk, too. some nice churches have been restored, parks and huge naval buildings."
        }, 
        {
            "index": 63, 
            "rating": "2", 
            "review": "Unfortunate taste. Unfortunately the poor taste of the Prime Minister's wife have turned this cathedral into what resembles a 7star hotel in the UAE."
        }, 
        {
            "index": 64, 
            "rating": "3", 
            "review": "Another cathedral. What can I say. Another cathedral is the city of numerous buildings and works of art. Worth a picture but don't spend much time."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Beautiful Cathedral w a very interesting history !!. Another great stop on your tour. Cathedral has a very interesting history as it remained operational during periods of Russian history were churches were being destroyed and those visiting churches and who believed in religion were monitored closely. Part of our fantastic 2 day tour w TJ Travel ( see our review)"
        }, 
        {
            "index": 66, 
            "rating": "3", 
            "review": "Another Cathedral?. We did three days of touring in St. Petersburg that covered all the major sites. This Naval Cathedral was just about the last thing on the tour. To be honest, after seeing many other ornate and grandiose churches already, this one seemed a little smaller and plain by comparison. I am sure that, taken on its own, it would be considered quite an impressive site, with the dome, the size, the history, the brilliant decors, ... But I couldn't get too excited about it."
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "interesting island. we were taken by local fridns to this island, reachable by car (45 minutes away from Saint Petersburg city center. Interesting place, nice church."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Save time for this!. Something not so many people see! Long way to go but totally worth it! Amazing cathedral in interesting city close to St Petersburg"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Elaborate Cathedral in Intersting Naval Town.. Very elaborate Cathedrale, recently restored. It is in the Naval Village of Kronstadt on the Gulf of Fonland. It makes a nice day outing to visit the village and this cathedral. It is dedicated to all military seamen lost at sea."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Visit the Sailor's Save Haven. Known as the patriarch saint watching over the St. Petersburg sailors, Saint Nicholas is still a working church."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Should also visit this place @ night.. I visited this place @ around 11 pm. Though it was closed then but the view from outside itself gave me the feel of rich cultural history this city has to offer..\nI would like to visit again and witness the beauty of this place from inside."
        }, 
        {
            "index": 72, 
            "rating": "3", 
            "review": "Impressive church. It is certainly an impressive building. The area around also deserves a walk. Not the first thing to do in the city."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Beautiful facade. The church facade is breathtaking. The compound around is well maintained. I was there during the navy day celebration and there was a considerable crowd but nonetheless I enjoyed the walk around the grounds."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Worth a look. Another beautiful Cathedral if you are into viewing churches this is one to see. Not much time is needed to get a great viewing of this facility."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Great Cathedral. Unfortunately we were there during mass, so tourists were not allowed in most parts of the building. Still very impressive."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Marvelous and Unique. It was an \"OMG!!!\" when I saw it first, very beautiful and unique, never seen this thematic in churches before. It has a marine ornaments and was built for a memory of sailors and fishermen. Inside it is very bright and pleasant!I have no regret at all that I visited such a wonderful church."
        }, 
        {
            "index": 77, 
            "rating": "3", 
            "review": "Cathedralled out. Maybe it's because we saw so many, that this one just didn't impress us as much. It's worthwhile but not on my \"must do\" list."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Great Cathedral. This the most spectacular church, I have seen on the last visit to SPB. The restoration has been splendid. Colors are vibrant, has great spacious feel to it because of the open hall structure. Most see on a visit to the great city."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Interesting. An interesting excursion. Nice cathedral, nice gardens, and some beautiful statues and sculptures. And hang around the grounds for the 12 noon cannon!"
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "A visit to Kronstadt. If you are an Orthodox Christian, a must see. Beautiful church with a wonderful history... on Mondays, Divine liturgy is downstairs..."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Glowing heart of a small town.. It's my second review of the Naval Cathedral. Last time I concentrated on the inside of the cathedral. But last week I visited it during the night time and tell you what... IT WAS AWESOME. With no one around the empty square and nicely lit up cathedral looks so great and majestic. But be careful, the city looks empty and a little bit dangerous during the night."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Very good. It's a only one naval cathedral, which was not close down in WW II. You have to visit this place and will not regret it."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "St Nicholas cathedral. beautiful cathedral our guide arranged a private concert for us. Again perfection nothing to dislike"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Very beautiful, Byzantine architecture!. This is a magnificent Cathedral that follows traditional Orthodox Byzantine architecture. It is constructed as a small-size version of the Great Agia Sofia church in Constantinople that unfortunately the Turkish government does not let function as a Orthodox Christian church and partially destroyed. The Naval Cathedral of Saint Nicholas in Kronstadt is one of the most beautiful orthodox buildings in St. Petersburg and should not be missed!"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Amazing. Not on the tourist map as it is away from the city. Beautiful Cathedral. The statue of Admiral Bellingshauser is picturesque besides the eternal flame for the unknown sailor."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Great Cathedral. Fully renovated the Cathedral in Kronstadt gain back its magnificent. Very interesting interior, with great icons, majestic windows... wall with names of the sailors dead for the country covers the entrance."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Cathedral I'd Saint Nicholas. The cathedral has elements of traditional Russian architecture. There are golden crosses on sparkling domes. It has a beautiful bell tower and icons of our Lady."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Extrodinary architecture and craftsmanship. The interior and exterior of this cathedral are awesome,beautiful and inspiring. The craftsmanship and architecture is beyond comprehension."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Unique and unforgettable. The cathedral is over 100 years old. It was recently restored by Russian and Italian specialists and is open to public only for a short time. Although I have visited many churches and cathedrals all over the world I was truly impressed by the cathedral's unique architecture with intricate details. Its magnificent domes are decorated with golden anchors and ship ropes in the memory of sea men. The ceiling and stained glass windows are beautifully painted. Inside there is a lot of interesting well arranged historic information. The cathedral is located in a spacious square with other historic landmarks that are worth seeing. It is definitely worth visiting as you are unlikely to see anything like this anywhere in the world."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Beautiful cathedral. Mass was in progress so we did not really have a chance to look around closely at the interior but what we could see was magnificent. St. Nicholas is the patron saint of seamen and travelers which was extremely appropo for us as cruisers to St. Petersburg. Lovely iconography for sale also. Very lovely exterior as well."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "An Amazing Cathedral. Having watched the renovation over the years, the final product is truly amazing. From the interiors to the outstanding exterior, this wonderful structure is off the regular tourist routes, the consequence is that it is never crowded. Next time in St Petersburg put it on your list, and visit Kotlin and the cathedral"
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Magnificient. This church was truly magnificient. Even if it was totally redone, after serving for decades as a club for sea men, the feeling was very warm and splendor of old times was there.....:)"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "magnificent, breathtaking. this s renovated cathedral, new and shining of byzantine style of white bricks outside with rich stone carving decoration and absolutely magnificent inside with rich decoration as it it was built centuries ago. the moment you get in you can't speak just stare..."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "My favorite in saint peretersburg. I am proud that there is cathedral with such architecture in my city. I have seen it many times and each time it is still breathtaking"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Stunning...... A wonderful place to visit .... A bit of a way out but really it is worth it.\nThere is a Chapel dedicated to the last Tsar and his family which is very beautifully done."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "breathtaking!. This is the last cathedral I needed to see near Saint Petersburg. It was well worth the hour bus ride to get there. Walked up to and it is completely breathtaking on the outside and the inside is just a breathtaking. It is free to go inside. No pictures allowed inside of it but that is ok because it is amazing. It is sure worth going to see if you don't mind traveling a little out of Saint Petersburg."
        }, 
        {
            "index": 97, 
            "rating": "4", 
            "review": "Royal Family. This is where the Royal Family is buried. So if you love history this is the Church for you to visit. It won't disappoint."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "pure light. this cathedral is very special - very light, pure, bright, not heavy at all (many cathedrals look a kind of \"heavy\", monumental)...a lot of air & light...when i was there, there was service & they were singing there, it sounded so pure & beautiful..."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "atmospheric. This church is so different from all cathedrals and churches of St-Petersburg. It is so atmospheric. And we were so lucky to see the real orthodox service."
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "Beautiful Church. We were lucky enough to visit just as a service was ending and the Church was full of Worshipers of all ages. One little boy was delighted to speak English to us and introduced himself as Vanya.A lovely building inside and out and well worth putting on any itinerary."
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "A must see. It is a real church. The outer design and colors are really alive and stand against years. There is no entrance fee, and you are not allowed to take photos because there are religious practices going on like baptizing."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "More beautiful than any description. I had heard that this Cathedral would be very beautiful, but the interior surprised me with its beauty, with the perfection of the design of its round center and I was fascinated by all tables of the names of all people whose lives were lost in the sea.The entrance is free. Approximately 200 meters from the Cathedral there is the Historical Museum of Kronstadt, the ticket is very cheap and the museum extremely interesting (being Kronstadt a very meaningful town for Russian history). On the main road in front of the Cathedral there is a small bakery with all kinds of coffee, tea and pastries and guess what (!!!) free wi-fi!!!. Yes, it is true: in a small bakery of a small town roughly on 60 N, 30 E in Russia there is FREE wi-fi, which is still so rare to be found in cafes in German towns (except Starbucks and McDonalds, which don't count)."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Fairy-tale night. OK, 5 stars without even having visited the cathedral? Isn't that outrageous? Well, we arrived here late in the evening, after a visit to Lomonosov. The cathedral was closed, it was late, snow was falling. Very few people around. And it was simply a magical moment which pictures cannot do justice. I have visited Peterhof often, but I cannot tell whether it was really \"better\" than this enchanted moments in Kronstadt.Maybe I'm getting old and soft."
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "Very nice cathedral - renovations recently completed. I had some time during a recent business trip to St. Petersburg, so I decided to see the cathedral in Kronstadt. I am not sure that a trip, just to see this cathedral, is warranted. But adding it to a trip to Peterhof would certainly be a good idea. The church is completely rebuilt, but done in the style of the original. The walls are lined with large plaques which name the sailors from Kronstadt that were killed in different military campaigns."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Naval Cathedral delivered a visual & spiritual memory. Our visit to the Cathedral of Saint Nicholas was unhurried, well organised and a sheer pleasure. Every aspect of the building carries beauty and majesty. You do not have to be a Religious person to appreciate this landmark of St Petersburg. If you can, hire a private Russian guide, there is so much to see and miss if the smaller details are not pointed out and explained as to their significance and resonance.A Must see for visitors to this City."
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "Interesting place to visit. It's not your typical tourist destination as it is a fully functional cathedral with no exhibits of any kind. If you don't speak Russian or are not very well-versed in architecture there's few you an learn. However, if you go during mass, you'll get to hear a very professional choir performing Orthodox liturgical pieces (something my gf found mesmerising)."
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "Do visit the cathedral, don't visit the whole island!. It’s a little far from the city, but I really enjoyed the visit. Although the Cathedral is new, the architecture is impressive from the outside and the inside!Just one tip, we went with a private tour and I asked them to include this attraction to the original program, but I didn’t specify it very well. The Naval Cathedral is located on the island of Krondstadt and what they understood is that we wanted to visit the whole island…the only thing I actually found interesting was the Cathedral. I mean, if you have a lot of time in St. Petersburg than maybe you can do the whole tour, but if you have limited time, just go straight to the Cathedral. Besides this little detail, that costed us two more hours, the attraction was really good!"
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "this miracle. This is the Cathedral in Kronstadt Russian naval fortress. Now it is an open city where you can go on a tour. Cathedral in Kronstadt is one of the largest cathedrals in Russia. Built with money from the sailors in the memory of all the dead sailors Russia. The sample is taken Cathedral. Sophia in Istanbul.Very nice!"
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "Beautiful Cathedral, hidden gem!. It was a bit of a drive from downtown St. Petersburg, I had local friends who took me there. I have never been in an orthodox service, so It was very interesting to be able to participate and observe how they follow their traditions. It has been recently renovated and reopened. The mosaics inside are really impressive. Very beautiful!"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Fabulous. After the restauration , this church dedicated to teh Russian Navy and the sailors died for the country is really beautiful . You don't have the charm of the old church in the city but definitely you should see it and spend some time in Kronstadt"
        }, 
        {
            "index": 111, 
            "rating": "3", 
            "review": "New does not mean better.. Well...what a difference. Naval Cathedral after reconstruction looks great on the outside. It is monumental, gorgeous and absolutely attention grabbing. And you are looking at it from the Anchor Square and you have been in some big Cathedrals before... I recommend you to keep it like that. Because if you decide to go in you probably would be disappointed. YES, it looks nice. But NO, it looks so cheap and mainstream. The floors are covered with primitively designed pictures somehow associated with the sea and water(e.g. Fish, seagulls) and just random figures. Parts of the walls that start a little over your head are painted cheap and look mostly like a wallpaper. Windows are made of painted glass pieces, not even a mosaics. Only thing I loved was the ceiling. It looks awesome compared to any other part. And well... Just a little hint for ladies: be sure to wear a piece of headwear because otherwise you attract too much attention and risk being stared at ;)"
        }, 
        {
            "index": 112, 
            "rating": "2", 
            "review": "Why is this ranked number 3?. I have a bone to pick with Trip Advisor on this one as Kronstadt doesn't really even count as St. Petersburg and if you go to the city, especially for a weekend, your time is far better spent in other locations than taking time out to go here and see the Naval Cathedral. It's a pretty sight, sure, but would max spend one hour here and only when I've seen about 10 other things ahead of it."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "This was my wife's favourite. Why? while there, they were baptizing little babies. My mother was greek orthodox, so I have an understanding of this groups traditions.Well worth seeing."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Really impressive!. The cathedral does really produce an impression! I've been to many cathedrals, but this one is very special. It's beautiful, grand, very light and the central part inside reminds the front part of a ship. Besides, the cathedral is maybe one the few places which successfully combine a museum and religious traditions. Everything looks so natural, even exhibits seem to be part of the inside architechture and don't ruin the inspiring and respectful atmosphere inside.It' a real treasure, don't miss the opportunity to visit it."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "An Active Cathedral - Still Delivering Services. As this Cathedral is still an active place of worship, be aware that those deemed to be wearing inappropriate clothing (shorts/mini-skirts, sleeveless T-shirts etc.) will be stopped from entering.In addition, it's important to know that visitors are expected to remain hushed as many tourists/locals are praying. It's possible to 'light a candle' in this beautiful sacred place (charged for in local currency) to honour the memory of loved one's who have passed. If looking for a place of serenity - for a short period of contemplation/medication, I cannot think of a better place to recommend in St Petersburg."
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "Small but worth peeking in if near the theatre. The nice thing about this cathedral is you hardly see any tourists, it's mainly locals coming in and praying. Due to this, you can't actually see much of the building, but the part you can is really peaceful and beautiful, gives you an idea of what the daily use of a cathedral in Russia is rather than commercialized ones. Definitely recommend if in the area!"
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "absolutely impressive! strongly recommended!. This is one of the examples that Russian restoration processes could reach best results! this is really impressive cathedral and if you have some 6-7 days for St.-Petersburg it is worth to schedule a trip to Kronstadt. My advise it to calculate at least one hour to spend for this cathedral because there are a lot of small and interesting details and I am sure you would need some time to get the impression. Strongly recommended for everyone!"
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Beautiful. This church is a beauty in white and gold. The church is massive in structure and from its interiors as well. The whole architecture in itself is stunning and the interiors are equivalent to this as well. The chapel and the altar is huge and the whole place is decked with beautiful pieces of art. It is a beautiful church and worth the time. There are food stall around the place but is kind of expensive"
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "Our first visit in St Petersburg. This was the first place we visited in St Petersburg. A lovely building and we were lucky to witness a service whilst there."
        }, 
        {
            "index": 120, 
            "rating": "3", 
            "review": "Interesting but look enjoy from a distance. If you are not staying long term or if you are not going there for another reason then enjoy the sight form Nevsky Prospect. What you see is what you get. Very interesting and alluring building but that is about all.. Much more fun to look and take photos from the street. Lived in St. Pete for 7 years so take it from a local resident!"
        }, 
        {
            "index": 121, 
            "rating": "3", 
            "review": "Church is ok. This church has history behind but nothing compare to the other churches and things in St Petersburg"
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Beautiful Church. Was lucky to visit as some Baptisms were going ahead and found the church very peaceful and reverent although it was busy and full of families trying to find the correct party - there were 3 baptisms and a wedding all taking place at once."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Beautiful Church. We went with local friends and the church was beautiful. There ws alot of work put into it. One of our friends who saw it before restoration was amazed at its beauty. However thw surrounding area shows the decay of the Soviet era. They had small vendors and the food is pricy, but there was some for the day was warm and the ice cream was good,."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Beautiful. We visited on a Sunday while the service was in progress. Absolutely stunning cathedral. Much brighter than the church on the spilled blood, well worth the journey"
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Finally worth seeing. I had the privilege of seeing it in the Soviet times when it was some state public institution, then during the remodel period where money was short and the process slow, and finally, recently, as it's been return to its prior splendor. Huge thanks to all those who put the work into making it happen, as it truly is a highlight of traveling to Kronstadt."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Immersion experience. This active church is in the traditional Russian Orthodox style...every inch of the interior is covered with frescos and icons, the light is dim, and the ceiling is not as high as Western churches. We visited during the 10 am service and a small choir of clear voices responded to the priest's invocations. Candles and candelabras flickered before the icons, seemingly animating them. Worshippers stood for the service while we silently observed from the back. A very worthwhile experience."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Beautiful!. Just beautiful! Inside or out, it commands admiration. No guide needed. Can be seen in reasonable time! Beautiful icons abound!"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "A great renovated cathedral. This cathedral has some interesting history and it was recently renovated. It's amazing outside and all shiny inside. Walk around it, there is a statue of admiral Makarov.Also the island is very pretty and the park by the shore is right near the cathedral."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "YOUR FIRST STOP. Comparing with all the things that you are going to see in St. Petersburg this is OK. It takes only an hour to go through anyway. So do it."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Island and cathedrale to see. Fully renovated with great decoration inside but also by walk to have a look to the harbor as always few boats are around,"
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "Beautiful. A very beautiful church of blue. The church has a separate belfry, as common in Orthodox tradition, and it is just as beautiful. Great, quick stop on a tour of the city."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "A small gem. A nice active church a bit outside the citycenter. Many city tours take you there and it is a refreshing alternative to the bigger churches"
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "spectacular building and good views back across neva River.. We walked here from our hotel of a Sunday Morning. The core buildings can be seen easily from the other side of the Neva River buts its great to see them up close and to explore the fort itself."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Huge. Well the cathedral is really a huge building, and I guess if you are in Petersburg for more than a week you should visit it, but I believe it is not the nr. 1 attraction in the Petersburg area"
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Wonderfully peaceful. I very highly recommend investigating Kronshtadt, and I say so particularly as a foreigner, since the impression I have is that Kotlin island is very much overlooked by visitors. The peace of the town, its sea bay fronts, and the incredible cathedral, all with the fresh clean coastal winds, are like medicine for the muddy-headedness that might set in after a few too many days underneath Petersburg's magnificent but aggressive architecture.The peace of the cathedral is enhanced by the beautiful old drained gorge running by, which is uplifting in contrast to the flatness of the inner city, and the canal grid with the dilapidated brick complexes by the banks made a beautiful walking route, even feeling (to a Brit) eerily familiar. Kronshtadt garrison is a small place of great but often overlooked historical importance politically and militarily, and the naval cathedral is a perfect milestone to aim for on a visit, particularly when you can catch sight of the golden domes over the old naval installations as you get closer.Not least, the journey itself to Kronshtadt is absolutely worth making for its own sake, the stretch from Lakhta to Lisiy Nos especially, and the dacha areas and high rise outskirts of the city. True Russian sights, and - it cannot be stressed enough - totally easy and unbelievably cheap. 28r to Staraya Deryevnya metro, then 25r on the 101 bus from the bus park just to the north (slightly west) of the station, by the tram rails and Mebel city or whatever the furniture warehouse is called. The bus over to Kotlin is a busy one, but it is no hassle. There are useful toilets at Staraya Deryevnya in the Gulliver centre, and then on the ground floor at the rear of the commercial centre on Grazhdanskaya street where the 101 arrives (although that one will cost 20r).Kronshtadt was a highlight of my visit to Petersburg. I wish its residents well."
        }, 
        {
            "index": 136, 
            "rating": "3", 
            "review": "just a view. There is not some thing significant in the cathedral but it worth a visit even from its outside.Have not a straight forward address or transport to this place."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Beautiful, serene church. One of the prettiest churches I have ever seen. I would never have expected to find it in Russia. I am not an expert regarding churches, but this one is so calm & serene. It is painted a robins egg blue, white & has graphic black borders that make for amazing photos. Many angelic statues. This church is a much needed break from the overwhelming oppulence of St Petersburg. Itr's lovely just to wander around."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Unexpectedly beautiful site. This Orthodox-style (even Byzantine-like) church came up unexpectedly on our Kronstadt trip. It's very beautiful, reminded me of the Hagia Sofia and the Blue Mosque in Istanbul because of its architecture. Both from outside & inside it is pretty similar.The inside is quite peaceful & dramatic at the same time, dramatic because of all those information they have put in memory of the soldiers who lost their lives in various wars.Great church & also a memorial. Adds to the naval atmosphere of Kronstadt. Certainly the best sight on the island."
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "A jewel at the end of the city. We weren't going to bother visiting this church, as after gage a spilt blood church nothing can compare...but this is such a pretty church in a dirty part of town. Really worry a visit --however, it is a dodgy part of town..so be aware in the back streets ( and I was brought up in Central London in the 1960s )"
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Kronstadt cathedral. Had a fantastic opportunity to vist the cathedral on the island of Kronstadt, metro and bus to the island cost about the equivalent of $4 for the two of us. We visited on a Sunday while the service was in progress. Absolutely stunning cathedral. Much brighter than the church on the spilled blood, well worth the journey"
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Such an impressive structure, and beautifully detailed.. Not only is Kronshtadt such a charismatic navel town, very old and interesting, the Navel Cathedral was a spectacular sight. The level of detail outside and then inside is unreal! So nice to see such a beautiful memorial to fallen sailors."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "History. WE loved our visit to the Naval Chapel their was a service taking place when we visited so we kept at a respectful distance, it was also nice to hear the link with the chapel & the necular sub that capasied with a huge loss of life a few years ago & the link with the area."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "perfect Peterhoff. So much to see here, Peterhoff is a beautiful place, as you go from room to room, each is more beautiful than the last.The gardens are not to be missed."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "See the [tombs of] the Czars. Ok, so the country went Communist after 1917 and is a capitalist / kleptocracy now. This church and the candles lit by the tombs demonstrates that the people still have affection for the Czars, the last of whom ruled almost 100 years ago."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Amazing!. I have been to Russia many times and seen countless churches and monasteries. This newly restored Cathedral of St. Nicholas in Kronstadt is well worth the trip. The iconography is superb and the size makes you feel like you are in Agia Sophia in Constantinople. Just be sure it will be open before making the trip to Kronstadt."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "A must see. The outside is beautiful. We toured the inside,but if you do not have time to see the inside you will enjoy the beauty of this must see."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Great church with nice feeling. The church and its square in front of it look great, but the special feeling is when you see it from the inside. It takes less than an hour from SPB to Kronstadt."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Stunning. From the moment we arrived to the island passing the container yard \"moby dick\" to entering the city it was a delight, the island exudes history but the greatest moment was on entering the Naval cathedral.Be warned it is not open on Mondays! The architecture is breathtaking from the outside and the view as you ent er will make you wonder how it could have been used for dance hall and theatre in the good old soviet days.The frescoes, icons and wall decorations are magnificent and the restoration team must be congratulated on their fine work, it is stunning.The colours are overwhelming and the serenity is palpable, everyone has such respect for where they are and the space you are afforded to circulate is welcome.Take time to look and savour the place, well done to the sponsors for the time and money it would have taken to accomplish such a masterpiece, rarely am I moved by such a building but on that day I was.It is a fitting tribute to the Russian navy and its people, may it be loved and revered.Also take time for the city."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Wonderful Cathedral. It is one of the most beautiful church I've ever seen. It has been closed for reparations for many years and because of this is not so popular but it has opened again in May of this year so there are no excuses to not go there!!"
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "wow!. One of the most beautiful cathedrals I have ever seen anywhere in the world. Inside and out it is amazing!!!Worth the drive or the boat trip. Make sure you see it!!"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Magnificent. Although quite a drive (or boat ride) from the city, I can not recommend enough this scenic cathedral. Recently reopened and renovated, it is source of pride for people of St Petersburg. The cathedral is dominating the sea landscape from far away. On sunny day it's golden dome shining like a blinding sun.Up close it is even more impressive. Come inside to see exceptional art work. It is incredibly light insight and does not have feeling of typical dark orthodox church. After seeing multiple temples of worship around the world, this place really impressed me. Try to get there for Sunday service. People come there from far away to attend. Very interesting crowd."
        }
    ]
}