{
    "category": "Sydney", 
    "entity": "The-Spit-Bridge", 
    "avg_rating_stars": 4.721649484536083, 
    "review_count": 485, 
    "rating_stats": {
        "poor": 0, 
        "average": 11, 
        "terrible": 1, 
        "very_good": 109, 
        "excellent": 364
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "another scenic location. another scenic location / route in case you are hungry for more scenic routes and like to spend time there or just walk / jog"
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Enjoyable run. Ran across the bridge after watching it open and close for passing water traffic. Great spectacle and good photographic opportunity."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "The best walk I have ever done . The Spit to Manly walk was amazing. Beautiful views and walking through the bush. It was of medium difficulty up and down steps but it was so stimulating. I walked part of the way. 2 miles there and 2 miles back.\nWe had to pay $10 Aus for parking for 2.5 hours."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Coogee Lover.. The bridge is Ho Hum but the Walk from Manly to the Spit Bridge or the reverse is world class.Get a guide leaflet an do the walk early morning or late afternoon and enjoy Sydney at its best.If you get a ferry to Manly ,turn left and keep walking.,About 10 klms in all.At the Spit bridge you can get a bus or taxi back to Manly or a bus back to the city."
        }, 
        {
            "index": 5, 
            "rating": "3", 
            "review": "Vital Transport Link. The Spit Bridge, connecting the Sydney North Shore suburbs of Mosman and Seaforth, has played a vital part in the development of Sydney from Seaforth right up to Palm Beach, 40 km to the north. Without the Spit Bridge, access to these northern beach side suburbs would have been via other harbour crossings, involving much longer and more complicated routes.At the beginning of the 20th Century, the only crossing was by punt, a slow and frustrating procedure for those in a hurry.In 1924 the first Spit Bridge was built, a low-level timber bridge.This was replaced in 1958 with the current bridge, a steel and concrete girder bridge, with a bascule lift span to allow yachts and other boats passage across Middle Harbour, which is part of Sydney Harbour.The Spit Bridge is also either the start of finish, depending which way you walk, of the famous Manly to Spit Harbour-side walk."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Must do - Spit Bridge to Manly walk. Highly recommended. Offers beautiful views of the the city and Sydney Harbour. Hard to believe that one is still in the city while walking through the bushland. And of course a ferry ride back to finish it off makes for a great and affordable day out in Sydney"
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Views, Views and more views.. Not easy going after rain. Plenty of spots to stop and sit and take in the views or take a dip in the harbour. Well signposted. Good exercise!"
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "One of the most beautiful walks I've ever done. A relatively easy-going, refreshing yet stunning costal walk (3 hours start to finish...) which takes you through some amazing secluded beaches, pristine sands, small coastal towns and finishes off up high up on the cliffs with a breath-taking view of the North and South Heads before heading into Manly."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "A very special walk. Having done the walk in September you not only have superb views of Sydney Harbour and great weather (not too hot) but have the joy of seeing the many wildflowers that are out.This to me is one of the great walks around this magnificent harbour.Well worth the effort."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Brilliant Day Out. we bussed to the Spit Bridge and walked the longer of the two options (12 - 14kms) following beautiful paths that traced the coastline affording tantalising glimpses up towards some grand 'harbourside mansions' and down towards the occasional moored yacht bobbing away happily in little coves, and enjoyed a variety of stunning vistas and varieties of wildflowers as well as a little swim break at Clontarf Beach which is on the route, then the final section wends down through residential streets to the harbour ferry terminal, where we caught the ferry to Circular Quay... a stunning walk, not difficult, but take a bottle of water... happily there are no shops along the way!"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Beautiful nature walk in the city!. A wonderful path along the sea and in the residential neighborhoods, ending up in Manly where you can join a meal and relax on the beach with a swim in the sea!"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "This is a very good walk with lovely views.. One sets out from the Spit Bridge which is in a beautiful setting - then it takes you through some of the most lovely parts of Sydney with stunning views across the harbour and the Pacific Ocean when you get to Manly."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Great views, great exercise. This was a great experience for us. The views were spectacular but we weren't expecting such a great variety. From sandy beaches, rugged cliffs, thick forest that could have been a million miles from anywhere to beautiful suburban homes this walk had everything. It was also a fantastic workout with the hills and steps making us really earn the nice lunch we had at the end in downtown Manly. This walk is a must do for everyone"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Beautiful views!. Basically a 6 mile hike with many, many stairs, both up and down. Lots of uneven surfaces. Not for the faint of heart. But the views were fantastic! Take your time and enjoy. Bring water!"
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "Great walk. This is one of the great walks on Sydney's North Shore, great views along the way, and reasonably easy stroll."
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "Good walk. I did this walk and it was fantastic. Only issue was there were a few detours and one of them pointed you in the wrong direction which added about half an hour onto the walk.Would recommend doing as it is lovely and scenic just watch for the detours."
        }, 
        {
            "index": 17, 
            "rating": "1", 
            "review": "boring and waste of time. Boring , can't even find the path, poorly maintained facilities, and poor signs, can't even find my way, waste of time, takes a long time to go there too, dont bother"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Stunning views superb walk. Treat yourself to stunning coastal cliff face views, indigenous bush, beaches, and sea stretching way into the distance. A wonderful treat on a sunny day; complement the beautiful walk with a good meal in Manly or Spit Bridge... (or both!)"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Amazing way to appreciate this wonderful city . Really easy walk with the most spectacular views of Sydney harbour.Hint: start at Clontarf Reserve with free street parking, walk to Manly for lunch than a cheap Uber back to your car."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Much more relaxed than Bondi - Coogee walk. It was an awesome walk from Manly beach to Spit Bridge. The 10 km we made in 3 hours. Actually we were wondering the difficulty of this walk. It was mentioned with gentle - medium but we think it it rather medium. If you want to do the whole turn you need to be quiet fit as there are a lot of stairs/steps. It was a very nice walk with almost no people which was surprising. We fully recommend this walk. It was beautiful and a highlight so far. The Bondi to Coogee instead was also nice as well but very crowded."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "A beautiful walk with great views. This is an excellent alternative to Bondi to Coogee Coastal Walk. Perhaps a little longer but more varied as it passes through green vegetation as well as beaches with many great picnic spots along the way. The view of the harbour and over to Manly are breathtaking. Highly recommended even in not so good weather. Take a bus from Wynyard that goes via the Spit Bridge; ask the driver where to get off. The beginning of the track is reasonably easy to find, just under the bridge on the north-east side. Once on the walking path it is pretty straightforward although you have options to take side paths to mini beaches or view points. Along the way you will see lizards that might come quite close if you happen to sit down and eat an apple! In spring time you can see many wild flowers. There is one beach that you will have to cross continuing in the normal direction. If there is high tide you might need to take off your shoes as the strip of sand between houses and the bay is narrow. Once you are near Manly you again have to watch a little where you are going but the signposting has improved over the years and there are usually others you can ask for direction. Once in Manly, you may wish to visit the famous ocean beach before taking a ferry back to downtown and the Opera House. A great day / half day program!"
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Great two hour walk. It's a good 10k, 2 hour walk with some of the best views of the beautiful Sydney harbour. Take plenty of water and have a well earned bite to eat in Manley at the end. Would recommend catching the bus or taxi back to your staring point as I wouldn't like to turn round and do the all again!"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "A great walk. We took the Manly Ferry from Circular Quay to Manly where we started our walk. We are both in our seventies, the walk took us about three hours. Amazing views along the way. I don't think it is a walk that I would do in the heat of summer, as the last part is quite open. There are frequent bus services from the Spit to take you back to Manly where you can enjoy a delicious meal."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Amazing walk, proposed to my wife on it. A really good long walk, breath taking views, a good work out and a fun day out. It takes around 2 hours start to finish but plenty of amazing places to stop and enjoy the view. Gets a bit snakey/lizardy in summer but worth it to end up in beautiful Manly"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Lovely walk with breathtaking views. Easy walk from Spit bridge will take you through National Park. Follow the coast. Plenty of benches to sit, relax and enjoy the view."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Breathtaking Views. We did this walk a few weeks ago on a beautiful sunny day. The views were magic & the walk was a little challenging if you have bad knees or feet. We were blown away by the views and upon arrival at Manly Beach had the most beautiful fish & chips, followed by an indulgent ice cream. We then walked it all off on the way back as we felt guilt, however, it is easy to catch public transport back if you prefer."
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Another great walk can be done in half a day. Great walk with super nice views. In summer plenty options for a swim. It is an easy half day walk if done from Spit Bridge. But if you do it from Taronga Zoo it can be extended to a nice full day walk. Plenty of after walk options in Manly :-)"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Stunning Views. Take a bus (recommended) to the Fisher Bay Reserve near the Spit Bridge and stroll along the cliffs overlooking Middle Harbour. Takes about 3 hours. Recommend lunch (and a few drinks) at the Manly Skiff Club and then take the ferry back to Circular Key for a full day's enjoyment."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "A must do!. Beautiful way too see Sydney! Start off early and take it slowly to enjoy the beaches along the way. Stop off a Clonny's cafe for some walking snacks"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Free! No need to pay for tours. The walk is really nice to do and in one side and the other many public transportations! No need to pay for tours.For toddlers may be a little too much the entire walk.Loved doing it and will do it again for sure!!"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Beautiful walk!. This is an amazing walk...one of a kind views. The trail was relatively mild...although there were a lot of ups and downs with steps built into the trail. So if you had bad knees or have trouble with stairs this may be tough. Otherwise a great trail and would be suitable for most fitness level. A must due on a nice weather say."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Stunning walk. Absolutely stunning place to walk about .. incredibly clear views of the bay /harbours .. the air is so fresh and even tastes clean"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Beautiful Views. It might take you 2 - 3 hours and you probably need to have some fitness, but it is so worthwhile. The scenery is stunning. Pack some nibbles and stop along the way to enjoy the great outdoors. We took our time, stopping for photos and coffee along the way and had a picnic ... we found the walk easy and great fun. Once at Manly, we enjoyed a refreshing ale before taking the ferry back to Sydney. Yes, you can do the return walk, but we ran out of daylight !!! A must do when in Sydney."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Beautiful walk. We did the walk with our 2 kids ages 10 and 11. The walk is absolutely beautiful. We took the ferry from Circular Quay to the Manly ferry stop and walked back toward Spit. *There is an amazing candy stand when you get off the ferry! We made it halfway back before it started raining and the kids began to complain so we called an Uber and ditched the walk. If we have time I would love to complete the walk. It was gorgeous scenery! Don't forget to bring some water with you. There are also a few toilets along the way (but not many)."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Want a Workout with Stunning Views?. Much longer and more intense than the Coogee to Bondi walk, this walk offers a myriad of experiences....uphill climbs and downhill walks through bush, beach, parks and local streets.Make sure you plan your trip well as it will take you 3 hours one way and you need to factor in travel times depending on where you are coming from. We caught a train to the city, a bus to The Spit, did the walk to Manly and then caught the ferry back to Circular Quay and train home.We went in the cooler months which was very pleasant but I believe those that do it in the warmer months, take extra time to jump in for a swim at different beaches along the way, to cool off.Whichever time of the year you do this walk, you won't be disappointed."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "perfect views around the harbour and a great morning walk.. Great mix of bush, beach and views. Take plenty of water and get ready for some stairs and a decent climb. I took the 9 year old and he coped well with plenty to look at and do. Allow 2 - 3 hours and then enjoy Manly at the end. If you eat too much there....walk back"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "LOOKING FOR A HALF DAY WALK IN SYDNEY?. Nice fine day in Sydney and not certain what to do ? Then try the Spit Bridge to Manly walk .I once dropped off a Scottish friend of mine at the Spit Bridge and said he could walk to Manly where he was staying . I did however forget to tell him its a 3 hr to 4 hour walk depending your pace and how long you linger . It is though one of the best walks in Sydney and not difficult really. Try it and you won't be disappointed . Easy access out of Sydney via a bus service or walk it the opposite way from Manly and catch the bus back to the city . Food is available at the Spit and at Manly"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Decent hike, spectacular views! . Myself and 2 friends did this walk a couple weeks back, it was amazing!You'll need to be reasonably fit as its a 10km walk and some parts are quite steep. We started at manly, walked to the spit and bused it back to manly after. Id recommend good walking shoes, plenty of water and a camera. We saw a lot of birds along the way including yellowtail black cockatoos and various other smaller species. The highlight is always reef beach! Take swimmers if you go during the warmer months, reef beach is a perfect spot to stop for a dip. "
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "We did this with family. If you are keen for a great walk with fantastic views of Sydney Harbour, this is a good activity with anyone. Maybe not for small children."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Fantastic day out. You need to be reasonably fit to do this walk. There are parts where it is somewhat difficult.. The views are spectacular, and a great way to exercise in the fresh air.. In spring the wild flowers bloom. There are a couple of places to stop and swim, have a picnic or just relax and enjoy the views. Sunscreen, hat and water bottle are recommended."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Beautiful sites. A very good place to see the Harbours beauty , lovely walks and scenery , suitable for all ages, check out all these places for the disabled before you go."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Amazing trekking on Sunday morning. I did this walk twice already and would do it again! The scenic is amazing and it's not too hard, so a beginner can also do it. But it will take you 2-4 hours to finish it from Spit Bridge to Manly wharf, but it's worthy! There's cafes on the way and you will stop for photos a few times too. At the end you can reward yourself having some food in one of the countless good restaurants in Manly."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Spectacular views, beautiful walk, must do!!. If you take the bus, please let the driver know you are getting off at the Spit Bridge; otherwise you have to walk back and find the sign of 'Scenic Manly Walk' and it isn't that easy. However once you get it, just keep following the well-marked route.Cross The Spit Bridge on the Middle Harbour side and walk into the car park and find the steps leading down under the Bridge to the start of the Track. You will see the stunning views from the waterfront before disappearing into the bushes. There are toilets clearly marked at strategic points. You can choose to have a picnic along the way it just stop and enjoy the quietness.When you arrive at Manly you can spend time at the gallery or have lunch at the restaurant nearby (very new it seemed) or just take the ferry that takes you to Circular Quay (duration is 30 mins)and you get a wonderful view of the Sydney Opera House and the Harbour."
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "Must do activity when in Sydney!. This was a great activity to do and affords one the opportunity to get out of the busy sydney for a while. The walk is splendid, mostly with views of the water but still well covered by trees. The route is also well marked and approximately 9 kilometers. A fantastic way to burn off some of the extra holiday calories. I walked on a very hot day, and enjoyed every moment! Remember to take water and sunblock!Once you arrive at Manly spend some time at the wonderful beach the way the Ausies do it , and grab something to eat. We ended of a great day by taking the ferry back to Circular Quay..."
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Varied scenery. This walk traverses forested National park & coastal walking. Long, but varied with shade a welcome relief in the heat."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Unforgettable Coastal Walk. Its a beautiful scenic walk with a view of the city and the pacific ocean. Its a must going attraction in NSW."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Brilliant Winters Day Walk. Heard a lot about this walk but had been put off by the logistics of it not being a round trip for walk. However we parked at the Spit Bridge end on the Manly side and Uber back to the car for $15 between 4 of us so better than a bus! Scenery to die for with new views around every corner and a good work out for an afternoon. Track was narrow in places so needed to be aware of other walkers and we missed the turn off to the lighthouse ( next time) . Plenty of up and down so those who are after the exercise this is great. Personally I think this suits the cooler months and finish with a meal in Manly. I must do with active over seas visitors."
        }, 
        {
            "index": 48, 
            "rating": "4", 
            "review": "Nice but wouldn't do it more than once. Getting here by public transport is a bit of a nightmare, our bus dropped us off by a main highway and we had to bolt across the road to get to the starting point of the walk, it was quite confusing. The walk itself is nice, lovely scenery and you can even reach some Aboriginal carvings in the cliff. You eventually reach a few beaches which is nice but they're quite dirty and I wouldn't advise to swim in them. It was nice to see that part of Sydney but I'm not rushing to do the walk again any time soon."
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "City hike with a bush feel. A bit busy and congested in parts but overall a wonderful walk. Watch for the big muddy puddles if it has been wet. The signage was a bit hit and miss resulting in us taking a strange suburban detour. All part of the adventure though."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Great day out. Walk one way and bus baack. Beautiful beaches. Great for summer or spring and Autumn. Average fitness required. Lookouts over the harbour. Finish your day with a glass of wine at Manly wharf"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "❤️My favorite trail in Sydney. Highly recommend❣️I went to with my co-woker after long flight from Vancouver Canada. It took 3 and half hours. Even though we were jet lag tried but we really enjoyed so much❣️\nSurrounding beautiful nature and awesome cost line❣️Enjoy❣️Cheers❣️"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Skip the Spit Bridge and start in the Clontarf gardens.. Personally, I dont like the spit Bridge so when doing the walk I start in the Clontarf reserve. Parking is better and getting back there is easier too. It's an easy walk, for keen walkers of all ages. The views are just amazing. My favourite bit is around the Grotto Point Make sure you don't miss the aboriginal engravings when there. There are no toilets and no food to buy on the walk. So , either stock up in the Clontarf cafes or in Manly. ALso, I don't think there are any water fountains, so make sure you have sufficient amount of water with you. The walk is partly shaded but still make sure you have a hat, camera and some snacks.Let the views, the ocean and the bay do the rest. It's so rewarding and recharging you will feel miles away."
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "Beautiful Bush walk with all the Comforts. A great scenic way to see Sydney's Middle Harbour as you stroll along the coastline up and down. But you are never very far from a kiosk or Cafe. Highly recommend. It do during the week if possible as it can get busy on the weekend!"
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "in top three walks in sydney. This is definitely one of the nest walks in Sydney. Beautiful Manly, around the foreshores with great views out to the heads."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Some of the best harbour views in the world. This walk (on which I proposed to my wife, so it has special significance!) is about six different walks in one - there's forest, scrub, clifftops, beaches and views, all wrapped up in a couple of hours of beautiful walking. The path is carefully maintained, and if you walk Spit to Manly, there's ice cream at the Manly end too!"
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Worthwhile challenge. This is a demanding walk that will take 2-3 hours each way. The views are amazing so it is well worth it. The track is mostly unsealed, though at the Manley end you walk on road and concrete paths. The grade is mostly easy, but there are some steps and a few short steep pitches. Great to leave the car at the Spit (plenty of parking) walk to Manley for lunch, and enjoy the stroll back to your car in the mid afternoon."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Sydney Walks not to be missed. This walk is not only spectacular it provides an amazing opportunity to see parts of Sydney that can appear to be hidden and yet are available to all and sundry."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Spit to Manly Walk. Excellent walk along the coast line with great views.Takes around 2 hours and 1.5 hours if just walking and not stopping often."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Just beautiful ..... This is a beautiful walk. Not strenuous but long if you are unfit. Bring a small picnic to have along the way as there is nothing along the way where you could buy a drink or food. We did it from Spit Bridge and it is well sign-posted. The vegetation and views change along the way but we loved the whole walk."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Great hike with spectacular views. The trail is about 10km long and quite hilly, but still it only took us 2 hours to finish instead of the 3-4 hours they said. this is one of the better walks to do in the Sydney area."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Sydney bridge walk. Well I am not one for the heights but once you get over that fear and it is perfectly safe you are tethered to the bridge at all times and the staff is truly experienced and well trained. Take this tour and walk the bridge the sights are unbelievable and the views are unsurpassed. It is fun and all ages and physical types can do it."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Gorgeous views. I finally did this walk last year after hearing about it from others. It didn't disappoint - the views were spectacular and the hike was long enough without being too physically strenuous. The trail is very well maintained, and meanders through vegetation, alongside rock ledges, past hidden beaches etc. Will definitely do again."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Best views in Sydney. Highly recommended for some fresh air, great coastal views and a good workout. The track is about 9kms long and quite hilly so be prepared."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Great walk and spectacular views. This is a moderate 9.5km. walk which you can take in either direction. It follows the harbour around to the Sydney Heads where ships enter and leave Sydney's beautiful harbour. While there are some steps and hill climbs, it is suitable for all ages if you take your time, anywhere from 2-4 hours, depending on your level of fitness."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Great walk. Spit Bridge to Manly as opposed to the other way is the best way to do this walk. You finish on the flatter part of the walk and ending in Manly gives you café/lunch options that don't exist at the Spit Bridge end and better transport options to go home. The walk is a good 2.5 hours and well worth it. You don't need to be an experienced walker but it is very up and down so you need to be good on your feet ie not for wobbly grannies. Great opportunities to also have a dip in Middle Harbour on the way if you wanted to."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "One of Sydney's great walks. This walk will take you from The Spit through the Fisher Bay Walk, Sandy Bay and Clontarf, before getting through the Sydney harbour National park and jilling Cove into Manly Cove. A minimum level off fitness is required to negotiate some hilly terrain in the Sydney Harbour National Park, rewarded with great harbour views. The perfect plan for a sunny day, preferably out of summer."
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "10 km walk The Spit Bridge to Manly Walk. I did the Spit Bridge to Manly walk with my 11 year old son last year. The 10 km walk is a great experience for my son who basically loves the amazing sights , beaches & coastal walk. Passing along the beautiful ,idyllic places, sacred to the Aboriginals before the development took place. Seeing the water dragon lizard up close & personal, wildlife plants and the serenity and stillness of the place once you reached the top of the hill is unimaginable. Walking along the coastline is a magical experience especially for a 11 year young boy. Although , there are some spot that you lose signal from your mobile but not for long. I'll strongly recommend to pack some food & snacks, bring a lot water. Autumn is a good season to do the walk. The highlights of the walk is you get to jump in any local beaches after the walk before you head home. Buses are frequent that travel to the city after the walk of you can head back to Manly beach and take ferry going back to the Circular Quay."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "The Best (FREE) Sydney Attraction. This is one of the best things you can do when you’re in Sydney!Beaches (tick). Famous Sydney coastline (tick). Free (tick).Pack your day bag with a small picnic lunch, catch a bus to the Spit Bridge and begin your adventure! We took just under four hours to complete the trek – that’s including spotting umpteen times to snap stunning landscapes, a 45-minute break at Reef Beach and a slow ‘n’ steady pace. Take plenty of water, sunscreen and your swimmers – there are no shops or cafes on route until the very end in Manly."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "My favorite coastal /bushland walk in Sydney!. This is Sydney's best walk! It takes you through some secluded beaches, bays and inlets and amazing parts of the bushland.The walk include a combination of sand, flat, steep, stairs and rocky walks- but it is well sign-posted and there are plenty of water taps and toilets on the way.We mostly start with a take away coffee at the Clontarf beach and then start our walk from there. But if you are up for the challenge then it will be worth starting from Balmoral Beach.It takes about 3hrs 30min, so make sure you have a snack handy, as there are no cafes or shops until you reach Manly.Keep an eye on the water as you might be treated to the whales or the penguins."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "One of the best walks in Sydney. Do yourself a favour when you have a day to spare and do this walk. You can drive to the Spit Bridge and find a car park the catch a bus back up from Manly when you finish the walk. OR Catch a bus to the Spit from the City and go back on the Manly Ferry- more fun.You probably wont have the walk to yourself as its popular with the locals as well, so look out for mad runners belting through the scrub.Plenty of variety in the walk from walking through scrub to walking along beside white beaches and sparkling water or looking out over the magnificent Sydney Harbour with all its activity as you descend towards your destination. I suggest you take a picnic lunch with you and sit on one of the lovely little beaches for your lunch.A gem."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Fantastic and challenging trail run!. Of course you can enjoy this walk just as much by walking the 10km, yet today I felt like a little more exercise, and ran most of it - choosing to walk all the steep stair sections. This walk requires good shoes, drinking water, and being prepared for 2 hours or more of challenging ups and downs. There are toilets close to the Manly portion of the walk, yet you are very isolated for much of it, especially from Clontarf reserve to forty baskets beach. Take sunscreen, sunglasses and a hat on sunny days, and maybe even a snack to enjoy the lookouts!"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Long beautiful walk. Started this walk at spit bridge at Mosman and took me all way to manly . its 10 km walk with some most beautiful views of the places . You can take the bus to spit bridge or you can park somewhere and then enjoy your walk . Make sure you take heaps of photos as views are breathtaking"
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Perfect scenic walk. This walk was in my list for so long and I am so glad that it didn't disappoint me. in fact it was amazing walk. Though I read somewhere that between May-November is a season when you can spot whales on this walk but I didn't have that luck. Having said so, I enjoyed this walk fully. I stared from Spit Bridge and walked till manly. If you are going from City, you can take bus # 178 which takes approx 25 mints to reach The spit. I travelled on Sunday, so frequency of the bus was once in an hour.The walk is somewhere between Easy to medium (there are few steps) at some places. I could spot some elderly people as well as people with toddlers on the way. But you cannot take strollers on this walk.It takes approximately 3 hours if you halt occasionally for couple of minutes as it's 10 kms long stretch- perfect for a day outing. There are some small beaches on the way where you can take dip if you like."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Well maintained track with great views.. I did this walk with a friend on a beautifully clear autumn day. We started by crossing Spit Bridge (there are many buses which stop just before the bridge) and picking up the clearly marked coastal path. The 10km walk winds around picturesque headlands and through harbour side bush and past plenty of secluded beaches (perfect for a swim on a hot day!). There are also marked places of Aboriginal importance, so make sure you check out some amazing rock carvings, and take a look at the view out to sea while you are there. Some of the lookouts face back towards the city and others provide a beautifully clear view out to North and South Head and the sea. There are a few places scattered along the walk that would make good lunch stops, or it is possible to do the walk and make it to Manly in time for lunch (as we did). Some of the track is quite exposed and there is not always a lot of shade so definitely take a hat, sunscreen and plenty of water, as well as sturdy shoes as there are some steep inclines and steps. This is a great way to spend half a day (or stretch it out for a full day). There is plenty to do at Manly and the ferry is the easiest (and most enjoyable) way to get back to Circular Quay. This is a great way to see some iconic places in Sydney and to get outside for the day."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Great walk with beautiful seanery . It is a lovely walk, about 10 km since one of the last part was close and you need to take the detour. The scenery is lovely and you can stop along the way and rest at the different beaches. Very important to carry enough water and food, especially if you have young kids with you."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Your vitality will be restored whilst watching Sydney Harbour sparkle.. Sydney Harbour is beautiful. During the summer months we enjoy the best of the both the Harbour and Surfing Beaches. During the cooler months we love the walks between Mosman and Manly. My children love this walk and the adventure of discovering new parts of nature. The Spit Bridge to Manly Walk is an easy walk. You will experience the beautiful beaches, walk through the National Park, listen to the birds sing and reward yourself in Manly with a coffee, gelato or mineral water. Become revitalised as you immerse yourself in one of Sydney’s most beautiful walks."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": ",lovely walk. The walk took about three hours but we did stop and pic nic on the way. You pass some lovely beaches and we wished we could have stopped for a swim. It was rather hot the day we walked so maybe late morning early afternoon was not a good time! We came back on the ferry. A lovely walk so close to a busy city. Loved Manly so different from Sydney, very laid back."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "An easy enough walk aroubd a superb area of the inner harbour. This is a wonderful walk. Do not be put off by the distance - take your togs, stop off along the way - refresh, eat a picnic, it is a wonderful way to experience a lsow take on a great part of Sydney. Bus from the CND, get off at the Spit Bridge, end at Manly and take the freey back to the Quay. Wonderful. Don't forget the official nude bach on the way for a swimmers free dip!"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Amazing harbour views. There are some incredible views along this walk- it's hard to believe that you are in the middle of the city! On a clear day the harbour sparkles & the gentle hum of the native bush is very calming. Ok, it's not a walk for your Granny on her frame- but most people could manage it, if you take your time. "
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "Long, But Beautiful!. I use to walk along this walk for school sport and it would feel like it took hours on end (views of a 15 year old school girl years ago) but in all honesty, if you enjoy the outdoors, love the water and long walks you can not go wrong with he Spit Bridge to Manly Walk! its beautiful and very peaceful! i would strongly suggest be aware in later hours of the evening as I once ran along this walk a few years ago and caught a man in the bushes doing things he shouldn't have been doing. We reported it, but they never found the man. just be careful as it is along bush, water, and paths that can be hidden from everyday people."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Amazing views, pretty easy walk. If you are visiting Sydney, or if you are a local and haven't done this walk yet, it's a must do. Take a sandwich and stop at any of the hidden beaches or look outs on the way, and finish up your afternoon having a drink and Manly before catching a ferry back across the harbor. I literally could not imagine a better walk to take visitors on to show off Sydney's beauty."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Gorgeous walk on a fine day. This is one of Sydney's great walks; in fact possibly one of the best walks in the world. You'll need decent shoes and a smidgen of energy to make it up the steep spots but the walk rewards with plenty of places to stop for a swim along the way and sensational coastal views. Drive or bus to Spit Bridge and take the bus back from Manly or ferry into the city. Make sure you reward yourself when you get to Manly - plenty of places for a cold beer, delicious ice cream or snack."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Wish we had more time. We visited Australia in April and a few people from Oz recommended doing this walk as it was beautiful. Unfortuantely we ran out of time and never got to do it but will be doing this when we return. If the locals recommend it, it must be something worth doing."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Fantastic coastal Walk. Walking through a mix of bushland and scenic harbourside trails, the 10 km Manly to Spit Bridge coastal walk is made of short tracks. You will be passing some of stunning beaches. The walk took us around 3 hours to finish it. Highly recommended if you are in Sydney for few days."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Fabulous walk along Sydney foreshore. Lovely walk along the most beautiful shore in the world.The walk takes about 3 hours long in a leisurely pace (and kids in tow). Make sure you have good walking shoes specially if it has been raining a day or two before you go. On a hot day, bring your swimmers and take a dip in the few beaches that you will find along the way. Bring water and sunscreen with you.Do the walk as early as you can. The walkway gets very busy from both direction."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Magnificent. The walk was worth every moment. Very picturesque. Planning is required to get back to the start, but nothing remarkable comes without a little effort."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Sydney's No. 1 attraction. It doesn't get better than this. It's quite a distance and will take half a day, but it's worth it. Lovely beaches, stunning harbour views, fabulous houses and an easy to follow path. I'm a Sydneysider but I've done a lot of travelling and I'd put this up against pretty much anything the world has to offer. If I had to recommend one thing to do in Sydney, this would be it."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Bushwalking from Manly.. If you've done the Bonid to Coogee, Shelley Beach and North Head. Been across the Harbour near Tarronga zoo. The next inner city nature experience is the Manly to Spit Bridge walk. It's about 10 km and well worth it. Once you've done this one, your ready for Kurringai National Park and the amazing southern Royal National Park."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Worth the effort. Go on-line and work out which bus to catch to get to Spit Bridge. It's a 20 - 30 minute trip depending on the traffic. The walk winds around the bays before climbing up through the bush to above the tree line. Magnificent views. Then a descent back to the sea where Manly is visible \"just over\" the other side of the water. But don't be fooled, there is still a fair way to go. It's well signed. A moderate level of fitness is needed since the track undulates most of the way, and some bits are reasonably steep. Relax on the ferry back to Sydney"
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Beautiful walk from Manly to SpitBridge. We took a ferry from Circular Quay to Manly. As soon as we came out of Ferry, we saw the board pointing the way to spit bridge walk. There are many pointers on the way except at a point where there were flight of stairs going up and down the hill. Here there is no clear indication which way to the spit bridge. So we took the steps going down towards the beach and started proceeding climbing boulders until such time that it became difficult making us to retreat and take the steps going uphill. We lost about 20 minutes in this little confusion. Towards the end when we reached the sandy beach again we didn't see any pointers to spit bridge. Other than these two drawbacks it was a lovely walk which we took about 4 hours to complete. My 6 yr old son and 60 yr old father could complete this walk with little difficulty. It involves some climbing on the hills and a little bit on the sandy beach but mostly we were walking on paved pathways."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Fantastic Hike - in the city but in the bush!. Great hike. Did it in 2007 and last month in 2016. Well maintained trail (they were overhauliung parts of it in March 2016). On a hot day it is a bit of a slog, but again well maintained and great footings. You move in and out of views of the city and of Manly, interspersed with just bush walking. Nice elevated views of the water and coastlines, then down to sea level. Highly recommended. Take a bus, uber or taxi (come on, get a Opal car, easy bus ride) to the Spit. Trail is marked. At Manly, grab lunch at the pier on the ferry side- Hugos has GREAT pizza. Then ferry back to the city. A wonderful morning."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "A great coastal walk. We did this walk on 9 April and the weather was perfect. The route is well shaded so you aren't in constant sunshine but it is hot so make sure you take some water with you. There is one point along the way where you can fill up your water bottle if needed.We took the bus from Sydney which is really convenient and then returned on the Manly ferry. Fantastic views and plenty to see. Wear shoes or trainers appropriate for walking because even on a dry days there are wet patches. The ferry back is the perfect way to round off the walk, which takes approx 3 hours at a leisurely pace."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "An amazing nature walk in along the harbour. One of the best city walks. Up there with Bondi to Bronte, but much more secluded. This is a bit of a longer walk, but certainly one you cannot miss if you love walks. Start at Middle Harbour and make your way all the way around to the Manlay harbour..."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Excellent walk for locals and tourists alike. Outstanding views. Take a picnic and swimmers and make a day of it. Good transport back from the Spit to Manly for visitors - just check bus timetables before you go."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "unmissable if you want to experience sydney harbour coastal walk. fantastic walk can really just take your time ..we took 4 hours and ended up at manly wharf for late lunch and drinks before taking the ferry back to the city"
        }, 
        {
            "index": 96, 
            "rating": "3", 
            "review": "Good view with broken part. The view along the coast was great, but there are a lot of broken path through some park and road, as well the view have some building (manly side). Personally i will recommend coogee to bondi beach, the sea view are breath taking. How to get here: take bus from wynyard train station, stand C at Carrington street, a lot of bus from there, 178, 179 and 180 (more bus i supposed ). Stop before the bridge, and walk under it to the other side of the bridge and walk across the bridge. The walk start here.The route can be pretty heavy at certain point, but mostly are fine, look for the sign MSW (manly scenic walk) for the direction. When you arrived at manly, do not forget to go to 4 pines micro brewery, it's great bar (separate review )."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Don't miss this hidden gem of Sydney!. If beautiful, stunning, hidden paths, beaches, coves and view points are what you after this walk will not fail to disappoint. But on your walking shoes, this one is for the able bodied, I'd leave the little ones at home. Bring sunscreen and water. I would recommend a snack and swimmers to stop off at one of the beaches on the way. Enjoy!"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Probably the most beautiful harbour walk in Sydney. We usually walk from Manly to the Spit and then get the bus back but it is equally beautiful in either direction. We just like having Brekky and coffee at Plonk (beautiful cafe at Spit Bridge overlooking the wharf). There are so many amazing spots to stop and picnic or swim on the way. You could probably do it in a couple of hours if your really got a march on but don't, take your time and soak it in. Allow 3-4 hours or more if you want to make a day of it. This is a \"must do\"...put it on your Sydney bucket list!!!"
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "A stunning day out!!. If you have a day off to enjoy the natural beauty of the northern coast line in Sydney, don't miss out on this beautiful walk!! This 10km walk takes you thru private beaches and coves and stunning harbour views. It's very accessible with public transport on both sides of the walk. Pack a picnic lunch and water as there are many spots to sit and enjoy yourself. :D"
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "Great walk!. We did this walk on February 28th. We took bus to the Spit Bridge and after the walk - ferry from Manly to Sydney Harbor.It is a 10km walk that took us approximately 3.5 hours to complete with many stops for picture taking and stop for a swim on one of the smaller rocky beaches along the way. It was very hot. There are some places that are completely open with no shade; we burnt badly (especially ears and necks) even with sunscreen, because it was hot and sweaty. The worst combinations for me were steps up in completely open spaces on hot sun. There is also detour in the end of the walk.The walk offers spectacular views of the entrance to the harbor and over to the city, Downtown. Loved the Doggie Beach, our dogs would love it. I would do this walk again in some other season, not summer. The walk is beautiful, definitely would recommend it.The views from Manly Ferry were beautiful as well."
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "Fantastic walk - but give yourself enough time. This is a great walk if you are into such things but do give yourself enough time so you can linger, stop for a swim (or two) and get lost if you want to (or if it happens accidentally)and don't rush. And don't leave in the heat of the day. Part way through you will be in blazing sun (assuming it is summer) and this is the part where it is easier to take a wrong turn. Take plenty of water. Give yourself 4-5 hours to take your time and enjoy the views."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Scenic walking. A well worn and signposted walk offering great views of the magnificent harbour and its environs several hour walk but plenty of transport options available at either end"
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "Tiring. Did this walk on Saturday I think the weather was perfect for it. About 28 so not to hot but still warm enough to go for a swim. The views are amazing and some of the rock beaches near the spit reminded me of Thailand."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Discover a whole new side to Sydney Harbour. A three hour walk that takes you past private beaches, bush-clad inlets and breath-taking views of Sydney Harbour. Even if you are a local, this walk is a 'must' in order to see the Harbour like never before. The track is manageable and the bus trip back to Spit Bridge car park is regular and relatively direct. TIP - Make sure you pack your swimmers for a dip in Manly Beach when you reach your destination. A brilliant way to relax if the sun is out!!"
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Wonderful way to see the northern shore of the harbour. One of the many great walks along the harbour. Leave your car near the bus stop on the north side of the spit and walk all the way along the coast (including a couple of suburban streets) until you get to Manly Wharf, where you can get a bus back to your car, or you can get the bus all the way to the city. Take your swimmers and have a dip on the way."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Great views of the Harbour. Easter Friday 2016 - Manley Wharf to Spit Bridge. Well marked walk through National Parkland. Stop along the way to take in the views across the harbour & watch the Manly ferry cut its way to Circular Quay. Take drinks and a snack - there are no shops along the way. Take a moment to see the engravings along the track near the Grotto.There were heaps of family with kids. You can access little beaches along the way too. Took about 3 hours at a leisurly pace.I took the ferry to Manly to start, and a bus from the Spit Bridge at the end into the CBD."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "A demanding but worthwhile walk. The walking tour from Spit to Manly is a demanding walk that takes you through wilderness, forest, Aboriginal history, famtastic views and finishes in Manly, where you can purchase a much needed meal. The tour takes a 3 hours (we did it in 2 1/2, but we're young and took no breaks)."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Beautiful way to grasp Sydney Harbour any time during the year.. Make this a round trip. You'll need a day .Take a bus to the spit. You 'll find the walk on the north side of the bridge.The walk is full of surprises with great snap shots of the Harbour.It can be busy but still very pleasant.Take some food and water as there is not too many place to eat on the way. But on your arrival in Manly, you'll find many beautiful food places. Take the ferry back to Circular Quay and that will complete a Fantastic day !"
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Moderate level of fitness level.. Great walk. I live in Sydney and have done this walk many times. Secluded beaches and views across the harbour. Mainly flat walk shaded by vibrant angaphoras (beautiful gum trees with rust coloured bark). The walk is around 12kms but is steady and not too taxing. Take a bottle of water, wear your swimming costume and take a dip in the pool at Fairlight then continue around to manly for lunch."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "One of many stunning walks!. You just can not fault this entire area. Each walk is breathtaking and picture perfect. Great picnic locations and fresh salty air everywhere you go!"
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "what a walk!!. Quite difficult in parts - lots of climbing steps and or rocks - but very clearly marked. take your own water."
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "Something you must do when visiting Sydney. The walk will take you to an amazing journey, look around you as you will find some wild life animals and enjoy some beautiful landscapes. Be sure to bring your swimsuit as you will encounter some nice beaches along the path.The path will take 2 hours more or less (according to your speed and if you often stop to take picture), take some water with you as there won't be anything to buy any along the track. Also, there are a lot of steps so I wouldn't recommend it for a pregnant woman or an elder person."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Great for Pics. This iconic walk, whilst exhausting, provides beautiful lookouts allowing a glimpse of the gorgeous coast. This walk is perfect for tourists, wanting some great memories and also locals alike. Just don't go in the heat of a day without a water bottle."
        }, 
        {
            "index": 114, 
            "rating": "4", 
            "review": "A must do!. We took the bus from Carrington Street (behind Wynyard Station) and got off at Spit Bridge. Decided to do it in reverse to take advantage of the facilities at Manly at the end. There appeared to be a couple of restaurants at the Spit Bridge and also toilets in the park. It had rained heavily the night before so the path was very wet and muddy in places, definitely wear very good walking shoes. We stopped in the park at Clontarf to eat lunch (there is a kiosk there as well as toilets and a place to fill a water bottle) Not sure how this took some previous reviewers less than 2 hours, it took us 5, we were taking it easy but I don't think it would have been possible for us to do it in less than 3 hours unless we did not stop at all. This was strenuous in places if you are not fit, a bit of climbing up and down. They were in the process of installing steps closer to the Manly end when we were there, I'm sure this will help with the muddiness on the trail. If you enjoy walking this is a must do!"
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "A fabulous walk. We did this walk in reverse from Manly to Spit Bridge. We caught the ferry to Manly walked for several hours and then took the bus from the Spit Bridge back into town to get a train home. Beautiful scenary and great excercise."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Man in Harmony with Nature. It is incredible that parts of this walk feel as though you are in wilderness and yet you are in the city."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Grgreat views - one of Sydney's bush highlights. Not especially strenuous and about 2 hours at decent pace Views are great and amazing to think most of it is away from housing Most enjoyable"
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Stunning views - a great walk!. We caught the bus to Spit Bridge and easily found the start of this walk, which takes you under the bridge and then follows the coastline to Manly. Some of the walk is through the trees, which gives the path more shade (which was welcome as it was a very sunny day). The path was easy to navigate and the views were so pretty! You can take your time, but take lots of water as it was hot. There were so many little spots where we could have stopped to have our picnic - it was hard to choose! We caught the ferry from Manly back to Circular Quay. It was a lovely day out."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Beautiful!!!. Really beautiful walk/hike. Its a 10km walk and they say that it should take around 3-4 hours to walk 1 way, but if you are stoping to take pictures or just to enjoy the nature, it takes way more time. The part from Manly to like Shelly beach was my least favorite as it was just a simple walk next to the ocean, not challenging at all ( i guess nice for families with small kids) and a lot of people around. All the rest of the trail was very nice. You go through Sydney harbour national park exploring wild nature. Part from spit to harbour national park has a bunch of really beautiful beaches. I saw a bunch of birds (like tawny frogmouth owls, penguins), lizards (water dragon) and so on. I really loved it, and it FREE.. ;))"
        }, 
        {
            "index": 120, 
            "rating": "4", 
            "review": "A beautiful walk with amazing views of Sydney harbor, the cityscape and Manly. This is a beautiful walk, with spectacular views including Sydney harbor, Sydney cityscape and Manly itself. The walk takes in a good amount of bush tracks and a few hills in places. It is a must do if you are in Sydney, don't forget to take plenty of sunscreen and water as depending on your speed it may take a couple of hours. I took my 6 year old daughter on this walk and she finished no problem. However, it may not the easiest for people that are less mobile. I would advise getting the bus to the Spit bridge and walking to Manly, this is due to the limited facilities at the Spit Bridge end, finishing in Manly means you have easy access to the Ferries, buses and shops, cafes etc.."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "A long walk, but a great way to see the area. We picked up a map at the Visitor Centre at Manly quay, then caught a bus to Spit Bridge, and walked back to Manly. It's not a flat, easy walk. There is a bit of scrambling, but nothing overly demanding, and it's a great way to see what the area must have been like before it was developed."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Daily walk . I live by this walk and do it daily. It's a really beautiful way to view this part of the world. Please bear in mind it's not just a stroll. There are some up hill ( and down hill) parts that if you have some walking restrictions wouldn't be suitable.Some spots would be a little roughy or some people. Wear or take a swim suit because along the way are some beautiful quiet little beaches that if you time right you could have all to yourself.Id say if you were a medium to fast pace walker it would take 2 - 2 1/2 hours with no stopping. However if it's your first time you must stop and take in the breathtaking views. Wear a hat, Take water , wear Proper shoes and clothing ( it's dry and sweaty work in summer) have a rucksack. You can do it in joggers, thongs and carry your water and phone if you want but why make life more difficult for yourself.Enjoy! Oh and when you have reached the Manly end its worth bypassing the temptation of the first cafe and do a little extra walk ( 500 yards?!?) to Whistler street to visit Ora for a healthy and delicious smoothie/juice/coffee or breakfast/lunch."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Good varied walk. I have done this walk twice during my visit here, once in each direction. As stated by others, this is a good varied walk on surfaced and unsurfaced paths, in the shade and out in the sun, by the sea and up above the cliffs, flat in places and uphill/downhill in others. The signposting is clearer for the Spit to Manly direction, but if you take the wrong turn while doing Manly to Spit it becomes obvious soon and you can get back on track easily enough. Previous reviewers and other sites state that it is 10 kilometres, but seemed more like 6 to 7 to me"
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "A superb outing. It's a walk. It's a hike. It's a meditation and eye-candy all rolled into one, and you have to work at it (some significant elevation if you do the entire walk. You are richly-rewarded with everything from sweeping views to wildlife (fragile-jawed lizards) to the pleasures of Manley wharf at the end. Do take plenty of water and oranges for quick carbs. You'll need good sun-protection and a hat - you're going to be out there for a few hours. But do not miss this."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Great walk.. Need a couple of hours to enjoy the scenery along the way but the path is well marked out and the walk is very good."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Beautiful and must do in Manly. This walk is a perfect way to explore Manly and it`s finest views. The walk is not that challenging so you don`t need to be very fit for this. I enjoyed this walk and the view and I would do this again if I were in Sydney."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "awesome. awesome breath taking views a true gem a must to do if your vist sydney .great tourist spot .ideal for dating or by yourself"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Stunning walk. Truly a great walk, amazing places to rest and take in the incredible views. Good for all levels and easy public transport."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Excellent scenic walk from Spit Bridge to Manly. I have been meaning to do The Spit Bridge to Manly Walk for ages and finally managed to do it.Approximately 10km long, it takes around 3 hours to walk it in one direction depending on where you start and how many stops you take.We went on a Sunday and it was pretty hot - about 29 degrees; however there was a nice sea breeze which kept us cool.There were quite a few walkers doing this route in both directions and there are quite a few shady spots which keeps you out of the sun. However make sure you bring sun lotion and plenty of water/food/snacks with you. There are some water fountains along the way and toilets if required though.You also pass a few beaches along the way which is perfect for cooling down in; however as it had been stormy the last few days we didn't go in the water as it says you should not swim due to the pollution. However we did have to take our shoes off near the start as you have to walk in the water along the beach for a bit so make sure you bring a towel to wipe off your feet!As you are following the coast there are many opportunities for fantastic views and you can see the city at some points as well as the Heads. There are some steps up and down so this is not good for prams or wheelchairs. Make sure you have good footwear too. Part of our paths were quite muddy and slippery due to the rain from the days before so be careful.When you get to Manly you can either get a ferry back to the city or a bus back which we did. You can start at either location but I think the way we went was less hilly (don't quote me on that though!).Overall a fantastic walk which you can do quickly or leisurely with lots of stops. There were even a few joggers passing us too."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Easy 10k. The walk will take about 3-4 hours depending on fitness levels. Don't forget water because it is 10km long. If possible go Mon-Fri. Every man and his dog goes on the weekends."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Energetic hike. The walk is hugged along the fore shores of middle harbour to Manly. Some parts you need to go on to the road. You come across a niudist beach if you care to take a dip! Rated medium a few steps at the beginning but relatively easy. When you get to Manly you are welcomed by the many restaurants. I recommend you take a ferry back to circular quay if you are staying in the city. To get to the spit bridge from the city is a simple bus ride."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "A Bush Walk Within Sight of the City. An easy walk with some superb scenic views of parts of Sydney Harbour, the Heads and the CBD. Catch a bus from Wynyard, get off after crossing the Spit Bridge, walk along the track until you get to Manly and then catch the ferry back to Circular Quay for a great day out in the open air."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "Lovely vista. Friends shared this beautiful view with us. There are so many vantage points in Sydney you don't know where to begin. It's nice having hood friends to share this with you."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Well worth time. This is a 3-4 hour hike make sure you bring water! Then catch the bus across the bridge at spit for ride back to Manly! Great walk if you enjoy hiking ! If your not in shape or have small kids don't do this"
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Fantastic Walk and the ferry over to Manly is great.. This is a wonderful walk. its about 2-3 hours but with so many small places to swim along the way it could take a lot longer! The views across the bay are just perfect."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Excellent View!. Fantastic view from here. Best if you cycle from below up the hill and then stop to enjoy the view of the cliff."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "A walk not to be missed . This walk is one of the greats of Sydney. You can start in manly (easy access via the ferry), however the best is to start off from Spit Bridge. You can get a taxi from manly and then walk back to manly. Or leave your car at spit bridge and then taxi back (it's about $15 max). The walk goes around the headland of the coast, with amazing views of Sydney, aboriginal rock drawings, little creatures and lots more. Stop off for a swim along the way, and don't forget water & sunscreen. There is only one cafe and water spot at the start (from spit bridge) otherwise you're on your own. Enjoy."
        }, 
        {
            "index": 138, 
            "rating": "4", 
            "review": "A Plesent walk to see the sights of the harbour. You can start at either end them catch a bus back. Take lunch and swimmers with you as there are several spots where you can have a dip. The track is not hard but there are a few spots to be carefull. Keep a lookout for aboriginal rock art and see if you can find the hidden path to Crater Cove in the photo where early huts have been preserved."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Beautiful walk. I took the city bus from downtown Sydney to the bridge. The bus driver was very helpful and let me know where to get off. Quite a change from here in the states! A very long but beautiful walk with some amazing scenery. The walk was nice and quiet as I did not see too many other walkers. The trip does bring you up and down some hills so you certainly want to be in decent shape. The view were spectacular and you get to see a variety of Australia wildlife and vegetation. They even have an area where you can see Aboriginal carvings in the rocks. Made it to Manly and walked around town and walked the beach where I stumbled upon the Shelly Headland Upper Lookout where I watched a beautiful sunset. After a quick bite in town I took the ferry back to Circular Quay. Highly recommend this long trek. Can't beat free views!"
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "FANTASTIC walk. We parked at the Spit, caught a bus to Manly, had a nice coffee and embarked. A group of 10 ! The walk was steady , fantastic views, not overly hard and had heaps of places to stop and have a look. we even had a dip on the way. On reaching the Spit we visited Chiosco Kiosk on the south side of bridge Marina where we had a fantastic lunch. What a day!!"
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Excellent Walk only if you are fit enough. I've recently completed this walk in a reverse way that is Manly to Spit bridge. Its very scenic all through the way & physically demanding as well. It starts from the sea level but soon take you through ups & downs. Along the path there are many scenic view points that one will definitely enjoy. But be sure to take enough liquid as you will need it & refill point available on the path."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Excellent track along the northern harbour. Not for the unfit, if able to undertake a good 2-3 hour bush walk then this track is worth the effort. lLovely views of unspoilt harbour coastline, not overly busy and good amenities at each end."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Manly Scenic Walkway. This walk is top of the list for Sydney walkers. So beautiful, not too hard, and changing at every turn. A lovely café at North Harbour."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Great day for a 10K. What an incredible day we had. There are so many beautiful views from the waves crashing on the beach or the rocks to the red gum trees and plant and lizard life. Again, a great day for a 10K. Enjoy!"
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "Great views from the other side of the bridge!. Having spent most of my Sydney life in the east or inner west I was coaxed into crossing over the bridge to do the Spit Bridge to Manly Walk. Let's get one thing straight we started in Manly and made our way to the Spit Bridge. Along the way it was a mix of walking along the beach or in the national park. The track is well maintained but I would suggest wearing good walking shoes although some people were wearing thongs/flip flops. The signage along the way explaining various things was also helpful. It was great to see Sydney Harbour from the other side of the bridge. I wasn't disappointed and will definitely return if I have interstate or overseas visitors to show them a different perspective of Sydney."
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Challenging walk. We would recommend this walk, we were able to complete the walk in about 3 hours. This is my first time, it is quite a hard walk but challenging with beautiful scenery to see. There are a few spots to rest to enjoy the view. It is recommended to bring water and sunscreen as well."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Good mix of coast, beaches and bush. Nice short hike to 'get away from the city' while staying in the city. The track is well maintained and diverse. There are also plenty of quiet spots to stop by for a rest or just to sit and enjoy the scenery."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Amazing views all round. This walk I can recommend whole hearty. I have complete it many times and can never get enough of the breathtaking views from every vantage point. It is a truly amazing walk you have to do at least once in your life!"
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Only 30min from CBD, beautiful place to walk. I did this Spit to Manly walk with my travel partner on New Year's Day. We used about 3 hours to get to our final destination, Manly. On the way to there, we found a lot of nice place to swim, do picnic, and stay relax. Also, we enjoyed nice scenery of Sydney city and Manly. The walk path was well maintained, so it was really easy to explore. Just one thing, please don't forget to bring water and sunscreen!"
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Changing terrain, consistent beauty. This 10km walk was challenging in all the best ways. The path was beautiful the entire way, and kept changing from overlooking the ocean to being in the middle of rainforest. When we were there part of the path was blocked but clearly marked detour got us quickly back on track."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "A Very Scenic Walk. This walk is all that you could want from a walk in a major city.......without the feeling of being in a city. The walk goes through everything from urban streets to bush and beaches. Wear walking shoes...take a camera...and take your time...enjoy the fantastic bays and views. We walked from Manly...this way is less steep than the reverse. We finished the walk at Clontarf Reserve with a swim and lunch from 'Clonnys on the Beach'.(Burgers and sandwiches)We then walked to a bus stop at the end of the walk (which is sign posted and easy to find) and caught the bus back to Manly."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "The most stunning walk around. Whether you pick this walk up from Clontarf beach or further along there are no prettier views in Sydney. If you're feeling energetic add on the second leg from North Harbour Park to Manly"
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "New Years Day walk. a good 10km walk took 2 hours 20mins..you need to be fit to do it as its quite steep/hilly in places and uneven terrain. fantastic views tho!"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Scenic walk well worth doing. We caught a 180 bus from stand C at Wynyard Station in Sydney. Took about 30 minutes to get to the Spit Bridge stop. There are bathrooms there, at Clontarf beach 30 mins in and some more about 30 minutes before manly. Take your own water - there are a couple of places to fill up but these are easy to miss - just pulled sticking up out of the ground - called bubblers. Wear shoes with good tread - there are some slippy areas especially when you start the descent into Manly. Be careful at 40 baskets beach, if the tide is in you have to take a marked detour. Parts of the trail are still a bit muddy after the recent rain, so be prepared to get a bit muddy. Not always well signposted, we had to ask for directions at Clontarf beach after we lost the trail. Lizards were cool! The whole walk took us about 3 hours, ending in Manly with a well deserved lunch at the Bavarian cafe on the ferry wharf before catching the ferry back to circular quay."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Beautiful and a great way to see Sydney. This is a great walk. It is relatively easy on the legs and has breathtaking scenery and views along the way. If you're up for it there is also some awesome swimming spots on the way."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Long but the views are so worth it.. We have done this walk 3 times in the last few years. Each time it is different depending on the weather. Last weekend we embarked on it for the 3rd time. Caught a bus from Central station to the Spit and began the walk. Were fortunate enough to see the Spit Bridge open so that was a great start. The begining of the walk is probably the hardest. More bush tracks and more ups and downs. By the time you get to near Manly, it is pathways which is a great way to end it off. The views along the way are magnificent and the sea breezes keep you cool. Plenty of places to stop for rests on the way or a splash in the ocean but no shops really to purchase drinks or food. It is a 3 hour walk so wear comfy shoes but it is a doable walk for people of all fitness levels; simply go at your own pace. We have done it with young Primary age children, with teens and this time, just my husband and I. Once you arrive at Manly, you can then reward yourself with a delicious fish and chip meal. You could even end the walk off with a visit to the Aqarium which is really worthwhile. We love this walk and if we lived closer, would do it many more times but we live an hour and half drive away. However, we reckon it is worth the drive to see those amazing views."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Tough but worth it. Took a bus to The Spit and then started on the walk. It's a long walk so wear comfortable walking shoes. Lots of steps, uneven in places and going through vegetation so more enclosed in places so not for people with mobility issues. Some lovely views but pleased to arrive in Manly. We took the ferry back to Sydney."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Must do scenic walk. This is 10 km of Sydney's foreshore you simply must see. We were dropped at the Spit Bridge by friends and capped off our experience with the also must do Manly Ferry ride back to Circular Quay. You could also park your car at the Spit and return by bus from Manly. The walk is not easy, lots of stairs meandering up and down but the views along the way are worth it all, it's so pretty you marvel you are in a capital city at all. The walk crosses local beaches and in places you must walk the sand and risk getting wet feet ( all part of the fun) there is shade a lot of the way, but as you come up over the headland and start getting those wonderful views out to North and South Head and Manly too you are quite exposed to sun and wind, hats necessary, some wonderful Indigenous Rock Art also on the headland , don't miss the slight detour to take that in."
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "Plenty of wildlife. Some great views of different areas of Sydney harbour, you will require a reasonable level of fitness, as it is a 3 hour walk with plenty of stairs"
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Need some exercise in an out door and beautiful environment?. Never more than metres from a clean deep water harbour, many places to sit and picnic, perspectives across the water, and native bushland to your back. Take sun protection, water and walker footwear. Reach Manly and ferry return to the city."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Great walk with fantastic views. Highly recommend this walk! Aprox 3 hours but you will want to stop off to admire views/swim! Walk through some really fancy houses in Manly first and then through the bush. Amazing on a blue sky day!"
        }, 
        {
            "index": 162, 
            "rating": "4", 
            "review": "Brilliant walk...amazing views. The Spit to Manly walk along with the Bondi to Coogee walk is considered among the best walks around Sydney. The Spit to Manly walk takes about 4-5 hours to cover the 10 kms of walk through a multitude of beaches, vantage points, hillsides. It starts from the Spit bridge (if you are travelling by bus, get down immediately after the Spit bridge and look out for signage indicating the start of the walk) and ends at the Manly wharf. A few pointers:1.) Carry a water bottle (and some snacks) as it is a long walk 2.) Carry a camera is possible as you will get some amazing views on the way3.) Food and water is available at select places only (Clontarf Reserve at the start of the walk has an eatery - you can grab a bite here if needed)4.) Look out for side roads moving away from the main route - these are very rewarding with fantastic views of the seas, cliffs and even the cityscapes. There are a few aboriginal carvings as well at a location. So take your time and allot at least half a day to savor the most from this walk5.) You will find a few good beaches as well, including a few reef spots for snorkelling - carry your gear in case you feel it interesting6.) There are markers / signs all along the way with maps of the vantage points / points of interest - do check them to ensure you know which ones to pick (check image)Lastly, once you reach Manly, there are multiple restaurants to help you with a well deseved meal to regain a few of the calories lost"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Amazing Walk. This is a must do when visiting Sydney. It is a 10 km walk. We started at Spit Bridge and walked all the way to Manly. The views are spectacular. The walk is a medium level walk with some steep stairs and gravel in places. But it is fantastic. The homes on the beach along the way and the Barbour views are breathtaking. A must do in Sydney.."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Leisurely stroll to jolly jog. This walk is a stunner. Gentle enough for the uninitiated walkers and ling enough for the athlete. Stunning scenery, we took some snacks and a salad, which kept us going. We swam at end o ease those sore feet. Wonderful, a must do for Sydney siders. So much chill within close proximity to the city centre. U"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "A perfect way to see the best Harbour in the World. We hiked the spit to manly walk just after Christmas. Didn't start at the spit bridge, but halfway from Tania Park. We walked the track along the headland, which has spectacular views of the harbour. mostly downhill then flat as you pass by Reef Beach and 40 baskets beach. The track is well worn and easy to follow. Finished up at Manly Beach and had some delicious fish and chips, but watch for the seagulls. they like to snatch the food from your hand if not careful. An ice cream on the way back and then did the walk back along the track to the car. Last part climbing back up to the park is a bit steep, wear good footwear, and watch out for stupid people who like to think they are doing the amazing race. Take time to rest and enjoy. BTW it's free"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Must do. Really enjoyed this stunning walk between Spit and Manly, although must say we enjoyed the first half (closer to Spit) more. It is very beautiful and a mix of forest and stunning water views with turquoise waters. Make sure to take water and sunscreen!"
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Best walking trail!. Another must to do in Sydney I would highly recommend! It's a little bit long but easy to exist when you tired half way, you will see so many hidden beaches!"
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "A truly spectacular walk with unsurpassed view of the harbor. This is my favored walk in Sydney and I have done it a dozen times. I usually take the ferry to Manly and I walk from there to the Spit in about 3 hours to take a bus or a taxi back to Sydney. The walk starts at the ferry terminal and it easy to follow: just keep the water on your left all the times. It passes Manly, many coves where you can swim, and it climbs a bit before following again the harbor through many others coves. The view of Manly, the Heads, the harbor and Sydney are just spectacular. It is an easy trail but you should consider wearing good shoes and carrying water."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "One of the Best walks in Sydney. One of the best walks in Sydney . A total of 2 hours would be convenient . The walk starts at Spit bridge in Mosman which can be conveniently reached from City in a public Bus.The geography varies which makes the walk look very beautiful . Since it is a coastal walk there are food options available in every 30mins at least . We did the walk during spring season and hence could locate a lot of beautiful flowers . Carry a lot of water . Preferably avoid the walk during noon as summer heat can get pretty bad . Would be good to start in the afternoon if during summer or in the morning if in winter . There is no cost associated with it . At the end of the walk in Manly , there is Bavarian Cafe which is great for a drink before heading back to Circular Quay in a ferry."
        }, 
        {
            "index": 170, 
            "rating": "3", 
            "review": "Lovely Walk, very enjoyable. The walk Spit Bridge to Manly, such a enjoyable walk so worth doing. Beautiful views.On a nice sunny day it is well worth a nice stroll."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Amazing views of Sydney. This is a must do for locals and visitors! Wear good shoes and carry water and snacks for your walk and enjoy the amazing views! it's a long walk and at times it can be quite challenging going up and down stairs depending on your fitness level. Take some swimmers if you want to take a swim as there are lots of quiet beaches along the way."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Great walk. Love this walk make sure you have food to eat and drinks as not much on way plenty of scenery of the harbour, takes approx 2-3 hours and more if you stop a lot , if hot take swimmers plenty stops to have a swim."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Thoroughly enjoyable. Enjoyed every bit of this amazing walk! The views, the variety of plant and birdlife - it ticks all the boxes for a great way to spend a day. A must-do for any keen walkers visiting Sydney. Finished off with a cold drink (or two) at Manley before catching the Ferry back to Circular Quay."
        }, 
        {
            "index": 174, 
            "rating": "4", 
            "review": "Great walk, up and down, but changes throughout well worth it. Take the Manly ferry and you will need to get to the start at Spit Bridge (friends drove us). Best to go in this direction. Ideally use trainers at least, the walk is up and down a lot, so you need to be fit. It is basic, no coffee shops, so take your own food and refreshment. The scenery is stunning, you see large lizards in the bush towards Spit Bridge end, the last aboriginal art still in its original place at the top of the walk, ideal for a break. Manly end is a welcome sight for a beer and a snack. well worth it and free."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Magnificent Walk. A long but satisfying walk that will show case some spectacular scenery around Sydney Harbour. Must take water and good hiking shoes. End up in Manly and have a drink and meal at one of the great restaurants."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "A must do !. Whether you are a tourist or a local , this has to be on your \"must do \" list. It's not a short walk though, so be warned. It will take you a good 3 hours at least , especially if you stop for a swim at the secluded beaches along the way. We often cut it short by parking at Clontarf reserve, and starting the walk from there. I have never done it both ways , we usually get a bus/taxi/uber back to the car.One of the best walks in Sydney , especially in summer .Highly recommended."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Bushwalking close to the city. Good exercise, beautiful sights, Aboriginal carvings, and stop at Manly Beach for a nice lunch and a cold one at the end."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Spectacular. I have done this hike several times now and every time I am awed by the scenery. Nice secluded spots to stop for a picnic or a swim and to take spectacular photos."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "The best view of Sydney harbour from the North. I am sure there are reams and reams of reviews for this but whether you live in Sydney or come for a visit this is one of Sydney's great walks."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "excellent. i have driven and been at both at these places. it's mesmerizing. but have not done the whole walk. suffered depression but the spit bridge is amazing that area. really is."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "fantastic walk. Definitely a must do walk if in Sydney.\nPlenty of nice spots to for photos and lots of places to stop for a swim on a hot day.\nEasy access by public transport to starting or finishing points."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "A must do for anyone visiting Sydney. The best things in life are free. This walk is one Sydney's highlights. Take you time and take your swimmers. Enjoy a drink and a feed at the Manly wharf before catching the ferry back to the CBD"
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Great walk. We walked from Manly to Spit Bridge and then got the bus back. We picked up a map from the visitor centre in Manly which was useful at a couple of points so we could be sure we'd gone the right way. The walk was largely sign-posted clearly, the only issue we had with directions was that almost at the end when you get to the beach, there's just a vague indication that you have to walk the length of the beach, but we couldn't as the sea was all the way in at one point. Thankfully we could navigate our way to the far end on the side-roads behind the beach.Also, there was meant to be a coffee shop about two-thirds of the way along, but we didn't even notice a sign for it. Then not long before the end of the walk at the beach there is a shop and cafe you can't miss.There are a couple of stopping points with water taps/fountains and toilets directly off the walk, it wasn't too hot the day we were there and we found a litre of water each was enough between refills. Probably worth having more than that and taking snacks if you think you're not going to walk very fast.The walk took around 4hrs, with us walking at a fairly quick pace but stopping for photos / drinks / suntan-lotion application now and then. A lot of the walk is quite shady, but you do definitely need hat / sunglasses / suntan-lotion. There are a lot of steps, both up and down, as you go along the coast popping down to the shore one moment then back up along a cliff edge the next. The difficulty is probably a medium level, most people could manage it but some might need to go slower. There were people jogging/running some sections though!The views are great and the whole walk is very scenic. Highly recommended."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "One of my favorite walks in Sydney!. Pick a nice weather day to go, and you will be sure to LOVE this walk. The views are, as always, spectacular, and the trail is perfect for people of all fitness types. You can turn it into a gorgeous run, or take a slow stroll and enjoy the scenery. Either way, you can't beat the beauty of nature! The walk will definitely take a long chunk of time - but that depends on how quickly you walk!"
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "One of my favourite walks - a nice longer walk than the usual tourist routes. I love this walk and regularly take the trip over to do it (we're in training for a 100km hike). I think it is better to start at Spit Bridge and walk to Manly as opposed to the other way around as transport links from Manly are better, plus its a nicer place to finish up (there's not much at Spit Bridge - there is a nice Italian restaurant though with some delicious gnocchi).The start of the walk is tricky to find so follow these simple steps:  If taking the bus from the city, alight at bus stop and cross to the opposite side of the road (use the pedestrian crossing just behind you). Now continue the direction the bus was going and walk across the bridge. On your right hand side once you have crossed the bridge you will see an unnamed road (car accessible), walk down here and you will see the signposts for the beginning of the walk. The walk itself has some steep climbs, steps and mixed terrain (beach, bush etc.) so I wouldn't take my grandmother. I would say anyone of any fitness level could do the walk, but you might need to take it slower. I am a quick, energetic walker, many a time I have more then a bead of sweat at the top of one of the hills, especially in hot weather.Take suncream! There are some water fountains en-route, so refilling isn't too much of an issue. The time it takes to complete the walk really varies on fitness level, photo taking etc. When I've taken guests, it has taken up to 4-hours, when I went solo it took 2-hours, 8-minutes the last time (to be precise).The views are amazing, the animals (lizards and birds) en-route are awesome, and it is just truly a fantastic walk! Wouldn't hesitate to recommend it to others!"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "One of the best walks in Sydney--a bit tiring. My daughter was studying here and took me on this walk--so beautiful--tiny isolated harbours, beautiful sailboats, Aboriginal rock carvings, calm lizards...probably good to bring some gatorade and comfy sneakers..."
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Great day out. We were recommended this walk by family living in the area. So, a trip to Sydney would not be the same without trying it out. And it was worth the hike. Gorgeous scenery, lots of wild life, and a bit of history in between. Would recommend to pack a rucksack with some water and perhaps food. And if you fancy a swim, bring your bathing suits and towels. There are some beached on the way where you can cool down with a swim.Arriving in Manley, you can find a local bar to enjoy a cold beverage, or find a place to get a cooling ice cream. Would definitely do this walk again"
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "Walked it backwards. We thoroughly recommend this delightful walk for the stunning vistas, Aboriginal carvings, variety of footpaths from sandy to steep to wide to narrow to boradwalks etc"
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Prettiest views of Sydney. 10k of amazing views along cliffs and beaches. Not as crowded as the Bondi to Coogee walk and trails are more challenging."
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "A beautiful coastal harbour walk. If you are looking for a brisk 3 hour walk, take a trip from Spit Bridge and follow the walk all the way to Manly - takes about three hours, you can walk, run or just do part of it. Catch a bus or taxi back to Spit if you have parked your car, otherwise continue on the bus to your destination"
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Rewarding hike! . Your legs are going to be hurting for days but it is so rewarding!!! There are so many magnificent look outs throughout this walk. Parts can be challenging if you are not fit or used to walking up hill for a long period of time. This is definitely NOT an easy walk! If you would like an easy walk then take the ferry to and from manly and just walk as much as you feel comfortable with and turn around. That being said, the truly beautiful spots are up high and therefore you have to work for them. I would recommend this to anyone going to Sydney but be warned that it is challenging!"
        }, 
        {
            "index": 192, 
            "rating": "4", 
            "review": "A good morning's walk. This is a longer walk packed with superb views of the inner Harbour and Sydney Heads. On a sunny day this is a great activity. You can take a picnic as there are plenty of places to stop and enjoy the splendid views. You can go in either direction starting an The Spit Bridge or Manly. Unless you do the return journey on foot you will need to use public buses to make the trip."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Beautriful views. There are some fairly steep ups and downs on the walk, but take your time and it is well worth it as there are magnificent views of the harbour and the City of Sydney. Be prepared to carry water, especially in the summer as there is little in he way of cafes or shops."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Great walk, varied conditions, gorgeous views. Love coastal treks and the Spit Bridge to Manly walk will not let you down. Trek along the shore of inland tributary towards Sydney Harbour and along towards Manly. There are bushy, woodsy areas, wooden tracks, stones to fossick, beaches to stroll, and some of the finest vistas around Sydney. I highly recommend the trek for the natural experience alone... yet when reaching Manly, we often enjoy a cafe meal, drink, then board the Ferry back to the City. What better? Top off the day with a harbour cruise (on one of the many ferries) for just a few dollars -- enjoy!"
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "another brilliant Sydney walk. This walk can be accessed by catching the Ferry to Manly. walking to the left after you come off the wharf and following the harbour around. A spectacular walk that starts off walking through suburbs on the harbout but you end up in bushland with spectacular views of the harbour. you can walk all the way to the Spit Bridge - make your way up onto the main road and catch a bus back into the city.Be sure to take water and food as there are no food or drink stops on this walk.This walk would take up most of your day especially if you were going both ways in and back.Lots of wildlife and birds to see .get to see some wonderful bush huts that some lucky people get to live in.but best of all are the views of the heads, the Sydney skyline and the action on the harbour.Great place to go on boxing day - find a spot and watch the Sydney to Hobart Yacht Race head off through the heads."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Fabulous walk!. We have done this walk a few times, the latest being this week. Go on a sunny day, track can be very wet in parts if there has been a lot of rain. Wear good walking shoes, walk takes between 2-3 hours and take plenty of water, hat & jacket if necessary. Catch one of the buses from Military Road (we got 143 and got off BEFORE the Spit bridge near the restaurants at the bottom of the hill) Walk to the right hand side of the bridge and the track starts from there around the beach. Keep to the coastline, there are a couple of spots that go inland on the streets but you should find yourself back on the coast to walk into Manly. Great day out!"
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Breathtaking views. This was probably the most beautiful thing we did. The walk is so lovely with fantastic views all the way to Manly. Have lunch in the restaurant next to the ferry, $10 steak and ferry back to Sydney, ending up with a cocktail in the Opera Bar. Perfect day in Sydney"
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "An absolute must for visitors who love to walk. One of the most beautiful walks in a capital city anywhere in the world. I have travelled a lot and walked in many countries. Whilst I may appear biased, this is without a doubt one of the most beautiful walks I have done. A must for visitors who love to walk!"
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Sensational walk with panoramic views. This is the quintessential Sydney walk! It includes magnificent views of the Spit, the Harbour and Sydney Heads, a range of different types of bushland, birds and lizards, beach and foreshore walks, both large and small hidden beaches for swimming and many spots to stop and admire the beauty of Sydney or for a picnic.The walk is well maintained and clearly signposted and generally of easy grade although there are some steep pinches. There is no water along the walk so it is essential to carry some and the walk is best done in Spring or Autumn or early in the morning.The destination, Manly, is full of great shops, cafes and restaurants and Manly Beach is superb and a worthy end to what is undoubtably one of the most scenic walks in Australia."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "One of the best walks you will ever take. Stunning harbour views, bush land with a variety of flora and fauna, beautiful hidden beaches and at the end Manly, and everything it has to offer. Wear good shoes and take water and an apple, be prepared for some climbing ....you'll love it!!!"
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Views, beaches, rich flora and great smiles on the way!!. After having done so many bushwalks, in Sydney, Vancouver and India, I had doubts that this walk will standout, but it did. The walk is done mostly by the strong hearted, so you wont find it crowded. The perfect months are Nov and Feb. I parked my car near spit bridge (look for free parking in the residential area) and started my walk. If you are scared of water dragons, first 2 km may be difficult but after that is all paradise. A few cafes on the way. Carry a change if you plan to take a dip in the beautiful water on the way. You may want to go up further from manly to North Head for beautiful views of the sydney skyline. And the cafe at north fort is byfar my favourite in sydney!!"
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Do it!. Fab way to appreciate this amazing city. Wear comfy trainers, and be prepared for lots of steps! The routs is mainly excellently maintained, and provides one breathtaking view after another!,"
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "superb views and well kept walk. Four of us seniors went awalking on a hot steamy day from Manly to the Spit Bridge. We didn't quite finish the walk, but we really enjoyed what we did. Lots of birds and great wildflowers blooming at this time of year, and of course, the views are amazing. We exited at Grotto Point, and to our astonishment, found a free bus at the exit point to take us to Ballgowlah shopping centre and another back to Manly ferry. Before you leave the ferry terminal, go to the information centre there and pick up a free brochure listing the buses and their routes. It's worthwhile having the buses as back up in case you hit a bad day as we did. The bus drivers are very helpful. At Grotto point the buses seem to come at a quarter to the hour, and not sure of other times. We will take the bus there the next time to finish the walk. We caught the ferry from Circular Quay, returning later in the day on the same ferry. Nice cafes at Manly for lunch or coffee and cake."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "An absolute must of you enjoy walking and great scenery !. Amazing walk through the \"bush\" with an abundance of scenic views. The route is not as \"open\" as we expected in as much as the views are hidden by the bush but this adds to the attraction as every now and then when you least expect it a gap appears and you're presented with another stunning view of the coastline, or one of the many coves. It does involve a lot of climbing and descending the pathway which has been caringly looked after by a team of volunteers and on a warm day can be tiring. As another reviewer said \"dress appropriately and carry plenty of water\" We didn't carry our lunch but opted for the end of walk cold beer and food at manly wharf - excellent!"
        }, 
        {
            "index": 205, 
            "rating": "4", 
            "review": "One of the great walks in the world. We have done many short walks in the world and this would rate highly. A great way to see another part of Sydney and see many aspects, from the Heads to the nature reserves and the beaches at Manly or the Spit. Not too difficult."
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Only way to enjoy best view of the Harbour. Want to breathe in the spectacular harbour then put on your walking boots. Do it because it's healthy fun and eye candy. Take your lunch pack or treat yourself at the end at Manley wharf ."
        }, 
        {
            "index": 207, 
            "rating": "4", 
            "review": "See the bush without leaving Sydney . We did the walk from Manly to Spit Bridge. The walk was incredibly scenic with constant harbour views, lots of little coves and an extended walk through bushland. It was well signposted and there were so many tourists about you really couldn't get lost. But remember it is a long walk (10km) with lots of going up and down. There is no water to be had for most of the walk. On warmer days the walk can get hot and stifling. So dress appropriately and take plenty of water. The highlight for us was going down to one of the little coves and soaking our, by then, aching feet in the cool waters. Just heaven."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Scared of heights don't worry so was I . OMG Safety Safety Safety all the way,Don't worry about a thing it's all covered, But No Phones Camara's, No watches earnings or bangles, and you have to clear a metal detector before you go up so don't even think about it.Top tips, Do not take to much with you everything goes in a secure locker and you wear the key around you neck 100% secure, you'll strip to your underwear if it's hot weather they give you a very trendy onesie or jump suit clean and fresh. Then you go through a safety briefing and knitted out with everything from headphones to hankies to mop your sweat. Safety harness and elasticated strap for sunglasses. The walk is well managed and there are drink fountains and mist fans on the bridge they even have a doctor / medic up on the bridge. It's totally all covered even for the nervous such as myself. But I was buzzing the guides were great the history and geographical information was superb, we did the 3.5 hr climb at twilight which means you see the city by day then the sun set then come down in the dark but don't worry you get a torch to wear on your head not that you really need it but it look cool.We cannot sing the praise of these guys and girls and the organisation enough it's not cheap but neither is the flight to Aus so once in a lifetime go for it at the end you get a free cap and then you need to purchase your pictures these are taken by your guide up on the top of the bridge and are well worth the little extra"
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Great Walk with stunning views. Truly great walk if you have the time - It will take a few hours. Best done by parking a car at the beginning and end of the walk, but can be done with public transport. Walking from the Spit and finishing at Manly is the best way to do it - easier walk and more food options at the end."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Both locals and tourists love this walk!. Good spot to go for a walk to a run with breathtaking views. The locals loves their walk and tourists do to. Can't wait until I'm able to go back!"
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Great walk with stunning views. This is a great walk with stunning views. The path is easy to follow and has several stop/ picnic points along the way. There are a number of steps involved but being a coastal walk this is to be expected. Allow 3 hours to complete including a break. Well worth making the effort. Catch a bus from across the Spit bridge back into Sydney"
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Excellent walk full of great views and some surprises. We took 3 hours to complete this walk but could easily have done it in under 2. We were lucky with the tides and were able to take several short cuts across various beaches. Because it was spring, the wildflowers were in full bloom in the national park around Grotto Point. We swam at Castle Rock in crystal clear water. The only unpleasant part was having to walk along the crowded public beach at Clontarf. If finishing at Spit Bridge, make sure to do your research on how to get public transport back to Manly or Sydney. The signage is very poor and not clear on where to go. We were lucky that a sympathetic bus driver helped us out."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "One to put on your 'to do' list. A lovely walk with fantastic views over Sydney Harbour. Admire some remarkable architecture at the Spit Bridge-Clontarf end as you walk the beach and bush track, then immerse yourself in nature as you cross the headland. Spot the old squatters huts on the cliff edge from the Depression days, and have a swim at one of the many coves along the way. The wild flowers are in bloom and it was a truly gorgeous day. Busses connect easily in either direction."
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "A long worthwhile walk. This is a long walk, but well worth the effort with a mix of some spectacular views across the harbour and bush walking, albeit on duck boards. It can be hot so you need to take plenty of water with you."
        }, 
        {
            "index": 215, 
            "rating": "4", 
            "review": "Lovely walk. A nice walk. With wonderful views of harbour. A little hard going for the unfit like me but well worth it. Make sure you get off the buss before it crosses spit bridge as its difficult to cross road afterwards (that's if you come form City)"
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "Wonderful intro to bushwalking. This track is an excellent way to turn someone on to bushwalking. First, make sure it is a nice day, not too hot or humid and definitely not when its raining. And carry water, even in the cooler months. Spring is perfect - when the wattles and wildflowers are in full bloom and the track is a blaze of colour. And the views over the bush and the harbour, back to the city and across Manly Cove are stupendous. If for some rare reason the person doesn't enjoy the experience, you can reassure yourself that you have tried your best and they are just not the bushwalking type.The track is about 10 km long and takes about two and a half hours to walk. Most of the track is well made, though there are a couple of steep bits and it does get muddy and in places slippery after rain. Get to either end of the track by public transport - bus from Wynyard Station to the Spit or ferry to Manly. The kiosk at Clontarf Park is only about half an hour from the Spit and is an excellent place to stop for a coffee. In fact, it is the only such stop along the route."
        }, 
        {
            "index": 217, 
            "rating": "4", 
            "review": "Beautiful walk. Very beautiful walk - but it takes 4-5 hours to complete. It is up and down a lot, but there is many great viewpoints."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Spectacular scenery. This a fantastic walk on a beautiful spring day. Please do not do it in a tour group, enjoy it with a friend."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Spectacular views and a bit of a challenge. The Spit to Manly walk is spectacular! You will see Sydney Harbour from one of its most beautiful sides, plus you'll get a great work-out.You need to be reasonably fit to take on this walk, there's a lot of steep hills and stairs, prepare to sweat. Make sure to bring lots of water, sunscreen and maybe even a snack if going in summer.I like walking from the Spit Bridge to Manly (some people prefer the other way), so that I can have a coffee, lunch or something in Manly when I finish the walk."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Lots and lots of steps. What a great walk, and hard to get lost. I walked from manly to spit and then picked up the bus back into town. A stunning walk, especially once you get away from habitation and into the coastal bush. There are a lot of steps, my iPhone reckoned I did 50 flights of stairs today!!! Other than that a fairly easy walk for all ages and abilities."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Must do activity if you live in or are visiting Sydney. Excellent walk with spectacular views. Not difficult and has public transport options at both ends. manly has lot of food and drink options upon finishing."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Great views. Great walk along the coast through Sydney Harbour National Park and a few beautiful neighbourhoods. Amazing views and very peaceful. Definitely a highlight of my times in Sydney."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "A great morning trip.. Sydney is spoilt for great coastal walks, but this was fantastic. Well signposted, good for beginners. You end up in Manly, a great place for lunch or to chill on the beach"
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "One of Our Most Memorable Hikes!!. On a gorgeous day in early September, we walked a block from our hotel in Sydney's CBD and caught the bus which stops on the far side of The Spit bridge across Fisher Bay. Since it was Sunday, we had purchased \"Sunday-Funday\" tickets for AUD2.50 each, which allowed us to travel by metro, bus and ferry, all day long, a super bargain.Alighting at The Spit, we took the trail which goes under the bridge and heads around Fisher Bay, then on to Sandy Bay Road to Clontarf Beach. On a Sunday morning, this lovely area was chock full of families, kids everywhere, barbies roaring, dogs splashing in the bay, fun everywhere. The walk continues along the shore and headlands of the Middle Harbor, then moves inland as the trail turns to the northeast. There is a lot of up-and-down walking, many sets of stairs, some boardwalks, but mostly just track. The way is mostly smooth walking. And it is absolutely spectacular! From each high point, a lovely vista opens up -- marinas, gorgeous clear water trending from turquoise to deep blue, a few whitecaps showing, sailboats underway, ferries passing. And then the view from the next headland is even more stunning. On a Sunday you will encounter hundreds of hikers, going in both directions, but the trail and the topography easily absorb all comers. From Crater Cove around Dobroyd Head to Reef Beach and on past the residences of Forth Baskets Beach and around the North Harbor, the trail takes you from one breathtaking site to the next. It's a ten km hike from The Spit bridge, and one you will remember.Once you arrive in Manly, the crowds really take over on a Sunday morning. There are folks everywhere, milling about, filling all the cafes and shops, ambling along the Corso over to the Pacific side, then filling the beach over there as well. So just be ready to \"go with the flow\" until you find a nice spot to stop, have a beer or eat lunch.We chose the Hotel Steyne's spacious restaurant, grabbed a table overlooking the action on the beach and had some excellent fish 'n chips, with a very nice local lager to wash it all down.Then off to the ferry back to Circular Quay, where we immediately hopped (for free) onto another ferry out to Watson's Bay and back for a different perspective on this magnificent harbor."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Beautiful!. An amazing walk you have to do when visiting Sydney. Less crowded than the Bondi to Coogee walk but it is so amazing and you get to some really good look out points where you can take great photos. Try to look up where to go before doing the actual walk, we got lost a couple of times."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Lovely afternoon. rented bikes and did many to spit on a gloriously sunny day, what's not to love. You can get a nice fish and chips when you get to the spit bridge at the cafe with a beach."
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "A snake or a lizard?. We started from the spit end after getting the bus from Wynyard Station. We found the first hour of the walk to be really spectacular, however that was the best bit. There after it was still not but just not as breathtaking. We saw a lizard along the way too, which looked very much like a snake...took about 3hrs to do the walk!"
        }, 
        {
            "index": 228, 
            "rating": "4", 
            "review": "Spit to Manly Super walk. This is a great walk. As an aside, take the turnoff to the right at the bottom of the path which comes down from the Dobroyd Park and go along to the old fishermans' huts. Pure magic and lots of waterdragons."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Beautiful walk. This is one of the most picturesque hikes you can do. You are walking along the coast - mostly in the shade looking out onto Sydney Harbour. You can have lunch in Manly and turn around and go back or catch a taxi to where you parked the car."
        }, 
        {
            "index": 230, 
            "rating": "3", 
            "review": "Good views, varied walk, not a bush track anymore.. I often used to walk this track more than twice a month, usually from 7am on Sunday mornings. At that time it is cooler and you avoid most of the earnest latex clad runners pushing past. It is a most scenic, interesting, varied path, and quite challenging as it is 9.5 km each way and rises up to 200ft above sea level before descending again to the beaches. There is an interesting midden made from shells discarded by aborigines years ago, and many birds and usually large lizards to be seen up close. We used to breakfast near the wharf in Manly and walk back again, enjoying its unspoiled natural state clambering over rocks and by-passing rain puddles. However , some five years or so ago the authorities started “ improvements” (Schlimmbesserung) by bringing in great sacks of gravel (by helicopter I'm told) to widen and line paths, handrails have been added and I believe steps installed in some places. We don’t go there anymore. These works may help some less fit people and others but spoil the experience for many more. I accept that, at my age, I cannot climb Mt Everest now but I don’t want a lift installed for people who can’t do it."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Beautiful views. We began this walk at Manly which you can do at your own pace -there were some people running while others were riding or walking. The view along the way is just gorgeous. Walking with the sea on one side and views of Manly on the other is a relaxing way to spend a day. This is a popular walk and the path does get busy at times. Lots of places to stop and sit of just take a photo. If you are looking for something to do when visiting Manly other than swimming at the beach I recommend you do this walk or even part of the walk."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Much loved walk. We used to do this all the time when we lived in Sydney, and it continues to be a must do whenever we are in town. We go early to avoid the hordes (which is getting harder to do these days) and stretches through the National Park have been vastly improved over the years. My husband starts in North Sydney, and I drive to Manly. We cross over somewhere near the oval so husband continues to Manly while I actually exit at Balgowlah Heights to get a coffee at the fab deli at the top of the hill, and wait to be picked up. The beauty of the walk is the different \"worlds\" you go through - by the harbour with all the locals exercising their dogs, a few suburban streets, the Harbourside parks, the bush of the national park, and of course the stunning views of the Heads. Whichever variation of the walk, it is a winner, and of course the benefit of doing whole Spit to Manly is that you can have brekkie at one of Manlys terrific cafes."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Spit to Manly Walk - take the time to enjoy!. Just finished this wonderful walk today! Stunning views. Bush, beaches and parks. 10km. Medium fitness required. Lots of stairs, but so worth the effort!"
        }, 
        {
            "index": 234, 
            "rating": "3", 
            "review": "Sydney's hidden beauty. magic views and not as crowded as some other wlaks. Avoid Dec and Jan as it is hot - take water. great way to burn a few calories"
        }, 
        {
            "index": 235, 
            "rating": "4", 
            "review": "Beautiful Scenery. Beautiful scenic walk, stunning beaches to stop off at for a cool down dip. Looking forward to walk this in summer to enjoy a swim"
        }, 
        {
            "index": 236, 
            "rating": "4", 
            "review": "Enjoyable walk for an afternoon. A nice walk although the path isn't overly clear in a lot of places and went off course a few times. There is a point where you can choose to stay more rural or finish on the street which is quicker and easier if you have less able people. Some parts are quite closed over so although still enjoyable you don't get vews 100% of the way around. It's reasonably lengthy for normal folk (wranglers wouldn't bat an eyelid) so allow a ood 1.5hrs for a casual stroll. Not many places to get refreshments though so bring drinks with you."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Gorgeous. Great way to spend a sunny day in Sydney - gorgeous views, gentle walk, perfect taste of Sydney and all it has to offer..."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "You can't go wrong. I've done the walk a few times and going again this Saturday with the kids. Absolutely fabulous each time. Best with friends and/or family. Bring a good camera along and make sure to stop and take in the views. Marvelous all around. Check the weather forecast as it is a bit of a walk and you can't just turn back if inclement weather hits. Offers various terrain and breath-taking views. Manly beckons at the end and a cold one is just irresistible."
        }, 
        {
            "index": 239, 
            "rating": "4", 
            "review": "Great walk, and probably longer than you think!!. It's a good long wak so be prepared. (Some weren't prepared for the long walk and were struggling.)If you can leave a car at one end to make it easy to get back.Also great to finish in Manly and then go grab a beer, or some food."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Great Views. This 10K walk is pretty tough going as there are a lot of ups and downs but it definitely worth it. The views are amazing. However, we went when it was quite cool. So I would definitely advise doing it during the hottest part of the day. Bring lots of water!"
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "The best walk in Sydney. One of the nicest walk you can take in Sydney.\nOffering stunning views, reinvigorating fresh air and recharging calm!"
        }, 
        {
            "index": 242, 
            "rating": "5", 
            "review": "Another excellent walk. This is a fantastic walk but be warned it is quite touch, there are tons of stairs but everyone time you reach the top of a climb you are rewarded with an amazing view. We used the Wildwalks app and found a circuit route from Spit bridge to North Harbour reserve and back to our car."
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Worth a walk. There are two must do walks in Sydney. Coogee to Bondi & Spit to Manly. A great bush walk over looking the Harbour. Spectacular views, take a bottle of water and wear good shoes."
        }, 
        {
            "index": 244, 
            "rating": "4", 
            "review": "Great experience. What a great walk with excellent harbour views and varying track types. Walked Manly to The Spit and then back to Manly. Bit footsore but a great challenge and experience. Suggest avoid walking at high tide near Clontarf beachfront homes although there is an alternative high tide route. In summer you may see water dragons on the track around the small bays close to the The Spit end of the track."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Perfect bushwalk right in the CBD, less crowds. If you only have time to do one Sydney walk, do this one. It's slightly odd to get to, you need to look up bus routes/ get a taxi to drop you. But that makes it all the more worthwhile, it's a bushwalk in the centre of Sydney that you should start mid-afternoon, then take the Manly ferry back to the CBD to catch the coathanger (Sydney Harbour Bridge) in the sunset"
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Scenic walk. We did most if this walk as part of our visit to Manly, the 1st part was really easy, this for steeper after around 3.5Km. This is really worthwhile and we would of loved to have finished this however we ran out of time. The weather was glorious even though it was August just perfect for a walk. It was good to find clean toilets along the way. The walk mostly followed the cost, and was frequently on clearly defined paths. This is a beautiful walk, very enjoyable."
        }, 
        {
            "index": 247, 
            "rating": "4", 
            "review": "Decent walk - not too strenuous. This is a lovely walk, and you can easily do it from a bus ride from the city, and end up with a ferry ride back form Manly to the city.there are parts of the walk where you need to walk along uneven pathways, rocks or on sand - so you need a reasonable level of fitness and mobility.I'd give yourself 2-3 hours to complete the walk. and PLENTY of sunscreen - with the wind you may not notice how much sun you're getting!"
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "Definitely do this walk - a lovely different way to see the Harbour. A wonderful, easy walk skirting the edge of Middle Harbour around to Manly with great views at every turn."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Holiday walkabout . Fabulous walk with brilliant views.Some steps, slopes and beach sections with beautiful shells and more views. Definitely worth the walk"
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Great Hike. We took the ferry to Manly and started at the ferry station. GET A MAP as some of the area marking are not clear. There is an option to go through a neighborhood or the woodland area....pick the woodland. We say so many beautiful birds (cockatoo, rainbow colored parrots).Hiked with kids 14 and 10. Bring good shoes (hikers or tennis shoes). There are some more challenging areas. Took us a little under 3 hours. You can get a taxi or bus at the Spit Bridge area.After the hike we told a taxi back to the ferry station and walked to Manly beach."
        }, 
        {
            "index": 251, 
            "rating": "4", 
            "review": "Sidney from the other side.. Beautiful but it now has many steps with no railings. Take walking sticks. You can take a bus which goes over the bridge, down to the Spit. Allow plenty of time: the bus ride lasts about 30 minutes or more. Before going into Manlly, you can stop at a beautiful sandy beach and spend some time there."
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Even if you only have two days in Sydney, this is worth doing.. Being a local, I've done this walk many times. I've done it from The Spit Bridge to Manly and also in reverse. I've also run it when training for a race. It's approximately 9kms one way. About a month ago we did it there and back so 18kms of walking. It's up and down so don't think it's an easy stroll but then of course it's also not like walking in the Dolomites where uphill really does mean uphill! Take a snack as there are numerous places to stop and sit and look at one of the most beautiful harbours in the world. And take water especially if it is hot.You could do the walk in standard running shoes or sneakers. If you end up in Manly then you're spoilt for choice in terms of cafes and restaurants. However, if you finish at the Spit Bridge then there are really only expensive restaurants to choose from. If you park your car at The Spit Bridge (time limits apply so be careful of parking fines) you can catch a bus back from Manly to The Spit Bridge. Great day out! Or half a day if you walk quickly."
        }, 
        {
            "index": 253, 
            "rating": "4", 
            "review": "Great Run!. Want to get a taste of Sydney before the arrival of the \"first fleet\"? Do the MST. This starts on the stairs on the spit bridge, and extends to the Manly wharf. You can extend this a bit by starting at the Taronga Zoo pier.This is a (mostly) contiguous nature reserve that extends the length of the walk. You'll see a lot of native plants and animals, and some Aboriginal artefacts (the kangaroo carving). This is about 10km from Spit to Manly, and add another 8km from Taronga. If you go to Manly beach, add another km.Make sure you have good shoes, and your camera, there's a lot of great views of the harbour. I've only walked this once. I've run it many dozens times, as training for trail runs. Take a water bottle, there aren't that many places to get water or use toilets. There's food near Spit and Manly, and at some of the beaches in between."
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "It's definitely worth it. Okay, it's ten kilometres but it's definitely worth the four hours walk. Excellent view. You'll be able to see little hidden beaches (and also take a swim if the water's not too cold)."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Great coastal walk !. Manly is one of my favorite places! This walk takes about 4 hours. Great track on views of the harbour all the way. Great way to see Sydney!"
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "A classic walk with beaches, coves and great views of the Harbour. This is a walk we take every year in Sydney. It offers great views of Sydney bay, the Heads, Manly and Sydney. It is an easy walk of 3-4 hours, longer if you swim in one of the coves and it can be done from either way. We usually take the ferry to Manly. As you exit the ferry, turn left and keep the water on your left: this is the only direction you will need. At the Spit you can take a frequent bus, or taxi, back to Sydney."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "An absolute winner. I've been to Manly many times over the past 40 years, but had no idea that this wonderful walk existed until this month. Four of us did it on a warmish, Autumn Sunday (It would be a killer in full summer sun). It's a solid 12 km walk. There are quite a lot of steps in some places, but the views are well worth it. Standing directly in from of the Sydney Heads was a one of many great sights. Also very worthwhile were the indigenous rock engravings. These will be eroded sooner rather than later and are a real treasure that need to be visited asap. Other reviewers describe the walk as 'long' and suggest one has to be fairly fit. That's probably true of urban dwellers who don't walk regularly, but for those who walk often, this is a walk not a hike. However, while regular walking shoes are adequate there can be a bit of wet, even muddy dirt in places. Allow three hours plus in order to take in all the sites. Return to Manly by bus or, alternatively, take the bus to Spit Bridge and walk back.Tip: Take food and take plenty of water.Note: This is not a walk for people with limited mobility."
        }, 
        {
            "index": 258, 
            "rating": "4", 
            "review": "Steps, sea and lovely bush. Rated as a 4hr walk although we did it in 3hrs with stops. Great track on views of the harbour all the way. We were surprised how much bush there still was so close to the city. There are places to fill your water and use the toilet and the signage is pretty good. Last 2 kms of the walk, after forty baskets beach, is pretty urban but some of the houses are amazing. Great way to see the real Sydney, although it is the up-market part of the city."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "One of the world's most beautiful walks. This walk is actually 2 walks in one. The section from Spit Bridge to the harbour beaches is mainly through bush on tracks. It is long and quite tiring and can be hot so bring hat etc plus water. This section takes you to the tops of the escarpment which gives the most outstanding views. These views are easily accessible by car and frankly that is OK unless you are a very keen walker because to get there on foot involves a fair bit of not so great walk through the scrub.For me the highlight of the walk is from the start of the beaches once the track meanders down on the northern section all the way to Manly. This part takes you through lots of small pretty secluded beaches (one is, or was, nudist) past boatsheds across a park and then a couple of kilometres of well made path only metres from the water to Manly. Outstandingly beautiful and it takes you past what is now Fairlight where Captain Phillip, the first Governor of Australia in 1788, met with the original inhabitants and was so impressed that he called the area Manly. This is now a tourist trap but still very worth the visit because of it's amazing location, beaches and other wonderful walks."
        }, 
        {
            "index": 260, 
            "rating": "4", 
            "review": "Long, moderately challenging, lovely walk. Long, moderately difficult walk with many steps and uneven surfaces. It's a full day if you stop to take photos or for rests and a meal as we did. My 18 year old son could do the full walk from Spit Bridge to Manly Beach in under 3 hours but I needed 4 and a half. Beautiful, diverse views made it worth it. Enjoyed the ferry ride back to Circular Quay with the Harbour lit up at night."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Fun in Manly. A fabulous walk and views of the coast. Once again have lunch in the beach café it is excellent highly recommended or stay a while and have dinner. The Ferries run until after Midnight.."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "A \"Bush Walk\" in the City. Another don't miss walk near Sydney. Lots and lots of steps and stairs - a lovely workout. Not as crowded as Bondi to Coogee but equally as stunning vistas. A little more nature. I would definitely make time for this one"
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "must do whilst in Sydney. This walk in Spring is amazing, so many wildflowers many are edible if you know the onesamazing photo opportunitiesmany steps so if you have bad knees be preparedif you have a map you can do small sections of the walk, otherwise go all the way from Manly to the spit returning to Sydneycbd by bus.I like to take my time on this walk allow half a day"
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Spent my school holiday with the boys and girl in the split road resident , back in 1960's !. When I was young man I have live there for my school holiday . The house is owned by Doctor . He was working in the St. Vincent Hospital . His house is facing the entrance of the Sydney Harbour . I used to play with the children there . From his home , we can see the whole Sydney Harbour and watching the yacht racing. Really lovely scene ! They are living in the split road ! Below the split road there are yacht and boat parking there . I was very lucky to be there for my school holiday ."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "The Spit to Manly walk. Fantastic walk although you have to be fit enough to walk for a long length of time.what you will experience by taking this walk will remain with you for the rest of your life."
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "very much variation. longer than i thought, took me around 4 hours with photo-stops, but beautiful shots from the coast. from bushwalking to beach to waterfall to cliffs, you will see a lot of different things :)"
        }, 
        {
            "index": 267, 
            "rating": "4", 
            "review": "Wonderful Walk so close to the Big City. 10 kilometres of pure physical pleasure - great views but so close to the city. Difficult in parts but nothing that anyone with average fitness can manage. Beautiful views over both manly and middle harbour. Take water with you and wear hiking shoes - sports shoes will not cut it and most certainly not R M Williams boots like we saw when last on the trail. Great way to spend a couple of hours before catching bus back, which ever way you do the walk"
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "next best way to get to Manly. More great views, fewer people, more a suburban feel next to the beautiful harbour, with Manly the finish line if you head in the right direction. Second best only to the ferry."
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Beautiful walk. Relaxing. Take a few hours out of your day, put on a pair of comfortable shoes, shorts and a t-shirt and enjoy the Sydney winter sunshine."
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "Great views. A 3 hour walk, catch bus 144 from Manly to the spit bridge. Beautiful views and clear water. Just make sure you take good shoes and some water"
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Amazing views, great walk. Bring water snacks, sun cream and good shoes. Get a bus to Spit bridge from wynyard then ferry back from manly."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Great early morning stroll. great way to start the day, a brisk walk with friend to Manly.\nParked the car at the Spit and caught a Taxi back after breakfast in Manly. Sometimes we forget how lucky we are to be living in Sydney"
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Beautiful coastal walk. The walk is quite long, so wear good shoes. It's a beautiful walk that shows stunning hidden beaches and great view points, definitely worth the effort. Allow minimum 3 hours."
        }, 
        {
            "index": 274, 
            "rating": "5", 
            "review": "A big day out. Catch the bus from the city to the Spit Bridge the walk over the bridge and turn right. The best time to do this walk is the Spring when the wildflowers on the coastal heath are out but anytime can be a treat. Catch the ferry back to the city from Manly."
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "2 hour walk. Very nice Sydney walk, great views and good healthy walk. You can get a 180 bus from the city for around 5 dollars and get the manly ferry back to circular quay for around 7 dollars it took around 2 hours for the walk and there's plenty of short cuts if you have google maps"
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Best walk in Sydney. Catch a bus to the spit and enjoy the walk! Take along your swimmers and a towel or even a little fishing rod. The views are brilliant and Manly is a great place to end up in."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "This is a must do Sydney walk!. There are section of this walk where you could believe you were far away from any civilization, then around the next corner or over the next hill you see magnificent stretches of Sydney Harbour or the City or Manly ahead of you!"
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "A walk in the bush by the harbour. Wonderful views of the entrance to Sydney Harbour. Easily accessible by public transport. So close to the city and yet so peaceful."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Great walk lovely views. We usually start at manly and ten turn round when we reach Spit Bridge a big walk sometimes take the dog but you have to go a different route to avoid beach areas. No where to get food or drink so take plenty of water and then stop at the many cafe's at manly a must for fit visitors."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "A must do!. Had a great time exploring military structures. Great views of the Sydney skyline. Very diverse there was sections that had great ocean views and great city views as well as hanging swamp gardens and ponds."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "The best of Sydney. This is a good walk that will take you past and through many of Sydney's terrains. It's a little bush, a little rocky, some beaches, some bridges but most of all it's just a scenic walk that has to be done whilst in Sydney. It takes a good three hours and is not entirely unchallenging, but oh so worth it. There's a few stairs in some parts, but most of it is relatively easy."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "My second favorite walk in sydney. It's a great mix of suburban footpaths, beach and coastal tracks. I am always staggered how such an awesome walk can be so quiet. The walk from the spit bridge to the harbour bridge is better in my opinion."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Great walk, scenic views and a good option to escape the city life. This walk is a great opportunity to escape the busy city life. It's an easy but still adventurous walk along the coast with nice views and you can easily do in four hours. It's perfect for taking photos of the nature, Manly and the Sydney City skyline."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "lovely !. We had a very nice walk along that lovely way.We used the free hop skip bus from Manly Stunning views ! But do not forget to bring water, hat and sunscreen.It took us half day because there are beautiful beaches, views, and lovely flora to see :)"
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "The best coastal walk in Sydney. I've lived in Sydney and done a lot of walking, east side, north side and out west Sydney but this walk is by far the best! So quiet and peaceful with brilliant views over Sydney Harbour. Just make sure you time it well, it can often be wet after rain and a lot of the track is mud!"
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Bush walk by the Sea. One of the most beautiful bush seaside bushwalks. The walk is medium to hard and is 5 kilometres long. It will take approximately 1.5 hours. Along the way are beautiful beaches, stunning views out to to the Heads and Manly, and pretty native flora.Take drinking water and sun screen. Bus transport to Spit Bridge and from Manly back to the City or Chatswood is readily available."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Fun morning adventure. Great walk, the pathways have all been improved recently, lots of places for good breakfast at manly."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Don't miss this. A beautiful walk, stunning vistas. You can do the whole loop Spit to Manly or do it in segments to suit. Not difficult, but need good walking shoes. A few up hills and downhills but not steep. Loo stop at Tania park at midway point. Bushland and foreshore walk. The vies are well worth it. Loos and Cafes at Manly. Catch the bus back or take the ferry back to the city."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Beautiful harbour walk. beautiful Sydney Harbour walk along the shores and through the Aussie bush. If you like getting out and walking to experience the place you are visiting this is it. Camera, comfortable walking shoes, a water bottle, swimmers, money for coffee/lunch and you are set."
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Favourite walk. What better way to enjoy the coastline. Catch a bus to the start at Spit Bridge then wonder through the beautiful coastline finishing at Manly Beach.Refresh at one of the many restaurants which you deserve after the walk then catch a ferry back to town.What better way to spend a beautiful Sydney day"
        }, 
        {
            "index": 291, 
            "rating": "4", 
            "review": "Long but worth it.. Great wallk. You will see the heads and many watercraft and even get into some think scrub at points. Very safe in daytime but you need level of fitness and good shoes. Either way up or back is good."
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Great way to see the harbour and keep fit at the same time.. Wear your trainers, pack a picnic and set off - ideal on any sunny day but if it;s hot make sure you allow for a dip at one of the little beaches on the way. Spectacular harbour views from every spot and if you're lucky the ice cream van will be at Tanya Park as you pass by. At the end of the walk stop off at the Wharf Bar in Manly to enjoy a long drink."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "What a treasure. I heard about this from a random stranger I chatted to at a cafe out at North Head. She had bussed from Manly to The Spit Bridge and then walked back, but she said you could do it the other way, walk first and bus back. 10km she said, and a delight. Don't forget to take the time to enjoy the views along the way.So. I got some basic info from the a manly info centre near the Manly Wharf set off the next morning. Comfy sneakers or walking shoes, and hat, litre of water and a snack are well worth taking. It took me more than two and a half hours but I'm a fair walker. I did most little detours and one big one, and stopped to enjoy to view regularly. you don't have to be super fit but there are a lot of ups and ups and ups, and downs and downs, and lots of steps... It's not for the faint hearted.But I thoroughly enjoyed it. Once there ( at spit bridge) I crossed the bridge and had lunch at a ldelightfull little cafe called The Plank (or was it The Plonk) while I contemplated whether to bus back or walk.Unless you're super keen I'd do one way only. I did both and loved it, but I had no time pressure and I had all day. The walk back with less stops and detours was less than Two and a half hours but I was tired by the time I got back.Basically you just keep as close to the waters edge as you can. There are MSW signs (Manly Scenic Walk) and Google maps will help keep your bearings.I passed plenty of fellow walkers, none made me feel uncomfortable ... but it does get quite out of the way of everything so you may prefer to walk with a friend.There are quite a few toilet stops along the way if you look for them, but don't rely on shops or cafe's.The walk is a treat in either direction so choose what works for you."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "Good walk, beaut views. Did this walk on a nice day, we were a little late starting ( due to making up our mind too late) which meant it was dark when we arrived at Manly, next time we would start earlier in day not lunch time"
        }, 
        {
            "index": 295, 
            "rating": "4", 
            "review": "Keep fit and enjoy the view. Bring water, hat and sunscreen. Starts off on the wide pathways from the Manly End, nice coves and beaches and families out for a stroll. Terrain changes through headland scrub and dirt paths with some steeper sections and stairs. Some great views of the harbour and changing flora. Good exercise you need a moderate level of fitness to complete the walk especially if it is hot. Very worthwhile. Got a ferry to Manly and then the bus back to the City from the Spit."
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "Fantastic way to spend a morning or afternoon. Great walk, lots of variety and great views along the way, takes a good couple of hours but worth the walk."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "Experience Sydney like a local. Today we spent a fantastic 2 hours walking. We did not want to walk the whole track so parked near Dobroyd Point. Lots of parking and it is FREE. Our 10 & 8 year skipped off down the path while my husband & I enjoyed looking at the wildflowers. The views are spectacular. We walked around the Manly 1 hour had a leasursly lunch after an ice cream the family was realy for the walk back. The path is well sign posted with information about the area.I have lived in Sydney for 30 years and never heard of 40 Basket Beach. Well worth a trip. Not suitable for prams or toddlers."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Great exercise and great views. This walk takes in beautiful natural views, and some of the nicest beaches around Sydney. Some parts are quite steep, but a great walk if you take the time you need."
        }, 
        {
            "index": 299, 
            "rating": "3", 
            "review": "Lovely but no signs!. Lovely walk with nice vistas! The map I got from the tourist information center, however, was extremely poor. I managed to find my way, but in some parts of the walk I had to go through some bushes and crawl over big rocks. This part could have done with some signs indicating where to go... Also, wear decent shoes (in stead of summer sandals or thongs)!"
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Great experience of the harbour and foreshore. This is a fairly easy walk with great views of the bush, some homes and the amazing harbour. Have fun."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Beautiful walk. Lots of National Park to walk through, beaches, bush and views. Well maintained path. Easy walk. Easy to start the walk by catching bus to the Spit from Carrington St."
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "Fabulous 10k walk with wonderful views and secret coves. I adored this walk and would rate it more highly than the Bondi Beach to Coogee walk which a lot of people do. Better still do both, they are totally different and a lovely way to get out of the city.For this walk, take the Manly ferry from Circular Quay to Manly, then stop off at the tourist information office as you disembark, the very helpful staff there will give you a map and details of how to pick up a bus back to the city when you finish. Grab some water, your camera, sun lotion if it's hot and a snack and head out.The views as you leave Manly and start to hug the coast are delightful, very quickly you are off the beaten track and wondering is you've wandered into paradise. The coves are tiny and for the most part you will be completely alone. The walk takes you along the coastline and through a number of nature reserves, the biggest of which is part of the Sydney Harbour National Park and includes Dobroyd Head. You climb quite steeply through native scrubland, but it's well worth the views from the top.The walk took me about 3 hours. I am a regular walker and am used to hills, although I did stop to take lots of pictures, so it may take others a little longer. I had a beautiful winters day but I can imagine in the summer it might be quite hot!One word of warning, there are a lot of steps, well maintained on the whole but they could be slippery in wet weather.When you finish, walk to the other side of Spit Bridge and pick up a 179 bus which will take you back to the city in about 30mins."
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "Spit to Manly Walk great experience. I have done this walk several times and love it. Winding through bush, lovely homes some amazing views. You do need to be fairly fit as some of the tracks are tricky, especially on the harbour at high tide. Get to Manly have some fish and chips with a glass of your favourite something, then walk back. Very, very enjoyable."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "Best Walk in Sydney. You need to be reasonably fit and allow at least three hours for this walk. The views are amazing. When you get to Manly reward yourself with a nice meal and drink. Wear good quality walking shoes as there are some rough spots to conquer"
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "A great city bush walk. I walked the Manly to The Spit track with a group of friends. Along the route are beach crossings and some spectacular views of Sydney Harbour and Middle Harbour. Walking on the well marked bush track is relatively easy and there are plenty of scenic stops along the way. Take some lunch and allow about 3 hours. We caught the ferry from Circular Quay to Manly, and the bus from The Spit back to the city. It's a great half-day activity in Sydney!"
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Just stunning. This was a highlight of Sydney for me. It's far nicer than the Bondi to Coogee walk (I'm not saying you shouldn't do that). Just breathtaking and it's not too strenuous. I started at spit so I couldn't finish in manly for some food and drinks. Pity the weather wasn't a bit better but it's that time of the year I suppose! Loved it!"
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Fabulous walk. This is for good walkers if you go all the way to the bridge bit it's worth it. Incredible views of the harbour. Take water with you and sun protection. Once at the bridge you can get a bus back to Manley."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Lovely walk great views. This is a beautiful walk hugging the harbour most of the way.Not recommended in wet weather as it would be very slippery and there are some steep stairs to climb.Stop at Clonny's café in Clontarf Park for a coffee before you start, great coffee, delicious muffins.We are retirees but found this walk pretty easy on the whole.If you are overweight or have any medical problems you may find parts a bit challenging but well worth it.Lots of nice views and native vegetation along the way."
        }, 
        {
            "index": 309, 
            "rating": "4", 
            "review": "Long and partially hilly hike with breathtaking views. We may have been a little naive when we embarked upon this expedition. As regular runners we thought 10k would be a breeze but we forgot to take into account the Australian climate (even in Winter) and the rugged terrain.Main tips? Sensible, comfy shoes and plenty of water and snacks.Although this is technically a coastal walk, you don't actually get to see all that much in the way of coast as most of the walk is along a tree-lined forest path. Where there are viewpoints however, the sea views are truly breathtaking - definitely worth taking a decent camera if you've got a comfortable camera bag.By the time we got to the 8k point we were stopping every 400m or so to have a little rest (there are plenty of benches) and we were very relieved when the harbour came into view at around the 9k mark. It was also at this point that we got to a beach where (at the right times of the year) you can see the native \"Little Penguins\" basking in the sun. They are currently mating and nesting though so we had to make do with the far less cute seagulls.When we finally reached Manly Harbour (about 4.5 hours after we set off from the Spit bridge) we were spoilt for choice in terms of places to rest our weary legs and fill our hungry bellies. We opted for Hugo's on the main wharf (reviewed separately) and we really enjoyed it! Once refreshed, we popped over to the beach (definitely worth a visit) and then hopped on the ferry back to Circular Quay.All in all, a very pleasant walk for those who like a good hike and are prepared to work for their views."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Easy to medium intensity walk. Follow Sydney coastline for most of the walk. Harbour views and fish and chips on the wharf at Manly with a ferry ride back to the city"
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "Great way to see the harbour..and exercise. Not too much to be said other than it is a really good walk with some world beating views. Make sure you take some water along, there are some spots when you will be glad of it. When you get to Manly chill out and get the Ferry back to the city or the Bus back to The Spit."
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "a hidden gem. It is a long walk, but worth it. At one point there an open section and you find yourself kilometres above sea level and just an awesome blue ocean. Check out the aboriginal rock engravings as well. Finish in Manly with a cold one."
        }, 
        {
            "index": 313, 
            "rating": "4", 
            "review": "Day out with exercise and great views. Nice walk have to be fairly fit able to manage stairs and walking up and down hills. Fantastic views of Sydney. Well worth the effort. Train to Wynyard, bus to Spit Bridge. Do the walk, lunch at Manly and catch the ferry back to Circular Quay. Take in the Opera House and catch the train home. Great day."
        }, 
        {
            "index": 314, 
            "rating": "4", 
            "review": "Manly to Spit. Quite a strenuous walk but worth it through coastal forest with great views of the Harbour. Take water and use good shoes."
        }, 
        {
            "index": 315, 
            "rating": "4", 
            "review": "Great Walk Great Views. Great walk to see the inner harbour of Sydney, good workout also and views around every corner fairly easy impact, no wheelchair or stroller access, good walking joggers a must."
        }, 
        {
            "index": 316, 
            "rating": "4", 
            "review": "long easy walk. A very scenic walk with some steep spots but generally not hard work The views from most of the walk are sensational with the top of the walk looking straight past North Head to the ocean. Whilst below hidden amongst the rocks are the depression started artist shacks that was the beginning of much of the famous Australian artists. Finish up at the Manly Wharf Hotel or 4 Pines for a well earned thirst quencher."
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "Spit to Manly or Manly to Spit. This is a great walk, not just for the scenery but it is a lot less expensive than a workout at the Gym. However you can just do part of the walk or you can do what I do and walk to Manly, have lunch then walk back, you will be tired at the end of the day but you will love the beauty along the way whilst receiving a great workout. I have seen people do it in thongs or sandals, however there are lots of uneven steps and I think you should have good walking shoes.Take water as there is no where to get it on the walk and use a light day pack with some snacks and water. About half way there is a great coffee shop and nearby there are public toilets. I can't say how long it will take as everyone walks at a different pace and how often you stop to take in the views, but give it a go, you won't regret it"
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "An unmissable 10k coastal walk for the reasonably fit.. Starting at Spit Bridge and following the track and signs all the way to Manly is great. The views are spectacular and you find all sorts of bays and marinas that you would hardly know existed if you just travelled by car.If you start at about 10am and take 2 hours for the walk, you can get lunch in Manly and then get a taxi back to Spit bridge."
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "One of the most varied scenic walks!. We visit Bondi Beach twice a year to spend time with family. This last visit we took this walk for the first time. Our 'go to' walk is Bondi to Coggee. This was a real treat. Fewer people, more challenging, and fabulous scenery and vistas. Seeing the variety of neighborhoods up close was an added bonus. Can't recommend this walk enough. We took the bus from downtown to the far side of the Bridge and walked down the stairs. We took the ferry back from Manly. A must do for anyone who wants to get away from the typical tourist attractions!"
        }, 
        {
            "index": 320, 
            "rating": "4", 
            "review": "Amazing Views. Views along the walk are amazing. Dont do this walk in the heat. There are no water fountains and shelter along this walk. Watch out for water dragons too!"
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "Enjoyable day out. train to Wynyard station, bus to South side of Spit Bridge. Start the walk on North side of bridge. If you're luck enough you'll see the bridge open to allow a yaght through, like I did. Medium fitness required, in the wet months, definitely walking shoes, can be quite wet in parts, at time you need to wade through if you walk the beach. So many different aspects and views of the landscape, breathtaking in places. Reward at the end, take the walking shoes off, wade in the ocean, partake in a Belgium Beer at Manley Wharf."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Medium level walk. Great walk on a fine day. Take Bus 279 from Wynyard station. Ring the bell as you are going over Spit Bridge. You get off the bus about 200m past Spit bridge, walk back towards bridge and take left turn into Avona ...walk down maybe 250m, track starts off to the left. If you are able to do a 10km walk on flat ground in say 2 hours, you will do this one to the main drag in Manly in an easy 3 hours. That allows for a few photo stops and time for a quick snack from your backpack. Don't forget the camera."
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "What a great walk with friends on a nice day.. Enjoy Sydney harbour views, get exercise and fresh air and even discover aboriginal drawings on a rock. And when you arrive at Manly a great choice of places to have lunch. This is one of many Sydney walks and a particularly enjoyable one."
        }, 
        {
            "index": 324, 
            "rating": "3", 
            "review": "great walk. great views - steep in parts. Don't bring a car as parking in Manly is difficult to find and expensive. Watch out for tides, we had to wade through water on the the way back but to be fair, this was one of the high points. Also lots of good short walks from Manly"
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "Absolutely fabulous. Gorgeous views and great work out thrown In. Will do it again. Harmonises vistas with the incredible amount of national park a stone's throw from the city."
        }, 
        {
            "index": 326, 
            "rating": "3", 
            "review": "I was thinking better!. I was there with a friend. First time for both.Tried to go fast because was little bit late, closer to the sunset. We spend 3 hours to arrive in Manly. I was thinking better because I was expectating more views..Instead there is only 1-2 . Yes, that are spectacular. Other thing to watch is vegetation. Ok, done!"
        }, 
        {
            "index": 327, 
            "rating": "5", 
            "review": "Loved it. A great way to spend a beautiful sunny day in Sydey. The walk took us about 3 hours with lots of stops along the way to admire the views and take photographs. It is reasonably easy terrain but I would recommend good walking shoes and a water bottle. Have lunch at one of the cafes along the beachfront in Manly at the end of the walk."
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Harbour walk. Fantastic scenery along the way. It is about 10 km between the Spit and Manly and it is well sign posted. I have run and walked it on a few occasions and never tire of its wonder. Beautiful little bays, beaches, rocky outcrops and some ancient Aboriginal rock carvings in the sandstone are just some of the features you will notice. Most of the people along the way are enjoying the same great walk. Catch the bus (190? and a few others that head north), disembark at The Spit, walk to Manly, lunchan/or swim and ferry back to Sydney. A nice day in Sydney will be had by all!"
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "Another view of Sydney Harbour & Manly. The Spit to Manly walk commences at the northern (Seaforth) side of the Spit Bridge and follows the harbour front to Manly, a northern harbour and ocean surf beach, with many bars and restaurants. The walk provides access to Clontarf (Sandy) and Washaway Beaches and some beautiful scenery, including littoral vegetation, harbour-front sandstone cliffs and historic squatters cottages, which are open on weekends for viewing.A short part of the walk into Manly is along the road before re-joining the esplanade and ending at Manly ferry wharf, where are plenty of places to eat and drink. A short walk through the Manly Mall brings you to the Manly ocean surf beach and if you're really keen you can continue south to Shelley Beach, which is quite sheltered and has some interesting diving."
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "Escape the city and take in some commanding harbour views. At just under 10km, the walk should take around 2-3 hours depending on your fitness and of course how many times you stop to take pictures!The first km is fairly uneventful, skirting Fisher Bay with the sound of traffic still ringing in your ears. Clontarf Reserve is a super place for a picnic, with wide beaches, a netted swimming area and a great park and play area for kids. The next 5km take you round the edge of Dobroyd Head, giving you great views back to Balmoral and out towards the Tasman Sea. The path until Forty Baskets Beach is hard-packed dirt single-track, with plenty of steps - not suitable for rolling transport!Continuing from Forty Baskets Beach, the path is metalled all the way into Manly. If travelling with wheels, be sure to take Condamine Street up to Lauderdale Avenue, bypassing North Harbour Reserve, else continue up the steps and onto the spectacular harbour-side path.Toilets are located at Clontarf Reserve, North Harbour Reserve, Fairlight Beach and of course Manly, with water taps at each."
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "Spit Bridge to Many Coastal Walk. The Spit Bridge to Many Coastal Walk is a 10km walk from the Northern end of Spit Bridge to Manly. It is a moderate walk and takes you through Sydney Harbour National Park as well as a few suburban streets... To get to the start, your best bet is to either a) Drive to the Spit Bridge and walk to Manly, then catch a bus back to Spit Bridge. OR b) Bus to Spit Bridge and then either bus back to your destination and if your destination is in the city, a ferry back to Circular Quay is another option. It is advisable to take plenty of water and supplies with you as there are not that many facilities along the way and it can get quite hot during summer. Keep it a little on the light side though as it is a 10 km walk.Take your swimmers as there are opportunities to swim during summer.You will get plenty of chances for fabulous city and Manly pictures along the way and additionally there are aboriginal rock art works. Not really recommended for small children or prams as parts of the track can get a little rough.Ending up at Manly, there are plenty of eating opportunities as well as great beach.Highly recommended nature walk very close to the city and highlights the hidden beauty spot that are hidden all around Sydney.Note: As you travel though a National Park, Dogs and other domestic animals are not permitted."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Incredible experience, would definitely recommend. Doing the Spit Bridge to Manly walk was a phenomenal experience. At Spit Bridge, I was lucky enough to be able to witness the bridge rising in order to let boats pass through underneath, which was a real treat as I had never seen anything like that before. The walk itself was great- it was very tranquil, quiet and peaceful throughout. There were some tricky bits here and there where the path narrowed to the point where it couldn't have been more than a metre across, plus there sometimes would be trees and bushes obstructing the path every now and then which needed to be ducked under. Not exactly very well-maintained, but definitely not a reason to avoid doing the walk altogether and the good far outweigh the bad.It took about 4 to complete, and by the end I was pretty drained, so make sure that you're well-prepared by wearing comfortable shoes, applying sunscreen, and bringing lots of water. Overall, would wholeheartedly recommend to anyone willing to do a bit of walking."
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "So close to the city, but a completely different world. My Finnish friend and I took the ferry from Circular Quay to Manly and were very lucky with the weather. After a couple of minutes we already saw some really nice, isolated beaches and had to push ourselves to not stop every 5 minutes. After about 2 hours, we found a completely isolated beach which we could only access by climbing over spiky rocks and getting all wet, but we had a beautiful beach full of shells to ourselves and probably spent 2 or 3 hours there. The entire walk is beautiful, on one hand the ocean is always on your left side, but on the other hand you feel like you're in the middle of a jungle with all kinds of small bridges and plants. I unfortunately forgot my sunscreen and after a sunny day in the Australian summer, I was very sunburnt, so don't forget your sunscreen! We took the bus back to the city from The Spit. If you only have limited time in Sydney and have to decide between this walk and the Bondi - Coogee Walk, definitely go with this one. Even though it's longer and more exhausting, it's absolutely worth it!"
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Leave the city behind and yet so accessible. This really is a great walk and perfect to take visiting friends on. Even though it is a long walk(over 3 hrs) it is an easy walk. We were accompanied by teenagers and pre teens and they completed it without complaining. It helps to have an ice cream break at the Clontarf kiosk. The walk goes through beach and bush and there are a couple of detours you can take. On a beautiful day this is the ideal thing to do in Sydney. It's free and easy. There is plenty of parking at the spit and buses back from Manly if you don't want to walk back."
        }, 
        {
            "index": 335, 
            "rating": "5", 
            "review": "Spit Bridge to Manly walk.. Our son and his wife took us on this walk, which takes about 3 1/2 hrs. It meanders through rain forests with man made pathways, has two little waterfalls, hidden coves and beaches, sailing marinas, and lots of other hidden gems. There are two toilet blocks en route, and a cafe mid way, for those needing a break or two! Take good walking shoes, not flip flops and a camera for those stunning view So!"
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "Great walk. Great walk around Sydney's beautiful harbour. Great views and nice little beaches. Bring your picnic with you and you will have a great day out.Enjoy!!!"
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "Excellent urban hike.. This nice, fairly long hike covers several different terrain types and offers excellent views of different parts of Sydney. Look for the cool, huge lizards along the way.See views of the city from a distance, walk through some interesting neighborhoods and end at Manly Beach for lunch, drinks and a pleasant ferry ride back to Circular Quay and see the Opera House from the water.Not exactly strenuous but may be somewhat challenging for some who aren't accustomed to longer hikes."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "Excellent Walk Within City Limits. Very nice walk with easy transport options from Sydney CBD. Strongly recommend this as a great half day out of the city centre. Don't forget to include an ice cream and a swim at Manly Beach."
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "Great walk around the harbour. Delightful walk beside the harbour with not too many ups and downs. We did this as a training walk for a bigger hike and stopped at Manly for lunch before returning to make a great round trip!"
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "Great walk with great views. I have trekked along the route from Manly ferry wharf to the Spit Bridge many times. It is a walk of about 10km. Parts of it are along flat paved pathways, but most of it is bush track which includes rough patches with rock stairs. At times you will be using short sections of roadway.You need to be reasonably fit with good knees and hips due to the many ups and downs encountered. You will be rewarded however with great views over Manly and the Heads, as well as native flora and even Aboriginal rock carvings. Towards the end is a park where you can grab lunch or a coffee, or even have a swim. I generally do the walk in just under two hours, but that is at a reasonably fast pace.Pros- it's FREE- you get to see great views. Take a camera.- it's reasonably well signposted.- there is a coffee shop with lunch available towards the end- at the Spit are also coffee shops and places for lunch.- there are a few water bubblers along the way but mainly in the first section within small park areas that you walk through. I suggest you carry some water.Cons- you need a reasonable degree of fitness for some sections involving steps.- the track could be sloppy in wet weather- you could accidentally get side-tracked in some places if you don't find the direction signs.- only the first small part of the way in wheelchair accessible.Suggestions- take a camera- take some water- wear good flat shoes with traction- wear sunscreen and a hat- look out for the path direction signs and check the maps which are placed at various spots along the route.To get there, catch the Manly ferry to Manly wharf, leave the wharf and turn left towards the aquarium.At the Spit, walk across the bridge, cross to the western side of the road and catch the bus back to Manly (route 143 or 144). The stop is about 100m from the southern end of the bridge, directly across the road from Zest Waterfront Venues.Enjoy beautiful Sydney."
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "Amazing harbour-side walk in the middle of the city. This is a fantastic walk from Spit to Manly. I always love starting at the Spit Bridge end, fuelling up with the delicious fish'n'chips at Clonny's. The walk has spectacular views of the harbour, as well as moments of pure bushland - making it seem hard to believe that you are walking just minutes away from some of the most expensive real estate in the country. A pretty easy walk, but some parts can get quite muddy after some rain. Reward yourselves with something delicious in Manly - I usually indulge in a gelato at the wharf ;-)"
        }, 
        {
            "index": 342, 
            "rating": "4", 
            "review": "Good walk, some really scenic points.. Firstly I'd say this was my second favourite after Bondi to Coogee beach. We always like walking by the coast and this was no exception, although there is more walking amongst trees between the view points than on the other. Glad we did it. If taking the bus to Spit bridge to start, best way, then make sure you get off the bus before crossing the bridge as crossing the road with heavy traffic afterwards is difficult."
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "Spit bridge walk.. Takes you along lovely scenic route. Do however give yourself 3/4 hours to complete walk. Dont forget your camera, the cliff top views are amazing."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Beautiful way to see Sydney Harbour. Need to be reasonably fit as its a serious hike, bring a water bottle and a good camera, its hard to believe that its free"
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Great views of Sydney and hidden small beaches. That walk is pretty long but awesome. You will need to allow yourself 4/5hours to do it. Worth to take a picnic along and just have a break at one of the hidden beaches you would see on your way."
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "Magnificent walk along beaches, see amazing houses, views of the water, through bush. A fantastic walk to do whether your a tourist or local.You climb through bush, walk along the beach and come across amazing houses set in amongst the trees. People walk, or even run the route.You can stop and take a dip in the sea at most points and you are away from the crowds.You see the headland at many points and are gobsmacked at the beauty, Its takes over 2hrs to do the walk at a reasonable pace, when you are in manly near the jetty you feel absolutely ready for a glorious ice-cream or a dip in the sea.Everybody should do it at least once, Done solo or as a group, young or old its manageable for all.Just do it !"
        }, 
        {
            "index": 347, 
            "rating": "4", 
            "review": "Nice day. Take a day for this walk, you'll find little beach where you'll want to have a break and you should take time to swim in this wonderful scenery !"
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Do this!!. I fell in love with Sydney on this hike. Amazing way to see a different side of the city, hiking along a well-marked trail that snakes along seaside cliffs, charming coves and cute neighborhoods. Bring your camera! Some of the views are jaw-dropping. Bring water too! It's a long'ish (6+ mile) hike and it can get hot! Tip: If you are staying in DT Sydney, have a cab drop you off near the Spit Bridge, then hike to Manly, reward yourself with a beachside lunch and drink, then catch the \"government ferry\" back to downtown Sydney. The best $7 I have ever spent (ferry ticket)."
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "Must do walk/run. The views! This is my regular running track and I live along it. Some of the most beautiful hidden harbour beaches are along this track, so pack some cozzies if you want to swim. Clontarf is stunning, as is Castle Rock Beach & Forty Baskets. You get to see a lot of water dragons -a native lizard -it won't hurt you. There are taps to drink from and toilets at Clontarf, Forty Baskets, Middle Harbour & all along the Fairlight harbour walk. There are cafes along the route. From the Spit to Manly -it's under 10kms. Joggers are perfect foot wear."
        }, 
        {
            "index": 350, 
            "rating": "4", 
            "review": "Fresh Sunday Morning Walk. We went early in the morning to avoid as much of the hot sun. You can take it as fast as slow as you want. There are many idyllic locations for a picture, a rest or a swim. We waiting until we were a bit closer to manly and swam at Fairlight rock pool. It was divine after the hot hike on a lovely summer morning.Followed by some fish and chips in Manly Wharf Hotel and then caught the bus back to our car at spit bridge."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Great Walk. I loved seeing all the different types of coast. You are able to see many environment and plants in a relatively small area. Take lots of water as it is a long walk. Easy to grab a bit or have a restroom break about every km or so. It will end at Manly Beach just a short walk from the ferry docks with regular ferries to Sydney."
        }, 
        {
            "index": 352, 
            "rating": "5", 
            "review": "Great way to see a different side of beautiful Sydney. This walk is a fantastic way to see some beautiful bushland and coastal scenery with spectacular views of Sydney Harbour, Middle Harbour, the Heads, secluded harbour beaches, Aboriginal rock carvings, native flowers and Manly Cove. And it's free!"
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Beautiful. What a beautiful walk! You feel like you're a million miles from the city, and stopping off at secluded beaches along the way for a dip makes you feel like you're a million miles from anywhere. It took us way longer than it should have as I stopped to look at every lizard and bird I could see, but that just made it all the better. Bumping into a nesting family of Tawny Frogmouths really made this a walk I'll never forget."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Wow ,absolutely beautiful. Great walk ,a good 2 - 3 hours ....but stunning ,we enjoyed immensely ,,,,Then catch bus back to Manly ,,,for ferry ,Wonderful day out"
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "Great walk with spectacular views. I walked today the trail from Manly to Spit bridge you will see some great views along the trail and if your lucky dome huge dragon lizards. The trail is for the most part easy to walk with some rocky hills up and down on some of the parts. Make sure you bring enough water and your swimsuit to use the pools or beaches along the trail. "
        }, 
        {
            "index": 356, 
            "rating": "4", 
            "review": "It's LONG!!!!. Much longer than 9 km! Bring water, snacks, and good sturdy hiking shoes. The walk is up and down, up and down, up and down many many steps. It took us 5 & 1/2 hours!!! The guide book says 9 km and 3 - 4 hours. We ran out of water, didn't have any food, and wore teva sandals. Be prepared! We also went during the hottest part of the day! Having said all that, I would do it again in a heartbeat! The rewards are jewels! Views, wildlife, and aboriginal carvings in rock. We stumbled into the Manly pier and stopped at an outdoor pub where we gulped wine and devoured delicious pizza at the end."
        }, 
        {
            "index": 357, 
            "rating": "4", 
            "review": "Pleasant harbourside walk, not too challenging. Caught the 180 bus from the city to Spit Bridge to start the walk so we could finish at Manly, have a bite to eat/cup of coffee and then travel back to the city via the Manly Ferry. Suggest you hop off at the stop just before the Spit Bridge as there are clean toilets in the park, and you can then walk over the Spit Bridge before commencing the Walk. The walk took us 3.5 hrs, which included a stop for lunch and also a swim at the beautiful quiet little Reef Beach. The walk is not too challenging and is very scenic with beautiful views of the Harbour. The Aboriginal Rock Carvings at the Grotto are also very interesting. Take your swimmers as there are a number of quiet beaches along the way. At some places you may get your feet wet or have to take a short diversion if it is high tide. We saw some lovely wildflowers, a few bush turkeys and a number of water dragons. A great walk, definitely recommend it."
        }, 
        {
            "index": 358, 
            "rating": "4", 
            "review": "Beautiful, serene. Parked at the Spit and had to wait for the bridge to open and close, a good way to start our walk. Not too challenging, scenic, had to walk thru the water because of high tide, lovely views of the different bays, enjoyed lunch on the Corso, a great walk, definitely recommend it to both Sydneysiders and visitors alike."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "WALK. Relaxed and can take your time. There is so much to do in Manly at the end of this walk you will have a smile on your face."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "My home turf. My house is right on the tip of Manly's North Harbour, so this wonderful walk is right outside my front door.I normally do the walk from the Manly end.You will have spectacular views of Sydney Harbour and out through North and South Heads.Depending on the season you will see an abundance of Original Australian flora and bird life, You often see various types of Australian lizards and occasionally a snake. Just keep out of the snakes way and it will not bother you.I do the walk for exercise so it takes me about an hour. A more lcomfortable pace would be two hours."
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "Don't forget your walking boots.. It's a great medium sized walk. Can be a bit iffy in places, but it is well worth your while, as are all the walks in Sydney. Lets face it, if you can see water it has got to be good."
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "waterside walk. easy walk and beautiful scenery buses at both ends and plenty of food available also at ends . take your swimmers for a dip at Clontarf., showers and change room available."
        }, 
        {
            "index": 363, 
            "rating": "4", 
            "review": "Spit to Manly walk. This is a great walk for committed walkers with fabulous views around Sydney Harbour. Although well constructed and clearly signposted some of the walk can be a little bit rough. Also, there are very few opportunities to get off the walk - once you are on it you need to keep going. Not recommended for the casual walker. Allow at least 3 hours."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "The Spit to Manly. This has to be one of the most scenic walks in the world, it takes a good three hours, but you can stop and have a swim at several places along the way if you get too hot . Highly recommended !"
        }, 
        {
            "index": 365, 
            "rating": "4", 
            "review": "Long bush walk. Allow several hours to complete this walk but this illustrates the beauty of Sydney as bush and nature exists in all areas of the city . The walk follow the coastline from the Spit Bridge to Manly where you can stop and enjoy many restaurants , cafes and a beach swim at the end of your walk"
        }, 
        {
            "index": 366, 
            "rating": "3", 
            "review": "Classic Walk. It is an OK walk but has some really boring bits towards the end - walking on urban streets that are uninspiring"
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "Ideal any time. This 3 hour walk is a relatively unchallenging but highly scenic stroll around the harbour foreshore to beautiful Manly. In summer you can stop at a number of beaches to swim along the way, and any time of the year it is usually perfect to paddle or enjoy the stunning views of craft and bayside parks natural flora."
        }, 
        {
            "index": 368, 
            "rating": "5", 
            "review": "Yes, yes, yes...Take this walk. This is a way cool coastal walk. It's worth the trip over from Sydney just for the hike. This isn't a flip-flop hike-walk. This isn't a little kiddie or stroller walk. Take real walking shoes. Not a strenuous walk, just kinda long, kinda hot with some killer views as well as ups and downs.Ferry over from Sydney and Take a cab (~$20) from ferry to the bridge spit. Easy trail and well maintained. Up hills and down hills. Takes 2 plus hours. I liked this walk better than Bondi to Coogee. Much more varied walk and terrain. I say do both! And then eat at a beach cafe in Manly, swim in the ocean and enjoy."
        }, 
        {
            "index": 369, 
            "rating": "4", 
            "review": "Feel a million miles from the city with spectacular views. Look at the city and beautiful bays and inlets as you walk through scrub and bush land. At points you will feel you are miles away from the city and then you will be viewing the bridge and magnificent beaches through the trees. Take a drink and your swimming costumes. It can get hot and you can cool off swimming as you go. Relax at Manly when you arrive at one of the many bars or restaurants. Or carry a snack to eat as you walk. Really beautiful. Gets hot so take a hat in summer."
        }, 
        {
            "index": 370, 
            "rating": "4", 
            "review": "A taste of the Australian bushland in a walk. This walk is quintessentially Australian. Experience the flora and fauna with beautiful Sydney harbour by your side. And when you have finished you can get a beer and food!"
        }, 
        {
            "index": 371, 
            "rating": "4", 
            "review": "Good alternative to Bondi-Coggee. A 10K walk through woodland and sea-front, with at least one good beach swim about half way. And great views of the Gap between North and South heads. Allow 4 hours including a short swim. Recommend starting at Spit Bridge so you can end in Manley, have a beer and get the ferry back to Circular Quay. You can catch the bus outside the QVB, every 15 mins or so, 30-35 min journey. Get off at the Spit Bridge stop, virtually on the bridge, cross the bridge and turn right. We made the mistake of going on one further stop, ending up in the suburbs and doubling back. The first short stage is along a suburban fore-shore but the walk gets quieter with great sea views. Loos available along the way."
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "Loved it!. Some really nice views, nature, beaches and places to see all along the walk. Best to really take your time and appreciate everything. Most of the walk is pretty well marked out which is good."
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Great walk. Completed this walk on a hot day and in flipflops (which was stupid, but we'd started so we finished) - best wear trainers or sturdy shoes. It took the whole morning and was relatively strenuous but views along the way make the effort more than worthwhile."
        }, 
        {
            "index": 374, 
            "rating": "5", 
            "review": "One of my favourite walks in Sydney.. I love this walk, it meanders from Manly and then five minutes walk from Manly you feel like you're miles away from Sydney and all the people (although you're not because half of Sydney is doing the walk with you!). Take food, drink and walking shoes, and even bathers. There is a great place to go swimming on the way. Also, toilet facilities along the way too. There is car parking available at the end of the walk. A lovely place to share with friends or as a couple (next time I'm going with someone). A most enjoyable walk."
        }, 
        {
            "index": 375, 
            "rating": "4", 
            "review": "make sure your fit to do this one. along the walk it has marvellous views. Take food and plenty of water as its a long walk but much enjoyable"
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "Great Walk with Stunning Views!. This is a moderate walk of about 7kms. If you start from the Spit Bridge the first fews kms are a little steep, but once you are at the top the view if so worth it! There are lots of nice coffee places and eateries at the Manly end! Try having a bite and then turning around to head back to the Spit Bridge! A great walk!"
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "Trail run to Manly. I actually started in downtown Sydney and went for a long run across the Harbour Bridge and along the coast, which included the Spit Bridge to Manly section. I really enjoyed the hilly stretch from Spit Bridge to Manly. There were great views of the coast, included Sydney in the distance. You also get a nice view of Manly from up on the hill.I would highly recommend this ~10km walk / run."
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "Well worth the effort. The route is quite tricky in parts, there are a fair number of steps to climb, the heat can be very challenging , but with plenty of water and regular sitting in the shade we managed, the scenery is wonderful, take swim wear to cool off along the way"
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "One of the best. I have done this walk many times with friends and family. An easy relaxing walk suitable if you have young ones or not so fit older ones!Not very challenging but rewards come elsewhere. Couple of beautiful beaches / stopping points along the way where you can take a dip on a hot day. Stunning views and many photo opportunities. Aboriginal carvings. Then when you get to Manly you can rewards yourselves with a beautiful meal as there is plenty to choose from. Once with friends our reward was the beer cafe on the wharf - but not with family as this place does not allow children inside. Then to top the day off there is the ferry ride back to circular Quay."
        }, 
        {
            "index": 380, 
            "rating": "4", 
            "review": "Take your camera. Not good if you go just after a few days of ran as the track can get muddy but just make sure you wear appropriate shoes.I live locally and use this track as a running trek early morning a few times throughout the year.Take a camera and get up early to see the sun come up and then finish off in Manly for breakfast.It's FREE and a little gem if you want harbour views"
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "One of the most rewarding walks you will do in Sydney. An excellent slightly challenging walk with amazing coastal scenery and plenty of beaches for a drip along the way. Allow 3 hours."
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "Manly to the Spit. I actually walked in the opposite direction from Manly to the Spit but obviously the views and the ambience are just the same. Stunning views all the way! Walk is well shaded.If you go at low tide you can walk along the harbour between Reef Beach and 40 Baskets and this cuts the time down considerably. This deviation is well signposted.I would allow about 4 hours but if you're hungry to get to the restaurants in Manly I'm sure you can do it in less. Well worth the effort."
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "Very pleasant walk. This has to be one of the best spots in Sydney. If you are interested in scenic bush walks then this is a great example. Some mild up and downs in parts but not difficult. The views that are on offer and the tranquility provided in many areas along the track let you think you are a lot further from civilisation than reality. The convenience of the bus service at each end is perfect. Take your time and stop to enjoy. This is an excellent facility that allows any of us to appreciate the foreshore area of a picturesque harbour."
        }, 
        {
            "index": 384, 
            "rating": "5", 
            "review": "Great walk with spectacular views.. Start of walk a little hard to find after getting off the bus at The Spit also had to cross very busy 4 lane highway which we didn't expect. Beautiful beaches and coves passed at start of the walk then through quite good bush tracks. Great views the higher we got and lots of shade in the bush. Take plenty of water and your bathers as lots of opportunities to swim early on. Long walk but worth it."
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "Moderate walk. This is a moderate walk with some steps, paid parking is available at the Spit Bridge area and you can get a bus back fro Manly or walk back. Signage is not as great as it could be and there are some parts which go up small streets. Plan it out so you keep on the walk.Dobroyd Point is a great place to see the Harbour at its best, there are places to swim the closer you get to Manly. I would not call this an easy walk but its not too hard either."
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "Beaut Walk. We caught the 144 bus from Manly Wharf to the Spit. There's a track leading down from Avona Cres to the start of the walk, so no need to tangle with the traffic on Spit Rd.The track is in good condition mainly passing through bush above the shoreline and in places along the waterline. There's beautiful views of Middle Harbour in the stretch up to Grotto Point. After that the track passes round Dobroyd Head with big views across the Heads and Sydney Harbour. There's plenty of opportunity to stop for a swim at small beaches along the way at Clontarf, Castle Rock, Reef, Forty Baskets and Fairlight beaches. This is a great way to get a feel for the wild parts of Sydney Harbour."
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "One Of The Best In Sydney Harbour. It is a ten km walk and there are steps up and down but the scenery is worth the effort. The scenery changes from the start from dry to sub-tropical. You do see a range of views of the harbour and something not to be missed."
        }, 
        {
            "index": 388, 
            "rating": "4", 
            "review": "Excellent . This hike is not very difficult and takes 3-4 hrs. Lots of excellent views along the way. A very peaceful way to pass half a day."
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "Great trek!. My friend and I did this walk and enjoyed every minute of it, despite the rain! It's not too difficult of a trek, and the views are lovely!"
        }, 
        {
            "index": 390, 
            "rating": "5", 
            "review": "Taronga Zoo to Manly Pacific Hotel - wonderful days walk. the walk I did was a few years ago from Taronga Park Zoo and Surius Cove to The Manly Pacific Hotel via the Quarantine Station. It should be a must on everyones TO DO LIST. Allow a day to enjoy all the scenery and enjoy an ice cream and rest at The Spit. Sit and watch the array of boats and yachts coming and going all day. And finish the day at Manly Pacific and your favourite drink. Mine was a well deserved Shandy"
        }, 
        {
            "index": 391, 
            "rating": "5", 
            "review": "Really good walk. Absolutely loved this walk as you get to quite a few hidden gems away from the crowds. We went for a swim in one of the secluded beaches along the walk.\nThe only downside is that getting on the bus from the spit bridge back to the city or the upper north shore is a bit of an hassle."
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "worth it. Easy walking either way. Good views of coast and lots of hidden beaches for swims. Good cafe at Spit Bridge end and bus 180 back to city from there if start at Manly."
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "A good hike with splendid view of the harbour and city. This is the hike I usually did with visitors who like a good hike. Starting on the Spit Bridge (take the bus there from Manly Wharf) and leads along the shore, harbour beaches, cliffs, bush... towards Manly Wharf. Make sure you wear good sturdy shoes and are reasonably fit because there are plenty of stairs and the walk talks a good few hours. You will be satisfied with great views and scenery!!!"
        }, 
        {
            "index": 394, 
            "rating": "5", 
            "review": "Spectacular scenery. We started the 10 km walk from the Northern side of The Spit bridge. It's fairly well signposted. The walk involves lots of steps, ( some steep) gravel paths and some boardwalks. It offers spectacular views of the city, harbour and Manly. The wild flowers were beautiful, especially , the flannel flowers , bottle brushes and grevilleas. We also saw lots of bearded dragons. Take plenty of water and snacks as there are none until you get to Manly. Wear a hat and sunscreen and joggers. It took us 3 hrs 20 mts but take time to enjoy this fabulous walk."
        }, 
        {
            "index": 395, 
            "rating": "5", 
            "review": "Spit Bridge to Manly Walk. This walk is so popular it is in danger of being \"over-loved\". It is probably a good idea to choose a time about mid-morning, after the exercise fiends have gone home. It takes a leisurely five hours and there are beautiful views all along the way. If you are specially lucky around Christmas you might see some red and gold Christmas Bells. Either catch a bus to the Spit Bridge - the walk starts from the northern side. Once you have reached Manly there is either the harbour pool or a short walk to the surf for a refreshing swim. If you happen to be there during the winter, the views are still there but perhaps you might prefer to visit the Manly Art Gallery, which you pass at the western end of the harbour pool."
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "Spectacular walk. We started at Spit Bridge after getting the bus from CBD. We were lucky to be with my son who lives here who knew which bus stop to get off at as it was not obvious. Then started the 10k walk of varying terrains. At some points the steps were quite taxing but for 50 plusers managed ok with a stop halfway at one of the beautiful beaches. The walk is a mixture of stone paths, steps & wooden boardwalks. We spotted plenty of lizard varieties basking along the path. Take water & snacks but remember no bins along this walk I assume because of wildlife so please don't spoil this wonderful environment and take litter home with you. When you get near to Manly the walk takes you through a residential area & park but this is interesting to see the houses in this prestigious location. The Bavarian Bar at Manly Wharf was certainly a welcome sight and beers and hotdogs went down as a well earned reward. Loved this walk. Would definitely recommend it."
        }, 
        {
            "index": 397, 
            "rating": "4", 
            "review": "Great diversity of environment on the walk, great views. My wife and I did the walk in summer. We are not youngsters! We drove to the spit bridge and parked on the sydney side of the bridge and then did the walk and caught the bus back from Manly to the spit. The walk took about 3 hours. was easy for most of it and hard for some parts. taking it easy is the key to doing it. Dont rush. take water and snacks. well marked path. huge diversity of native plants on the way. great views of sydney harbour and manly. We have done many of the walks around sydney harbour and this is one of the most challenging so take your time. the harder bits are in the first 1/3 of the walk from the spit. You really enjoy food and drinks at one of the many Manly restaurants or cafes when you get there!! If the temperature was much more than low 30s I would not do it on that day. Morning would be best and low tide is better than high tide. We saw quite a few eastern australian water dragons on the walk which are always great to see. Stopping at the Arabanoo Lookout is worth it later in the walk. When you read that cafes are on the way (in some websites they mean at the end of the walk as there are none for 90% of the walk."
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "Great scenery. Have done this walk both ways now it never gets boring. Although it can get very hot there are places were you are in dappled shade. Take water, snacks, camera and wear comfortable covered in footwear. Some great scenery. If low tide there are spots where you can walk along the beach otherwise follow the track. Saw some very large water dragons along the way on the path."
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "Stunning scenery. We ventured along this walk in the Manly to Spit Bridge direction. The walk takes you through some beautiful suburban areas of Manly, with spectacular, ever changing views of the coastline and harbour. The path is gently undulating to begin with, but there are some short steep climbs along the route. The path is well managed, but is some places, steps are in need of repair and you need to watch your footing. This is evidently about to be rectified as concrete blocks had already been delivered to areas of bad wear.We took the walk on a warm (31C) afternoon. There was plenty of shade, but it is essential to carry water as we did not see anywhere on route where we could have obtained any.On the day we walked, the tide was relatively low and we were able to enjoy long stretches of the walk on the foreshore. In one place this involved a scrabble over some rocks. We do not know whether we missed the path markings, or if this was the intended route. However, it was great fun and added some extra interest to our walk. There is an alternative higher path if the tide is in.The path is marked as being about 8km. It felt longer, and took us about 3 hours to complete, taking our time and enjoying the scenery, but ceratinly was not unpleasant and we would recommend"
        }, 
        {
            "index": 400, 
            "rating": "5", 
            "review": "Great Walk, Great Views, Bring LightMeal+Snacks+Water, Weather Dependent. My wife and I had an excellent time doing this walk...I wouldn't plan on doing anything else unless you start early...As the title says, but a few tips below...1. Check the weather before you walk. It's better at low tide, but there are good signs for tracks catering to High tide conditions. 2. Bring snacks and a Camera/iPhone, it's about 3 hours one way. We brought an Apple, Sandwich, A pack of muesli bars, and 1L water each...3. Stop and enjoy the Views4. Start at the Spit, there's a walk way under the bridge, then relax at Manly Beach. Websites that I found helpful other than TripAdvisor of course!http://members.ozemail.com.au/~russo/oceanbeach/spit.htmlhttp://short-walks.com.au/new-south-wales/sydney/spit-bridge-to-manly-walk/5. There are a couple of Bathroom stops.6. I'd recommend buying an opal card if you taking public transport."
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "Stunning views and a great walk. Take the bus to the Spit Bridge from the city and them walk all the way to Manly. Then catch the Ferry back to Circular Quay. The walk is packed with plenty of stunning views. Nothing hard about this walk. I would allow 2 to 3 hours to complete."
        }, 
        {
            "index": 402, 
            "rating": "4", 
            "review": "Weather can make or break.. Like all travellers, you have to take the weather as you find it. Such was the case in the long planned tour of Sydney and the Spit to Manly walk. Being prepared for all weather elements in an unseasonal period of Sydney weather, we took in the sights of the Spit Bridge and nearby boats and the occasional boathouse, as we wended our way across sandstone steps and winding paths. Barely into our walk the heavens opened and we were forced to shelter in a convenient marina at Sandy Bay to wait out the downpour. Most of the remainder of the walk took in spectacular harbour views, including long distance views of the Sydney Heads and the Manly Ferry as we made our way along the ever ascending and descending sets of steps of the walk path. At one point we found diverted to Grotto Point to take in primitive Aboriginal stone carvings of fish, whales and kangaroos. The big weather disappointment came within a few kilometers of Manly, when an approaching jogger warned us off the track due to heavy flooding. The resultant detour cost us several kilometers and considerable time in making a 2+ hour walk into a 3+ hour ( and very tiring) trek. None-the-less, the Spit to Manly walk is worth the effort and the views, including colourful flora, along the way make it very rewarding for the photographer."
        }, 
        {
            "index": 403, 
            "rating": "5", 
            "review": "Spectacular Views. The harbour is accessible to all and nowhere is it more so than on this walk. Pass the boats moored at the spit, stroll through suburbia and then through light bush until you're looking out across the heads. Its even more spectacular when the weather changes - if you're brave! Don't forget your camera."
        }, 
        {
            "index": 404, 
            "rating": "5", 
            "review": "Amazing views and wildlife. From the bridge to manly wharf bar it's about 10km and you get to see the sheer beauty of Sydney's north side. Some of the small secluded beaches are spectacular. Bring lunch and take your time to enjoy them!"
        }, 
        {
            "index": 405, 
            "rating": "4", 
            "review": "A pleasant walk with good harbour views.. If you enjoy bush walking, the Spit to Manly walk is a good option when in the Sydney area and affords excellent views of the Harbour, City, and Manly. It follows the coast line from the Spit Bridge through bushland, and round a number of bays and inlets. Around 2 hours (assuming you aren't stopping too frequently). If travelling from the the city, a bus to the Spit, and the ferry back from Manly is what I'd recommend."
        }, 
        {
            "index": 406, 
            "rating": "5", 
            "review": "Worth the effort. We started at the Spit bridge and walked to Manly. Fantastic views of the natural beauty of the harbour, especially the Manly side. A long walk, with many steps, some quite steep. Some stepped areas currently under upgrade. The walk is teasing, as although Manly ferry area is in sight, the path goes well away as it follows the bay. It took us about 3 hours,as an older couple,but if you want to stop and look at all the side paths on the way, allow much longer. Make sure you walk it with enough light to finish, and when cooler but not wet, as it could be difficult on some of the steeply stepped areas. Manly is a great place to visit, with lots of places to eat after the effort."
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "Don't miss this. Whether you're an international or interstate visitor, or actually live in Sydney, this beautiful harbour side walk is a must-do. I grew up in this area and always love doing the Spit to Manly walk. The views are spectacular and while you're never very far from houses, there are parts where you really feel like you have 'escaped' the city. If you're moving at a good pace, it will take about 2 hours. Make sure you have water and sunscreen and if it's been raining, be careful as it can be a bit muddy and slippery. There are lots of cafes in Manly to grab a coffee and a bite at the end (try Cartel or Fika) and it's really easy to catch a bus back to the Spit bridge or a ferry back into the city."
        }, 
        {
            "index": 408, 
            "rating": "4", 
            "review": "good to do. the Manly walk is a nice thing to do for a morning stroll even better the Bridge do this if Your in Manly"
        }, 
        {
            "index": 409, 
            "rating": "4", 
            "review": "Beautiful escape from town. My friend and I enjoyed this little hike, lots of uphill and downhill but you can take it at your own pace. Beautiful views across Manly. Made me feel like I was on holiday - which I was"
        }, 
        {
            "index": 410, 
            "rating": "4", 
            "review": "Great views - interesting walk. You can get to this walk and back to central Sydney by public transport. The Harbour views are spectacular - the bush gives you an idea of the Sydney coast before European intervention. At the completion you can get the Manly ferry back - more wonderful harbour views."
        }, 
        {
            "index": 411, 
            "rating": "5", 
            "review": "Spectacular Sydney Harbour Coastal walk. We started our walk from the Spit Bridge which is located on the harbour side of the bridge, there is ample signage to direct you in the right direction. If in doubt just walk along the foreshore to Clontarf Beach and you will come across the bush track at the very end of the beach and once there the route is clearly marked. The walk took us about 2 hours with a few stops at spectacular vantage points to take snap shots of the views over Sydney Harbour. We were blessed to have the most glorious sunny day - there was a slight breeze and the sun sparkled on the water - the views are just magnificent and breathtaking! The walk itself I found fairly easy with well marked tracks and as it had rained a couple of day prior there were a few muddy areas yet just take your time stepping around or through the wet puddles. At the end of the walk you traverse through a park past quaint residential streets before hitting the busy Manly Wharf precinct. Once in Manly there are many established restaurants and fast food outlets at the ferry wharf together with the Manly Wharf Pub .The ferry will take you back to the city or catch a bus the city or along the jump off at The Spit Bridge to jump back into your car. I would suggest to go early morning before it gets too warm as there isn't always much shade. Do wear comfy walking shoes, wear a hat, take a camera or your mobile phone, a water bottle and a beach towel for a dip at Manly Beach. This beautiful coastal walk is a fun experience. Highly recommend it!"
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "Sydney Harbour's secret. This walk is a great way to see different aspects of our beautiful harbour. Even on a cloudy day it's magnificent. Lots of small bays and sandy beaches with clean, clear water - great for a quick dip. You walk through a beautiful red gum forest and will see some wildflowers depending on the time of year. Choose a cool day if possible, bring lunch and water, wear comfy shoes and a hat. There are a lot of 'up' stairs if you start.from The Spit end, less if you start from Manly but I would recommend starting at The Spit because you do the hardest bit first when you are fresh, and the stroll into Manly is a lovely end to the walk.and there are lots of places for a cold drink or dinner in Manly. We love to go to the Steyne Hotel which overlooks the surfing beach. I'm 61 and not super fit but apart from the stairs which I find tiring, this walk is certainly doable. We allow about 4 1/2 hours which includes stopping for lunch as well as regular stops to enjoy the views. If coming from the city, catch a bus from Carrington Street behind Wynyard and alight BEFORE The Spit bridge. It's fun to walk across it and admire the view!"
        }, 
        {
            "index": 413, 
            "rating": "5", 
            "review": "Great walk. On a clear day a great experience. Some paths a little tricky but overall a manageable walk for anybody with a reasonable level of fitness. Some excellent views over the harbour as well as out through the heads. Wide variety of scenery from suburban streets to bushland settings. Well worth the effort"
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "Beautiful coastal walk!. 10 km- not a full bush walk, but some paths can be tricky for older people. Remember to wear comfortable closed toe shoes. Running shoes are the best. No hiking boots needed, but definitely no flip flops. Dont bring too much stuff ie heavy backpack, tricky handbags, carrying phone+wallet+keys+book+etc on hand, etc. Travel light! The 10km is so worth it. Beautiful scenery. Breathtaking landscape. Worth doing. Can split the walk into two times: Spit Bridge to Manly. Then Manly to North Head for another time. Otherwise... it will take 5 hours. Spit Bridge to Manly took us about 3 hours and 45 mins, but we were with our parents. So, I think it could be done in 3 hours? Then Manly to North Head for another day of outting :)"
        }, 
        {
            "index": 415, 
            "rating": "4", 
            "review": "Northern Beaches Walk. I have done this walk three times, all starting from the Spit Bridge. It is a little difficult finding the track around Clontarf, but otherwise the route is clearly marked. Views over Sydney Harbour are magnificent, particularly on a sparkling, sunny day. The approach into Manly, with its cosmopolitan feel is superb, Once at Manly there are many activities to engage in. There is also a bus to get back to The Spit, where you may have left your car for the start of the walk."
        }, 
        {
            "index": 416, 
            "rating": "4", 
            "review": "Very nice walk. This walk is pretty long, it took us just above 3 hours to cover the distance. It is not too intense, but there are a few uphill stretches which makes it a bit challenging. The walk is very pleasant with some great views and scenery changing between beaches, hills, rocks, bushes and suburban streets."
        }, 
        {
            "index": 417, 
            "rating": "5", 
            "review": "Fantastic walk. It seems amazing such a walk which at times feels so remote and in the wilderness is interspersed with great views of Sydney Harbour. A wonderful free attraction."
        }, 
        {
            "index": 418, 
            "rating": "4", 
            "review": "Great walk. We did the 10km walk from Spit to Manly wharf. Some of the walk is similar to the one in the blue mountains with the ocean added as a bonus."
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "Do it!. We got the bus to drop us off just before the bridge and followed the drivers advice to head to the pathway. En route met a wonderful chap from the UK and enjoyed 3 hours of brilliant scenic torture. The views were stunning and we'd often feel we could \"touch\" Manly, only to find another bay ahead. We couldn't believe it when we landed in North Harbour to see. \"2km\" sign! However the exhilaration was amazing and the drink in the Manly Wien Bar afterwards was well earned.Don't come to Sydney to see only the man-made wonders. Take time, to enjoy the natural environment and you won't be disappointed."
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "Another gem on the harbour. This can be ordinary or special. If you follow the normal route it has great views etc and a pleasant walk. It doesn't matter where you start, The Spit or Manly. There is food at both ends and a bus to return you to your starting point at the end, unless you have 2 cars.The special way to do it is find out when the tide is going OUT and start at Manly and walk over the rocks which are high and dry. Then climb up at Crater Cove and join the walking track. You can do it the opposite way if you can find the track down to the cottages at Crater Cove and then down to the rocks. Its a bit more difficult to start with but worth it either way.We have done it often and never had a problem, but don't risk the tide coming in unless you start right at or just before low tide. You will be able to scramble up along the rocks but you need to know where the track is to join it.Have fun. Take shoes that may get wet and are comfortable on rocks."
        }, 
        {
            "index": 421, 
            "rating": "4", 
            "review": "You won't regret doing this. This walk has two routes - Manly to Spit Bridge (10km) and Manly to North Head (9.5km). We decided to take this route for ease of logistics.The trail itself is well marked and easy to follow - not easy to get lost unless you try really hard. You will also find that this trail is able to cater to various needs for different people - the tourists (like us), health freaks (runners, joggers, walkers etc), families & friends (catch up sessions), pet owners with their pet dogs* and even couples on dates! Having said this, it is not suitable for families with young children or strollers. You will be walking on wooden platforms, sand paths, gravel paths, steps cut out of stones, the beach, pavement and even lanes through the houses in the suburbs. Not all routes are dog-friendly, watch out for alternate routes. Also, in cases where it is high tide (makes you wonder what the actual route is like right?), there will be alternate routes for you to take to continue the walk.There at least 20 points of interest. The main attraction however would be the breath taking views you will be rewarded with. Along the way, we also discovered that Manly is home to the endangered Little Penguins and it is the only mainland breeding colony in New South Wales. Cute little \"Watch Out Penguins About\" signs are visible on the pathway. Some tips if you are planning to do this: - wear walking/sport shoes or comfortable footwear - apply plenty of sunblock as you are exposed to the sun alot (or you can wear a light long sleeve t-shirt. You'll sweat a bit more but at least the skin is protected).- bring ample of water (recommended 1 liter per person) - bring along light snacks - carry along a raincoat/poncho. Umbrella might not be suitable at certain areas. - don't forget your camera. Getting there and back: We took the bus to Spit Bridge and the ferry back to Circular Quay. You can read more of my Manly Scenic Walk experience on my blog - http://arazlin.blogspot.com.au/2014/03/manly-scenic-walk.html."
        }, 
        {
            "index": 422, 
            "rating": "5", 
            "review": "Nice views. Great overall experience and good to get out og the city and see the local areas. Great harbor views, beaches, residential area makes me want to move there."
        }, 
        {
            "index": 423, 
            "rating": "5", 
            "review": "One of the Best!. This is billed as one of the most scenic walks in the world and it lives up to its billing. We got the bus from Circular Quay to Spit Bridge about 25 minutes. Go straight ahead when you get off over the bridge and go down steps to start the walk, far safer than trying to cross the busy road. Lovely views form the outset, but they get better. The whole walk is about 10 kms and takes about 4 hours. Take plenty of water, sun screen and a hat. There are a lot of steps but it is worth it! The scenery is wonderful. We have done the walk three times now and never tire of it, gets better every time. A lovely combination of bush and coastal beach scenery."
        }, 
        {
            "index": 424, 
            "rating": "4", 
            "review": "Bush and Water. I have done this walk many times and never fail to be impressed that such a great walk exists in the middle of Sydney.At both ends (Manly and The Spit) there are a choice of transport options and cafes and restaurants. In between is a bush walk that offers magnificent harbour views and some good heart pumping ups and downs. Along the way one can take a side trip to small beaches, a lighthouse and view some aboriginal rock carvings.At the end a well deserved beer or soft drink can easily be had whilst still admiring the wonder of Sydney Harbour."
        }, 
        {
            "index": 425, 
            "rating": "5", 
            "review": "Beautiful bush walk, lovely scenery. An amazing walk to take, around 10 km of beach, bush and wonderful scenery. I enjoyed walking it in the afternoon, when it's not too hot and then have a lovely dinner in one of the many restaurants that Manly has. Easy to follow signs and they also let you know how far along you've come, not a very tough walk even though it is marked as relatively hard."
        }, 
        {
            "index": 426, 
            "rating": "5", 
            "review": "A Walk worth doing. This walk was amazing and spectacular scenery. The walk is about 10km and it is the one of the best walks I have done in Sydney so far. The walk is pretty easy to follow as there are signs all the way through. Just make sure you get a lot of water and some snacks on the way :). I really encourage you to do this walk as it does have fantastic scenery all the way."
        }, 
        {
            "index": 427, 
            "rating": "5", 
            "review": "Spectacular scenery. This is a wonderful walk of about 10 Km. Some small hills and stairs and a mild challenge but the views are spectacular across to Middle and south Head . You can head down the edge of the harbour and have a swim and a picnic or end the walk as we did at the Four Pines brewery for a cold beer and a great lunch.Well worth the effort!"
        }, 
        {
            "index": 428, 
            "rating": "5", 
            "review": "Blow away the cobwebs with this spectacular walk!. A great way to see some of the coastline around Sydney. The walk is about 11km - make a day of it as it takes you through wonderful scenery, through the trees along the cliff top and down to beaches along the way. There are lots of ups and downs but its easy walking as the route is well marked, lots of work has been done to provide steps and paths. It hugs the cliffs and gives you opportunities to break your walk with an ice cream or beer at any number of the beaches crossed along the way. Get a bus to the Spit to start your walk or park on one of the roads near the bridge - and taxi back from Manly (unless you are super energetic and want to walk back! "
        }, 
        {
            "index": 429, 
            "rating": "4", 
            "review": "Feels remote but is central. Take a bus to Spit Bridge (the drivers all know about the walk) walk across the bridge to the north side and the walk starts to the left of the bridge - you then walk under the bridge and you're off. At the end you can take the Manly ferry back to Circular Quay. We bought a day pass for all forms of public transport for $23 in a convenience store.The walk itself is great - you need a reasonable level of fitness. You'll discover flowers, plants, the Eastern Water Dragon, secret beaches. The path is well marked and sections are being sensitively restored by stone masons. You'll need 2.5 - 3 hours. Take water."
        }, 
        {
            "index": 430, 
            "rating": "5", 
            "review": "A great experience for all the family. This is one of the iconic Sydney walks - it can be done from either the Spit or from Manly - either way offer fantastic views of Sydney Harbour - along the way there are a few places to stop and have a bite to eat - including 40 Beans at North Harbour and Clonnys at Clontarf. During summer you may be lucky to strike the ice cream man at Tania Park. My tip is to do the walk early before the heat of the day - and if you are in a group or a slow walker please move out of the way for runners."
        }, 
        {
            "index": 431, 
            "rating": "5", 
            "review": "Secret beaches are not the prime attraction...There is heeps more!!. For an experience that showcases the diversity of Sydney Harbour,there is nothing to beat the Spit Bridge to Manly Walk. While gawking at the mammoth houses that line the shores of Clontarf,we were floored by the amount of secret beaches at Castle Rock reserve. Our gentle meander included smaller tracks that adjoin the main walkway.... 10 km in all. We took five hours including lunch at Reef Beach. I would suggest to bring towel,swimmers and snorkelling gear and good shoes to slip in and out of. Showers are available at all the spots. So here is the plan. Hop on a bus at Wynyard disembarking at Spit Junction and once you crossed the bridge on foot,turn right onto the trail. the walk is well-signed,with detours for those looking for of-track adventures. The terrain is varied. One minute you will be walking on cement footpath,sandy trail the next followed by rock staircases. The views that greet you towards North and South Heads are second to none. Absolutely spectacular,with wildlife spotting a certainty. At Grotto point there are aboriginal engravings giving a background to the history of this area. Once you get to Manly reward yourself with a long and cool drink or late lunch before catching the ferry back to Circular Quay. By the way,if you sit on the right-hand side of the ferry,you can see some of the coastline you have just walked along,albeit, with a different perspective of the beaches and lookouts you have just visited. Pretty neat."
        }, 
        {
            "index": 432, 
            "rating": "5", 
            "review": "10km of natural bush land and great views. I love this walk and do it a few times a year. You walk through lots of natural bush land and past some cute beaches like Forty Baskets and Clontarf, both have toilets and water. The walk is better at low tide - wear proper shoes. If starting from the Spit walk the first 2.5km may seem a little tame before reaching Clontarf then it gets a bit more rugged as you climb up over headlands (stairs provided by the national park service)."
        }, 
        {
            "index": 433, 
            "rating": "5", 
            "review": "Manley to Spit Bridge. This walk is not like Coogee to Bondi (less people and not many cafe's to stop at) .. You will experience beautiful forest, cliff edges, bush, rocks, lots of lizards and not many ppl around! Its incredible how such a huge National Park is in the middle of Sydney. There aren't that many cafe's you walk past on the treck so be sure to have some water n snacks packed just incase - there were couple toilets not the treck and lots of good signs to follow. Its a 2-3hour walk and its better to start at Spit Bridge and make your way to Manley. You can get a bus from Wynard Station to Spit then get ferry back to Circular key from Manley. Lots of small little beaches to stop off for a dip!! Great to do alone or with friends. Enjoy =)"
        }, 
        {
            "index": 434, 
            "rating": "4", 
            "review": "Fantastic walk. We live in Sydney, but I had never done this entire walk before (only some small sections). Its fantastic - I did it with my 12 and 9 year olds. It took us nearly 4.5 hours, but that's because we had lunch at Clontarf, stopped at most of the little harbour beaches for a play, and stopped to admire the scenery. Our only regret was we didn't have our swimmers with us ... having dressed in walking clothes! A dip in the water would have been refreshing as it was a really hot day.!"
        }, 
        {
            "index": 435, 
            "rating": "5", 
            "review": "Highly recommend. This is a fabulous walk, I loved every minute of it and the scenery is amazing. I caught the ferry into Manly and visited the Hello Manly visitor centre to get some information and the girls there suggested that I do the Manly to Spit or Spit to Manly walk. I caught the bus to Spit bridge (so I could end the walk in Manly) and began the walk. I swam at little beaches along the way and had an amazing time...the people on the walk were so friendly. Love love love"
        }, 
        {
            "index": 436, 
            "rating": "4", 
            "review": "Great bush walk. This was a fantastic walk, 2-3 hours, I think 10k. There are lots of spots to stop and take photos. We took the bus out to Spit bridge in the morning, just ask the bus driver to let you know when to get off, and after several small coves and beaches, some hills and stairs through the bush, you arrive in Manly, nice and hungry for lunch. Bring water, we didn't see any drinking fountains along the way. There are a few little off shoots to the trail to head out to the cliffs for nice view points, sign posts guide you along the route. We saw several quite sizeable lizards, great fun, would recommend."
        }, 
        {
            "index": 437, 
            "rating": "5", 
            "review": "My favourite walk in Sydney. An absolute must for any local or tourist. Catch a bus from the city to the Spit bridge and enjoy the 2-3 hour walk through bushland and along the coast - there are maps/signposts along the way so you shouldnt get lost. On they way you will have some fantastic views of the heads, and Manly is the perfect place to finish the walk enjoying a nice cold drink at one of the many restaurants or bars. Its easy to get back to the city with buses and a ferry option.A general level of fitness is required but the walk isnt too steep and has a clear path with steps (no bush bashing). Maybe dont wear thongs! I see alot of people in some truly terrible footwear, proper shoes will be more comfortable. Lastly, some sections cant be accessed during high tide so you will have to take the alternative route on the road."
        }, 
        {
            "index": 438, 
            "rating": "5", 
            "review": "Best walk in Sydney. If you can only do one walk in Sydney, this is the one - although Taronga to Balmoral runs a close second. This walk can be done in either direction, but Spit Bridge to Manly is best for pub and food options at the end and a ferry back to Circular Quay. The harbour and city skyline views are spectacular; the landscape changes from rainforest gullies to wildflower-strewn heathland to cliffs and beaches; wildlife runs to eastern water dragons, a variety of birds, occasionally dolphins and rarely fairy penguins.This walk is popular on weekends, so opt for a weekday if you prefer nature uninterrupted by cyclists and joggers. Take water. There's little in the way of food and drink along the way."
        }, 
        {
            "index": 439, 
            "rating": "5", 
            "review": "Great views of Sydney harbour.. A two to three hour walk on an established path around the Sydney harbour foreshore [the most beautiful harbour in the world].Take your camera for some fantastic shots."
        }, 
        {
            "index": 440, 
            "rating": "5", 
            "review": "It's just gotta be done. I've done this walk in whole and in parts and it never fails to disappoint. The views are spectacular and at times it is hard to believe that you are in the middle of Sydney. You go from the water's edge to cliff top views of Sydney Harbour and back down again. My favourite section is Reef Beach to Castle Rock Beach. That covers Crater Cove, Dobroyd Head and Castle Rock Beach. We've done that with a 6 year old, who had no problems. The paths are well maintained and well sign posted. On a sunny day, this is an unbeatable experience."
        }, 
        {
            "index": 441, 
            "rating": "5", 
            "review": "Must do. It was the highlight of our week in Sydney. The walk from the Spit hugs the coast then takes you up the cliffs for some great views of the CBD before dropping down into bustling Manly. There are a couple of spots early on in the walk to have a swim at one of the small beaches on the route.We hired kayaks at the Spit as well and paddled around the protected bays having a look at all the impressive yachts."
        }, 
        {
            "index": 442, 
            "rating": "5", 
            "review": "The walk. This is the best bushwalk in Sydney, starting from below the Spit bridge at the bottom of Seaforth, you will walk through the bush, on top of breathtaking cliff overlooking the 2 heads of the Sydney Harbour Bridge before descending towards Manly where you will be able to catch a ferry back to the CBD. Don't miss out on a great day out!"
        }, 
        {
            "index": 443, 
            "rating": "4", 
            "review": "Essential Bridge. This is certainly a great bridge, particularly for residents on the Manly peninsula. Best not to travel that way during the times that it opens to let the tall yachts etc. go in or out of there when mooring or sight seeing in that area."
        }, 
        {
            "index": 444, 
            "rating": "5", 
            "review": "Awesome. My son and I walked from Manly to the Spit and then back to Manly. It was an amazing experience. The views are exceptional. I cant wait to do it again."
        }, 
        {
            "index": 445, 
            "rating": "4", 
            "review": "Engineering, natural beauty and choices. Check out this bridge as you commence the wonderful Spit to Manly walk. Otherwise check it out before you enjoy drinks at the 16ft skiffs club. Whatever your energy levels this bridge and the waterway are great viewing."
        }, 
        {
            "index": 446, 
            "rating": "4", 
            "review": "A pretty place to wander.. Go for a walk on the sand or go fishing. Some nice places to eat though some are pricey. In peak hour it's not so good but weekends are quieter traffic wise. Still can be hard to find a car park as restaurants there are popular. Good place to start the walk to Manly."
        }, 
        {
            "index": 447, 
            "rating": "5", 
            "review": "Awesome. You really do need to be very fit for this walk. If you are, it is well worth doing. Make sure you take lots of water with you, as there is none on the track. I tend to walk from Manly, to the Spit, and then walk across the bridge, and catch a bus to the city. The views on the walk are awesome, so make sure you take your camera with you. There is a small cafe in a wall near the end of the walk, near the public toilets, behind a larger restaurant, at the spit, which does nice cheese and tomato toasted sandwiches, and hot chips. If you are in Sydney for a few days, I suggest you get the weekly day tripper pass, which costs about 3 times the daily day tripper pass price, but lasts for a week. Then you can catch buses, trains, and ferries, all using the same pass, which is most helpful if you are staying in Manly, but are going to the city most days."
        }, 
        {
            "index": 448, 
            "rating": "5", 
            "review": "Great walk !. I completed this 10Km walk with my son during a recent visit to Sydney. I really enjoyed it as It is such an interesting varied walk with great views of the harbour . A certain level of fitness is required as there are inclines, numerous steps, narrow rocky paths, and road walking involved. The scenery is really nice and there are areas to rest or have a picnic. if you remember to bring your togs, you can even go for a swim ! On the day we walked-- a Monday-- the walkway was quiet --there were few walkers and no joggers. Watch out for the wildlife-- hedgehogs, lizards and numerous birds. Manly was our destination where we had some delicious ice cream and a stroll around before taking the ferry back to Circular Quay. Brilliant day out ."
        }, 
        {
            "index": 449, 
            "rating": "5", 
            "review": "Will definitely do it again. I have a new favourite walk in Sydney. It takes around 2 hours (at a reasonable place and no stops), but not only is a great workout but some lovely scenery along the way. My only caveat would be to be careful in wet weather as it would get a little slippery in some places. You would also want to have a reasonable level of fitness to do the full walk."
        }, 
        {
            "index": 450, 
            "rating": "5", 
            "review": "Seeing more of Sydney. Based on a friend's suggestion, undertook the Spit Bridge to Manly walk on a pleasant and sunny Saturday morning. 10km walk, provides some interesting and contrasting scenery, and certainly an aerobic workout with the regular climbing of stairs along the pathway. Depending on what pace and fitness level you are, may take 2 to 3 hours to walk the path (though those fit people running it would do it in the hour). Wear some good shoes, quite a few spots where it is wet from the natural water run offs that make some areas a little slippery."
        }, 
        {
            "index": 451, 
            "rating": "4", 
            "review": "Spectacular views. All visitors to Sydney should make the effort to to cross Spit Bridge. The first sight is quite amazing and a memory to keep forever."
        }, 
        {
            "index": 452, 
            "rating": "5", 
            "review": "Spit Bridge to Manly walk. Great coastal walk, it's quite easy, at some point you need to get your feet wet to cross the beach, don't do like me and do remove your shoes :)"
        }, 
        {
            "index": 453, 
            "rating": "4", 
            "review": "Where to go if you're an engineer.. If you love bridges, you have to see the Spit Bridge in action. Traffic stops in either direction as the bridge lifts into the air to let the boats through. It's definitely a sight to see."
        }, 
        {
            "index": 454, 
            "rating": "4", 
            "review": "one of the best views in Sydney. Driving down from Mosman on to the Spit would have to be one of the best views in Sydney. It is not the main harbour, but the homes, boats and shimmering water is stunning. If you are in a hurry, avoid crossing the bridge when it opens.Avoid peak hour as there are not enough lanes on the return to Sydney journey."
        }, 
        {
            "index": 455, 
            "rating": "5", 
            "review": "Stunning Spit Bridge to Manly Coastal Walk. When the local tourist office tells you this is the most beautiful coastal walk in the world you have to be sceptical - but this must be pretty close! It takes around three hours of undulating coastal walking but it is worth it as you pass along the edge of numerous beautiful bays and beaches and have great coastal views from the clifftops. There are also several bars and restrooms along the walk so you can enjoy the walk in a degree of comfort too. This walk is well worth the effort !"
        }, 
        {
            "index": 456, 
            "rating": "5", 
            "review": "Geography unfairly favoured Sydney. Park your car on north side of Spit Bridge. The views only get better as you progress on the shore and cliff lines overlooking the Harbour. Great winter day walks with good restaurants at Manly. Afterward take the ferry to Circular Quay or the Chatswood bus back to Spit Bridge."
        }, 
        {
            "index": 457, 
            "rating": "5", 
            "review": "A tourist track that's off the tourist trail. I'm giving this 5* because I only met about 10 people, even though it's the end of November and it was a hot day. If it was busy, I wouldn't like it so much. It took me 3 hours, and perhaps I should have given myself more time to stop off and swim, for example. I saw lizards, various birds and flying fish, a few yachts and kayakers, lots of fancy houses, and a great mix of terrains. I took the bus from Manly to Spit (143/144, stance D opposite the ferry) and walked towards Manly, so it was nice and quiet in the first stage. The final bit, walking through Manly, was a bit less interesting - a wander through the suburb - but was ok because it meant a beer was near.Some bits of the path near Spit Bridge are very narrow and pretty steep."
        }, 
        {
            "index": 458, 
            "rating": "5", 
            "review": "Stunning walk that requires a little bit of effort. Allow 2-3 hrs & take sunscreen & water. Requires a reasonable level of fitness. Amazing, amazing views."
        }, 
        {
            "index": 459, 
            "rating": "5", 
            "review": "Walk the Harbour's northside.. This walk is fabulous! A short bus ride from the city takes you to the Spit bridge, then the walk takes you through local streets, national park (with Aboriginal drawings to see) and to lots of lovely little harbour beaches. We even bought an ice cream from a guy who sells them from his boat! Ending up n manly is great, for dinner and a ferry ride back to the city."
        }, 
        {
            "index": 460, 
            "rating": "4", 
            "review": "An Interesting Bridge. As you drive from Sydney to Manly you can go over the Spit Bridge. What's special about this bridge is: its age, the fact that it opens up to let boats through & as you come down the hill, on the approach to the bridge, you can see the incredible waterfront mansions & the sea of private yachts at the marina. As a child, I remember there was a special sound the road made as you drove over a certain part of the bridge & so I called it the 'Singing Bridge'. If you drive this way to Manly see if the bridge sings for you."
        }, 
        {
            "index": 461, 
            "rating": "4", 
            "review": "What's there NOT to like?. I've been over it, and under it, innumerable times, but on the way to or from somewhere else. What makes it so special is its position in the upper reaches of Middle Harbour, where yachts congregate until the bridge span opens to allow them through - to the intense annoyance and frustratrion of motoriosts travelling to/from the northern suburbs of Sydney south toward the city. One correction: it's NOT at Manly! It's either at Mosman/Balgowlah on one side, or Seaforth on the other, but it's many kilometres from Manly."
        }, 
        {
            "index": 462, 
            "rating": "5", 
            "review": "An absolute highlight - from a sydneysider. OK - not everyone loves walking. some prefer being driven around in an airless tourist bus, occasionally stopping for a photo opp. Good on them. For those who actually like to get feel, see, smell, inbibe the atmosphere of a place, this is one of the absolute highlights of a visit to Sydney. a stunning 9km/6 mile walk that you will never forget - and yes, there are more photo opportunities than you can shake a stick out. If you can't do this one, do the Rose Bay to Watson's Bay coastal walk which is easier to access by ferry and bus. Enjoy."
        }, 
        {
            "index": 463, 
            "rating": "4", 
            "review": "Great walk well sign posted. the wildflowers at the moment are breath taking. The perfect view once you get to Dobroyd is well worth it. Well sign posted and the walkway is well maintained. plenty of spots to stop for photos or pack a lunch and have a picnic on the way. "
        }, 
        {
            "index": 464, 
            "rating": "4", 
            "review": "Spit Bridge. Cross this bridge many times and even boat under it. location is beautiful the area is great stop and walk around. Lots of nice bays beaches in the area."
        }, 
        {
            "index": 465, 
            "rating": "4", 
            "review": "Great views out over the harbour. A really nice walk; I find it better to start at the Spit Bridge and finish at Manly (catch a bus from Sydney CBD and get off at the bridge).Great views of the harbour and a few interesting Aboriginal rock carvings to be seen.Be warned though, it's a 10km walk, most over fairly well maintained and even tracks."
        }, 
        {
            "index": 466, 
            "rating": "4", 
            "review": "Yatching Fun. Had the opportunity to sail through there some time ago and it was great and also had dinner for mothers day there once and it was great."
        }, 
        {
            "index": 467, 
            "rating": "4", 
            "review": "The link between the north shore and the northern beaches,,,,. A great spot for a wander on a sunny weekend. Stop and have lunch at one of the restaurants....gaze at the boats at the marina....wander along the sand and watch the sunbathers at clovelly across the water.Or...simply wait in the traffic queue for the bridge to rise up and let the boats through.....its funny how watching the boats sail under the bridge is so relaxing from the deck of the restaurant....., yet watching it from behind the wheel of your car is utter frustration....go figure...."
        }, 
        {
            "index": 468, 
            "rating": "5", 
            "review": "Fishing. We like to go fishing in some of the spots around manly bridge good for site seeing and love to watch the bridge when it opens."
        }, 
        {
            "index": 469, 
            "rating": "5", 
            "review": "Walking Trail. If you looking for a great walking trail, then try the Spit Bridge to Manly walking trail. From Sydney cross over the Spit Bridge, then walk down underneath the bridge where you will find the trail which is well sign posted. Follow to this Manly keeping the water on your right. Its about a 10km walk.Take in Manly, have lunch and then enjoy a ferry trip to circular quay. A cheap sea journey and agreat day all round.The walk is terrific and the are lots of shady gum trees and small beaches along the way if it's hot and you want a swim, or just chill out and watch whats happening on the harbour.Take some water with you and a hat."
        }, 
        {
            "index": 470, 
            "rating": "5", 
            "review": "The Manly to Spit Bridge Walk is the attraction..... Seems a few reviewers didn't realise that the Spit Bridge isnt the attraction, it is the walk to the bridge itself.If you're in the city, catch the Manly ferry over to Manly Wharf and the walk starts as you alight.Approx. 2 hours of walking along the harbour, beaches, national parks and headlands takes you to your final finishing spot - the Spit Bridge (or you could do it the other way around).Both start and finish line and scattered with bars and restaurants however, the in-between consists of views, Nature, Hiking Trails, and Secluded Beaches.A beautiful was to start your daym finished with a long lunch. It really is a must do in Manly."
        }, 
        {
            "index": 471, 
            "rating": "5", 
            "review": "The Spit Bridge of Manly. The Spit Bridge of Manly - its a fantastic structure to look at from a boat below, but when you drive over it, it just has this magnificent sweep to it BUT it is a horror drive in peak hour traffic"
        }, 
        {
            "index": 472, 
            "rating": "5", 
            "review": "Wow, amazing views!. Walked from Manly ferry terminal west along the coastal path bound for \"The Spit\" bridge. I knew Sydney was a picturesque place but was amazed at the beauty nonetheless. A longer walk than I expected taking about 3.5 hours but worth it. If you find it too long just turn around. Plenty of beaches along the way for a swim and great views. Mostly easy walking but gets rocky and more difficult on occasions. You can return to Manly on the 143 or 144 bus. There is a bus stop on the city (south) side of the bridge (bus stop is about 100 metres back from the start of the bridge). This walk is a must see in Sydney."
        }, 
        {
            "index": 473, 
            "rating": "5", 
            "review": "Spit Bridge and important link. The Spit Bridge is an important link from Manly and the Northern Beaches by raod into the Sydney Central business district. This bridge opens several times each day to allow boating craft with tall sails to pass through. The scenery around the Spit is winderful and many boats and yachts are moored there. There are several restaurants there."
        }, 
        {
            "index": 474, 
            "rating": "5", 
            "review": "Bridge opens for water traffic.. The view, the multi million dollar boats, yachts and houses. Just don't get caught if your driving at bridge opening times. Advertised on RTA website. Traffic around this area is atrocious in peak hours and weekends."
        }, 
        {
            "index": 475, 
            "rating": "4", 
            "review": "Little bit of the outer Harbour. Great place for a meal and a look at the affluent marine craft of the area."
        }, 
        {
            "index": 476, 
            "rating": "5", 
            "review": "Best walk in Sydney. The Spit Bridge to Manly coastal walk has to be one of the best walks in Sydney, taking in bush, beaches, bays and the most stunning views of the heads of the harbour. A 7km walk one way, and quite steep in places but well worth it. Park at Spit Bridge and taken the bus back from Manly and don't forget to pack swimmers for along the way."
        }, 
        {
            "index": 477, 
            "rating": "5", 
            "review": "Spit Bridge to Manly Harbour walk. Such an incredible walk. So beautiful. Easy trek, and end with a beer at the harbour before a ferry back to Circular Quay."
        }, 
        {
            "index": 478, 
            "rating": "3", 
            "review": "Part of a great walk to Manly or to Mosman - or you could sail under!. A unique bridge and great to see when it goes up ..... unless you are one of the cars who was too late to get past before it goes up. Some good sailing or boating around here and some great places to walk or play by the sandy beaches"
        }, 
        {
            "index": 479, 
            "rating": "5", 
            "review": "Spit Bridge to Manly walk. The best walk in Sydney which takes approx. 2.5 hours if you don't stop for a swim at one of the numerous beaches along the way. At the end you can enjoy a great meal at Manly to reward youself."
        }, 
        {
            "index": 480, 
            "rating": "5", 
            "review": "Fantastic walk - takes about 4 hours. I love this walk and have done it about 6 or 7 times.Mostly I have done it in the direction Manly to the Spit. Get a ferry to Manly from Circular Quay. The start of the walk is near the harbour beach beside the aquarium (not the ocean beach). It is well signposted and the views are really great. Doing it at an easy pace takes us 4 hours. When you arrive at the Spit bridge you can get a bus back to Manly (go up the steps to the road, turn right (not back over the bridge, the other way), then after about 200 metres a road goes to the left and just at that junction is where you get the bus). Takes about 10 or 15 minutes to get back to Manly. I have never made it in time for lunch, more like dinner in Manly. Then a ferry back to Sydney and that is a really great way to spend a day."
        }, 
        {
            "index": 481, 
            "rating": "5", 
            "review": "Spit bridge to manly walking trail. This is a beautiful walk but there are parts that require a fair amount of energy so I would not recommend it to older people or unfit people. The views are gorgeous and I recommend you start early in hotter weather as there are parts that do not have as much shade. Wear sunscreen and enjoy a lovely lunch at Manly at the end. You can then take the ferry back into the city if you wish."
        }, 
        {
            "index": 482, 
            "rating": "4", 
            "review": "Great for lunch. There are a few restaurants on the water near the Spit Bridge that are worth a visit. Spend a long lunch looking out over the harbour in luxury!"
        }, 
        {
            "index": 483, 
            "rating": "5", 
            "review": "Fantastic walk for those who want a view with their exercise. A fabulous walk from the Spit Bridge to Manly along the coastline. Start early - takes about 3 hrs, and finish in Manly for a fabulous seafood lunch. Have done the walk several times, best in spring or autumn when the weather is at its best."
        }, 
        {
            "index": 484, 
            "rating": "4", 
            "review": "Spit to Manly walk is wonderful.. The walk is a wonderful way to spend half a day with great views along teh way. Expensive parking"
        }, 
        {
            "index": 485, 
            "rating": "3", 
            "review": "The Spit Bridge (NOT in Manly). I don't know who put together this article - the Spit Bridge, Spit Road, Spit, is exactly 3.5 miles, or 5.6 km, from The Corso, Manly.I've walked , I've driven , I've rode a bike from The Spit to The Corso, Manly. But, don't take my word for it - try Google."
        }
    ]
}