{
    "category": "Tokyo", 
    "entity": "Chidorigafuchi", 
    "avg_rating_stars": 4.552631578947368, 
    "review_count": 114, 
    "rating_stats": {
        "poor": 1, 
        "average": 5, 
        "terrible": 1, 
        "very_good": 34, 
        "excellent": 73
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Not good season but still beautiful . I came there very late season for sakura flowers but I still saw sakura flowers. But it was wonderful and it was a nice place to go. And they have activity, which is the Pedal boats. I think must be very romantic dating over there."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "A must-see during the cherry season. This is a must-see during the Cherry blossom viewing season but is lovely anytime. Chidorigafuchi Park adjoins the 700 meter Chidorigafuchi Pedestrian Path and is home to around 260 cherry trees. NIght-time viewing is through a tunnel of magical natural presence."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Best for viewing sakura. Lined on both sides by sakura (cherry blossoms) trees that burst into bloom in late March or early April, this walk alongside a portion of the moat surrounding the Imperial Palace is sheer pleasure to behold. But be forewarned - it can be terribly crowded (though, thank goodness, the crowds are always orderly and never rowdy). Try to avoid by going very early in the morning. Cross the road at one end of the walk to go into Yasukuni Shrine, beautiful in the autumn when the gingko trees are sporting their yellow colors."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Nice views. It was very pleasent to stroll around with good views of Tokyo. Nice neighbourhood. Especially beautiful in sakura time and in autumn."
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Still great with no cherry blossom. We come as no cherry blossom to be seen.That's why it gives us a sense of peace around this area. We still do the path and boating at the end of it.For some reason there are still a lot of runners in there, it's good to look at other people excising!"
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Parque em Tokyo. Wonderful Place to visit, in Sakura's time is perfect to see you soon the beautiful flowers, as shown at this picture, near of museums, places to eat ( some convenience stores around). You can spend a morning or a part time in the day easily.Lugar lindíssimo de se visitar, principalmente na época das SAKURAs ( as cerejeiras), como mostra esta foto, próximo a museus, locais para comer rápido e barato ( lojas de conveniências). Você pode passar uma manhã ou tarde que haverá o que fazer."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Gorgeous photo ops, and it's free too. There appears to be some confusion as to what area Chidorifugashi actually refers to. Most people may associate it with the park that surrounds the Budokan stadium (actually, that's Kitanomaru Park) or perhaps the moat that surrounds it. Actually, it's the latter along with the path alongside the moat that leads to the boat rental section. The main claim to fame for this area, as many TA reviewers have noted, and as is listed in many guide books, is its abundant cherry blossom trees. During the sakura season, the place is ablaze with the beautiful trees in bloom. Unlike most of the other places in Tokyo where locals like to set up their little picnic with friends and family, a walk along the Chidorifugashi path will reveal that there aren't many places suited to this activity. Instead, it lends itself more to being a place where visitors stroll, admire the gorgeous views both across the moat and above them, and take numerous photos. However, unlike the parks, the one outstanding thing about the area is that it's completely free of charge. If time permits, come in the evening as well as the path is lit up for several hours on selected days of the year."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "Great, especially in spring and summer. In spring the old moat of the Tokyo Imperial Palace is lined in cherry blossom and is great for a trip in a row boat. In summer the moat changes completely and is covered in lotus leaves and eventually the beautiful blossom. Worth a visit for photos and memories."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "1 word - boating. I visit tokyo twice a year. Ever since i discovered in 2009 in the lake district that i was a fantastic rower, i row whenever i travel and ever since i discovered boating in chidorigafuchi in march 2013, i have never looked back. i discovered boating at Chidorigafuchi only because i was there for the sakura! The sakura at its peak surrounds the length of the moat. It makes for good viewing when one is walking along chidorigafuchi pedestrian path, but the number of visitors and the narrow nature of chidirigafuchi pedestrian path tend to hurry you along when all you really want to do is to plonk yourself on a comfortable seat to view the entire stretch of trees.I have found no such seat save for the seat on a boat. At peak season, the queue for a boat can be lengthy. An hour or so. 40 minutes. But well worth it. You book it by the hour or for half an hour. I started with only an hour in 2013 but by march 2016, i decided 2 hours would be just nice. It was.To row the length of the moat and back would take about an hour with small rests in between . The first time i did this I blistered my hands, but i was hapoy as a lark. This year with my sister in tow, i booked the boat for 2 hours. We had some food with us. I would row near the sakura... underneath its boughs which would touch the water. When you get that close to a sakura tree with just 2 or 3 boats near you, you're in for a magical time. The number of photos we took ! The quiet time we had ! And the view of the entire moat surrounded by the white of the sakura blossoms.In november 2015, the moat was bereft of rowers save for me. My friends refused to join me on the boat (three of us altogether) unless i booked for just half an hour. I did. There were no flowers to look at save for a few patches of purple flowers and a persimmon tree bearing fruits but it was enjoyable nonethless.Nearby chidorigafuchi is the Kitanomaru park - i enjoyed it trmendously in November and in March Apparently the population at the park consists almost entirely of the 'serving members and dependents of the Imperial Guard of the National Police Agency'. My second visit which took place in march 2016 coincided with the graduation ceremony of japan's largest university. Suspect it took place at nippon budokan, just next to the park. The graduation gowns, hairdos and shoes of the women were very interesting. Plenty to see at chiyoda !"
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "Good and peaceful place!. I'm so soryy we have a very bussy trip. We love the place and we will definitly retur back to Tokyo!"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "perfect pictures. This place is absolutely amazing. I know cherry blossoms are in many places but with the lake and the boats it sets the romantic tone. Pics turn out beautiful and there are no pushy vendors while you enjoy the scenery."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Sakura season. this place is near imperial and most population sakura fastival in end of mar.Some year can visit this place in everning(sakura with light up)"
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Beautiful. Such a beautiful park - I was there at the ending of Cherry Blossom season and it was great to see people having picnics under the trees. It's a little confusing to walk around as it's a huge complex of museums and parks so go with time to explore it."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Sakura at its best. We visited just before the sunset and were there when the lights weny on. It was the peak of sakura season and it was very crowded. But in spite of crowds, it was one of the best spots we visited to see cherry blossom.In the evening once lights go up it is unbelievably beautiful. Must go during the evening when the trees are lit up.There is boating available, but we didnot boat for lack of time.Near a subway station. Must see."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Beautiful sakura. The pictures do not lie! The sakura hanging over the moat are spectacular. However, it gets INCREDIBLY crowded which is exacerbated by people stopping and taking pictures. We visited both during the day and at night. At night there is a beautiful view of Tokyo tower framed by the lit-up sakura around the moat - very picturesque, which explains the 20 minute long line to take a picture!"
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "Sakura light up. Nice sakura viewing during night time! .It s my first time seeing light up sakura . A short walk from kudanshita station ,follow the crowd ,you won't get lost . The view of sakura and tokyo tower ,you have to line up to take photo. For me ,there are more nicer view under sakura trees along the pedestrian walk ."
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "Cherry Blossom Viewing at the Chidorigafuchi Park. The overhanging cherry blossoms at the Chidorigafuchi Park with the moat as the backdrop is a beautiful sight.You can view the video of this beautiful play on YouTube if you search for it under my apgclh channel."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Simply the second best cherry blossom spot in Tokyo. Following Shinjuku Gyoen, Chidorigafuchi is the best for cherry blossom in Tokyo. It looked more romantic since the cherry trees go along the beautiful river. Cherry branches sticking together above my head created an amazing view as if it had been in the ferry tale. No matter how crowed it was during cherry blossom season, you should always feel excited.When I remembered I was there, I again glimpsed. One of the best part of my trip!"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Spectacular sakura views, day or night. We stumbled upon this outstanding location to view the sakura (cherry blossoms) in full bloom. During peak dates it was pretty crowded but absolutely worth it."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Cherry blossoms 3rd of April. Long queues to get in here but they moved quickly and was very organised. Obviously because of the Cherry blossoms and it was a weekend it was very crowded but there was no chaos and everyone moved around without stress.I think we must have been lucky with the boats as the queue was not too long, must have waited around 20 mins. I think it would be worth renting a boat even out of cherry blossom season, I recommend paying more and renting for an hour. We only did 30 mins but it went really quickly and we enjoyed it more than we thought."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Cherry Blossom and Lake Fun / Chidorigafuchi Park. Yes, its crowded and difficult to take clean shots (without people) during Cherry blossom season, but a very beautiful park. You can rent a small boat and spend some hours for romance or just relaxing during your visit. Recommended to visit during spring late spring or summer. Protip: During night, all trees are lighted up, so if you go late, stay and enjoy the show."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Early morning visit, great view on Apr 5 2016. We walked from our hotel to the park. Love the view and good weather! Not a rainy day! We saw some Japanese guys have already sit under the Sakura trees to hold space for their companies event. Love the view and no charge!!"
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Interesting spot, though not a favourite in Tokyo. We visited Tokyo at the height of the cherry blossom season so Chidorigafuchi was a must. While impressive in certain areas, particularly the promenade under a canopy of cherry blossoms, we weren't blown away. Matter of taste, really. We didn't go there at night when the cherry trees are lit up, which should make for an interesting experience. The queues for the boats were daunting, and we chose to move on."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Beautiful... Visited Chidorigafuchi during the peak bloom of Cherry Blossom season. It's very crowded of course but worth fighting the crowds to see how cherry blossoms lining the moat. I visited during the late afternoon and was able to the see the sky transition from light to dark, with the lighting around the trees, it looked equally amazing both in the day and at night."
        }, 
        {
            "index": 25, 
            "rating": "4", 
            "review": "Just missed the sakura but still worth it without all the crowds. The sakura season was already over when we arrived in Tokyo. Yet it was still quite beautiful. There were only a few people in the park on a Friday afternoon. We did enjoy a very relaxing and peaceful walk along the bank. It was an excellent way to recharge ourselves before heading back to the hustle and bustle of the big city."
        }, 
        {
            "index": 26, 
            "rating": "4", 
            "review": "Spectacular Cherry Blossoms. Chidorigafuchi is a wonderful place to see the Cherry Blossoms. The beautiful trees give a wonderful view as they line the moats of the old Edo Castle. It is right beside Kudanshita Station so easy to get to on the subway"
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Amazing park. Unfortunately we were 2 weeks late for the cherry blossoms but we still had the beautiful atmosphere of Japanese parks in there. Amazing place for a walk, picnic and perfect photos!"
        }, 
        {
            "index": 28, 
            "rating": "4", 
            "review": "Beautiful gardens. Beautiful gardens and amazing quiet place in the middle of a bustling Tokyo, but unfortunately the cherry blossoms were all gone. :("
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Best Cherry Blossoms in Tokyo. Only worth a visit during the Cherry Blossoms, otherwise don't bother.But the views during the blossoms are amazing! Pros;-The scenery is amazing!-There are a couple view points, though busy...you can great photos!Cons:-Avoid weekends, where they do not allow you to stop walking to take pictures.-To ride a boat you will more likely line up for more than two hourshttps://www.youtube.com/watch?v=fhPLxnjl_6c"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Romantic boat ride. Went on a weekday and it was so crowded! But then again all the popular cherry blossom viewing spots were crowded, just something to deal with. The blossoms themselves are abundant and breathtaking and make a very picturesque view hanging over the lake. Stood in Q to rent a rowboat - was a fast moving Q so it didn't feel bad, waited maybe 30-40minutes only. We rented one for 30 minutes, about 800 yen if i'm not wrong - and my husband rowed us under the cherry blossoms . What a perfect afternoon that was and something I will cherish for a long time to come."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Breathtaking Cherry Blossoms. The trees in full bloom hanging into the water of the moat are indescribably beautiful. They are almost worth a trip to Japan.\nWe rented a rowboat and were able to take wonderful pictures from underneath the blooming trees."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Awesome Cherry Blossoms Especially at Night. Absolutely amazing cherry blossom viewing at night. The trees are lit up and the views are spectacular. Most trees are illuminated with white light but some us changing colors. It will be very crowded here during the cherry blossom season. You can rent a row boat and row on the small lake."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Truly magnificent. Amazing views of the cherry blossoms. Photos will never do these flowers justice.\nThe walk is crowded during cherry blossom time and be prepared to wait in a line for the boats. Well organized with two directional pedestrian traffic and volunteers everywhere. Do not miss this!"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "One of the best spots in Tokyo for cherry blossom viewing. We went at the end of the day into the evening so we missed the crowds as well as the boats. There were still plenty of people. We didn't see the boats in the moat of the original Edo canal. The trees were beautiful and partially lit. There were some picnickers but this was a very calm space. The only negative for us was the walk from Tokyo Station (we started by the entrance to the palace and walked clockwise) and back to the station. This must be one of the most popular running paths in Tokyo and it was disconcerting to see so many people running at us, as they were going in the counterclockwise direction. Nevertheless, people were generally very considerate."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Beast place for cherry blossom with boating experience . I have been to this place on 2nd April with friends and family. We reached chidorigafuchi by 4:30pm, it has big lines for boating. After an hour of waiting finally we get to start boating. It's really awsome experience of boating and that to in the illumination time, just Wow! Must visit place to experience cherry blossom in tokyo. Cost of boating for 30 min is 800 yen per boat max 3 persons. I suggest to go during evening time only to experience boating. For sightseeing anytime is ok. It has wonderful cherry blossom trees all around water. :)"
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Gorgeous. Although crowded during cherry blossom season, the view is unbeatable, long canal like river with cherry blossom trees on both sides and small canoe type boats drifting along, perfect picture spot, even though there was hundreds of people around me (it was a sunday-my fault) was able to snap some great pictures with no one in the background."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "What a Delight! Amazing sight!. It is indeed the best cherry blossom viewing sight. We visited twice. Evening before sunset to an hour after and then the next day along the promenade to the park"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "What a beautifull sight.. I have walked this area a few times in the past but never in spring before.I must say that with the Cherry Blossoms in full bloom it would be the most pretty sight I have seen in my life. A very busy place , thousands of people looking at the blossoms and taking photos. The trees have a real history being planted generations ago, what great foresight and now loved not only by the locals but people from all over the world.We were so lucky timing our trip just right as many come too early or too late in Spring."
        }, 
        {
            "index": 39, 
            "rating": "4", 
            "review": "Boat ride a must during Sakura season!. If it's cherry blossom season1. You'll just love the awesomeness you see around 2. You'll have the most beautiful boat rowing time of your life3. Yes, it's overcrowded obviously 4. You'll be able to make a lot of profile pics5. You'll feel relaxed for sure"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "One of the Best Spot for Cherry Blossom Viewing in Tokyo!!. This is the very popular, best spot in Tokyo for Cherry Blossom(Sakura) Viewing!! They say today(April 3) was the best day for Sakura this season here. Indeed, it was very crowded with so many locals and tourists. The boat ride under the blossom is very popular. It's close to subway Kudanshita Station and also to the Yasukuni Shrine which is also famous for Sakura. Coming from subway Kudanshita Station and walking toward subway Hanzomon Station is the standard."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Beautiful Sakura Viewing. When it comes to Sakura viewing in Tokyo there are many fine places but this area is hard to beat. It is very popular and the festival is held nearby. Really enjoyed watching the locals enjoy Sakura as much as the tourist."
        }, 
        {
            "index": 42, 
            "rating": "3", 
            "review": "Cherry blossom light up but otherwise average. We were hoping to paddle a boat out like it shown on the reviews but they were not operating at all. The walk-way to view the cherry blossom from the 'skirting' of the road is narrow and not many good angles for good photos compared to Gyeon and Ueno. However, the cherry blossom trees are lighted up as the sun sets and the feel is quite different if you could stay till then."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Good Example Of Cherry Blossums. This is a small park on the north side of the Imperial palace and overlooks the palace moat and has a large number of cherry trees that bloom in late March-early April."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Oodles of prettiness. It's not hard to understand why couples come here to boat in the moat around the palace under the cherry blossom trees. It is very pretty indeed and the boating is a nice, fun addition. Even if you are cack-handed with oars and unfit, you can make it to the far end of the boating moat, gaze lovingly into the eyes of your partner under the blossom and be back to return the boat in 30 minutes. Well, that's my experience!"
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Best spot for cherry blossom . This is the best known spot for cherry blossom so don't expect to be alone You have 5 routesThe route no 2 is the shorter one (1.9 km) from kundashita station to hanzomon stationVery nice photos to shoot"
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Cherry blossoms are so beautiful!. This is my neighborhood. It tends to be very crowded during cherry blossom season. Try to visit early in the morning when less crowded."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "One of the BEST SPOT for SAKURA hanami. Chidorigafuchi, near American Embassy in Tokyo, is one of the best spot to enjoy sakura hanami. There's a bridge over the moat and plenty of sakura tree, which makes the view at full bloom super impressive, and you can rent a small rowing boat to enjoy."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "So many cherry blossoms!. Easily one of the best places in Tokyo to see the sakura. But that's no secret. The crowds of people here during peak bloom season makes it clear that everyone knows to go here! We just walked around a bit and were able to get lovely photos of the blossoms and see the boats floating on all the petals. It's really quite something to see."
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "If you like walking or jogging, the scenery is really nice.. Walking around the motes & the grounds of the Imperial Palace are quite nice. The sidewalks are wide & if you're curious of the distance around the Imperial Palace. It's approximately 5km or just over 3 miles. There are quite a lot of joggers that you'll see. Just be careful while walking around. Various gardens & rest stop around the perimeter of the Palace. The scenery is nice & tranquil. You have on one side of the street with gardens & the Imperial Palace & the other side the city scape. Nice mixture really."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "夏祭Japanese traditional summer festival . 去年夏天剛購入一台單眼相機剛好碰到那裡的夏祭於是趁機試鏡。真希望明年還會有機會再去⋯只能說日本的夏天太浪漫像一場戀愛。in Japan the summer is always romantic just like a love."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Sakura Sakura. One of the best places for Sakura viewing in Tokyo. The lake, Sakura, gentle breeze or the moonlight....you'll discover this place as out of the world."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Amazing during Hanimai (Cherry Blossoms). We really only went here for a boat ride under the blossoms but the day we arrived looking to rent one but were told it was too windy. This may have been a translation issue because I didn't see any wind (but there were no boats out either). We'd been traveling north through the country as the blossom wave swept Japan so we had already been seeing cherry blossoms for 2 weeks by this point but I was still so amazed to arrive at this location with hundreds of trees in full bloom along with the water feature. Breath taking truly. Probably my my memorable cherry bloom spot of the trip but some of that is timing as 3 days later this would have been nice but not as amazing ect. One thing to note it was CROWDED... I know this is Tokyo but this was 5 people inside my personal space at any time crowded all along the path ways and as people stopped for pictures you were at a standstill. There is one iconic shot and there were literally 20 people deep snapping dslrs above their heads trying to get it. So other people agree at the awesomeness and keep that in mind.We came back that night to see the illumination and again that was amazing (I prefer the day though) but it was nice to see both. The Indian consulate across the road was having a bended festival with cherry blossoms which was neat and we got some dinner there and listened to some Indian musicians while watching the crowds and lit up blossoms across the street. One thing to note, we got off at the wrong station for this park and the Japanese people didn't seem to know the name of this area. Even when I showed them the Kanji form of \"Chiforigafuchi\" on my phone but they did know the area as water, boats and cherry blossoms so I'm not sure what the locals refer to this spot."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Lovely, social park. A beautiful park especially during summer with the standard background noise of cicadas. Worth going on one of the boats if you have time especially if with your significant other."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "A Sakura (cherry blossoms) Walk. April is the season of cherry blossoms in Tokyo, and there are a number of spots for viewing the sakura (cherry blossoms) in their full bloom. Kudanshita (Chidori-ga-fuchi) is one of the best spots to go for a hanami (sakura viewing) walk around the moat. When we went for sakura hanami (as it’s known in Japanese), there was a festival going on at the Indian Embassy located close to the sakura pathway. There are sakura trees lined up on the sides of the pathway, and many people like to come here for a walk as they can also enjoy sakura at the same time.Unlike Tokyo’s Ueno Park or Asakusa, Kudanshita does not really have much space to sit down and have a ‘hanami party’, but Kudanshita’s sakura is definitely worth a visit if you don’t mind a little walk for 1-2 hours.Yasukuni Shrine- one of Japan’s most famous and controversial shrines, is also quite close from here. The closest train station is Kudanshita on Hanzomon Line.If you're in Tokyo around cherry blossom time, this spot is worth a visit."
        }, 
        {
            "index": 55, 
            "rating": "3", 
            "review": "Beautiful during Sakura season, nothing special during other times.. Most of the photos depict this place during Hanami (Japanese cherry blossom viewing season) which usually is around end or March/beginning of April - actual dates vary every year.While words cannot do the place justice during this time, it's also important to note that it's super busy: the rowing boats have people waiting in lines for hours and the park areas are covered in blue tarp as local office workers enjoy their drinking sessions. Regardless, definitely worth a visit during this time.BUT, at other times? It's good for a stroll in the greenery, but nothing to write home about."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "So touching in Sakura season. Best in early spring for Sakura watching, good both in day time and evening time. Sakura reflection to the water gives an impressive scenery, one of the must visit places in Tokyo."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Perfect place for night cherry blossom!. The place is easy to goby Tokyo metro. Visited the place at night for the night cherry blossom.The light would be turned on since 18:00 at cherry blossom festival. Definitely a must see in Tokyo!!"
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "Very Beautiful during Cherry Blossom. We went when sakura season was little bit waning.But the beauty of the place and crowds were abundant. We had to follow a queue of well and formally dressed youngsters attending some formal function there but could not find the details of the function because of language barrier.Anyway a stroll with a macha flavoured ice cream in hand is fantastic and of course lot many photo ops.The boats floating in the river add to the beauty of the place .Indian high commission had put on Indian food stalls to our delight. By the way Indian High commission overlooks the place.We went back again at night for cherry blossom viewing while illuminated. They look stunning when illuminated.The place was covered by falling white petals all over and looked like a carpet."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Nice Gardens. Nice Gardens.. This place is right opposite the Yasukuni Shrine. The place would be really beautiful during Cherry Blossom season, which I missed by a couple of days. I was here in late april and could spot only last few cherry blossom trees."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Cherry Blossom at Chidorigafuchi. I love rowing a boat at Chidorigafuchi. I and my four friends went to there in April. It was last couple of days of cherry blossom season. We waited around one and half hour to rent the boats but it was worth it. About half hour, we row under the trees and leaves were falling. It was one of the most memorable time of my Tokyo visit."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Cherry blossom heaven,. It's the best spot to see cherry blossoms in to Tokyo, maybe even Japan! Tree are on the both sides of the river which was full of small colorful boats, beautiful! It's also lit at night, not to be missed. Take a taxi there and back. We walked the first time for night viewing took us at least two hours from the Imperial Palace, we almost gave up. It not very close to the train, but walkable - still you can do it in one direction only if you don't want backtrack."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "Sanctuary. A nice quiet place to get away from the hustle and bustle of Tokyo. The park is a bit off the beaten path, but a good place to seek some sanctuary."
        }, 
        {
            "index": 63, 
            "rating": "4", 
            "review": "No Cherry Blossom, but still a beautiful green oasis amidst Tokyo's skyline. Just a simply wonderful place to walk, breathe, view and relax. Joggers and cyclists share the same route around the Imperial Palace and so beware of who's coming up behind you if you change direction!"
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "A must go hanami spot in Tokyo for sakura !!!. This is a must go hanami spot for Sakura during your visit to Tokyo! Easy to reach by subway! Just get yourself to Kudanshita station (S05, Z06,T07) and you reach your destination ;) There were full of sakura trees along the river and a huge park for leisure, picnic etc. Furthermore, you can take a boat ride! I was there for morning and night session because I wanna view the night Sakura as well ;) You will be able to see Tokyo Tower from the bridge. Truly beautiful and worthwhile to visit! Remember to bring your memory card and extra battery for your camera ;)"
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Greenery in the city centre. Wonderful for walks day and night. Both quiet and active areas. Especially beautiful in the spring, not just the cherry blossoms, but the new greenery as the trees bud with leaves. Some wildlife also can be seen (birds and fish). Peaceful cenotaph dedicated to Japan's war dead also of interest."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Trees were not in blossom by May 12. The cherry trees were no longer blossom by mid May. However, the park was absolutely beautiful. It has just a small walking area where a lot of taxi drivers rest during the afternoon. You will see them with their taxi signs on off. Has clean restrooms."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Beautiful Cherry Blossoms. I checked up well in advance when the Chiyoda Cherry Blossom Festival was held in the past. It was held for one week from the last weekend of March, or it always included this particular week, depending on the time when cherry blossoms were in full bloom. So I booked a hotel and bought an air ticket 6 months before.  The weather was very cold during the last week of March. But all of a sudden it warmed up and it was announced that the cherry blossoms were in full bloom in Tokyo on Sunday 29th March -the day I arrived in Tokyo! My Japanese friend told me to go early in the morning to avoid the crowd of people. The direction given on the website suggested to go from Hanzomon Station rather than Kudanshita Station. So my 85-year old friend and I arrived at Hazomon Station at around 9:30am and followed the signs to Chidorigafuchi. We joined a few people going upwards on the footpath along the moat side of Chidorigafuchi. We took time to enjoy the cherry blossoms, especially on the other side (i.e.,, Kitanomaru Park) of the moat. But we began to notice that more and more people from Kudanshita Station were coming down along the moat side of the path. So we gave up going against the stream of people and walked on the path that was away from the moat. But occasionally I cut through the stream of people to go near the fence of the moat in order to take photos.  Finally we reached the end of Chidorigafuchi and went across to the side gate of Yasukuni Shrine. As we were so exhausted, we caught a taxi and returned to Ikebukuro. The taxi driver was delighted to have passengers who wanted to go a 'long distance', not a nearby train station. We enjoyed seeing cherry blossoms along the way. Taxi fare was a bit over 3,000yen."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "It is superb during the cherry blossom. We visited Tokyo at the beginning of April and the Sakura (cherry blossom) was at its end. we had, however, enjoyed the walk and could spot some trees still pinkish. It should have been breathtaking during the full blossoming period. It is a must visit during the cherry blossom. Without the Sakura, it could worth a visit only if you have some hours to kill and don't have any other option available."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Beautiful and Romantic during Sakura. When the blossoms are out, its beautiful and romantic. There are lots of people and cameras and the queue for the boats is very long. Despite this its like a dream, clouds of sakura everywhere. Its amazing. When the sun is out its so enjoyable but will still need a jacket because along the walk many parts are shaded."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Hands down best place for hanami. Clouds of cherry blossom trees gave this place an absolutley magical feeling. \"in that moment everything was infinite\". Very romantic, would have been great for dates - and proposals! Absolutely breathtaking!!! A must see."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Breathtaking during Cherry Blossom Season. (a bit late for 2015, but perhaps useful for future readers) Tips for cherry blossom viewing :Tip 1 - enter the park via Kudanshita station. The best views are along the moat. Walk southwards, and then cut into the park for a different feel (i.e view the trees from higher ground). Tip 2 - go early (before 10am). It gets really crowded by mid day, but luckily the crowds were generally pretty civilised.Tip 3 - estimate 2 - 3 hours to complete the viewing session.I visited 4 sakura viewing spot during my recent visit - Chidorigafuchi, Naka Meguro, Shinjuku Koen, Takiyama (outskirt of Tokyo). Each site provide a different experience, but I would give this the top vote."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "THE MOST BEAUTIFUL THING BENEATH CHERRY BLOSSOM. This divine beauty of cherry blossom cant be described! just go there and enjoy.Life under sakura <3 This is scenic, spectacular, amazing and simply one of the best spot for cherry blossom. Enjoy"
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Chidori Gafuchi in Tokyo. Chidori Gafuchi is a very beautiful and romantic place to see Cheery Blossom in Tokyo from late March to early April. You should also go see the view in the evening, they normally turn on the light from 6pm to 10 pm. It is one of the most beautiful view that I have seen in the evening. There are lots of the branches that you can reach by hand, hence, you can take a very beautiful close up pictures as well. If you have time, you can rent a boat to view the Cherry Blossom under their branch on the other side of the water channel."
        }, 
        {
            "index": 74, 
            "rating": "1", 
            "review": "Sad experience......boat man pushed our boat down and not out into the water.. Expecting to spend a lovely day boating on the cherry blossomed moat, our trip was pure hell. Our boat man, obviously anti american/tourist, went after getting us into the boat, pushed down on the side of the boat, and not pushing out on the boat. Causing the three of us to tilt toward his push and tumble into the filthy 400 year old water.They helped us out of the water, and that was it, no towel to dry off, no apology, nothing. Soaking wet, we were left on our own to struggle to get back to our hotel, no cab would take us, people were staring at us. Humiliating.The worst part.....camera, telephones, clothes, shoes, bags, etc all ruined in the nasty water.It is taking a fight for them to acknowledge their responsibility in this incident. They want pictures of the clothes, pictures of us.......their people saw the whole thing. We have to prove what happened to us on their property. It has been an unpleasant expeirence to get any compensation from these people. They do not accept any responsiility, I would think twice before wasting money on this"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "amazing scenery!. such a nice spot during Sakura season, heaps of Cherry Blossoms lined the water! you can hire boats, but beware the line can get long - we lined up for 1 hour and eventually the boats were closed as it was too windy for them - so if its a windy day don't be surprised if the boats are not operating,.otherwise it is still a lovely area to walk around and view the Sakura"
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "A must see during the Sakura. This is a lovely area to take a walk in when the cherry blossoms are blooming. Make sure you take a camera."
        }, 
        {
            "index": 77, 
            "rating": "4", 
            "review": "Beautiful blossoms. The blossoms are beautiful but the gyoen park offers more variety and more different views. The best views are actually at both entrances of the park where you can see the combination of blossoms and the boats. The walk through the park does not add much to that"
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Cinematic. Now I know why Chidorigafuchi is very popular in Tokyo during spring. It has a cinematic feel that could transport one to another dimension in a very limited time. The cherry blossoms are gorgeous and if you are patient enough you can rent a boat to cruise along the river. Be aware of the crowd though. Lots of people want to have a glimpse of the blossoms. To photographers, you can bring your tripod but it's difficult to set it up since you also have to understand that other visitors want to get a photo or two for souvenirs too. You cannot stay in a certain sport for so long. Also, during the light-up, the place turns magical. As for the food, lots are available at Yasukine Shrine, just a few steps away from Chidoragafuchi"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Simply Stunning. Afrer a long walk through the city, this view is just breathtaking. The cherry blossoms were in full bloom and it looked like a postcard. It was less crowded than I expected."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "Beautiful stroll - with or without the cherry blossoms. Chidorigafuchi is one of the many wonderful strolls around the royal palace. It's obviously most popular during the cherry blossom season - and packed on those days, but that adds to the experience. This is a nice stroll which meanders along a moat with beautiful greenery and row boats strolling themselves up and down the water. The walk along the moat ends with a little playground which makes it particularly nice for families with young kids. By the way, this is very close to the Yasukini Shrine - so a lovely experience all around, with no pressure other than to stroll and enjoy the view. A nice, lovely stroll."
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "It's a very beautiful place.. When I take a walk on the day which cleared up here, it's a very pleasant place. When spring comes, a flower of a cherry tree blooms and is beautifulness."
        }, 
        {
            "index": 82, 
            "rating": "3", 
            "review": "good only during cherry blossom season. Understand from our reviewers that this is one of the popular cherry blossom viewing spots in Japan and supposed to be the best one in Tokyo. Do note that if you visit in other months, like my case in Nov'14, it is just look like a very ordinary park. Thus, only can give it a average rating."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "A charming hanami spot!. There's no arguing hanami in itself is a great experience regardless of the hanami spot, but Chidorigafuchi offers a more special flavor to the activity.A certain portion a few minutes away from Kudanshita station offers a view of the moat, peppered with sakura blooming on its sides and a perfect view of the Tokyo Tower right behind. During peak hanami days, photographers gather on that spot particularly waiting for the illumination of the Tokyo Tower. The moat also has boats for two - presumably a paid feature for lovers."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "One Of The Best Sakura Viewing Spots In Tokyo. I've seen a lot of popular cherry blossom viewing spots in Japan and while Chidgorigafuchi might not be the best, it's certainly the best one I've seen in Tokyo!It's extremely crowded and you might need a lot of time if you want to take a boat ride, but if you just want to enjoy the sight, it's not going to be a problem.I went there when the blossoms already started falling down, so many pink petals were floating in the moat. Such a beautiful sight I'll never forget!"
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "Last View of Cherry Blossom. A pretty area where we were able to see the last of the cherry blossoms on the edge of The Imperial Palace which happened to be closed for Obama's visit. Having parks in Tokyo make the city seem so much more serene and provide a great break from the hustle and bustle ."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Perfect for hanami, forget the other locations. Avoid the Imperial Palace like the plague, Shinjuku Gyoen too, and come here! There are varieties of cherry blossom in bloom with a 45-1h walking trail planted around the 'garden', where you will pass by the other parks in the area as well as Budokan. There is also the actual/'tourist' strip of this area but you can skip that and walk from Google Map's co-ordinates to escape the crowd.And the lake boats to go up close to the Sakura in the moat - a must!"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "ICHIBAN #1 Hanami Cherry Blossom Site in Tokyo. Breathtaking & easily hands down the BEST SITE to see Cherry Blossoms in Tokyo. We made a list of the top 10 Cherry Blossom viewing sites in Tokyo. Also saw pictures before we embarked on our vacation to determine the value of our efforts. We got MORE than we expected here! Immediately upon exiting the top of the stairs at Tokyo Metro Tozai line-Kudanshita station...we gasped at the sheer beauty & loveliness of the Cherry Blossoms surrounding the moat of the Imperial Palace. The memories of that first glance will last a lifetime! It is the combination of the water, the cherry blossom trees lining both sides of the moat, the boaters enjoying a tender romantic experience as the rest of us envy them their private time, the hanami viewers young and old, holding hands...everyone drinking in the fresh air, walking along the sidewalk overlooking the moat. Its just wonderful! Make the time to go here....if you have time for only 1 place to view the Tokyo Cherry Blossoms!"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "ask a local before you go. This place was recommended to us by the concierge at the Imperial Hotel. Thousands of cherry trees in bloom, lining a lake. Breathtaking, even in the rain. Take note that cherry blossom-viewing is a fleeting thing, that can last for only a few days before they all fall down. Ask a local which particular park is in full bloom. But if you happen to be in Tokyo at the right time, THIS is the most dramatic spot. It's worth the wait for your taxi afterward."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "amazing night view of sakura. sakura night view was amazing! recommended to exit from Kudanshita metro station and walk along the moat till the end and take the hanzomon train station to your next destination. no eateries close by except for tony roma's and there was a queue so it would be better to go with a full stomach"
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Best to see in late March to early April.. Great place to take a walk. When I go here, it makes me feel like I left the city even though I am in the directly in the middle of it. The park is really huge. The sights are really beautiful during cherry blossom season (end of March to early April) so I suggest to visit here then. Other seasons the park is much less interesting but still a place I would frequent to take a walk."
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "splendid spot for sakura. suddenly found this spot on my way in the very sakura season, how luck I am!The blossom was so beautiful,and there\nare also a lot of branch into the air.the fallen petals spread in the\nriver,colored the quiet river into spring."
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Go during the right season. It's pretty pointless to come here when the cherry blossoms aren't in bloom. We came in November, so there was nothing to see. A decent place to stop by if you're going to be in the area anyway. Nice for an evening stroll. Going by the photos, it should be a lovely place when the cherry blossoms are blooming."
        }, 
        {
            "index": 93, 
            "rating": "3", 
            "review": "Nice during cherry blossom season, a bit less the rest of the days. If you are a newcomer to Tokyo, you may be appealed by a boat ride on the Imperial Palace moat in Chidorigafuchi. If you are not, you know that there are better things to see and do in Tokyo. The season climax for this place is in late March / early April during the cherry blossom season when the trees become pink-white flower clouds touching the water and giving the place a special atmosphere. Unfortunately this is also the most crowdy period of course, which makes the whole thing much less romantic... The rest of the year it is still nice, however you should not expect anything so special."
        }, 
        {
            "index": 94, 
            "rating": "2", 
            "review": "Very Disappointing. From the pictures and reviews, I really expected this place to be quite picturesque. I was looking forward to a pleasant canoe ride near the walls of the castle. However, I was extremely disappointed when I actually got there. I walked around the river and realized there is really not much here except a tiny park, and limited views of a corner of the palace gates and a few buildings in the distance. Unfortunately, the area with the boats was fairly far from the gates and was totally shut down when I was there. Maybe it might be prettier during cherry blossom season, but that was not my expectation (as I came in august) and still thought this attraction fell short."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "green area,but no pink trees!. I was so excited to visit this place. When I reached there it took me some time to realize that leaves turn pink during certain seasons. but the greenery was good there. a small lake and clean environment. there was an in hall concert that day."
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "garden and peace. on a crowded city this is a peaceful green oasis, full of activity and people walking, biking, all full of respect for others and courtesy"
        }, 
        {
            "index": 97, 
            "rating": "4", 
            "review": "Lovely. We were at the imperial palace but not during Cherry Blossom time. Which I hear is breathtaking. I still think the (moat) around the Imperial Palace is still impressive. But if you can go during Cherry Blossom time!"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Beautiful cherry blossoms on the river (moat). I'm just repeating other reviewer's comments but this is a beautiful spot to see cherry blossoms.I stumbled upon it purely by chance and what a piece of luck that was. The best part is looking down onto the moat, with people rowing boats, laughing and having fun, with the cherry tree blossom in full bloom on both sides of the water acting both as a frame and as a veil. Beautiful."
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "Close to Tokyo Station, a large park in the Japanese style.. It is a pond of an artificial which surrounds the Imperial Palace that is a house of the Emperor.Once upon a time, because it was the Imperial Palace Castle, it was built to defend from the enemy.It is worth visiting as much as New York's Central Park."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Perfect to Hanami viewing. Our first day in Tokyo, we went here to look at the Cherry Blossoms. Hanami viewing is the Japanese term. White and pink cherry blossoms. The sidewalk was full as the season was in full bloom. And as a breeze blows by, you would be showered with cherry blossom petals. We brought plastic mats and sat by the park for a quiet afternoon."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Cherry blossoms paradise. walking and looking at the cherry blossoms and happy people at cherry blossom party at evening was wonderful."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Very Beautiful. To watch the cherry blossoms is really fantastic. It is better you wear a sport shoe to walk for few hours in this exceptional place. Bring your food as well as a mat or something to put on the ground if you like to sit and enjoy the nature while taking a rest and eating a refreshment."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Must is sakura season!. You cannot miss sakura here if you are in Tokyo in the season.\nYou may be fed up with tons of ppl, but worth to see beautiful sakura. Just amazing."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Best Hamani Spot in Tokyo. The title says it all. It's the best cherry blossom spot in Tokyo, possibly in all Japan. Night hanami is excellent too."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "Great during Cherry Blossom Season. This is one of THE places to see the famous cherry blossoms if you happen to be in Tokyo during early April. It is across the street from the Yasakuni Shrine, which is another of the great places to see the blooms so I usually go here every year.Basically it is a remnant of the old moat that protected Edo Castle. Only the gate remains but it is impressive none the less.In the off season it is a local dog walking venue, but still a nice bit of green in an otherwise rather bleak urban environment."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Cherry blossoms galore!. During the day, the street is wonderful but at night it becomes pure magic with the trees on the street and across the moat lit up. Hanami happens day and night."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "world champion ohanami. outside our window, chidorigafuchi cherry blossom WOW"
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Best Sakura viewing!!!. We swung by here multiple times during our April visit in Tokyo and each day was amazing. We went right as the blossomes hit 100% blossoming and it was one the most impressive viewing we'd experienced on our 10 day stay in Tokyo. The gtree's were very full, in the background you could see the moat and little boats. We were there at sunset one day and they had lights on the trees so you could appreciate their beauty as the day came to a close. Also, they had two festivals in the area, one hosted by the Indian emabassy on the edge of the park, we skipped this one. The other festival was a local street festival across the streen from the park, there were dozenns of food vendors selling fish, octopus balls, yakisoba, etc. It was an amazing festival, they had picnic tables out and tarps on the ground. The best Japan experience we had during our entire stay."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Awesome sakura view with boat rowing. it's one of the best places for enjoying sakura, the pathway was fulled of sakura trees and the view of the riverside full of sakura was just superb, best for those who wants to row boat in the river to enjoy the sakura view"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Best Sakura Spot in Tokyo. This is the best Sakura Spot in Tokyo. Check out the season. (Usually late March to early April).When season is right, it is so beautiful! At the same time, there are a lot of poeple to come & watch these beaufiful sakura.Go to Kudanshita subway station and get out of exit 2 and walk towards Budo-kan.There is boat available, and you need to prepare to wait for a long queue if it is weekend."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Great cherry blossom street. April 1 - 6, 2012 perfect time for the blossoms? Lovely walk along the moat. Trees lit up a night...very special effect."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Cherry blossoms!. A \"must see\" in April.. the cherry blossoms are beautiful, both during the day and night."
        }, 
        {
            "index": 113, 
            "rating": "3", 
            "review": "The winter is not the best time to see Chidorigafuchi. I can only imagine how beautiful the walk to the cemetery and the surrounding gardens would have been had the cherry trees been blossoming when we visited. However, we were in Tokyo in December, and so the long walk under hibernating trees was...just a long walk (I imagine had we visited with the cherry blossoms I would have rated it five stars, so take that into consideration). It's so strange to me now that I'm going back to write individual reviews that my reviews are so low--we had a wonderful time in Tokyo and I'm not sure the three star ratings reflect this. I think the reason many of my Chiyoda reviews are only average is that Tokyo, while a fabulous city, has not done much to make itself a capitol city that is appealing to tourists (talking strictly about the government offices, monuments, etc. and not about the rest of what Tokyo has to offer). When you are in Washington DC, everything is grand (contrasting to the modest size of Japanese monuments) and nearly everyone you see is obviously a tourist--Washington DC as has made the nation's capitol a city worth seeing strictly for the government sites--this is not the case for Tokyo if that makes more sense. My husband and I felt like the only tourists we saw all day. For example, once we arrived at the National Cemetery, we were literally the only two people there, tourists or not; granted we were there during the off season and not that this is a bad thing. If you're expecting the grandness of the US' war memorials (thinking Korean War Veterans Memorial, Vietnam Veterans War Memorial Wall, Arlington National Cemetery), you will be disappointed by this cemetery--though it's important to reflect on what these differences might say about each nation, its unique values, how we are alike, how we are different. Though this memorial honors 3 MILLION lost souls, it is very small with only one small gazebo housing one symbolic coffin (that I believe contains remains of unidentified casualties). Very little is explained in English, which is fine but does limit one's understanding of the memorial if you don't bring your own guide book or do your own research prior to your visit. A very touching point here is that for 100 yen you can buy a flower (on the honor system) and lay it at the tomb. The restrooms are Japanese style."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Amazing tunnels of seamless cherry blossoms. I had read the Japanese reviews and I did not know what the fuss was all about. Passing this seemingly endless tunnel of Sakura trees one Spring on a midnight taxi was amazing. It touched me deeply and I asked the driver to stop the car. Walking under those trees, I almost wept for a while. Foreign visitors, if you happen to be in Tokyo at the time of cherry blossoms, you should come here around midnight for an unforgettable view that you shall cherish for your lifetime."
        }
    ]
}