{
    "category": "Tokyo", 
    "entity": "Samurai-Museum", 
    "avg_rating_stars": 4.609523809523809, 
    "review_count": 420, 
    "rating_stats": {
        "poor": 6, 
        "average": 17, 
        "terrible": 1, 
        "very_good": 108, 
        "excellent": 288
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "A must if you are interested in Samurai. The exhibits are well presented and in fantastic shape. The tour they gave (included in the ticket) was very interesting and helpful. The opportunity to wear a samurai armour was also a great idea. Our kids loved it as well. More interactive than expected and despite the slightly dodgy neighbourhood a must for anyone interested in Samurai history and culture. arigato gozaimasu!"
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "History. Small museum but enough knwoledge for us to know about samurai. Ticket is included English guided tour, wearing samurai suits for taking pictures, how to use sword, samurai show. Two hours is ok for this museum. I give it 5 stars."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Great little museum. We had trouble finding this museum but lovely locals helped us out and really glad they did. Excellent value for money with a free guide who explains all the history etc and then at the end you get a free demonstration from an actor and can have a go if you want."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Wonderful insight into a bygone era. What a find and a great recommendation from our Hotel concierge! But at over Yen 5,000 for two adults and a child it was not cheap. The guided tour was well worth the time to learn more about Jane samurai, and helped put some of the pieces of japanese history and cult ire that we'd picked up along the way. We even learned the difference between a samurai and a ninja!Do it!"
        }, 
        {
            "index": 5, 
            "rating": "3", 
            "review": "Pricey for what you get. My husband wanted to visit this museum as he's interested in samurai. We had some trouble finding it (the map on the website is deceptively simple), and were a bit surprised at the expensive entry fee (¥1,800 per person). There aren't many exhibits, but there is a demonstration of how the samurai sword is used in attack and defense. The demonstration is probably the best part of the visit; the exhibits aren't extensive at all, and frankly a bit disappointing. Visit it if you don't mind paying that much to enter, but if you'd rather save the money, I think there are other museums that will be more worthwhile visiting in Tokyo."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Well worth a visit!. The Samurai Museum was an unexpectedly interesting and enjoyable experience. We had an excellent tour guide who was very knowledgeable and spoke excellent English. The museum was very well done with a lot of fascinating artifacts and displays, as well as a chance to try on some samurai gear."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Nathan. Well worth a visit. Excellent personal guide around the museum, all in English. Gives a real insight into the Samurai period and left us wanting to learn more. Great picture opportunity at the end free of charge where you can dress up as a Samurai and in a kimono. The owner gave my girlfriend a present at the end, which was a really nice touch. Highly recommended"
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "For those who love Samurai. You will explore samurai world here :) and all samurai suit from long period of time which are original oneAll staff here speak English influently and they guide us all about samurai historyThere was samurai show available but need to check timing (probably two times a day)You can also try samurai suit and take photo for free! for lady there was kimono available"
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Nestled in the weird part of Shinjuku is this Diamond of a Museum. Found this museum as a happy coincidence while walking through Shinjuku. It really is a contrast located in the nightlife Host/Hostess bar area, however truly is an amazing place.The entrance fee is 1800 yen which may seem steep. But the staff provide an amazing tour, and during the day they have certain experiences like a swordsmanship display.The museum has a number of original armours on display from the Edo Period. For example Shibata family armour, Oda Nobunaga armour etc. They also have a number of weapons like Musashi Miyamoto's actual sword.The staff are amazingly friendly and very knowledgeable of the exhibits, the tour takes up to an hour but is very informative. They also have a store selling a number of different items including replica swords and also real sword starting from 3000USDIf you have any interest in Japanese Edo History I highly recommend visiting this museum!"
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Impressive collection. Even though a small museum, one could easily spend 2-3 hours in there. The collection is quite impressive & well displayed, it's enough to illustrate history of the fighting class, the samurai spirit. Go early when it's less busy, & you'll get better attention with the guide, museum opens at 10:30am."
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "Great place to look into history. Very educational! Guide is very friendly and kind and spoke good english. We had the chance to wear the samurai helmet. Great expirience!"
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Samurai museum. Samurai museum sell swords and related things. Sods are about $200 Australian . But the Museum has genuine armour worn by ancient war lords. There is a guided tour. It opens at 11 am"
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Don't miss it !. I did not expect much but was really fascinated and impressed from the first moment I entered: the team of the museum really tries to welcome everyone personally and invited anyone to join one of the guided tours, all in English. Small groups are guided to each display section where guides explain the use and the history of the different items, mostly samurai armour and weapons of the different time periods. They even allow guests to try replicas helmets and face masks and invite them to take photos. Amazing !Don't miss the live action martial arts show when a master swordsman and actor shows off his skill with a real Samurai sword."
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "Great place to learn a bit of Samurai history. Shinjuku is a place with a lot of great shopping and restaurants. Tucked in a little street is a small museum that tourists could take a break from all the hustle and bustle, and spend a couple of hours learning a bit of Samurai history. The place is not huge, but there are Samurai armours and weapons. The ticket price includes a guided tour and demonstration. There's also a chance for the visitor to try on a headless and take pictures with it. My daughter did just that and she said the headress was very heavy. It was an enjoyable learning experience."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "Worth a visit. The location is a bit out of the way in a rather sleazy part of Shinjuku. However the museum is worth seeing with a guide to explain some of the history. Yet it is rather small and expensive for a short visit. I would have liked more historical data."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Great museum. We visited this as my husband was interested in Samurai history. It was a little expensive to enter, however the staff guided us through the museum explaining the exhibits and the history behind them. We were also able to try one the armour and this really made you appreciate both the weight but also the flexibility of them. Great range of examples and in excellent condition. The afternoon demonstration was good and demonstrated the art behind the movements. You can also have a go too. Well worth the visit."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Brilliant . Just finished the show and tour. Loved it, the demonstration at the start was good then we had a lovely guide show us around who spoke good English and seemed to know what he was talking about. Very informative plus we then got to try on different outfits and have pictures. Some people in their reviews moan about the price but you get what you pay for and I enjoyed it. Will recommend to friends. Cheers"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Amazing look into the Samurai History!!. I read good reviews on Trip Advisor so I had to check it out. It was as awesome as mentioned! Amazing armor battle suits, great demo and through history with very knowledgable staff! Such a cool part of Japanese history!!! Hight recommend it if you have two hours! Top notch!"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Best museum in Tokyo . Definitely worth paying a visit, great museum, with live demonstration of Samurai art with swords.Guided visit is included in ticket price!"
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "What a great way to spend a couple of hours!!!. Visiting the Samurai Museum was one of the highlights of our visit to Tokyo.It is not vast but is well designed. The multilingual staff were delightful and provided our group of four with an educational tour. The armor are well curated and all displays beautifully lit. We were given the opportunity to dress up in traditional costumes - which provided us with great photo opportunities!!!We joined a larger group for a demonstration of samurai techniques by an experienced samurai actor - his serious demeanor quietened the crowd and we were all transported by his skillful performance. Small gift shop. Would not hesitate to recommend."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Excellent Museum, Informative and Fun. Visited the Samurai Museum on a Saturday morning, was a bit busy at the entrance as everyone was waiting for the guided tour. Highly recommend doing the guided tour. The cost is already included in the entry ticket. Our guided tour group was too big to start with, but the staff quickly separated us into two groups which was fantastic. Our guide was very knowledgable in the Samurai history and able to explain the history in plain and fun way. It was a very enjoyable experience and also got to wear traditional Japanese and Samurai costumes at the end of the tour. There are also Samurai performances in the afternoon which are definitely worth watching. Again, the cost is already included in the entry ticket. Suggest you go in the afternoon if possible to fit both in at the same time."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Excellent experience. Much more than we expected and well worth the price. The free guided tour was unexpected but made it so much more informative. He took as much time as we wanted and answered all our questions. Afterwards there was an unexpected and impressive sword play demonstration. Fascinating."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "An enjoyable history lesson. We enjoyed visiting the samurai museum in Tokyo. It is small but well designed. We liked how well kept are the armor pieces and the kids loved the opportunity to wear samurai customs and take pictures with the swards at the end of the visit.The visit includes a tour guide which is a big plus. Our guide was very helpful in explaining the complex history of the samurai and was able to easily answer all of our questions and colours to the visit.Did you know that the inspiration for the Darth Vader costume came from one of the samurai leaders? Check it out when you go to the museum...it was impressive to see the original character.It was great, and my only criticism is that the place is small. With hundreds of years of samurai domination I wish they had a larger museum that celebrates their history."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Worth It. An excellent two hours wandering through the history of Samurai from the Edo Period. A personal guided tour for a small group of six, in very good english, finished with a photo op in Samurai armour and Kimono, and a 20-minute exhibition/display of Samurai sword fighting at the end. Easy walk from JR Shinjuku station.I now know that Samurai were not fond of Ninja."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Excellent attraction! . Well worth the price. Great for guides, lovely facility, and a great way to spend 1-2 hours. I'd definitely recommend!"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Awesome experience. Get there at 2pm for a demonstration. Very friendly informative staff and lots of interesting artefacts. Wear socks as you'll be taking your shoes off. You can try on some of the samurai gear. Very memorable visit, highly recommended."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Worth the visit and the entrance fee. Really well put together little museum and the bonus is a free guided tour by very well informed young english speaking guides plus a display of samurai sword play. We enjoyed it."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Small but very interesting museum.. I was in Tokyo on a business trip and had a spare hour in the afternoon, so decided to visit Samurai Museum. We have a guided tour and learned a bit of the Samurai and Japanese history."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Excellent experience!. Excellent experience, very informative and interesting. Must see! Plus you get to wear samurai armor"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Great museum. Surprisingly great museum with lots of interesting artefacts and stories. Excellent guides with opportunity to try on the costumes. Well worth the 1,800 yen price."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Interesting museum for everyone. We took our 3 boys (aged 13,13 and 10) to this museum and they really enjoyed hearing about the Samurai and trying on the helmets and watching the demonstration. Our guide had excellent English and explained the different armour and weapons very clearly. There are enough interactive elements to keep the kids interested. Definitely worth a visit, particularly when combined with a visit to the ninja trick house down the road."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Do not miss out on this. This place was exceptional. We paid thinking we would walk around and read the wall plaques but our entrance fee included a guide who was knowledgeable on the history behind each display piece. He spoke incredible english and even recommended us other places to enjoy while on our trip. Seriously do yourself a favour and enjoy the culture and history the Samurai Museum has to offer"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Great experience!. Small exhibition of Samurai armors and swords. 4 times a day there is a samurai show very interesting. The guides are nice and giving you many information about Japanese history. The ticket is a bit expensive but it is a nice experience."
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Cute and charming museum. We visited this museum when it had recently opened so it wasn't crowded, we ended up having a guide walking with us. We learnt the history around the different items such as swords, costumes and shields which was interesting. We ended up at this place by accident as it was on our route to another place, it was worthwhile a visit if you are looking to kill time. Not a place I would recommend to friends though. Another charming thing about this place is that at the end you can dress up as a Samurai or a Samurai princess and they will take pictures."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Don't miss this gem . Beautiful armour in a small but charming museum with antique bamboo and tatami mats. The curators/guides spoke excellent English and this was a very special cultural highlight of our time in Tokyo."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Nice museum for boys . The museum is small but interesting. They have original and replica samurai costumes. My boys love this place. We were accompanied by a tour guide during our time there. She spoke perfect English and very nice. We had chance to try some traditional costumes and took pictures. The location wasn't easy to spot coz it's small so make sure you don't miss it"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Worth the hour visit. Awesome place to learn about Samurai.The man who took us around had a great knowledge and although we didn't ask any questions, people in out group did and they were all answered. Fantastic collection, worth seeing."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Fantastic. This museum was brilliant, with a superb collection of armour, both original and replica, in addition to weapons and information. Furthermore, there are many helpful and kind tour guides. There was also a superb training demonstration by a samurai, with both photo and a question and answer session. Really brilliant. Then, there multiple opportunities to dress up in Edo-period Japanese clothes and this was good fun. Finally, we had the huge honour of meeting the Chairman, a humble and kind individual. If you have an interest in Japanese culture, particularly the way of the samurai, then please visit this museum."
        }, 
        {
            "index": 39, 
            "rating": "4", 
            "review": "Only if interested in historical warfare. It's a great little museum tucked away in Shinjuku. It's a private museum. There is a lot of good information regarding the samurai history. Take the free guide tour provided with your ticket to truly understand the various eras of the samurai. Not suitable for kids - especially from a tour guide narrative."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Absolutely worth visiting!!!. We didnt expect much and were absolutely surprised what this little museum had in store.There was an English speaking tour guide who walked us through the museum in little groups. He could answer a lot of questions and explained everything in detail. This is already included in the ticket price.There was also a samurai demonstration by a man who showed how a samurai uses his sword. You can also ask him questions.If you know a lot about this topic already, it might not be that informative. But we learned a lot and think its absolutely worth visiting. A wonderful surprise."
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Cool. Small, but very interesting with a kind staff and a good guided tour. Beautiful armors and swords...You can touch some of it. Reccomend."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Very interesting museum. A very interesting museum. The guided tour (included with the ticket) is extremely interesting. The collection is fabulous. A must for anyone interested in history.There are also 15 min swords demonstration but only in the afternoon - so be aware that if you want to see this, it is better to come in the afternoon. They are hourly starting at 14:00. We unfortunately missed this."
        }, 
        {
            "index": 43, 
            "rating": "2", 
            "review": "a small collection. This is a private museum hosting a collection from a private individual. One sees a few cases of nice 18th century samurai armor and katanas, many replicas. There is also a daily sword show, which i missed. I thought the guide was sympatico, helpful and knowledgeable. This however cannot make one overlook the fact that the visitor is overcharged: the entrance fee is Y1800 - you'd see 100-fold more at any national museum, for ~Y400."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Educational and fun!. Great Samurai demonstration followed by a guided tour of the museum. The show and tour was 1,800 yen per person (approx $18 US). The show was amazing and lasted about 10 minutes. Afterwards, the Samurai (portrayed by an actor) posed for pictures and answered questions from the audience, that was about 15 people. Make sure to check the show times before you show up if that is something that interests you, as they only run at certain times. The tour guides spoke english quite well and were very knowledgeable about the history of the samurai. The tour consists of viewing artifacts (swords, weapons, helmets and samurai armor) and discussion over their use and the historical relevance of the samurai during that period. We spent about 1.5 hours at the venue, including 15 min at the gift shop. The place was very clean, well maintained and nicely appointed. I definitely recommend this and will go again next time I am in Tokyo."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Great tour guides!. This place is great if you want to learn about Japanese culture, and as we had an English speaking tour guide we got to know a lot of very interesting information! It's a perfect activity to do on a rainy/cold day."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Learn about life of samurai and get to dress up like one. Nice small place in the middle of Shinjuku. You get a guide that tells you all about the life of the samurai, the swords, the battles and the history. Outfits are pretty cool, so much detailing in every bit.They also have 4 shows that start at 2 pm, 3 pm, 4 pm and I think 5 pm. You get to see the samurai art of fighting shown by a japanese guy who practices it for 7 years. If you bought the ticket and visited before the show you can reenter with the same ticket to watch the show.You also get to try on the samurai head wear and some kimono for a photo.The place is in the middle of the Tokyo's red light district, so don't be surprised to see some \"interesting\" women and men hanging around it. Yes, even in the middle of the day. It is very entertaining, so don't rush to leave the area.;)"
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Out with friends. This is a small museum but our guide was very informative so it made the experience worth while. There is a demonstration at the end that is a little tedious but entertaining at first. I was a bit disappointed to find that samurai used guns and had sex with apprentices. Not quite how Hollywood depicts them!"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Edo Period Education and Culture - Must do!. We stayed at Shinjuku Gracery and the museum was just around the corner. It is small but jam packed of history and culture with some original pieces all throughout the tour. It is a very traditional building with tatami rooms. Very special and fascinating. You even get to dress up - totally cool!!"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "I saw the sumo tournament here!. great seats, good food, great show! it was cool to see the rituals and traditions of the sumo wrestlers."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Cool. Period.. Just went there to waste time and ended up liking the damn place, they explain throughly everything that happened in each period of japan's history. At the end you meet a movie star that learned the samurai skills for 9 years"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Informative and fun Museum for the whole family. We, 4 adults and 1 5-year old boy, visited this museum in late May. The museum wasn't busy and we waited just a few minutes for one of the English speaking guides. Our guide was not only knowledgeable regarding the costumes on display and their history, but he was also fun. We all enjoyed our tour and returned for the Samurai Sword presentation later in the afternoon."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Really interesting and entertaining. As with many people who visit Japan, I've enjoyed films, anime and games based around samurais so I was keen to visit this museum.Not only was it a chance to see some beautiful armour (the craft is incredible) but it was very educational. Due to the Samurai's influence and important in Japanese history you will learn about the history of Japan without being overwhelmed with information. What I really liked is that rather than focusing on what popular culture thinks of, samurai yielding katanas, the museum guide talked about the use of bows and guns.There was a demonstration of swordsmanship that was very well done plus there's a few opportunities to get involved. I tried on a replica helmet (still a handmade outfit) and got my photo which was fun!It is only a short visit, maybe an hour or so, which means that if you're in the area it is definitely worth fitting in. The shop was decent too."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Very worthwhile . My teenage son, teenage daughter and myself were going to go to the sword museum, but the poor reviews of the sword museum led us here instead. The samurai museum was totally worth seeing. Good English speaking guides were available immediately and took us through the two level exhibition. The information given was interesting as was some of the history. Previous Japanese history is not required, however, on reflection, I wish I knew something before going. I think I would have gotten more from the museum. There was a live demonstration as well as an multiple photo opportunities. The samurai armour sets are amazing to see. Lots of variety and colour. They are in extremely good condition. We were probably there for 60-70 minutes. 50-60 mins is probably the right kind of duration for most people I suspect. Worth seeing"
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Fantastic . Definitely worth a visit. Very friendly staff and interesting tour. So glad we went. The gentleman in the gift store was very nice and funny. I purchased a fantastic samurai sword umbrella !!"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "A MUST do in Tokyo!!. A relatively new museum, the staff guide the visitors through the hallways and rooms, explaining the history behind the different influential samurai, and offering insight to any questions guests may have. The physical demonstration was fantastic, and we got to ask the sword-wielder questions afterwards. Very Fun!"
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "A Hidden Gem. Located in the back streets of Kobuchiko and can be difficult to find. Small place but very interesting collection of genuine artifacts from 1600's onwards. You get a small group or individual guided tour for a very reasonable fee. The tour guides are friendly, knowledgeable and speak very good english. They have a Samurai weapons demonstration several times daily."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Great collection of armor and interesting guided tour. This is an interesting little museum and worth a visit if you want to learn about the Samurai. They have great staff who speak a fair amount of English and enthusiastically describe the Samurai and armor. The tour is included in the price and worth the additional time as they provide a lot more information than you would pick up just going through on your own."
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "Small. but interesting nonetheless. Came here on a Thursday afternoon and it was quiet. The exhibition space is small, but whats on display is truly interesting. The swordsman performance is also very interesting, especially since there's a question and answers afterwards. The small gift shop is also fun to peruse. Recommended if you're going to be in the Shinjuku area."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Excellent museum, a must see. The museum was a short walk from my hotel so I figured give it a shot. I was not disappointed. It is a small museum but the guided tour makes it great. Our guide was knowledgeable, friendly and answered every question from the group. You can try on some of the gear at the end of the tour for photos. Try to time your visit for when they do the shows, I think 1 or 2 PM is the first show."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Shinjuku. We were exploring The streets of Shinjuku when we stumbled onto the museum. We had a great time discovering the samurai history. You will need take your shoes off when you go upstairs. You can also try on samurai and kimono clothing. The cost was 1800 yen each."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "one of a kind. This is easy to access and takes just about 20 minutes to visit it all, but there is actual option to take picture in Samurai \"costume\"."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Amazing collection, good tour guide. Impressive collection of Samurai costumes, swords and helmets! They assign an English speaking guide for each visiting group of around 6-8 people, and they are very knowledgeable and friendly. Visitors can try on the different costumes and pose for photos as souvenir too! We enjoyed the visit a lot! (The photos shown are not fully justifying how amazing the collections are.)"
        }, 
        {
            "index": 63, 
            "rating": "4", 
            "review": "Pretty Cool . The Samurai Museum is worth a visit. The displays are very good and the tour guides are very friendly and speak good English. This is something that should be checked out. An interesting insight into the ancient world of the Samurai in Japan. There is also a small show from 2pm displaying the sword skills of a samurai."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Super interesting. The museum is tucked away in the popular red Light district of Tokyo - Kabuchiko. We just happened to walk by it and thought about doing a quick 15 min walk through. We ended up spending 2 hours there.The collections have been carefully collected and compiled. The staff is super knowledgeable and friendly. The walk through is fantastic..the best 800 yen you'll spend.If you walk in around 2 pm you'll get a chance to sit through a 30 min samurai show. It's absolutely brilliant. The best past is that you can touch and wear some of the pieces! And get to participate with the actor who plays the samurai!"
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Great insight into the history from a descendent of a samurai!. This private collection is an impressive and insightful peek into the long and rich culture and history of feudal Japan. The guide speaks fluent English and does continuous research on every item in the collection. The owner has spent several years privately collecting these weapons and armor, and each item has a significant feeling of history and filial lineage. This museum is a must-go if you have ever enjoyed a samurai movie or one set in the feudal eras of Japan."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "It is feeling as it is a Japanese warrior. Samurai of Japan , in my country it is said that the very brave warrior .Its way of life and the idea is that all of the world's people should know more ."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Brief but excellent. Was quite a small display, but of excellent quality. Some of the artifacts on display were very old displayed well. The people at the museum were very friendly and happy to walk us through the exhibits separately. We had a real samurai display and an opportunity after for a picture with him. This would be great for a family with small children. Nice and cool with air con too if you want to escape the midday heat."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "You NEED a photo from here!. The mixed reviews of this place left me a little sceptical.... However .... It was kinda awesome!!!Our Guide was very friendly, funny and knowledgeable. The suits of armour and swords were beautiful and each was discussed so we understood them and how they were used. We also had two opportunities to try in some replica gear and see what it would be like to wear in battle... I can see some people thinking this is cheesy but we thought it was hilarious and had such a great time!There was also a demonstration which was interesting, a guy doing some stylised flow with a katana, a touch strange but again we thought it was excellent!Had a great time here overall and would definitely recommend it! Go with an open mind and have some fun!!"
        }, 
        {
            "index": 69, 
            "rating": "4", 
            "review": "Very interesting with English speaking guide. After getting my ticket I was escorted around the whole museum by an English speaking guide. They had outfits (samuri for men and gowns for women) that you could wear and they took your picture (with your own camera). They also had a demonstration at the end that was interesting as well."
        }, 
        {
            "index": 70, 
            "rating": "4", 
            "review": "Small but interesting. My 14 yo son loved this museum. It will appeal to you if you have an interest in the different types and styles of samurai swords, armor and weapons, but not really much else. There is a short sword demonstration as well."
        }, 
        {
            "index": 71, 
            "rating": "2", 
            "review": "Just small private collection. Just a private collection. Not really traditional Samurai. Just a business to make money. I was looking for sometimes really especial about Samurais."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "An educational tour of Japanese history. Definitely worth going to. The guides are excellent and it's an educational experience for anyone. The entry fee was great value for money."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "For those interested in Samurai and Japanese history. This is a cool museum. They have a lot of beautiful pieces of Samurai armour on display along with Katanas and other less well known Samurai weapons. The tour guide was very friendly and knowledgeable about Samurai history and was very helpful in answering our questions. The highlight for me was being able to see the original Katana belonging to the Great Miyamoto Musashi. After the guided tour we got a watch a 10/15 min performance with an actor using a Katana along with a Q&A session and to top it off, you can take pictures whilst wearing Samurai armour. This was a fun tour which I highly recommend."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Samurais in Samurai museum. Tour was pleasant with nice gude who spoke very good english. There was possible to get good conversation of the topic as well. So the gudance was not just any well trained book text. Items were in good shape and in good order. Some items we were actually able and allowed to touch. Other items were just replicas, eg. some of the swords and armors. It was also fully allowed to take photos.Also the guide will take some photos of you after you have dressed like samurai. They have many costumes there to borrow. Nice feature to make otherwise hard topic much funnier.There was nice little souvenir shop where you could have get a real japanese sword as well. Don't know what they ment with it. At the shop they seemed to have only cheap replicas. Good addition was that you could send for eg. sword to home by mail from the shop and the staff will aid you thru it.I would have been more than satisfied to the standard tour. Anyway there was additional show part. I call it Hollywood part. There were some actor who showed some samurai postures and techniques. Not sure how real or where hes learned them, and honestly it felt little bit like made for dumb tourists. Anyway it was amusing."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Fun and educational. Highly interesting, super friendly staff and a lot of hands on where other museums are only displays. Thank you"
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Guided tour included to enhance your experience . Upon arrive, I thought it was a little expensive to be paying 1800yen for a tour that could possibly take 20-30 mins. My opinion changed when they provided a guide to show and provide history of the artefacts. Another plus is you get to take photos in samurai armor while holding a katana. I left feeling more curious and interested in Japanese history. Enjoy!"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Definitely worth a visit. They had some cool pieces to view and an energetic and knowledgeable staff that were excited to take you from room to room and tell you the history of the items. My wife and I were also able to view a samurai demonstration and try on some outfits they had available. They also have a nice little gift shop that includes swords, if you're interested in shipping one back home. Worth a visit if you're in the area."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "So fun!. Great small (1-2 hour) museum. Definitely touristy, but they have a nice collection of original & replica samurai armour, swords, & artifacts, and the staff gave excellent guided English language tour. Nice . Come by 5pm to catch a martial arts demonstration - cool, intense guy gives a demo of the samurai sword forms & a sort of mock one-man battle (like shadowboxing, but with a katana), and answers questions. They'll even take a fun picture of you in samurai gear at the end. The staff went out of their way to make us feel welcome & answer all our questions, even giving restaurant recommendations in the area. Would highly recommend!"
        }, 
        {
            "index": 79, 
            "rating": "3", 
            "review": "Good for tourists. We enjoyed the short tour conducted by the guide. The intricately-made samurai armour are interesting especially when we compare the armour to those we have seen in other parts of the world.There was a specially humourous set of 3 where the tallest helmet was actually worn by the shortest shogun.My husband and I also dressed up as lord and lady in elaborate armour and kimono. That was fun to do. Gave us a good laugh.Too bad we didn't have time to watch the sword fighting demo. Had to fly home :("
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "Definitely recommend . This place was really cool I believe it was about 2000¥ and you get a guided tour a sword technique demonstration that lasted about 20 minutes and to dress up like a samurai and take pictures. Was really fun and neat to see all the different variations of the samurai. Definitely recommend"
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Informational short tour. This place with an 1800 yen entrance fee was worth the time. A group of friends and I came in and were accommodated with an English speaking tour guide that was patient with out questions and spoke clearly. The museum was small dimly lit but had a good atmosphere. Pictures were allowed but anything not on display was not well lit. The tour was great for Japanese history about samurai and at 1600 had a demonstration of ceremonial sword play which was a lot of fun to watch and he even let us hold the swords. Neat little gift shop worth the time."
        }, 
        {
            "index": 82, 
            "rating": "3", 
            "review": "Good if you want to kill some time. I think this visit was let down by the tour guide who I felt was 'winging it' during the whole tour. I didn't feel that her depth of knowledge about the Samurai period was good enough for her to be working as a tour guide. The entrance fee was also a lot given the size of the museum and poor quality of the tour. If you want a discounted entry price, look for a museum brochure at your hotel tourist desk."
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "Small but good. A small, private collection of original samurai armors and weapons. The objects are beautiful in themselves, and the English speaking guides (included in the ticket price) do a good job at telling their stories and putting them into the context of the fascinating history of the samurais. This makes it worth the admission fee, which may otherwise seem a bit steep for the size of the exhibition. Also included in the price, if you come in the afternoon, is a show of samurai fighting styles. If you miss this (as I did), you can come back another day on the same ticket. Recommended for spending an hour or two, for example to dodge a rainshower :-)"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Marvelous Gem delivered a Wonderful Experience. The museum was small, but packed with Gems.Ultimately, it was our Guide and the Sword master show that made it a great experience.Our Guide was excited to learn we were from New York, and he bonded with us and gave us a spectacular tour, with great depth of knowledge of Japanese history !!We were worried it was very expensive, but the experience was PRICELESS.Our son got to try on a Samurai Helmet and were held a 400 year old musket.Sometimes great gifts come in small packages...Try this one"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "We came, we saw, we loved it. Got here at 10:30am and paid the entry fee...were immediately met by a guide (english speaking) who took us through the whole place. We got to dress up in the warrior armour and the kimonos...no extra charge and added greatly to the experience. Was awesome, definitely come here when in tokyo"
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Very Interesting. Got a guided tour and you can come back later in the day for other shows (its included in the ticket)"
        }, 
        {
            "index": 87, 
            "rating": "2", 
            "review": "Save your Money ... Little to see and experience . We had high expectations of the Museum after reading reviews. Visited today , possibly 10 of so samurai uniforms and about 30 samurai swords to see.The experience starts when you go upstairs , take off your shoes and then go into a small room for a display of a person dressed up as a samurai going through some moves with a sword . After 2 mins it's enough . After 10 mins come on.. It then goes in again for another 5 mins. We walked out ... Boring to say the least.. Save your money .. It's really a huge yawn fest ..."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Not the movie version. A compact, interesting and informative exposition of the Samurai era of Japanese history. Well guided with many interesting exhibits including a demonstration of the various ritual sword strokes of these warriors."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Simply Mesmerising Interactive Experience . I have been adoring samurai's all my life and when I got to experience and see this life of the samurai in this museum I was truly excited . The samurai have an iconic symbol of power, courage and masculinity over hundreds of years of Japanese history . I can truly feel the souls of the samurai in this museum . I truly recommend for those want see the culture of Japanese warfare to visit and experience this museum in shinjuku . The ticket is about 1,500 yen and for its worth the money spend . The ground floor has the souvenir shop and exhibits and the first floor has more exhibits and they different rooms with traditional tatami mats and paper screens with beautiful ambience in lighting . They also have performance and you can be part of the performance as well . I certainly took the opportunity to do it.Just check out my picture you will like it . "
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Small but fun museum. The museum was small, like only two floors in a regular building. But with the price you pay, you get a guided tour and a samurai show (15 min one person show). Best yet, you get to dress up as samurai, general or foot soldier. Girls, the Japanese pricess. We spent over one hour in this museum and kids enjoyed it."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Interactive Samurai Museum - over delivered 👍. We loved this fantastic experience at this museum. Our guide, Daiki gave us some extra info as we asked for it. We got extra information about not just history, but actual Japanese lifestyle. We could try on a replica, see a sword show, where my husband actively participated, touched some real relics. Could this be better? Ah photo-shooting! We got some daily samurai family clothes to try on and took some pictures. In the end you can buy your own katana (samurai sword) and get it delivered to your home. So no stress at the customs. Pretty cool! This is a private collection. Thanks for the owner making this place open for visitors! Really appreciated!"
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Cool place . It's a small museum but some cool stuff inside. I especially like Miyamoto Musashi's katana plus some other real ancient katanas. Very friendly staff and good guide accompany"
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Nice place to visit. Nice place smack in shinjuku. A good place to visit if you're not interested in other stuff around the area. Staff's are friendly, place is cool with all the artifacts and affordable."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "LOVED it!. Just got back from our visit at the samurai museum, and we absolutely loved it. Our guide was super knowledgeable, and taught us a lot about the samurais and their era. Maybe you have to be especially interested in samurais and japanese history to enjoy, but we are, and it was amazing!"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Two thumbs up!. I was skeptical from the outside but once we went in I enjoyed ever minute. Its not very big, just a few rooms with artifacts and memorabilia on display. You can walk around on your own or with one of the free casual info tours. The owner was on site giving one of the tours as well as a hand-full of english speaking guides. There was also a great Samurai demonstration with Q&A at the end."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Really worth visiting. Went there with my girlfriend on a raily weekday around mid-day. We got an English-speking guide who guided us and 4 more people. He spoke good English and explained the history of samurais with a great knowledge and a nice sense of humor. When I and the rest asked some specific questions he gave the answer immediatelly and just like that.They also had a presentation of using the samurai sword. It was given by a man who seem to been a tv- and movie actor. This guy knew how to use the sword. The presentations were at leat at 2pm, 3pm and 4pm (maybe later as well) but if you go there earlier like we did, you can come back for the presentation. There is a nice sushi place about 100-150 meters from the museum (can't remember its name) so we grabbed a bite and went back.If you have even the slightest interest in Japan history, you need to take a visit.+ you can test to wear those samurai armors yourself."
        }, 
        {
            "index": 97, 
            "rating": "2", 
            "review": "Very disapponting. Our expectations were very high, and they were not met. The place was very disorganised: we were taken to a show on the second floor in a rush, then left on our own in the middle of a room. Once we had a guide, he did not seem to know much about samurais and appeared in a hurry. His only objective was to have us taking pictures and share them on Instagram. There was no general introduction and historical descriptions whatsoever. The show only lasted 5 minutes, then the \"samurai\" took two tourists in the room to teach them some sword tricks while the others had to watch and do nothing: this was extremely boring. Plus it is the most expensive museum we visited in Tokyo.... It is not worth it..."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Check this place out!. Was well worth the entrance fee. Has a collection of original armor as well as reproductions. English speaking guides are very knowledgeable on the subject. Lots of photo oppurtunities."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Really spectacular. I have always loved the Japanese Samurai and this place was great. We had a tour guide who spoke english and went through its history and answered any questions. The display was unique with some good histoy of japanese Samurai. The sword display was awesome and well worth the administration price"
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Lovely museum, full of history. We visited during our stay in Tokyo. We were surprised by a tour carried out by the owner museum who explained the details of the original artifacts kept here. We were also in time for a samurai demonstration which was informative. There was the opportunity to dress up for photos. The staff were very attentive and happy to answer any questions. We had a fantastic time and learnt so much about the samurai culture. Would definitely recommend this museum!"
        }, 
        {
            "index": 101, 
            "rating": "3", 
            "review": "A bit pricey. A bit pricey. About $25 aid for entry and viewing of about 3 rooms. You pay really just for trying on the samurai costumes and taking photos."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Interesting with the Tour. This is a small but interesting museum. Some of the exhibits are original and others are replicas. I'm not sure if this was a standard practice, but someone working there gave me an English tour that was interesting and informative. The demonstration was interesting as well."
        }, 
        {
            "index": 103, 
            "rating": "3", 
            "review": "Touristy. The place was very touristy and limited in scope. With the raving reviews my expectations were a bit higher. Samurai demonstration was interesting but very unstructured."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Worth the expense.. We took our 3 boys to this museum and after the initial shock of the cost (60,000 yen) I discovered that we would have an english speaking guide. She was very nice and knowledgeable. Her english wasn't the best but it was FAR better than my Japanese. The children really enjoyed seeing the amour and had even more fun playing with the free swords the gift shop provided. In hindsight, I wish they'd gifted the swords after the tour but I can't really complain about free stuff. Towards the end of the tour we were allowed to try on helmets and various other robes as well as take photos- at no additional charge, which was cool. Overall, I found it to be fun and educational."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "samurai treat, NO it can be sweet!. This place was amazing 300- 800 year old artefacts some you could touch! the tour guide was great it can speak a little Japanese but he could handle english like a A-Grade Baller! If you're in Shinjuku this is a must!"
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Excellent 1.5 hour spent. Small but personal tours. The guide was very knowledgable and answered several questions. The tours guides spoke English. Very informative tour which included a samurai sword and stance demonstration. There are some interactive displays: my son tried on a replica mask and helm. I was able to were a ceremonial kimono."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Best Museum We Visited. We got discount vouchers from our hotel. The museum is not where you'd expect to find the most traditional culture, in the red light district of Shinjuku. But we're glad we went! Our English guide was really knowledgable and took us around the whole museum as part of the entry price. We got to try on some replica armour and then she let us try on some kimonos and took pictures for us. It's a bargain for what you get. I'm not big into history and didn't really know anything about samurai past Tom Cruise but I felt like I learned something and was not bored.One of the best things to do in Shinjuku, especially if getting drunk isn't really your thing!"
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "worth visiting. Although the museum is small, it is very interesting and well organized. They had volunteers who escort people around and explain all the different exhibit areas and answer questions. So glad we decided to go! It was not crowded when we went and was easy for us to get to, since we stayed near Shinjuku (it is north of the train station)."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Fair price for a fun afternoon!. Really fun hour spent here. I really liked this museum as it is clear, concise and to the point, not flooded with textual information that will bore you. Initially I thought the entry price of ¥1800 was quite expensive but when we entered we were given a free personal tour, a chance to watch a samurai show which was great and the opportunity to try on traditional Japanese garments. All of which was worth the total entry price. At the end you can also buy a lot of souvenirs in the shop which is moderately priced. They can even send home samurai swords back to your home address for you if your country allows it!"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Very good value for money. It has been our only such museum we have seen in Japan, and it was totally worth it:- very friendly staff, with deep knowledge of samurai history and Japan history, and with very good English skills.- live performance by an actor (several times per day, once per hour) showing the art of sword handling. Then they invited everyone to try some basic moved and to have their own pictures.- cool shop for souvenirs (some could be delivered at least to your hotel, if not also home abroad).I would recommend only some guidance signs on the nearby streets, as Google maps may not give the most accurate results and you may miss the location (quite a funky neighborhood)."
        }, 
        {
            "index": 111, 
            "rating": "4", 
            "review": "Small, $18 and Worth Every Penny\\. For roughly a 30 minute experience, you spend $18. That seems a bit crazy, initially, But, then you realize:1. You’re getting a guided and personal tour.2. The collection is hundred of years old and was procured by 1 person, the owner.3. You get to try things on and get a picture in a kimono or samurai outfit.All of a sudden $18 doesn’t seem too bad."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "A Must See Museum. This small museum is a must see if in Shinjuku. It's small but not a single exhibit is a waste of time. The first floor features authentic samurai armor and after seeing these you move on to the second floor for a complete history of the samurai period. Such a fun experience."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "A little difficult to find but worth it!. This is a great little museum. Every visitor seems to get a highly personalized tour around by the enthusiastic staff. We learned a lot. When we asked upon leaving how best to get tomthe metro, the Manager walked us there (several blocks) himself and gave us some interesting local color. Try to fit this in to your Tokyo sightseeing!"
        }, 
        {
            "index": 114, 
            "rating": "3", 
            "review": "Okay on a rainy day. I felt that this museum was over priced and not a good value. It was one of the most costly museums and the smallest. I think you can get as much from the other historical museums in Tokyo (ex. Edo-Tokyo Museum) where there are some interactive experiences for the kids.We went because it was close to our hotel but I would not go again. We were in and out within 20 minutes."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Extremely worth it. A tour with explenation trough the museum a small show of a samurai and the possibility to dress up a bit as geisha/samurai makes this place extremely worth it for this small price."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Fantastic. Great presentation and great tour guide. Very friendly and welcoming staff.Recommended for anyone visiting Tokyo!!"
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "A gem in Kabukicho. We purchased the tickets right at the museum. There was no line, and a tour guide was right there ready to show us around. The museum is small; there were probably 25 other visitors when we were there and it didn't feel too crowded. I would definitely recommend timing your visit according to their demonstration times which is posted on their website (English version available). A well-trained actor showcased samurai movements; the demonstration was very dignified and appreciated by our family."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Not really into Samurai but still very good!. Went here as a couple and enjoyed looking around the samurai museum, when we arrived they offered a guided tour in a small group which was really good including Tom Cruise Last Samurai joke (haha!)They allowed you to try on and take photos and genuinely seemed to enjoy working in the museum. They knew a lot about the features of the museum and it was very informative and not at all boring in any points I think helped by the fact the museum is not too large but a good size, a great experience and one I recommend."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Great for family with children . Most do list. I didnt think a museum was what we were going to on a holiday but our daughter 10 years Love this place. You can also try the costumes which give you good memory."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Excellent museum. I was really impressed with the Samurai Museum.Great displays and someone comes around and explains all the displays in interesting details.Worth staying for the Samurai show in the afternoons.Top class museum.Located right next to Kabukicho"
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Cool visit, instructif. Wanna learn about samurai ? This is the place to be. Great display of samurai armours, helmets, swords. Top floor you have a guide that tells and explains history, in english. There is also a demonstration of sword manipulation."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Great experience and english guide. This is a small but very nice museum close to the Shinjuku station. All staff members speak english and they guide you through the rooms describing the items and the Samurai history.Make sure to plan your visit when there is a Samurai demonstation where you can be the lucky one to try out some techniques.Highly recommended specially when you are traveling with kids."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Very informative!. As a personal collection of one man, the array of artifacts and information is staggering. The museum is quiet and small, however, each item is accompanied by an informative plaque and if you have the luck to get a personal guide to take you through you can learn much more and even try on some of the replica items. There is a small show where an enthusiastic staff member will run through the moves of the samurai with audience participation (though you do have to put you hand up!) There is a well-stocked gift store with many interesting and well-priced items."
        }, 
        {
            "index": 124, 
            "rating": "2", 
            "review": "Oh Dear! Consider Entrance As A Donation. Seriously, we should know better. Tourist area, tourist trap. At least the museum provides some lovely young people with employment. They ever so politley take your money.You will see a few genuine items of interest and quite a few reproductions of samurai objects. You have a 15 minute show (sword use display-dramatic) by a very nice young man and a tour of the items on display. I am not sure I would pay that kind of money $27 AU approx to see a similar display or that one again. If left to do the tour yourself, you could be in and out in 20 minutes.The museum knows that tourists like to play dress up, so you may find value in that.Not recommended."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Nice Tour for the Family. In the middle of the Shinjuku (Kubuki cho Red Light District area) is a relatively small private samuari collection.What I liked about this museum is that it is fully narrated by tour guides. The guides explain each of the authentic pieces in detail and you get much insight in what you are viewing.The tour takes only about an hour and ends with a fun free photo shoot (with your own camera) with samarai and kimono custumes.A fun interesting thing to do with your family in the middle of the red light district."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Lovely people, fascinating museum! . We Really enjoyed our visit here!! The staff were so friendly on arrival and offered to do a tour for us which was very interesting! We then watched a Samaria performance which was different and interesting to see! Finally we got to dress in Samaria clothing and get some pics which was very fun! Would definitely recommend if you're in the area!"
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Must See. A must see for those interested in knowing more about Samurai culture. Many exhibits and we went when there was a live demonstration on. It was great and worth it to see the actual explanation by a real Samurai"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Worth It!. If you're like me, you may want to skip out on small places with high(ish) entry fees attached. Don't in this case! The Samurai Museum is 1800 yen/person, but for that, you get a semi-private and very enthusiastic tour! Their collection is really nice, with a good range of samurai armor, katanas and other bladed weapons, and guns. For funsies, you get to try on a couple of helmets/costumes with the staff's help, and they're happy to take pictures of you.The tour was really informative, with a very knowledgable and adorably-enthusiastic guide. For most of the tour, it was just my husband and myself, though a couple of times, we ended up mixing with another group of 2-3.As a bonus, the guide found out we were on our honeymoon, and gave us two pairs of chopsticks on our way out - one with a samurai design, and one with a noble lady. :) It's the little things.Head's up: this museum is near Shinjuku's redlight district. It's totally safe to walk around there (including in their nicely-late hours), but don't get discouraged when you start seeing more bars and ...interesting signs."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "History. If you like samurai history this is the place. you get to dress like a samurai take a picture and take a picture. Tour guide thru the museum after pass by the gift shop.Awesome souvenirs "
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "Nice leafy area for a walk. This area is leafy and green during summer but I guess in Spring it would be much lovelier. Not all the venues are open free to the public, the one that is paid entry is well worth it. The souvenirs are great too because they are well made."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "My favourite part of Japan!. This review will be biased as I love Samurai and the history they entail.This musuem was my favourite part of my Japan tour and I made the most of it.Very well priced for what they have; 1800 Yen and there is a vast variety of Samurai costumes some you can try on. The tour guide explained the the history of each artefact and back stories quite well.There were Samurai blades, armour, guns and even a life demonstration which I volunteered to be a part off.It is quite far but because the train systems are so brilliant in Japan we got there in two trains over 35 minutes, well worth it!"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Samurai Museum. As my kids were obsessed with Samurai warriors, we decided to visit a museum relating. The exhibition was great, but the most interesting part is trying some costumes and taking some pictures. Additionally, we were very welcomed by the staffs, who guided us enthusiastically. A well-organized museum with great staffs."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "Nice museum. As we were staying at the Shinjuku Gracery Hotel, it took us only a short walk to make it to the museum. The museum is small with two floors that include samurai related objects (some are reproductions, but still look impressive). Without the demonstration, the visit would not be worth it. However, as part of the demonstration, our son had the chance to try and learn sword handling and had an amazing time. That alone was worth the ticket price."
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "Very good small museum. I went here based on Tripadvisor reviews on a weekday evening. I was alone and found the place very easily using Google maps on my phone. It's right at the Kabukicho district along one of the smaller roads towards the back. The exterior looked really promising and I couldn't wait to get inside.When I entered, I was politely greeted by a few staff who showed me where to buy the ticket. Right after purchasing the ticket (Now 1,800yen), I was pleasantly surprised to find out that I have been provided a guided tour. Since I was the alone and noone else had arrived at the same time, my guided tour was one-on-one! My friendly guide was a young man, very energetic and enthusiastic (too bad I forgot his name!). We started out on the ground floor where there were real authentic Samurai warrior armour on display. He helpfully explained all the details which I never would have known if I had been on my own. Then we went upstairs - here there were a number of small rooms displaying various Samurai periphenalia. Everything was really interesting and my guide was very engaging, asking me lots of questions to test my knowledge and so that I can relate to the things he was explaining. In one of the rooms, the guide let me put on the face and headgear of a replica samurai armour. At the end, guests can put on kimonos and pose for photos for free. One of the highlights of my Japan trip! The gift shop didn't have much things that interested me but you can buy swords to be shipped home. They even provide a list of countries which do not allow swords to be shipped in, so you know. All in all, I had a great time here. I would have loved it to be a bit bigger with more exhibits!"
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Samurai Experience . Great little museum on samurai history, armor, and practices. Great guides with good knowledge and English. Sword handling performance and photo opportunities. Well worth a visit. Definitely get a guide (provided) and watch the performance."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Not just a museum visit, a great experience. I have to admit that when I arrived and saw the price and how small the museum was, I started to have second thoughts about going in but I'm so glad we did. Apart from the really amazing samurai armor and weapons, what really made it an experience was having one of the staff guide us around and being able to handle and try on a suit of armor. It was much more than just a museum visit, it was a great experience. Definitely recommended!"
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Surprisingly enjoyable and worthy. We stopped by here on the way to something else and it was getting late and we were getting lost. Decided to check it out with quite low expectations actually. And the price seemed really steep! ¥1800pp!! Then I realised it included basically a tour guide who ended up being hilarious and very much enjoyable while he didn't come off as trying to be funny at all. Really made it enjoyable for me and such good service he gave us (I am really bad at remembering names but if management is reading this: he's the young man who is starting studies at UC Irvine soon lol) so special thanks to him.Glad we did it and definitely learned quite some interesting facts that I would never have come across"
        }, 
        {
            "index": 138, 
            "rating": "4", 
            "review": "Good stop. Worth the time and money. Stopped here as it seemed well liked on TripAdvisor and was of interest to me. The admission fee is fair 1800 yen (about $15). Upon arrival I was greeted and handed to a guide. All spoke very good English and answered questions easily. It's not a large museum and there isn't a lot of information printed but the guides are very helpful and full of information. Be sure to ask what you want and go with the guide. Also, check what time the Samurai demonstration is and make sure to go then. It makes the trip to the museum complete and worth the money. He usually performs in the afternoon on the hour."
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "Small but interesting, with English speaking interpretors. This small museum provides a more detailed look at the history and culture of the Samurai through a variety of displays of their armor and swords. It also provieds information on their rise and fall from political power."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Great museum with a personal guide!. This is an excellent museum with beautiful Samurai armour. When we arrived we were pleasantly surprised to find a guide waiting to take us through the museum and explain the different armour. At the end, there was also a little show - great experience and lovely people working there."
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "The best experience in Tokyo for us. So, we weren't sure if we wanted to go there or not, but said, why not. It looked so small from outside and when we entered it seemed like hardly anyone was there, then all of sudden all the workers showed up. Entrance fee was quite bit more than I thought it would be, and I was hesitant, but decided since we were there, we will go ahead and go. One of the guys attached himself as our guide and took us through the museum explaining all the history and everything behind items. It was really great! It is much bigger than what you think from outside and items are interesting and narrative from the guide makes it so much better. Exhibition was great and we could try on some of the costume and helmet. It was really wonderful experience and worth the money (I don't remember how much it was, maybe around $15?) I highly recommend it."
        }, 
        {
            "index": 142, 
            "rating": "4", 
            "review": "Small, but just enough to get a glimpse of old Japan. I really enjoyed this visit - museum is small and there aren't that many exhibits, but I frankly thought it was sufficient - after the 7th Samurai suit, do you really need to see any more? The guide was very helpful and tried to explain as much as he could. I love the old Japanese things and am fascinated by the Samurai culture, so seeing the suits, swords and hearing/reading some of the stories was really enjoyable. The gift shop has some interesting displays of swords (replicas), but if you are lucky they sometimes have real swords (300 years old!) for sale,and you can get to handle them with care."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Fantastic gem - don't miss this!. What a fantastic museum! We were guided by a young local historian and he brought the whole Samurai period to life. Really well done. An entertaining demonstration followed at 2pm. You can touch some of the exhibits and even wear one of the authentic helmuts. Well worth the 1800 yen for each adult (>12years) all inclusive.We were glad our boys are a bit too young to have noticed the distinctly seedy location you have to walk through to get there..."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Nice historic trip. beautiful place, cheap to enter, easy to find, centrally located, must visit if you have an interest in samurais, lots of cool souvenirs to buy and you can take plenty of photos!!"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Hot spot in Shinjuku. If u here in Shinjuku ... this museum u must visit!! eazy to find by google map..ticket all include Guide - costume Samurai and Samurai show ..."
        }, 
        {
            "index": 146, 
            "rating": "4", 
            "review": "Museo Piccolo e ben organizzato. It is a clear example of how a museum can be small and with few masterpiece and yet very interesting and valuable.Museum is very small maybe 6-8 rooms in total, and there are not so many armors and blades, but it is very well organized and museum personnel take you to the tour, explaining in English, the meaning of the objects you see. The staff is really good, you can tell they love their job, they help you to take pictures and they even let you wear real Samurai helmets...Price, in my opinion is far too high 1800 JPY per person, just as reference national museum is 620 JPY, Golden pagoda in Kyoto 400 JPY, Kyozumidera in Tokyo 600 JPY."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Friendly staff and fantastic service. The price of admission seems a bit steep, but you do you get your own tour guide. The tour guide was fantastic and gave a great description of every artifact in the museum. There was also a nice demonstration of sword fighting as a samurai and a location to take your picture with a kimono."
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "Just go... it's mint. As an ignorant Englishman who barely has a word of Japanese, I was a little apprehensive - but reading the reviews on here convinced me that the guides would help me out.They were right.Informative, attentive and funny - they helped bring to life this fantastic collection of samurai paraphernalia.It's tucked away down a side street, so if you've not got data on your phone, make sure you know where it is before setting off - but I had a great hour and a half there for less than £20... which is pretty decent in this city."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Highly enjoyable and informative!. We really enjoyed our visit to the Samurai museum. Our guide was very informative and we learned so much more than we would have done without him. My advice to all visitors is to use him if you can rather than going around on your own. He was also very helpful in finding us a perfect place for dinner afterwards. Gift shop seemed reasonably priced for small mementoes. Highly recommend a visit."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Awesome . Great for the whole family! It's quite small but well worth the visit.Staff are very friendly and we had a guide who explained the whole history and the different styles of armour and swords.There was a demonstration by a Samurai swordsman who has been in training for 5 years ... Training everyday."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Great option for rainy day. Enjoyed all the history and samurai relics. Location is a little hard to find but with google map we made it! The personal tour guide was nice. Not crowded."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Excellent guided tour with cool pictures!. I went to the Samurai museum with my brother in the early afternoon after finding it on trip advisor the previous day. It costs 1800 yen just so you know, but it was worth every penny with our tour guide Gin! Definitely ask for a guided tour and try to get Gin because he was excellent and taught us lots of interesting history about samurai warriors. We also were able to take really cool pictures with a full samurai helmet, mask and sword!"
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Learned a lot in this Shinjuku treasure. Great work from the team to give great tours in English. I would recommend this to anyone, dates, families, alone. It's fun, it's interactive with the costumes, it's not that expensive. Don't be shy, try it out and check out some of the historic artifacts in this well designed museum"
        }, 
        {
            "index": 154, 
            "rating": "1", 
            "review": "Wasted time and money . I have lived in Japan for more than 10 years. I thought this would be a good place to take visitors .....BUTToo expensive - $18 per person - no discounts for studentsThe staff is friendly and eager to offer explanations. However - because of the limited English ability - the explanations are lacking in details.The viewing room for the \"Iai\" show is small. It is crowded and very disorganized. And no explanation of what the show is about. Except - welcome to a \"samurai demonstration\".The museum desperately needs to hire a historian and a curator. Until then, this is a trap for unsuspecting tourists. "
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "A must do!. We had a brilliant time at the Samurai Museum yesterday. We got a (free) guided tour of the museum, which includes both authentic (some 400+ years old) and replica samurai attire. We also saw (at 2:00pm), a samurai demonstration by a 'samurai actor' - it was great! The staff are absolutely delightful. 1,800 yen per adult - definitely worth it."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Anything but a boring museum. What a great experience and interesting place to visit. Get a personal guide to explain what you are seeing, try on an uniform, get a photo (included in the price), and even experience a live demonstration by a master."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Small, Wonderfully Curated Museum. Really great way to spend an hour or two in the afternoon. The staff are very helpful. As others have mentioned, wait to catch one of the free guided tours as the museum is light on textual descriptions of the historical context surrounding the pieces."
        }, 
        {
            "index": 158, 
            "rating": "4", 
            "review": "Small but interesting museum. My boyfriend practices iai so I was interested in this museum. It's small, but they have a lot of great items on display. A guide met me at the beginning of the second floor exhibits and provided a lot of additional information about the items on display. I'm sure this museum will get even better with time as they accumulate more items."
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "View, try on and get a picture!. This little museum turned out to be our favorite stop in Tokyo!! It did take the cab driver a little while to figure out the location, but he kept asking local people to help. After arriving, the entrance fee was $18 per person (USD) and well worth it!! You could see all the original samurai complete outfits and a personal guide explained all the exhibits to you in English! There were even small rooms of the actual swords they used and pistols/guns! They had a place where you could try on the head gear and take pictures with your own camera, or if you have extra time, you can dress up in complete samurai outfits and kimonos and they will take your picture, for a fee (like the old west pictures that are taken in the US.) The guide had a very in-depth knowledge of the history behind the displays and everything was so interesting. Definitely a must see!!"
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Very good. Quite steep entrance price of ¥1800pp but worth it once inside. All the staff spoke good english and took small groups round explaining the history of each piece and period displayed. The suits of armour all looked brand new despite being hundreds of years old. Tried on some helmets and swords and watched the show which was interesting and involving. Learnt a bit and enjoyed our visit."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "I simply loved it. Plenty of knowledgeable staff willing to guide you around and talk you through the exhibits and their history, chances to view beautiful replicas of all the famous suits of armour and actual historical pieces too. Then we got to play dressup.\nA great way to spend a couple of hours"
        }, 
        {
            "index": 162, 
            "rating": "4", 
            "review": "A museum worth visiting. A nice excebition. The guide tried hard to answer questions the best he could. I reconmend waiting for a free tour because most display text is in japanese."
        }, 
        {
            "index": 163, 
            "rating": "3", 
            "review": "Small samurai museum. A very small, privately-owned samurai museum located very near to the Shinjuku station. There are 2 levels of exhibits, with a few samurai attire, swords, paintings. Costs Yen1800/pax to view, which I felt was expensive for the small exhibit. Positive point is that there is a staff to guide you through the exhibits with some explanations."
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "A Hidden Gem. Found this place through TripAdvisor. Its tucked away in a little corner of Shinjuku district. While the museum is small, you get the attention of a museum guide which comes at no extra costs!Amazed at the samurai costumes which are hundreds of years old! There is also a samurai performance but it would have been better if there had been some form of narration to go with the performance."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Excellent Samurai museum. This was another attraction I added after reading Trip Advisor. It was well worth the hour we spent in here. Its fairly small but packs in a plethora of education and amazing artifacts up to 500 years old. There is exquisite original Samurai armor as well as swords and guns. The staff are extremely friendly and knowledgeable. Make sure you don't miss up the dress up opportunity at the end of the tour!"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "A secret treat. This little museum is tucked away near the Golden Gai district in Shinjuku a block away from the busy section. It contains a personal collection of Samurai armor and weapons. They have a demonstration of Samurai fighting techniques that is very well done and authentic without a lot of the popular gimmicks and you can pose in Kimonos and Samurai armor for pictures. Its a great way to learn about the Samurai and was a lot of fun too."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Nice place for those who likes Samurai History. At the begining we were not aware about this museum, we went because we wanted to do something different in our last day in Tokyo, when we arrived the personnel was very kind and welcoming, there was a man that did a tour of the rooms and explained to us a little of history without any extra charge, we could take some pictures with some samurai suits, touch the swords, helmet and there was a show of swords in which we could participate very enjoying, we recommend this place to those who wants to see things of Samurai"
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "Guided tour!. It's a very small but very interesting and nice museum.The entrance is 1800 yen for adults. Every now and then there is a guided tour. I highly recommend to wait at the entrance for a guided tour! The tour was very nice and informative. If we went by our own we would probably be finished within 30 min.In the museum you can dress up like a samurai or a geisha. And at certain times (ask for this!) they do a samurai performance (~15 min).This place might be a bit hard to find, so use Google maps!"
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Tetsuro-san's samurai museum. The mazes of Tokyo's Kabuki-cho are an unexpected place for a Samurai Museum, but in my opinion this is the number one attraction in the area. Tetsuro-san started the museum in 2015, to share his personal collection of ornate samurai artifacts and his extensive knowledge with the public. He's a very thoughtful and down to earth person, and gave me and a friend from Taiwan an amazing tour through his museum - allowing us to feel and try on many of the pieces. It was really fun and at the end of the tour I was so immersed that I had to rub my eyes to remember that it is the year 2016. I was already having a great time, but it became one of my best memories of the trip when Tetsuro-san took me and my Taiwanese friend to a small Izakaya for drinks after the tour, and I was in great company. I guess he couldn't do that for every visitor, but it just shows what a truly lovely person he is. The samurai museum is a lot of fun and the host is a one of a kind."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Superb. This is a gem in shinjuku a throughly good experience. The majority of the exhibits were authentic some 400 500 years old even had similar samurai swords. Which says something about the quality. I had personal guide throughout which is free you just paid small entrance fee. The guide knew his history great to see someone so enthusiastic. The exhibits were stunning some of the best ever seen. The other great thing is you get to try on replica armour and clothes the full lot and have photo opportunity. Great place well worth visit but take a taxi not easy to find"
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "The Guided Tour is Informative. This is a small museum but it is bery educational to us foreigners to learn abt samurais. Staff would not leave you alone but to give you explanation of the exhibits and history. We can also put on the samurai armours and enjoy the demonstration. Highly recommended!"
        }, 
        {
            "index": 172, 
            "rating": "4", 
            "review": "Small museum. Small display of Samurai objects from armour and swords.\nThere is a Samurai demonstration offered at selected times during the day which is well worth catching. The exhibition we saw was performed by Mr Hattori who was excellent."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Hidden Gem. The Samurai Museum is awesome. The staff is super friendly and informative and you basically get a private docent. They put on a great Samurai demonstration. The gift shop is great; we purchased a sword replica and they shipped it for us. The Samurai armor clearly demonstrates the inspiration for Star Wars."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Interesting!. We liked the Samurai Museum. However, we did not know that guided tours were available and only stumbled on one half way through. The guide was really good!"
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Must visit.. You should visit this place, you will get a guide that Tells you about the artifacts and about the history of samurai. You can also buy sword and t-shirt etc."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Worth it. It was nice, i kept on getting there later on at night. They close at 9pm. And there are shows earlier during the day. So I had toCome back the next day to get in there earlier. And it's behind the red light district area so don't get distracted. But once you get there, you'll learn a lot. And as many other people said, you get to do hands on!"
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Great museum. Loved the samurai show. Staff were excellent! Highly recommend!. The samurai museum was great to visit. Especially when you are learning all about the culture. What really made the museum was the staff. They walked us around different exhibits and explained everything. Thank you so much!"
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Must see . The entrance fee was worth every Yen! For a privately owned museum, not only was the display rich and diverse, the Samurai exhibition was amazing! They even had a private tour guide to explain the rich Samurai history. We would like to make special mention of Shu (I hope I spelled it right), who really did a splendid job of explaining and making us visitors more interested in the rich culture."
        }, 
        {
            "index": 179, 
            "rating": "4", 
            "review": "Nice place. great place to visit and see the samurai swords and armours but need improvement on history and presentation . I like the show though..."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Small but mighty museum. A lot of samurai artifacts in this small museum. The best part was the gentleman that provided the guide service (no extra charge). Not sure if he was the owner or what, but he knew his stuff.. very interesting. Also at the end there was a samurai demonstration. You must go here."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Wonderful museum-highly recommend. This was a highlight of our trip to Tokyo. Our tour guide was so informative and made our visit so pleasant! We had many children in our group and our kind docent made the stories so interesting, and answered all of the children's questions. The samurai museum was extremely organized by period, so you are able to follow the history, then shop at the nice gift store at the end of the tour. Everyone enjoyed this very much and it was interesting for all ages! We met the owner and he was so kind to everyone. We can't wait to receive our samurai sword that we had shipped to our home! Thank you to everyone at the Samurai Museum. We will never forget our pleasant visit!"
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "A Hidden Gem. Not the easiest to find, but find it and you will not regret it. Make sure you request a guide to take you through the small but very thorough museum. Our guide spent over an hour taking us through Japan's history and its relation to the Samurai - a very personable man, who took his time to articulate everything in a way that us lazy westerners could understand (My Japanese is very very limited) using Google to help explain or answer some of our questions. I also had the opportunity to learn basic Samurai skills by a man trained in the ways of the Samurai. Our initial reaction was that the price was expensive compared to other tourists spots (Ueno Zoo for example), but it was worth every penny. Great museum, supported by an enthusiastic staff with genuine knowledge and history of the subject matter."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Cool experience!. Had fun visiting with my husband. There is a tour guide to explain this small museum's exhibits. At the end of the tour they provide kimonos for men and women to take photographs. Would definitely recommend it !"
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Cool place to visit. Small museum very much worth a visit for an hour or two. The staff are knowledgeable and have good humour and the displays are very impressive"
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Felt like Tom Cruise in the last samurai. There is so much to see when your in Tokyo, the sights, the culture, the history, so on and so forth. Beauty at every corner. As we planned our Japan trip, I came across the museum and wanted to take some time to visit it.The museum did not disappoint, it is not expensive, it's not very large, and doesn't take a lot of time. There is so much knowledge and history at the museum, as you go through the museum one of the friendly staff members walks with you and explains to you the various samurai gear and history behind the swords. The gentleman that was with us, was very knowledgeable, was a great experience.At the end of the tour, you get to dress up, hold some weapons and feel like your a samurai.Take the time, make sure this is one of your stops. You wont come across any other samurai artifacts or history while your in tokyo. Where else you going to hold a samurai sword?"
        }, 
        {
            "index": 186, 
            "rating": "4", 
            "review": "Beautiful suits of armour. Really great place to visit. The staff are polite. Knowlegable staff who speak descent english. They are polite and eager to educate. Fun for all ages. Small and easy to walk through. The picture posing in gear was fun. Easy to find. A bit pricey at 1800¥."
        }, 
        {
            "index": 187, 
            "rating": "4", 
            "review": "Worth taking the time to visit. theres plenty to see and do in Shinjuku and this is worth taking an hour out to visit. Its quite a small place but the staff are very knowledgeable and keen to explain the history of the exhibits. Theres a twice daily demo of sword techniques with chances to interact at the end."
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "A must go for samurai lovers. This place is in the famous area of Shinjuku so just stop by when you go there. You pay for enternace fee then you go inside for personal tour with a japanese guide. There is a samurai show every 1 hour and the staff will tell you if you wana watch it. You can try several samurai helmets and clothes. the musem is small and can take 2 hours most"
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Interesting little museum . A small but very interesting museum. Cost is 1800 yen but you get a guided tour in English. I had a blast and learnt a few things"
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Tokyo gem. After almost a week of a wonderful experience in Tokyo, we stumbled across this museum. It's amazing, small, super interesting and everyone there was kind and helpful, all our questions were answered and there was a free guide throughout the museum. At the end, there's a Samurai show, interactive and entertaining. We have a very active and energetic 3 year old and a teenage daughter, we all had the best of times. The gift shop was well stocked, with lots of accessible presents to take home. This will be a fantastic memory. We don't usually write reviews, but this was such a fab experience we could not, not write a review."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Amazing artefacts and staff. We spent over 2 hours here even though it's a small place.\nThe staff were lovely and very attentive, We always had a staff with us explaining what we were looking at. The live show was also great.\nThe souvenir shop was affordable and great postage service internationally.\nHighly recommended."
        }, 
        {
            "index": 192, 
            "rating": "4", 
            "review": "A take part experience. As well as walking the museum your fee will give you a sword demonstration and allow you to try on part of a uniform. At the end of the sword demonstration, the audience can take part and learn the moves with a wooden sword. The museum itself is quite small but still impressive, the staff will talk you through the exhibits and answer any questions. Be prepared to take off your shoes and possibly to sit crossed legged for the show."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Great experience for adults and children. Small but excellent new, modern museum. English speaking private tours and great written descriptions throughout museum. My kids loved it (especially 7 year old son) and we all enjoyed dressing up in kimonos and samurai clothing for pictures at the end. Far exceeded my expectations!"
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "Museum of Armor and Weapons. In the heart of the sleazier section of Shinjuku (Host Bars to the left and right) is this unexpected treat. One of the pricer museums around (¥1800), its staff tries very hard to explain the pieces on display. We were followed by a nice guide who knew enough English to help us understand the armor, the weapons, and some of the people that used them in Japanese history. There are some authentic pieces, and a few reproductions. A nice addition was an actor who demonstrated a few moves with a katana sword. All in all, a nice break (with good air conditioning!) from the pressing masses outside. Nothing extravagant or jaw dropping...but worth your time."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Great place for the family. Our family had a great visit to the museum. While not being a huge museum it was very informative and the guide had a lot of knowledge on the history behind the artifacts on display. All the staff were very accommodating to my 4 and 2 year olds and we got lots of photos dressed in the traditional garments. The display by the Bushido practitioner was good too. On leaving my 2 kids got a plastic samurai sword each from one of the staff members and they loved it."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "A little bit of history . Its quite a small museum but great i loved it the history. They have some really old pieces in there collection.We got to dress up in the traditional gear which was cool. The guide walked us around explaining about the pieces.We found a discount coupon in one of the travel guides. Make sure to pick some of them up they had discounts for quite a few places."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "I love this place - don't expect too much. The group have really crafted an excellent experience that is simple and easy to navigate. The staff speak English and are friendly and enjoy sharing their knowledge. They had a display with a samuri in training who had amazing sword skills and a guide who would answer even the most esoteric questions. It was cute, quaint but well organised and you could dress up as a warrior or in a kimono - son loved it.."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Fantastic place. Fantastic place for people, who are interested in samurai history. The owner is the guide and he allowed touch some things from exhibition. It's amazing! when you hold in your hand original Katana."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Samurai Goodness. Was a very cool experience. Owner is very nice, and my tour guide was also the bomb, he even showed me a great ramen spot to eat at afterwards. The armors are great and they have a good variety. The weapons were also equally as impressive. Will definitely be back. We were even able to try some of the helmets on! If you're going to be in Tokyo and want a taste of culture, this is the spot to go."
        }, 
        {
            "index": 200, 
            "rating": "4", 
            "review": "Really enjoyed it . Cool museum, bit small but with free personal guided tour, well worth a visit. Especially the sword demonstration is very Cool."
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "Interesting if you are into samurai or weapons/armor. I really enjoyed seeing the old samurai suits of armor and weapons, but what really made this trip fun for me was the sword kata demonstration. An experienced swordsman demonstrates the different sword stances and attack forms used by samurai in the olden days. It was really cool to get a live demonstration with a real samurai sword!"
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Fun and educational experience. This museum was close to my hotel so I thought I'd visit it as it seemed different to the standard temples and nightlife that had filled my itinerary. If you are interesting in history then this is a cool way to spend a couple of hours. The armour and swords are impressive and we were lucky enough to be able to try on the armour and take a photo free of charge (500 Yen normally). I would recommend this experience if you want something unique."
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "Impressive collection and fantastic guides. This museum is largely the personal collection of the owner. It's always wonderful to see people share these treasures with the world.They have a several sets of armor that cover a large set of history, as well as other swords and helmets. There was a guide who walked me through personally and explained the time periods and significance of what I was seeing. It was great.This isn't a large museum, but it's worth a stop. It takes about an hour, and you can put on a replica samurai helmet and see a demo of the sword handling. Each group was walked through individually and then guided to the demo. There were some kids in there who really liked that part (though it was funny to watch them cover their ears when the performer yelled with each stroke)."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Great!. Staff was very nice and spoke English. They took the time to show me through everything. I will be coming back."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "A Gem in Kabukicho. Oh this was just great. Authentic Samurai armor and gear mainly from the Edo period. There were some other cool artifacts like guns and horse gear. This is such a great addition to Kabukicho and the gift shop sells some awesome stuff. I mean it's the best gift shop ever."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Must see for Samurai devotees. My family and I visited the Museum in April 2016. The museum is somewhat difficult to find. We did need to ask for directions. Once there we were fortunate enough to see a live show. An actor displayed some of the stances and fighting techniques of the samurai. We were then able to look closely at the amour and swords in the various rooms. The attendants were on hand to answer questions and allowed us to try on the helmets and amour. They added a more personal touch. My 2 kids who weren't really into samurai seemed to also enjoy this experience. One disappointment though was the gift shop. Unless you were going to purchase a replica sword there wasn't much on offer. I would have thought an English book on swords or some sword key rings would have been good to have. Overall I would defiantly recommend this to anyone who is interested in samurai."
        }, 
        {
            "index": 207, 
            "rating": "4", 
            "review": "One of the. My two friends and I had a great time here. As university students on a budget, it was more expensive than most of the other admissions I had to pay this trip, but it was also one of the best experiences. Between the samurai show, seeing old equipment and dressing up with replicas, this place certainly packs a punch despite its somewhat small size. The dim lighting can make it difficult to take pictures, but fortunately some areas are specifically created for taking pictures when you try things on.Additionally, our tour guide was very enthusiastic and friendly. Once we completed the museum we spoke with the owner for close to an hour. He definitely takes a very personal interest in the museum and was polite and friendly as well.All in all, the visit lasted several hours and was worth every minute of it."
        }, 
        {
            "index": 208, 
            "rating": "4", 
            "review": "Interesting and friendly. We felt very welcome, and our tour guide was good in english and funny. Took totaly about 2 hours with the samurai show (included in the fee, wich was 1800y) The museum contains in smal rooms, the air is a bit bad, or filled with inscents. You have to take of your shoes on the second floor, and mind your head. A great visit on a rainy day!"
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Brilliant!!. Brilliant!! Unlike most museums a member of staff will guide you through each item in the museum and explains the history behind it. They will let you touch some of the items and get a photo with it too.There is also a sword demonstration every hour, at the end of which you can get a lesson.Very reasonably priced and worth every yen"
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Small but worth it. We took our 14 year old son, had a guide for the 3 of us and really enjoyed the museum. It's not very big but the guides do a great job of explaining the different swords & armour from the periods."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "Small but worth it.. It's a small place but the guides are excellent. Definitely try on the armour and try and catch the sword demonstration."
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "Rich culture. This was only a last minute decision to go to the museum, but now glad we did. What an eye opener to history and things I never knew about. Good to see such passion in informing people."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Great museum. We found this place hard to find but when we did it was worth it. We got treated to a free private tour with a guide who, although didn't speak perfect English, tried his best to be as informative as possible.They were also kind enough to offer us a photoshoot for free, so my husband got to dress up as a samurai and I a princess, great fun! When they learnt we were on our honeymoon, they gave us a gift too! Really can't fault their service and hospitality."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Great experience. The staff is very friendly and explain everything . they let you try on the samurai clothes and take pictures. The armor on display are amazing. Recommend to go!"
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Very nice, recommended! :D. The museum has a very nice interior with tatami and nicely arranged swords and armors. We got a informative and nicely done tour and could even take pictures with samurai fashioned clothes :D We recommend to see the sword drawing show, it's been impressive! Also the staff was very friendly and helpful, thanks for the great experience!"
        }, 
        {
            "index": 216, 
            "rating": "4", 
            "review": "interesting authentic place. interesting authentic place for those who are interested in Japan's history, the history of the samurai"
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Best hands-on museum in Tokyo!. Great exhibit of Samurai armor, swords, and culture including live demonstrations of samurai sword fighting techniques and the ability to try out swords and armor! Definitely worth the visit and happy to come back again with my son. Now if they could open up a ninja museum too, i would be in heaven!"
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Awesome samurai fight display and friendly staff. This was a highpoint of our trip to Tokyo. We arrived just in time to see the samurai sword fight display and it was awesome. The staff is really friendly and most of them have good and understandable english. Make sure you get a guided tour! We were shown around by a very nice young man and he told us about the different armors and swords and answered our questions. We got to try on some helmets and took pictures dressed in traditional samurai clothes. The ticket price might seem high but if you get the guided tour and see the sword fight display it is worth it. I loved all of it and will highly recommend it to anyone with even just a slight interrest in history and samurai."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Great experience. Very nice staff. great experience. you can try Samurai customs and watch Sumurai fighting styles. highly recommend to Tokyo travellers"
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Cool display of Samurai fighting technique!. The museum had both armor and swords used from 400 years ago with some armor even having wear and dents from battles. The display of the weaponry was amazing and included guns used during the samurai era. To top it all off, you see an amazing performance of a modern samurai who has undergone decades of training and get to interact with him afterwards asking anything you want! Really great museum with an extremely hospitalable staff who works there to guide and answer any questions!"
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Amazing museum!!. This place is fantastic, one of the best things we did in Japan. The guides are happy to wander with you if you would like explanation, or let you go to wander around yourself.A lot of the exhibits are authentic pieces, even with an 800 year old sword on display. It really is an amazing collection of artifacts.The guides also speak pretty good English.Photography definitely allowed and encouraged.Dress-ups are a good laugh too!Do yourself a favor and visit!"
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Great service staff, awesome Samurai swordplay. Initially me and a group of friends were wondering if we should go in, but it turned out to be the best thing ever! I got to try out wielding a sword and it was really fun. It's not a huge museum, but it's cosy and you get personal tours by the staffs there if you ask them, and they are really nice. The Samurai swordplay is really cool! Was really intense and awesome to see the actor wielding it right before my eyes. You should definitely visit it, just for fun and to know more about SAMURAIS!"
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Wonderful!!. Me and my friends've been there at the right time of Samurai show starting and it was really great! Besides exhibition is really interesting. They arranged Samurai armours, swords, paintings etc. by the timeline of Japanese history so we know more about history. Staff are really nice and can speak English fluently."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Definitely a must see if you're going to Tokyo! . If you are even relatively interested in Japan's samurai culture, I highly recommend you visit. The Japanese are known to be hospitable and helpful, but this place goes over and above the norm. Staff will eagerly give you a guided tour of the place, explaining what each piece is and whose armor is on display, will give brief histories of battles painted on the walls and even how famous the generals. If you already know the names: Nobunaga Oda, Ieyasu Tokugawa, Yukimura Sanada, Shingen Takeda, Kenshin Uesugi, Kanetsugu Naoe, Masamune Date and Hideyoshi Toyotomi, then you're in for a treat, you can find amazing replicas of their armors here. The guides also do their best in explaining everything in English, to the best of their ability of course, and they're pretty good English speakers compared to a lot of locals. The ticket is even good for a return visit so you can watch their live Samurai show and ask questions! I personally came back to the museum myself, and it is totally worth the walk. If you can speak Japanese like myself, then you're in for a treat because then you'll find out really how well the staff members know their stuff. They know more about the history than those of the samurai on display, and you can even trade stories about your favorite samurai and theirs. They also know a lot about the history of the warring states period such as Oichi being the most beautiful in the land, and contrary to some media, that she didn't actually fight in any battles with a toy or battle hoops. I closing, I would say definitely check this place out because of how well the museum treats it's guests, how knowledgeable the staff are, and how beautiful the things on display are. You can even touch some of them!"
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Amazing. This place is amazing. Learning about the history of the samurai and you are able to take pictures here. The tour guide was great. The place lets you put some of the samurai head armor on."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "On of the best museum. Amazing place, with museum tour you can try armors and weapons, the show at the end is amazing seat on the front for sensations."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "いいミュージアムです!!. you can see and known all about samurai history at this nice museum!!! if you lucky you can see \"samurai show\" recomended place in tokyo !"
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Wonderfull.. 素晴らしいSubarashī!While not as large as the edo museum if you love museums, ancient Japanese culture - history and or all thing's samurai related this is a must. Quality not quantity is the key and the staff are polite, helpful and just amazing. Some speak a little English.It's suitable for the whole family although is also open late. please ask your hotel for directions as some taxi drivers and senior locals will not help. They do not wish spent send people to an adult-entertainment and bar area although I have seen many family's their during the day and like London's Soho it's not as bad as it once was. It's pretty safe during the day and Japan's police have since cleared up the area. There's also plenty of other charming non adult attractions there. most x rated stuff is well shielded away. I can't say it enough the staff here and superb and helped me out with a problem recently. there's an opportunity for free photo's in replica samurai gear and there's a samurai actor who does a great performance. Go there it's worth it."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Unique visit. Great little private museum dedicated to samurais and their history. Tours by passionate and friendly guides who are more than happy to answer any questions."
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "Fantastic museum with personal tour guide. I can't speak highly enough of this museum! Our guide Su had a great knowledge of everything in the museum, the demonstration was fun and interesting and it was a lot more than I was expecting from a personal collection of artefacts. If you love history and getting absorbed into a story then go along to this little gem of a museum."
        }, 
        {
            "index": 231, 
            "rating": "4", 
            "review": "Interesting. This is a cozy interesting museum, with passionate staff and owners who will try to explain the details behind each armour. It's quite pricey, but the exposition is nice."
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Fascinating Collection. A beautiful museum with great insight into Japanese ancient samurai culture. It has only been open 6 months but already seems to display a large range of attractions for a small private museum. Suits a range of ages, from kids to adults.They have a great private tour guide who is very informative about all the exhibits. Many of the second floor exhibits (such as helmets and face masks) you can try on and take photos. The highlight was the real samurai sword technique demonstration."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Amazing tour guide went above and beyond. The tour guide was amazing, so nice and informative - really made the experience amazing. Awesome swords, armour, muskets, a sword show, and got to dress up in traditional style costumes. Highly recommend!!!"
        }, 
        {
            "index": 234, 
            "rating": "4", 
            "review": "small museum but worth a visit. charming little museum, great opportunity to admire the Samurai Armor in close distance and in details. can get a chance to dress up as a Samurai to take a photo with your own camera. many nice souvenirs to buy at the ground floor shop as well, worth the visit."
        }, 
        {
            "index": 235, 
            "rating": "3", 
            "review": "Did I just walk through red light district?. We were using google maps to find this place and I think it is located in the red light district or something. There were posters with half naked people and signs with things like Love Room or massage posters of women in thongs. I couldn't explain to my daughter why 6 or so men were on a board naked with there private parts covers. So awkward. Anyway, the museum is quite small but my husband loved looking at all the different armor and swords and guns. We were on a tight time schedule but stayed for the samurai show. I expected more. I didn't expect to be in a room that was so quiet you could literally hear a pin drop. The show was basically a samurai doing different poses with a sword. Slow movements and maybe only two words which were \"hai\" screamed loudly. It was neat to see but way to long for it being that slow."
        }, 
        {
            "index": 236, 
            "rating": "4", 
            "review": "Small museum complete with swordplay demonstration. Like the title says. A bit touristy and on the small side, but I spent a wonderful hour in there. That might be due in part to my passion for all things samurai-related. If this is not something which interests you, but still want to look at some armours and weapons, I still recommend going, but I advise keeping your expectations low. There are regular demonstrations by an actor / katana master which are short and sweet."
        }, 
        {
            "index": 237, 
            "rating": "3", 
            "review": "Mixed feelings.. I had mixed feelings about it -- I am naturally skeptical of everything and the number of things that seemed like replicas, particularly the canvases and artwork, felt a bit off. We had a young lady give us a guided tour, but she seemed to only be able to stick to her script and wasn't really able to field most of the questions we had. Maybe it was a language thing, but I'm not so sure. The whole thing felt a bit amateur, so Samurai Museum is probably a generous term. Even so, we got to try on some \"authentic\" -- dubious, but whatever -- samurai gear, hold a katana, and watch a short demonstration by a modern samurai of the different stances. Worth the price of the cheap admission."
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "Small Secret in Shinjuku. Not a huge museum...basically the Owner of this place managed to retrieve loads of Genuine Samurai Antiques...2 floors to be precise..The staff are friendly and knowledgeable. The best part is that u get to wear the samurai gear... highly recommended.."
        }, 
        {
            "index": 239, 
            "rating": "5", 
            "review": "Very cool and authentic display . It's a small and neat museum with about an hour stay. 2 floors of original (and some even more than 400 years old!) samurai swords, armor and clothes. You get a guided tour included in the 1,800 yens, and get to wear some armor and try a cool helmet."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "A Great Experience. It was a rather small museum but still a great experience. You can take photos of all the armor. On the second floor, you get to see more armor, helmets, and swords. Side note: you have to take off your shoes on second floor, so wear some comfortable socks. I enjoyed having a guide tell us about the history behind certain pieces. Also make sure to stay for the samurai sword shows. You can take pictures of the guy as he poses with samurai sword before doing a little show, roughly 15 minutes. I also got a mini samurai to take home from the gift shop. Overall an experience you don't want to miss."
        }, 
        {
            "index": 241, 
            "rating": "3", 
            "review": "Something different . My partner loves Samurai history, so after a long search for this museum as its not easy to find, we expected more historical and advanced insight to the samurai. Although it was small and had serval intimate rooms to view up close the original tools, swords and armour: the guide lacked knowledge beyond average so was unable to answer any of my partners questions. The show seemed like a good idea and was what sold the ticket to the museum to us as its quiet expensive. The man who performed didn't mention any history, or explain his motions. He just performed slow movements like fighting stances for almost an hour which got a little tiring if I'm honest. We were expecting friendly sparing between two samurai fighters in armour or something more informative. Although we were pleased we had at least found it after our search and did enjoy seeing the display, not recommended unless you have knowledgeable interest into the samurai and money to burn."
        }, 
        {
            "index": 242, 
            "rating": "4", 
            "review": "Great museum with a free guide. The museum is centrally located and easy to find just off the main streets. After paying to go inside we were joined by a guide who took us around the museum and explained all of the items to us. I didn't expect this and it was free of charge which I thought was great and the guide was very informative. In the gift shop you can but a Samurai sword and have it shipped back home - I did this and it arrived a few weeks after me. Its a great souvenir and you can track the delivery online. Please be aware that shipping will cost just under what the sword did and when it gets to customs (UK) you will pay £30 to have it released due to taxes.Overall this museum is well worth a visit and great value."
        }, 
        {
            "index": 243, 
            "rating": "4", 
            "review": "Great Museum. This museum is a great way to see Armour and Swords of the Samurai. The guided tour is great and is a good way to ensure that people know what the several artefacts are about. The samurai display show at 2, 3 and 4pm are worth seeing so I recommend that you plan to visit around these times. You will only need 30 mins for the guided tour part and then around 15 mins for the show. The entrance price may appear to be on the high side but remember that you are supporting the display of the owner's private collection and not some big business. Worth the visit if you are interested in Samurai and some history of Japan."
        }, 
        {
            "index": 244, 
            "rating": "3", 
            "review": "Quaint little museum but lacks information. The staff were friendly and accommodating; they did their best to explain exhibits in English although the information they provided was limited. On the 2nd floor, you are even allowed to touch and put on some of the exhibits to take pictures with. There's also a little photo corner where you can dress up as well. However, their collection is rather small and the information on the plaques regarding each exhibit was not very informative. Unless you already have a general knowledge of the Sengoku period, you wouldn't actually understand much. The 2nd floor has a small section for the Bakumatsu but again, there was not much information that explained who Sakamoto Ryoma is and what he did, or much on the Shinsengumi. It would not take long to go through this museum but overall still worth a visit."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Fascinating little museum. Visited here with my 12 yr old daughter and 10 yr old son. The museum is quite small, but the exhibits are genuine and quite fascinating. Plenty of really helpful staff around to provide some explanation and background to the various pieces on display. Lots to interact with too, with helmets and robes to try on and posed photos to take. We also had a sword drawing and form demonstration from a sword master with Q&A afterwards. One of the highlights for my kids in our short stay in Shinjuku."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Excellent museum. Insightful.. I thought that this museum might be a bit hammy but I was wrong! They have original weapons and armour as well as excellent modern reproductions made in a traditional way with genuine materials. It is tastefully displayed. The best thing is that you are personally conducted through the facility by a genuinely knowledgeable guide who speaks perfect english and really brings the Samurai, their life-style, and detailed history to life. Open in the evening. Has special options including calligraphy lessons with an expert and photo sessions where you can don the Samurai outfit."
        }, 
        {
            "index": 247, 
            "rating": "4", 
            "review": "My kids loved it!. I was the least interested in visiting this museum out of everyone in my family, but I was very pleasantly surprised. My kids enjoyed the Samurai demonstration and being able to try on helmets and clothing. It was a little pricey as we there less than 2 hours, but it was a truly unique Japanese experience."
        }, 
        {
            "index": 248, 
            "rating": "4", 
            "review": "charming little museum. quite small but charming, you can stay as long as you want to looking into the details of Samurai armors, you are allow to take photos but not videos, worth a visit, you can dress up to take a photo with your own camera free of charge."
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Very informative and fun experience.. After looking at Tripadvisor, we decided to visit this museum. I'm so glad we did!We went at around 7:30/8 pm, and used Google Maps to find it down a side street in Shinjuku. We found it we only a few other visitors, and were fortunate to have an extremely knowledgeable guide who explained so much history to us. His stories actually provided context to some of the other tourist attractions we visited around Tokyo (e.g. Meiji Shrine in Harajuku). We also had some much fun dressing in the traditional costumes! Our guide took our photo for us, and he did a great job. Many other reviews say it doesn't take that long to go around, but if you have the right guide and patience to read all the displays, then it takes about an hour to see everything. I definitely recommend you visit this museum!"
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Tokyo highlight. This is a small and inconspicuous museum in the heart of Shinjuku. It's not cheap but is worth every yen. The guides are good and very well-informed but, if you can take the tour with the owner you will have a fascinating experience. Don't miss this."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Samurai history comes alive!. This small gem of.museum is located in what appears to be a typical Japanese house. There are English speaking guides who escort you around the two small floors, and several times each afternoon a Japanese actor who often portrays a Samurai warrior gives a 15 minute demonstration. All exhibits also feature extensive, multi-lingual signage (including English).The museum is a welcome distraction from the glitz and glitter of modern Tokyo, and provides some insight into the importance that the Samurai played in ancient Japanese history. Numerous displays of Samurai armor, most of it genuine, as well as swords and other components of Samurai culture are also displayed.There are some interesting and different items for sale in the small gift shop as well as authentic antique swords for sale (you do have to ask about them).Anyone even remotely interested in Japanese history and culture should make this new museum a must!"
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Fantastic palce to visit.. Didn't know what to expect as we went to visit on impulse.The staff were very friendly and informative with many superb exhibits.When we went upstairs we were greeted by the owner who was a lovely old gentleman.He was very passionate about his collection and was very interesting to talk to.He even opened some of the locked cases, took out helmets and rifles and allowed me to handle them.What other museum would ever do that?Thoroughly enjoyed our visit and if you are in the area I would say give it a visit and see some fantastic exhibits."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Small museum but worth a visit. Spent about hour and a half at the museum. Small museum with a small shop. We didn't stay for the demonstration of sword use but we were told by staff our tickets was valid if we wanted to come back later that day to see it. Very interesting and informative. Staff will use your camera so you can get photos of you beside the displays. Also get a chance to try on some outfits with staff using your camera and taking photos of your experience. Would recommend this museum."
        }, 
        {
            "index": 254, 
            "rating": "4", 
            "review": "Great little gem. Great little evening excursion, really interesting and staff were exceptionally friendly and helpful. We were show around by a lovely chap who told us about the history and importance if the pieces in the museum. It's not a massive museum and for around $20 aud maybe a little on the $$$ side, but the tour and dress up at the end were lots of fun."
        }, 
        {
            "index": 255, 
            "rating": "4", 
            "review": "Recommend.. Recommend. A bit expensive. Staff is kind and gentle. There is animation and is ok for children above 5."
        }, 
        {
            "index": 256, 
            "rating": "3", 
            "review": "Not what we expected. . This is a very small collection. We thought it was quite expensive for what it was. We saw stayed for the show which was average."
        }, 
        {
            "index": 257, 
            "rating": "5", 
            "review": "Couldn't be better. This is the example of how a museum not necessarily need to be huge to be great.Very back to basics and the essences of the content, this Samurai Museum will take you to the medieval Japan, will explain and briefly show you the various examples of armoires that real Samurais wore at the time, as well as the weaponry.Me an my family really enjoy the experience, the staff very professional, friends and helpful, they look after us and my one your kid offering use a premium assistance, perhaps my Kia was so excited.The best part is when you are allow to wears the armor and take some shots with it, including a katana non-sharpened replica.Arigato gosaimasu, we really love it."
        }, 
        {
            "index": 258, 
            "rating": "4", 
            "review": "Quaint little museum. There were a few different displays but you should know that it is not big. A guide walks through the exhibits with you and tells stories and explanations in relatively good english. Most of the displays look like they are replicas but still cool to see up close."
        }, 
        {
            "index": 259, 
            "rating": "3", 
            "review": "Not for people on a budget. The exhibition is beautiful, albeit limited. The sections are separated, so you have a very private feeling when you receive the guidance. Also, the photo opportunities are a nice touch, when to you get the chance to pose as Samurai after all.Unfortunately, the information on the placards is very limited and the guide didn't add much to it. His English was sufficient and he was nice young lad, but I didn't get a lot of overview of the Samurai culture and history. I am history buff though, so my standards probably are very high in that regard.Did not get to see a sword show on a Sunday night. Perhaps it would be good to post a comprehensive list of the included items at the ticket.If you are in the area and your budget isn't tight, you can't to wrong. If you love samurai culture and want to see some items up close it is also a good spot. Otherwise there is Samurai items in the Tokyo museum, that probably will be enough for you. For me it was OK but overpriced. I'd rather have comprehensive placards and a lower price than a personal tour.The Samurai swords in the shop looked pretty cool though and they ship them now."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Well worth a visit. We loved this place. After getting off the subway we wondered slightly where we'd ended up as the area seemed a little seedy but after a short walk we found the Samurai Museum. The staff were very welcoming and friendly. They gave my son a mini samurai sword toy to keep him happy and have us additional information on all of the displays in English. The museum itself is quite small but very interesting to see and my husband much enjoyed taking part learning the samurai moves and also dressing up. I'd definitely recommend it."
        }, 
        {
            "index": 261, 
            "rating": "4", 
            "review": "A smaller museum, but a great attraction. I visited this museum during the first week of April, and was quite impressed by the thorough knowledge of the staff. Our guide spoke English very well and really helped bring this interesting aspect of history to life. The samurai demonstration was outstanding, and I was lucky enough to be allowed to help demonstrate some of the poses along with the expert. The photo op at the end of the tour is worth the wait. A most enjoyable visit - not cheap, but worth the money for the experience."
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Terrific.. We loved our visit to the museum. It is small, but the staff are great and the show was informative. We had a lot of fun trying on the costumes and posing with the swords."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Great place to visit. well, the place is small but full of knowledge, costumes, Swords, Guns...etc specially their mini show is great. audience can ask question after the show and practice with real Samurai man!!!"
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "Nice detour from Shinjuku. This part of town is very young and happening but this museum is a nice change of pace. The building itself is not very large but it contains several historic samurai body dressings and associated weaponry. When I visited there was a guide who spoke English and explained things in the different rooms upstairs with regards to Japanese history and the context of the things you were looking at. Additionally, the free samurai performance was impressive and had an English translation. Overall, if you are interested in this portion of Japanese history I would definitely recommend. The price is a little high considering the size of the museum but there is a lot of interesting things to see and learn."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Absolutely worth it. . We went in to see what sort of armour they had on display and were amazed to find original sets, as well as weapons. Everything is displayed beautifully. The staff are incredibly nice and our guide was very passionate about the pieces. We had to leave early, but we will be back! Do this."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Worth a Visit. Great Place, We were lucky enough to get a tour by from the curator. Defiantly a must see! when in Tokyo."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Great hour spent learning about samurais!. We spent about an hour at this museum. We got to try on the samurai head gear and watch a katana demonstration by a professional actor who has been studying it for 10 years. The contents of the museum were beautiful and the information surrounding the samurais was very interesting. I highly recommend this museum."
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Well worth a lool. It's a very small place and you can pretty much see it all in about 30 minutes but it is definitely worth a visit. So glad that we came across this place."
        }, 
        {
            "index": 269, 
            "rating": "4", 
            "review": "Great for a rainy day. Small but interesting enough. Our kids enjoyed this with the samurai skills demonstration plus the chance to dress up. Highly recommended ."
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "Worth the visit!. It was very informative getting to know different types of samurai living throughout in ancient Japan. My husband got a chance to put on the samurai face guard! You'll definitely benefit from it if you get a guided tour! You'll get a change to take pictures of yourself wearing prince/princess with accessories. Not taken by profession but it was good enough (:"
        }, 
        {
            "index": 271, 
            "rating": "5", 
            "review": "Small, quality museum. Some will scoff at the ¥1800 admission but I found it well worth it. Our courteous tour guide allowed us to browse the exhibits at our leisure and introduced each display only when he noticed we were ready for the next one. The exhibits were all well laid out with a room holding a handful of artifacts with descriptions. Some were lacking in more detailed information and that's when our guide graciously provided some background. The displays themselves were of very high quality and definitely gave you a sense of the power, fear and respect each of the wearers'/wielders' garnered. One of the highlights is definitely being given the opportunity to wear a genuine general's helmet, faceplate and a sword. It really gave you a sense of the weight of it and how strong they would have to be to wear the entire ensemble. The sword demonstration held multiple times a day was also very entertaining and luckily if you happen to just miss one you can come back and see the next as long as you present your ticket. The small gift shop had some replica swords (which I admittedly was tempted by) for what seemed like a reasonable ¥6000-7000. Make sure you take into consideration the shipping and customs fees which a sign indicates the staff will help you sort out. I highly recommend this museum if you have an even passing interest in samurai history (and cool armour and weapons)."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Excellent place . Great small museum. Used google map to locate this beauty or otherwise it will be bit hard to find . The staff was really friendly and they gave us a guided tour explained what exhibits were all about . You can even try out samurai helmet and a carry sword and take pictures . They also had this show case by a apprentice samurai which was cool . So ask the ticket counter the time of that performance."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Compact, but packed with incredible items and a great staff. This museum is small and is somewhat out of place compared to its neighbors (massage parlors, etc.) but once you find it itll make the experience worth it.The place is small, but has many interesting items. To be honest, I think the friendliest, most knowledgeable and most enthusiastic staff is this museums.I also got to see a katana demonstration, very cool. If you are in Shinjuku or around and like Samurais or culture, this is a great way to spend a couple of hours."
        }, 
        {
            "index": 274, 
            "rating": "4", 
            "review": "If you like to know more about samurais . Yeah first thing it's not obvious to find. We passed it 3 times. It's opposite some gorilla sign post. Ok so the museum is pretty much what you expect, paintings, armour, swords, etc. It's abit short and small but you get to play semi dress up"
        }, 
        {
            "index": 275, 
            "rating": "4", 
            "review": "Great staff. It's a rather small museum. But the staff is really friendly and took time to explain all showed pieces. Even had the chance to try on a replica of a samurai uniform."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Great experience!. Opens at 10:30, and was taken around the museum by one of the guides named So who was fantastic! He was very knowledgable, spoke English very well and made the experience very interesting and fun!!"
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Samurai Museum in Shinjuku. It's a small museum in Shinjuku. Easy to locate with Google maps.Entrance fee is 1800 yen per person The samurai museum is really good you can find artifacts such as old helmets, old swords and old guns and you can see the samurai show.The staff was really helpful, knowledgable, passionate and frien."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "very interesting.. The samurai museum is really good with interesting artifacts such as old helmets, old swords and old guns and more that were very interesting and old.The staff was really kind to us and our guide took time to explain the stuff and even brought us to the train station, which was really nice of him.overall, its a really nice place to have a look at for about an hour!"
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Samurai museum in Shinjuku is a must visit. Samurai museum was a great experience for our family (6 adult and 2 children). We were guided by an english speaking man whi did his best to explain the history and the meaning of all those swords and armours. The real samurai show was amazing. He did kinda \"samurai kata\" and we could ask questions and take pictures. Even getting dressed as an samurai was free of charge. Mr. Tetsuro-san who is the owner is the kindest person and showed us very good service. This place feels relaxing and intimate. A must visit when you are in Tokyo."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Immerse in rich history. Immerse yourself with the rich history that Japan has to offer - particularly in the world of the Samurai.This museum isn't very big but it is full of amazing artifacts including armor that dates back to over 400 years ago. The Samurai armor and weapons are kept in perfect condition and presented beautifully - you can also get right up and close to them to see every intricate detail that was put into the crafting of these artifacts which should be classed as art!The experience at the museum was enhanced as the guide allowed us to wear a real samurai helmet and hold a katana for photos - really giving us a feel of what it was like to be wearing the armor.Very rich in history and conveniently located in the middle of Shinjuku - in my books this place is not to be missed if you love history."
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "Fun museum!. We were there about a month after opening. The staff really took the time to explain items and history. They clearly want to share Samurai culture with visitors. Some replicas and some authentic Samurai uniforms and weapons. Enjoyed the museum."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Educational and entertaining.. Lots of original costumes and weaponry on display with knowledgeable and friendly staff to explain the exibits."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Worth having a look. Recently just opened so I can understand that there isn't much artefacts to look at, but worth having a peek. We were in and out within 20 mins. Staff were friendly and the atmosphere was chilled. Me and my girlfriend really enjoyed the little samurai performance, kind of scared her a bit. Hopefully in our return the museum will be expanded with plenty more to look at."
        }, 
        {
            "index": 284, 
            "rating": "2", 
            "review": "Over-rated and Overpriced . This was a pretty big let down. I thought there would be more of a collection. All the Samurai armor seemed not genuine, or I guess seemed replica. They do have some cool guns and some swords. A museum this size should cost 1000 yen max, not 1800. You can see everything in the museum in about 10-15 minutes."
        }, 
        {
            "index": 285, 
            "rating": "4", 
            "review": "Try on a Samurai helmet. It was worth the visit, but may a bit expensive. I enjoyed the exhibition and found the staff extremely helpful. The saving grace for this place is trying on a Samurai Helmet and posing for pictures while my wife was in a kimono and I was on a partial samurai kit."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Great way to spend an hour or two. Very interesting museum with an excellent collection of Samurai swords and dress. The tour guide is extremely knowledgable, passionate and friendly. This is highly recommended, even for those not necessarily interested in museums or Samurai history; it is just a great way to get a feel for Japanese culture and a fascinating era in it's history."
        }, 
        {
            "index": 287, 
            "rating": "5", 
            "review": "Great little museum brings samurai to life. Great little museum with a number of ancient artefacts. We had a young woman who took us round the museum and explained a lot of the history. There was also a demonstration of a ritual with a sword. After the demonstration they offer you the chance to get up and try. I volunteered and it was great fun wielding a sword. Overall well worth a visit."
        }, 
        {
            "index": 288, 
            "rating": "4", 
            "review": "Small but still Decent. My partner and I went in January, so being off-season there wasn't many people there. The staff there are very friendly and they do have differing levels of English. It is quite a small museum, which require you to take off your shoes in the second section, but it's well worth seeing all the different armours and how the clothing developed and hair style developed through the years. We tried to take our time to see all the different things, but we were probably out the museum within 45mins. I'm sure some people did it less than 10. Mainly because it's not that big and there could perhaps be more information of some of the samurais. However unlike may other places in Japan, you can try on the Samurai clothing, kimonos along with any props for free. The staff were also very willing to take photos of us,If you have some spare time and are in the area, I do recommend visiting."
        }, 
        {
            "index": 289, 
            "rating": "4", 
            "review": "No family discounts. It is nice but small. You go with a guide and get some information on the history of Japan. Possibility to dress up as a samurai for a picture. Only negative is the price for 4: 7200 yen is a bit too much (but no tip for the guide expected)"
        }, 
        {
            "index": 290, 
            "rating": "3", 
            "review": "Small and highly over rated. This is a tiny two floor museum in a house in the bar district. It is not easy to find.Entrance fee is 1800 yen ($16 USD)The guides try their best but their English is limited.We are a martial arts family with over 50 years training between us and we were not overly impressed.If you want to waste half an hour and some money, go for a visit but I imagine that there are much better exhibits at local museums"
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Where history is brought alive. It's a small museum in Shinjuku. Easy to locate with Google maps. The entrance fee is Y1800 per person and well worth it. During our time there, there was a young Japanese guide who explained the first few rooms to us. My fifteen-year-old gets easily bored at museums, but even he was enthralled by the guide and how he brought the samurai history to life. The owner himself in the last room where he explained the history of the samurai right up to the \"last samurai\". The exhibits themselves are amazing. Many are not replicas but the real thing. It was a wet day outside. But inside, we were in the world of samurai."
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "Well worth it. Was a definite highlight of the whole trip. Not like a boring museum. Just a private collection of amazing original armours and weapons. A must see."
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "Small but worth a visit. The staff were very helpful and informative. They clearly care about the history of Samurai and enjoyed telling us about the various items on show, yet it didn't feel like they were following around or pestering us.If you're interested in Samurai, it's worth a good look."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "I'm totally a Samurai now.. Got to put on the Samurai armor and swing swords around. Worth every penny! Cool neighborhood to stroll through as well."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Samurai museum Tokyo. Well worth a look. Staff are extremely helpful and informative. You. Can really get close to the exhibits."
        }, 
        {
            "index": 296, 
            "rating": "4", 
            "review": "A highlight of our trip!. My fiance and I went to this museum toward the end of our 3 week trip and it was fantastic! Definitely a highlight for us. The museum is situated in the Golden Gai, very easy to miss but not difficult to find if you have GPS (don't even need data, your phone should still update location without data). We were one of the first people to enter the museum that day and were lucky enough to score ourselves a guided tour with Gin. He was very friendly and explained the history behind each exhibit. We had many questions and he was able to answer almost all of them! We would have missed a lot of things without a guided tour so very glad they offered this service, without request or at an extra fee!There are a few exhibits that you are allowed to touch and some pieces that you are allowed to try on, which was awesome! We were allowed to dress up in some traditional robes without the 500 yen fee as the museum was very quiet and not many other guests were there. There was also a live show which we were too early for, but as long as you keep your admission ticket, you can return later in the day to watch it.A great place to learn a bit about Japan history, very lovely experience to cap off our trip. We even met the owner when we were browsing the souvenir store. My fiance bought a replica katana and the owner told us the history of the samurai that held the sword. I would definitely recommend a visit to this museum if you're interested in Japanese history!!"
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "2007 and 2015 Visits. I visited the museum in 2007 and 2015; while the exhibits have changed, the quality does not. It's a niche audience and if you're willing to take a trip off the beaten path in Tokyo to visit, it's worth it for a view of Master level swordsmiths."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Authentic experience for samurai enthusiasts . I found this place on trip advisor and found out it had only been open for about 4-6 weeks before my visit and you could tell as everything felt quite fresh within the museum. The entrance is beautiful with a mini creek/stone steps sort of setting. It was a little quiet the day I went so I was able to be walked around the museum by one of the staff members who was an absolute legend. Explained everything about the weapons, armor, history of the Warriors and samurai. I can't recommend this place enough!!!"
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "Awesome. For being in a strange part of shinjuku, this museum is a must see. Great tour, learnt alot, some amazing historical artifacts.Highly recommended"
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "Fantastic info, really great guide. Recommended to anyone. We were guided by the owner of the museum, he speaks enough English to get all the message through and he has a wealth of knowledge about Japanese history and Samurai. Both my girlfriend and I thoroughly enjoyed the visit."
        }, 
        {
            "index": 301, 
            "rating": "4", 
            "review": "Cool. Me and my partner got there late and we just expecting to walk around on our own but we got a friendly guide who showed us about, it's not massive but some really cool exhibits definitely worth a visit"
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "Great guide, great information!. We absolutely loved our time at this quaint museum! Our guide, gim, was very helpful and highly informative. He walked us through all the types of samurai attire as well as the swords and a brief history of japanese emporers and the samurai reign. We were allowed to wear traditional japanese attire as well and the whole experience surpassed our expectations. We highly recommend people check this place out"
        }, 
        {
            "index": 303, 
            "rating": "4", 
            "review": "Fun little \"museum\" . We went there based on the the tripadvisor reviews we read before and it was definitely worthwhile to go.It is a small museum in the entertainment area of Shinjuku area. Just to walk around the area of the museum is already worth the trip!The museum itself is small and spread via two floors. You will need about 30 minutes to one hour to get through it. A personal guide will follow you around. I think they do this also for security reasons. The guide we had did not had much of a clue, but a guide from another group we saw seemed pretty knowledgeable. A lot of the displays are reproductions and only a few are real! However it is still worthwhile to look at everything as also the reproductions are very beautiful and nicely made.I would also not really call it a museum, but more a private samurai entertainment museum. This is because of the limited actual original objects on display. The way the guide goes around and interacts with you. The shows they do and the fact that you can try on some masks to take pictures and the professional photo studio area with different costumes and backdrops and the big shop at the end.Nevertheless a nice little fun place to visit especially, if you are in that area of Tokyo anyway."
        }, 
        {
            "index": 304, 
            "rating": "3", 
            "review": "Worst guide ever !!. The museum is not impressive but worth a visit. The exhibits include original as well as replicas of Samurai armoury, katana swords and other accessories. It’s rather small and would have been a much nicer experience if there was a proper guide. Before I paid for my ticket I asked the young lady at the ticket booth if they had an “audio guide” – by which I meant a pre-recorded narrative of the museum on headphones. I like this system because they are usually very well made, the content is legitimate, recorded in proper English and you can pace it at your own rhythm. The audio guides at the Edo Museum are very well made. The girl confirmed that they had audio guides so I paid for my ticket. There was no “audio guide” … she was my “audio guide” and began to escort me around the museum. I immediately realised that she was not well informed. I asked her about the katana sword because I had seen a documentary and I knew that the katanas are traditionally made from a specialised Japanese. I could not remember the name of the steel … but she had no clue. Later I looked it up; it’s tamahagane steel. On the second floor I noticed that there were several references to The Siege of Osaka so I was curious and asked her what it was. She didn’t know!! So my recommendation for visitors is that you read about the Samurai before you to the museum so that you can appreciate the experience. My recommendation to the museum: invest in an “audio guide” system with a professional commentary. Alternatively – get qualified guides."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "Very cool . My husband and I really enjoyed the museum, we both found it very enjoyable and the staff are awesome! The staff are very knowledgable and the show with the swordsman was very interactive. After the swordsman show hang around as you can dress up and take a photo (for free). The samurai museum is only a short walk from the train station and is located near the robot restaurant.Tip - don't get conned by the people in the streets offering you good drinking deals or good places to go."
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Experience the history and passion for the Samurai. We just loved this Museum, the original costumes date back as far as 800 years old, costumes that would otherwise be considered family treasure. The staff are really passionate about the Samurai and all speak quite good English, they're dedicated in explaining the history of the Samurai. We really enjoyed the interactive sword show and dressing up for a photo, I was a blonde Japanese princess :)There's a small entry fee that was well worth the personal tour received. The gift shop had it's own treasures and my favourite souvenir from Japan is a Samurai inspired umbrella that I purchased here."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Intimate, interactive & informative. The Samurai Museum was definitely a highlight for me when visiting Shinjuku. The staff are extremely friendly and can speak English. Staff would go out of their way to explain exhibits to us and even let us try on some of the head gear and hold swords. At the end they let you dress up and take photos as a samurai. They let us tale our own photos as well!I definitely recommend this museum, even though it may appear to be small we spent over an hour there."
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "Whole lot of fun & super informative !!!. The samurai museum ticked all the right boxes, great way to gain some history and insight into the past lives of Japanese warriors. - easy to find (use Google maps and follow the directions ) look out for the white sign - the displays show information in multiple languages- they allow you to take photos of the displays- you can try on replications which look, weigh and feel like the real thing - if possible, you are assigned a tour guide who goes through each of the periods and displays. They also can answer many questions about the samurais, wars and periods Mostly the staff are super helpful and kind. When they were closing up, one offered to guide us to our next destination in Shinjuku !! Won't forget this experience anytime soon, a MUST for any samurai lover !!! "
        }, 
        {
            "index": 309, 
            "rating": "5", 
            "review": "Pleasantly Surprised . Prior to entering I wasn't expecting much. Then I wasn't that keen on the entry fee. All that went way once inside. We saw the Samurai 'show' on positions/stances. It was atmospheric and at the end very interactive. Had a blast playing with the swords. After that you can take a photo in costume. We also had a very enthusiastic and informative guided tour of the displays. Would definitely recommend you check if out if in Shinjuku."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Interesting and informative. Great little museum, packed with authentic traditional samurai wear. The guide was interesting and provided great information. As a bonus, you get to try on some samurai gear which is pretty fun. It is a small museum so it won't take long to get around."
        }, 
        {
            "index": 311, 
            "rating": "4", 
            "review": "Worth it . We found the museum hard to find but the displays inside were definitely interesting to see and worth the time we spent. Also gives you a good chance to walk around the Shinjuku area of Tokyo"
        }, 
        {
            "index": 312, 
            "rating": "5", 
            "review": "Was good . Really good museum, a bit small but had lots of information. Gin (or Gim not sure) was packed for of information in fluent English, would definitely recommend it."
        }, 
        {
            "index": 313, 
            "rating": "3", 
            "review": "Should come if you like samurai or having a long holiday in Tokyo. The ticket was a little expensive. The museum was a little small. But the guide can speak English fluently, introduce very enthusiatically. And the visitor can try the Samurai's clothes."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "Fantastic experience. The museum isn't big but they have so much inside, the staff are fantastic, walking you through and describing the details. Samurai show was brilliant and at the end you can have some pics with him."
        }, 
        {
            "index": 315, 
            "rating": "4", 
            "review": "A great introduction to the life of the samurai. It's a small museum and whilst the exhibits are very well presented they are small in number. What makes the visit worth while is if you visit in the afternoon in time for one of the samurai (Akaido) demonstrations that take place on the hour at 2pm, 3pm and 4pm. Interesting, great fun and inspect some audience participation! The samurai uniforms on display are quite amazing. The shop has a small range and if you want a souvenir to take home such as a replica samurai sword you won't be disappointed. Certainly worth a visit."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Great time with the family!. It is nice place to visit if you are interested about the story of samurai in Japan. Our guide was pretty awesome, he even let all of us try on a real samurai helmet. We had a great time and took lots of pictures as welI. I really recommend you to stay for the show by a professional samurai actor!"
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "Samurai Museum in Shinjuku. Tetsuro (the owner) was very knowledgeable, patient and friendly he gave me a guided tour of the museum. Came in around late evening cost was 1500 Yen. Was awesome to learn and understand further about feudal Japan."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Excellent Museum. Amazing small museum, free demonstration and plenty of English speaking guides for information. Also able to try on a Samurai Helmet"
        }, 
        {
            "index": 319, 
            "rating": "4", 
            "review": "Intresting Museum, But Very Small. The price is a whopping 1,500 yen for a pretty small museum. The exhibits are very intresting, some of the original armor even has bullet holes and cuts from battle. There are a fair amount of reproductions as well though. The guides there were very friendly and informative as well. Overall, intresting to see if you have the money. If you think it is a little too high you are not missing too too much."
        }, 
        {
            "index": 320, 
            "rating": "5", 
            "review": "Worth a look! . Worth visiting if you have an interest in Samurai warriors. Some great original and re-created armour to look at, along with weapons and a terrific demonstration with samurai swords that really adds to the experience."
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "Must see. Small but really worth visiting. The best part was the ability to try on some samurai stuff and get some great pictures.\nThere is also a small but interesting souvenir shop."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Brilliant view of the shogunate. Incredible chance to get a more close up view of the shogunate history. I was lucky enough to take part in the samurai exhibition. As a history teacher I cannot fault the experience, and encourage everyone to go along."
        }, 
        {
            "index": 323, 
            "rating": "5", 
            "review": "a walkabout in the historic past of the fabled Samurai!. spectacular exhibit of Samurai equipment presented by the owner..he was very informative during the tour and was generous with his time and offered the opportunity to take photos with helmets and swords!"
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "Fun and informative. Lots of fun, we learnt a lot about samurai history, weapons, armour etc, and got to dress up. The staff take you around each display and answer questions very well. Good English too, so it was easy to communicate. Worth a trip"
        }, 
        {
            "index": 325, 
            "rating": "4", 
            "review": "Fun quick visit, get a guided tour. Small collection of original and replica items from samurai times. Geared toward foreign tourists with plenty of English, but you'll enjoy more with a guided tour. You can hear some stories and ask questions. 1500 yen admission. Love hotels right outside if samurai get you that excited.."
        }, 
        {
            "index": 326, 
            "rating": "4", 
            "review": "Very Good. Visited this museum because I had, for years, read about the Samurai and wanted to see what was on display.It is relatively new and it is worth booking a tour - rather than just turning up. If you book, you get a guided tour by a friendly staffer who speaks english and it gives you better insight into the displays.Certainly worth a visit"
        }, 
        {
            "index": 327, 
            "rating": "4", 
            "review": "Good little museum wit cool stuff and you can take pictures. A great place within some cool stuff, and you can dres op and take pictures and a great little souvenir shop, and very helpful staff who tells you what you need to know, cool place"
        }, 
        {
            "index": 328, 
            "rating": "5", 
            "review": "Wonderful and informative museum . We were extremely fortunate to have the owner / curator of the samurai collection show us through the displays. He treated us to a description of the displays, the history of each item and its use.We also got to try on some of the samurai attire and weapons which was brilliant! Highly recommended for a personal and informative tour about the Japanese Samurai history."
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "Collection and history - guided by a wonderful historian. Passionate staff/owner shared his wonderful insight into the history to accompany the displays. A wonderful collection enjoyed by all"
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "Jake. Displays where very good and staff where extremely friendly and knowledgeable, walked through the exhibit with me giving a guided tour for no extra cost. Worth a visit for sure."
        }, 
        {
            "index": 331, 
            "rating": "5", 
            "review": "An excellent experience. Small (about 45-90 minutes), you can touch some items. This museum is a great find. The neighborhood of kabuki-cho is fairly touristy and red light, but this is a high quality legitimate museum. It is not gimmicky at all. The collection is small and consists of samurai armor, weapons, and a few murals. Some of the items are authentic historical pieces ranging from 250-800 years old, and some of the items are reproductions or modern restorations. However, these are not low quality reproductions, they are artisan crafted and very well done. I actually enjoyed the reproductions greatly because you can touch, hold, and in some cases even wear the armor. It was a very immersive experience to feel the heft of several of the iron helmets. Our tour guide was the owner of the museum, and he gave a superb tour. He was knowledgeable and interesting, and his English was pretty good. Because we were interested, he got into a lot of the details of the methods of construction and the different styles and types of weapons and armor. Highly recommended."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Very enthusiastic staff and great pieces!. The museum has a great (albeit slightly small) collection and the staff were knowledgable and enthusiastic! After the tour you can dress up in the costume and take photos- well worth it!!"
        }, 
        {
            "index": 333, 
            "rating": "4", 
            "review": "Fun experience . Myself and my wife visited initially out of my interest for samurai swords we ended up staying for the interactive show which was fun and involved learning some samurai sword play .... a lot of armour and swords on display are repudiations still worth a visit alot 1500¥ is quite expensice entry fee"
        }, 
        {
            "index": 334, 
            "rating": "5", 
            "review": "Got to Wear a Mask and hold a sword. The staff were really helpful, telling us about the history and also dressing us up with traditional headdresses and allowing us to hold a Samurai sword.With a live act showing the way of the samurai by sword was a eye opener. Would definitely recommend it to others . A well worth the visit into the old culture ."
        }, 
        {
            "index": 335, 
            "rating": "5", 
            "review": "Awesome history, live sword fighting, very informative guide.. I would recommend this place. The guide was very nice and spoke good English. He took us first to the back room where we were given a fantastic sword fighting demonstration by a Master swordsman. The audience including myself also got to take a sword and be taught a few moves and poses. The tour guide then took us through all the different rooms explaining the swords, armour, history, etc of the Samurai. Very cool!"
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "My day at the museum. Heard about this place through my hotel. Went for a look as i love going to museums. Firstly, the walk down to the museum from the metro station is worth the trip. Shikuju is quirky and cool and entertaining in its own right. The museum was not large but has some really nice period and replica armour on display, along with period firearms and weapons. The owner and staff are what made it extra special though. I was guided through all the displays in person in english, and Provided with a knowledgeable and informative history lesson. There was a sword master demonstration while i was there which you were invited to participate in and you could try on some armour and garb. They also have replica katanas for sale in the gift shop if your country of origin will let you bring it home. All in all a great place to go. Picture taking of the displays is allowed"
        }, 
        {
            "index": 337, 
            "rating": "5", 
            "review": "Samurai-up close!. This small but excellent museum showcases armour, swords and other samurai related items such as bow & arrows. Explanations are in Japanese, English, Korean, etc. Friendly English speaking guides accompanied us throughout the exhibit, answering questions, giving good explanations and encouraging us to take photos and look at the displays up close. Some are reproductions however I've seen originals in the National Museum and those displays were quite uninspiring and sort of well, \"dead\" These make history come alive. Stays open late and the staff are outstanding-when we asked for a dinner recommendation, our guide insisted on showing us to a nearby place and sure enough, there was a line of locals waiting to eat tasty udon noodles. An excellent experience for anyone interested in history, the military, Samurai or weapons. PS You can dress up in period costume and have your picture taken."
        }, 
        {
            "index": 338, 
            "rating": "4", 
            "review": "Nice place to buy a replica.. Nice museum worth to see at low cost. You can even wear some of the clothes and take a picture. Unfortunately they're almost all replicas.They do have a shop with some good sword replicas, better prices than in Asakusa alleys."
        }, 
        {
            "index": 339, 
            "rating": "5", 
            "review": "One of the best places I've ever seen.. For real... You will definitely love this museum if you are into \"Sengoku Jidai\". Iaido demonstration was also great!"
        }, 
        {
            "index": 340, 
            "rating": "4", 
            "review": "Small, very interesting museum. Deep in history, the tour guide new his stuff. English was pretty good and willing to explain things. Interactive too. You can dress up in the gear and get photos and there are even a short show."
        }, 
        {
            "index": 341, 
            "rating": "4", 
            "review": "High quality small museum showcasing the Samurai. This is a good place to get a quick understanding of what it was the be a samurai. High quality displays are limited in number as are the English descriptions, so its wise to get a guide. You can be offered to put on the samurai mask and wield the sword for your photo. Worthwhile if you are in the area."
        }, 
        {
            "index": 342, 
            "rating": "4", 
            "review": "Must see if you are in Shinjuku. Very interesting, original 300-400+ years old armours swords guns etc, you can up dress up and put mask on, photos allowed, everything is translated in english korean etc, nice interior (brand new), enriching stories (private guide included), 1500 per adult, near Shinjuku station, expect 1h15 for the complete tour, gift shop."
        }, 
        {
            "index": 343, 
            "rating": "4", 
            "review": "Good little tourist spot. Very friendly accommodating staff even though their English wasn't the greatest we got a lot out of the experience. If you go, recommend to in the afternoon so you can watch the samurai demonstration. Some amazing authentic pieces from 100s of years ago."
        }, 
        {
            "index": 344, 
            "rating": "4", 
            "review": "Worth a visit if you are in the area, but not if you have totravel far or long to reach it.. Fairly small museum. Little info in English so ask for a giude. They are very knowleable and adds value to the experience."
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Very interesting little musuem. The Samurai Museum is unusual, being tucked away in Shinjuku among a lot of bars, nightclubs and other more noisy/adult kinds of attractions. The museum and its collection is small, perhaps because it only opened recently, but everything on display is fascinating and beautiful. Well organized displays, informative history, and extremely helpful museum staff made this a great experience. The staff were only too happy to walk with us through the site, answer all our questions, and even let us touch and pick up some of the artifacts!"
        }, 
        {
            "index": 346, 
            "rating": "4", 
            "review": "Super Samurai!. After reading about the museum on Trip Advisor we sought it out in the back streets of Shinjuku. While small, this was a great find with some interesting history about both Japan and the samurai. We had our own personal guide who was informative and entertaining. The demonstration of samurai technique was great and encouraged audience participation which made it more fun. My husband was even allowed to try on a samurai headpiece which was a highlight for him. Would definately recommend a visit."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "A Hidden Gem. This was excellent. Everyone received an in depth guided tour. There are outfits that you can touch, and some that you can try on and take your picture with. There are swords you can hold and pose with also. Even if you only have a passing interest in the Samurai - this is a must see. Our tour guide was incredible. He answered all of our questions and make the whole tour extremely interesting. Then when we were done (I was in the last group of the day), our tour guide showed me the way back to the train and showed the other group a great curry restaurant. All of us laughed, learned and had a great time.The gift shop is extremely well priced. Their replica Samurai swords are cheaper than the street shops and are better quality.You could go through the whole exhibit rather quick, but it was much more fun exploring and getting the in depth stories."
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Great tourist attraction in Tokyo.. We were very lucky to have the owner guide us around and give us so much information about the displays. We found this to be one of our Tokyo highlights."
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "Tons of fun, and lots of history!. My friend and I, both 18-year-old girls, came to the Samurai Museum on a whim after our plans for the day had been canceled. It ended up being one of our favorite experiences during our trip!We walked in, and we were greeted by a tour-guide, who to our surprise guided us through the entire museum in English! This was amazing, since my Japanese is very basic, and my friend speaks no Japanese at all, so we were both able to fully enjoy the exhibits and learn all the history behind each one. We spoke with two tour guides (I unfortunately did not get their name, ごめんなさいございます！), and they were extremely friendly and outgoing, and readily spoke to me in both English and Japanese (despite how bad it was)! We also stayed for the short Iaidō performance, which was very cool and worth the watch! Afterwards the martial artist took questions, and was also very energetic and friendly!Overall, this was one of the best experiences of our trip! If you're someone like me who has a passion for Japanese (especially samurai) history, if you enjoy certain pop culture media that references people like Tokugawa Ieyasu (Sengoku Basara, Basilisk) or the Shinsengumi (Gintama, Hakuouki, Peacemaker Kurogane), or if you're like my friend who is just being dragged along, you're sure to have fun!ホントにありがとうございます！楽しかったです！- Olivia (Massachusetts)"
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "A great Tokyo experience. This is THE place to go if you have an interest in Japanese history. Amazing displays of art and armor and weapons. Staff are very friendly and love helping out Foreigners. Go here then grab some Tendon to complete a great experience."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Really intersting!!!. I practiced the katana sword with a katana teacher, had a guided tour of the museum and I could put on a samurai helmet!! (Beware it's quite heavy btw). Great experience!!!"
        }, 
        {
            "index": 352, 
            "rating": "4", 
            "review": "Very interesting but not cheap. Museum includes a guide within the price so value is good but it is not a cheap option.\nIt is quite a small museum so visit only takes abolut an hour but it is very interesting. My 12 year old son loved it despite the lack of things to touch. It is not really geared to young kids."
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Worth your time. I have been to Japan many times however whenever I searched for a Samurai specific museum, I could not find one. All of a sudden this one shows up and I decide to go visit it. The staff is friendly, speak great english and are eager to teach you about the general history and specific armor and weapons they have at the museum. This place opened up just over 4 months ago and it is a personal collection. I would say you can spend a good hour or two here depending how interested you are listening to the guide who will also answer any of your questions. Some of the armor is over 400 years old and weapons 800+ years old. Definitely worth your visit if you are in Tokyo and are interested in the history of Samurai."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "Amazing staff . Went to the Samurai Museum at night, it is located near to the shinjuku JR station, about a 10 minute walk for those who are not familiar with the area. Once we entered we were greet with an extremely passionate bunch of staff, as we did not speak Japanese, the staff explained everything to us in English.The whole exhibit takes approximately 30 minutes to 1 hour to complete and entrance tickets for adults are 1,500 yen/pax. I have to highlight that they were very very passionate, and the displays gave me the feel that i was brought back to the edo period, I would give them 6 stars on tripadvisor if I could. "
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "Amazing and interesting. We had a private tour with a man that worked there named Ging. Offered us information for over an hour and told us all about the suits and armour and swords. He made it even more worthwhile, especially as we love Samurai history. Thank you Ging you are a very nice man and the museum was excellent."
        }, 
        {
            "index": 356, 
            "rating": "4", 
            "review": "Takes you back in time.. I enjoyed my visit to this museum and thank Tripadvisor for the reviews. It is a nice place to learn while seeing samurai armor and weapons. They even allow you to touch the armor and hold the sword. Replica swords are also sold. A family photo wearing armor for boys and kimono for girls is a nice souvenir (500 Yen only ). The entrance fee of 1,200 Yen is also reasonable. Highly recommended if you are in Tokyo with boys in the family."
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Great history great staff. Great little museum learnt a lot of history, be sure to stick around for the samurai show upstairs (remove your shoes) \"I saw people who didn't\" show was quite interesting and answered everyone's questions very well, the owner gave my friend and I a private tour and told us all the history of his collection piece by piece, Really great guy and all other staff were very respectful and always smiling which I was happy to see,"
        }, 
        {
            "index": 358, 
            "rating": "3", 
            "review": "Interesting, reasonable value, but one hour is plenty of time. Interesting, reasonable value, but one hour is plenty of time. Some of the suits are really interesting, and it is worth a visit but don't lock it in as a major event."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Personal tour, small but interesting. Really enjoyed this. It is a relatively small collection but long enough to enjoy an hour or more here. Great for kids. I have a 16 and 14 year old and they really enjoyed the personalised tour we were given and trying on some samurai armour at the end. Run by an absolutely charming Japanese man."
        }, 
        {
            "index": 360, 
            "rating": "4", 
            "review": "Samurai museum step into Japan culture! . Went with 8 friends so a very large group to cater for in most of these places in Tokyo (most of the buildings being small) First thing was that it was kind of difficult to find, it's in the middle of an alleyway off the Main Street 3 or 4 blocks away from the closet train centre BUT! It would have been easier to find if we had thought to write down directions before we left as we haven't bought any SIM cards. The price was ¥1500 which I consider very well priced for the service provided. The first 30 or so minutes was spent walking around the rooms of the two story museum with a guide (all of the staff members spoke very very good English!) telling us seriously fascinating information about Japanese history and culture. During the guided tour, one person from our group was able to put on a helmet and mask and take photos (seriously amazing experience) Then we were able to watch a lovely demonstration of a samurai who had been training for 10 years, model a fight with a sword. After the display (about 5 minutes) he invited people from the crowd (which was only our group of 9 and one other couple) up to go through the movements with him. Very funny and entertaining. There was then a questions section where we would ask questions then they would ask us questions about the differences in our culture ect (very engaging and fun!) Then the souvenir shop where the prices were great! Full replica samurai swords from ¥7000-19000 and detailed models for about ¥2500.All in all a great experience for traditional Japanese culture, very interesting and enjoyable and most importantly affordable!!"
        }, 
        {
            "index": 361, 
            "rating": "4", 
            "review": "Amazing Museum To Visit. An amazing museum to learn about samurai. The display was well presented with English translation. The staff able to converse in English. So we are able to converse with them. We got a private tour and the staff explain each and every exhibit. We meet the owner of the museum who also came and give some explanation of some of the exhibit. You would get to see samurai armour and weapon. There are also costumes, replica armour and weapon that you can dress up and take photos. But do go during the day as there are lots of \"adult\" entertainment shops in that area."
        }, 
        {
            "index": 362, 
            "rating": "4", 
            "review": "Fascinating . Small museum but definitely not run of the mill. Very interesting and kept the hubby on a high for a few hours!"
        }, 
        {
            "index": 363, 
            "rating": "4", 
            "review": "Ok. But the area around it looks dodgy. . This place was actually quite good. Some authentic old samurai armour, weapons & paraphernalia, and some replica armour as well nice sword demonstration. Friendly staff. And the obligatory gift shop. Worth the visit but come during the day & don't leave too late, especially with young kids. The area is full of \"adult\" type shops & entertainment."
        }, 
        {
            "index": 364, 
            "rating": "5", 
            "review": "Amazing museum. We arrived and there was no one else in the museum. We were given a private tour and learnt all about the history of the Sumari and the costume.learnt about the different weapons and how Japan became westernize. We were there for about 1.5 hrs. Our 4 yr asked so many questions and was fasinated by it all. We got to dress up and take as mant photos as we liked. This truly a mustin Shinjuku and so easy to find"
        }, 
        {
            "index": 365, 
            "rating": "4", 
            "review": "Interesting displays but a bit small . The displays was well presented with English translations and the staff provided a free tour. There was a free show involving a gentlemen pretending to be a samurai and answering questions. There was a chance to hold a sword and try on armour for an additional ¥500. However it was a fair bit smaller than expected and wouldn't take more that about 45 minutes to see everything."
        }, 
        {
            "index": 366, 
            "rating": "4", 
            "review": "Great for a short visit on a cold night. We arrived at the museum to find it nearly empty, and the owner/manager started offering us a private tour. After a few others arrived, he offered to let us see a show even though one was not scheduled for this time. The show itself was short, and although not exhilarating by any means, it was interesting. There are a few interesting things to look at as well, and you are encouraged to touch the samurai armour and take photos. We spent maybe an hour here total and this was definitely enough to take in all the museum had to offer."
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "Great cultural experience!. Awesome samurai performance. Everyone spoke good english. After the show there was a tour and we got to meet the owner and he explained samurai culture and history in great detail. Will recomend to everyone, will be back before i go to buy a sword."
        }, 
        {
            "index": 368, 
            "rating": "5", 
            "review": "A must see for the history buff!. We were in Shinjuko on business but had one day to relax and decided to see if there was anything within walking distance that was worth a visit. My husband is a huge history buff and absolutely loved the one on one attention they gave us explaining each and every piece and answering all of our questions. Very intimate atmosphere with an extremely dedicated staff. Highly recommend to anyone wanting to learn the Samurai history."
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "Great Samurai History. Visited this Museum as it is located just behind the Hotel Gracery Godzilla! Staff are friendly and helpful. The owner leads the tour and explains the history of the Samurai and Japan. Speaks good English. This was a welcome break from a vacation trip that everyone should experience. Authentic and very old Samurai exhibits, very impressive. One will come away from this museum googling and reading up on the Samurai!"
        }, 
        {
            "index": 370, 
            "rating": "5", 
            "review": "“Must see ”. It has two floors and can't be a bit hard to find but if you give the address to a taxi your good.. On the whole a nice break from all the shopping ."
        }, 
        {
            "index": 371, 
            "rating": "4", 
            "review": "Great place to visit. Only small however very interesting.Staff were great and super friendly.Some of the items date back to over 700 years ago.They even have a Samurai dress up area so you can get a genuine photo with Samurai Helmut,sword etc.Really recommend and it's just down the street from the Gracery Hotel."
        }, 
        {
            "index": 372, 
            "rating": "5", 
            "review": "Authentic Samurai Museum. This is difficult to find if you just have a map. You need to follow the english landmarks unless you can read Japanese.Amazing experience. Worth a trip to Shinjuku just to see some of the authentic samurai gear and highly crafted replicas as well as Samurai swords dating back up to 800 years old. Cool place, museum is set up like a dojo, plenty to see worth the 1500 yen. A nice topper to my Tokyo weekend. Also can dress up as a samurai and don an expensive samurai helmet replica and katana for a nice selfie souvineir."
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Great Mesuem. Great Museum! Staff spoke great English and was extra friendly, making sure we learned some history during our visit!"
        }, 
        {
            "index": 374, 
            "rating": "4", 
            "review": "Hidden gem in Kabukicho. Not easy to find but once you do, you won't regret it. Small but it has a good selection. And make sure you watch the show as well. Try on the clothes and practice with the master"
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "Nice little museum.. Nestled in the heart of Shinjuku, a nice cosy museum to visit. Very dedicate staff who really made you feel welcome . The onsite samurai katana display was impressive. On the whole a nice break from all the shopping ."
        }, 
        {
            "index": 376, 
            "rating": "5", 
            "review": "Must see . I loved this museum. It has two floors and can't be a bit hard to find but if you give the address to a taxi your good. It shows you the info in english and they have so many great facts. The staff is tremendous and they give you a tour and break everything down to you. You have to visit this museum. This really was the one museum I was looking forward too."
        }, 
        {
            "index": 377, 
            "rating": "5", 
            "review": "Cultural. I recommend stopping by this place on your first day in Tokyo. Collection overall was fair , there were some good vibes in a few of the rooms. The helmets were nice , and souvenir wise - you can pick up a few things for a relatively fair price . The best part for the oldies is definitely the photo op with your choice of a few ensembles at the end. PS > The team is excellent !"
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "Great Visit. We visited this museum since we wanted to learn basic facts about the Samurai warriors and culture. The museum is new and has signs in English. What we loved the most was the hospitality of the owner, as well as his enthusiasm. We dressed up as Samurai and had free pictures taken. Great visit. Would definitely recommend."
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "The best choice of my trip!!. This is a totally unexpected experience that I found such a great place to visit. Though it's located in the alley, its display and guidance was absolutely worth the time. The museum curator explained the history thoroughly and has been very patient to answer all the questions. I strongly recommend this museum to anyone who wants to visit Tokyo. You will not regret it!!"
        }, 
        {
            "index": 380, 
            "rating": "5", 
            "review": "Very Interesting!. I had some time available last week while in Japan and decided to visit the Samurai Museum, which was close to my hotel in Shinjuku. What a wonderful find!I thoroughly enjoyed the info provided by the curator, who was clearly passionate about its history and provided as much or as little as one desired. As a history buff, I learned so much. As noted, it isn't very large, but it was well worth the time and I highly recommend it."
        }, 
        {
            "index": 381, 
            "rating": "5", 
            "review": "Interesting and enjoyable . We found this little museum so interesting and really enjoyed it's peaceful atmosphere and friendly staff. We even got to play dress ups with some of the samurai helmets and other traditional clothing - loved it! Would definitely recommend a visit."
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "Small but amazing! . Costs 1500¥ to get in but the collection is pretty good. A lot of original pieces and a few copies that they let you touch and wear."
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "Must Visit!!! . Fun and very educational! Guide is very friendly and kind. Very interactive-- we had the chance to wear the samurai helmet. Once in a lifetime experience. Awesome museum! :)"
        }, 
        {
            "index": 384, 
            "rating": "5", 
            "review": "Samurai wow... what an amazing find!. This museum is put together by a curator who is the collector, and guide. The details, and care to explain made this experience amazing. To see 400+ year old, authentic Samuari items is a special treat. To have the collector wxplain any question, is like a personal tour. This is one stop you must make when in Tokyo, it is well worth it."
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "Fun & Interesting. My group ended up here because we received a discount coupon at our hotel (¥1300 as opposed to ¥1500). We were so glad that we did! There's a good mix of authentic and replica armor. A decent collection of swords and guns for such a small museum. Beautiful lighting for the displays. The staff is helpful and fun. At the end of the tour they provided many fun photo opportunities."
        }, 
        {
            "index": 386, 
            "rating": "5", 
            "review": "Must visit. Period.. You will be distracted by all the bright lights in shinjuku, but ignore the noise and come here. It's unassuming but once you come inside you'll be treated like royalty with personal assistance and tour. The place provides an excellent assortment of genuine samurai gear AND you will have some sweet photo opportunities."
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "Unmissable – Awesome visit. Visita Impresionante e Imprescindible!!!Queríamos complementar nuestro viaje a Tokio con la visita a este museo donde poder ver armaduras, vestidos y espadas tradicionales japonesas, todo un viaje en el tiempo.Fue fácil de encontrar y el personal increíblemente amable, atento y servicial, incluso el dueño Sr. Tetsuro-san nos guio por su museo dándonos muy interesantes explicaciones de las piezas expuestas así como de la historia de Japón. Como gran colofón final, se pueden hacer fotos vestidos con réplicas de armaduras y espadas!!! Qué bonito recuerdo tenemos!!! No dejen de visitar este museo, merece mucho la pena!!! Una de las mejores experiencias en nuestro viaje a Japon.Unmissable – Awesome visitWe wanted to finish our trip to Tokyo with a visit to this museum where we could see traditional Japanese armors, suits and swords… a trip to the past.It was easy to find and the personnel was extraordinarily kind and helpful, even the owner, Mr. Tetsuro-san who kindly guided us through his museum, giving us very interesting insight in the story behind the different pieces in the museum as well as Japan’s history and life.The cherry on the top… you can have your picture taken wearing the samurai armor, sword, etc.. What a sweet memories!!Do not miss to visit this museum, it worth it!!! It was one of the best memories of our trip to Japan."
        }, 
        {
            "index": 388, 
            "rating": "4", 
            "review": "Fun and interesting experience . My family of 3 children from 9 to 16 thoroughly enjoyed ourselves in this little museum which is so nondescript on the exterior. The staff are attentive and even though they may not speak very fluent English, they try their very best to explain."
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "Delightful Experience. The Samurai Museum is quite small, their a few displays which would be disappointing to most, but what makes the experience is the passion of the museum curator. You can really tell he loves his work, he gave us a personal tour through the museum, explaining the history behind each piece. He is very knowledgeable and answered every question."
        }, 
        {
            "index": 390, 
            "rating": "4", 
            "review": "Enjoyable Samurai Museum. Visited Samurai Museum with my Junior and young boys. We were amazed at the beautiful displays. Glad to have the owner/curator who walked through with us and explained the history. He is very knowledgeable and appreciated his patience & attention given to my boy's queries. Do not miss the chance to play dress up on the 2nd floor. We had a great time here and my boys loved it a lot!"
        }, 
        {
            "index": 391, 
            "rating": "5", 
            "review": "An enjoyable, peaceful tour of beautiful Samurai artifacts. This was an amazing discovery right in the Shinjuku area - I was so glad to find it! Everything in the museum is beautifully presented, with evident love and respect. I went early in the day, and was fortunate enough to have the owner/curator personally walk me through the museum. He spoke good English and generously took the time to answer my questions and explain the items, their history and significance to me as we moved through the exhibits. Unlike the city museums, you have plenty of time and space to examine this amazing Samurai exhibit and take photos in a nice, quiet setting which I really appreciated. On the way out, the small gift shop also has some nice items to pick up as souvenirs and help further support the museum. I really enjoyed my visit to the Samurai Museum and would highly recommend it to anyone with an interest in Samurai-era artifacts, especially if you would enjoy seeing these items in a peaceful setting without being rushed through by crowds like at the noisy big museums. Very interesting and enjoyable!"
        }, 
        {
            "index": 392, 
            "rating": "4", 
            "review": "Delightful little museum, worth a look. Thankfully we'd looked up things to do in the area because I doubt we'd have found this little gem just by wandering around. It's down a little side street in Shinjuku prefecture close to our hotel (Citadines Central) and could so easily be missed. In fact we walked past it twice before we realised it was what we were looking for.Not huge but very well done with good explanations of each exhibit. This place is great for a little cultural history, and the owners are more than pleased to walk with you and explain if you have questions. They are clearly very proud of their museum and with good reason, it's small but informative, and you'll even get the chance to play dress up and have your pic taken if you're of a mind to do so. It doesn't seem to get very busy - we were the only visitors at the time but I preferred the lack of crowds if I'm honest.Entry fee wasn't expensive, and there's a little gift area at the end. You'll need a couple hours max if you like to read everything."
        }, 
        {
            "index": 393, 
            "rating": "5", 
            "review": "Great Museum. We visited this museum a few days ago. We couldn't find the museum and a person on the street came to our aid and called them directly. To our astonishment they sent a staff member to guide us to the museum. The customer service was exceptional from start to finish. We received a guided tour of the museum and it was very informative and entertaining. It was one of the highlights of our trip."
        }, 
        {
            "index": 394, 
            "rating": "5", 
            "review": "Provides a great insight into the Samurai aspect of Japanese culture and history. All the displays are beautiful and instructive, the museum reveals the Japanese soul and it removed all my notions about the Samurai, especially the notions acquired in movies!!!"
        }, 
        {
            "index": 395, 
            "rating": "5", 
            "review": "Amazing museum. Excellent little museum. Loved the simple layout and effective lighting that showed the display pieces really well. The staff were very knowledgable about the exhibits and were great at giving additional bits of information. It's great to see such a museum in Japan as there really aren't many that are dedicated to this interesting period in the countries history"
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "Amazing. Do not hesitate to visit this place if 1) you are interested in Samurai 2) you do not feel like spending half a day in a museum with large amounts of other tourists 3) want to support the local and very knowledgeable owner who personally provides you with a tour. The place does not really fit into the area but that only made it more charming for us"
        }, 
        {
            "index": 397, 
            "rating": "5", 
            "review": "So much passion.. You have heard of afficiandio, you know conngduur, you have to experience this passion. I knew very little about the subject matter going in, maybe watched The Last Samuri years ago. I knew it was fiction, this place set me straight."
        }, 
        {
            "index": 398, 
            "rating": "5", 
            "review": "Lovely Staff!. Really cool little museum. There was a nice lady who showed us around and she even let us take photos with the samurai gear for free (there was a sign that read 1 photo = ¥500)!"
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "A must see for anyone who likes swords and samurais. A great collection of armors, swords and artifacts. The hosts are even better, they're very friendly and let us do cosplay with armor and replica katanas."
        }, 
        {
            "index": 400, 
            "rating": "5", 
            "review": "Must see if you are interested in Samurai History. The owners are great and friendly. They will try their best to explain their exhibits. very nice showcase and display in small tatami rooms. picture taking is allowed and entrance fee for adults is 1500 yen."
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "Best Museum in Tokyo . This museum was great from the very beginning. The staff was super friendly and the very well informed manager took me around the whole museum like it was a personal tour. He was soo knowledgable and answered all the questions I had about samurai. The displays are outstanding as well with well preserved relics from samurai past all looking marvelous under perfectly dimmed lights. There is also the chance to touch actual samurai masks and helmets which was simply amazing. Los of photo oops including a chance to take your photo wearing traditional samurai outfit. Don't miss this great place."
        }, 
        {
            "index": 402, 
            "rating": "5", 
            "review": "Awesome . The staff is super nice and helpful. Almost personalized guidance.It's small but you can see some really nice replicas and also original material from hundreds of years ago. 100% recommended!"
        }, 
        {
            "index": 403, 
            "rating": "5", 
            "review": "Superb and beautiful boutique museum. My teenage son and I visited with only two other people in the museum, so it was just like a private viewing. The staff are super friendly and the owner is very passionate about his collection. He gave us a guided tour and even let my son try on a helmet from the exhibition. A beautiful gem of a museum, small enough to do in an hour and a half but impressive enough to give you an insight into samurai armour, weapons and lifestyle. This had to be one of my favourite places in Tokyo to visit. A must see!"
        }, 
        {
            "index": 404, 
            "rating": "4", 
            "review": "Small and compact with intriguing exhibits. I had this small museum to myself the day I visited and enjoyed the great variety of samurai armour and weaponry. Most of the exhibits are replicas, naturally enough, but they are beautifully executed. The staff were very friendly and helpful, and the owner spoke good English. The perfect place to spend half an hour or so getting to know a fascinating aspect of Japanese history."
        }, 
        {
            "index": 405, 
            "rating": "5", 
            "review": "Best thing to see in Tokyo! . I went here not knowing what to expect. It was really interesting! The owner was very nice and showed me the exhibits. This museum is two levels. I think the upstairs was added recently! The old gun collection is pretty incredible. Front of musuem is easily marked. There are some brief English translations on plaques. I wish there were dates on them as everything is pretty impressive! However the staff can tell you..."
        }, 
        {
            "index": 406, 
            "rating": "4", 
            "review": "Small but perfectly formed!. Desperately attempting to do some educational stuff with my 14 year old manga and gaming son, I saw the reviews for this place. He wasn't that keen but as soon as we got inside that changed. The atmosphere is really peaceful and the use of Incense transports you immediately. The samurai armour on display are a combination of authentic (hundreds of years old) and (amazing) replicas. The arms and swords are real works of art, even though I don't like weapons I could admire the craftsmanship. We had fun at the end trying on costumes and taking photos, it's only small so you have done the round fairly quickly but well worth a visit."
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "A boutique museum with style - make sure you see this!. Authentic samurai armour and weapons in a boutique museum that has been beautifully designed and presented. We spent a really enjoyable hour or so looking through the exhibits covering the samurai era of Japanese history, each displayed in a series of rooms lined with tatami mats, tastefully lit and with soothing music to set the scene. The museum owner gave us a guided tour and was only too happy to answer our questions and provide more insight into the time of the samurai. The staff were also delightful and helped make this a fun experience. This place oozes style."
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "Exactly how you would want it to be....... Authentic with really nice decor, ambiance and layout. The owner is very passionate on the subject and has amassed a great collection over twenty years. The other staff are lovely and i hope this does very well as it is new!"
        }, 
        {
            "index": 409, 
            "rating": "5", 
            "review": "Like visiting your own private collection. This is a well set up small look at one mans private collection. It is very well displayed and we were lucky enough that the owner was there to answer our enquiries and effective give us a private tour and history guide to Samurai.Our party included 2 young adults who found the displays very engaging. It ends with a photo opportunity to dress in Samurai gear. A great 1 hour visit close to Snihjuku station near the robot cafe."
        }, 
        {
            "index": 410, 
            "rating": "5", 
            "review": "Highly recommended: Little cultural gem contrasting livley Shinjuku. This small museum has been opened just a few weeks ago, and serves as a wonderful cultural contrast to lively Shinjuku area. It displays several very well-preserved samurai armor suits, as well as weapons and swords, and provides a bit of background on the history of japanese Samurai. It covers two floors of a historical building in Shinjuku, and is perfect, if you would like to spend about an hour with a cultural heritage of Japan. In case, you are interested in more background information, the owner and the staff would be glad to provide it, even if the communication is sometimes a bit difficult, but you can always feel the dedication of the owner and staff to provide a wonderful experience to their guests. You can also make pictures of your own, dressed in a historic samurai armor including helmet and sword, which is a fun experience. We can highly recommend this small hidden gem, and hope, that many travellers would visit it, when they are in Shinjuku. It is only 2 blocks north from the Robot Restaurant, or 2 blocks north-east from the hotel complex \"Gracery Shinjuku\" (with the Godzilla on its roof)."
        }, 
        {
            "index": 411, 
            "rating": "5", 
            "review": "Just perfect. I went there to experience some Japanese cultural history and was not disappointed. As I went early, I was alone in the museum and got the fantastic owner as a personal guide. You can tell he's very proud of the museum and it's artifacts, he even took out a few for me to hold. The museums interior is very traditional and old fashioned, with a light touch of incense (that you can buy in the shop) and relaxing music. I felt very centered, happy and calm after leaving the museum, it was a well needed pause from the otherwise high pace of Tokyo. Fun parts was the masks, outfits and swords you can try on and get photographed with, probably the coolest selfie you'll get in Tokyo. And of course - you'll even learn a bit of Japanese history!"
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "Wauw - Great museum!. We had the greatest experience at the Samurai Museum today. Friendly staff telling about the samurai eras and how to wear the helmets and armour - and we were even allowed to hold weapons and try on the clothing. Very interesting place. Highly recommended. Small place with lots of atmosphere! Thank you!"
        }, 
        {
            "index": 413, 
            "rating": "5", 
            "review": "Great new museum!. We discovered the Samurai Museum by chance because it was near our hotel and it was an amazing experience. Situated in Kabuchiko, in the heart of Shinjuku. Great piece of Japanese history."
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "HIGHLY RECOMMENDED!. The best place if you love Samurais!!! You can try a samurai armour and take pictures of everything. Really nice place with real armours! Its located in Shinjuku right behind the Godzilla statue."
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "Authentic and Interesting Change of pace. Spread over 2 floors with lots of interesting artefacts the museum is a good break from the hustle and bustle of Shinjuku. Not far from the Robot Restaurant, I found this unexpected jewel. My understanding is that this was originally a private collection that has been open to the public. It was interesting to see the changes in armour and the swords over the ages, and the care and presentation is fantastic. They were offering free photos of you dressed up with some samurai outfits/ swords - taken by your friends or their staff would manage your phone/camera - good for Facebook profile pics etc.It was also a good place to buy good reproduction samurai swords (if that is your thing) from fairly cheap (under US$100 to more expensive). I always wanted one as a teenager when i was into karate. They also talk a bit about when samurai moved to using guns and have some original guns on display too (you cannot buy any guns). It is a loss to move from honour and mastery of a sword to shooting people from a distance. I also like samurai movies so i could be biased. You can also buy a small model samurai armour at the museum - which is a great idea for teenage and older gifts especially for boys. In Japan a Japanese Doll or Kimono is a good gift for a woman, and an equivalent but cool gift for a boy would be the small samurai armour (and not as pointy as a sword). If i can get pictures from my phone i will attach.Staff were helpful and enthusiastic about their collection, and I would recommend a visit. Note - you take your shoes off on the second floor - so wear nice socks..."
        }, 
        {
            "index": 416, 
            "rating": "5", 
            "review": "Interesting and comprehensive museum.. Although this museum is fairly small, it offers a great selection of items ranging from early muromachi period to late edo/early meiji period. The staff is pretty knowledgable and also speak english fairly well."
        }, 
        {
            "index": 417, 
            "rating": "5", 
            "review": "An unexpected. A very enjoyable experience. The photos on the wall outside didn't do the place justice - making it look like a very small in-and-out type place, but it wasn't. It was the perfect size, not too short that you felt it was a waste of money, and not too long that it got boring.The staff were extremely pleasant and fun--one could see they wanted visitors to have the best experience rather than the typical snooty museum. Everything came across as very honest, even the beautiful swords that one could purchase at the end were such good value I had to double check I was converting the currency right."
        }, 
        {
            "index": 418, 
            "rating": "5", 
            "review": "A hidden jewel of a museum in Shinjuku. Looking like lost tourists studying a map on the street, we were approached by a kind gentleman who spoke excellent English.As it happens, Mr. Tetsuro Koyano had just opened the Samurai Museum one week prior & invited us attend his museum as guests. I have long had a great interest in the shogun eras, especially in yabusame, but artifacts from that time in most museums I’ve been to have been sporadic. The Samurai Museum is replete with armory, weaponry, historical information, and the like. The collection is spread over two floors &, while I imagine additional artifacts will be added over time, it has been excellently curated. I cannot stress how fulfilling visiting this museum was for us. We literally spent our last couple of hours of our stay in Japan at the museum, then headed straight to the airport for our return journey."
        }, 
        {
            "index": 419, 
            "rating": "5", 
            "review": "Interesting new samurai museum. Happened to walk past and discover this new place. Small museum that does not take a lot of time to see. Beautiful sets of armor and other interesting items. Surprising change of pace from surrounding neighborhood activities."
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "The middle of the journey, it is recommended place to stop by!. To be meet in this museum at Shinjuku Kabukicho, I was impressed to unexpected encounter. Cool in the quaint appearance, stunning armor form a line and Once inside, spreads suddenly space, such as time slip. In 2F, and then view it take off your shoes. I feel stylish good offices incorporating casually Japanese lifestyle. You can see the familiar and great swords and helmet. Also the history of Japan through the \"Samurai\" was also able to learn interesting. There was also a space that can photographed wearing armor and helmet."
        }
    ]
}