{
    "category": "Tokyo", 
    "entity": "Nezu-Museum", 
    "avg_rating_stars": 4.527472527472527, 
    "review_count": 182, 
    "rating_stats": {
        "poor": 2, 
        "average": 13, 
        "terrible": 2, 
        "very_good": 46, 
        "excellent": 119
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Tea cerimony experience. Very interesting Museum. Three exhibition galleries and a good Japanese traditional garden. I especially enjoyed seeing so many Ming Dinasty ceramic."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Always a pleasure to stroll in the garden. Can be difficult in a crowded city like Tokyo to find quiet public places removed from the hustle bustle. The Nezu Museum is a great place to take that slow stroll while contemplating the deeper meanings of life."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "A beautiful serene place in the middle of a luxury neighborhood. One of the best museums I visited in Tokyo in an immaculate, tranquil setting. Well worth a visit! Had a mixture of sculptures, artwork and spectacular gardens. If you venture into the gardens you'll be rewarded by a cafe that's right on the middle of the grounds, set in amongst the trees."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "So peaceful. Very peaceful museum hidden in the very end of Aoyama. It's really worth the entrance fee to just go in and see the huge Japanese garden inside. Be sure to stop by and have some tea/coffee at the museum's cafe. So serene."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Beautiful garden, well selected exhibits. We always enjoy the garden. Bring your camera on suny days for potentially great garden photos. The museum is relatively small with four large rooms but the selection of pieces has always been excellent."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Magnificent . This museum is both, a stunning architectural treasure, as well its content being a collection of exquisite craftsmanship from China and Japan. All of it set is beautiful, matured gardens for the perfect visit."
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Beautiful Space. This museum is a beautiful modern piece of architecture with traditional exhibitions. The current exhibition of antique Chinese ceramics wasn't really my cup of tea but I was very happy to have visited. It's a beautiful space, and the Japanese garden is gorgeous and surprisingly big. I think it will be even more beautiful next month with the fall colours. There is also a very nice café located in the garden. Admission to the museum is 1100 yen and you must buy a museum ticket to access the garden and the café."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "Lovely garden, small museum. Worth a visit though the collection itself is very small, but the garden behind the museum is exquisit"
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Beautiful building & garden. The Nezu Museum is located in a beautiful building with a great collection of old Japanese art. It's not very big, but the beautiful garden is. Totally zen and rustique in the middle of Tokyo. Must go."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "Garden better than museum. Museum is rather small, some interesting works and some not so much. But the garden is really a hidden gem, take your time and wander everywhere- there are statues everywhere."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Small and beautiful. The Nezu museum is a haven of tranquillity in Tokyo. The building itself is simple and interesting. The current exhibit when I was there was Techniques in Japanese art which was fascinating. The gardens are also beautiful, and the cafe a lovely location for a light lunch. It was not busy when I visited, Sunday morning in early September, so that no doubt added to the enjoyment if my visit."
        }, 
        {
            "index": 12, 
            "rating": "4", 
            "review": "Beautiful art and beautiful gardens. The core of this collection was gathered by an early train magnate. The original buildings were destroyed during the war but the collection survived. The current building is worth seeing alone for the design and architecture. There are some amazing works in this collection and you will learn some cool stuff. It's very well presented. The buildings are encompassed by a calming garden containing more works. Definitely worth the price of admission!"
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Nezu Museum in Minami Aoyama. Nezu Museum sits on 20,000 sq.m. of sprawling site in Minami Aoyama and is home to Nezu Kaichiro’s collection of premodern Japanese and East Asian art. Nezu Kaichiro known as Railway King whose career included being president of the Tōbu Railway started his collection with tea ceremony artifacts and expanded into paintings, calligraphy, ceramics, lacquerware and archeological treasures.This private museum is the perfect kick-off for the walking tour of Minami Aoyama, neighborhood of star architect retail shops, Italian furniture showrooms and cafes of all shape and form. Indeed the site is across the road from Miele showroom and doors down from B&B Italia and Flexform. It also just a few steps south of Blue Note for a quick swing-by with the 630pm gig if you’re starting the evening early.Main museum building was designed by Kengo Kuma of Suntory Museum of Art (Tokyo) and LVMH Japan headquarters fame. The approach into the museum from the main road follows a cantilever covered corridor with bamboo fence on the roadside and timber wall on the other.The big, minimal Kuma signature roof line dominates the museum. Kuma’s roofs are abstractions of traditional Japanese architecture, overhanging eaves shelter and shade from the exterior while creating a vast and lofty interior space freeing up imagination for function. Indoor ceiling is clad with long wood panels creating a sense of warmth and protection under the huge roof.Museum is surrounded by Japanese garden and duck ponds rich with trees and plants designed to reflect the four seasons. Lush bamboo groves boast its resilience in the coldest months keeping the garden green in all seasons. Four tea houses are dotted around the grounds are named and labelled on garden maps but not allowed entry.Small museum shop packs in more quality object d’art than any of its peers from paper cards of all ingenious designs and shapes, traditional ceramics and lacquerware, furoshiki (traditional wrapping fabric) and of course coffee table books. Museum is worth the visit just for gift shopping. Just at the entrance of the garden is a glass encased, light and airy cafe (NEZUCAFE) serving Japanese style western meals (read pastry, salad and pasta)."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Art of living. Beyond the noteworthy exhibits, you are also introduced to a refined art of living that Nezu Kaichiro has accomplished. The museum is set in a large park that invites you to stroll in its quiet splendour. Do set yourself more time than you would think necessary."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Best Museum Design & Gardens in Tokyo. Please take no notice that hick tourist Sam, who wouldn't know a museum from a car yard... so many amateurs on here..The building is MEANT to be small, as if you took the time to read the background about the site, its a family bequest of the Nezu Family, the owners of the Tobu Railway) So its essentially a house/museum, that began with a purchase of a writing box (on display)The building designed by architect Kengo Kuma, intentionally, to be small.The mosquito infested garden he mentioned, dates from 1906, I guess they could have drained them of water, so that no elements of nature can affect the visitor, but then, its not Kansas, its the centre of Tokyo, and a beautiful respite from the traffic above. Ignore the ignorant, do yourselves a favour. Its a destination worth visiting"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Gorgeous gardens. Nezu is on the site of a former family home, and both the museum and the grounds are lovely. We stopped by on a rainy day, and loved the gardens so much we didn't want to leave. Peaceful, calming and very beautifully architected, you'll appreciate the respite from the tall buildings and hubub of Tokyo at this little slice of heaven. It's not free, about the equivalent of $10 USD, but worth it. If you're a museum goer and like art and a beautiful landscaped garden, it's a must."
        }, 
        {
            "index": 17, 
            "rating": "1", 
            "review": "Small, Crowded and Boring. Visited Nezu Museum in Tokyo recently and was very disappointed. The place is really tiny and cramped, made worse by museum staff and all the security guards in uniform everywhere who kept getting in the way of the paying visitors as they tried to navigate the small space. People go to museums to enjoy art, not to have security guards in your face the entire time. Not much good art on display, either. Mostly Chinese art and many copies/reproductions of Japanese art.Tried walking outside in the surrounding gardens, but they were full of swarms of mosquitoes, probably because of all the stagnant water in the small ponds. Also very noisy outside due to the construction and cars/trucks driving by on nearby streets. Not recommended."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Always worth a visit. What I like about this place is both the architecture and garden and the exhibitions they hold. It's a modern building but definitely based in traditional Japanese architectural principles, and it's set in a traditional old Japanese garden with a tea house, and finding a garden large enough to walk in, and where you are permitted to walk, is rare in Tokyo. I also like that it is a relatively small museum so I'm not immersed for half a day or a whole day at a time. Lockers are available for 100 yen and that is refunded when you reopen your locker. I always come here when in Tokyo."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Fantastic afternoon in Tokyo. This was perhaps my favorite place in Tokyo. It's a gem of a museum, and the garden is a fantastic oasis in the bustling city. The museum is relatively small, but it has great treasures--the ancient Chinese bronzes are spectacular. When I was there in June 2016 there was a large exhibition of old mirror backs, which did not enthrall me and as a result, some of their famous paintings were not on display. The building is very distinctive, especially the entranceways and the glass exterior looking out to the café and garden. Lunch in the café is also delightful, particularly if you can sit looking out at the garden. The garden is amazing, extending much farther than it might seem at the start. Part of its charm and splendor is that you can't see all of it at once. It includes a pond, other water features, teahouse buildings, and a small shrine with statues. Very serene, varied topography. Loved it all!"
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Nice museum, excellent garden. The garden is definitely the best part of this museum. It's not huge, but it's cozy and wasn't too crowded when we were there. Lots to enjoy as you meander along the paths - tea houses, flowers, bridges, ponds, sculptures. The museum is a nice building, and some of the exhibits were interesting, but it's quite small, and I wish more of the exhibits had been focused on Japanese design."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "wonderful gardens and tea house. A beautiful old garden well maintained. Elegant tea house with light meals and lively views. The museum is small and mostly had Chinese art and artifacts which was nice but not Japanese. A bit of a walk from nearest station."
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "A museum with landscape. This is an interesting place. While it has great artifacts and paintings in the museum building, what attracted me was the beautiful landscape of the garden adjacent to the museum. Historically, this was a residence that has been converted into a museum.\nEven if you are not interested in the art pieces, you must not miss the beautiful garden there."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Great Architecture. Great building and beautiful gardens! We didn't too much to the museum but would defiantly recommend a visit here on a sunny day!"
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Enlightening.. Overwhelmingly beautiful on all fronts- the museum itself is spectacular but the real treasure is the garden. With meandering paths and ponds, you begin to forget where and when you are. The fragrant flowers and gurgling streams complete the transcending experience.I suggest arriving at 10:00 when the museum opens and walking the garden before the exhibits. This allows you to sit and slow your mind down from the chaos outside of the museum walls. I was greeted by a multitude of insects, turtles, fish, and birds; all of whom seem to embody the zen energy of the ancient statues surrounding you. As for the exhibits, I was equally impressed. The various works are well lit and carefully described. The galleries have a wonderful and cohesive flow to them- each piece earning its importance and giving meaning to a central thesis. It's rare that a museum has such an emotional impact, but I challenge you to visit and not lose yourself in its splendor."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Very interesting museum. I found this museum very interesting. You can see there not only many nice statues and graphic art but also its garden is very pleasant."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Secret Sacred Place and great Architecture!. I went to this museum following the path of Tadao Ando´s Architecture in Japan. When I entered this place I realized that it was more than a beautiful building. The collection inside as well as the zen garden that is outside is amazing. I highly recommend this Museum because it is also very near from the chaotic Omote Sando and Harajuku Area. So if you wanna take a break from shopping and chaos walk to this museum and have a glimpse of sacred buddhist pieces."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "A gem of an experience. Great garden, really great. And great art. Do not miss this museum in Tokyo. It's worth a couple of hours, and is in a great location, so you will get a taste of haute Tokyo shopping, even if only window shopping. I loved everything about this."
        }, 
        {
            "index": 28, 
            "rating": "3", 
            "review": "Pay 1000 yen for entrance fee. You can get a free stroll outside the museum, however you have to pay approximately 1000yen to get into the museum."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "A remarkable collection of art. Besides enjoying the art collection, we made our time to the iris pond inside the museum's huge garden. Cant believe in the middle of busy & expensive city like Tokyo has such green & great oasis. Early May is a very right time to come by, enjoy the iris art piece inside the museum & the blooming iris pond at the same time."
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Great museum and amazing gardens. Great museum and amazing gardensVery good museum and one part you should not miss is the garden !!The building is very modern and very beautiful."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Beautiful gardens early may visit recommended. This is a philanthropist's personal collection however it's the gardens that will blow your mind away - we were so lucky in the fact that the purple iris had just bloomed - it was the 3rd May - a beautiful bright sunny day which and created a foreground to that of a Monet painting - the colours, the water, the setting - delightful."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "An Oasis in the city. If you're an architect, an art enthusiast, a landscape and garden lover, someone who enjoys great design and a tranquil atmosphere then Nezu Museum should be on your travel list.Walking distance from Harajuku/Omotensando Stations, the museum is designed by architect Kengo Kuma and has one of the best gardens in Tokyo. It is a fantastic place to spend at least a couple of hours.Highly recommend!"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Very Impressive collection of asian history. Here I realized again how impressive asianhistory is and how advanced many cultures where thousends ofyears ago. Dont miss to strawl around in the garden. Its beautifull."
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Beautiful garden . If you want the full hit of spring this is a must see garden. Mature and beautifully maintained . It's extremely well informing with signs in English as well as Japanese. Years dates explanations. After doing the gardens enter the museum which is a marvel of pottery , painting or years gone by . There are six rooms to visit and the flow of people is okay and not over crowded even on a Saturday . They also have a sovereign shop ( always as usual over priced) but a joy to look around . Over all we had a great time ."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Exquisite building filled with marvellous treats!. I read comments about being disappointed with this museum with amazement! It is a sumptuous building, gorgeously detailed, subtle and set beautifully within its streetscape context that then offers a series of galleries with some of the most sumptuous items one could wish to see. At the time of my visit it included the marvellous Iris screens as well as those of spring and autumn of plums and maples. The bronzes, ceramics and treasures of the tea ceremony added to the glorious exhibits while the garden added a further dimension. On a day of perfect Spring weather it provided the icing on a very satisfying cake! Don't miss this fabulous museum."
        }, 
        {
            "index": 36, 
            "rating": "2", 
            "review": "Only 6 galleries! Nice garden though. Quite disappointing. Entry was 1300 Y per person. There are only 6 small galleries. Most interesting was one gallery with Chinese vases..... If you want to go there you pay the price to see the garden. The garden was very nice - but it should be a museum not a garden. It is very wrongly advertised in my travel guide (Marco Polo)- so I was very disappointed with the actual museum. Inside the garden there is a traditional tea house, but to experience the tea ceremony and have a tiny match dessert you have to pay another 1000 Y per person..... So please only go if you want a relaxing day in the garden not to see artifacts!"
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Counter balance of the shopping crazy modern world surrounding it. I came across this museum by accident, visiting the shops in the neighbourhood and trying to walk to another shopping area.I was lucky to visit while the national treasure Irises screens where on display. The other screens were as beautiful. The small room upstairs dedicated to tea is a very good introduction to the art of drinking tea for first time visitors, a great show for more advanced amateurs of chayo-do.The garden gives you the opportunity to meditate, relax or just admire."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Peaceful, Zen garden and lake, garden cafe, beautiful museum . This is worth a visit even if just for the Japanese garden- but the museum is worthwhile too. Not too big, not too small. Stunning architecturally. You can wander through the extensive gardens and enjoy some peace on the middle of Tokyo. The cafe in lovely."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Fabelous. Best Creation and Nezu Museum Jiayi Lancg become great people historically save the Japan and Oriental art but. The design and the architecture is fabelous..."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Delightful environment, worthwhilenice architecture,. I believe it's designed by one of Japan's leading architects and deserves praise for a delightful environment, both the garden (with ancient sculptures) and the showrooms. Very small, but the Chinese bronzes (13th century BC!) are just wonderful."
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "go for the garden. The museum itself is fairly small and doesn't take long to explore-- we weren't entranced. Why you want to go is to see the garden in back. Lovely and peaceful walk-makes you jealous of the apartments that overlook it"
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "One of the best museums in Asia (for me). This museum has everything; a garden, teahouse, cafe, 6 galleries, and a museum shop. To be honest the garden alone is worth coming here to visit, gardens like this are not so common in Tokyo. One reason it's such a lovely place is because it used to be a private residence and only became open to the public in the '40s.When I went, 3/24/16, they had a special exhibit on Buddhism, mostly silk painted scrolls that begin by showing the history of Siddharta, followed by receiving Buddhism from China, and finish in modern times when Buddhism synthesized with Shinto. There are English signs everywhere, written eloquently, for many pieces. This is the most English I have ever seen anywhere in Japan so far I think.The permanent collection is equally interesting, maybe more so. They have a small-medium size collection of ancient bronze from China, 11-13th century BC. I've seen these before at the Shanghai museum, but there are some pieces here that are in pristine condition and show some very intricate artwork.They also have a lovely collection of dolls, from the Kyoto imperial family. You can see how the emperor and empress dress by how the dolls are dressed; they are exact copies.I didn't go into the cafe but I'm sure it would be great, it was mostly full. The museum is not very big, but well worth a visit. My favorite in Tokyo."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Well-chosen displays in a peaceful place. The Nezu Museum is about being given the opportunity to appreciate carefully chosen pieces (in an amazing example of modern architecture) as opposed to being bombarded by art and sculpture. Well-chosen pieces, special exhibitions and a good place to enjoy lunch."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Gorgeous! . Beautiful building with a large garden. Hard to imagine that you're in the center of crazy and busy Aoyama. The selection is small, but well chosen and the exhibits change regularly. I especially liked the collection of fans on the second floor.Will be going back to see he rotating exhibits."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "An amazing museum. Visit this museum recently. It is one of dozens in Tokyo. It was totally beyond my expectation. It will be one of my most favorite places in Tokyo. The courtyard, in the center of Shibuya, is just amazing. You can find surprises also in every corner. The building itself is totally modern, however blends so well with the classical garden. You can spend hours there without feeling boring. The collection is totally amazing. Those huge bronzes from Shang Dynasty (you have to experience it yourself ....)."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Clean, sleek building and absolutely beautiful gardens. Most well-maintained museum building I've seen, very modern but the art is not mostly statues, traditional paintings, antique pottery, clothing & calligraphy.The whole garden is beautiful to walk through, not a plant, pot or statue feels out of place and almost any part of the garden would make a good photo"
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Interesting collection is a sleek setting. Cool museum. The building itself is a must-see for architecture types and the sculpture garden is fantastic."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Go. What a treat. This museum was quite unexpectedly amazing. A well curated series of art and artefacts, relating to the year of the monkey, and the plum, bamboo and pine. Some were Chinese, others Japanese. Screens, kimonos, bronze artefacts dating back to the 11th century BC. The outstanding surprise was the garden.I won't spoil it for you, just to say, don't miss this."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Really nice architecture. Really nice architecture & exhibition. Perfect for architecture lovers as it combines opposite materials like bamboo and concrete. Enjoyed the garden on a sunny day."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Relax at the Nezu Museum. We visited the Nezu Museum on a hot day in early September. We took a long subway ride to get near the museum them walked with the aid of Google maps; it was easy to find but the sign outside of the museum is not so easy to spot. The museum is part museum and part beautiful garden. The collection of Asia art is displayed in large galleries with lots of air and space. The works are beautiful and you can take your time passing through the uncrowded galleries. There is a small café in the middle of the garden that is perfect for lunch. We also spent some time just walking slowly through the garden to absorb the quiet atmosphere, really different from the atmosphere elsewhere in busy Tokyo. You can plan about one half of a day for a relaxing visit."
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Art and Nature combine. The real gem in the Nezu Museum's collection is actually its gardens. They provide a peaceful getaway right in the heart of one of Tokyo's busiest districts. The fine art on display is also of very high quality with exhibits rotating about once every three months or so. An ideal place to step back and contemplate."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "A museum that many missed out. I am surprise that many trip guides missed out this Museum. The museum is \"small\", in terms of the exhibition area, one have to admit it. However, the architecture and the garden is just wonderful. Different from the others art museum in the area, Nezu in particularly focused on traditional Japanese which makes it worth visiting during travel ."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Perfect Japanes Garden. The garden itself was worth the price of admission. Great collection of Japanese and Chinese objects. The architecture of the building itself was also impressive."
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "Haven of tranquillity in Aoyama. A wonderful museum with exhibitions that change every two to three months. We saw beautiful 17th century scrolls and folding screens that illustrate the tales of Genji and other famous monogatari from even earlier periods. There is also a fine display of Chinese bronzes. The main tea-house has good coffee, tea and snacks. There is also an extensive garden which is a delight, especially in the autumn. Truly a haven of tranquility. It is conveniently located close to Harajuku"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "An oasis of Old Japan in the heart of the metropolis. Two for the price of one: a beautifully designed small museum of art treasures from ancient Japan and China, and an exquisite and extensive garden, with small stream and pond and several tea houses (for formal tea ceremonies), where it's hard to believe you're in the heart of the metropolis of Tokyo. Paths wind downward, passing evocative old stone lanterns and carvings (some from Korea), through lush vegetation. An attractive coffee shop is located in the garden. (A good option for lunch located nearby en route from Omotesando is Blue Brick Lounge - its quiet elegance somehow mirrors that of Nezu Museum; it's not listed in TA.)"
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Small Museum of Japanese art. Beautiful Gardens. Interesting but small collection of Japanese art and artifacts. The Gardens make the visit. Especially with autumn leaves. Building itself is also special."
        }, 
        {
            "index": 57, 
            "rating": "3", 
            "review": "Maybe for the garden. Unfortunately they don't provide English audio. And the signs are not enough. It has a lovely garden and a coffee inside. But it is always crowded on the weekends. So may better in the weekdays."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Great museum and gardens. I really like this museum. The building itself is very interestingly designed, the collection is very good, and the gardens are a wonderful retreat from Tokyo."
        }, 
        {
            "index": 59, 
            "rating": "3", 
            "review": "Nice museum. Nice museum , good for those studying tea ceremonies. It is the collection of a private family. Good coffee shop in the garden."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "The garden is sublime. The museum is very interesting and contains national treasures, but the garden is sublime. Walking into the garden is to go from the hustle and bustle of Tokyo into serenity and beauty. One must first pay for entrance to the museum, which is 1200 yen for adults, but the garden alone is worth it. Nezu was a rich entrepreneur who bought companies that were close to bankruptcy through mis-management, I suppose, and made them successful. He collected works of art to prevent them being taken abroad. There are places to sit (though not many) in the garden where one can hear the sound of a running stream and the sound of birds, but not traffic, and look at the delicate trees reflected in the still pools.The coffee shop is also wonderful, having glass walls that give the feeling of eating or drinking outdoors, in the garden."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Amazing antiques with a bonus garden. We had read that this was a great museum for Japanese antiques and we were not disappointed. Some of the bronzes were 11th century bc and in beautiful condition, apart from that the tea ceremony artifacts which were part of a special exhibition were fascinating. The scrolls dated back to around the 8th century and were in incredible condition. Unfortunately we cannot read Japanese but would love to know how much the language has changed in that time. The bonus was the gardens which we did not know about and they are worth a visit in there own right."
        }, 
        {
            "index": 62, 
            "rating": "3", 
            "review": "Don't miss the garden. Nezu's collection are majority scrolls and pottery (with a huge proportion of ancient Chinese relics). Most of the displays at the museum has simple English translation. There's a huge garden with plenty trees and statues, it's very peaceful and quiet. No additional fee and is included in the museum admission fee (JPY1,200). Worth take a detour to spend few hours there if youre going to Omotesandō Hills. Otherwise not quite worth to pay for a special trip ..."
        }, 
        {
            "index": 63, 
            "rating": "3", 
            "review": "Small, expensive, good garden. The museum was smaller and more expensive than many others. Probably good for history buffs but not my favorite Tokyo museum. The garden out back is quite lovely if you do go."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "The garden is the highlight. Beautiful collection of teahouses, statues and religious figures in a very nicely arranged garden atmosphere are definitively worth the visit. The buidling is puristic designed, good volume and presentation of the art pieces."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Beautiful scrolls, pottery, garden. We saw lots of artifacts of culture, beautiful scrolls, Buddhas of course, and pottery. Wonderful art, and not too much so you are not overwhelmed. Great building, too. The garden is wonderful, so restful and beautiful right in the midst of Tokyo."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Well worth a visit for the museum's collection and garden. The Nezu Museum is a small jewel of a museum. There are beautiful collections and a wonderful, peaceful garden/park behind the museum. It is a beautiful oasis in the middle of Tokyo."
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Beware: Irises are not on permanent display. I've been to this museum many years ago and saw the famous iris. The museum is near the Harajuku area in Omote Sando and has peaceful shaded garden with various sculptures. There is also a cafe on the grounds although we did not visit. The museum is small with about 8 exhibition rooms and has a rotating display. The lacquerware we saw on exhibit was gorgeous. Admission fees are steep which is the norm in Japan. Look online and see if the exhibit is to your liking but I suspect as they show exquisite Japanese art, there will be something to please anyone interested in art."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Worth a visit. Nice small museum with fantastic bronze collection as well as pairings. Enjoyed a walk through the gardens too. I had expected the gardens to be more manicured but the trails were still wonderful "
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Very interesting museum. We had short stop at this museum, it was a great experience,they had some very nice materials, the view of the lake from the museum was great"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Hidden Gem in Omote Sando~the Nezu Museum. I always bring company to the Nezu Museum to see the museum and the beautiful Japanese gardens. The exhibit changes seasonally and is always well done. There is a lovely gift shop and the cafe is very pretty you are surrounded by the Japanese Garden. A great place to take photos is in the Garden."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Quiet oasis. This beautiful oasis amidst the hustle and bustle is situated in 20 hectares of Japanese gardens. On the day we visited it was drizzling with misty rain, so we had the Japanese tea set for morning tea in the delightful tea house. It was such a lovely experience that we viewed the exhibition and then returned for lunch. Possibly one of my favourite experiences in Tokyo"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Lovely art museum, garden & cafe. I was delighted to visit this museum especially with the present exhibition of 'listening to paintings.' Enjoyed using my imagination to see these typical Japanese pictures in a completely new way. The garden was exquisite with lots of paths winding through tall trees and around pools. The sound of the circadas blocked out the city outside. I do suggest insect spray especially on moist days. To end my trips I was so pleased to find the cafe with tea, cakes, & light snacks, such as a Niçoise salad. Worth the Yen 1000."
        }, 
        {
            "index": 73, 
            "rating": "3", 
            "review": "Ok. The most interesting aspect of this museum was before entering the museum-the row of bamboo.The museum is small, the art collection limited. The garden setting had great potential, but seemed over grown and dry to us. Don't understand why this museum is so highly rated."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Japanese Garden is OUTSTANDING, the museum had a couple nice special exhibitions. The Japanese Garden is beautiful and serene and wonderfully maintained. In Aug it was very hot and the bug noise was high enough to dim the sounds of the city just outside its walls. The two special exhibitions we saw, one on listening to paintings and one on lacquerware were both interesting and very good (although photos were not allowed in these galleries). The statues in the normal part of the museum were minimal in number and all those were nice. Even on the hottest day in Aug it is worth going to this museum to walk through the Japanese Garden, it really is outstanding."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "worth a visit. but check what is on display.. I live 12 min walking from this place, hadn't gone for some time. Went a couple of weeks ago, it was surprisingly good. There aren't museum level pieces, but when I went there was a good display of Edo (17th - 18th century) samurai \"dandy\" pieces, including a solid but not historical selection of short swords and scabbards. It is a bit far from the station - about a 12-15 min walk from Omotesando station, but the building is neoclassical Japanese, at times the exhibits are good, and really the garden is nice in the middle of Tokyo. Depending on the exhibit - check! - it is work a two hour detour."
        }, 
        {
            "index": 76, 
            "rating": "3", 
            "review": "The garden is better than the museum.. The rather ancient artifacts on display were in great condition considering their age, but static displays of calligraphy, ceramics & housewares was not at all compelling. The garden out behind the museum is beautiful, however, and the gift shop was better than most considering its small size."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Its Beautiful Garden is the Highlight here. The museum is nice with a fairly small collection, but the lovely Japanese style garden is the main attraction here. The main building also offers seating and is a nice place for a little break, away from the brazing sun outside!"
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "Serenity in Tokyo. The tranquility begins as soon you approach the entrance which is flanked by a row of bamboo. In addition to a large, well curated gallery space the Museum also has an amazing Japanese garden in the rear. A really nice respite from the (wonderfu)l chaos and noise of the city"
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "Peaceful spot in the middle of the busy Tokyo.. Try to visit this old Nezu museum and shrine. It's so beautiful especially if you want to relax for a while in the middle of the busy Tokyo."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "Great collection of Buddhist artefacts and beautiful garden. A great collection of Buddhist artefacts and a beautiful Japanese style garden to hide from the heat."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Beautiful Interior, Even More Beautiful Garden. The museum itself has a private collection of East Asian artwork scattered throughout the first and second stories. While extremely interesting, they seem to blend together for a general art admirer like myself. On the other hand, the garden out back is absolutely gorgeous - its easy to take a stroll and get lost in your own thoughts as you peruse through it. I went in the Spring, where the flowers were beginning to bloom but I can imagine all four seasons being equally as beautiful in its own way."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Variety of matters related to environmental issues. Here is one of the riches of the city's Modern Tokyo, which displays a variety of matters related to environmental issues. The place is quite spacious, and surrounded by a beautiful garden. Here on display valuables such as Including calligraphy, painting, sculpture, ceramics, lacquer, metalwork, bamboo crafts and textiles."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Crowded due to landmark exhibit but well worth visiting for the exhibits, architecture, gardens and cafe.. Great end to a walk down trendy Omoto sando. Fine building, exhibits, beautiful gardens and cafe.It was crowded though due to a special exhibition of national treasures."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Superb!. Of couse, exhibitions are always changing, but some heart-stopping objects from Japan, China and Korea. Interesting garden too."
        }, 
        {
            "index": 85, 
            "rating": "3", 
            "review": "great place to visit!!!. beyond description. you must visit this place when you come to japan. I live in Japan so I've been to there several times."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Museum and Garden. Dedicated to Asian art, shows several pieces of Bronze from ancient China. Until May 17th was presenting: the Secret of Korin's Design. Most of the pieces of art have english explanations. The garden alone worth the visit. There are stone Buddhas everywhere and the pond with lilys is inspiring. "
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Beautiful garden. Beautiful garden with lots of stone paths (not always handicap accessible though). While there are a few teahouses sprinkled in the garden (along with a lot of cute stone and bronze sculptures), they aren't open to the public. The artwork is also nice, though the European decorative works in the hallway seem a bit out of place."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Nezu, the railroad magnate left a treasure. Nezu left his gorgeous gardened estate to the public after his death in 1940. He collected Chinese bronzes, Japanese screens, lacquers and pottery ware. His home was spared the1945 bombings and newly rebuilt in 2006. The gardens must be seen, especially in the spring. I have attached photos of the Iris pond. I visited during the Korin special exhibit. Korin's iris screens are world famous and must be seen. It was very crowded the day I visited, a Thursday morning. Transportation is easy from the ginza line omotesando station exit A5. Make a right out of the exit and walk 5 to 10 minutes."
        }, 
        {
            "index": 89, 
            "rating": "3", 
            "review": "Good. The museum itself is not that big: just five small galleries filled with Japanese art. The garden is beautiful and the main attraction of the museum. It is good but not unmissable."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "great exhibits, not much english. The exhibition has some really beautiful pieces and the gardens are filled with statues and rock carvings. The museum has a handful of rooms, I really enjoyed everything though did find the calligraphy difficult to understand as I don't read the script. There are some english captions but they are not as extensive as the Japanese captions - but don't let that stop you the items are beautiful and definitely worth seeing if you have the time."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Nezu Museum and Garden – a treasure in Central Tokyo. Mostly featuring special exhibits on an aspect of Japanese arts & culture, the Nezu is a great way to get an in-depth look at one area – avoiding the overload that can come from larger museums. I saw the “Secret of Korin’s Design” exhibit and was very impressed with the high quality of pieces displayed, the excellent presentation and the more than adequate accompanying explanations in English.I was equally impressed with the very large Japanese garden behind the museum and spent as much time in the garden as in the museum. When I visited (Spring) the garden was a harmony of contrasting reds and greens. The beautiful pond with Iris (blooming end April – early May) is as beautiful as Monet’s Giverny with its water lilies. This densely planted garden with antique statuary is well worth a visit on its own.With easy access on the Ginza, Hanzomon and Chiyoda lines (Omotesando stop), it’s a great place to visit in the early morning before the crowds arrive. There are many affordable lunch possibilities on the side streets between the museum and the subway station.This visit is ideal for people who would like a small taste of Japanese art of the highest quality and who are interested in seeing an authentic Japanese garden. If you want a broader overview of Japanese art, I would recommend the Tokyo National Museum."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Lovely small exhibits + gorgeous gardens = a must do. The Nezu is a lovely small museum. In fact, we simply visited the current exhibit on Buddhas. There was a bit of English signage and an English guide which was a nice surprise. But really, go for the gardens. They are stunning, and we visited right before everything was blooming. Nooks and crannies with special statues, water features, and foliage all throughout. Tea houses scattered through. Definitely think about afternoon tea in the tea house that overlooks the gardens. A very peaceful place in the middle of a vibrant city."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Hidden Gem near Omotesando station. The museum is a little short walk from Omotesando station. The exhibits were brilliant and the garden was well maintained. The service at the cafe was exceptional."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "What a Gem. This is my and wife's favorite museum in Tokyo. It is small, but so well done with frequent temporary visits and an interesting permanent collection. And the garden is not to be missed. It is tranquil, private (you feel alone), and quite larger than expected (water features, much flora, statuary, etc.). If you want a museum that takes 1-2 hours max., then this is the one for you."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Very worthwhile visit in a green oasis in an urban setting. Because the garden is tucked in a little valley among the buildings and it entails a spring and little creek, the views (at ground level rather than looking up) are superb. Some of the creek crossings are made of big stones that are not always level but you can visit a large part of the garden even with a stroller. The museum itself is easily accessible and has a sizable elevator. The exhibited collection is small but of great quality.We did not find seating in the cafe on a sunny Sunday afternoon but after our visit we walked 5 min to Yoku Moku (see that review)."
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Tucked away garden and museum. By all means go through the halls of art, but do absolutely step out into the garden. Enjoy a cup of coffee at the cafe. The garden is quiet, peaceful, and makes it hard to believe you're in Tokyo. Near Omotesando so you can shop afterwards. Near cafes and restaurants. A must stop while in Tokyo."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "An oasis of tranquility. Even if you not a great fan of museums this is a great place to go because it is small and well done. The garden is in itself worth it. I was impressed by the copper objects from the Chinese Shang Dynasty. "
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Beautiful Oasis of Calm. The Museum itself is home to some fascinating permanent exhibits and often houses amazing Japanese exhibitions - ceramics, screens, water colours, etc. There is also an up-market museum shop where some interesting souvenirs of your visit can be picked up.The real attraction, however, is the garden - particularly in Spring and the Autumn when the colours are incredible. Photographers, nature-lovers and anyone seeking a break from the noise and bustle of the city for an hour or two will love this place."
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "Interesting space. We happened upon this museum when we were walking around Omotosando. A nice space with a few small galleries. I would check the exhibits being featured, but if in the area, worth popping in."
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "Great small museum and beautiful garden. I went to Nezu Museum on a cold sunny afternoon in February 2015.The museum exhibits only a small part of the collection at a given time. But what collections! The artefacts are well presented and amazing. Sure only a portion is shown but in many cases it is better to spend time on a few items than to what to see everything. The garden adjacent to the museum is a much a draw as the museum itself. It is small compared to most of the parks in Tokyo, but one can see it was carefully designed and presents a multitude of different faces depending on where you stroll. I liked most the small temple with bamboos at the top. Note there are several tea houses in the park but you need to book them ahead. Recommended place to get away from Tokyo busy life."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Amazing Aoyama. Museums are really a part of Japanese life. It is heartwarming to see that so much love goes into this particular one. The museum is in the stunning structure by Kengo Kuma. Outside a beautiful garden and lake. The exhibit we visited we visited was on the influence animals have had on art and pottery in Japanese art for several centuries. All the magnificent pieces, scrolls and pots were there, beautifully preserved and presented. A must while you're in Tokyo."
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Nezu Museum. This museum was great to see but the english ability of the staff was not enough so its better you get a Guide book from the entrance the museum is well designed and has a very nice collection of Japanese tea ceromony highly recomended to japanese tea lovers"
        }, 
        {
            "index": 103, 
            "rating": "3", 
            "review": "Great garden, Average exhibition.. The Nezu museum was very famous for its Japanese garden. However, the exhibition itself was not as remarkable.As of the garden, I recommend that you plan 1-2 hour(s) for it, if you love Japanses gardens. It is absolutely quite, despite the fact that it is located in one of the busiest areas in Tokyo, Omotesando. You can see skyscrapers in the background where crystal-clear stream flow underneath your feet. Do have a seat on the benches and FEEL the quiteness and harmony in this beautiful garden, don't rush.PS. Please check the opening times before you go. The first time I went there on a snap decision and turns out they were closed on Mondays. Don't be a fool like me."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "A nice museum with a fantastic Garden!. Here you are a video I made of the Garden https://www.youtube.com/watch?v=411jpe3deaY&list=UUAxMEpfzdJ2dkrplSWehgcAThe Nezu Museum was first a private property owned by Nezu Kaichiro (1860-1940) president of the Tobu Railway in Japan and became later the museum that you will visit. This museum houses a huge collection of Chinese bronze pieces and other artifacts, paintings and calligraphy (7,400 objects).But by far, my favorite place of this museum is Nezu Kaichiro's garden where in summer you can see Tea ceremony professional gather and meet for private exhibitions in the garden many Tea Houses."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Gorgeous Little Museum. Located in posh Aoyama amid fancy premium brand stores (Prada, Cartier, etc.), Nezu Museum is small but the building is gorgeous (Kengo Kuma is the architect), and has a spectacular garden. I believe it is built on the site of the Nezu family mansion."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Two for one: amazing museum & gardens. Step away into another world to this quiet museum away from the noise of Tokyo. The exhibits change and it is worth looking online for what you are interested in, but it is a beautifully designed building with varied interesting exhibits - from pottery to screens, kimonos to sculptures. The gift shop was the best we saw during our week in Tokyo - small but packed full of interesting objects. The gardens are simple and elegant with interesting paths and great objects throughout the garden to look at. There was a nice looking restaurant in the garden that looked enchanting, but i did not go to it."
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "super cute little Japanese garden down town. this is a real gem. we have been living on tokyo for 2 years now and this place is one of the cutest we have seen so far. tiny park but well worth the visit. will be back in summer. there is a nice cafe with a view to the garden pond. food didn't seem expensive either."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Great Garden. Nice museum with a huge and beautiful garden. Great for a break from the cityscape. The exhibition inside was ok, not great."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Delicate Design. An ideal museum for an autumn a’noon. A small exhibition (nice for a change), in a beautiful designed museum. The cafe is a wonderful construction with views into the beautiful Japanese garden. Nice menu. All very refined, stylish and relaxing."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Trip to Nezu Museum. For a first time Japan traveler, I was pleasantly surprised by how amazing the garden of this museum is. Through the designed path , you will be embraced by the Zen atmosphere and beautiful artifacts around you. You will feel the beauty of nature even you are standing in the one of the busiest city in the world. Aside from the beautiful garden , you will also find amazing culture artifacts in the museum. In Nezu Museum, there are few National Treasures of Japan such as full script of pictures of Tale of Genji and etc. If you are visiting Tokyo for the first time , remember to take the time to visit this museum."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Great little museum. A great place to visit. The garden is an excellent example of the Japanese style in a small space. The museum had a fascinating exhibition of early sculpture and bronzes. The early painted scrolls were delightful. Well worth a visit."
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "Great museum. I enjoyed this museum especially the grounds. It is a small private that is tucked away on a small out of way street. The exhibits are alright. What I really liked were the grounds. It was a peaceful walk through the grounds. Up and down stone stairs through some old gardens. I would recommend this museum."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Best place to get used to Japan culture.. The best garden I've ever seen. It was not only carefully cared but also very unique in its own way, especially on Autumn, when you can see the leaves turn yellow. The museum was great too, but the best place imo was the tea ceremony places."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "An Oasis in the Heart of Tokyo. The Nezu museum is a wonderful place to escape the bustle of central Tokyo. The museum features rotating exhibits of the Nezu collection, most of which are exceptional. The real draw for me however is the garden at the museum. This is a masterpiece in its own right... a fabulous place to sit and have a cup of tea in one of the teahouses or simple unwind under the shade of a tree."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "A museum with beautiful garden!. This museum located in quiet place, in Western Tokyo, few blocks from Harajuku. I went there to see its garden and I must admit, this is one of the most beautiful garden in Tokyo. It is small, yet it has so many unique characteristics. Tea ceremony places, pond, bridge, hill structure, not mentioned beautiful trees and flowers inside it. I was there on autumn, and I really enjoy it."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Amazing Japanese garden in the middle of the city.. If you find yourself in Tokyo and want a real treat go to the Nezu Museum. The museum is ok, but what is really cool is the garden. You will feel as if you are in a completely different world. And no matter what you do for the rest of the day, you will feel tranquil and relaxed. Check it out."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Beautiful Museum!. Though this was a smaller museum, the exhibits were laid out beautifully. I was able to see the pottery exhibit through the ages as well as hand painted scrolls. These were both amazing exhibits, however unfortunately there were no photos allowed in the exhibits! There were also some beautiful Buddha statues in the main hall. I had lunch at the café in the gardens behind the museum which was delicious and I walked around the gardens which were beautiful. I would say this is a must-see if you are interested in the arts!"
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Wonderful museum. Stunning garden in the heart of Tokyo. Great for a photographer.The museum has new shows all of the time. A great way to spend a few hours while in Tokyo."
        }, 
        {
            "index": 119, 
            "rating": "4", 
            "review": "Nice small collection and beautiful garden. I really liked how intimate this museum is. It's in a good location, walkable from Ometesando or Roppongi. It has a small collection in six galleries on two levels. The main building is gorgeous and was constructed in 2009. I fell in love with a \"Zun\" in the shape of two sheep that is housed in the first gallery on the second floor, which happens to be the motif of many items in the gift shop.Make special time for a stroll in the gorgeous grounds of the Japanese garden.Overall, you can see this museum in about an hour."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Welcome respite from urban exploring. I live in Tokyo and have been lucky enough to visit this museum numerous times. I have seen special exhibitions on both samurai swords and stunning Iris printed screens. There is also other rooms which display selections of their collection.However, in my humble opinion the best reason to visit this museum is to take a wander around the winding paths of the gardens and visit the tea room / restaurant. The gardens contain many artefacts from the museums collections as well as tea houses. The tea room / restaurant is (like to museum itself) a modern building designed by Kuma Kengo (who has designed the new V&A building to be opened in my hometown of Dundee, Scotland). I am no student of architecture but the spaces created are art in their own right.Well worth a visit after exploring the uber trendy shopping around Ometesando.Access: 8 minute walk from Exit A5 of Omotesandō station of the Ginza, Hanzōmon and Chiyoda subway lines.My Top Tip: Take time to visit the gardens and restaurant / tea room."
        }, 
        {
            "index": 121, 
            "rating": "1", 
            "review": "Closed for nearly two weeks. I made a special trip to visit the museum only to find it closed with a typed notice at the gates saying the museum was closed from the 14th to the 25th July whilst exhibits were changed. It was a huge disappointment and I'm surprised that any museum has to close to change exhibits let only for nearly two weeks."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Only a hint of the Nezu collection is displayed. Only a small selection of the Museum's large collection is on display at any one time so depending on the timing of your visit you may or may not be lucky enough to glimpse one of Japan's National Treasures. I was very disappointed I didn't get to see Ogata Korin's Iris screen or see more Japanese works on display - the website makes no mention of which works are on permanent display. However, the Chinese Ming & Qing works being exhibited in June were beautifully displayed in this well curated exhibition. I was very happy to see the Buddhist antiquities and rare Chinese bronzes. I guess the key is that you can come back and experience something different with each visit.The stroll garden is quite a nice, verdant haven in urban Tokyo with Buddhist sculpture dotted around but the prevalence of strongly worded 'keep off' signs in English are too harsh and jarring with the Buddhist philosphy that permeates the garden ( a simple 'closed to visitors' would suffice on the signs). Disappointingly pathways are blocked and you can't really see much of the outside of the tea houses - sad because much of the Nezu collection has an emphasis on tea ceremony. There's a modern cafe in the garden but prices are high at around ¥700 a coffee - lots more choices down the street. The architecture of the Museum building is probably worth a visit alone."
        }, 
        {
            "index": 123, 
            "rating": "4", 
            "review": "Wonderful garden!. I went to the Nezu museum because of the good rating here on trip advisor. I wouldn't say it was the most interesting exhibition in Tokyo... but the garden is wonderful! If it weren't for the beautiful garden I probably wouldn't have been so happy about my visit. It might be worth a visit just for the garden actually!"
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Beautiful exhibits and gardens. The Nezu museum itself is beautiful architecturally. Exhibits include Ming and Qing dynasty ceramics and lacquerware, and much older Shang dynasty brassware. There are also some impressive shanshui artworks and fabrics. I'm no expert, but at a guess, I'd say that the museum's claim to have a world renowned collection would be credible. I didn't see a lot of information in the museum literature about how the works were amassed, and would be interested in that.The highlight of the museum for me was the garden, which was well set out, and dotted with some beautiful stone artworks. A nice place to wander around, and the kids appreciated it as well.Overall, this was an interesting way to spend a half day, and the only charge was for adults at ¥1000 each. It's close to Omotesando and Nishi-Azabu, and we walked to Azabu-Juban afterwards for an ice-cream."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Nice museum on beautiful grounds. You can make a nice afternoon at this museum. Head to the Nezu Cafe for lunch (which is in the museum garden), post lunch walk around the garden for 45 mins or longer. Take in the natural beauty that nestled in the hectic city. After your garden walk, enjoy the galleries in the museum. It all makes for a simply delightful afternoon filled with peace and tranquility. As for the galleries, they currently have a beautiful selection of 17th-early 19th century potter and ceramics. "
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "Wonderful Garden...and interesting displays. This museum in on large grounds most of which are covered in a wonderful Japanese garden. Many excellent tees and plants...with a small lake in the middle. This alone is worth the admission. No grass area for children but worth the walk around.The museum has over 7000 pieces a small portion of which are on display in one of 5 medium sized rooms. When I visited there was an outstanding display of ancient Chinese bronze jars...some dating from 13C. This was excellent. Also displayed where some screen paintings from the 1600. Other displays included tea sets and a small number of ancient Buddha's. The pieces are all high end.....with nothing substandard on display.Easy to reach from the train station...about 60m walk from the entrance. There is a restaurant and separate tea house on site..both heavily used."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "A minimalistic art gallery with a stunning garden. Last week I went to Nezu Museum for my second visit. This musuem/art gallery should be on everyone's must visit list and is in the Aoyama/Omotesando area. The museum/gallery building is very modern with a lovely entrance of bamboo, pebbles and concrete. The museum itself isn't very large and has two floors. The upper floor tends to house a permanent and somewhat eclectic collection of pieces owned by Nezu. The times I visited, it included a collection of very ornate gold antique clocks and some lovely ceramic urns. The ground floor tends to have different exhibitions every few months and the one I saw most recently was an exhibtion of hand painted wisteria and iris themed screens which I believe is an annual exhibition which coincides with the blooming of irises in the museum's garden.Even if you are not much of an art enthusiast, Nezu still has a lot to offer- in my view the main attraction of this venue is the stunning multi-levelled garden. Once you start exploring what it has to offer, you will be amazed to think all of this lies behind the Museum walls. The garden has ponds/water features, little bridges, winding paths, tori gates, shrines, an old traditional tea-house, stone benches and areas to sit and admire the view and numerous stone lanterns and buddha carvings of all shapes and sizes. It is heaven for the photographer, especially in Autumn when the contrasting leaves are amazingly beautiful. Recently the irises were in bloom in the pond and this also made for some lovely photos. If you have time, stop and have lunch at the cafe/restaurant- the food is reasonable but the view is stunning. The cafe building is very simple in its design, choosing to focus on the lovely garden views. It cost us ¥1000 to enter the Museum and the average price of a meal at the restaurant was around ¥1000 also. But on a weekend, be prepared to que for a table as it is not very large and gets quite busy.Nezu Museum is a good attraction to combine with a trip to Omotesando and Harajuku if you want to spend a full day there. On the way to Nezu, you will pass all the swanky designer shops like Prada and Comme Des Garcons which have either interesting shopfronts or are hosued in interestingly designed buildings."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Lovely Japanese museum in upmarket Aoyama. An easy walk from the upmarket Omotesandou and Aoyama, and a great way to relax after getting tired of the crowd and shops."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "Beautiful and modern. There was an exhibit of Japanese screens while I was there. Very beautiful. The gardens are large and worth wandering through."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Great recommendation! With more than one must see item. One of our local guides recommended we go to this museum to see the beautiful Iris painted screens. These screens were indeed fantastic although I thought the wisteria painted screens were even more beautiful! These screens are a must see and there are other interesting exhibits. The other major attraction of this little gem is the small but really beautiful garden! We had a delightful 30 minute stroll around and strongly recommend you do the same!"
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Nezu Museum - Japanese Garden is beautiful. Beautiful and relaxing Japanese park with the museum. Nezu is close to Shibuya, Omotesando and Harajuku. Green, water and tea houses. You have eat at Nezu Cafe. The Japanese garden was the property of a Feudal Load back to the Edo Period with its collections of ancient stone monuments. You can spend on walking and be relaxed in the park for some hours easily.It will be especially good if you are tired of Tokyo Metropolitan sightseeing."
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "A beautiful garden!. I went there to see the special exhibition of the National Treasure Irises screens, but I have finally enjoyed more the beautiful garden. I was specially surprised by the tranquillity you can find in the middle of Tokyo... If you go on May, you can also enjoy irises blooming in the garden pond."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Travel outside Tokyo without leaving. One of my personal favorite museums and experiences in Tokyo. A fine, small, manageable spot. The main feature to me is the excellent garden, which is set up in such a way to make it feel much bigger than it is, and much more remote than it is ( in the center of the city!). You'll feel as if you left Tokyo for a short while."
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "Really wanted to go but currently closed till april 18. Was eeally excited to see to see the gardens but unfortunately the museum itself is closed till april 18th due to installation works. Unfortunately im leaving tokyo on the 12th. Hope this helps ppl"
        }, 
        {
            "index": 135, 
            "rating": "5", 
            "review": "Go there in the rain if you can. If you like gardens, architecture and art, this is the place. The rain adds more color variety to the plants, rocks and sculptures. Makes the moss stand out. The art collection is small but interesting. The well cared-for garden is the highlight."
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Peaceful thoughtful retreat. Perfect for an hour or two with a leisurely walk through the garden. The cafe was a nice surprise with piano music, dessert, afternoon tea and beautiful view."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Come and Visit. Being a bit of a history buff, I decided to pay a visit to the Nezu Museum in Tokyo to broaden my knowledge on Japanese art and history. It was literally a trip centuries to the past. The garden that filled the vicinity was very stunning that you seem to forget that you are in busy bustling Tokyo. It is definitely a place not to be missed out on."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Strongly Recommended. Excellent visit. The statues and garden combine together to make for a superb experience. This takes you back a few centuries. Definitely recommended"
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Great museum and beautiful garden. The museum has various art exhibitions but I liked its garden even more. It's an oasis in the middle of a busy Tokyo area so if you're into Japanese art/sculpture or gardens, the museum will not disappoint you."
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "An oasis in the metropolis. Visited the Nezu Museum on a business/pleasure trip to Tokyo in October. Its an amazing building, recently renovated I think with an lovely peaceful garden - welcome rest bite from the frenetic city. A great exhibition and permanent collection - really inspiring and well worth a visit."
        }, 
        {
            "index": 141, 
            "rating": "3", 
            "review": "Nothing special but a tranquil pocket in a go-for-broke-trendy spot.. The Nezu Museum and its gardens offer a two fold experience. Architect-of-the-moment Kuma Kengo's somewhat flat, yellow bamboo-dotted, straight-lined architecture is like all his other buildings, but it does house some genuine wonders, although shown around the year bit by bit. The gardens are conventionally inviting and can offer a tranquil, green getaway from the empassioned, frantic fashionability simmering everywhere on the streets outside, an area where what you wear seems to be who you are. There are three elegant and rather simple sukiyazukuri style teahouses in the garden, and several ponds, one infested with mosquitoes at certain times of the year. Still, on weekday mornings when there are minimal crowds, the garden can be a delightful place for a secret paper bag picnic while taking in the greenery and, according to season, many colorful azaleas. The teahouses are used by kimono-ed tea ceremony aficionados and their study groups and they get a bit possessive if you happen to pass by and want to have a look while they are conducting their little tea-in-slow-motion rituals. The interiors are worth seeing. The landscaping around the teahouses is a very typical example of Japanese gardening and quite inviting - if here and there just a tad...comment dit? ... precious. Nowdays the uniformed guards see to it you cannot enter the garden without buying a ticket to the museum, which wasn't always the case. I'd recommend you avoid the place during peak hours when too many people clomping by will ruin the ambiance. And do have your hotel check out what the museum is showing when you're in town. The Nezu owns some breath-taking national treasures but they are on display for limited durations, then replaced by more mediocre attractions. I have never found the staff working there especially gracious towards foreign visitors, whom they can tend to regard with tentative suspicion."
        }, 
        {
            "index": 142, 
            "rating": "4", 
            "review": "Gorgeous Garden in Nezu Museum. Nezu Museum is a must visit you never want to miss it . It s not hard to find . It might not be boring . On the other hand, there are a lot of special exhibitions here. There are many sorts of art such as : painting, sculpture and especially bamboo craft . The artists are so skillful to creat many masterpieces like that . Moreover Nezu Museum has a gorgeous garden . It s covered by green with blooming flowers . Trees are taken care of carefully . This museum gains high quality of art . Nice relaxing!!!!"
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Fantastic Museum in Beautiful surroundings. This museum is a real hidden gem in the busy Minami-Aoyama district of Tokyo. The architecture is stunning and the museum garden is also beautiful. Having lived right across from the museum for several years it has been a delight to see the renewal of the museum, and the new and beautiful architecture. Well worth a visit!!"
        }, 
        {
            "index": 144, 
            "rating": "4", 
            "review": "You'll forget where you are. It's located bang in the central Tokyo but does not look it. The permanent collection might not be particularly exciting but there sometimes are very interesting special exhibitions. If even that doesn't interest you, it'd be nice to walk around the garden to rest after shopping (or whatever) around Omotesando. (Wheelchair access to the museum but not really in the garden)"
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "Good for the archaeologist in you. Many nice artifacts. Interesting gardens. Be careful of the flies! They bite with a vengeance! You can visit this place after strolling through Omotesando. It's at the end of the street."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Old meets new in Tokyo. This was an amazing museum. Architect Tadao Ando creates an incredible housing for the statues but the gardens are the true magic which are reminiscent of imperial Japan. I strongly recommend a stop there for anyone (especially first timers) visiting Tokyo."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Good Museum and Outstanding Gardens. This museum is very good for aficionados of the arts but the outstanding garden on the museum grounds is something everyone can appreciate. I was oriented to this situation after reading the TripAdvisor reviews so this experience lived up to my expectations. The museum is not hard to find as it is about a 450 km walk after turning right at the top of the A5 exit from the Omote-Sando Station. There is a sign when you emerge from the Metro exit to impart the confidence you are on the right track. The museum is at the end of the street and you literally walk onto the entry sidewalk as you cross the T-intersection. The cost for the museum is a little high (1200 yen). If not for the garden, it would not be worth it but I say that as one marginally interested in the type of art they display. Others may find the museum well worth it. There are six galleries in the museum featuring different types of art including ceramics and pottery (Japanese and Korean), sculpture (featuring mostly Buddhist pieces), bronze work and wood block painting (ukiyo-e). My favorite display in the museum, however, was the one depicting tea ceremony art and artifacts. This is uniquely Japanese and was, thus, something I could appreciate more than the other displays, though many of the pieces in the other galleries were quite lovely. I spent significant time soaking in the tea ceremony display whereas I surveyed the rest of the galleries stopping to admire select pieces that caught my attention. This kept my visit in the museum to an hour or so as I really wanted to get out to the garden, which was all it was purported to be. The garden grounds were sloped as one enters the green space. The loveliest arrangements are found as one descends to the bottom. Getting there, however, was very serene and relaxing, which is the major attraction to all Asian gardens. There are several notable findings in the garden including structures, sculptures and specific green arrangements. I spent as much time in the garden as in the museum. It is worth noting here was also a small restaurant on site at the garden entrance you need a quick refreshment. I did not sample the restaurant though it appeared quite nice from what I could see. If you like Asian art or Japanese gardens, consider putting this place on your Tokyo itinerary."
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "go for the garden. My boyfriend is obsessed with tea, and marveled at the beautiful tea-tools/ceramics in their collection. However, the main attraction is clearly the garden. Tokyo has many formal parks and gardens, but this one is very special. Lots of little winding paths, carefully crafted views, and a pond. We spent the whole afternoon here taking some time out and connecting with nature. It is worth the admission just to have respite from concrete."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "NEZU MUSEUM. I was expecting simply to see a Japanese screen exhibit, but I got much more than I anticipated...my visit included a glorious Japanese garden with stone statuary, winding paths and serene ponds. The screen exhibit was lovely, and the permanent exhibit of bronze urns and vases was captivating. The architecture gave a feeling of airiness- no stuffiness in this setting."
        }, 
        {
            "index": 150, 
            "rating": "3", 
            "review": "Caution. We were unable to visit this museum which was closed for 10 days to allow for removal of the current exhibit and installation of the next. The walk from Omotesando station was worth it anyway, but this unexpected development was disappointing. Next time, we'll phone ahead."
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Excellent museum and beautiful gardens. A fantastic medium sized museum that is comprised of 3 floors. The museum itself has a very spacious feel, modern architecture incorporating traditional elements. The exhibit I visited was the Tea Tools exhibit, which was a extensive presentation of tea tools, raku ware and scrolls used in tea ceremonies. Many National Treasure and historical pieces were beautifully curated and exhibited. The garden behind the museum was much larger than I expected and what a sight it was! There is a beautiful cafe as you go towards the garden. Service and quality of food there is top class. As you walk down into this vast garden, you will see a few tea houses where they have tea ceremonies (check the website for schedule / availability as they are not in session everyday) and a lovely pond where there is an area of irises, when in season. You can see many jizou statues, beautiful landscaping and many types of vegetation throughout the property. I spent a good hour or so just roaming this lovely garden, very tranquil and an unexpected natural experience in the center of the city. I highly recommend it, and I personally would try to attend a tea ceremony next time I visit."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Beautifully Integrated Small Museum and Garden. When I visited the Nezu Museum the National Treasure on display was Ogata Kornin's beautiful set of iris screens, which were mirrored by a large iris display in the outside garden. This is a small museum with a high quality collection of Japanese art. The building is architecturally exquisite. It's a few blocks walk from the Omotesando station and shopping district. Definitely a restful place to spend an hour after shopping."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Small private museum worth your time.. Wonderful exhibit this month on large silk screens. Large collection of Asian art. At the end,head out to one of the best small japenese landscape gardens in this city. Really relaxing experience."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Fantastic Garden. It was raining and still, I was enchanted with the beautiful garden and didn't want to leave. There is a very peaceful small restaurant with direct views on the greenery. The museum inside has many interesting pieces and the most beautiful iris screens in Japanese art. But the most beautiful part is the garden with its many statues and lovely landscaping. Worth every yen that it costs to enter. Plan on spending at least an hour there."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "gorgeous museum and garden. Designed by the great Kengo Kuma, this museum is a real jewel in the heart of Tokyo. The entrance walk, lined by a bamboo wall and a wall of living bamboo, is a gorgeous and serene transition from the busy shopping district to the quiet museum. This is one of Kuma's loveliest buildings in Tokyo, and worth a visit for the architecture alone. The collection is also worth seeing, and the gardens are beautiful."
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "Delightful art collection - gorgeous garden. The Nezu Musuem is a small but delightful place to visit in Tokyo. The collection is small and features Japanese and other Asian pre-modern arts, including calligraphy, painting, sculpture, ceramics, lacquer, metalwork, bamboo crafts and textiles. There is a small but outstanding display of ancient Chinese bronzes.Once you have visited the Museum displays, you will be enthralled by the garden which deserves a visit. In Spring, the irises in full bloom are an attraction not to be missed!A pleasant rest stop is the Nezu Cafe set in the garden close to the main building."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Idyllic garden and perfect building on Omotesando, Tokyo. The Nezu has a small (and rather eclectic) permanent collection, but it is augmented by sophisticated temporary exhibits. The art collection belonged to the railroad magnate who gave the museum his name. The Japanese garden (with a lovely tea room) is an exquisite surprise in the middle of Tokyo, but we actually went for the architecture. Kengo Kuma is the architect and the perfection of details begins at the entry, with a walkway covered with stones (much larger than gravel) and flanked by a wall of bamboo. We saw a temporary exhibit of instruments for the tea ceremony. It was the kind that puts tears in your eyes because of the that goes into making a knot for tying a tea bag that then goes into a very simple and very beautiful box. I shall not repeat what others have said, but since we are interested in contemporary architecture and the Suntory Museum, also by Kengo Kuma, was closed for the preparation of a new exhibit, the Nezu remains a high point of our days in Tokyo. It is in Aoyama, on the street that continues Omotesando Ave., which is a display of both modern architecture and expensive designer shops. Everyone will tell you to not miss the Prada store (by the Swiss architects Herzog and De Meuron) but we preferred the flagship store of Comme des Garcons by Future Systems and the Dior shop, both by Studio Sanaa.and, of course, the Omotesando Hills Center by Ando Tadao."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Small exclusive museum with Japanese garden. This museum is located in a peaceful corner of Tokyo, in Aoyama 6 chome, not very far from Omote-sando tube station. On the way to the entrance you will already feel you are hearty welcomed by bamboo hedge. The museum building itself is not huge but well designed and petty modern. It is a comfortable contrast with a large and beautiful Japanese garden. Mr. Nezu, who had helped establish one of the most successful railway companies, collected mainly valuable Japanese pieces of art from 17th and 18th centuries. There are also some impressive Gandhra Buddha statues, ancient Chinese art etc. some of which are National Treasures. The most impressive one is perhaps a Byobu (screen) with Japanese daffodils / Irises. The museum’s Japanese garden is worth walking through after the visit to this modern museum building. http://www.nezu-muse.or.jp/en/information/index.html"
        }, 
        {
            "index": 159, 
            "rating": "5", 
            "review": "An excellent museum. I visited this museum last year and this year I took my friend back because I was so impressed the first time around.Ogata Korin's Iris screens are a permanent exhibit so only to see that it's worth the admission price. It has enough artwork to keep you engaged but not too many to bore you.When you had enough of the arts, you can spend another hour in the AMAZING garden where you can appreciate beauty, tranquility, peace, quiet. The gift shop is really decent with unique items to take home and the coffee shop serves not only cakes but light lunch."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "An Oasis and Architectural Gem in the Middle of Tokyo. The Nezu is an old museum--it opened just after WWII on the Aoyama estate of a wealthy art collector--but its gorgeous building is only a few years old. It was designed by Kengo Kuma and is not only an ideal showcase for Nezu's collection (which includes Buddhist statues, scrolls and tea ceremony implements) but an incredible window on its gardens, which are lovely and extensive. You'll want to spend at least as much time outdoors as in, since the gardens feature walking paths, a teahouse, superb statuary and a koi pond. There are also many wonderful trees. Although the Nezu is located in the heart of western Tokyo, it's possible to block out the city entirely and imagine a time when the estate wasn't surrounded by tall buildings. A must-see. There is excellent elevator access for those who can't manage the stairs, including an exit to the garden, although some of the paths have steps."
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Beautiful garden and superb museum. What a gem in Aoyama. The garden is so beautiful and peaceful. The museum is a perfect size, about 6 galleries which are well laid out and the curation offers both Japanese and English descriptions. The modern design of the building itself is worth seeing as are all the traditional tea rooms in the garden. The museum shop is a delight too. A must to visit if you are in the area."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Delightful Haven in the City. Excellent collection with continuously revolving exhibits so that each visit is different. The garden area is amazing, unique, full of statues, a new view around each corner of the winding paths. The iris were just starting to open today, hints of purple dots among the leaves. The restaurant is in a beautiful setting, with lovely light meal options."
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Small museum & lovely gardens. Located close to Shibuya ward, museum is small with about 5-7 exhibits at any one time. Allow 1 hour to tour museum & 1 hour to enjoy garden & water features. There is a cafe with limited menu & a tea house + gift shop. Entrance is ¥1,000 per adult, kids free. Ideally you should attend on a sunny afternoon to enjoy leisurely walk though gardens."
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "Serene Modern Jewel of a Museum. Rebuilt and so serene with a lovely collection and garden. I always tell Tokyo visitors to go. Edo period screens and living treasure works as well as excellent Chinese ceramics."
        }, 
        {
            "index": 165, 
            "rating": "4", 
            "review": "A Delightful Visit. The museum is newly built with architectural merit but has some very old exhibits including a superb collection of ancient Chinese bronzeware, some incredibly well preserved.The exhibits are rotated around during the year and the iris paintings unfortunately weren't on display when we were there but the Nachi Waterfall paintings were arresting and powerful and I had to circle back for a second view.We were lucky to strike the Zeshin Lacquerware exhibit by 19th. century artist Shibata Zeshin with some fascinating utensils and the beautiful black and gold box. Also there were some lacquerware containers with lids designed for take home food- scraps from banquets and the forerunner of our \"doggy bag\".The Nezucafe restaurant is a separate building at the start of the 2 hectares of gardens. The food was simple and good and a reasonable price, and if you can get a table at the window you get a beautiful garden view.An after-lunch stroll through the gardens is wonderful. We had the autumn colours and there are four teahouses, ponds, bridges and statuary including an old bronze Buddha."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Traditional Asian Antiques. Also very nice garden -- high place for tea ceremonies. Exhibits rotate and are of high quality.Close to many fashion shops."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Lovely museum. This is a gem of a museum for those who are interested in tea ceremony, gardens, tea houses and Buddhist sculpture. It is in the Otomesando area, so the neighborhood has interesting modern architecture, shops and restaurants. The cafe on the museum grounds has a lovely view, but the tea choices are disappointing (mostly English style instead of Japanese). They have a good website and their staff does respond to emails if you have questions about exhibits which will be showing during the time you are visiting. I anticipate returning next time I am in Tokyo."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Lovely way to spend an afternoon.... Nezu Museum is one of Tokyo's many gorgeous museums. Recently reopened after long closure for renovation, it is more beautiful than ever. Nice permanent collection and gorgeous Japanese gardens on the grounds make this a perfect way to spend a quiet few hours in bustling Tokyo."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Always a pleasant afternoon. The Nezu is a private musuem, completely renovated and rebuilt in 2010. The building itself is worth the trip if you have any interest in excellent contemporary architecture and the art works are a big plus. The garden and its tea houses are not to be missed, plan a good 45 minutes to tour them in addition to the time in the museum proper.The Shang Bronzes on the 3rd floor are absolute treasures, and the museum has consistently good, interesting and well curated shows. Obviously the museum staff knows English well and signage on permanent and temporary exhibits is consistently good, accurate and informative.Combining this and the Ota Ukiyoue Museum will make for a very pleasant way to spend a day.The museum resturant is good, but nothing great. But a nice place for a cup of coffee and a sweet, particularly if there is a window seat available with a view of the garden.There is a viking buffet Riata near the Ota which has good food and is reasonably priced on weekdays, they raise the price for the same thing on weekends and holidays though.Enjoy."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "superb museum at Omote Sando. This is a wonderful Japanese museum to visit again and again, and appreciate not only the exhibits but also the building itself and the adjacent garden."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Nezu Museum and Nezu Garden. The museum is beautiful but the park is really amazing, just walking there with family or friends make a nice day, we can see sometimes a tea ceremony ."
        }, 
        {
            "index": 172, 
            "rating": "2", 
            "review": "Overrated. As other reviews have mentioned this museum has a beautiful garden and not a lot of exhibits. After only a half hour, my wife and I couldn't believe we had seen everything the Nezu had on display. We spent another 45 minutes walking through the beautiful gardens, but considering the number of public parks & gardens in & around Tokyo, the 1000 yen entrance fee was too expensive. In Jun 2012 the museum was showing 14-15th century tea ceremony pottery, a few bronze vases & statues, some tacky 19th century English clocks and a little art work. If the price were no more than 500 yen, I'd give it 4 stars, but for 1000 yen, I can't recommend it."
        }, 
        {
            "index": 173, 
            "rating": "3", 
            "review": "A nice private museum - but could do better. I enjoyed a nice pleasant hour of looking at the exhibits and strolling in the great Japanese garden. I love to spend hours in museums, but was disappointed a bit because they show so little of their large permanent collection. They could have built more rooms for exhibition instead of many teahouses in the garden, nice cafe or the hall on B1F. I would have easily given five stars if the person in charge were more keen on the idea that museums are meant to show and educate.I find it sad that many museums (or art in general) in Japan are privately owned and show only small part of the collection. Also, there is a bad tendency to invest money on building fancy galleries with no permanent collection- which is ridiculous, when there are enough such galleries existing. While the building of the Nezu Museum, or the Yamatane Museum not far away, are great, they could have put more emphasis on displaying their collections as much and as best as they can."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "A Private Museum. Been to Tokyo many times but have not been to a private funded museum. This was a fabulous find. The walk from the subway station was quite long but enjoyable with the many shops and the street lined with azaleas which were in bloom. Seeing the works of art in the galleries was just about right that you didn't get bored. The outstanding feature was the Japanese garden with acres of walkways."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Hidden gem. The Nezu museum is a great find. It is definitely off the main tourist routes, to the point that many Tokyoites also are not that aware of it. The building was recently completely renovated and is set in a magnificent garden, which is reason enough to visit (there is also a tranquil new coffee shop with beautiful views).The museum is very central and easy to reach from Omotesando or Aoyama. It is rarely quiet and is a welcome escape from the hustle and bustle that surround it."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Museum is great but the garden is fabulous. You feel like you are in a private garden far from the city. Great place to wander for hours in spring. My favorite time to go is fall. The colours are amazing."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Gem of a museum with a beautiful garden. This is a lovely little gem of a museum specialising in Asian art and artefacts. Whilst the great majority of visitors seem to be Japanese, there are signs in English at the entry to each gallery  with an overview of the items on display. The museum itself is not huge, but there is a garden out the back that encourages exploration, with various tea houses, ponds, waterfall, shrines and centuries-old statues dotted alongside winding paths - it was a lovely way to spend a sunny afternoon. There is also a small cafe on the grounds that affords a beautiful view of the garden. If you have time, I would recommend a meal there. The prices seemed reasonable and we very much enjoyed our afternoon tea in the tranquil setting.  The cafe was also popular with other visitors, and a queue quickly developed soon after we were seated, but they didn't have to wait long for a table. Of note, too, is the walk to the museum from Omote-sando station. While the road itself, being not very wide nor shadowed by large buildings, has something of the feel of a backstreet, it is lined with big name stores (e.g. Prada, Cartier, Chloe, Issey Miyake) that quickly put paid to this impression. The Prada building was an architectural show-stopper, with bulging glass windows that covered the entire structure. I also loved the Japanese minimalist aesthetic and the interplay of concrete, wood and glass in the museum. "
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "Doll Festival and Irises and Eight Bridges. Two great exhibits: the Hina Miniatures of Meiji Emperor and wife, royal characters, samurais and pesants are precious and the exhibit of Japanese painting from the Edo Period (Irises on gold background) is beautiful. Some poetry on caligraphy can be also seen."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "oh oh oh. Our Japanese friends took us and we were totally wowed and charmed by the beautiful multi level gardens in the heart of the city as well as the lovely art work on display in the modern spacious museum. The cafe is a lovely space where we had a great lunch."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Hidden Tokyo- Romantic and Lovely Small Museum. I like to take special people to Nezu Museum. It is quiet- and a bit off the beaten track. You can easily walk there from Omotesando Crossing...down the wonderful shopping street featuring designers such as Yohji Yamamoto, Issey Miyake and Rei Kawakubo- and the stunning Prada building is an architectural wonder! You may enjoy lunch with a garden view at the museum. It is perhaps the most \"Japanese\" of the museums in Tokyo. It does not feature Western artwork like many of the National museums in Tokyo- whose cur"
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Often overlooked, but very Japanese experience. I had never even heard of this museum before until a visitor pointed it out to me raving about its charm. I finally checked it out and it was amazing. Try and go on a weekday and there will be few people. Probably only need to spend a couple of hours there but well worth it."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "\"New\" Nezu museum - quite wonderful. This place has recently (Oct 09) re-opened after a long period shut for refurbishment. The museum itself is lovely - fairly small, with regularly-changing exhibits. Everything's clearly labelled in English as well as Japanese, and the place is beautiful: a great example of how museums should exhibit their treasures.On its own, I'd probably give the museum three or four stars. But what makes the Nezu institute so special is the quite, quite wonderful garden. You can comfortably lose yourself amidst the tree-lined paths for half an hour or more, and it's truly beautiful. Quite unexpectedly, this place turned out to be one of the highlights of our Japanese trip: a real hidden gem, and very highly recommended."
        }
    ]
}