{
    "category": "Tokyo", 
    "entity": "Ryogoku-Kokugikan", 
    "avg_rating_stars": 4.685106382978724, 
    "review_count": 235, 
    "rating_stats": {
        "poor": 3, 
        "average": 8, 
        "terrible": 0, 
        "very_good": 49, 
        "excellent": 175
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Amazing sumo tournament!. Having never seen sumo live before, I had no idea what to expect. I thought I'd be bored after an hour. Not so! Sumo matches are short but very exciting to watch, and the crowd was great and supportive of their favorites. We paid about $90 for two people, but this is for mid-tier, all-day seats so I don't consider it expensive. I do recommend buying tickets on your own in advance, rather than going through some tour agency, because the stadium is really easy to get to and fun enough without a tour guide (and the tour guide's price markup!). I recommend getting chankonabe for lunch or dinner nearby--if you do you won't need to eat again for quite a while!"
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Sumo tournament, absolute highlight. Came here for a sumo tournament, one of the coolest things to do in japan. Traditional japanese culture and exciting combat all baked into one!"
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Great Tokyo spectacle with Sakai. A great event particularly on a rainy day if in Tokyo. The seating is very well organised and drinks and food are delivered to your matt seating area. Great thing to experience with friends colleagues and enjoy a beer. The wrestling is fluid and constant change and really good experience. Everyone very welcoming and friendly neighbours sharing in the atmosphere."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "One of the most unique and captivating sporting events I've been to. We lucked into tickets to see a day of the September sumo basho (tournament) while in Tokyo for vacation, through the friend of a friend who couldn't use her tickets. The pageantry is so medieval it's like imagine if jousting on horseback had remained a spectator sport unbroken in tradition since the days of Henry the VIIIth. Sumo is also much more exciting live than via Youtube. The crowd is very into it, cheering and clapping at even the good moves during the pre-fight posturing that goes on. To Western eyes the pre-fight seems almost silly, like pro wrestlers pumping up the crowd, but it's actually the first round of the fight in a lot of ways, and live that's much more obvious than on video. Seeing an afternoon of sumo is a lot like watching an afternoon of baseball. There's a lot of sitting around chatting and eating (and just like in baseball, the better seats have waiter service, while the rest of us go to concession stands) punctuated by exciting action at measured intervals. There are people who find baseball boring and so I'm sure there are some who would find sumo boring, too, but to anyone who knows a little about the martial arts and who generally likes spectator sports, sumo live is a rewarding experience. The atmosphere is very genial and family-oriented, too, again reminding me of American baseball. ABOUT THE VENUE: There is a large trophy case with fascinating artifacts from sumo history in it, and on tournament days there are souvenir vendors, mascots to take photos with, etc. The \"box seats\" are four person platforms with cushions--you remove your shoes and sit crosslegged or lounge around. The upper deck appears to have regular stadium-style seats which might be better for westerners who aren't comfortable sitting on the floor."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "One to the best sporting events I've been to. First day in Tokyo on an eight day stay with the family. Bit worried that the a sumo tournament may not hold the attention of my two daughters and wife for the afternoon but was completely wrong.Had four box seats - you are in a a box with four cushions surrounded by couples, families, business men and friends. People are here for a great afternoon and you can feel it in the it air. We were there on the Friday before the Sunday final and things wee beginning to heat up.Like any big sporting event it's about the crowd, some drinks /food and the battle. As a newbie to this I would arrive around 3, get settled, drinks/food, meet the neighbours and prepare for the final session.Sumo is as much about the theatre as it is the bouts. If you can get hold of a ticket then go - it is something you will remember forever.The final bout was massively exciting and finished with everyone frisbeeing their cushions into the ring while cheering, chanting and clapping. If it can hold the attention of two girls 11/12 on the back of a 10 her flight it's got to be good."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Japanese national sport. If you are in Tokyo for the Sumo wrestling tournament it is worth going to watch .Tickets can be ordered in advance or bought on the day.The arena is huge. the wrestling goes on all day, best to visit for the final bouts as you get to see the better wrestlers - 3/6pm.Drinks , toilets, food and gift shops on each seating level.To appreciate the kills it might be best to mug up on the rules and etiquette of Sumo wrestling before you visit. Bouts can be over in 3 seconds but the pre bout rituals are interesting to watch."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "Sumo tournament. We had a great time at the sumo tournament. We managed to get tickets online ahead of time (we went on a Friday night, and it was sold out when we got there). When we got the tickets, they recommended either buying an entire box of 4 seats, or 2 regular seats. The box seats are mats on the floor, and once we got there we could see why they'd recommended buying all 4 seats; they're small and nothing in the way of back support. If you're not used to sitting on the floor for long periods of time and/or you have back issues or anything like that, you might want to consider the seats a level up. They're very comfortable and afford a great view of everything that's going on.The tournament is interesting, but unless you're really into Sumo, don't worry about showing up until around 5pm. The tournament starts at like 8am, but the good bouts are all later. The entrances of the 2 main groups are worth seeing, and you want to stay to the bow ceremony at the end. Getting out is a little crazy, so my suggestion is either wait til the crowd disperses a bit, and maybe try to find a place nearby to hang out for an hour, as the trains were packed solid (but what's Tokyo without a sardine-tight train ride, right?)."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "Sensational sumo. We were fortunate enough to be in Tokyo when the sumo tournament was on so it was a bit of a must do. I purchased tickets online on the day they became available so the good seats sell quickly. We sat in the boxed area with four cushions on the floor. This was squishy as my son and husband are over six foot tall but we figured it would be an authentic experience. We were there for around five hours so managed to make it work.I collected tickets at the venue - there are signs at kiosks that say \"will call\" which is terminology used on online documentation. You will need credit card number of card used to purchase to redeem tickets. There are plenty of food options at stadium and surrounds and a McDonald's across the road. I would highly recommend a sumo experience as it gives you a great insight to the tradition and sport."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Greatly entertaining!. Purchased tickets about two months before our trip and attended the sumo tournament. We went the second to last day (14th day, Saturday) of the September tournament. We arrived about 2 pm which was a good time to get there. They were wrapping up a session and many people started to arrive about 2:30. I would highly recommend getting the radio to listen to while you are there. They start renting them out at 2:30 and its $32 but you get $30 back when you return it. The English commentators were good and helped us follow what was going on.There are about 20 matches in the final session, going from about 4-6 pm. We followed along the bout sheet that showed the wrestlers with their record for the tournament. There were some excellent matches and one guy was 13-0 and he clinched the tournament win with a victory during this session. The crowd went crazy! The pre match warming up, etc is worth the price of admission. The ceremonies and rituals really aren't that long. Very cool venue and glad we went!"
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Sumo was unforgettable. If you're in Tokyo during September when the sumo tournament is on, you really must try and get tickets. We are by no means sumo fans, but it's one of those traditional, authentic Japanese activities that you can't afford to miss.The rules are relatively easy to pick up, and the atmosphere is fantastic - especially later on once the really good wrestlers start coming out. We sat next to a Japanese chap who shared his food with us, tried to talk to us about the matches, and encouraged us to lob our cushions once the last match was over!We also got a hand-drawn sumo picture which was signed in Japanese by the artist. Superb."
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Awesome!. Book at least a month in advance. Sumo is awesome. The only similar experience I have is a day tennis tournament in Wimbledon. If you are in September in Tokyo go for it! Sumo is only a few weeks a year. Tokyo in September, Nagoya in July, check for Osaka and another place (can't remember).At the Ryogoku Kokugikan in Tokyo a 4 persons box is J¥38,000 (about £70 per person). It is more expensive to get nearer the ring. Amazing spectacle. The price is for a \"box\" - an enclosed square with four low metallic bars and four thin cushions. There is a beer bottle opener attached to the rail. People take big bags of food - bento boxes on sale inside the venue. The sumo wrestling started in the morning with the novice rank, the top levels were after 2pm and it ended at 6pm.Quite empty until the big guns arrive. Cross legs sitting on the floor was hard work. Two in a box is comfortable, three a squeeze, four is like battling for elbow space on an economy flight, then add the legs! If four can stay in meditative lotus position that's fine, otherwise take turns to walk around, that's okey. Sumo wrestlers' special soup (Chanko) available downstairs, or taste the Chanko later at a restaurant (the Chanko Kirishina) belonging to a retired Sumo champion. After a day on the floor, you might want chairs to sit on, so head for the Chanko Kirishina's fourth floor (lift) and forget the ground floor tatami."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Incredible Sumo experience. One of the most unique and special experiences of our visit to Japan was watching a sumo tournament here.We had tickets for the whole day but arrived in the afternoon as the good matches are supposed to start, our seats were probably a bit further away than we would have liked but the really good seats are all mats to kneel on rather than seated.We didn't really have any idea what was happening with the actual matches or who was fighting but it was spectacular to see such athletes competing so hard for the fights.The arena was incredible and the culture surround the matches was fascinating to watch, I would definitely recommend anyone coming to Tokyo to try and see a tournament."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Sumo tournament. A fantastic afternoon watching sumo wrestling! I had wanted to watch sumo live since seeing it on the TV a long time ago and it did not disappoint.If you are in town when a tournament is on do not miss it"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Sumo sensation. The sumo tournament is on but you don't have a ticket. What do you do? Go anyway. Tip: hang outside the stadium at the food trucks and souvenir stores that are set up near side entrance. While fans queue up to get in, you have scored a top spot where the sumo big boys enter and leave. And they are happy to pose for photos. We snacked, enjoyed beer in the sun, watched matches on the food truck's big TV and had some sumo fun. When the tournament is not on you can visit a sumo museum. Next time. This was such a great experience."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "really a Japan experience!. book your tickets early online. as on the morning of the event, the queue stretches till almost the JR station. door open at 8am sharp. seats werent fill up then. you are allowed re entry once at south exit. so u have to exit and reenter south exit. you can take upclose photos and maybe with them, outside on the left side.. near entrance 4-6. really good deal watching them. there are food stalls and souvenir shops at level 1. level 1 need ticket as it is the more expensive seats. nonetheless a good experience. MUST visit if you are in Tokyo. do check out their website for the schedule. paid close to 100+ SGD for one pax. worth the $."
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "Sumo expirience in Tokyo. If you are in Tokyo during the sumo tournament, do not miss it. The tournament takes place in the Ryogoku Kokugikan (national sumo arena) which is placed in the part of Tokyo called Ryogoku. The arena is placed yust infront of the railway station, if you come with JR, if you come by subway it will take you cca 5 min. walk from the subway station Ryogoku. It is a whole day event, although the main competition starts after 15h.Do not miss the chanko nabe (stew for sumo wrestlers) which is served in the banquet hall in the basement of the arena( from 12h-16h, for 300 Y). The daily ticket allows you one reenty, so it is allowed to go out once. You can stroll through Ryogoku and try to have lunch in one of the numerous small restaurants in the tiny streets across the railway station. Tickets should be booked well in advance.All in all this a unique expirience for the Tokyo visitors which I strongly recommend."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Must check out, if in season. Sumo competitions happens for 15 days on the odd months in Japan and in different cities during the months. It's very much part of the Shinto culture.Our guide from viator was good and she explained in details about the different aspects of the match.It was very entertaining to watch the competition.I've been to Japan many times and this is one of the more memorable events, since sumo competition is very much part of the Japanese culture, although this sport is no longer fashionable with the young.The stadium was still fairly crowded for Day 2 and I'd imagine that it would get increasingly crowded and rowdy-fun was the competition draws towards the end.Tickets weren't cheap, but it's worth the experience :) You won't see this else where, but shopping can be done almost anywhere."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Best day we have had. If you are in Tokyo when tournament is on do not pass up the opportunity to see this. Amazing experience."
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Timed it right!. Couldn't believe our luck when we realised we had timed our Tokyo dates with the September Sumo tournament. Tickets weren't cheap but you have to do this if you can. The only reason this didn't get 5 stars is due to the uncomfortable seating arrangements. Boxes are marked out on the floor for 4 people to sit on cushions but they really only fit 2. Your back gets a knock on the brass bars around the box! Superb event though, very ceremonial. Highly recommend the radio rental (cheap) if you have never been before."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Highlight of my trip to Tokyo! . I was lucky enough to get a ticket for the Autumn Basho and it was the best thing I did in Tokyo. Tickets were easy to buy and pick up in English on the Oosumo website. It is really easy to see from anywhere in the stadium and typically there are people coming and going all day so once you're in you can sit in another free seat until it's occupier comes if you want. Food and drink is available inside but the queues can be really long during breaks between bouts. You can bring it in from the convenience store even though the sign says otherwise! I found the ritual and ceremony really interesting and the fight was exciting. I was lucky to be there when the best wrestlers were fighting. They walk around outside and you can talk to them and get pictures even though they are very famous in Japan, so if you didn't manage to score a ticket it's still nice to visit during championships and visit the Tokyo-Edo Museum as well. I'd love to watch sumo again next time in Tokyo."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "National sumo wrestling stadium. This stadium is for Sumo tournaments in January, March and September. The tournaments are hold in only two weeks. If you want to watch games, you should check schedule before planning your stay in Tokyo.Inside of the stadium, there are flat spaces on the 1st floor, and there are chair seats on 2nd floor. I highly recommend to take your seats on 2nd floor, because to sit at flat spaces would be very difficult.Usually tickets will sell out before tournaments. I recommend you to get tickets through travel agencies. A little bit more expensive, but you will definitely be able to get tickets."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "The nobility of the sport!. Our intention was only to visit take a look at a few matches, but the atmosphere and following was so addictive, that we were there all day. Local came to the see matches with the packed lunches and on the upper floor were also stalls where food was able to buy. Local beer was sold directly to the backpack and sellers circulate throughout the stadium. You can sit on anywhere, but when the place holder will be the site then you will have to move. We had good luck when there was almost a full-time upstairs in the front row. Tickets should be really good time to book if you want to sit downstairs in the stadium.Top atmosphere, a great place for entertaining and definitely worth visiting place!"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "An unique sport. I was very excited to watch matches between the sumo. It is not like any other kind of fighting, mostly wrestling but in a very unique way. My luck was so big that I could have the signature of a high grade summon for my boy. All members in my family had so much fun here. Absolutely an awesome experience for anyone visiting Tokyo."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "So fun!. Lots of fun! Such an experience! We wish we rented the English audio players though. We were seating next to another family from Canada, same province even. Small world. Was interesting to see that not all the wrestlers were Japanese. Was fun to people watch as well. Spied some women in kimono and a small brawl broke out in the crowd as well. We went around 2pm so we wouldn't miss the entrance ceremony of the higher ranked sumo's. I read that they close the doors at this time so if you were late you'd miss the ceremony. But when I looked around there were still people coming and going."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Unbelievable, Unforgettable Experience. Absolutely the highlight of our trip. We spent the better part of a day hanging out here watching the sumo. From the low-grade wrestlers to the top-grade, they were all equally impressive. Of course, as you get to the high grade wrestlers the ceremony becomes bigger and the fans get louder. You can't help but be caught up in it all and start cheering on your favourites.There is food and drinks here, as well as clean bathrooms - so you can really get comfy and get to know the sport."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Fantastic experience . We were going to the Edo Museum next door and only ended up here as we saw lots of sumo wrestlers wandering around. It turned out it was the national championships so we bought two cheap tickets (to sit on the back row). After our museum visit and lunch in a nearby noodle bar, during which a sumo sat next to me (I nearly exploded with excitement!), we stood outside for a while to watch the wrestlers coming in. We then took our seats and, despite being so high up, we had a good view. There are good facilities in the stadium and, like all of Japan, it's immaculate. Watching the wrestling was one of the highlights of our trip to this fab country."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Must See While in Japan. If there's a competition while you are in Tokyo, you should definitely try to get tickets. We were lucky to be in Tokyo while a major competition was being held. We did not purchase tickets in advance but was able to get cheap day-of tickets. Regular tickets range from $3800 Yen up and usually sell out fast. Discounted tickets are available day of the match and are around $2100 Yen. Seat selection is not an option for discounted tickets as they are only available when seats are not sold. Make sure you go early if you are planning to get discounted tickets. Sumo matches begin around 9am with major matches starting mid-afternoon. The ticket allows for same day in/out privileges. We noticed that people brought food in the stadium and no one seemed to mine. They have food on site as well if you do not have time to go out to buy your own. We got to the arena around 2pm and was able to catch a glimpse of some of the sumo wrestler walking into the arena. Our discounted tickets were for seats at the highest section of the stadium but we were still able to see pretty well. It was great to watch the competition with locals and tourist alike. We really enjoyed the experience and will definitely make it a point to catch another competition the next time we are in Japan."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "An experience. This place is really nice and let you the chance to vibrate for these big boys.I went to a retirement ceremony, fantastic.The bentos served are great. You see from any seats."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Fantastic experience. Great if you can attend a sumo tournament. We were lucky because there was a retirement event with many wrestlers challenging each other in honor of the retiree. They sang, his sponsors cut his hair and much more!"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "A not to missed experience. Sumo is Japan's national sport and is a sport that may baffle foreigners but it is one of my favourite Japanese experiences. 3 times a year tournaments are held here and if you are in Tokyo during those times make sure you go. You can buy tickets in advance but they do sell out quickly or you can go for the cheapest option with the furthest away seats which is to buy tickets on the day. There are 300 odd tickets that they sell from 8am each morning of the tournament for general seating in the back row, make sure you arrive much earlier then this though as they do sell out of these tickets quickly. The sumo itself goes the whole day but the best sumo's start from about 2pm. Eat Chunko, it's a sumo staple diet food to bulk up. You can also get away with bringing food and drink in usually despite the signs saying otherwise. It is an amazing atmosphere with so much ritual so do a little bit of research before and it will be an amazing experience. During the rest of the year you can visit the sumo museum for free."
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Sumo is Japan's National Sport. Great atmosphere. I truly enjoyed the National Sumo Tournament at Ryogoku Kokugikan. The atmosphere was electric in the sold out arena. If you are in Tokyo during the National Tournament ...do not miss the opportunity to see real Sumo."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Very entertaining! . The stadium was so big and clean. The toilets were accesible too, it was very clean as expected. Drinking fountains were near the entrance. There were also shops where you can buy souvenir and food items. Watching sumo for the first time was a very nice experience and worth every penny."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Unique experience. Incredible. First thing to say is we got lucky, we planned and trip to Tokyo and it so happened the September Tournament was happening at that time. So my first piece of advice is that depending on how flexible you are, check the tournament dates and plan your trip around that.The arena is quite impressive from the outside, but once you get inside it is stunning. Sumo is one of the most unique things I have experienced in my life. So different to any sport of cultural activity I know or have seen before. I would highly recommend. The seats are very comfortable and the ticket is valid all day. We got the second cheapest for I believe about 20/25 pounds. We still had a good view. We showed up around 2.30pm before the higher league started, and a lovely (and well deserved) nap and then enjoyed the show. The lights in the stadium are just right as well, not too bright not too dark. Not speaking english didn't matter although I think to have a better experience you might want to brush up on Sumo wrestling rules. But by observing we understood most of it after a couple fights.All in all a highlight of our trip. Make sure you book in advance. I would also recommend enjoying a bento box while you are there to take the cultural experience a bit further. Unique and amazing."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Sumo tournament . One of the highlights of our trip to Japan. I would definitely recommend going if you are in Tokyo during one of the tournaments. We went early and stood in line and got day of general admission tickets as tournaments sell out weeks in advance. These tickets go on sale every morning at the stadium at 8am. Only 350 tickets are sold each day and when you arrive you are given a number 1-350 which allows you to stand in line to buy a tix. We got there around 7:20AM and just barely made the cutoff. Matches start at 9 but the good wrestlers don't wrestle until after 2pm so we actually went and did other sights in the morning and came back to the stadium at 2 and stayed til the end. Once in the stadium the general admission seats are the very highest row seats but no one seems to check tickets and there were blocks of empty seats so we sat very low and if anyone did come we just moved to another area."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Was hooked on Sumo Wrestling by the end of the day. Sumo wrestlers are well and truly worshipped in Japan, so I was very happy when we arrived having prebooked tickets through the english website before we left.I was also very surprised to see some of the wrestlers walking in just off the street! Despite the language barrier, two I asked for a photo with were happy to oblige.The stadium itself is incredible to arrive in, there's not a bad seat in the house so don't worry too much about paying for the close tickets, we were right up the back but had a great view and I would guess that is the case for most of the stadium.We turned up mid afternoon, probably around 2:30 because we were told our tickets had to be collected by 3.This ensured we saw much of the 'reserve grade' bouts, plus the top fighters. You're given a sheet with the day's match ups + each fighter's tournament results, which is handy as it gives you an idea of who the stronger fighters are, and who's not going as well.Great to see how passionate the crowd was about some of the wrestlers. The whole spectacle was just amazing and great fun."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "Great Thrilling Expereince!!. If you are in Tokyo between 10-24th May. Do not miss the opportunity to see the great Sumo wrestling. Please go around 2:30 or 3 PM and stay till end which is at around 6. It would be a thrilling expereince to learn about this great national game of Japan and see the Sumos in action. We booked our tours through Viator and they were very peofessional about the whole thing. Its extremely difficult to get tickets on your own even when I tried the day tickets started selling. But if you can buy tickets on your own, you dont need to book a tour and it will save you a lot of money. But in any case, do not miss this while in Tokyo."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Pricey, but unforgettable experience. If you can get tickets, I recommend sitting on the South side so you get the best view, but definitely go for chairs as unless you're used to hours of kneeling,you won't cope! Hire a radio to get the English commentary, and read up on the rules online to get the most out of the day. Beware, the food inside is expensive - bring your own picnic (discreetly)."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Brilliant. I went to watch a day of sumo wrestling during the May Festival and it has to be one of my favourite travelling experiences.The ritual around the sumo wrestling is gripping and it is very watchable, even if you have never watched the sport before. The arena itself is very impressive. There is a variety of food and drink available just outside the arena, including the high protein dish that sumo wrestlers eat to bulk up. I would say the entire venue has a good view of the arena. You can also very easily bump into the sumo wrestlers when you walk around the outside of the arena.Tip: the high profile sumo wrestlers are on much later in the day. The second tier wrestlers enter early afternoon, and the top tier wrestlers enter mid-to late-afternoon."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Sumo secrets unlocked. By now you have already ready that this is a fantastic, quintessentially Japanese experience that I'd highly recommend to first-timers in Tokyo. So let's get to what you want to know..how do I get tickets!? Ok there are several ways to get to see the tournament.1- prepay for your tickets online before you leave for your trip. You can find sumo tickets online , I use the official sumo association website to buy my tickets. But you can find 3rd party retailers too. Remember there is a date change when you fly in to japan. So be sure to plan with that date change in mind.2- family mart conveniance store has events tickets which you can by at the store. You will need to read Japanese or have someone hellp you navigate the kiosk screen to get your tickets.3- Day of tickets, you will need to go early to the the ticket booth at the arena and buy open general seating tickets. these tickets are very limited less then 200 for regular day match. I doubt you would be able to get open seating for,the final,day but it's still,worth a try. I recommend you get there no later that 0530-6am. Box office opens at 7. You will see the line when you get there. 4- Craigslist...yes you can find people,selling there tickets on craigslist. Obviously this would be a last resort and buyer beware. The Japanese culture really frowns upon scalping tickets. But you can find scalpers but it won't be like in the states where they are openly selling tickets. You may run across a guy usually a foreigner whispering something about tickets. Things to keep in mind. If you buy a box seat, it's is made to seat for people...Japanese people... The box is roughly 4x5 you will be seated on the floor. It can be uncomfortable if your aren't flexible. Squeezing 4 Americans will be a challenge but who cares have fun!English-language commentary is available even for the higher-level matches. Once your are in the arena look for,the radio rental table. Don't be put off at the price 3200 yen, it's a deposit. You will get 3000 yen back when you return to the radio to them. For 200 yen it's well worth listening to the English commentary and making the match enjoyable.When to go. Ok so the matches start at 8 am. Unless you are a die hard fan or your son is a junior light weight wrestler your probably can wait to go later in the day. The match starts off with the lowest of,the low wrestling. The neat part about it is that even the grand champion started off that way. I recommend going about 2 pm. You can wonder the arena buy your sumo souvenirs grab a bite to eat and settle,in your seat. The big boys start to arrive about 3 pm and they start the ring ceremony for the paying ranks about 345pm. This is what you came for! Where ever you are seated you will notice a lot of open seating. You will be tempted to jump in another seat or to,something closer . You can take a chance an try and move to get a better view just be ready to move when you see that guy looking for,his seat and your are in it. Simple apologize and smile. Remember the Japanese are very by the rules culture and it may be frowned upon not to be in your assigned seat, but you can always drop the foreigner card and play dumb, you will be forgiven.Picture taking - yes take pictures snap away! Flash and all! The arena will be full of photo ops. You will see full,figure cut outs of the top,wrestlers around which can be a fun picture. You will want to take a picture of the wrestler themselves. The best time to do this is when you see the wrestlers leaving for the day outside the arena.You will find that even the top ranked wrestlers are very gracious and are usually happy to pose with you for a photo. Just asked politely and be sure to thank them for their time. Don't be turned off by a wrestler saying no or ignoring you. He probably lost his match and is is no mood for pictures. The Lower ranking wrestlers will be walking to and from the arena. That's the best time to catch a picture with them. I am always surprised how humble the wrestlers are. Some wrestlers will smile and even joke with you!if you're new to Sumo, a tour with a guide is easily the best way to experience it. But. You can do it on your own!One last thing: it's a long day, so you may want to bring snacks with you. The concession stands can completely sell out of bento lunch boxes, so You can get pretty hungry by the end of the day. I bring in snacks in my small backpack without a problem. Oh yeah flying your pillow and the end of a match that was really good or, the last match of the day you will see pillows flying, officially this is a no no. But when Rome!! Also when the last match ends don't be in a rush to leave. There is actually a closing ceremony that is performed. It is worth watching.Have fun! Interact with the he locals next to you this is a fun sport and you will enjoy being among the locals and watching their national sport."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Terrific experience . This is a great experience and not just for the Sumo aficionado.It is theatre not just a contest (albeit serious).Best advice is to make sure you get some background for what you are watching because even though we had watched Sumo before (on television) understanding the back story is important in appreciating what you are watching.First we went for Three days but the first day was with a tour company (Viator) and the guide supplied a cheat sheet on each contestant which we were able to use at each of the other two days.Second I recommend you do get the little wireless to get the English translation for the main matches from 4pm. Again to help with context.Third if possible you go for tickets in the first three rows on level2 (level 1 is the ground floor) if not at least in the lower section of level 2. There are no bad seats but it gets a little remote up the back.All in all not to be missed uniquely Japanese."
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "Flying pillows. You will be in for the long haul if you decide to go early. The big names are several hours later in the final bouts. Worth it if you are mildly in to Sumo. Otherwise go later in the day and watch the action and the crowds go crazy... Japan-style."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "A must-see if you're in Japan whilst a tournament is on. We saw one of the first couple of days of the tournament in May 2016 and it was one of the highlights of our entire trip.As I'd seen others recommend, we arrived a little after lunch when the higher ranked matches start and despite my partner saying \"I don't think we'll stay to the end\" (it was about 4 hours away) we actually did stay until the last match because it was that good.I'm not much of a sports person, but I think because the matches are so quick and you can never tell who will win just based on their size, it definitely held our attention the whole time. I also like the idea that while it is a contact sport, it's not anywhere near as violent as many other sports.The arena itself has very good seating all over, so you can always see what's going on, however I would recommend getting seating in the lowest portion of the second level - we had tickets a little up from that section, and while we could still see everything, we definitely will pay a little more to get a little closer next time.Highly recommend this as it's an experience unique to Japan and very entertaining."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Summer Basho such an experience. Attending the Summer Basho tournament was a fabulous experience. Fortunately we booked on a guided tour and our guide was amazing. She explained everything about the history, tradition and rules of sumo without which we may have struggled a bit to understand. Absolutely worth going to a tournament when you visit Tokyo to be totally immersed in their culture."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Tuornament very interesting. I was there just to see the building, after the visit to the close Edo' - Tokyo Museum. So was very nice to discover that, during the tournament I can easily buy the ticket and go inside.I saw an interesting part of it."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "What an experience. If your in Tokyo and the Sumo is on, definitely a must do on the list. Try and get tickets for the days the finals are on. The crowd really get into it. But saying that we enjoyed day one just as much. The experience was amazing, we didnt have the radio for English and still thoroughly enjoyed ourselves. Get assistance to locate your seats and enjoy. The stadium is very close to the train line so finding it is easy. We purchased tickets through buysumotickets and the service was amazing cannot fault them. Arranged delivery of the tickets to our hotel and upon check in they were there"
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Sumo May Tournament Tokyo. One of the highlights of our trip. Sumo starts at 8am and finishes at 6pm, we arrived around midday and left around 5.15pm to beat the huge crowds. It doesn't get busy until after three when the better sumo's fight. The sport dates back approx 2 thousand years and there is a lot of tradition to this sport. Whilst the wrestle usually lasts no longer than fifteen seconds it's very exciting to watch and the lead up to the fight is where you will see a lot of the tradition and rituals. I think I'll start watching sumo on tv/internet when I return home from my trip, I looked up the full history of sumo because I had such a great day. If you can time a trip to Japan when the tournaments are on it is Definately worth it. There are six each year due to the popularity of sumo, do your research in advance because this is a must !!"
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Great stadium to watch sumo!. I loved this experience. We bought our tickets a month in advance for 3,800 yen per person, and we got seats all the way at the high back, but it was fine so long as you remember two things: (1) binoculars and (2) you can just sit in the seats that are \"reserved\" on the second floor but closest to the ring until the people fill in at about 3:40 PM, or when the best wrestlers start to go to the ring. People are usually pretty nice about it.The stadium itself is also a museum, and has lots of souvenirs on sale, though they're at pretty high prices. Lots of foreigners came, which was cool to see - they wanted the sumo experience, too! I actually got pretty into the experience, especially when Ishiura won: he was a small guy but managed to shove the big guy out of the ring! Watching the last three matches (the ones with the yokozuna, the best fighters [all three are from Mongolia]) was incredibly interesting, and the audience went wild.The sumo wrestlers spend a lot of time trying to intimidate each other and getting as ready as can be, making eye contact and taunting, but once they go at each other, it's so much fun to watch. Good fighters go on from about 2:15 PM, and the best ones start around 3:40 PM. It lasted until 6 PM for us, and four hours was just enough time, methinks; not too much and not too little!"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Sumo Tournament a must when in Tokyo!. We were fortunate enough to buy tickets to the second day of the Sumo tournament at the Ryogoku Kokugikan. Easy train access to the venue from central Tokyo, only costs around 300yen each way. The venue is huge and entry starts from 8am, it doesn't start to get busy until after the tea ceremony at 2.20pm. If you get in early you can sneak down to the private boxes on level one and watch some matches up close. By 3.30pm the venue was really starting to fill up, seats on the second level are much more comfortable and offer a bird's eye view. The venue states that you cannot bring outside food or drinks, however this rule did not appear to be enforced. We had no trouble bringing in lunch and bottles of water/soft drink from the local supermarket. Food and Beverages offered at reasonable prices at the venue. Would highly recommend going."
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Sumo Hall. It is not only a stadium but also a museum. Murals are colorful at the entrance of the building and when walking in, it is interesting to see some history about the Sumo players themselves. We did not attend any match but I guess I should make a point to do so on my next trip. Japanese just love Sumo wrestling."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Lucky to see the competition. We were lucky to get tickets to the exhibition show of the season. This was one of my bucket list and I was able to see the sumo wrestling matches live. I had a memorable time and it definitely was a lot more fun than watching it on the tv. Double thumbs up!"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Sumo. Always visit Asakusa in May for sanja matsuri and sumo basho. The arena is amazing if you stand outside before the main sumo bouts you can watch the higher ranked wrestlers entering the building, great atmosphere especially hearing the ladies shouting the name of their favourite"
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "A Day at the SUMO. I was in Tokyo in September 2015 when the SUMO Championships were on and was very keen to see a match and try to understand what it is all about. Tried to get tickets but too hard. Heard from other travellers that if you go to the Stadium very early in the morning (ie 7am) and line up you can get a ticket. So I did, stood in the line and an attendant comes and gives you a token for the general seats which you hand in and get a ticket for that day.Note you have to stand in line which fills up quick, you only get 1 token per person so you can get more for others, tickets are only for that day and once in you cannot go out and re-entre..We spent most of the day there which was ok because it was raining and companions tiered from long plane trip so suited us.Very enjoyable saw 8 hours of SUMO wrestling so got my fill.Worth going if the SUMO are on but best fighters on between 1pm and close at 5pm."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Truly interesting place to visit ... we could not get tickets for the Super January tourney though :(. Truly interesting place to visit ... we could not get tickets for the Super January tourney though :(It was cool to see all of the cool banners and murals outside and all of the sumos going in and out ... plus the structure itself is nice to admire."
        }, 
        {
            "index": 54, 
            "rating": "2", 
            "review": "Nothing much to do there. We arrived hoping to be able to see inside the arena but it wasn't open to the publicWent in the museum but wasn't much there I bet it would be great when it is all open but unfortunately nothing much to do otherwise "
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Must go!!. You will have a great time with your family. One big warning, DO NOT BUY TICKETS FROM: BUYSUMOTICKETS.COM!!!!!!!!!!!!!!!!!!!!!!!!!!!!!They bait and switch their tickets. Beware, they will promise you something and give you something else in return."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "2016-0207 Chinese New Year's Eve with Sumo wrestling in Japan. Before I came to Japan, I am the one of all watch the sumo wrestling on TV. I came to Japan several times, but this time is my first time watch live sumo wrestling show. The wrestlers seem to be very fat, but their body is flexible and strong. Just like to listening the musical drama or concert, it is not so easy to express the real feeling to the others without this experience.Seeing is believing. Just watch a sumo match and you’ll see!"
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Awesome insight into local culture. We visited during the Grand Sumo tournament.We booked through buysumotickets.com - Jeff was extremely helpful answering my questions.The experience itself was phenomenal and offered a terrific insight into Japanese legend and culture. The atmosphere increases throughout the day until the Yokozunas enter the ring which is a sight to behold. The bouts are quite short (a few seconds) but there are many of them to keep you entertained.Can't recommend enough if you're in town at the right time."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Great day at the Sumo Tournament. We booked this thru Viator - JTB Sunrise Tours. Great day. Our tour guide spoke reasonably good English and she prepared us on what to expect handing out copies of who was wrestling in each match along with their stats. This really made the whole day come together. Although our seats were rather high up we did have a very clear view of each match. We were so fortunate to be in Tokyo when the tournament was going on. I would highly recommend spending a day and using JTB to help you get acclimated to what to expect. One of those unexpectedly great day tours."
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Should visit once. This is the place where sumo takes place. Suma is a minute or less play. So for many people it may be boring."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "A must see if in Tokyo at the right time. We attended day 6 of the most recent tournament and enjoyed it a lot. We bought our tickets well in advance through BuySumoTickets - this was well worth the effort and cost as we could plan our trip around the date we had. We chose A grade seats and had an excellent view of the ring. Spending the 300JPY on the radio to hear the live commentary was money well spent. For a great afternoon of entertainment in a uniquely Japanese way you must go to the sumo. It is good for people watching as well as the actual sumo"
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "So much fun. If you are in Tokyo when the Sumo Tournament is on it should be at the top of your to do list. Its quite hard to get tickets so book early, they were sold out when we booked but we got them through a tour company, which I highly recommend, our tour guide was amazing, she gave us so much information on the tournament, sumo in general and each of the competitors. The atmosphere was amazing at the tournament, it was a great experience."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Interesting experience and the pre fight ceremony also worth experiencing. The tickets we got are valid for the whole day however we only view for an hour before we got bored. It is overall still a great experience to bring back home and to tick off the bucket list."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Sumo tournament final!. Went to the sumo tournament final today (24 January 2016) and the atmosphere was incredible. We had a 4 person box on the 1st (ground) floor and we had a great view of the ring. Kotoshogiku beat Goeido to become champhion (yokozuna) - the first Japanese sumo to become champion in more than a decade. Great atmosphere, great cultural experience - would really recommend. Tickets can be hard to get so book in advance - box tickets were about 9,500 yen each."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Such a great experience!. Booked a sumo tour on viator.com and chose the Keio Plaza Hotel as the pick up place. Tour guide was great. Michiko is an avid sumo fan and she explained all the sumo rules for us. The atmosphere at the arena was great! There are a lot of food stands so you won't get hungry. So glad we chose to catch the Sumo Grand Tournament!"
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Must do if you are there when on. What a great way to spend the day. We got a 4 person box which fitted 2 adults and a child. There are English guide books available to help you understand what's going on. Grab some beers and a bento box, and enjoy the spectacle.Beware it sells out well in advance so get in early for tickets."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Sumo is good fun. In Tokyo, Sumo tournaments are held in January, May and September. If you get the chance, they are well worth the cost of admission. Although the lower ranks start around 2pm, I recommend getting to the kokugikan around 3:15-3:30z. This will give you time to look around, but some beer and snacks and find your seat before the upper level begins. I highly recommend renting a radio for play by play. There is an English NHK commentary available that makes the experience a lot more enjoyable. The rental cost is 200 yen, but bring cash because they require an additional 3000 yen deposit which you get back upon return. We also sit up high in stadium seating. The first level seating is considered better but you sit in 4 person boxes with cushions instead of seats- better view but murder on the knees. There really aren't any bad views in the stadium."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Grand Sumo Tournament. Attended the Grand Sumo Tournament, really nice and funny to see, great ambience. Good view from Main side, B-chairs (boxes would've been nice but for four persons)."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Must do. Our second time at the sumo in Tokyo. We had a box seat for four. Very cosy especially for anyone with long legs. Book your tickets online way ahead of time or you will miss out."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Sumo Spectacular. Big Blokes, Beer and Bento. It really doesn't get any better than this! This is a fantastic way to spend a cold afternoon.Our family of 4 took a box at the Sumo thinking it would be worth popping in fair an hour or so. Four hours later, we left thoroughly entertained. The box was just big enough for a family of 4, as long as the kids aren't too big. Very comfy for 2 people, but possibly a bit tight for 4 larger adults.It is a relaxed atmosphere, and you can come and go as you please. The food is great and you can eat & drink in your box. You can see all of the action from the c class box, which is a little cheaper.The sumo itself was fantastic. I am not really all that into sport, but the whole psychology, ceremony and physicality of the event was incredible. Make sure you duck out the back of the souvenir stands to see the big blokes walking in to the stadium. They are awesome! "
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "What a hoot!. Despite no interest or experience with sumo, this was a great opportunity to see Japan for real. The helpful map and radio translation made it interesting and as the crowd built and the master sumo began, it was a thrill to be involved and witness this unique Japanese sport."
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "Huge is the only way to describe this place!. The world famous Ryogoku Sumo Museum & Arena is situated next to a train station & also adjacent to the Edo Tokyo Museum making for a very handy place to visit to get a taste of Japanese culture. When I visited it was closed to the public due to an annual Sumo function but it was still worth hanging around outside to catch a glimpse of the sumo - probably better due to the fact they were all assembled in one place at the same time - made for a very impressive spectacle."
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "What an experience!. If you are looking for an authentic Japanese sports experience go for a day of Sumo wrestling! If you come here early in the morning you can walk up all to way to the 'arena' to watch the action up close. In the afternoon (ask what time at the stadium) the good (and big) wrestlers come walking to the stadium so you can watch them close by."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "The Real Japan. This was such a unique experience as an American onlooker. The event was well organized, ran on time, and was super fun to watch and easy to get into! Great entertainment! I probably won't need to return as the originally novelty is worn off but I do think a one time visit is a must do for visitors to Japan! What a wonderful window into a fascinating part of the Japanese culture! As with most sports the closer you can get to the action the better. So pick seats as close to the ring as possible!"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Ryogoku Kokugikan. we went to see the grand sumo tournament at November, the tournaments runs for couple of days, its start from the morning and run until the evening, so to see the best rank fighters come at 15:00 and stay till 19:00.its amazing to see al the fights and the traditional rituals of the Tournament.The crowd is very involved and cheers the fighters from all over the world.Well-built stadium, and while we were sitting in higher stands we had a good view of the arena.An experience not to be missed!"
        }, 
        {
            "index": 75, 
            "rating": "4", 
            "review": "Worth a visit. We were fortunate to be visiting Tokyo during one of their tournaments and bought the tickets online in advance which was slightly confusing but we got there in the end. The sumo itself was awe inspiring. We got tickets in the higher stands but could see the fights quite clearly and even though we didn't understand it all, we would recommend it for the history of the place and the culture of the sport. There were legions of fans awaiting to greet sumo rockstars as they got out of their limos. Was a great sight to behold the reverence the Japanese have. We also got some really nice sumo banners from the stalls in the foyer."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Amazing!. We had good seats - though the sightlines are good from anywhere. The hall got fuller as the highlight bouts got nearer - 3.30 onwards. You can eat and drink in your seats if you wish, but the action (though we didn't really understand it!) was gripping, even if the actual \"close encounters\" were very brief ... the pageantry, the colour, the costumes, the NOISE were really amazing. Probably worth not rushing for the station at the end, as 3 million people were doing the same thing!"
        }, 
        {
            "index": 77, 
            "rating": "3", 
            "review": "Major home of Sumo. After attending sumo at Nagoya and Fukuoka, September was my first visit to Ryogoku Kokugikan (actually twice in the same week). Personally, as I like and actively follow the sumo, I was more interested in the action on the inside, but as an attraction, there is a small museum with some interesting displays which would occupy a fan for 1/2 hour or so.The stadium itself has two floors. Even from the cheap seats up the back, the view is good and you can see all of the action on and around the ring. For the box seats, fitting four adults in is a bit of a squeeze, especially if tall like myself) and it can get uncomfortable after a while, but there is enough around the concourse to look at (souvenirs, food), that a day passes pretty quickly."
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "Sumo Tournament . The tickets were sold out however we did manage to buy the open tickets. We had to queue for ticket since 5am. Anyway it's worth watching the Sumo fight. Great experience."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Interesting venue. I visited Ryogoku Kokugikan for the New Japan Pro Wrestling \"King of Pro Wrestling\" event.An interesting arena designed for sumo. Great views of the action even from the back of the hall. Easy to reach on foot from Akihabara or central Tokyo if you don't mind walking, also a train station and metro adjacent to the venue."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Everyone will enjoy a day of watching sumo wrestling. This arena hosts sumo wrestling competitions 3 times a year, lasting 14 days each time, so check the calendar if you are going to Japan on a leisure trip. The matches start at 8 am and keep on until 6 pm at a relentless pace with next two bouting pairs lined up at all times. This is something all ages and men and women can enjoy together. It is very interesting to watch the bouts and the rituals around it. Make a bet to enjoy it more. I would recommend to splash out on a box seat on ground level which is dimensioned for 4 people, but realistically only fits 2 Westerners.Then for lunch, go to top floor and have Japanese food. There was a bit of a queue when we arrived at 1130, but cleared fairly quickly. It was probably the best Japanese food we had during our 2 week trip.Then at the end, you can watch the sumo wrestlers come and go from the arena. There was quite a big crowd when we were there and you can do that even if you dont have any tickets to the arena also. To see the wrestlers up close gives you an idea of how massive (and tall) some of them are. And many are not Japanese either.We went on a weekday 2/3 into the competition and it was not so many people there in the morning, but then when the higher divisions start in the afternoon there were more people arriving."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Unique Experience. During May of this past year I watched one a series of Sumo Wrestling bouts at the Ryogoku Kokugikan. I honestly do not think there is a bad place to sit in this venue. Great view from where we were sitting, and other parts of the venue were awesome as well. The bouts were exciting to watch as well. The washrooms were easy to find, and it was just as easy to navigate throughout the arena. I would recommend coming here for events."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Surprisingly very enjoyable!. We booked this through Viator before arriving in Japan. Thought it would be fun for hubby and FIL. We ALL really enjoyed it. Our tour guide (english speaking) was fabulous and really gave us good background information to help us understand. We when arrived at Tournament, we were given portable radios with earbuds to listen to the English speaking commentators. We had a great time!"
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Highlight of our trip. For me, this is the highlight of our trip. We were able to watch Sumo Wrestling live! We had to queue from 6am to get the tickets but it was all worth it. There is a museum inside and lots of kiosks to buy snacks. Saw some famous wrestlers pass by and the fans just went crazy. If you have the chance to watch, you can rent a radio so you can actually hear the commentators in English. It was a very interesting experience. They sell beer inside the stadium too!"
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Had a blast. We booked tickets to see a grand sumo tournament. We got there about 3pm and stayed until the end at around 6pm.It was one of the highlights of our trip and a must do if a tournament is on. Our 9 year old was glued to the matches the whole time.We booked our tickets from Australia through buysumotickets.com. They were most helpful and also arranged tickets to the Ghibli museum for us too. The tickets were couriered to us."
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "Fun day at Sumo tournament . Going to Ryogoku Kokugikan was a really interesting and fun experience. The stadium has two levels of seating. The bottom half of the audience sits on the floor on thin cushions which got uncomfortable for me in about 20 minutes since I'm not used to it. We spent time on the second level where my assigned seats were which I actually preferred not just for having a regular chair with food tray attached but the angle made the sumo matches easy to watch.During the sumo tournament there are vendors selling souvenirs and food. The nice thing about the shirts is that sizes go all the way to XXXL, which makes sense since I bet majority of sumo wear Rick Ross sizes themselves. The food is real basic snacks, the prices are reasonable, but bringing your own snacks and food into the stadium (which is allowed) is a much better option. They do however have a restaurant on the second floor that serves Japanese Food including the Sumo Stable Food called Chanko Nabe. The sumo tournament itself is fun to watch, all the matches from about 3pm to 6pm the crowd really gets into. In between matches however be prepared for monotonous/redundant chanting along with ritualistic stuff. The Japanese are an ancient society, despite being modern they feel strongly about tradition and you really see that in the tournament. Important Tip: the men's bathroom on the second floor have toilets. First floor requires squatting."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "The modern and the traditional meet in a collision of sumo. Fantastic experience if you can go when there is a tournament on. There are three annually at the Tōkyō stadium which seats 13,000 people. there are plenty of food stalls and souvenirs are available. The museum which is normally open to the public is only open to paying spectators during tournaments. Tickets really should be bought in advance via the Sumo Association's website as they are usually sold out. There are english speaking volunteers at the gates to guide you through how to get your pre purchased tickets from the ticket dispensing machines. The top ranking riskishi (wrestlers) start arriving at the South gate at 2pm and this is a good photo opportunity. From 2pm onward the stadium starts to fill up as the top ranking wrestlers take to the dohyo (ring) and take part in ceremonials before they start to wrestle. This continues till around 6pm. There are people who carry pressurized beer containers around the stadium seating so you can purchase a beer at your seat. English language guides are available to make the experience more enjoyable and English language radio commentary from 4pm onwards."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "2Fの椅子席3列目. 毎回、千秋楽には相撲観戦に行きます。１Fの升席よりも、案外、２Fの椅子席3列目くらいのほうがよく見えるし、足も楽だと思います。ラジオを持っていったほうがいいかなー、レンタルできるけど。毎回味が変わるちゃんこは並んで食べたほうがいいです。あと、ひよの山最中アイスが結構おいしいです。I come here each final day of the tournament. I recommend taking the ticket for the 3rd stage sheet at the Second floor because better view than the tail end of first floor. Especially you can take a comfortable own sheet more than the first floor. The First floor sheets are narrow space and high cost. Sumo has a lot of fine rules and nice cultures more than you see, I recommend taking a guide with you. The Chanko is daily changed, it will be popular and long line but you should be in the line and eat it, very good. Probably 200 yen about.I liked an ice cream of Hiyonoyama, it is good. Hiyonoyama is a mascot character of Sumo, it's cute!"
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Don't understand it but loved it!. We popped in with our children (boys ages 3 and 5) for a quick look at the museum and were lucky enough there was a charity tournament on. For a small donation we could enter and sit wherever we liked, started up the back on western style seats then moved down to the floor seating a bit later. We didn't plan to stay long but it was quite addictive and the boys didn't want to leave. We were probably there for about 2 hours, did not understand it, but it was such a spectacle that we were all mesmerised, I would highly recommend getting tickets if I had realised how entertaining it was!"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Sumo with a 5 year old. It’s absolutely fine to take children to the sumo. Our five-year old son was quite interested in what was going on and we managed to stay for around 3 hours, with a short break and walk up the street about halfway through.The day we went was sold-out. The arena opens at 8am but we arrived at around 1:30pm. Go to Ryogoku (E12) metro station and take exit 3. Follow the signs for the Edo Tokyo museum (the big ship like building) and walk down the side of it. You will see the traditional green stadium roof behind. It’s fairly easy to find.We booked our tickets online on the day they went on sale through the official website which linked to Oosumo tickets. It was all in English although we weren’t quite sure which row our seats were in until we got there. We chose the seated section (Arena) section A. It cost 25500 yen for 3 tickets. We were in the 3rd row and had excellent views. The mats on the floor below looked cool, but I don’t think you’d be comfortable for very long.You must take the credit card that you paid for your tickets with, as well as the ticket number, to get your actual tickets from a machine. There were no queues to collect tickets when we arrived, despite it being sold-out. We did have a bit of difficulty finding our seats because the tickets are mostly written in Japanese – so it was a case of ‘match the symbol to the one on the door’. The seat numbers are written in Western numbers though and were easy to find once we found the correct door. Our son had a notebook and some pens as well as a bag of snacks to keep him occupied when his attention to the sumo did wane. The people around us were very tolerant. It’s a happy atmosphere and my son seemed to be most welcome, although we didn’t see any other children there.Sumo is quite a spectacle. The banner displays, and the pre-bout manoeuvring and salt throwing between the two wrestlers takes far longer than the actual wrestle – with some bouts over in about 5 seconds once they started. I don’t think we saw any that lasted more than 30 seconds. We saw a few sumos land on top of the judges in the front row. It’s quite colourful and the crowd really gets into it, cheering on their favourites.There are souvenir stalls and food outlets around the venue. We bought popcorn and drinks but you can get hot Japanese meals as well. We walked up the street to the Seven Eleven to stock up on snacks half-way through. You are allowed one pass-out. You can eat inside the stadium while watching the wrestlers.Check out the ‘toilet flushing noise’ button in the toilets – it does nothing except make a toilet flushing noise. (One of those ‘only in Japan’ moments.)Sumos are generally happy to pose for photos in and around the stadium although I wouldn’t interrupt them on their way in to wrestle. You can watch them arrive if you go outside on the ground floor, and take photos of them in their Yukutas.You can also take photos (no flash) inside the stadium.We didn’t stay until the very end because I was dreading how crowded the metro platform would be once the sumo had finished. But we saw enough to make it worthwhile. We saw the entrance ceremonies for the grandmasters and the next level down. You will be given a leaflet in English which shows who is wrestling and the approximate times for them making their entry (when all the sumos get up on the ring and raise their hands). Worth seeing and hearing the crowd cheer.Sumo is only on at certain times of the year – so check out in advance if it’s on when you are in Japan, and when the tickets go on sale.We don’t usually watch any sport, but this was one of the highlights of our holiday!"
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Sumo-tastic. Went here to watch the sumo and it was an amazing experience. Loved how different is was to sports you normally see. The building itself was nice and traditional looking. Lots food and drink stalls inside. We booked online from UK and on the day there were signs saying it was sold out so probably something you need to plan in advance. If there is a tournament on while you are in Tokyo we would definately recommend going."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "If you can get tickets, highly recommended. Tickets are hard to get but if you can get it, it will be once in a life time experience. The bout begins from early morning but go around 2 pm for couple of hours leading to the grand champion bouts. If you can get masu or box, go for it. They say 4 person but would say 3 to sit comfortably. Bring butt protector as sitting is on hard floor. Can eat and drink while bout is going on. Ask travel agent to see if they can get tickets and also ask about rituals about buying food and drinks. Here, tips are recommended for server."
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Fantastic event. I was eagerly looking forward to seeing a sumo tournament and was not disappointed. It was a fantastic spectacle and very interesting experience. Went with Sunrise tours - well organised using trains, english speaking guide, good seats with a good view on an upper tier (compared to sitting on mats on the floor at the lower level). Guide gave good information before arriving at the venue and provided radios with english commentary. Arrived at the venue just as the higher ranked wrestlers were starting (about 3PM) and went through to 6PM when the tournament finished. I would recommend this to anyone who is in Tokyo when the tournaments are on (about three times a year in Tokyo)."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Great event. We had a great time at Sumo Tournament. Seating is mats on a floor in a box, which did become uncomfortable, but people walking around serving ice cold beer made it bearable.Their is much ceremony and fanfare but the whole theatre of it was excellent and the excitement to each match is great fun.Highly recommend it as an afternoon out"
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Top thing to do in Tokyo . I can't rate the sumo enough, it's amazing not just the sumo but the whole event. Even though I couldn't understand the commentary it was amazing. Our tickets allowed us to enter early in the morning but the auditorium didn't fill up until nearer 3 o clock. Unless you like sitting cross legged I'd suggest getting the western seating which is higher up but you can still view everything clearly. One tip you can only exit the auditoroum and Reiner once so if"
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "SUMO ROCKS!. Had a great time, buy the normal seats unless your a superficial floor sitter. Facility is very nice, bathroom stop notch, cool, comfortable, restaurants good, next to station.What a spectacle! Loved all the matches, we stayed all day!"
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "Amazing sumo experience!. We were here during the Autumn tournament so got tickets early on the day (2200YEN) around 8.30am, then came back in the afternoon. The stadium gradually filled up. Hard to get to grips with a foreign sport like this but was definitely an eye-opener!"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Once in a lifetime experience! . Wow! Not really into sumo but figured \"when in Tokyo\" and we did not regret. Weren't organised enough to book ahead of time so had to rely on on the day tickets. Got to the stadium about 7:45 am and were given a ticket to hold whilst we waited in line for the real ticket. This was to reserve our place- they only sell 350 extra tickets each day and we got tickets 347 and 348 so if you wanted to guarantee ur tickets, I'd get there earlier. You're allowed one re entry each day. We went in around 1pm and the lower level guys are on but ended up staying right though until 6pm as the atmosphere was infective! We hired a radio for 200yen (+3000 yen deposit that is returned after). Comes with head phones for one ear so if you wanted to share between two - bring your own head phones. This had English commentary from 4:30pm onwards and this was invaluable for us as it really allowed us to get into the spirit and understand what is going on. Would definitely go again!"
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "A very long day but worth it. Having been disappointed the day before, I queued up at 6am to get tickets. General admission seats are in the top row but it's still easy enough to see the action. There are matches non stop until 5.30/6ish so my advice would be to go in and reserve a decent seat (everybody appears to just put a programme down), watch a few of the games and then leave the grounds (make sure to get stamped) before returning around 2.45 for the big boys. I stayed all day and was very drained by the end of it so its best to go elsewhere. As a sumo first timer I did find it a little difficult to understand what was going on but it was thoroughly enjoyable!!"
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Sumo tournament-one of the most amazing things I've ever seen. If you can you really must try to go to Tokyo in sumo tournament season. You can find the dates in the website. This was definitely one of the highlights of our trip to Japan. So interesting and thrilling to see these big fighters practicing a sport that has remained largely unchanged for so many years. I recommend reading about the meaning of the rituals, the history of the sport, and how the rankings work while you're there. I also found that info in the website. Purchase your tickets online cause they go fast and it's always sold out."
        }, 
        {
            "index": 100, 
            "rating": "3", 
            "review": "Not missing out on tickets 101. Absolutely shattered I couldn't get to see this! Pre-plan to buy the limited tickets for the tournament so you don't miss out if you know you'll be around when a tournament is on. The dates and ticket information can all be found online. If you didn't score a ticket tickets can be purchased on the day. There is a limit of 350 tickets sold at 8am and unfortunately for us it was a public holiday on the day we attempted to purchase tickets. Arriving at 7am we missed out on tickets by 6 people in the line! Some days you can still purchase tickets after 9 but every day would be different so I recommend going early. You are allowed one re-entry so purchase them, go about your day and come back around 3 when the better matches begin."
        }, 
        {
            "index": 101, 
            "rating": "4", 
            "review": "September Grand Tournament. This was one of those things that if we had the chance we were going to do during our trip to Japan. Having looked at the website when we first planned this trip, we came prepared, having pre-booked our tickets within hours of the tickets becoming available. Even so we got some of the last, so make sure you book as early as possible!! We got the cheapest available seats as we weren't sure whether we would enjoy the sumo or not. As it turns out it was fascinating to watch and follow, even though we didn't get the English commentary. Most things were either fairly self explanatory, or easily explained with a little pre=visit research. The cheap seats are incredibly high up so if you don't like heights they're probably not a good choice, but they do still give you a good view of everything that is going on, and you feel very much a part of events. Both my husband and I really enjoyed our afternoon at the sumo and would thoroughly recommend that if you can, you should try to go! Having said that, the group behind us got quite bored, getting irritated with the rituals and ceremonies that accompanied each bout. Personally I loved it, for an afternoon.The two best groups of sumo wrestlers don't arrive or start their bouts until about 2pm so there is plenty of time to use your ticket that also gives you entry to the museum next door (this is free outside of tournament times but only ticket holders can get in when the tournaments are being held).We weren't sure whether there would be food available at the arena and if there was, how expensive it would be. It was a nice surprise that there was a wide range with bento boxes from around 1400 yen and snacks from about 300 yen. I had the fried noodles for 400 yen and they were lovely!Quick Tip: Arrive and depart using the Toei Oedo Line rather than the JR Line. It may be 10 minutes closer on foot but you will be fighting for space, especially on the return journey!"
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Sumo and Edo museum in one day. We were able to buy day-of tickets for the tournament. A had time to kill before the real activities started so went next door to the Edo museum. You are allowed one re-admittance. Came back around 2:30. We also rented the radio for the English commentary, which was helpful. We sat in the last row but that was ok as any other tickets would have been more expensive. Sumo was surprisingly interesting. This is probably going to be one of those things I just do once."
        }, 
        {
            "index": 103, 
            "rating": "2", 
            "review": "Book,plan ahead to avoid disappointment. We went to stadium and it was closed as it was a Japanese holiday period which wasnt mentioned on the website. And then further research revealed that we can only watch sumo wrestling if booked in advanced at certain times and dates."
        }, 
        {
            "index": 104, 
            "rating": "3", 
            "review": "Gave it a 3 just because the tickets were sold out lol. Always enjoyed seeing sumo on tv. I was hoping to catch a show but it was sold out. That being said- the area is very neat and the arena is huge"
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Make sure the tournament is on!. A great building and it is really cool seeing the sumos wandering around. Far less to do when there is not a tournament on but at the same time there are quite a few sites in the general area which make it worth your time."
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "host sumo wrestling. if you are in Tokyo during the sumo tournament make sure to get some tickets. Be there from 3 pm and you will get to see the biggest sumo stars. Well worth the money and a good way to experience true Japanese culture. "
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "Culturally, a good experience. You can go in May before the season starts and watch a training session for free. Best to get in early, we arrived at 9am and 3/4 full. Japanese very passionate about their sumo wrestlers, waiting out the front to get autographs and just to pat their favorites on the back."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Unique experience. We were lucky enough to be visiting Tokyo at the same time as the Sumo tournament was being held and so decided to book tickets, as we figured this was a unique opportunity and we would not be able to see this elsewhere. I had never seen (or was not very knowledgeable about) Sumo before and neither had my boyfriend, but we were blown away! We got there around 2pm and stayed for the full four hours until close, it was just incredible. Didn't see the time go by - it's surprisingly intense to watch. We were sat in the B section in regular seats, which were comfortable and good value, we had no problems with the view."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Diapers on grown men never looked so cool!. I'm a little biased since I dreamed of seeing sumo first hand ever since high school, but if you are even thinking about seeing sumo even a minuscule amount then think no further and do it! There is so much rich history about Japan within the sport itself. Read the book \"The Big Book of Sumo\" by Mina Hallhttp://www.amazon.com/Big-Book-Sumo-History-Practice/dp/1880656280/ref=sr_1_1?ie=UTF8&qid=1437943286&sr=8-1&keywords=the+big+book+of+sumoGives a lot of information about the sport from the history to the rules.While walking around the district you may be lucky enough to run into some of the sumo wrestlers. The energy in the arena was more than I accepted and made the matches that much more enjoyable.If you want a more visual look check out this episode of Japan VS where an overview of the arena and matches are gone over:https://youtu.be/tZJvzp8N4ks?t=3m6s"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Transcendental. A fabulous, unforgettable experience. It is truly inspiring to see dignity and the humble respect for tradition at work. The wrestlers are friendly and happy to pose for pictures. Lifelong memories await all who enter this magical place."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Sumo Stadium. As we all know, Japan has one of the unique attractions of by his body, which is Sumo. Well this is where you can see various performances sumo in Japan. Please see the schedule on the internet, and you should not miss!"
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Sumo wrestling. Wonderful spectacle - even my wife enjoyed it!. This is a spectacle which should not be missed. It only occurs in the Sumo season so you need to be aware of that.My wife went with me, grudgingly, as it was something I really wanted to see. However, she really enjoyed the event, much to her surprise.You need to get there around 3pm (which is when the best matches start) or earlier and it is over around 6pm.If you want to eat in the vicinity, it is best to book as thousands spill out after the event."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Sumo. June 2015, very easy to find. Any problems ask a local, the museum contains some very interesting facts about Sumo and their history, with photos and garments worn for tournaments."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Sumo tournament was special. We were lucky enough to be in Tokyo during one of their tournaments and took the advice to get their early 9.30am and gained entry. Weren't many tickets left at this time. Despite being allocated seats up high the locals don't tend to come until later in the day or evening so we quietly sat on one of the lower levels, they didn't check tickets so this was no problem. Although we saw the lower divisions wrestle it was fascinating and I have a greater appreciation of the techniques required to compete. We even got to meet and chat to a Canadian Sumo who was competing"
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Fantastic afternoon and evening at the Ryogoku sumo wrestlers venue. I went to see sumo wrestling with an arranged tour by japanican.com/Sunrise Tours. After the meetup at Hamamatsucho st. I went by train to Ryogoku along with the group and friendly guide, Ms. Ohno, to see wrestling and after that chanko dinner at a nearby restaurant.It was an interisting insight to the traditional sport of Japan."
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "The finest sumo arena. The sumo arena is beautiful, in my opinion. Since I love sumo, I am truly happy whenever I go to Ryogoku Kokugikan."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Buy a chair seat. As a person who watches no sport on TV or goes to stadiums, I wasn't expecting the sumo to be so captivating. We were in Tokyo on Day 8 of the May competition, and watched it for 5 hours without losing interest. I was hesitant to go earlier in the day because I had heard the more professional levels don't appear until 3:30pm but the lower-level bouts were still very interesting. In fact, possibly more interesting since you could get wild mis-matches in size between wrestlers, and it's always good value to watch a man the size of two fridges square off against a man the size of a small truck. :-)Food didn't seem cheap in there - we bought snacks at Family Mart before entry. You can hire English radio translations in there if they're available, for a refundable deposit of 2000 yen and a total fee of only 100 yen. When we arrived, we were told they were all in use and to return at 2:30pm. I went back at 2:40pm and they were all gone again, so I never found out what was available - no matter, you can easily work it out without assistance.I recommend a chair seat not only for the comfort but also because the people in the floor seats are only located about 6-8 inches higher than the people in front of them (which could give you a bad view). Also, the complexity of getting cross-legged into a small space meant many people took a long time to sit down, blocking the view of those behind them."
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "A great spectacle. We had tickets for the Tokyo May 2015 tournament and spent 5 hours watching Sumo and eating sushi, snacks and drinking Japanese beer! A great afternoon. Despite understanding only part of what was going on, it was good fun. The facilities at the arena were excellent. If you are in Japan when the tournament is in Tokyo I would say go and watch!"
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "One of THE highlights of my visits to Japan. We had a great four hours there for one of the tournaments, and was lucky to sit next to two Japanese ladies who explained a bit in broken Japanese/English and sign language and we soon joined them in loud support of various wrestlers.It's dead easy to book tickets at any 7/11 store and our seats cost just 5,100 yen which gave us excellent views of the bouts and stadium. I walked all around the arean and views from anywhere were fine.Snacks and drinks readily available"
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Sumo wrestling was the HIGHLIGHT of Japan!. I am not a sports person, I am not one to watch basketball, soccer or cricket on televison however I fell in love with Sumo Wrestling after being in Ryogoku Kokugikan! This was really the highlight of the trip, everyone n the stadium gets really into the game! There was a nice old man who sat next to me and did not speak English but still kept trying to talk to me about the match - his enthusiasm was infectious! Highly recommend watching a sumo match if you're in Japan during sumo season - you will not regret it"
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "A must see, when its on. These a two week events, that happen every other months (1,3,5,..). We were lucky to be in town. Had seen this many times in TV but live its so much better. Simply enjoy the atmosphere, the rituals, but also the japanese audience, enjoying a truely japanese sport."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "I enjoyed the tournament. I had fun watching the tournament and drinking beer. This is a good way to learn a little about Japanese culture. Purchase tickets in advance! The seats you want might sell out in minutes! And make sure your credit card company knows you intend on using the card for an international transaction. My card was blocked and my credit card company contacted me regarding possible fraud."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Possibly the best thing you can do in Tokyo. Find someone to buy you tickets and splurge for the good seats. Watching sumo live is a once-in-a-lifetime experience, well worth the cost. Pay for the English coverage is worth it (100 yen) and it gives you live, play-by-play analysis. Go outside from the first floor towards the food vendors and you can see the wrestlers as they leave after their bouts. Most are very happy to pose for photos and sign autographs. Definitely a must do in Tokyo. Possibly one of the best things you can do. Highly recommend this."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Cool experience, and the matches are so exciting! . The whole ordeal was interesting; seeing the people in the venue experiencing a traditional sport, the entrance ceremonies of the fighters, and so on... Not to forget the fights themselves !Of course they are over so fast (each 2 competitors face of only once, and most all of the fights are over within no more than 10 seconds or less), and then you wait 4 minutes until the next one..NOTE: English commentary is available via a local radio station . get a receiver for a small charge (before they run out of them) or just bring one with you!"
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Nice visit . We happened to be in Tokyo the same time the sumo tournament was on and decided to go.We arrived around 2pm and saw all the general admission tickets had been sold out so we had to buy chair seats. They cost us 5000¥ each and we were seated up the top in the back of the stadium.You could still see easily down to the arena. The professional sumos started around 2:45. It really only goes for a few seconds before one person is pushed out of the ring.It was still very cool and we would recommend going to anyone who happens to be in Tokyo at the same time."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Must See. Went to Tokyo for vacation and we happen to goin the middle of a 15 day match for sumo wrestling in Tokyo. Idefinitely recommend going. It's easily understood but recommend getting with a group and guide to hear more history and stories about the wrestlers."
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Fantastic if you can see a Sumo wresting day!. I do really recommend a visit to see maybe the worlds oldest sport. I have seen tournament on television but nothing beast a tournament in live. This is a must see in Tokyo. Prepare your booking well in advance the best seats are usually sold out a month before the tournament starts. If you are looking for single seats or two seats try to book A1 seats on row 1 if possible. A1 or B1 boxed seats are better but you need to buy four seats on the floor even if you just need on ticket. The A1 seats are a chair far more comfortable since the tournament starts at 08:30 in the morning and ends at 18:00 in the evening!"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "SUMO!!. If you are in Tokyo during Sumo season, it would be a shame to miss it! We came specifically for Sumo season, and it did not disappoint. The Ryogoku is a great building, we had class B seats, and they were surprisingly good. Would try to avoid class C, they were wayyy up there. Go to watch the Sumo wrestlers enter the arena around 130pm, before the higher up matches began (around 2)Really exciting, do not miss !"
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "A great experience and fun to watch. Went to watch with my siblings and we had a great time. It is our first time watching sumo wrestling and even though we were seated way up the arena the view was still okay. There are train stations near the arena and there are lots of signs pointing to the right direction so you won't get lost. The matches are very short but exciting. Usually the time it takes for the wrestlers to get ready is much longer than the match itself. Matches from the higher division of wrestlers are more exciting than the ones at the start."
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Colourful and Great Fun!. I try to plan my visits to Japan to coincide with a Sumo Tournament. I then work my itinerary around attending towards the end of the Tournament schedule. It is well worth it for the theatricality and great atmosphere. I don't spend all day there but arrive around 3pm, in plenty of time to watch Rikishi arriving and leaving the venue and be seated for the spectacularly colorful entrance parade of the Makuuchi Rikishi and the Ceremonial Entrance of the Yokozuna Champion. I always stay for the 6pm Bow Twirling Ceremony which closes the program. There are many opportunities to see wrestlers in the streets around the venue, arriving, leaving after their bouts and some eating in nearby restaurants. I have found that many of those in the lower divisions are very willing to pose for photos."
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Meet a wrestler & go to the museum for free!!. We were a bit unlucky turning up here as there were no events on the days we were in Tokyo, however we still had a great experience as we met a few sumo wrestlers.We'd seen numerous sites advertising the chance to watch wrestlers train, advertising the matches, photo opportunities with them etc, however we just came here to visit the musuem, and realised we could see them here for free!We went around the museum, which isn't very big, and took a few novel pictures outside, and then a few sumo wrestlers strolled in (I presume to train or sign contracts or something!), so although we didn't see a match we still got a few pics, which we never would've got amongst the crowds for any bout.A great experience that would've been a letdown with no sumo wrestlers around!!"
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "Oh Sumo!. One of the very few places to see anything Sumo related.Good bits- impressive sumo stadium from the outside.- check out the museum to understand sumo past and present.- if lucky watch Sumo wrestling- good place to take some fun photos- get some sumo souvenirsBad bits- Museum closed on Sundays.- Strangely Museum shop is closed on Mondays- there is only so much Sumo wrestling one can tolerate, so it can get a bit old after an hour if watching matches."
        }, 
        {
            "index": 133, 
            "rating": "5", 
            "review": "Really fun and rare experience!. By far a must if you are lucky to be in Tokyo when the Sumo tournaments are. If you go on a day when the tournament just have started you can easily get tickets. If you want to see the finals you better buy in advance. We were there during the beginning of the tournament but had really fun. It is like an American Baseball match where you can sit and relax for a while and every now and then something happen. Grab a beer, sit back and enjoy the big masters challenge each other. This is a must!"
        }, 
        {
            "index": 134, 
            "rating": "5", 
            "review": "An impressive sight into the Sumo tradition.. I booked my tickets several months in advance as I heard they sell out quickly. I managed to find the place easily enough and found my seat. (There was a lot of spare seats near me). I went on my own and thoroughly enjoyed myself although people who had friends seemed to be having a better time. Was amazing to see traditional sumo wrestling and it was a highlight of my trip."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Sumo experience was great, but get there early for English radio. My husband and I went to the January 2015 finals. The sumo wrestling was great and we enjoyed watching it partly through a pair of binoculars that we brought with us. The athleticism of the wrestlers was amazing. We were disappointed that the radios were no longer available when we arrived (around 3 pm). However, I am not sure that we would have wanted to be there for longer as we arrived just around when the more exciting matches were meant to start and we felt like we were able to watch a good number of matches. We pre-ordered tickets through Sumotickets online.The atmosphere during the final matches was great!"
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "A great insight and taste of the great Japanese tradition of Sumo.. I visited this building as it's where the Grand Tournaments of Sumo held. Sadly there was no Sumo event scheduled for while I was in Tokyo but I wanted to see the building anyway and they have a small Sumo museum which is free to enter and had some nice Sumo related exhibits such as the \"keshō-mawashi\" that the Sumo wear during the ring entering ceremony. There were also photographs of famous Sumo wrestlers and you can buy a booklet that explains all about the Sumo tradition, ranking and rules for a very reasonable JPY100 (that's GB£0.60)!There are some nice paintings of Sumo on the outside of the Kokugikan. You only need about 1/2 an hour here but it's well worth it and gives an insight and taste of the great tradition of Sumo."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "An incredible experience!. We attended the semi finals of the January 2015 Sumo tournament. We listened to the English commentary with headsets which was extremely helpful. We loved the whole exciting experience and felt honored to be there as it was the first sell out sumo tournament in 18 years! And we saw a world record broken by one of the fighters, amazing! A must do in Tokyo."
        }, 
        {
            "index": 138, 
            "rating": "4", 
            "review": "Sumo wrestling. We attended the sumo wrestling grand final and thoroughly enjoyed it especially if you have boys. These guys are real athletes even though they mightn't look it! It was intense and the final fight between the champs was fantastic. It did get a bit long at times so would suggest not an all afternoon event and it's worthwhile getting some back ground on the ceremony. The ear phone and radio had sold out by the time we arrived so that was disappointing. But overall this was one of our highlights of our visit to tokyo."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "A must!. Any trip to Japan is not complete with this enthralling and updating experience. Tickets can be hard to come by depending upon circumstances, so we used JTB tours to secure tickets."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Sumo fan for life now. Amazing day. I urge you if your travelling to japan to time it with a sumo tournament. The atmosphere is spectacular and the sport so exciting and complex. Fantastic experience, could not recommended it more. Also use buysumotickets.com, great service"
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "One of the highlights. This was one of the highlights of the trip. I didn't know what I was in for but really enjoyed the whole afternoon. We brought the cheap seats and ended up sitting closer to the action as the stadium was not full, so that's a good tip and also hire a radio for one dollar to listen to the English commendations which was insightful."
        }, 
        {
            "index": 142, 
            "rating": "4", 
            "review": "Great sumo experience. This was our second trip to the sumo having bought our tickets through Sumotickets online (jeff), the tickets arrived just before Christmas allowing them to be christmas presents.This time we had front row upper seats which was better than our previous mat box on the lower level.The view from the upper seats was better than down below on the more expensive floor area. But we were front row against the rails with no one in front of us.Whisky highball and tayaki , what better way to spend and afternoon with the family. At the end of the night don't rush to the station with the many thousands of others, just have dinner in one of the many good little eateries and wait for the massive crowds at the station to abate."
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "Really fun. Very glad I did this. Great time. Better to arrive around 2-3pm and just see the better guys though. Arrive too early and maybe you won't have the same enthusiasm for the best matches. Catch a late lunch and then head over. Good there isn't much to behold."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Amazing atmosphere!. My friend and I did this on our first night in Japan and it was amazing. We bought tickets through www.buysumotickets.com as we don't speak Japanese and the guy Jeff, was really great. He put us on a wait list and managed to not only get us last minute tickets but also had them waiting for us at our hotel when we arrived.The sumo tournament itself was amazing to watch, and the atmosphere with all the locala cheering on their favourites was amazing. We even saw the emperor and his wife watching from their box.Absolutley recommend this experience to anyone travelling to Japan during a tournament season."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Always Amazing!. I love sumo! It's such an amazing, fast paced sport! This is my third time at Kokugikan Stadium and every time is as exciting as ever! We usually buy box seating which is very close to the center stage. They are on the expensive side and they are supposed to seat four people. But if you are tall, I would recommend a max of three adults per box. This last time, the boxes next to us had four tall adults and they looked miserable! Since you seat on the floor, you have to keep your knees bent at all times and it becomes very uncomfortable after a while. Also, if you are going to see sumo for the first time (for the experience of being in Japan), you should buy less expensive seats. It's not worth spending a lot of money to be bored and in pain. On the other hand, being at Kokugikan is very exciting, and rooting for your favorite wrestler is a lot of fun!"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "I'm a SUMO CONVERT. i love SUMO ... THIS IS GREAT - check before you go and if it's on YOU MUST GO .... Especially from 2pm to 6pm"
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Great atmosphere, insight into the rituals. It was my first time to see a sumo match, and I found it so fascinating to see the BIG men, how they warm up, their costumes, sponsors/advertising introducing them before they walk on. I was on second level but the atmosphere is still great. If you can get seats in lower levels, you are one lucky person :)"
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "Unique Japanese experience. We visited here on the third day of the tournament in Tokyo, January 2015. As overseas visitors we had considered buying the tickets from an agent. However, in the end, given it was early in the competition, we decided to wait until we were in Japan. We bought our tickets from one of the many Seven Elevens (you can also buy them from other supermarkets as well but if you don't speak Japanese, you will need the help of someone who does to enter your ticket requests into the machine). As for the Sumo, it is pure theatre! We arrived at about 1.30 and the time flew by until it was time to go at 6.00. Our only slight criticism was about the English commentary of the event. We rented the radios for a very reasonable price of 100 yen each, once your 2,000 deposit is returned). However, although we obtained the radio at 2.30 (the earliest you can get one) the commentary didn't start until 4.00 and then what you are listening to is the television coverage (rather than coverage that is aimed for the radio). Also if were to do it again, we would bring our own headphones, as we found the ones provided (they sit in the ear) to be a bit uncomfortable after a few hours). But overall, a great experience, one not to be missed."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "Sumo is a MUST SEE. Try and time your visit to Tokyo to attend a Sumo tournament. Our day was a highlight of our trip to Japan. We bought our tickets online through www.buysumotickets.com and the service was fantastic. Staff at the stadium were very helpful and they have a special service tent for English speakers."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Sumo Time!. Went her for the tournament at the end of September, we didn't really know what to expect as we always set out to try and watch a sumo match/tournament went coming to Japan.We ordered our tickets before (would strongly recommend doing this from a website) they cam within plenty of time before we left England.Got in with the tickets very easily, we also rented a radio that gave English commentary on the matches. Definetely worth it if you want to know abit of history of sumo from the commentators.The tournament was around 3 hours and got a lot busier during the latter stages of the competition! superb atmosphere for the final!!"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Top Experience in Tokyo!. Through our hotel concierge my daughter and I learned there was a Sumo tournament while we were in Tokyo so on a whim we decided to go. We couldn't buy tickets in advance since we were going the same day. So we went over to the stadium, stood in line and bought the cheapest tickets for a certain segment of the tournament. Though we were sitting up high in the stadium, we could see very well, we were among locals and we found the Sumo fascinating. We thought we would stay for a couple of matches but instead stayed for the full 4 hours."
        }, 
        {
            "index": 152, 
            "rating": "3", 
            "review": "Went at the wrong time. Well it's different, but only saw the shop & small museum. The shrine outside was worth a pic & there is a chance to put your face onto a sumo cut out, if that is what turns you on."
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Amazing feats. We booked a tour with Viator, exactly the same as one of the previous reviews but back in late May. Very fortunate to have randomly chosen the day of the semi finals. Our guide was a lovely lady with the most sunny & positive personality. She explained details that otherwise would have been completely lost on us, from the history of sumo, to the rituals, rankings & rules. Radios playing english audio also helped but we didnt actually rely on them as much as I thought we would. We booked the tour as a purely 'touristy' experience & had no real prior knowledge of the sport. Despite this we were completely swept up by the excitement of the crowd and the amazing display of strength, strategy & seemingly impossible agility by the sumo. The crowd enthusiasm was infectious, especially knowing that Japan had not had a yokozuna (grand champion) in some years, so one of the sumos had become a fan favourite as he was Japan's best chance at claiming the title. The bouts are quite short so you don't really have time to get bored (being a non sporty person, I thought that might be an issue). There are also roving beer & pizza sellers that roam the stands, which saves you from having to leave your seat. Souvenir stalls provide plentiful options. While not cheap I did not come across similar sumo themed souvenirs in our travels so was glad to pick up an item while we were there. Surprisingly it turned out being one of the highlights of our trip and I'm very glad that we ended up going!"
        }, 
        {
            "index": 154, 
            "rating": "4", 
            "review": "Big men doing powerful things - go sumo. Got tickets with a days notice from tourist information for $35 each and were advised to go to the tournament at 2.30pm- the event concludes at 6pm each day. The grand tournaments go for 2 weeks, and your ticket allows you to go from 9am, but the big men only come on from 2.30pm.The prefight rituals are just as big as the actual wrestling, great afternoon.Venue is easy to get to and an easy walk."
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "Sumo different. We spent the whole day at the sumo stadium arriving at 9.30am and leaving when it finished. When we first arrived not so many people there but my the end the whole stadium was full. Different sport and hard to understand exactly with only english as our language but was interesting to watch."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Amazing Cultural Experience. The Sumo Wrestling is one of the best experiences in Tokyo and provides an amazing cultural insight. You have to buy tickets in advance as this event sells out quickly. We sat in the first upper level block and had a good view with reasonably priced tickets. The sumo only runs tournaments at certain times of the year in different cities, I believe in Tokyo it's March/April and September."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Lots of Fun. We bought Sumo tickets for the recent Basho in Tokyo. There is an English website that allows online purchases of tickets about 5 weeks before the event. You print out your tickets at the entrance. You will need your order number from the Email and the credit card used. We bought Section A seats which are about 3800 yen each. These seats are very good and you get a \"regular\" seat and not have to sit on the floor. The matches are a lot of fun. We arrived at approx. 2pm and watched the highest ranking Sumos walk in the stadium. The top divisions start their matches at about 4pm and will finish at 6pm. Great cultural event ..."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "An amazing experience I will never forget!. We planned our trip date to Tokyo so we would be there during the Sumo tournament. Me and my husband didn't know that much about sumo wresting but thought it would be an amazing experience and it surely did not disappoint. We booked box C tickets which can fit 4 people but that would be quite a squeeze, it was perfect for the 2 of us as we were able to put our legs out and the view was really good. Tickets do sell out quite quickly so make sure you book in advance. We arrived at about 13.30 and watched some the Sumo wrestlers arrive from outside- they are seen as big celebrities in Japan. At the beginning the stadium was quite empty as it began with the low ranking matches but it helped us get a good idea of the concept. The stadium begins to fill up more when the higher ranked matches begin. Even though all the commentary is in Japanese it is easy to pick up the concept of it all. The atmosphere is great and the fans get really passionate. We bought in our own snacks with us however you can buy bento boxes there too. If you are not in Tokyo during the sumo tournament I would highly recommend seeing the sumo wrestlers in training!"
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "You don't have to be a Sumo fan to have fun here!. Had a fun morning at Sumo when I visited Tokyo in September, access is quite convenient through the metro, the arena was vast and mostly empty and I didn’t know any of the sumos who were battling or pretty much any knowledge about the sport but I still had a fun and entertaining time watching them duke it out, you’re allowed to buy snacks on the premises and bring them with you while you’re watching. It was nice seeing the Japanese audience interactions before fights begin, I didn’t understand what was being said but you sort of get the idea. The sumos in general are treated like celebrities with hordes of groupies waiting and stalking them, it was surreal! There are betting stands as well but you’ll need a strong command of the Language to manage your way through that or a guide. The stadium grounds are not really that big but they are colourful with lots of wall portraits. There were some great souvenir stands around the arena .  I Could have easily spent four to six hours here but I gave it 2 and half hours (sort of got repetitive) and decided to head to the superior Edo-Tokyo Museum (literally next door and a must see!) Sumo is seasonal so plan and book for tickets ahead because they sell out quite quickly especially during the finals, best way to purchase them is through their official website, http://sumo.pia.jp/en/The ticket prices depends on your seating, I got the least expensive arena seats (Y 2000 + a 1000 service charge) on the second floor, didn’t have a problem viewing the action and well worth a visit. Upon completion of the purchase an invoice will be sent to your email address, during match day you’ve got to bring a print out of the invoice and use a special automated kiosk to the right of the ticket stands and exchange them for tickets ( be sure to bring the same credit card you used to purchase the tickets online)."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Excellent atmosphere!. We were in Tokyo during the Sumo Tournament and I booked tickets for the penultimate day. I am so glad we went. I booked a box seat for four which was great for two of us, four could have been a squeeze... Great views and an amazing experience! We arrived at around 4pm to watch the main fights, although I wish we had visited all day. The atmosphere was incredible, the cheers, screams, shouts. I'm not particularly a sports fan back home but I really got into this! A memory that will stay with me for life. Do not miss out!"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Great experience. We were lucky to be in Tokyo during the National Sumo Tournament in September. I got the tickets online at http://www.sumo.pia.jp/en/. I bought a box seat for 4 people. It's a great experience if you want to know and understand more about the japanese culture. The stadium was completely full and the japanese cheer for their wrestlers. It's an very traditional event. I really enjoy this experience."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Sensational Sumos. We were fortunate to be visiting Tokyo in September while the sumo wrestling tournament was on. Prior to leaving for Japan we booked a sumo wrestling tour using Viator. The tour was conducted by Sunrise Tours (JTB). We were picked up at a hotel and taken to a bus station to meet other tour participants and our guide. To reach Kokugikan Stadium the tour group travelled by train. Our guide showed us through the stadium and found a sumo wrestler who agreed to be photographed with us.Our seats were quite high in the stadium but views of the ring were clear. We received headsets to hear an English commentary of the matches and our guide was seated nearby.The wrestling bouts were amazing. Lots of dramatic pre-fight preparation preceded each bout, but the atmosphere was electric with the crowd cheering for their sumo heroes.At the end of the tournament our guide provided advice on how to return to our hotel, which was easy to do.Overall the tour lasted about 4 1/2 hours but was a fantastic cultural adventure.If you are in Japan when a tournament is in progress, make sure you book tickets to experience sumo wrestling!"
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Experience a fascinating sport. This is where the big guys show their stuff. It's worth it for the experience to see this ancient sport with all its wonderful rituals and traditions. Tournaments are held several times a year. From the preliminary rounds to the finals takes a couple of weeks or so. It doesn't matter if you're not familiar with the personalities - just go for the experience. Tournaments are held at the Kokugikan Sumo Stadium which is about an easy 10 minute walk from the Ryogoku metro station (Oedo line). Get the general seating tickets which go on sale in the morning for bouts to be held the same day. They cost only 2200 yen but you have to sit at the very back up near the rafters. But you'll still get a decent view and a good feel for the atmosphere."
        }, 
        {
            "index": 164, 
            "rating": "5", 
            "review": "Sumo is Amazing. One of the primary reasons we went to Tokyo in September was to see Sumo at the Kokugikan. Our tickets were group B, but were near the center of the row and section. They were fantastic. We went for the young sumo wrestlers and stayed all day until the end of that day's bouts. Well worth the money and time spent.In addition to the sumo, there are various places to get food and souvenirs. The takoyaki was very undercooked but the yakitori was good. If you go to the south entrance at the right time, you can see the sumo wrestlers enter the stadium. If you speak Japanese, try using one of the families that provide souvenir and food/beverage services to sumo goers. You do not necessarily need to register in advance with them, but it may be worth it to do so."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "A very worthwhile Japanese experience !. I arrived at 2pm explored the stadium and went to the museum and was seated in B arena which to my surprise had a lot of leg room even by western standards and offered a good view,but if I had to do it again I would upgrade to A arena.I rented a radio which offered English commentary and it was fun to sit among the Japanese and hear them cheer on their favorite wrestler. This was a first time experience for me and I got to see two Grand Champions \"Kakuryu\" and \"Hakuho\" in separate matches and was an experience I will never forget. After the matches it was nice to see everyone take their trash with them and deposit it into recepticals outside the arena,I wish the fans did that where I come from. Overall it was a great Japanese experience and would do it again in a heartbeat !"
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Fantastic experience. I am an avid sumo follower and this is the second time for me to watch the sumo. The first time was in Sapporo for an exhibition match. This was the first time for me to watch a tournament. I sat down in hand with a beer and watched sumo for 3 hours. Best 3 hours I had in Tokyo."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "One of the best things we did in Tokyo. We were fortunate enough to visit Tokyo during one of the sumo tournaments. I purchased our tickets online before arriving. Only because I wanted to be sure we could get one of the few special box seats they sold which typically seats four, but were sold to seat only two instead. You don't pay as much as buying the four individual seats, but it is higher than just buying two. This also allowed us to have room to spread out, which was really nice. I know that the seats in the upper area (more stadium style) are cheaper, and probably would have been fine, but I found it totally worth the price to be down closer, sitting in the \"typical\" boxes. We also rented the radios they have so you can listen to the English broadcast of the later \"main\" matches. We rented two, but found that they actually interfered with each other, so we only used one and just shared the earbuds. Definitely made the experience richer, to understand who the fighters were, what their records were, who the fan favorites were, etc. Definitely check this place out if you visit during tournament time!"
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Wonderful experience. We were lucky to find the tournament during May. For scheduling, please see this: http://www.sumo.or.jp/en/ticket/year_scheduleThe tournament is a whole day event, having fights since 8am until late afternoon. In the morning the place is almost empty and the fights are good but low ranking fighters. I heard later in the afternoon the place is very crowded and is like a party.Regarding the tickets, you can get them online or at the venue site. We got them there early morning, the cheapest ones. We got inside, enjoy for about an hour and leave. You can reentry one time. Personally it was an excellent experience and good enough time."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Brilliant experience. We booked seats for the May sumo tournament through sunrise tours about 1 month in advance. The tickets for the tournament were only 5100yen and well worth it. There were around 20 bouts but the build up and audience participation makes it really exciting and entertaining. There were pocket radios to use for commentary in English. They have beer and popcorn for sale as well as the usual sporting event/concert snacks. One of the highlights of our trip to Japan and something I would definitely go and see again."
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Must see if a tournament is on. I was fortunate to be in town when the May tournament was on, (it's also held in January and September). Seeing a sumo match was one of the best things I did in Tokyo. I've split my review into the event and then tickets, seating and getting there. 1) I arrived at 2.30 although you can get there for 8am but the morning is for low ranked wrestlers. If you do go early you are allowed to leave and re-enter, so you could go visit the Edo museum next door or grab lunch as there weren't many decent eating options (or bring your own food). On arrival I first rented an English audio guide for 100 Yen with 2000 Yen deposit. Before getting to my seat I waited in the side alley where the wrestlers enter the stadium and are applauded by the awaiting fans. It also allows a good photo opportunity close up. At 4 PM the top ranked wrestlers enter the arena and are introduced to the crowd. It was a good atmosphere especially for the later bouts and I found it really interesting with the pre fight rituals and subtle psyching out. The final bout was about 6 PM and rounded off a great experience. 2) I bought my tickets online at buysumotickets.com about a week before the event and had them delivered to my hotel. If ordering early they also ship to your home address. A really good efficient service from them for a small handling fee. In terms of the seats you can have \"Box\" or \"Arena\" seats, with box being Japanese style mats which you sit cross legged on and are for groups up to 6 people. Box seats are the lower level. I went for an Arena seat which is upper tier and are normal western style chairs. Cat A is the first 6 rows, Cat B are rows 7-11 and Cat C is 13-15. I went for Cat B which still provided a good view and had sufficient leg room but in hindsight I would have paid more and got the Cat A which are closer and more \"comfy\" as this is a one off experience. To get to the stadium go to Ryogoku (E12) station on the metro and take exit 3. The stadium is directly behind the Edo museum. In summary a classic Japanese experience that should not be missed. Enjoy!"
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Sumo is Definitely Worth It!. Even if you are not a fan of wrestling or sumo, I would definitely recommend watching a sumo match if you are in Japan during a sumo tournament and are able to get tickets. Attending a sumo tournament is a very unique and fun experience full of tradition. Some tips:Sumo matches in Tokyo only take place for two weeks in January, May and September.Can purchase tickets online from abroad. We purchased them from the official website.Purchase tickets early, especially for weekend matches or if want to sit near the front.There are 2 types of seats –arena chair seats and floor seats where you sit on a cushion. All seats in the stadium offer a good view though.While the tournament runs from 8am to 6pm you are able to enter any time-most people show up after 2pm but if you want to take pictures or sit in a better seat get there early.For more tips and advice about how to book tickets, where to sit, when to arrive and more, check out http://www.thetravelsisters.com/tips-for-watching-sumo-in-japan/.Sumo was one of my favorite experiences in Tokyo."
        }, 
        {
            "index": 172, 
            "rating": "4", 
            "review": "Sumo Tournament!!!. A must do/visit when you have the opportunity, as the tournament in Kokugikan Sumo Stadium only happen on January, May and September.Advance ticket purchase are required, I purchased my ticket thru \"http://sumo.pia.jp/en/\", its very convenient as its accept oversea credit card.We booked our sits on 2nd floor, eventually turn out quite a good view. It was fantastic, unique and one of its kind. Intermediate match start at 2.30pm, Pro match start at 4.00pm and its end at 6.00pm.Make sure you stay until the very end, as they will having a closing ceremony, something like Sumo Dance!!!"
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Top Entertainment. Went to the May tournament in Tokyo. Great entertainment and atmosphere. Highly recommended although don't sit on the mats too close to the action. In the final bout of the night a wrestler was hurled out of the ring and landed on an elderly gentleman at ringside. Seemed to be seriously injured and was receiving medical attention as we left the arena."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Sumo tournament. We booked a sumo tournament tour through sunrise tours (jtb). It was fantastic. We met at the bus terminal then the guide took us on the train to the stadium. Everything was perfect. We got a radio at 4pm which is in time for the senior matches with English commentary. It finished at 6pm and we made our way back to our hotel on our own."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Brilliant Entertainment . Completely unique, amazing sporting experience!! We enjoyed every minute of this. We were seated on the 2nd floor, one row back from the balcony. We had a fantastic view. We arrived halfway through the lower tier sumo bouts. The bouts were frenetic and the time between the bouts was only a matter of minutes. The main sumo wrestlers were paraded in after the lower tier bouts were finished. This was fantastic. The athleticism of these big men was amazing.I would highly recommend sumo to anyone travelling to Japan. It is only on 6 times a year & 3 of these are in Tokyo. Definitely book before you go!!! Our tickets cost approx 50STG and were worth much more."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Fantastic tournament. The Sumo seasons are very specific depending on which city you are in. but you can find information relating to the tournaments on many internet sites. We went to the Kokugikan to watch the current tournament and this was very easy to do on our own. We bought the tickets from our local 7 - 11 convenience store. The staff in there were very helpful and talked us through which buttons to press to get our tickets. One word of warning - there are primarily two types of seats. \"Boxes with cushions\" which are nearer the ring but involves sitting on your knees/cross legged for the entire duration - not easy for us Westerners. Or proper theatre type seats - the more you pay the bigger the seat - more legroom etc. That said, everywhere affords a great view. Whilst the tournament runs from 8am through to 6pm the best time to get there is probably around 1.30pm. This will give you time to go to the South Gate to see the Sumo wrestlers arrive. There are cheers and applause as the big stars walk in. Then take your seat for the opening ceremony & matches of the middle ranked players at around 14.20. The same for the big boys starts at around 15.45. There is some excellent pamphlets in English to help you with understanding Sumo plus a small museum. There are places to buy food & drink but we took in our own picnic no problem. If you cannot visit during a tournament we're told you can go in to look around and just next door is the Edo-Tokyo museum. Not entirely sure we understood the rules nor who was the winner, but this experience was absolutely fantastic and a great way to enjoy the essence of Japan"
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Sumo matches only during season . Sumo matches only happen during Sumo season. The rest of the time this is a museum, open 10-4 daily. The next sumo season is May 11-25."
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "Great entertainment!. Having this being our first time to Japan we just had to see sumo wrestling. We watched a retirement ceremony event. It had lots of wrestling before and after of course.It was packed full of people standing outside the gates just before the doors opened. You could watch the sumo wrestlers walk along the streets to the stadium which I thought was pretty cool. Many people were taking photos of them. When you get inside, the wrestlers are all standing in the lobby so you can take a picture WITH them as well.We sat in the Arena B section and it was still a very good view. If you want good pictures, bring a telephoto lense. All seats in the arena provide a good view from the 2nd floor. The fights were pretty quick for each round. The later fights were much more entertaining and lasted a lot longer than the earlier fights (higher ranked wrestlers compete later in the event). You can bring your own food in, but there is food to purchase inside as well. Lots of food was sold out about 2/3 into the event, so you might want to purchase early. There is a takoyaki stand inside as well.Location is near the Edo museum which is good because you could do both in one day. We spent our morning/afternoon until about 3-4 pm (when the event ended) at the sumo stadium and then went to to Edo museum for about 2 hours. It was sufficient time."
        }, 
        {
            "index": 179, 
            "rating": "3", 
            "review": "Interesting.... Interesting experience, this is worth a short visit if you are a general tourist but enthusiasts can spend more time appreciating the finer details. Worth a visit."
        }, 
        {
            "index": 180, 
            "rating": "4", 
            "review": "Grand Sumo Tournament January 2014, Tokyo. I purchased tickets in advance thru buysumotickets.com (good website) and requested the very first row in the arena 'A' seating for the January 16th match and got a great seat, right on the edge of the balcony, and a chair back instead of a cushion to sit on. I arrived at 9:30 am and watched some of the apprentice matches till about 11:30. Hardly anyone was there so I was able to wander around the arena and take some photos. I decided to leave and go to the Tsujiki fish market for lunch. You are allowed to leave and return once a day, and I had an enjoyable meal of high quality sushi. Many places to eat, all priced very reasonably. I headed back to the arena and had no problem getting readmitted to see the afternoon tournaments. Around 2pm the arena became more crowded as the journeymen wrestlers paraded around the ring wearing their aprons and a measurably better exhibition of sumo wrestling began. While no match I saw lasted a full minute, and most only seconds, the outcomes and wrestlers were cheered and applauded from the ever growing crowd.Finally, about 4:30 the masters started, with the parade to the ring in their aprons, posturing, purifying the ring with salt, and a quick rub with a wet washcloth, these guys were ready to go.It was a fun way for me to spend a day in Tokyo, but then, I like Sumo. I'm sure it's not for everybody, but it was fun. If you want to see the best, and have limited time, I'd suggest coming in the afternoon when the better wrestlers are scheduled."
        }, 
        {
            "index": 181, 
            "rating": "4", 
            "review": "Didn't go in but walked around and took pictures. The whole Ryogoku area is Sumo Town. The main Sumo stables where the sumos train are there, the chanko restaurants where they eat are there and the main stadium where the wrestling occurs is there. I spent a nice morning walking around and taking pictures of the neighborhood."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "A Great Spectacle. We were fortunate enough that there was the New Year Sumo Tournament taking place while we were in Tokyo. Our colleagues took us to the Arena to buy tickets as this proved pretty complicated on-line. We were given the option of buying tickets for Y8,000 with a credit card on the first tier quite a few rows back, but then the ticket agent said if we paid cash we could have some tickets that the wrestlers themselves wanted to sell for cash. We took that option, and found ourselves sitting at the front of the 1st tier on lace covered chairs, quite the VIP treatment. The view was amazing, and the tournament itself was very impressive.This is something that you have to do, its very 'old school', but you get the feeling that you are involved in something very special. You had no idea who was fighting who as everything was written in Japanese, we received a sheet of who was fighting who, but had to ask a spectator close by to explain who was who and which fight we were watching, (she spoke zero English), once that was clear we followed quite easily!.The stadium itself is very impressive, its easy to move around, food and drink was easily available, prices were fine, not a rip off like stadiums in Europe or the USA.This is something you should do."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Sumo Tournament with Children and Seat Reviews. First off, let me preface this review about the arena seating. Nearly every seat has an excellent view, because the arena is fairly small. So you don't have to pay top money for box seats or front upper level. I have seen Sumo twice at this stadium and both times have been great experiences.Here is the breakdown, box seats are most expensive and are just mats you sit on and start at approx 10,000 yen per person for the back and then go up in price as you get closer to the ring. No chairs, just the floor and a small mat. Then you have the 2nd level with four different sections, Arena Chairs A, B, C and general admission. Section A has nice movie theater style seats with little trays for food and drinks (about 8500 yen per ticket). Section B has the same seats with no tray (about 5000 yen). Section C has smaller seats and not as cushioned (about 3700 yen).The general admission is the last row and only sold on the day of the tournaments. The whole upper sections has a total of only 18 rows, so the sight difference is not much between front and backs of section.Now if you have kids, i think it is fine to bring any aged child, never that loud in there. My kids enjoyed it in fact. Under age 3 does not need a ticket (but has to sit on lap). There is plenty of legroom for them to \"move\" around, because we all know it is hard to still still for five or more hours.I would always sit in Arena Chairs B, simply because they are comfortable, lots of leg room, even for American standards, and still great sights for children to see and move around.The food selections are somewhat limited with mostly Japanese foods and things like hot dogs and French fries. However you can leave the tournament once with reentry, so you could eat at one of the many places nearby. In addition, you can bring your own food and drinks into the stadium, which is a plus for people with kids.If you do not want to be there all day, I suggest getting there at around 1330-1400, that's when the pros start and it gets more lively. It all finishes at around 1800 (6pm).For transportation, the train is the best bet as the Ryogoku train station is right next to the stadium. From Hachioji, Tachikawa, Ome, Yokosuka or Fussa areas, it is approximately 55-75 minutes by train, depending on starting point. If you are coming from the Yokohama, Saitama or Chiba areas, it is only about 40-45 mins by train. If you are staying in Shinjuku or Tokyo, it is only 15 mins by train. Driving is not really an option as for there is no parking at or around the stadium.So to review, best seats are Arena Chairs Section B, you can bring children with no issues, and you can bring food inside on your own. And lastly, many of the workers speak English and are very helpful."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Beyond our expectation!. When we purchased our Sumo tickets, we thought we just wanted to have the experience of watching the game since it does not happen every time we visit Tokyo, e.g. Tokyo only has the tournament in January and it goes to other cities in Japan for the rest of the year. However, initially scheduled to watch only for 1-2 hours, we ended up spending almost the entire day in the Sumo Stadium. The Japanese sitting besides us helping us to understand the game better, not the biggest guy would win the game, its all about technique and experience too. I recommend you to watch the game whenever possible during your visit to Japan"
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Worthwhile experience!. Bought my tickets in December and extended my holiday in Japan just so I could attend the Sumo Wrestling. I knew very little (and still don't know a whole lot) about sumo wrestling but one thing that is definitely striking is the agility of these wrestlers. We settled into our seats from about 2pm and were there til the end (6pm) and I never wanted to leave my seat. It was a unique experience and something I thoroughly enjoyed. There was also some delicious craft beer outside the gates in an old VW Kombi van (pricey but good). That set the appetite for the day and it was a great event, definitely a must see if you're in tokyo during the wrestling times."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Ten stars. From a sumophile, once you go, you'll be in awe of the culture, heritage, sportsmanship, and the physical abilities of the rikishi. I'm one who likes to attend from the first matches in the morning, featuring new wrestlers, to the Yokozuna matches. There is so much to write about sumo, but even if you have a short time for a taste of the action, it is worth the trip. The wrestlers show they are more than heavy guys in loin cloths, they have a spirituality, a respect for their profession (OK, you may have some arguements here), and an agility that is striking. If you can arrange for it, there are stands that sell meals that you can take to your seats. If you purchase a lower level seat, you can sit close to the action until the crowd arrives during the Juryo matches. Many who attend get hooked, and become lifelong sumophiles. Not to be missed!"
        }, 
        {
            "index": 187, 
            "rating": "2", 
            "review": "Tiny Museum. Unfortunately no shows are available anymore to view, but the museum is open for free. It is quite a small place with very few exhibits. Can give a miss if not already in the area! Wish we had the opportunity to see a sumo match! Tickets should always be booked in advance!"
        }, 
        {
            "index": 188, 
            "rating": "5", 
            "review": "A must see in Tokyo. We booked our tickets online before leaving the UK by following the instructions on http://www.sumo.or.jp/en/ticket/index. Tickets were easily collected from the automated ticket machine at the stadium using my credit card. I laughed at the statement on the website, when booking, about the seats by the ring being dangerous as wrestlers can fall on you! They do. You need to be light of foot if your going to sit right by the ring.We bought 2nd floor arena B seats which were western style seats and we had a really good view of the wrestling.This was a great afternoons sport, we saw the last two leagues of wrestling, you can go for the whole day with your ticket but this may be too much if you have limited time in Tokyo. Stadium is only a minutes walk from the tube station, so is easy to find. This is a must do if you are in Tokyo when the tournament is on."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Fantastic !. Just loved it so much !! You spend the afternoon or the whole day watching these semi-gods fighting like the ancient times, and you can drink some good beers and eat all day. I advise the soup that the sumos are eating, delicious ! Worth every penny !"
        }, 
        {
            "index": 190, 
            "rating": "5", 
            "review": "Very nice spectacle, unique. You might expect a wrestle mania like show, but it is not. Every thing is very traditional, they take it very seriously, like a ritual. We liked it a lot. We had a lot of fun, you can get food and drinks there to enjoy; you can even buy a bento box. Suitable for all the family. Every fight last just a few seconds.A must see!"
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "Great experience!. Stopped off in Tokyo to watch this and I'm glad I did. When arriving at the arena you get a program in English (if needed), it's got a walk way around the arena which as toilets sells food and gifts etc.When first seeing the arena the place is huge with 'boxes' on ground floor and seats on the floor above. You can take food and drink into the arena (I had a box) and come and go throughout (toilets/shops). I went in about 1300hrs and the young, mostly inexperienced wrestlers came on (still worth seeing) the top rikishi come on around 1600hrs.If your phones got FM then bring it because English commentary is broadcast on the radio."
        }, 
        {
            "index": 192, 
            "rating": "4", 
            "review": "Worth it. There happened to be a Sumo Tournament happening while I was in Tokyo so I decided to check it out one afternoon. I stayed for about an hour and a half which I thought was long enough, try and go later on around 3:45 because that's when the better matches are. I am glad I went and I think it was worth the $35 that it cost. Besides when else will you ever see professional Sumo Wrestling live?"
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "I never knew Sumo was so brutal. Before coming here, I was thinking of Sumo as a couple of fat guys pushing each other around. There is so much more to it than that. First of all, the ritual is very culturally cool, with the announcer and referee singing the praises of each fighter and where they are from. The Grand Rikishi parade is cool. And then the actual \"wrestling\", which is more like fighting. These guys slap the crap out of each other, choke each other out, and throw each other off of the meter-high sumo platform, so that they fall smashing into the audience. see a 400-pound man get launched 10 feet off a platform into the crowd is quite the spectacle. We had several OMG moments. It was awesome, and I loved it."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "So Much Fun!. My last trip to Tokyo was mainly to watch a sumo match at the Kokugikan Sumo Stadium. It was an amazing experience! It's cultural, it's tradition, hard work, training, and competition. The wrestlers are so strong, so dedicated, agile, and it was amazing to see them in person. We got tickets before we left the States and we wanted to make it a \"sumo day.\" First we had lunch at Chanko Kirishima Restaurant right across the Sumo stadium (chankonabe is a Japanese stew eaten by the sumo wrestlers). The food was fabulous! I highly recommend this place. Then we headed to the stadium and waited for the sumo wrestlers to walk in. People cheer for their favorite wrestlers, take pictures and wish them good luck. We found our box which was about 15 feet from the ring. It fit four people, but if you are a big person, it would be uncomfortable. You sit on the floor on a thin cushion (cushions that you see people throwing when a high ranking wrestler suffers an upset) and after a few hours, you can definitely feel it. You can also order food and drinks throughout the matches. The best sumo wrestlers come in the end and the matches are fast and exciting! You are never bored. Highly recommend it!"
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Fun!. A sport where the portly fan feels a real connection to the action. Easy to understand, a fast rotation of action and ceremony so you are never bored, and a great experience of tradition & good sportsmanship. Cheap, comfy seats too."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "awesome sumo match. we were lucky to visit Tokyo during one of the few times a year they have sumo matches. I'm not even into sports and this was really cool. The tradition that is ingrained with sumo is amazing. very entertaining and these guys are bad*ss"
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Great japanese experience. Got some tickets for the 2013 Aki-Basho, 2nd Level, 3rd Row, great seats for about 8.000 Yen.If you're looking for a thing you can ONLY truly xperience in Japan: Visit a Hon-Basho (Sumo-tournament) if you got the chance to do so.The fights may seem a bit boring first, but when the fighters get better and it's heading towards the Yokozuna-fights, you know why you've paid so much entrance money!REALLY worth it, especially on a rainy day, like I did visit."
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "Must do in Tokyo. My husband made sure we watched a sumo match in Japan. Sumo wrestling happens in Tokyo only 3x a year and we were lucky to visit in May! At first I thought it was boring, but after a while it was really getting interesting to see how the wrestlers fight. There is some drama going on in the ring! You don't have to attend the whole day's matches. Go in the afternoon and stay until the end as the best wrestlers always compete last. The ceremonies were also entertaining. Ask your concierge for more information and to get the tickets for you. No need for a guided tour for this. The stadium is just outside the Metro."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "A Must Do In Japan. My wife and I had so much fun watching the wrestlers both in and out of the Stadium. It’s amazing seeing these famous wrestlers just walking around the stadium like everyone else. That just doesn’t happen in the US. We went early in the September tournament in Tokyo and just walked up and bought tickets. My understanding is the later in the tournament the harder it is to get tickets. Our tickets were Box C and I believe on the North side right by the main entrance not far from the main TV camera. I would definitely recommend these seats because it’s not only the best view of the matches, but also all the traditions that surround Sumo."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Worth the visit!. We went to sumo wrestling for the grand championship. Which happens 3 times a year in different ares of Japan. The preparation each wrestler goes thru before they actually wrestle is quite unique. The \"wrestle\" itself takes a mere seconds. If you get a chance I would suggest going to watch a few matches."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Sumo tournament - definitely do it!. Attending the second-to-last day of the May sumo tournament was the highlight of our stay in Tokyo for our family of four! We bought tickets online in advance while still in the US through buysumotickets.com--the process was easy and we got our first choice day and seats. We chose \"A\" seats--the front-most section with regular chairs (below that you sit on the floor--closer to the action, but less comfortable). You will pay a premium to buy online, but the tickets sell out fast, so don't wait. The matches go on all day, but the top division bouts occur from 4-6pm. So show up around 3:15-3:30, stand outside and watch the wrestlers arrive at the stadium, then take your seats in time for the 3:45 ceremony. Definitely pick up an English audio set, as there are English-speaking commentators (from 4-6pm only), and you'll be lost without it. Each contender has a match each day for 15 consecutive days, so there are no semis or finals. By the end of the 21 matches during the 2-hour time period (about 5 minutes each, including about 20 seconds of actual wrestling), we understood some of the strategy and terminology. We were lucky enough to be there on the second-to-last day, and saw the two as-yet-undefeated contenders wrestle each other, an awesome (and lengthy) match. Since both still had to wrestle one more match the following day to determine the winner (or whether there would have to be a playoff), we (my husband, two college-age kids, and I) were excited enough to return to our hotel by 4:00 the next day to watch the final round on television. Highly recommend if you are in town for one of the tournaments."
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "You Have Got to do This!. We had bought tickets on line and started with a tour guide at Hamamatsucho Station, trained it to Ryogokan Station and into the throngs of people heading towards the stadium. Some of the sumo wrestlers were also arriving through the crowds so we had a close-up view. The local fans were there to cheer them on and many were waiting to see their favourites arrive.We went into the stadium and the foyer was buzzing with people. At the end was a showcase with all of the trophies on offer – the Emporers Cup, another huge one looked like the Davis Cup, and others. We went up to the second floor and all found our seats. Really good visibility and lighting. Some of the Juryo bouts were on so we watched those including the slight Czech sumo who was pitted against the largest of the fighters and beat him quickly and easily much to the crowds delight.We slipped out and bought some yakitori and a beer. The guide was a real sumo freak and she had done lots of homework for us. She had a book made up with all of the matched fighters for the day’s bouts with their pictures and stats so we could follow it more closely. Must admit we hogged the book for more that our fair share of the time. Before the Makuuchi bouts (the top group) there was a ceremony where all of the contestants come out into the ring, and another where the two Yokuzunas with their aprons with huge ropes and bows for adornment put on a bit of a theatrical greeting and the crowd loved it, especially the bit where they individually do a sort of moonwalk shuffle thing with their legs spread either side of the two white lines.There was another ceremony for the two new sumos that had been admitted and their supersized painted portraits were unveiled remotely to join the others in the gallery which runs around the very high ceiling to the arena.Radios are available for hire so that you can listen to the NHK commentary in English after 4 pm when the Makuuchi bouts begin.We had watched sumo on TV before in Japan when on holiday and had a few favourites, Kootooshu, Baruto and Hakuho and they just happened to all win on the day.We can recommend going to anyone even if you aren’t that interested in sumo. The spectacle of unique sporting event and the pageantry rooted in the Shinto samurai culture is wonderful."
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "Sumo Tournament. I ordered & paid for our tickets before I left the UK and the tickets were delivered to our hotel. We were there on the first day of the tournament so the stadium wasn't full at all and it lacked the atmosphere that a full stadium would have but the Sumo and all the traditions was fun to watch. We were on the second level which had proper seats and had a good view. We spent half a day there which was enough for a first-timer. It's easy to get to the stadium - same subway as the Edo-Tokyo Museum, go up the steps to the Museum and down the other side and you are a couple of minutes away from the Sumo Stadium."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Sumo Wrestling A Bucket List Must Do if in Tokyo in May. We were there in May 2013 and the main tournament was on , it was quite busy but getting seats was easy you can buy at the gate, the atmosphere and tradition is amazing and they give you paperwork to read so you understand the rules and the history of Sumo Wrestling.The junior fighters are in the mornings and from approx 3.30pm the senior and proffessional wrestlers are on including the Grand Champions.The inside of the arena is massive and the room is buzzing the Japanese are very passionate about Sumo so dont stand up or walk around if the grand champions are out its very disrespectful.Highly recommended and take your kids they will have a blast its good fun just to be there but the pomp and ceremony of each fight is very educational for people of all ages. Plan to spend several hours there and I would go in the afternoons more actionWe noticed that throughout the day many groups of school kids came in to watch and learn about Sumo."
        }, 
        {
            "index": 205, 
            "rating": "5", 
            "review": "highlight of our trip. we were lucky to have caught the may sumo tournament in ryogoku. we didn't book online, so we went there early in the morning to line up for tickets. they gave us an English sumo pamphlet and the day's juryo (second tier) and makuuchi (top tier) match schedules.the morning rounds were for the unranked wrestlers, and kokugikan was almost empty. we watched a few matches, then went to odaiba. we came back mid-afternoon (you can re-enter the stadium only once, and you have to keep your ticket) to catch the makuuchi matches. the ring-entering ceremony was nice, as was the entrance of the yokozunas. this was my first time to watch sumo, and I was completely enthralled -- definitely something that shouldn't be missed.any seat you get will be a good seat, because the stadium is not so big, and you get great views of the action even from the farthest row. on the first floor is a small sumo museum, an information desk and some stalls with souvenirs. the second floor also has an info desk, and some food options. I highly recommend the softserve ice cream :) if you want a taste of chanko nabe (sumo wrestlers' stew), proceed to the basement.kokugikan is just outside ryogoku station. during tournament time, many wrestlers use the train to get to stadium, and you may be lucky to share a platform or car with them."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Go see it if you're in Tokyo in JAN, MAY, and SEPT.. The Japanese love their sumo wrestling as the seats on the first level do get booked out way ion advanced especially over the weekends, but if you are in town - do try to spend a few hours of the late afternoon watching the champions wrestle.Doors open at about 8AM and the day starts off with the amateurs wrestling. If you've bought your tickets online via the Oosumo website, you can collect your tickets from 10AM. If you were wondering - \"hey, the match starts at 8AM but I'm missing 2 hours of the start !\" don't fret because hardly anyone is there exept for the match judges and wrestlers at 8-11 AM. The stadium will start to fill just before the champions start to wrestle which is around 3:45-4PM. Even the NHK English broadcasts of the day's match starts at 4PM. You can rent a little portable radio at the information counter from 2:30PM and costs 100 yen with a fully refundable 2000 yen deposit.Ringside seats are usually sold out way before but if you can - go for the 1st level \"B box\" seats for two or for four persons for a better view of the action.Getting there is easy as the stadium is close to the JR and subway stations.The only disappointment was the stadium's restaurant on the second level. Although inexpensive, the food tasted pretty bad. So bring your own bento or buy one from the many shops near the entrance to the arena.Although you could buy tickets on the day itself, 1st floor box seats for two usually sell out quickly as the day of the match approaches - so if you're going to watch the event as a pair, do buy your tickets in advance as there aren't many of such seats available. Plebs like me could forget about the ringside seats as they're usually booked out well in advanced by well connected persons.The match becomes increasingly exciting when the arena starts getting packed and the atmosphere more electric as the clock marches towards 6PM. Do be there by 2 PM to witness the crowd of Japanese fans lining the Southern entrance to welcome their favourite elite wrestlers prior to the \"ring ceremony\" by these same champions. 2:00 PM is the time the locals start turning up, so if you need to do something else in the morning; by all means don't feel that you've missed out on much at all. The match day ends with a \"bow ceremony\" at 6PM and drumming from the drum tower to exhort the crowd to return again the next time."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "Up close and personal with the Big Boys- a 1400 year old tradition!. One of the strongest cultural impressions of Japan is its tradition of Sumo wrestlers. So to actually be at Kokugian Sumo Stadium on the weekend seeing the big boys in action was an almost surreal experience for me. Like many people, I assumed it would be easy to get Sumo tickets but later realised that tournaments only take place in Tokyo 3 times a year so opportunities to see them are limited and require pre-planning.Ticket prices enable you to see a full day of bouts. Doors open at 8am. The earlier bouts starting from 8:30am are for the more junior lower ranked wrestlers so if you are limited for time, I would recommend arriving early afternoon. Different seats are available. Some are in boxes requiring you to sit on a pillow on the floor and others are seated options. What I loved was actually bumping into the sumo wrestlers (rikishi) outside the stadium on their way to the competition, dressed in their yukata robes. Most of them were happy to have their photo taken. Apparently they start arriving from 2pm at the South Gate. There are plenty of snacks and drinks available for purchase at the stadium and some stalls with banners outside the arena which is only a 3 minute walk around the corner from Ryogoku Stadium. The train station has sumo paintings and other sumo material to see as you exit the train.The bouts themselves are actually very short and can last between 3-6 minutes each. There is a lot of posturing, leg thumping, squatting, mouth washing and salt throwing in the lead up to the actual wrestling component- all part of the tradition which makes it enthralling to watch. To win the bout, the rikishi has to have one part of his opponent's body enter outside the circle ring on the clay sumo ring called the Dohyo. It can be as much as a finger tip or toe- so not necessary to push the opponent all the way out of the ring to win- although at times this does happen when you see one competitor pushed off the ring completely. The final bouts are for the very senior rikishi and the champions.Also during the afternoon there are 2 sumo ceremonies where the rikishi enter the ring wearing ceremonial aprons and form a circle on the sumo ring. They go through a short ritual act before leaving in single file. There are some great photo opportunities during these ceremonies! The concluding part of the day is the bow dance where a specially picked rikishi is handed a gold bow and then does an amazing twirling routine.The venue itself is great- viewing is good from most places although I think the bottom level is better. There are plenty of toilet and refreshment and souvenier facilities. There are also really informative booklets available in the foyer in English that explain the tradition, rules and history of sumo that I highly recommend you read before the bouts.The venue has a Museum exhibition room which can be viewed for free by ticket holders. There are plenty of restaurants in the area near the train station for a meal before or after the tournament."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Incredible Sport and Religious Tradition. Sumo tournaments are held in January, May, and September in Tokyo. The Sumida stadium is a short walk from the Ryogoku stations on the JR and Oedo lines. You can get a reserved seat for as little as 3600 yen on the day of a tournament. Just buy it at the gate where there are lots of helpful staff. Ticket numbers include a row, seat, and Chinese character for North, South, East, or West. If you wish you can rent a radio with BBC English language commentary for 100 yen plus a 2000 yen refundable deposit, but the matches are pretty self-explanatory. The highest rank Makuuchi matches start at 3:45 p.m. Buy a beer at one of the stands and sit back to enjoy an incredible Japanese sport with religious overtones. For 250 yen you can indulge in a bowl of chankonabe stew, the meal of champions, at a restaurant near the entrance. Definitely a fine way to spend an afternoon in Tokyo."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "Living cultural tradition!. The Sumo matches do not happen until May, but if you are at the Edo-Tokyo museum this stadium is adjacent to the museum. Sumo wrestlers were milling about and I asked one if I could take a photo. He smiled, took out his ear buds, and posed for the photo. What an expected experience!"
        }, 
        {
            "index": 210, 
            "rating": "4", 
            "review": "If a Tournament in town... Go!. We were in luck that in our trip there was a tournament. We had a great time. Food, and drinks are sold (sorry no hot dogs or burgers). It can be a full day event or only a few hours. We opted for the latter. Knowing the schedule we arrived in the afternoon to watch the grand sumo fighters. Early in the day has the light weight sumo fighters. The bigger boys start after 12PM. A lot of history and tradition still exists here. As for seating, if you don't mind sitting on the floor then get the premium box (can seat 4-6). If you prefer traditional chairs, they are available but further from the ring. Normal chair view is fine if you ask me, unless you can seat on the floor (with cushion) for a long time. Ask hotel concierge for help in getting tickets, and see map before buying."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Great Experience. Went to the Sumo stables first, at 7am to see wrestlers practising in ring and learnt the various techniques and some of the finer points of judging. Up very close about 40cms from the nearest wrestler!! We also learnt much about the life of wrestlers as well as training scheduals - very limited space- for visitors maybe 8 in total. Went to the blessing of the stadium by the Shinto priests with all the officials and the main sumo wrestles. It was a fascinating experience and real insite into the National sport and we see it as one of the highlights of our Japanese tour."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Don't miss it!. If you are in Tokyo during one of the three 2-week long sumo tournaments, make sure you go.It is a little expensive but worth every cent. One of the highlights of my trip to Japan and one of the coolest things I've ever seen. BTW my girlfriend and her sister loved it too!"
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Sumo wrestling a must in Tokyo. This is my 5th visit to Japan in January for skiing. Each time I have been here I have been drawn to watch Sumo on the local TV. it is truly fascinating. I am addicted and as a female I am on my own amongst my friends:) it is rich in tradition and ceremony and gives a great taste of one aspect of the Japanese culture. If you have the chance go and see it \"live\".Tickets are best purchased on line before you leave. the tickets go on sale approx a month before the Basho ( comp ) starts. There are 4 Basho per year but not all are in Tokyo. the January tournament is always in Tokyo at the Ryogoku Kokugikan ( Sumo stadium ). You can check details at Nihon sumo kyokai website.Unless you are happy to sit on floor cushions for a couple of hours, you are best to get seats on the 2nd floor (2F on map ). Viewing is great from this position. You can hire a radio at the stadium that you can tune into the English commentary or maybe bring your own radio and tune in yourself. The hire is 100 yen with a 2000 Yen deposit.Plan to be seated by 3pm and you will see some of the Juryo division and be there for the ceremony introducing the senior wrestlers Makkuchi division at about 1545. The day will finish at 1800hrs.The stadium is right across the road from Ryogoku station and directly in front of the Tokyo-Edo museum. There is a small Sumo museum in the stadium area."
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "Sumo Matches is not to be missed!. After getting sumo tickets 1 month in advance we had the chance to watch SUMO at Ryogoku Kokugikan stadium. The best seats on the first level costs around 6000-10.000 yen over, but you can buy cheaper tickets as low as 2000 yen if you don't mind watching from the second level. It was definitely a true japan experience, seating in a box seat, having 'sumo bento', and watching sumo live. The sumos are huge! Love the rituals where they spread salts to purify the ring, and thump their feet to 'scare the demons' away. The matches is more interesting during the evening where the higher ranks sumo fight, especially the 'yokozuna'. I'd say, if you are in Tokyo when the matches are on, then go for it! (January, May and September)"
        }, 
        {
            "index": 215, 
            "rating": "4", 
            "review": "Sumo. Was lucky enough to be in Tokyo when a sumo tournament was on. I purchased tickets from buysumotickets.com before I left the UK. The company where very good and kept me updated until my tickets arrived. It's a full day event but I arrived at around 3pm to see the top Sumo's contest against each other . The opening ceremony began for the Makuuchi at 3.45pm and was very entertaining in itself. The actual bouts sometimes took a bit of time but with the locals screaming and shouting you can't help but get involved.The tickets are quite pricey but for me this was a one off and not to be missed. Well worth the ticket price."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "These dudes are big!. What a great afternoon. Tokyo was hit by a blizzard the other day so it could not have been a better day for us to have reserved tickets to the second day of their 2 week tournament. The nearest metro is Ryogoku which is about a 5 to 10 min walk from the stadium. Plenty of small restaurants around the area as the food in the stadium is pretty average with some sushi packs the best option. Your day can commence as early as 10am but we chose to roll up at 1pm when the big boys get into it. I've never been that interested but after seeing the size of these blokes, their explosive power and the way the locals get into it, we had a lot of fun. Imagine a typical die hard footy fan yelling at their favourite player and that's what the locals do. It was pretty cool. Just a tip though, it's not cheap and we booked four seats as we have two teenage boys. The four seats consist of four pillows on the floor in a square sort of caged section that you get to yourself. So if you can't sit on your butt on a pillow for an extended period get the cheap seats up on the mezz level. Not as good a view but more comfy."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Fun and fascinating. Everything about a sumo tournament at Kokugikan Stadium is great. The gates open at 8am, but don't go that early. All the good bouts are in the afternoon. I've been a couple of times, and these are my hints. Arrive at about 12.30pm. Use the morning to visit the Tokyo Edo Museum (the spectacular building right next door). When you arrive at the stadium, before you go in, spend a little time on the footpath out the front of the stadium to the right. This is the route that many of the Sumo wrestlers take to walk to the stadium from their sumo stables. You will probably see sumo groupies on the footpath, and if you do, join them! You can certainly ask to have your photo taken with some of the less \"important\" sumo wrestlers. (You can tell the important ones by the young sumos following them, carrying their gear. The really important ones have two young sumos to attend to them.) The fans on the street will shout out encouragement to their favourites as they walk past or as they arrive in their cars, and they create quite an atmosphere. After about half an hour go into the stadium and find your seat. In the entrance foyer of the stadium is a brochure stand with excellent brochures in English talking about the stadium and sumo and its history, customs and rules. Take them to read. After you've found your seat, if you haven't eaten, buy a bento box from one of the stands. They sell out quickly. Then go back out to the sumo entrance, inside the stadium grounds. From about 1.30 the big sumo stars start to arrive, and it's fun to watch the fans get very excited, as well as to see how truly \"big\" these stars are close-up. Get back to your seat by around 2pm, because the first procession of competitors happens between 2 and 2.30. Then enjoy the bouts. As the afternoon progresses so does the level of competition. The most important bouts are right at the end. After you've seen a couple of early bouts, go and have a look at the sumo museum, in the stadium. After the final bout of the day, when everyone else starts to leave, stay so that you can watch the traditional bow dance. If you're lucky enough to be there on the last day of the tournament, stay for the prize giving ceremony - the trophies are so big, you'd have to be a sumo to lift them!When you buy seats, remember that some of the best seats in the house are the worst for foreigners. The seats on the ground floor of the stadium, including the box seats, are simply flat cushions on the floor, with no room to spread out. You have to be capable of sitting cross-legged or folding your legs under you for hours if you have these seats. We got a box the first time we went, and we spent a lot of time standing at the back, in the aisle. Second floor seats are regular chairs.We bought our tickets before we left for Japan at www.buysumotickets.com. They were helpful via email with seat choices and the tickets came within a fortnight. They charge a small commission, but it's worth it to know that you've got a seat. The tournament we attended was sold out weeks in advance.The sumo tournament is a sporting event filled with customs and ceremonies that are hundreds of years old. It is definitely a cultural experience, as well as a sporting event. There's nothing quite like it - the extraordinary physiques of the competitors, the costumes of the officials, the arena, the attendants, the singing announcements, the posturing and gamesmanship, and so many other things unique to sumo. Don't miss it!"
        }, 
        {
            "index": 218, 
            "rating": "3", 
            "review": "The Place to Go For Sumo. Every visitor to Japan should see Sumo once and the Tokyo Kokugikan (a 20 minute cab ride from Tokyo Station) is the best place to see Sumo once. You should check your travel schedule against the Sumo schedule as sumo is only in Tokyo for about 4-6 weeks a year. If you are a business traveller to Tokyo a vist to the Kokugikan is recommended on a spare afternoon or stay-over Saturday or Sunday afternoon. You can get tickets through JTB or your hotel concierge. Take you camera and relax! It is a unique cultural experience."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "great experience. I was lucky that when I arrived there was the international grand tournament going on. had to line up really early in the morning to get a ticket for the same day, but it was completely worth it. you need to be informed that the best athletes compete towards the end of the day. its a really nice ritual to go and observe"
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Quintessential Japanese experience - not to be missed. Japan is a land of immense contrasts, often between the very modern and the very traditional. Sumo is just one expression of this - you can tour hypermodern parts of Tokyo, or museums and galleries, then step into Kokugikan stadium to witness something that seems to be as different as it gets. There are 2 grand sumo tournaments per year. We were lucky enough to be in Tokyo during the autumn one. Getting tickets about halfway through the 20 or so day tournament easy easy. Instead of trying to go early in the morning to get cheaper day tickets (there is a chance that there are none left, plus the interesting fights only start later in the day, so you'd have to trek there twice). So we got regular tickets for a Monday, close to 100 Eur for 2 tickets (we went with a 10 months old baby [who was not perturbed by the fighting at all], who got in for free).It's an amazing experience, even if you don't understand much about sumo. It's just great to see the rituals, people rooting for their favorite starts, and lots of salt tossing and belly slapping. Really not to be missed. In the end we stayed some 2 hours and had our fill, but they also have food and drinks, so spending half a day or so there also seems easy enough."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Sumo Sunrise tour. I loved this tour, the Sumo was a thrill, we did get to see what I call the grand final, we had a sensational tour guide \"Take\" and he explained everything that was going to happen. We had \"B\" grade level 2 seats, I would recommend to pay for close up seats. Tour gave us English translation radio which explained everything that was going on, Even saw the Prime Minister present the winner trophy."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Sumo wrestling is so awesome!. Loved this stadium! One of the things I was really hoping to check out in Tokyo was sumo wrestling, and I am glad that I got the chance. At around 10:00 am, I went to the stadium to purchase general admission tickets which were 2100 yen. During the morning, there weren't many people watching the fights as the really big fights happen later on in the day (starting at around 2:00 pm). It is still fun to watch them though. I ended up watching some of the fights in the beginning, leaving to grab some lunch, and then coming back and watching some more until around 5:00-5:30 pm. The price is definitely worth it for watching all those sumo fights!You're only allowed one readmission, and you have to get a stamp as you leave, and then re-enter using the side entrance (and showing the stamp).What is really neat, is when you are entering the sumo stadium, a lot of times you will be walking right next to a sumo wrestler on his way in! There are usually people trying to take their photos or shaking their hands. :)Definitely a cool thing to experience!"
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "A beer while watching sumo... what more could you ask for?. We were in Japan during the May 2012 tournament so definitely had to go check sumo. Went on a Friday with the general admission ticket. It was \"dead\" in the morning, not many people watching the fights and honestly, the pace was slow. We left and came back a few hours later when it was a lot more packed. Since it was a readmission, we had to go in through a separate entrance which was the one the wrestlers take. It was awesome to walk amongst them on the sidewalk while the crowd was cheering. Had a beer while watching sumo because we simply had to. The only thing I didn't really like was that it seemed like there were more tourists than locals. Wouldn't do it again but definitely a worthwhile addition to a trip."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Sumo Wrestling!. This is one spectaculor experience. Such a huge tradition in Japan and the sumo, including the beautiful arena (pretty much all seats are good seats - thanks to buysumotickets.com) is something not to be missed. I surprised my husband, sister and brother in law with tickets - we sat in the \"box\" seats which is an experience in itself - and were lucky enough to also experience the retirement of a famous sumo which also included the \"hair cutting\" ceremony. Although sumo is not all year (much like our football, baseball etc - it has its season), if you are lucky enough to be in Japan during this time, it's definitely something to do. For tickets, go to www.BuySumoTickets.com. They (Jeff) were absolutely amazing and went above and beyond to answer all my questions."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Lots of flesh and great experience. Up there with Capsule hotels, Gesihas and Karaoke as the ultimate Japanese experience!Its not every week though as some think, so plan in advance. Simple search will show you schedule and days of tournament, book in advacne as sell out fast on the dayWe booked seats in area B, which were good view and pretty relaxed, couldn't do the tatami mats, so can't say what they are like, price and discomfort put us off!Early fights aren't much but go about 2ish to see Juryo Ring Entering Ceremony and then the Makuuchi (big boys) later!Also worth staying outside the stadium for abit with the crowds to see the sumos walking in, always good seeing one of the bigger boys like Hakuho or one of the Japanese favourites Check out http://vimeo.com/29776934for short video, without showing too much, great soundtrack as well!"
        }, 
        {
            "index": 226, 
            "rating": "3", 
            "review": "Sumo central. Some sumo artifacts on display including a video of historical development. No live demonstrations at time of visit but did run into two in-dress sumo wrestlers on the way out which made up for my disappointment not seeing them practice."
        }, 
        {
            "index": 227, 
            "rating": "5", 
            "review": "Seeing Sumo. If you have chance to go....GO! We knew we would be in Tokyo in tournament time and arranged our tix before we travelled through JapanBall.com. We purchased the lowest priced tix and still had a great view from the best side of the stadium. It was a great spectacle, and we wished we could have stayed for the evening session, but we had baseball to get to. Our tix did allow for us to stay - they cover your attendance for the whole day....allow a day, if you can...to take in the whole spectacle of the wrestlers arriving at the stadium outside, to the grand stadium entrances, to the amazing displays of one-upmanship and wrestling....all this from a non-sports-fan!"
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Must See!. If you're in Japan while a tournament is going on, you simply must go. It's a unique, memorable experience. Even if you know very little about sumo, once the matches start you'll be drawn in and you'll end up just as excited as the other spectators around you. The stadium is really easy to find - it can be seen from the JR Ryogoku Station, which is on the Chuo Line. We reserved tickets in the Arena C area ahead of time through BuySumoTickets.com and they delivered them to our hotel in Shibuya so they were there when we arrived. I'm not sure this is always necessary, but we were planning on getting there later in the day instead of early in the morning, so it seemed like a good idea. There were very helpful attendants inside the stadium entrance who helped us find our seats. Our seats were the farthest away from the action that can be reserved in advance, but I could see and hear everything just fine. Try to get a seat on the north or south side of the stadium, as the wrestlers face east and west and this will give you the best view. Your ticket will get you in for a full day - 8 AM to 6 PM. We got there around 3:00,around when the pros started, and found that that was plenty of time. The wrestlers who are the biggest deals go at the end, so just be sure not to miss the later matches."
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Great visitor experience!. Spent a day at the winter tournament and was one of the most enjoyable days of our trip. How many folks outside of Japan get to have this experience? Well worth the price to see this unique cultural event. Arrived early and stayed late so we saw all levels of Sumo. Enjoyed waiting outside for arrival of participants and they were all very accommodating with pictures. If your trip corresponds with one of the tournaments, make sure you add it to your itinerary. Would do it again in a heartbeat!"
        }, 
        {
            "index": 230, 
            "rating": "5", 
            "review": "sumo rocks. had a great day yesterday at Sumo in Tokyo. its probably not for everyone as the matches start at 9am and go til 6pm. the later in the day the better the talent. unless you want to sit on your azz for the entire time, get an Arena Seat. and i would gladly buy the best arena seat available. I bought mine from www.japanball.com, and they hand delivered the tickets to me. they charge a $59 premium no matter the number of tickets you buy. it was well worth it. as for sumo, if you like baseball, and have an interest in different cultural endevors, go. it was great fun. got to see the world champion who is mongolian. its great anytime when you see a world's best. go, its good stuff..c"
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Awesome Practice Session last Apr 29, 2012. While planning for our Tokyo trip, I wanted to witness a Sumo match. Unfortunately, during the time when we were in Tokyo (Apr 27-May1), the season hasn't started yet, but we were lucky that a practice session was held on Apr 29 and it was open for public for free. You can instantly know from the crowd's reactions who are the rikishi favorites during the session. Great experience. Highly recommend watching the actual matches if you are in town. I would, when I come back to Tokyo. :DI saw the prices of the tickets on actual matches, and it would cost a few hundred (and thousand yen for nearer seats). Blogged about my experience here:http://www.tagofabic.com/2012/05/sumo-wrestling-practice-session-in.htmland the official website of Sumo schedules here:http://www.sumo.or.jp/eng/kyokai/event/index.html"
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Sumo!. I've seen Sumo a couple of times. It's not an everyday thing so I was very fortunate to have had that opprotunity. One tournament is 14 days and only 4 tournaments per year. It's really amazing. Sometimes one match is over in a matter of seconds, sometimes it lasts for a couple of minutes. Either way, once the wrestlers are facing each other ready to \"go\" you can't take your eyes away!"
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "unusual but fun. I had the opportunity to see some famous sumo wrestlers although I can't remember their names anymore. Great atmosphere the sheer power and appearance of these fighters in their traditional garb was really interesting for me."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Superb Sumo - easy to book yourself. We had an amazing time when we visited The Kokugikan in January 2011 even as none sports fans. We were desperate to see some live sumo action while in Japan and very luckily for us, one of the 6 tournaments taking place in Tokyo each year was in town. We used a website called www.sumo.or.jp - which had easy access information for ticket booking in english. (OK they charged per ticket for processing but who does'nt these days!). You also receive a leaflet containing the history of the art (and more recently sport) which is just fascinating.The site has date of release information and floor plans of all the various venues across the country. The earlier you book, even if taking cheaper tickets, the better the seat. For example we took tier C tickets in Tokyo but were on the front row, paying half what the row in front were, for the same view. If you book via the site you get a confirmation within 3 days which you hand in on arrival. It is also possible to just arrive on the day and pay on the door, though this is less advisable.Inside the stadium are traditional foods, memoribilia and a small museum (though not much in english). But in all honesty you will probably be caught up in the action as soon as you arrive. The ticket gives you entry to the earlier less senior rounds which usually take place late morning, then continuous action until the Yokozuna class in the mid afternoon, finishing around 6pm ish. Dont miss the start of each session when all fighters arrive in the ring together, great for photos! Thoroughly worth it, cannot recommend it highly enough, enjoy!"
        }, 
        {
            "index": 235, 
            "rating": "3", 
            "review": "Worth a visit, wish it was more comprehensive!. The Sumo Museum is a bit tricky to get to from the subway. It's nestled behind the Edo-Tokyo Museum in the front of the Kokugikan building where the matches are held. Once inside the gates you can't miss it, just look for the wall painted with big Sumo wrestlers. The museum itself is free to enter and you are given a complimentary booklet describing the history of the sport. There is adequate (and sometimes charming) English signage but most of the descriptions are obviously in Japanese. There is a wall of past Grand Champions and numerous other artifacts. To the left of the museum as you face the arena is a store selling the requisite momentos. There are only three tournaments a year held here so unless you come during those times there won't be a match to watch.My only problem with the museum was that it was so small! Being that Sumo wrestling is one of the 3 or 4 things most people can even superfically relate to Japan, I was hoping for a more extensive, intereactive experience. How about having real wrestlers there showing their moves or a life size ring and talks on Sumo history, etc. ? You can easily do a comprehensive visit here in 45 minutes.Dont' get me wrong, it's still worth the trip but I just wish there was more to it; still recommended especially for those already going to the Edo-Tokyo museum."
        }
    ]
}