{
    "category": "Ubud", 
    "entity": "Museum-Puri-Lukisan", 
    "avg_rating_stars": 4.288819875776397, 
    "review_count": 322, 
    "rating_stats": {
        "poor": 7, 
        "average": 33, 
        "terrible": 1, 
        "very_good": 138, 
        "excellent": 143
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Learn about local art and origines. The heritage of Balinese art is to be found here. I found out about the influences that gave birth to painting and wood carving. It is a journey from the late 19 century to contemporary time; you will see exceptional work hosted in 4 buildings, each hosting artworks from a specific time period. The journey is well worth spending 2 hours if you like to read the descriptions and dive into the Magical and Mystical world of This part of great Indonesia ..."
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "Home of Ida Bagus Made. Good art museum. Unfortunately, facing tough competition, as Ubud is pretty much the unofficial Capital of Art. Still well worth a visit, assuming that you have already seen Neka and ARMA (as this is more of the same). This museum is hosting the best collection of works by Ida Bagus Made Poleng (probably the second best Balinese artist after I Gusti Nyoman Lempad)."
        }, 
        {
            "index": 3, 
            "rating": "2", 
            "review": "Totally dissappointing after seeing ARMA & Antonio Blanco Arts Museum. Totally dissappointing after enjoying the ARMA ( Ayung Rai Museum of Arts near Monkey Forest Sanctuary ) & Antonio Blanco Arts Museum, jusr 5-7 minutes walk away from this museum. It is spread in 4 buildings East-West-North-South , but the displayed arts work is not worth the high entry tickets charged, when compared to the displays at ARMA & A Blanco Arts Museum. Hence, do not waste time & money on this museum"
        }, 
        {
            "index": 4, 
            "rating": "3", 
            "review": "Lots to see. Lots to see, but it didn't particularly appeal to me, I preferred the temporary exhibits, much more my taste"
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Great trip back in balinese time through art. This was awesome for the whole family, reasonable price for the tickets including free tea/juice at the restaurant and the whole place laid out in historical periods across different buildings. Some awesome pieces of art depicting Bali's history, the buildings were nicely airconditioned or had good fans to keep you cool, the gardens were also well maintained."
        }, 
        {
            "index": 6, 
            "rating": "4", 
            "review": "Balinese art. the oldest museum in Bali use the oldest style of lighting in its displays. So a number of the works a very hard to see. There are four building and you follow the history of balinese art through these buildings. Well worth a visit"
        }, 
        {
            "index": 7, 
            "rating": "3", 
            "review": "Bit expensive but not a waste. I would recommend this to anyone who wants a bit of break and wants to chill out looking at some great art. The exhibitions were beautiful, as is the garden, but I felt that it was quite expensive as I had seen it all in about 30 mins and that was with reading all the painting signs. There was also a few tourist buses here which meant that the cafe place they have was too full to use. Great to do if you want to mooch about or if it is raining (it was for my visit)."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "To appreciate art and culture of Ancestors. this museum is the oldest museum in Ubud, collected a lot of arts..paintings, scluptures that were made by local artis.it very fascinating..they are doing a good works, and dedicated their life for preserve the art and culture of Bali.we apprecited it..thank you."
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Fascinating museum/gallery. A hot and rainy day in Ubud but we enjoyed our visit here. A great showcase of ancient and contemporary Balinese craft and art skills. The museum cafe has a very authentic Balinese/Indonesian menu."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "very informative. Lots paintings from Balinese artists. There are 4 buildings to cover. It took us just about an hour. An afternoon tea/drinks from the restaurant is included in the price."
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "Motley but fascinating collection, poorly displayed. 4 separate buildings housed a vast collection. Really need a guide to assist with allegorical details. Staff surly. But it's still a worthwhile experience for insight into Balinese culture. The gardens are terrific and the lotus pool picture perfect. There were also private paintings for sale, mostly upwards of $US 5,000."
        }, 
        {
            "index": 12, 
            "rating": "3", 
            "review": "Dark rooms made viewing art challenging. Although there is a lot of historical art present, some poor lighting made viewing challenging. Go to Rudana or ARMA instead."
        }, 
        {
            "index": 13, 
            "rating": "2", 
            "review": "Maybe for art lovers?. I am not one and didn't see anything extraordinary here. 3-4 rooms with art which was interesting but Bali itself is one giant art museum."
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "Very nice museum. Very nice. We visited it in a couple of hours and it really was a nice break from crazy motorcycle full Ubud :-)"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Beautiful art. Showcasing traditional Balinese art and history behind some artists. There are 4 buildings to explore with different categories or art by era, the art was stunning. There's is a cafeteria also although we didn't use it. The gardens are lovely. Good value for money and your ticket fee is what keeps the museum running. Recommend if you're into art. As with most museums flash photography is not permitted."
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "One of the better museums in asia. If youre interested in balinese art or history, this museum is worth a visit.i loved seeing the balinese paintings.museum had very modern interior, an awesome green garden, and you can also get a free drink in the restaurant."
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "Worth visiting!. It's worth visiting if you want to became familiar with Indonesian art in a short time :)) Ticket price is around 85k rupees but there's a drink from a restaurant included in the price."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Beautiful museum with important Balinese art. Museum is in the center of Ubud and houses some of the most important work made by Balinese painters. In four buildings, you find paintings belonging to different ages with often some information near the work. Keep in mind that Balinese painting is relative new and don't expect any abstract or contemporary art. We visited the museum ourselves and could find enough information to understand the transition from traditional art as a form of religious believes to painting for pleasure. Most works are nicely conserved, however the oldest paintings are perishing. Also, the location is very quite with a nice garden to escape the busy Ubud center!"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Beautiful. The Puri Lukisan Museum is a beautifull place to visit! Not only because of the building itself but the paintings are exquisite. Unfortunately we didn't have enough time to visit the whole exposition, but the part we did see was beautifull."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Worth the visit. This is Ubud's Municipal Art Museum. It has a lot of significant traditional art and art associated with Ubud region in the 20th and 21st century. Paintings are better conserved in recent years, but still they hang too close for proper display, and ofter dimly lit. It is nevertheless really important to see what you can."
        }, 
        {
            "index": 21, 
            "rating": "3", 
            "review": "a bit hermetic. A bit complicated to integrate balinese graphic culture. try to get a guide or read something about before.\nSplendid buildings....Everybody pretends having been visiting this museum but we were alone !"
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Beautiful art. The museum is home to some amazing art. The grounds are beautiful and well kept. There are several buildings on the property to see, the map is very helpful."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Best museum in Ubud. Display is beautiful, specially the south building collection. Centrally located. Great outline. Try to combine your visit with one of their cultural workshops. Worth every single penny."
        }, 
        {
            "index": 24, 
            "rating": "3", 
            "review": "Nice museum, but a bit boring. This museum shows Balinese art of the past (half) century. Interesting to see, but also a bit repetitive. Also, the museum could do with a bit more/better explanation. The wood carvings deserve special attention. In the entree fee, a drink is included."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Interesting insight into Bali's history and art. This museum, which consists of five or so buildings and grounds, was created by the then-King, local artists, and several Westerners who had settled in Ubud in the 1920's and 30's. I don't know enough to appreciate the art fully, though I enjoyed walking through the galleries. What I came away with was a strong appreciation for the enduring value of the effort that was invested, now almost a century ago, in nurturing and preserving the work of local artists. There is quite a lot of information about the king, whose deep interest and engagement in this project laid the foundation for Ubud's development as a destination for artists. We learned about some of the local masters, whose breadth of talent was stunning and fascinating. Also interesting was the information about those early Western artists and adventurous bohemians who spent their adult lives here and clearly contributed to promoting and preserving local art. We were there on a rainy day early in our week-long stay in Ubud, and definitely found that the history we learned at this museum enriched and informed the rest of our stay."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Great collection. Beautiful museum compound.. First to note is the museum compound itself. Very pretty, very Bali. Lovely and well maintained.The paintings collections are housed in 4 different buildings located nearby. I found the collections amazing and mesmerizing. Definitely a must visit when you are in Ubud. I plan to come back again."
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Beautiful collection of various styles of Balinese art in a pleasant surrounding. For those spending a few days or longer in Ubud, this centrally located museum is great to spend a few hours admiring the art (and the many photographs of the King of Ubud). There is also a lovely restaurant."
        }, 
        {
            "index": 28, 
            "rating": "4", 
            "review": "Great place to see some Art. I'm always interested in museum and particularly when I was in Ubud, this one was on my list to visit. I didn't expect to pay anything but it does ask for entrance ticket and for me as a budget traveler, it's a bit expensive. However, we got in free of charge, thanks to my friend who has a travel business.I was only inside the main building that displayed mostly traditional paintings. Good arrangement and the area was clean and spacey. The garden is also nice for taking pictures or just a short walk.The museum also offers a package of entrance ticket and meals."
        }, 
        {
            "index": 29, 
            "rating": "3", 
            "review": "Interesting art exhibits. This is a nice place to spend an hour or two away from the hustle and bustle of Ubud streets. Nice buildings and out of the sun with interesting exhibits."
        }, 
        {
            "index": 30, 
            "rating": "4", 
            "review": "Magnificent grounds. While the art was very interesting much of it was not to my tastehowever it was still very enjoyable and the grounds were great."
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "Dusty. Not quite the Louvre, but go. The slightly ramshakle-ness of the place adds to the feeling.... the buildings and gardens are interestingly designed.... it's a surreal, transporting experience... And the peek into the history of the art of the island really adds texture to one's visit..."
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Interesting museum and art gallery. Small but interesting museum with some great pieces of art. The grounds were beautiful but they were holding an marketing event so the entrance had many stalls and marquees. Still we enjoyed our visit"
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Nice Traditional Museum!. The museum is set in a nice traditional setting with a lotus lake , meandering paths and across separate sections. so you an take a break, the wander and see more. The art displayed is wonderful and spare time to read as you go along as you will then enjoy it even more!The entry ticket entitles you to s free drink and snack which is worth it and much appreciated too!"
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Great overview of Bali see art. Museum grounds beautiful and nice escape from busy street. Enjoying a cold drink before touring museum galleries reenergized us. Individual art pieces are not well lit which distracts from their enjoyment."
        }, 
        {
            "index": 35, 
            "rating": "4", 
            "review": "Good overview of Balinese Art. The setting is lovely and there is enough parking for visitors. It is situated close to the market and can easily be reached on foot.The gallery consists of several exhibition halls and restaurant facilities.The exhibits cover traditional Balinese art dating from the early 1900's to the present. One gallery houses an array of earlier work which presents scenes from daily life, rituals and mythical and religious drawings and paintings. A lot of these earlier works are monochromatic, but the later work is much more colourful.The second gallery houses more paintings of daily life, agriculture, landscapes and flowers.The third gallery is dedicated to more contemporary work which is for sale to the public The drawings and paintings vary in quality, but there are some excellent artworks amongst the selection that are sold at competitive prices. The quality of the work is far better than the art generally sold to tourists in other places.This gallery will be of particular interest to visitors interested in the development of art in Bali. The only serious draw back is the lack of good lighting. Brochures with more information on the art would also be helpful, especially for people without a particular art background. The gallery would also benefit from a proper web page to promote themselves and to give tourists more information about the gallery."
        }, 
        {
            "index": 36, 
            "rating": "3", 
            "review": "Nice place to take a stroll. Visited while in Ubud, a good chance to see local art located in a very nice place. The first three pavilions all had pretty much the same type of local art, dating from a long way back and the fourth building had some interesting historical photos and information. Your entrance fee includes a drink and snack in the cafe and this was a good chance to take a break while touring the town. The grounds were specacular."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Nice afternoon. Be on the lookout for crafts people. They are very willing and happy to discuss their work. The prices will be high, but generally you can count on the quality."
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "An unexpected delight. We are very familiar with Anthonio Blanco and Neka museum, but my wife accidentally spotted this museum when we were strolling down from Ubud Palace.To be honest, from the front gate it somewhat seemed that this place we're closed. I was hesitant to go in because it seemed kind of dodgy, but my adventurous fiancé insisted to go through with it and in we did.We paid an entrance fee of around $7 which is kind of steep for this kind of attractions. The price was written clearly on the ticket as to avoid petty corruptions. The staff in the entrance was nice and helpful.There are four studios available, each with arrays of paintings and sculptures with simple descriptions relating them to the history of art and mythological stories of bali. My fiancé who is a true art buff really enjoyed the museum, while I (a more pragmatic tourist) got bored after a few runs through the paintings.All in all it was still a nice surprised and we would recommend those who enjoy good art to visit this place!"
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "For art lovers. Museum describes hostory of bali art, mostly paintings and wooden sculptures through bali history till recent. Nice cafe in yard a possiblity to purchase some art"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Strangely interesting. What an idea to teach locals painting after their great history of art... However, nice to have initiated and built this place in all its tranquil beauty. You forget about colonial patriarchial habits, however, they dont let you forget after all."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Best museum in Ubud. During my stay in Ubud I visited four museums. I liked Museum Puri Lukisan the most. Different kinds of art are shown in four buildings. The painting 'Ubud market' took most of my time, it's beautiful. Also there are many (wooden) sculptures. The entrance fee is relatively high, but it's worth it (you also get a 'free' drink when you bought a ticket)."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "Several Buildings and Beautiful Grounds. This museum is on the main road in Ubud close to the center. The first building had the most artwork I was interested in viewing and it had a number of photos as well. Really worth the time!"
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Hurry is a fault. Not far from Ubud palace, you can find the museum with five buildings that exhibits traditional as well as contemporary artworks. As compare with her counterpart Neka museum, she has a rich collection of paintings, most of them are chiefly related with Baliese mythology and Hindu legend. Pay more attention to Walter Spies, Rudolf Bonnet, Tjokorda Gde Agung Sukawati and I Gusti Nyoman Lempad's paintings, especially the latter two Indonesian painters. It is worthwhile to see, the essence of her collection and her garden not in a hurry,for at least two more hours , Besides, you can enjoy a free drink in her restaurant at the entrance after your tour."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Worth a look. Amazing selection of contemporary and traditional art depicting life and their connection with Hindu legend."
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Good collection. Good collection of art depiciting balinese mythology , tradition & culture. with a garden in the midst. No A/c in museum - it was hot and uncomfortable."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "A Place Not to Be Missed. An excellent place to visit when in Ubud where you can learn about the culture and the history of the area.Allow plenty of time because is a big place and lots of exhibitsor do it in two lots."
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "Stunning. Fantastic collection of modern and traditional Balinese painting in a stunning setting. Well curated with explanations in English."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Heritage Balinese art. We visited the museum and it was a very good experience, special because you have the opportunity to see amazing art work. Wonderful carvings and the Paints were just a master piece."
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Balinese art treasures and tranquil gardens. A cafe provides refreshing drinks between meanderings [there are 4 separate bldgs and little a/c]. Like most museums in busy cities, it is a refuge as well as a feast for the eye. An easy way to absorb traditional art in Bali.Go for the afternoon tea and escape the oppression of hottest heat in the city."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "Island of Culture. Yes, a good collection of traditional painting and carving and a stark contrast to the noisy, crass, traffic dominated pseudo art outside the front door. Sad to consider how much has been lost in the last 70 years or so. So stop in and look. Then get in your car and go elsewhere. The rest of central Ubud is oppressive and debased."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Tranquil and Beautiful Space. Stroll through the lovely gardens and enjoy the many examples of traditional and modern Balinese art at this wonderful museum in central Ubud. Our admission came with afternoon tea at the very nice outdoor restaurant."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "outstanding museum collection in four buildings downtown. This museum collection is extensive, and will need more than a casual visit to appreciate. The gardens are stunning as well, and I was enchanted by the entire experience. The staff serve complementary coffee or tea as a refresher, and I found the depth of the art collection to be enlightening and educational. DON'T MISS THIS PLACE, right downtown."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Traditional Balinese Art. Paintings in the old style with good descriptions, sculptures, woodwork. Great restaurant and the grounds are well kept."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Enjoyable art collection in beautiful grounds. There are four separate buildings housing 20th century and contemporary Balinese artwork. Most are not air conditioned, so we repeatedly visited the cafe on the grounds for a cold drink between buildings. The collection includes some beautiful pieces and does an excellent job of showing how the arrival of European artists and visitors in the early 20th century affected the local art scene."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Wood-carving classes - highly recommended!. Our two boys aged 12 & 16 spent a whole day here doing a wood-carving class. They each produced a square block carving of the sort used to decorate around temple doors; one with an elephant and the other with a deer. The tutor was endlessly patient with them and the end result is simply stunning! Many of the wood carving classes available in Ubud are a 3-4 hour affair and we were advised that you really needed a full day to produce something worth taking home. It cost Rp520,000 per person which included all materials, 7 hours of tuition, morning and afternoon tea and a huge,sumptuous lunch. The classes are only done with very small groups (actually our boys had the tutor to themselves!) and I felt it was well worth paying the extra money for them to go the extra mile. Elsewhere you can do a wood carving class in Ubud for US$20-30 but having seen the simple end results made in these classes I would definitely recommend this one. Not suitable for very young children or any young people with a limited concentration span, but perfect for ours or for adults who want to bring home something special from their Bali trip."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Beautiful grounds and four galleries of Balinese art and wood carvings. . A fine collection is Balinese paintings and wood carvings in four galleries set in beautiful gardens. The venue also has a restaurant for drinks or a meal. Plan on two hours for this tour."
        }, 
        {
            "index": 57, 
            "rating": "5", 
            "review": "Amazing art. Well worth a visit - the art is absolutely stunning, and often there's text to explain the piece, on the wall beside the art. Nice afternoon tea is included in your entry fee. Very reasonably priced."
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "spent the day making my own shadow puppet.. I didn't get a chance to explore the three galleries here this time (the last time I was here was some 18 years ago!) this time I booked in for a puppet making course which went for 7 hours - including an hour lunch break with a tasty meal at the cafe. I was guided through the process of creating a leather shadow puppet which was interesting and enjoyable chatting to the young puppet maker who had begun making puppets aged 10. The grounds are gorgeous and it was a lovely way to spend a day, although with a dodgey back sitting cross legged on a Pavillon at a low table was a tad uncomfortable (a bit painful really ) but worth it!"
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Interesting view on Balinese art. If you're mildly interested in art and curious to see what Balinese art looks like then definitely pay the Puri Lukisan museum a visit. The temporary exhibition had some really great paintings, of which many were available for purchase albeit a little pricey. The entrance ticket is a little bit steep but you get a free drink with it. The museum is on Raya Ubud and easy to find. The only downside is that it can get a bit hot inside since they only have fans."
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "Easy to get through. It's a nice place. Even if you don't fall in love with Balinese pre and post war culture, you can easily walk through the 4 small rooms and get a snapshot at least of Balinese culture."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Interesting Cultural Spot. Went here 2 personFounded by Tjokorda Agung and 2 others (foreigners who fell in love with Bali The Island Of God)Lots of well kept collection, some of them were gift and donations from other countryYou can see Tjok handwriting in this museum, his life history along with his photographAlso you can see several letters from influential people such as JFK to Tjokorda Agung whom also certified as PHD from Holland if I am not mistakenEntrance fee was Rp 85k per person. Parking for car was Rp 2 to 5k. Entrance fee is including welcome drink for every each personThey also have restaurant, exhibition hall and art class: gamelan music class, flute and also dancing classThe parking security usually a bit cautious since some people used their parking spot without entering the museumCheers..."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Great museum. Spent a wonderful morning here looking at all the art. Well displayed and also have staff that will walk around with you explaining the exhibitions to you."
        }, 
        {
            "index": 63, 
            "rating": "3", 
            "review": "Dull artwork but great cultural lessons. The majority of the artwork is pre and post war balinese work. Alot of the work is very similar and is spread across 4 buildings which make up the entire museum, their is very little variation in style, it honstly isn't worth going. If you decide to go, make sure you get your drink at the cafe which is included in the ticket price. Despite NOT recommending the museum they do run various classes, Balinese flute lesson, shadow puppet making, balinese dance lessons etc. These have to be book at least a day in advance but are totally worth it, and the classes are always individual or really small. They range from $15-70AUD depending on if it is a 1hour or 7 hour class."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Great selection of Balinese art. Beautiful gardens at the hotel and good few different galleries with Balinese art.Good restaurant to have a lunch.Admission could be cheaper."
        }, 
        {
            "index": 65, 
            "rating": "3", 
            "review": "A small collection at a big price. This gallery claims to be a historical landmark and the biggest and most impressive collection in Ubud. But the artwork was poorly displayed, and without much information about the artists and their cultural history.I am usually more than happy to pay to view artwork, but at $8AUD per person, this was probably not worth the visit."
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Great Art and Helpful Staff. A great way to spend a couple of hours, with some unique art and carvings to admire. Taking your time here is a must as art work is very intricate."
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Balinese art. Set in gardens, traditional balinese art through ages.Surprise is with your ticket you get a choice of drink and a delightful plate of sweet appetisers!"
        }, 
        {
            "index": 68, 
            "rating": "3", 
            "review": "Good for traditional, but ARMA is way better. Needs dusting!. All of the four houses have mostly traditional balineise religious paintings and tapestrys. Gets a bit old (which they are) and lacks depth and contrasts which I loved in many of the paintings in ARMA. I got allergic reactions from the dust in all the rooms, besides the one which switches exhibits (Guess it gets cleaned frequently). The fans just throws it around in the air."
        }, 
        {
            "index": 69, 
            "rating": "3", 
            "review": "Ubud art. A very good museum to have a look at the different types of art during the years. Interesting and good selection."
        }, 
        {
            "index": 70, 
            "rating": "3", 
            "review": "Too Much Same Same. Don't get me wrong. The garden and grounds are lovely and peaceful and there are many very beautiful works of art here. But unless you have a special interest in Hindu/Balinese mythology, in which case you will be a pig in mud, the collection becomes quite monotonous. A few have interesting English translations, but most do not. After a while it is like looking at the same thing over and over again. And unfortunately there is only one underlying style. Oh, I'm sure that each artist has their own, but I am not trained enough to appreciate it. Nearly all the paintings, and even sculptures, are extremely busy. There is so much going on. One could look at each picture for twenty minutes. I just got overwhelmed. On a practical basis, some of the rooms have no windows, dim lights (spend some money on LED) and faded paintings. My old eyes were not up to the task. The entry is rather steep at 85,000R, comparable to some European museums with much more extensive collections. The place was nearly empty. Many young travelers come to Ubud, and they are not able or willing to pay this much. Put the entry down to 50K and you will increase attendance enough to improve receipts. The entry includes tea in the restaurant, but they only have plain black tea or coffee, no herbal tea or even green tea. They can do better."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "Very interesting museum. Usually I walk quickly through a museum, but this one kept me for 2 hours. I was fascinated by the pictures, the art which Indonesia has to offer. I stood in front of some paintings for a few minutes to see what the artist wanted to tell us and I am not really good in understanding art usually. This museum showed me that art can be different, fun and interesting."
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "Lots of Art. Big space with several buildings full of Indonesian art. If you're interested in that type of thing I would go!"
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Excellent range of balinese art with relaxing grounds. This is somewhat hidden off the street but well worth a visit if you want to see classic balinese art. Nice range of art with classic to more modern styles. Also stop in the grounds and enjoy a cold drink with a nice fountain and some shade."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Balinese art at its best!. A great museum, not particularly cheap at 85,000 but it's definitely worth it and comes with a free drink at the cafe (where they weren't pushy at all about us ordering food- which did look really good). The only museum we visited but we felt it was all we needed to appreciate both old and modern Balinese art."
        }, 
        {
            "index": 75, 
            "rating": "3", 
            "review": "Just Art. I found the newer paintings more interesting than the older ones. I guess you need to know more about the old paintings to appreciate them. There was a lot of detail in the new paintings that were located in the left hand side building and most were for sale, but at high prices that you would expect. None of the buildings are air conditioned, at best are a few fans scattered round. The gardens have been nicely looked after. This museum is just for those who are interested in the Balinese art."
        }, 
        {
            "index": 76, 
            "rating": "3", 
            "review": "For art lovers. Rp.85k entrance fee. You have to be a Balinese art lover to really enjoy this museum. The best part for me was the new art rather than the old stuff. The grounds of the museum are good and deserve a walk round."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "A Balinese Delight.. I always visit the Museum Puri Lukisan for its great art collection of traditional Balinese art. It is set just off Jalan Raya Ubud where the car park is huge but in need of a bit of repair. But the tranquil surrounds make up for that. The galleries are set back into the hill but the walk and incline are moderate. The grounds are so relaxing. I have bought brunch and lunch at the restaurant/cafe. The drinks are always chilled and the staff are divine."
        }, 
        {
            "index": 78, 
            "rating": "3", 
            "review": "Interesting - where is everybody?. There are 4 separate buildings containing paintings and carvings to view. I really enjoyed the carvings done from the jack fruit tree - really intricate. We were there for an hour and only saw a maximum of 6 other tourists. Guess they don't know what they are missing."
        }, 
        {
            "index": 79, 
            "rating": "4", 
            "review": "not the best museum in town. There are few interesting works, its better to visit one of the 3 most important musea. There is also a temporary exhibition but it are only some works to sell"
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "Great Art Exhibition . It is a very nice and peaceful museum. There are some nice artistic landscaped gardens and pond. It displays some good nice Balinese art paintings and few artworks. It is like an art painting exhibitions/gallery, well presented and explained. Definitely worth visiting..Love it!!"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Great painting course. Love this museum, it has some interesting art and it is also has pretty garden and little restaurant. This time we took a traditional painting course, a lot of fun. A snack and lunch was included in the price, and we left with a painting each and a good sense of achievement. They offer other courses too."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Good representation. A nice collection of modern Balinese paintings. The architecture is splendid. Not exactly wheelchair friendly. Not sure if they rotate the exhibits."
        }, 
        {
            "index": 83, 
            "rating": "4", 
            "review": "Well set out display of mostly modern Balinese art. A nice collection of art from 1800 to present day set out over four buildings. Lovely grounds to wander through."
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "Beautiful paintings . Beautiful 4 buildings with collection of paintings situated in rice paddy field kind of setting. When Yiu roam around Bali Yiu realise the inspiration of the paintings is the Bali landscapes and the rich culture here. The level of detailing by artists is mind boggling. If you have taste for art, this is must visit."
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "Artistic Museum. Artistic museum in the middle of ubud town. Many good art work and paintings to see. Glad to see good maintenance and well organizing of many art work made by famous painters."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Wonderful shadow puppet workshop!. Took a shadow puppet making workshop! Wonderful!\nMy teacher was kind, patient and very informative. She gave just the right amount of assistance and guidance. A delicious lunch was included as well."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Stunning museum in the heart of Ubud. The Puri Lukisan Museum was originally founded in 1936 as the Pitamaha Artist Cooperative by Tjokorda Gde Agung Sukawati (the King of Ubud) and Tjokorda Gde Raka Sukawati (the King’s brother) along with two western artists working in Bali at the time: Walter Spies and Rudolf Bonnet. Its mission was to preserve and develop traditional Balinese art. It is now the oldest art museum in Bali, specialising in modern traditional Balinese paintings and wood carvings, spanning from the pre-Independence war (1930–1945) to the post-Independence war (1945 – present) era. The collection includes important examples of all of the artistic styles in Bali including the Sanur, Batuan, Ubud, Young Artist and Keliki schools. Beautifully situated in resplendent gardens."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Interesting view of art in Ubud through the ages. Lots of different paintings to look at in different buildings with a great explanation of history, we went on the one day (I think Tuesday) a visiting artist that specializes in drawing on palm leafs was in, he gave us a great history lesson on the art form and his artwork. Was interesting and would appeal to people who love art, we got bored after a while as it was a bit repetitive but the visiting artist and one of the buildings full of art for sale were worth the visit."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "Great art in a great setting. Four galleries of beautiful Balinese painting, organized by style and period. Resplendent garden and lawn."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Must SEE. If you really want to sink into the culture of this place, this museum in particular should not be missed, the variety of the pieces is such, that there is no way you can get bored, each picture is more exiting, intriguing and colorful than the one before, the level of creativity here is vast."
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Museum and garden not to be missed. Great place to see old and new paintings of Indonesian artists. Very moving history of its founders. Beautiful garden and good souvenir shop"
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "The whole place is a lovely garden too. Take your time , and enjoy this museum while the garden is also interesting .If you have luck , like we had , a gamelan groups plays and had thier training too on that place ."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Great artwork. Great place to view classic Balinese artwork. I really enjoyed seeing the variety of paints here. I recommend for any who has loved Balinese art."
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Museum artworks. Definitely worth a visit. The 4 different buildings, containing art works from different ages. Lovely settings and gardens surrounding buildings. If you are a lover of artworks it's a must see.\nI particularly loved the last building containing the really aged pieces. Big concern was these pieces should have been preserved behind glass."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Recommended. It is a great escape from the chaos of the Ubud main street. They have lovely garden and several beautiful buildings. There is a lot of mostly Hindu art. Our ticket price included a dessert and coffee at the cafe. I don't how they make money considering the ticket price was so cheap to begin with."
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Nice and quiet museum!. Very nice and quiet museum, a lot of local paintings and works of art worth to see. 4 pavilions with a small park & pond in the middle, doesn't take too long to visit completely."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "PuriLukisan Temple. Easily the most serene temple we visited in Bali. Spend some time here. You will need a driver to find this. Easy to get to from Jatiluwhi."
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "Beautiful museum, excellent collection of Balinese art. Excellent introduction into Balinese fine arts, beautiful and quite comprehensive collection of paintings and sculpture. Lots of unique pieces old and new, very well curated, English explanations and labels for everything. The museum has 4 buildings each housing a different period, you can see everything in 1 hour or if you like to take it more slowly 2 hours would be ideal. Gorgeous grounds as well, very calm and atmospheric."
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "If you are interested in Balinese art, this museum is a must!. Puri Lukisan Museum, centrally located on the main street is definitely worth a visit for broad look at a fine collection of traditional and modern pieces of art including painting, sculpture, and architecture. To enhance one's knowledge and pleasure there is very good and interesting signage. The museum also includes i a delightful garden with lotus pond which includes a landmark sculpture which arises from tree roots. It is definitely worth a visit for an hour or two while strolling down Jalan Raya."
        }, 
        {
            "index": 100, 
            "rating": "2", 
            "review": "Not much to see. There's really not much to see in this museum. Just several buildings with paintings hanging on the walls. I wouldn't recommend this if you're not a fan of Balinese arts.It is not expensive though."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "a peaceful respite from busy Ubud. a lovely peaceful museum with beautiful grounds where you can escape the bustle of Ubud and gain an appreciation of real Balinese art"
        }, 
        {
            "index": 102, 
            "rating": "4", 
            "review": "Nice art pieces. This museum displays some nice balinese paintings and has a beautifully landscaped garden. A must visit."
        }, 
        {
            "index": 103, 
            "rating": "3", 
            "review": "Not really a museum, more an exhibition of paintings.. I'd read some of the comments, so knew what to expect. The museum is spread over 4 buildings, all with different eras.Don't expect centuries old paintings, the oldest are around 1910-1920. Having said that, they are some very interesting pieces, both paintings and wood sculptures. The modern section was totally uninteresting for me, looks more like a Year 12 art exhibition. Some of the old paintings on wood are in poor conditions which is rather sad.i did like the stories about Rudolf Bonnet and Walter Spies and the link with the then king of Ubud, very interesting section."
        }, 
        {
            "index": 104, 
            "rating": "4", 
            "review": "Very interesting. I found the stories behind the paintings fascinating and the painting that intrigued me the most was \"Just Punishments in Hell'. Definitely worth walking through."
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "A really nice museum!. This museum are located in the center of Ubud. Though we need to pay quite expensive to make a visit (50-75k rupiahs/person) but found out the museum and the collections were well-maintained. No regrets! If you like to enjoy paintings, this museum is a must visit in Ubud."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Come for the museum, come back for a workshop. The beautiful gardens and buildings are a great setting for some fantastic art. Paintings start from 500 year old traditional to modern works. Buy a ticket and come back another day for a hands-on workshop. I scored a one-to-one class with a very patient teacher, and left with a teak panel showing the signs of what could amount to wood carving one day. Challenging, demanding and fun."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Traditional Art. Loved seeing all the gallerys. I enjoyed the traditional art work most. Great grounds, pleasant afternoon."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Highly recommended museum. This museum traces Balinese art from traditional to contemporary. Well presented and explained, the art is located in four cool galleries. Very centrally located in Ubud, it provides a quiet getaway from the traffic and market hustle."
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "Nice for a dander. Good selection of local and expat works for an overview of Balinese art. They sometimes have good exhibitions"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Best Museum in Ubud. Use this to help you put Balinese Ubud style art in context. We liked the grounds and each of the four buildings."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "wonderfull. the whole collection was authentic.Real good artists who made those things.\nthere should be an demonstration of making batik but sad enough there was nobody to show that."
        }, 
        {
            "index": 112, 
            "rating": "3", 
            "review": "Balinese Art Museum. The setting for the museum itself is nice, but the exhibits are underwhelming. Mostly paintings and photos but doesn't include alot of explanation as to the significance. If you're into Balinese art or paintings in general then you'll enjoy the exhibits within the four separate museum exhibit halls. Not a good stop for small kids, they'll be bored to tears. The admission price includes tea/soft drink at the museum cafe. Bathrooms are available on site as well. A nice, relaxed setting, but not much in the way of interesting exhibits."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Excellent old and new balinese art.. If You come to Bali and see all shops with stone and woodcarvings and paintings at the markeds and shops and along the streets...some is amazing at first sight. If you visit the studios and workshops behind the artists its even more original and better. The museum will blow your mind with art of high class . Present and the past. Bali has a unique art tradition and some of the present artist are working i groups like Lempoyang art community(founded 1985). The community is very social and combine art with the local spirit and heart and perform in local community and village. See Kommunitas Lempoyang on Facebook. They have strong representation in a present exibition in the museum, Ketut Jaya and Made Buddhiana. Go go go."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Visit this museum first. We have visited all the major Balinese art museums in Ubud and this by far is high up there on our list and not to be missed. Their explanations regarding the various schools of Balinese art are extremely well done and the the art is well displayed. The gardens are magnificent and it is lovely to sit in their restaurant and enjoy a free cool drink after viewing the beautiful art."
        }, 
        {
            "index": 115, 
            "rating": "2", 
            "review": "Underwhelming. Visited with 3 friends as part of our trip to ubud, as it was well recommended on tripadvisor and te lonely planet. Our group enjoys some culture but none are major art fanatics. We didn't find the art particularly engaging, so wouldn't recommend unless you are into this style of art. We also thought it was quite expensive - 60k for an adult, and only took about an hour and a half to go round"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "Excellent overview of Balinese art in a beautiful setting. Once you enter, you will note the beautiful setting for the museum buildings, the gardens are not large but beautifully laid out and there is a lovely area for tea or refreshments or meals.However, the contents of the museum buildings are very impressive, showing the development of Balinese art over the centuries. A lovely place to spend an afternoon...."
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "Very nice. very good locations attract more people to see. Inside are geogeus. A lot of collections from old old old year.... something you will never seen out side. Good to reccomend this.."
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "Must see!. The museum grounds was calming. I walked from Blanco Museum to the center and was humid. As soon as I entered the grounds I felt relaxed. I love visiting art galleries and museums and this one tells about the history of the art scene in Bali. I was particularly taken by Walter Spies' story and planning to read his autobiography."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "A great place to visit for Balinese arts. A visit to Ubud, Bali must include this museum which showcases Balinese arts history and paintings. The garden within the museum compound is delightful. The entrance fee includes refreshment at the cafeteria."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Bali's art community. Learn how Ubud's art community was organized and see a wonderful timeline of its evolution. The grounds offer a beautiful garden, lily pond with artwork throughout. Look for the hidden lady in the banyan trees."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "A must see. A place to recharge and see amazing art and learn about the history of Ubud and art. Beautiful gardens right in the heart of Ubud. I am inspired to learn more about the art scene and history of Ubud after this visit."
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "An overview of balinese art. You can see examples of ancient paintings ( some a few centuries old ) and the evolution towards contemporary paintings , also the complex is an oasis of peace ,with beautiful gardens , and a nice restaurant , you can actually buy a joined ticket including a meal at the restaurant , for about 30 000 additional rupees"
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "colorful culture. A must if you are traveling to Ubud. The grounds are beautiful, as well as the art. Afternoon tea is included in the admission fee, a nice touch."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Really enjoyed this museum! Get the lunch menu here!. We randomly stumbled upon this museum walking from Ubud Palace and the Saraswati Temple. It is a really nice museum, museum grounds are like a garden. The museum mainly houses what they call modern Indonesian art, which has a lot of almost psychedelic and spiritual painting mixed with Hindu stories. There is also, of course, depictions of the daily Balinese life. There are three halls and takes about 1-1.5 hours depending on how fast you take in the art. I enjoyed it all very much.And a nice surprise is the restaurant here. It was absolutely amazing, fresh, authentic and great value. For only $10-15, you can get appetizer, main, dessert and drink. We got caught in the rain here, but just ended up spending a few hours at the restaurant, taking it in. With the sound of the raindrops on the ceiling, overlooking the beautiful garden, and having the delicious food was one of my favorite experiences in Bali and one of my favorite experiences ever for a rainy day."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Excellent summary of the evolution of Balinese art. The museum is set in a beautiful garden and has 4 pavillons. It displays a comprehensive collection of Balinese art (painting and sculpture) spanning from the traditional to more contempary styles. Definetely worth seeing."
        }, 
        {
            "index": 126, 
            "rating": "3", 
            "review": "Ok to get a feel for Balinese art. This museum had 4 buildings, each with artwork from Bali. Only the first was air conditioned so be prepared to be very hot as you peruse the works (hotter inside even with the fans going than it was outside). A quick walk through is worth the effort but the heat does not encourage too much lingering."
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Beautiful Oasis in centre of town.. The first of four display houses you come to on your left is the most impressive - a mix of photography, sculpture and some striking paintings. Also gives you some historical context on the art scene in ubud. The gardens are strikingly beautiful in their own right."
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "One of the Oldest Art Museums in Ubud. I first visited it in 1987 on my very first visit and over the years they keep adding to their collection its worth a visit to see traditional Balinese art"
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "An oasis in the centre of touristy Ubud. Tucked away 500 metres from touristy Ubud is this oasis of calm.Beautiful grounds, Balinese art and your entrance Rp85k ticket also entitles you to a Balinese snack and ice drink at the cafe.A perfect respite from the hordes."
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "Lovely artwork, relaxing grounds. A beautiful museum which I found really easy to understand even though I am a complete art novice.Each Picture had an explanation in Bahasa and English. The grounds are also lovely, and there were people playing beautiful music. The 85,000 ticket gets you a free drink as well as your entry or we were offered a ticket for 115,000 RP which included a set lunch. Well worth it if you dig traditional art in tranquil settings"
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "A must visit in Ubud. Great museum located in a wonderful building in the art town. The painting exhibition is truly fascinating and The museum does a great job of sharing this emotionally charged story, along with fascinating supporting information and artistic."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "very beautiful. very nice art museum. Tickets were cheap and we received a little surprise at the end, a nice drink and complimentary dessert. It was a lovey afternoon."
        }, 
        {
            "index": 133, 
            "rating": "1", 
            "review": "This museum is expensive. This museum has an important collection of Balinese paintings,\nwe were interested to go and spend time looking at these, but\nthe entrance ticket cost 80.000 rph each, so we declined to go in."
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "Beautiful, tranquil setting - worth seeing for the grounds. It's worth visiting this museum just for the grounds - they are stunning and right in the middle of central Ubud. The collection didn't mean too much because we don't know that much about Balinese art."
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "Interesting but lacks diversity. This is a beautiful location...right in the centre of Ubud and easy to access. It is a expansive area of gardens and individual buildings housing different eras of Balinese/Indonesian and Western art....but we were a little disappointed that there were not more displays of Balinese photography and Balinese artifacts/woodcarvings. However, we enjoyed our visit and would recommend it to others."
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "Fascinating old and modern Balinese art. I enjoyed my visit to Puri Lukisan very much. They have a great variety of exhibited paintings, from old to modern ones, and at my time of visit some of the artists of the modern paintings were hanging around so you could have a chat with them about their work. The gardens are beautiful and after your walk through the 4 gallery buildings you can get complementary tea or coffee at the museum cafe."
        }, 
        {
            "index": 137, 
            "rating": "4", 
            "review": "Excellent museum. The museum is located in an amazing garden. Buy a ticket with the possibillity to take your time for the lunch with a drink in the restaurant"
        }, 
        {
            "index": 138, 
            "rating": "4", 
            "review": "Incomplete. Very good exhibition, however it is a painting gallery, most of them are history, a little bit more of explanation or onformation available regarding the culture will help."
        }, 
        {
            "index": 139, 
            "rating": "2", 
            "review": "confirmed for me that I'm not a fan of modern balinese art!. the setting of the museum is lovely, but I'd only go if you are really interested in modern balinese art. This said we saw a couple really enjoying a wood carving workshop they were doing there."
        }, 
        {
            "index": 140, 
            "rating": "4", 
            "review": "Excellent setting and art . Conveinently located right on the main road it is worth the $6 USD entry ticket which includes a drink. The selection of art and carvings and excellent and offer a nice range. The wood benches that are provides are amazing art pieces themselves. The grounds and the setting is absolutely amazingly beautiful. The lighting in buildings could use an upgrade allowing you to see the art better."
        }, 
        {
            "index": 141, 
            "rating": "2", 
            "review": "Not worth the entrance money - go to the Neko instead.. The buildings were pleasant bur the artwork is mainly of a religious theme which is hardly truly representative of Balinese art. Given the excellent variety of art museums around Ubud (Neko and Blanco for a start) the 75000Rp makes this place not good value for money. And everywhere there are donations boxes asking for money to help conserve the artwork - why is this place so expensive to run that it can't afford to conserve the very things that tourists are paying to see? This is in a prominent position in Ubud and I think would not offer any encouragement for tourists to see other museums if they go here first."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Evokes a bye gone era. Fabulous buildings in a very central location. The artwork was well presented and gave one a good cross section of 19 - 20th century Balinese art. The restaurant is excellent and the \"including meal\" option is well worth it. Lovely gardens"
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Great collection and very informative. The museum is spread across a few buildings in a beautifully landscaped area. Good way to learn about Balinese culture, art, and the influence of western artists. There were only a few others visiting the museum on the day we went, and that created a very calm environment, in contrast to Ubud! The museum is just steps away from central Ubud."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Art museum. The art works were so beautiful and created such an insight into Balinese culture. Unmissable! The letters from Sen Robert Kennedy and continued correspondence not to be missed."
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Great place to have lunch, take a class, and see art!. I stumbled upon this place because I was struck by the doors and wanted to see what was inside. So happy I did! I had lunch overlooking the terraces, (delicious, traditional and tasty!) then walked through the four buildings housing art. I was able to speak with a family taking a batik course and see what they made and I was very jealous I didn't take this class! Again, beautiful Balinese grounds! I think it's great to go enjoy and learn but also our support reinforces the importance of preservation! Definitely worth a visit!"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Lovely art gallery. nice art and people performing music etc. I got to play a musical instrument made out of bamboo. Lots of fun."
        }, 
        {
            "index": 147, 
            "rating": "5", 
            "review": "Lovely museum. Four buildings with a wonderful representation of modern and traditional Balinese art in a beautiful open garden. Selected works , so not overwhelming and as such was easy to tour with kids. Fish pond which was another child friendly feature of our visit. Peaceful and relaxing after a day of busy Ubud walking. Worth a stop!"
        }, 
        {
            "index": 148, 
            "rating": "5", 
            "review": "We enjoyed the visit. Beautiful setting and interesting exhibits. We were glad we took the time to visit this museum...it took us a couple of hours to peruse."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "View the past of Bali. I liked the setting and the loving selection of paintings - you won't easily find a better time warp collection."
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "Lucky lukisan ,. One of the very best museum in Ubud & the by far the most conveniently situated.Pay special attention to the Wayan style paintings the first room when enter and do note that many artistic activities are on there on a daily basis."
        }, 
        {
            "index": 151, 
            "rating": "4", 
            "review": "Interesting place. a real mix of different arts and craft with a bit of history thrown in . Go early in the day some gallery's are a bit hot. Complementary cuppa with the entry price is nice in beautiful garden setting"
        }, 
        {
            "index": 152, 
            "rating": "4", 
            "review": "Lovely grounds and cafe. The real assets of this art museum are its lovely grounds and cafe. It's a great escape from the hustle and bustle of the main road in Ubud - and you can hardly even hear the scooters! We enjoyed it so much that we had lunch at the cafe which is priced for tourists, but the food was really good and the service lovely - on the whole, definitely worth it to enjoy the peace and quiet a little longer!"
        }, 
        {
            "index": 153, 
            "rating": "3", 
            "review": "Go for the grounds. The setting of this museum is stunning, I was less taken with the artwork inside. It was a nice way to pass an hour or so in the rain. If you are pressed for time, you won't miss out by skipping this."
        }, 
        {
            "index": 154, 
            "rating": "4", 
            "review": "Nice Experience. Very lush and pretty grounds, excellent artwork, temple instruments on display and they offer classes too!"
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "Good collection of Balinese art. Well worth a visit, a quite comprehensive collection of Balinese art. Well presented and labeled, but some prior knowledge of Hindu/Balinese mythology (or a good guide) could make a visit even more rewarding. Nice cafe."
        }, 
        {
            "index": 156, 
            "rating": "5", 
            "review": "Grounds and art. The exhibition of art is interesting. The myth/legend behind the painting is given alongside the exhibit. You learn a lot about the culture through these explanations. Allow a good three hours to enjoy it fully."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Don't miss it. Very interesting and beautiful paintings and sculptures, a gorgeous garden too. You can also take some courses there, Batik and painting, which I would definitely recommend. I could spend a whole day there between the art, gardens,courses and reading a book in the cafe, but even a couple of hours is enough and worth while."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "great museum. This museum has beautiful grounds, the layout is stunning. The art is fantastic, we were somewhat focussed on Bonnet's paintings and although Bonnet has donated many paintings to the museum there were few on display made by himself, which was a pity."
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "Refuge from Town. Lovely little detour away from the bustling streets of Ubud, yet only steps away. We learned a bit about Indonesian (Balinese) art and enjoyed strolling around the cool garden. You can keep your ticket and return throughout the day to reclaim your calm."
        }, 
        {
            "index": 160, 
            "rating": "3", 
            "review": "Needs lighting. Interesting artwork, but like many indonesian museums needs some better curating and much better lighting. Flourescent bulbs hanging on ceiling just won't cut it. Grounds are beautiful, though. Nice, cool getaway"
        }, 
        {
            "index": 161, 
            "rating": "5", 
            "review": "Great Lay-Out And A Amazing Experience. we arrived at the museum on a busy day in Ubud with my 10 year old and we both loved it, the layout was great and artwork were unbelievable and historical, if you like art come to this museum"
        }, 
        {
            "index": 162, 
            "rating": "4", 
            "review": "Lovely grounds. My daughter and I went for a short visit and we enjoyed the sculpture and the balinese art. We only had about 30 minutes before we had to meet someone but we could have spent more time there. We only had time to visit 2 of the exhibits. We enjoyed the grounds as much as the art. The lady said we could return any time that day but in the end we never made it back."
        }, 
        {
            "index": 163, 
            "rating": "4", 
            "review": "Peace in the busy central Ubud. I went to this museum by accident. It is located in the middle of busy street of Ubud central and yet I skipped it for too many times. Peaceful. That is the first impression. A tranquil place with beautiful garden. It was rainy. I bet it'd be nice to sit in the garden to read or just sit.The collection is interesting. I particularly like the exhibition of Gusti Nyoman Lempad’s life and work. It provides a glimpse to Bali paintings that rarely known. They are like door to the culture and rich in stories.I spent one and half hour in this museum.If only I knew it earlier, I might sign up for one of their classes."
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "Heart of Art in Ubud. We visited the museum, there are 4 main halls in total and our entrance fee came with a free drink. It was a wet rainy day when we went but we enjoyed immersing ourselves in the local art culture. Beautiful pieces, well worth spending the afternoon getting lost in this museum."
        }, 
        {
            "index": 165, 
            "rating": "4", 
            "review": "This one's for the serious art fans. If you're seriously into art, you'll love this museum. The works displayed are each excellent examples of their genre, many by dead masters. Each part of the museum, which is chronologically arranged, warrants close study. However, it's hot. I'm surprised that the place doesn't run to air conditioning, if only to preserve the works which are mostly on bark or paper. The entrance fee of Rp75,000 includes water or a soft drink at the cafe, and you'll have earned by the time you get there."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Lovely place to spend the afternoon. We were expecting to have a quick look through the museum and move on, we left 3 hours later. The grounds are lovely and the art is very interesting. The entrance fee includes a hot or cold drink."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Nice atmosphere, great art. The art was beautiful and the grounds were too! We were only able to spend about an hour at the museum, but it was still great. And your ticket comes with a cup of iced tea! Nice touch in the heat."
        }, 
        {
            "index": 168, 
            "rating": "5", 
            "review": "Perfect for a bit of 'me' time. Loved the art and found the art museum informative as well. And I took the opportunity to enjoy a cake and drink (complementary) at the cafe in the most gorgeous setting as the galleries and cafe are built around a beautiful peaceful garden / lily pond. This was my 'time out' afternoon on a family trip and I enjoyed it thoroughly."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "Great introduction to Balinese art. This was our first gallery visited in Bali and a great introduction to Balinese art. It has an interesting history with European influences coming through. The galleries are located in nice gardens and although the museum is located next to the main road you feel miles away."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "loved it ..... Loved learning about the culture of the country through the artwork and fable telling... a great visit and we stayed and had lunch which was a surprising treat and what can i say about the dessert.... grilled banana dessert with palm sugar and grated cheese topping !!!!"
        }, 
        {
            "index": 171, 
            "rating": "4", 
            "review": "Great insight into Balinese art. Relaxing gardens with a couple of buildings which house the art collections. It is interesting to see the evolution of Balinese art and the influences brought by the colonial artists too. With our entrance ticket we had a complementary drink at the cafe which was nice."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "A must visit for art lovers. Best place to see a wide variety of Balinese and Indonesian painters. This is a must see place for anyone coming to Ubud with a few hours to spare as the collection is large."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Good museum of Balinese art from 1920's to present. The museum has several pavilions with a permanent collection and one with a changing collection. The gardens around it are nice and peaceful. A great way to spend one or two hours."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "Best museum in Ubud!. This place was mind blowing!\nThe organization of the collections truly represented Balinese art and its evolution.\nThe Lempad collection was my favorite. The adult only section offered a peak at Balinese sexuality.\nThe cafe was great. I wish I had not eaten beforehand but don't regret having the best pork ever around the corner at Ibu Oka.\nTotally recommend!"
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Exquisite art to understand Bali. Museum Puri Lukisan offers an exquisite collection that shows how artists in Bali have expanded from their traditional styles with a continuous innovation 'in dialogue' with developments in art elsewhere in the world."
        }, 
        {
            "index": 176, 
            "rating": "5", 
            "review": "Very nice Bali art collection in a nice setting. The place is beautiful and peaceful, you can enjoy the art collection on display at your own pace without hordes of visitors."
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Museum Puri Lukisan gardens deserve a mention too.. I have not tackled this museum before because the exhibit are spread around several buildings and there are quite a lot of steps of varying heights. Something I could not tackle previously. Very glad I went today, just to wander through the lovely old buildings look at paintings dating back some 600 years depicting stories from the 11th century. Very interesting to see these things so lovingly preserved. Art style in Bali have changed mightily and it is important that these old paintings and carving are kept for future generations. The gardens are lovely, and there is a museum cafe that is a great place to sit and look over them. There were also several different artisans demonstrating various craft skills which was also very interesting. The cost was 75,000 which is about AUD 7.50."
        }, 
        {
            "index": 178, 
            "rating": "5", 
            "review": "How lucky we were to see the Lembak exhibition. This museum was a highlight for me. I went back many times just to walk in the gardens and experience the serenity. How lucky we were to see the Lembak exhibition - this place, along with the palace, for me is the heart of Ubud."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Balinese Painting are Here. First, if you like Art, you must visit this museum. Why ? because in Here you can see a lot of Balinese Painting Which Is Extra Ordinary. Why i saying that ? because Before Antonio Blanco come here, Balinese paint their painting which is i think it's quite unique. Balinese paint there painting with same size of picture even thou the object is far or not. For example, there is a mahoni tree d and far away from it there is a Coconut Tree. They draw the trees with same size which is the truth of course the coconut tree must be draw smaller than Mahoni tree, but they draw it with same size. But after many international painters come, Balinese now Know how to draw their painting better. The museum itself is very beautiful, there is a beautiful park also in the area of museum. located in Ubud which is the weather is quite nice and a little bit windy. If you like art, don't miss this museum. It's really nice and lovely place for you."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "One of the most beautiful settings for an art museum. The grounds of this place were amazing! I really enjoyed the art as well. 4 different buildings house the art so you can walk the grounds in between and it's very peaceful. A great place to see traditional and contemporary Balinese art. Free tea at the end was a nice perk, and only $7 for entry."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Worth a visit. Very agreeable museum, composed of different buildings on a large property with a little pond. A great way to discover Balinese art. A free drink and snack is offered!"
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "Very good time investment. in the middle if Ubud you can find a very well developed as well as presented art gallery retreat. With partings by local artists as well as Bonnet and Spies, it is certainly worth the time."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "A must see!. Beautiful gardens and a chance to learn about Ubud history and culture as well as experience magnificent art in the gallery."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "A tour of Ubud's palaces. Worth a visit lovely gardens, interesting art galleries, small enough to not take up too much time or energy in the heat! complimentary drink with entrance ticket which was very welcome at end of visit. Live Music playing to enhance experience."
        }, 
        {
            "index": 185, 
            "rating": "3", 
            "review": "Balinese Modern Art. The problem is not the art itself. You may like it or not, but it's always part of the culture, so it's ok for me. What I didn't really like was the conservation of the paintings. They're pretty new, from the last century, and are very badly preserved. The condition of the rooms is not suitable at all. But the building is really beautiful, with a wonderful garden. The price is high, compared to anything else in Bali. The entrance fee is 75000."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Wonderful art Museum. beautiful art, art demonstrations on the day we were visiting - it was very interesting and beautiful gardens"
        }, 
        {
            "index": 187, 
            "rating": "4", 
            "review": "Colorful Compund. Colorful Tradition.. This museum is a part of a lovely compund. Lotus pond, cafe (didn't try), and multiple buildings with traditional Balinese art, carvings, and sculptures. Very picturesque. Even if looking at art isn't your cup of tea, the grounds make for great photos which you can take at total leisure. It's only 50,000rp. Not even $5, so it's not expensive, and worth a visit when in bustling ubud."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Lovely compound. A very nice walk around the grounds and a great look at Balinese art from around 1850 until today, most paintings have some description advising what you can see. A cup of tea at the care is included in the entry price."
        }, 
        {
            "index": 189, 
            "rating": "3", 
            "review": "Expensive. Expensive entry fee not justified. Traditional paintings are dark and fraught with symbols, require a little effort to understand, but good explanations are provided in English. We would have enjoyed more modern style paintings and sculptures."
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "Mostly traditional Balinese art. The garden setting is beautiful, and the various exhibits are well-displayed in the different buildings. As well as the traditional Balinese art featuring many a visual interpretation of Hindu lore, there are some amazingly old tapestries and some excellent carvings that would look great in my living room! If you don't feel like trekking very far from the very main tourist centre of town, this is the art museum for you."
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "Feast on the art but skip the meal. Our family of four visited the museum mid-morning, purchasing the tickets that included a meal, thinking that it would provide a good break for the kids between touring the various pavilions. That wasn't such a bad plan and may work for you, but the portions were small and not as filling as other warungs or restaurants we visited and so didn't tide the children over for the 'second half' as well as we had hoped. Presentation was excellent, though. My son marveled at the intricately carved watermelon garnish on his delicious watermelon juice, and both children devoured with their eyes and mouths the ornately displayed desserts. No surprise there.The art, housed in several buildings among peaceful gardens, is top notch (based on other museums we visited) and provides a good introduction (with some helpful explanation in English) to Balinese painting and wood carving, accompanied by the calming sounds of a single bamboo gamelan outside during our visit. As complete neophytes, we learned about the influence of Westerners such as Rudolf Bonnet and Walter Spies in the 1930s bringing Balinese painting into the modern era with the portrayal of scenes from daily life rather than religious themes and metaphors as before. We also saw why I Gusti Nyoman Lempad is so celebrated -- his finely detailed works are a cut above the rest -- along with Ida Bagus Made who seemed to be a renaissance man, creating art in all kinds of media.With a little effort, it is possible for the kids to get something out of the experience too. The grounds are great for wandering and provide a needed break between pavilions, but our 5 year old was captivated by the wood carvings and enjoyed identifying the various animals portrayed. He was pleased as punch when he later saw his proclaimed \"favorite carving\" prominently displayed on the cover of one of reference books in the small museum shop. Our eleven year old was interested in learning about the organic materials from which the traditional natural palate of Balinese colors are obtained and then trying to find the colors in the paintings, with yellow a challenge in the older paintings but white (made from crushed pig bones which was a gross-out in itself) still prominent. From the reviews, it seems that some people are evaluating the museum not on the quality of the works but on their views of the genres. For example, personally, I don't care much for the young artist school, but it is what it is. If you like the vibrancy and naivete, then you will enjoy the many examples housed in one of the pavilions. At the other extreme, the Batuan school paintings are dark but the detail is incredible. If you visit only one museum in Ubud, this should be it. A great overview and top-notch art.The museum also offers workshops in various cultural arts including gamelan, various types of painting, batik, woodcarving, shadow puppet carving, dance, offerings and more. The options overlap but Puri Lukisan seems to offer longer workshops and a greater variety of choices than those offered by the Pondok Pekak Library. On equivalent workshops offered by both, the library tends to be cheaper, and their shorter but much cheaper workshops on some arts might be more appropriate for children or those just wanting to get a taste for an hour instead of making a half day investment of their time, so if you are interested in workshops, check out both before deciding."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "What a gem!. The grounds are beautiful and I thought the art was incredibly interesting. The paintings portray Hindu and Muslim myths and are rendered with beautiful detail and colour. A feast for the eyes and the brain."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Art reveals much of Balinese life-view. Take even a surgery turn through the Lukisan museum and you get a good sense of traditional arts and the life view that is teeming with gods, barongs, rangdas, spirits. Mythological histories are retold again and again. Paintings are densely populated and stylistically similar; in Bali tradition is everything. Though perhaps not to your taste, the overview gives dimension to your visit to bring you to some measure of understanding of culture."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "Very interesting artwork in beautiful grounds. Great to see and understand Balinese art more, most pictures tell very interesting stories. Grounds are lovely, peaceful and well kept, free drink with your ticket too."
        }, 
        {
            "index": 195, 
            "rating": "5", 
            "review": "Beautiful Balinese Artwork. Spent a few hours here enjoying the balinese artwork. Highly recommended. The exhibit with the minature painting was especially enjoyable."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Good to see Balinese Art. This is a palace turned into a museum. The setting was really beautiful, as you walked from building to building you were walking through a calm and well taken care of yard/garden. It was really interesting to see Balinese art and I really enjoyed my time there. There is a cafe inside the museum as well. You can purchase a ticket that includes just a drink or a ticket that includes lunch."
        }, 
        {
            "index": 197, 
            "rating": "5", 
            "review": "Great place to visit for Balinese culture and art. Great place to visit if you wish to understand more about the Balinese culture. Art pieces were beautiful and most depict beliefs and stories of the Hinduism religion (which is very significant in Balinese culture). Be sure to allocate about 2 - 2.5 hours for the visit for a good understanding of the culture and other attractions and performances (eg. Kecak dance) will all make sense. Each ticket purchased comes with either a complimentary lunch or tea, which is a plus."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Peace and quiet in central Ubud. I knew little about Balinese art and this museum shows its development via a solid collection of paintings. The art is displayed in several buildings that surround a beautiful garden. Absolutely worth a visit."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "A lovely piece of serenity.... I love this museum for being so central in Ubud, so pleasant in ambience. We left the busy buzzling road behind us which is just a door step away. A complimentary entrance for children is a bonus, a hidden invitation for the unlikely coming younger age visitors. Their selection of paintings were mainly pre-war selections. They are not just a painting gallery, but more of a history of culture and are filled heavily with traditional believe and stories. Almost each piece presented a Hindu epic which is the soul of Balinese arts. It was so beautiful and engaging experience.The ground: an effortless piece of Ubud."
        }, 
        {
            "index": 200, 
            "rating": "4", 
            "review": "A bit of culture in the middle of Ubud. Take a visit when you are feeling a bit tired after trekking the streets of Central Ubud. The historical art works are fascinating, and teaches you a little about the history of Indonesia and Bali.The gardens are beautiful - take a leisurely stroll through and enjoy the calm surroundings"
        }, 
        {
            "index": 201, 
            "rating": "3", 
            "review": "Great collection of paintings. Gives you a snapshot in the art history of Bali and the developments throughout the years, especially paintings. The style was not our thing and not all of the paintings have explanations in English. But if you like art it is a place you must visit."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Amazing. It was like time travel experience. So many Balinese art masterpiece are here. Some of them are from 16th century. Some are so mystical. Great works from maestro. The display is quite informative. A must to visit in Ubud."
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "Great art display. The balinese art on display was fabulous - showed great history and also had some modern artists for sale - really enjoyed this museum."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Educational Experience. Through the paintings and sculptures, I got a pretty good idea of the history of Bali. The colors, the theme were exquisite! Loved the music from a simple wooden xylophone a gentleman played outside one of the halls. And the finishing touch, tea on the veranda. That was very classy. A wonderful afternoon experience to come in from the rain."
        }, 
        {
            "index": 205, 
            "rating": "4", 
            "review": "Great Overview of Balinese painting. It had a lot of very detailed paintings and drawings by some of Bali's talented artists such as Lempad - who was a great cartoonist as well, and very innovative for the time, as well as other artists, influenced by Walter Spies. Well laid out"
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "The best museum experience. The grounds were as much a part of the experience as the art itself. It was very refreshing to see traditional detailed paintings that had hidden satires painted in them. The museum spans a few buildings across the gardens. I could not believe the size of the koi fishes in their pools. OMG."
        }, 
        {
            "index": 207, 
            "rating": "3", 
            "review": "Lovely Palace garden and stone sculptures of Gods.. Disappointing as walk around gardens was very restricted because the Royal Family was still residing there. Also souvenit cards quite few to chose from."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Linda Vall loves painting. This museum is slap bang in the middle of Ubud and is great for a visit around a couple of hours to see it. The art works are typically\nBalinese, you will love them. There is a gallery with more recent\nArt which is for sale and very reasonably priced."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Great place for a Gamelan class. Taking a gamelan class was a priority for our family while visiting Bali. We had a great experience with our class at this museum. The instructor was so friendly and patient. He had an amazing smile, and really took time with us. They also brought us cake and a cold drink during our hour class. The class was private -- just for our family of four. They accomodated our schedule and fit us in when it was convenient for us. Afterwards, we wandered around the beautiful grounds and enjoyed seeing the art in all of the buildings. Make sure to confirm that with the price of your ticket you get a cup of coffee or tea in the nice cafe."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Beautiful museum capturing Bali's rich artistic cultural heritage. The Puri Lukisan Museum is a beautiful museum. It features three exhibits in different buildings. The museum contains mainly traditional style paintings that reflect the Balinese culture and worldview. The surroundings are very beautiful as well. I could spend all day here looking at paintings, having coffee with friends, and just walking along the beautiful museum grounds."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "Good to understand the development of Balinese paintings..... The museum is about 100 m from the market or the palace of King of Ubud. It has a spaciousparking lot, something rare in the vicinity of Ubud town center. The area has 4 buildngs for displaying Balinese paintings from different eras, most notably the era after 1930s where influences of western painters who lived in Bali at that time, are visible such as the use of colors, shading, materials and themes.There is also a Marketing 3.0 museum but it was closed during our visit.Some of the paintings probably need to be stored in some protecting enclosure. I was afraid of people, despite the signs, touching the surface of the paintings. I am also not sure about the humidity or sunshine controls. I personally like the traditional miniature paintings by artists from Keliki village. These were fine, detailed pictures of humans, animals, trees, gods, demons and so on with intricate layering of shading which makes the paintings appear to be in 3D. I actually need a magnifying glass to see some paintings as these were no more larger than A4 paper size.The area is so serene that you can use as a getaway or cooling down site after visiting the market or the Puri which tends to be crowded I the afternoon. The museum closes at 6 pm but the nearby cafe may still open until later."
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "Worth a visit. This art museum was worth a visit. It is conveniently located and easily able to be taken in over an hour or two. The grounds are also lovely. It gave a nice sense of the development of local art."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Cultural Awareness. This museum/art gallery provides exactly what the guidebooks say and that is the opportunity to see Balinese culture presented through some pretty amazing pieces of art and sculpture. If you any interest in other cultures then this stop is highly recommended during your central Bali tour. Check out the garden scultpure enveloped by the ficus tree and enjoy the peace and quiet while having your tea or coffee."
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "Good. I'd say Neka was much better, but it's conveniet and they also have a good collection of woodcarvings and have various classes. The painting class was very good indeed."
        }, 
        {
            "index": 215, 
            "rating": "2", 
            "review": "Overrated. I'm fairly interested in art and always try to visit local art museums whenever I'm traveling. However, I found this museum a bit boring. I felt like I was seeing the same painting over and over again and the whole thing took me under 20 minutes to get through. To be fair, I have no knowledge of Balinese art. Still, I have no idea why this place was so highly recommended in all the guide books. The service was quite good though."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "A delightful place. Such lovely grounds enhance any other experience you might want to pursue here. I visited on a week day a little before noon and purchased a combined ticket which included lunch.That was a good value as well as a relaxing way to dine simply. Plus it broke up the walking. Saw someone else was taking dance lessons. The exhibits themselves were quite good, but the museum and grounds were more than that. For example, a man was playing bamboo gamelan that you could hear as you walked around. \"Very Ubud\" would probably be a fair statement. This place was much to my liking."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "Wood carving Workshop - unique and awesome!. Today i made the Wood carving Workshop at the Museum for 450000 Rupiah! It Run from 10 to 5 o'clock, including Snack, Drink and a delicous lunch. The Money was spent well Though. I can definitely recommend the Workshop. It was a Lot of Fun and nice creative work with a good teacher ständig by your side."
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Hitory with culture. Here you go to the history making of UBUD culture. Old painting by old balinese masters depicting the life style of ubudians and the religious hirory of bali. You find pictures of furst europianns who created part of the recent culture of ubud by mixing with, teaching art and loving people of ubud."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Awesome, quick \"modern\" art museum. Really cool museum for a quick 1-2 hour view. That's about my limit for a museum, anyway. While billed as modern art, its not what I would normally think of, i.e., at no point did I think to myself \"gee, I could do that myself\". Its kind of modern interpretations of Balinese traditional art, with a standout for me Ida Bagus Made. The richness of the colors wasn't something you commonly see...the paint used in many paintings is (apparently) a concotion of earth, bone, and other ingredients.The grounds were relatively compact, and beautiful. Any landscape architects in particular would really appreciate them.Only suggestion would be to spruce up the gift should....poss. a big revenue source for museum, as I was looking to take a moment of the art for our own home."
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Best art I have ever seen. The art here makes you realise why Ubud is so famous worldwide for its art. The pictures here tell a story really well and you get sucked into all the intricate designs within them. Definitely worth a visit."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Museum with a Mission. Unub is the heart of Balinese art. A joint effort by the Ubud princely family and a Dutch artist over was made to preserve and promote traditional art. Over a few decades, despite war, occupation, revolution, deposition, and at least one apathetic philistine in a position to throw a spanner in the works, Puri Lukisan--the Palace of Painting--was created to celebrate the incredible traditional arts of Bali. A wide range of painting techniques is employed, from painting on paper and canvas to painting on cloth, and sculpture. Many of the works are \"busy\" in the sense that Dutch and Italian cityscapes are busy: the painting are packed full of incredible detail so the longer you look at one the more you see. Wonderful stuff, and a tribute to both the visionary and persistent men who created the museum, and the artists whose works are displayed in the galleries. I am attaching a few examples of the art here.Side notes; (1) through June 28, there is a special exhibit of the works of the Keliki miniaturists. Miniaturists suggests postcard sized paintings, but here really refers to the small scale of the paintings, the better to pack more details in. Keliki is a small village near Ubud with a very high percentage of local artists: about 20% of the villagers are artists with the techniques being handed down from father to son. (2) for folks staying in the southern beach resorts, note that the convenient Nura Nura bus system does run busses up to Ubud, for 70 K each way. I've been on that road half a dozen times, and the run can take two hours due to traffic. An air-conditioned small bus is a great way to get up to Ubud, even if the promised wifi doesn't work, and the bus's second stop is right at this museum."
        }, 
        {
            "index": 222, 
            "rating": "4", 
            "review": "Nice setting in Central Ubud.. Nice museum in Central Ubud showcasing different schools of Balinese arts. When I visited they were showing how traditional weaving and wood carving is done, which was really impressive. But at the end of the day, the attraction is the art on display. "
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "Loved it. Beautiful Art Gallery. Amazing collections. Great to do on a rainy day. Admission price includes Tea/Coffee and 2 delicious cakes. Highly recommend!"
        }, 
        {
            "index": 224, 
            "rating": "4", 
            "review": "Well worth a visit. Gorgeous grounds with gorgeous art. Spent approx. 3.5 hours here, though that was with a leisurely meal at the onsite restaurant. Without the meal can be done in less than 3 hours, even with lingering over the displays. Detailed descriptions of displays, including sequences of religious painting depicting several important religious tales. Also has a traditional musician playing outside one of the buildings, which added to the ambiance."
        }, 
        {
            "index": 225, 
            "rating": "4", 
            "review": "Beautiful museum in garden layout. Wanting to experience and explore some of the culture of Ubud we headed into the museum to spend the morning. Had an amazing couple of hours getting up close and admiring the traditional artworks and paintings of this extensive Balinese collections across the various ages (each is in it's own separate building). The entrance fee of 75,000 included an afternoon refreshment. Well worth a visit while in Ubud even if to just relax and enjoy the peaceful gardens away from the hustle and bustle of the streets."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Beautiful!. This museum is amazing. The layout in the garden resembles the famous Balinese rice patties. There are three main buildings w art work featured. Every staff member was jovial and welcoming you inside to see the art work. Your entry fee (75,000 rupiah) includes a complimentary beverage at the small cafe. I ordered a sprite (well an extra given one was free) and the mushroom soup w blue cheese; delicious!! A really great intro to Balinese culture and Hindu faith. A short walk from my bungalow making it impossible to miss!!"
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "Museum, art and more, central Ubud. We had walked past this place over the years thinking it was a temple. In fact it has spacious tiered gardens and an extensive collection of Balinese art from the 16th century till today. You will see donated works from Rudolph Bonnett and Walter spies, both instrumental in bringing Balinese art to a wider audience and in introducing Balinese artists to new mediums and styles. It's the oldest art museum in Ubud. It's quite extensive so we paused after an hour to have an iced tea and cake/dessert at the cafe. All included in the entrance fee of $7.50AU each. The history of the museum is also very interesting and features Tjokorda Gde Raka Sukawati, a contemporary of spies and Bonnett, and Ubud royal. Charismatic and engaging of world leaders and adventurous tourists in the 50's and beyond.A good way to while away a few hours in the cultural heart of Bali"
        }, 
        {
            "index": 228, 
            "rating": "4", 
            "review": "Jaw dropping detail in art. Every artwork in they museum begs for at least 10-20 minutes, just to get a complete understanding of the art. I must say that I was tempted to pick up one or two. The prices were also reasonable. The best work in wood that caught my eye was an entwined Rama and Sita . The piece of wood's normal curvature and dents were taken into account and beautifully woven into the embraced couple. There is also a huge ficus tree with extensive roots that grab your attention. Do take out at least an hour to spend in this museum."
        }, 
        {
            "index": 229, 
            "rating": "4", 
            "review": "Balinese Art in a Tropical Setting. One of the best reasons to visit this museum is the grounds which are well-kept and includes a small open-air cafe. The art inside the museum is comprised mainly of paintings of local people and traditional culture with incredible detail that can keep you occupied for at least an hour or two."
        }, 
        {
            "index": 230, 
            "rating": "3", 
            "review": "Good museum. We went in with the mindset of traditional historical artefacts but this museum is more about art in bali over the past 100 or so years. So much more recent than expected but still good. Some of the art was quite graphic so be aware if you are taking children. While we were in ubud there was a royal wedding on so got to watch some of the local women getting their hair prepared at this site."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "peaceful and thought provoking. set in lovely gardens showcasing Indonesian art, it was great to see it all, especially enjoyed pictures from the past of village life in Bali"
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "Bukan hanya lukisan, tapi juga tentang Marketing 3.0!. Museum ini cukup menarik utk yang suka karya lukisan tradisional Bali. Museum terbagi menjadi beberapa gedung terpisah yang menyimpan berbagai koleksi lukisan, pahatan, serta batik berisi berbagai cerita/legenda dan sejarah rakyat Bali. Selain itu, ada juga bagian tersendiri yang berisi koleksi pribadi yang menceritakan sejarah Puri Ubud. Dan jika berkunjung ke museum ini, jangan lupa mampir ke Museum Marketing 3.0 (oleh Hermawan Kartajaya) yang juga ada dalam 1 area dan dapat dikunjungi secara gratis. Setelah puas melihat-lihat koleksi museum, lanjutkan dengan menikmati kolam teratai di halaman museum lalu rehat sejenak ditemani kopi & cake di cafetaria (Special note: walaupun free dgn menukarkan tiket masuk museum, kopi & cake di cafe ini seriously recommended! :)). P.S: Per Desember 2013, tiket masuk Puri Lukisan adalah IDR 75.000, sudah termasuk complimentary drink & snack di cafetaria dan juga kunjungan ke Museum of Marketing 3.0 di area yang sama."
        }, 
        {
            "index": 233, 
            "rating": "5", 
            "review": "Art, History, Culture and Artist. This museum is an insight into richness if Balinese art, artists and their work. Landscape is beautiful and amazing atmosphere."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Lovely place. Historical art. Manageable size. Gorgeous grounds. Sweet tea house. Easy walking distance from center of Ubud. Great way to spend a morning. Learn something about Balinese art from the past."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "The House of Bali's Masterpieces Art. This museum is wonderful. If you're in to arts, here's the place you MUST visit. in this museum you'll find the finest Bali's painting work. This museum is also an ICON of UBUD."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Extraordinary museum for the best of Bali's painting and more. I've been going to Bali for the past 40 years and have known this museum from when it was just one building. Now with four exhibition spaces, three for the permanent collection and one for temporary shows, the Puri Lukisan has become the best programmed and most interesting museum in Bali. Visitors to Bali interested in art should come here early in their visit as all the arts of Bali will be more accessible after you've seen the best work of the past 100 years here.And, by the way, the museum cafe is one of the best (and quietest) restaurants in Ubud for lunch or dinner. An excellent kitchen, generous servings well presented, reasonably priced, overlooking a palace garden and lotus pond. It's open all day, so it's a good place to break a museum visit with a snack and a drink."
        }, 
        {
            "index": 237, 
            "rating": "4", 
            "review": "small and informative. This is a lovely little museum on the main road in Ubud, so it's easy to walk to (and nice to get some quiet!). It includes a variety of etchings, paintings, carvings, and tapestries that show a fundamental history of the area."
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "Interesting Balinese Paintwork !!. The Museum Puri Lukisan is the oldest art museum in Bali which has display of modern traditional Balinese paintings and wood carvings .Do not miss out to visit this interesting Painting Museum designed with Balinese Traditional architecture that is integrated with pure nature and atmosphere of Ubud Village."
        }, 
        {
            "index": 239, 
            "rating": "3", 
            "review": "A must.. You cannot visit Bali without understanding Balinese painting and its roots and meanings: this you will easily learn in this museum divided in thematic gallerries with explanations both in Indonesian and English. The admission ticket of IDR75.000 includes a free afternoon tea at the Museum restaurant, consisting in a cold or hot drink and a delicious slice of chocolate cake!!"
        }, 
        {
            "index": 240, 
            "rating": "3", 
            "review": "OK if you are short of time but Neka and ARMA much better. This was the 4 the museum that I have visited in Ubud and the most disappointing. You cannot just pay for entry, you must pay for lunch or tea as well. There is not much explanation about the paintings and the rooms are rather dark which makes reading what there is difficult if you need glasses etc to read. Go to Necka or Arma instead."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Nice museum and make a mask. This is a wonderful museum. A lot of interesting displays. Also signed up for course to paint a mask for 300,000 Rp (~US$25).\nAnd go to the Mask and Puppet Museum near Maas (short drive from Ubud). The museum is huge and free. It is excellent."
        }, 
        {
            "index": 242, 
            "rating": "4", 
            "review": "A trip down cultural lane. Wandered into Puri Lukisan on the spur of the moment as we walked past it. Entry includes a drink and some cake (which was yum!).Puri Lukisan was great. There was a lot of information on the history of the museum and the art scene in Ubud. The only downside was the fact that it was called a 'museum' when it's actually more so an art gallery. We were looking forward to seeing historical artifacts etc from the region, but instead the history is told in the paintings. You can also watch a couple of local artists do their thing. On the day we went we watched and spoke to a female weaver and a guy who did art on dried leaves using a blade and cooked nuts as the \"ink\".Well worth the trip in for those who are interested in this type of thing."
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "Worth it!. Beautiful paintings and sculptures. The artworks are housed in four buildings scattered in a big garden compound. Well worth the entrance fees of Rp 75 000. Ticket price include a refreshing drink and cakes at the restful cafe. Do allocate at least 2 hours to fully appreciate the place."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Impressive Museum. This museum is a must for everybody who is interested in Bali culture and I guess everyone who comes to Ubud, is - right?Besides, it is beautilly set against rice paddies in the back.Christophe"
        }, 
        {
            "index": 245, 
            "rating": "4", 
            "review": "Oasis. This art museum in central Ubud is a calm oasis in the downtown. There're a lot of stairs to go into the four halls but you'll be rewarded with examples of Balinese art including one from the 17th century. Explanations are in English. Lovely water lily ponds adds to the serenity,"
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "lovely quiet spot. some beautiful examples of Balinese painting, both traditional and modern. Shame the museum is not climate-controlled to be able to preserve them well over time. The beautiful gardens alone are worth seeing."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Fantastic. Get the early dinner package.. We were very surprised to find that this museum (which lonely planet listed as only 20,000 idr) was actually much more than that. You can buy a coffee, snack and entry for 75,000 idr, a lunch set menu for 110,000 idr or an early dinner where you can choose from any main for 125,000 idr. The museum itself is stunning, fantastic. We had never experienced Indonesian/Balinese art and it was wonderful. Then we had our meal and WOW. A fresh juice, a delicious main, dessert and delicious coffee. All for around 10 dollars US. Get there at about 4:00-4:30 for the early dinner special as the museum closes at 6, but the dinner is available later."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "This museum gave us a impression of Indonesian Art, we never saw before.. This was my 1st time in a Indonesian museum of art and I was deeply impressed, by different styles of painting and woodencarving. Also the visiting of Queen Juliana of the Netherlands , Ethel and Robert Kennedy show me the importance of this museum. Great thanks to people who donated art to this museum. It was my plessure to be here."
        }, 
        {
            "index": 249, 
            "rating": "4", 
            "review": "Art by Traditional and Visiting Artists. The Puri Lukisan Museum is a wonderful collection of Balinese art, mostly of the modern period. The buildings and setting should be appreciated as well as the art."
        }, 
        {
            "index": 250, 
            "rating": "3", 
            "review": "Great Collection but Poor Experience. I believe that the museum has precious collection on historical Balinese painting distinguish style, and it is indeed. On the other hand the service is just average if not close to poor. There is no guide to explain us about the great collection. Visitors are just left wandering around without any clue. Unless you are a scholar on art study you will leave this museum empty handed for sure in despite of visiting treasure experience."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Amazing Balinese art. There are some truly remarkable pieces in the museum's collection, and I'm glad it's being collected and conserved. The entrance fee came with tea and cake which was a very nice touch! The grounds are beautiful too."
        }, 
        {
            "index": 252, 
            "rating": "4", 
            "review": "Traditional Balinese paintings. This is a spacious museum with four main buildings. The art is mainly typical Balinese paintings of local and Indian myths. Because of that it tends to be a bit repetitive and although there is a brief description of the story they somehow blend into one."
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Nice Place. If you like painting art you must see this place. You will see the painting from year 1600. Now they add 1 building for marketing museum very inspiring."
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Incredible paintings stun through one's soul!. We were amazed by the cleanliness of the museum grounds. The art collections are wonderful. The various types of artists are represented n paintings and carvings. This is not a huge museum and one can see all of it in less than two hours ... or one hour if you do not study the paintings as we do."
        }, 
        {
            "index": 255, 
            "rating": "4", 
            "review": "Relaxing and enjoyable. During our recent visit to Ubud, we spent time in several art museums, including the Puri Lukisan Musuem, ARMA and the quirky Blanco Museum. Of these, Puri Lukisan was the most interesting in terms of helping us to gain some understanding of Balinese art. It is a calm, relaxing place. It was also a very pleasant spot to have an enjoyable lunch, while listening to some music. Thoroughly recommended."
        }, 
        {
            "index": 256, 
            "rating": "3", 
            "review": "Neka Museum is Better. A collection of Balinese art right on the main street in the heart of Ubud, but the collection at the Neka Museum, which is private and outside the town, is better."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Wonderful art in a great setting. I enjoyed my visit and was happy I planned to stay long enough to saver every aspect of the art. There is also an outdoor restaurant which is very pleasant. My only little gripe is that it was hard to find the bathroom the first half hour. The staff were helpful and there is a kiosk to buy excellent art books. This is a must see if you are in the Ubud area."
        }, 
        {
            "index": 258, 
            "rating": "4", 
            "review": "Very enjoyable. The museum is very nicely done with an assortment o art and history of Bali. It was very easy to walk around and there is an assortment of art work and items to purchase. Well worth the IR75,000 entrance fee."
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "A HORIZON-EXPANDING VISIT. Its gorgeous (and well maintained) landscape made me felt as if I were in the heaven of lotus. A sizeable pond of blooming lotus with a stone sculpture of Lakshmi Goddess (wearing poleng sarong – typical Balinese B&W checkered fabric) in the middle of the pond had halted my steps to spend some quite moment there. I also saw a lot of little students attending a drawing class on an open space pavilion on the left. When I was there, Balinese style Wayang paintings by Ketut Madra (the master of wayang painter from Ubud) were exhibited. By chance, the curator, David Irons, who also wrote the exhibition catalogue was there and gave me a private guided tour. Thanks Mr. Irons, I did widen my knowledge, not only about Balinese paintings but also the Mahabharata and Ramayana characters. The other pavilion displays various beautiful Balinese paintings. Postcards and books of Balinese arts/paintings are available for sale at the entrance counter. What a great visit!"
        }, 
        {
            "index": 260, 
            "rating": "4", 
            "review": "Great restaurant . Museum itself was an average but the restaurant was great. I purchased lunch combo ticket including a drink, main course, dessert and coffee. The dessert, fried banana with chocolate source and vanilla ice cream, was excellent."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "Painting and offering making lessons!. We came as a class of 16 and we were able to have some hands on experience making and drawing some of the really traditional batuan paintings on a canvas and painting as well. We had some guides there to teach us on how to draw and paint. I drew a painting on Hanuman, an ancient deity of the Hindu Ramayana Epics. There were 3 guides to help us out and also i took around 2 hour to complete my drawing and time passed so fast cause the environment there was just amazing for doing the arts.Its cooling, spacious and filled with greens and it really takes your mind of almost everything. There is toilet facilities, a cafe nearby. The day was lovely, with just the right amount of sun, without it being too scorched. Tourists that passed by were just awed at what we were doing. Im really glad that I visited this place and the second day, we came we made offerings, simple ones that you would normally see on the sides of the roads in Ubud. It's really a touch of how living in Bali would be like. And I can say it's a slow and satisfied way of living!"
        }, 
        {
            "index": 262, 
            "rating": "4", 
            "review": "Kept our kids entertained for a few hours. This museum has been extended fairly recently and gone up in price - the cheapest ticket is 75,000 including coffee and cake, we went for the set lunch for 115,000 which included a juice/soft drink, main course, dessert and coffee and the food and service were good. Their was a torrential downpour so we got stuck here for 3 hours and our 3 kids stayed entertained watching an artist and exploring the rooms including the new educational facility. Overall a good way to spend a few hours and learn more about the artistic history of the area."
        }, 
        {
            "index": 263, 
            "rating": "4", 
            "review": "for art lovers. as someone who is no art expert but love observing the aesthetics of things, i enjoyed my visit as i was able to see the different balinese art styles and how they manifested in works that might be on similar subjects, yet bring out different things based on the art style.the ticket allows you to claim a juice/coffee/tea at the end of the visit at the museum cafe, which also sells a selection of mains/desserts. not the cheapest place (I had the burger which came with fries & salad for 50, 000 IDR) but its okay food when you're famish and its raining cats & dogs. its open-air though so the flies can be quite bothersome if you want to have a slow meal.set aside at least 1.5hrs to browse through the collections in detail."
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Best Museum of All. Three buildings full of Bali paintings. Beautiful grounds. A delicious lunch (I chose the entrance/lunch combo package). Building One was my favorite, with older paintings plus works for sale. Right off the main street in Ubud."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "high quality traditional balinese art. lots of paintings in the traditional style, many from early in the 20th century. and pleasant grounds in the heart of the busiest part of ubud, and a cafe makes it a welcome refuge."
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "Balinese History. The Museum Puri Lukisan houses one of the most complete Balinese Collections in 4 separate buildings. Rudolph Bonnet, The Dutch Painter, was one of the founders of this museum and it is steeped in history of Bali with photos to show the progression over the years."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Beautiful Balinese artwork. The ticket price was a little more expensive however it did include a drink and cake as part of the price so I was happy about that! The balinese artwork was beautiful and it was interesting to see the newer exhibition as well. The artwork, buildings and grounds were all very well kept."
        }, 
        {
            "index": 268, 
            "rating": "4", 
            "review": "Beautiful gardens, relax time!. Liked:The gardens, with the lotus flowers and the relax environment. The art is also nice with more contemporary art."
        }, 
        {
            "index": 269, 
            "rating": "4", 
            "review": "If you are looking for a real Balinese painting. Pay a visit if you are interesting in painting Balinese style, though they have slight variation of impressionist paintings to choose from. No da Vinci or Michelangelo pieces here, don't get too excited"
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "Informative. On our trip to Ubud we visited the museum. It is easy to find as it located in the middle of the town and near Ubud market. It has three main hall. While it is dedicated to a number of Balinese artists works, we found very informative. It helped to understand the Balinese culture and history. The exhibits were around the village life, mythical creatures and bits and pieces about the history. The museum is one of the best I've visited in Indonesia yet some urgent renovation are needed to attract more visitors .The cafe was good and the ticket included free drinks. I strongly recommend a visit to this museum."
        }, 
        {
            "index": 271, 
            "rating": "3", 
            "review": "Nice to see some historic art. The place really only has art. We thought it would be a bit more historic and tell the story of Bali and Indonesia a bit more but no. Perhaps that was our mistake for misunderstanding.The art is really nice and you can really tell how the painters have been influenced by religion.It's also interesting to see the painting style which is nothing like western art.Probably great if you are into art or at least quite interested.We thought it was good, however not really what we expected."
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Important if you love art. This museum is centrally located down from the Palace and houses some important art, including work by Lempad, who died at the age of 116, and who was creating right up until his death. He helped design the gallery's pavilions. The grounds are beautiful and you could spend hours there. Perfect way to spend a rainy afternoon."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "A very quality museum with lovey grounds. These beautiful grounds host some fantastic art. You could spend a day here enjoying the environment- especially if you wanted to sit down and paint a bit- which you would be free to do. Like most museums here you get a free cup of tea or coffee with your ticket- which is always worth the while to sit down and enjoy. I found the art at this museum to be the best overall in Ubud- I felt it was the most rigorous in terms of quality and scope of history. I was really thrilled by the experience and would highly recommend it to even a casual lover of art. It is also just a fun and beautiful space to enjoy Indonesian culture. A lovely oasis in the bustle of Ubud."
        }, 
        {
            "index": 274, 
            "rating": "4", 
            "review": "Good and interesting. First time in Bali and I didn't know anything about the art history of Bali, visiting this museum was very helpful to learn more about the history and the current art"
        }, 
        {
            "index": 275, 
            "rating": "4", 
            "review": "Solitude and art just off Ubud's Main Street.. Intriguing Balinese art, especially that of the pre-War period. Two hours will allow you to view everything at a relaxed pace, to enjoy the grounds, and savor a nice cup of tea or coffee. Interesting to learn how Balinese art has evolved and incorporated outside influences while remaining true to its cultural roots."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Well worth a visit. Some beautiful works of art here, both pre and post-war. Set is stunning gardens and a lovely café with good coffee. Not to be missed."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Highlight of the trip to Ubud. We wandered into the museum grounds on a whim for dinner and it was magical. The museum is a pretty place to explore by day but by night it was just gorgeous. We found out later that you can buy a combined museum and dinner ticket for R125,000 and the museum is open until 6pm then diners have the grounds to themselves. Lovely restaurant, unbeatable setting. It was a mystery why we had the place virtually all to ourselves. Extremely romantic setting and excellent service."
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Another fine museum in Bali. The Puri Lukisan, Neka and Agung Rai are the three major museums in Ubud. Though their collections are similar, they are all worth a visit, both for the paintings (and sculptures) and the beautiful gardens. The Puri Lukisan, close to central Ubud, is particularly pretty - and the complimentary coffee/tea and pastries in the café are a treat."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "nice artwork n history of bali. this is a museum that not to be missed in the trip. very nice painting, artworks from history to modern art. take your time to finish all the galleries.they provided types of entrance fees: suggest to take a break with tea or coffee in the museum. enjoy very much."
        }, 
        {
            "index": 280, 
            "rating": "4", 
            "review": "Beautiful Art, Beautiful Setting. This is the place to go to see some amazing Balinese Art and get a good sense of traditional style. The collection is mostly early 20th century from numerous artists and is housed in three buildings surrounded by park-like gardens. The art itself is very impressive and inspiring and captures so much detail of Balinese life, landscape, and culture. Although it is right in the center of Ubud we nearly had the place to ourselves. The ticket price includes a welcome drink at their cafe where we also had soup delicious soup. Definitely worth checking out."
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "Excellent!. The work of art displayed here are great. It shows local artists from early 20th century with a little occidental influence in their style. Nicely show and beautiful surroundings."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Excellent survey of Balinese art. Good collection of Balinese art of many schools. Well explained. Free beverage with admission. Outdoor spaces for performances."
        }, 
        {
            "index": 283, 
            "rating": "5", 
            "review": "Take some time to relax away from the streets.. I really enjoyed the hour or so that I spent wandering through the buildings and the lovely gardens at this museum. Although pretty much in the centre of town there were not many people there, and it was very relaxing to be able to view the artworks at whatever pace you chose without the pressure of other people pushing through. There was good information provided on the works and I found it a good insight into Balinese art both old and new. The coffee house was also a pleasant spot to relax and enjoy the complimentary drink included in the admission price."
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "Nice museum. Nice museum which gives a genuine idea about Indonesian art. Lovely gardens and a very nice coffeehouse."
        }, 
        {
            "index": 285, 
            "rating": "5", 
            "review": "Informative. I love visiting museum, and this has became one of my fave. I like history. They put adequate information in each of the painting and picture. They also have adequate information in the brochure. Helpful staff to direct as to visit each of the building. And they also include a complementary drink in the ticket. It was nice after we stayed and enjoy the museum for a couple of hours."
        }, 
        {
            "index": 286, 
            "rating": "4", 
            "review": "Lovely snapshot of Balinese art. I took my 10 year old daughter as she loves art. It was a beautiful tranquil place tucked in amongst the busyness of Ubud. I didn't have to pay the $5.00 entry fee for my daughter, which I thought was very generous. That included a welcome drink for us both. There were not a lot of people there when we went so we enjoyed wandering and taking photos. A lovely experience."
        }, 
        {
            "index": 287, 
            "rating": "4", 
            "review": "A quiet, serene oasis. The day I went to the museum there was hardly anyone there, so it was very peaceful and serene. Though the art collections are minimal, they are interesting and diverse. The grounds and gardens are lovely. A man was playing the gamelan outside one of the buildings, which gave me a relaxing chance to sit and listen in the shade - very atmospheric. The café was quite good too and reasonably priced."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "Beautiful Art Museum. Lovely terraced grounds. Friendly staff. Free complimentary drink included in entry fee $5. Well worth the visit."
        }, 
        {
            "index": 289, 
            "rating": "4", 
            "review": "Interesting and extensive museum with pretty grounds. We visited every pavilion and wandered extensively round the grounds. The place was calm and tranquil (maybe we were lucky to be amongst just a few couples visiting that day - pre-high season) and the signs were informative.We both felt we learnt something about Balinese art, ancient and contemporary, as well as Balinese culture in general. No pushy guides and the people at the cafe (cold beverage included in the price of entrance) were also very nice."
        }, 
        {
            "index": 290, 
            "rating": "4", 
            "review": "offers an authentic experience. visited here in April 2013 during our short trip to Ubud.for a IDR 50K entrance fee this museum is definitely worthed, got myself a refreshing welcome drink beforeward and also equipped with wi-fi connection services.this museum is rather a well maintained buildings with large gardens, each halls represents a different stories/timeline of balinese art. unfortunately our visit here lasted only for 30 mins which was not enough to properly explore the whole facilities..definitely will comeback someday and recommend this for those who likes art (especially paintings) and want a authentic representation of balinese culture."
        }, 
        {
            "index": 291, 
            "rating": "4", 
            "review": "Fascinating. Excellent museum st in beautiful gardens well worth a stroll around. A small oasis of peace and tranquillity away from the tourist hoards on the streets of Ubud -oh and the taxi drivers touting for business!"
        }, 
        {
            "index": 292, 
            "rating": "5", 
            "review": "A museum worth seeing. For a small fee, we spent a lovely two hours wandering around this museum. We did not see a single other person so it felt as if we had the place to ourselves ~ rather surreal. There is much to see and absorb and the grounds are very grand. Well worth a visit."
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "Some really groovy, unexpected pieces. I headed for this museum because it was so close to where we staying, and I'm glad I did. The $5 admission fee was well worth it for 3 big houses of paintings and sculptures (and lovely grounds). I'm a little shocked at the heat & humidity in the buildings as far as how these paintings are to be preserved for the longterm, but, I'll let them figure that bit out. The price of admission includes a drink at the cafe at the end--I highly recommend the lime juice ; )"
        }, 
        {
            "index": 294, 
            "rating": "4", 
            "review": "Good collection in the middle of downtown. Nice museum with a variety of paintings and wood sculptures. It's location in the middle of downtown Ubud makes it easy to reach. Its collection tends to the more recent and modern works. Spread over several separate buildings with fountains, pools, and sculptures, makes certain that you don't forget where you are. A nice feature that you should take advantage of is the free drink in the museum cafe: the setting is charming."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "Serene art museum with impressive collection. I really enjoyed my visit to this museum. They had an interesting collection of modern and traditional paintings and wood carvings. I wish they had more wood carvings, actually. Entrance fee includes a complimentary drink at the quaint on-site cafe. Helpful staff and beautiful gardens."
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "you could spend days here!. so much to see! I went her on my first day in Ubud-- what a good idea! so much traditional artwork and paintings, scultpures, gardens, and even workshops to take! bring your sketchbooks and be in artist paradise... then cool off with a complimentary drink at the museum café and admire the absolutely otherwordly surroundings. Artist heaven."
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "excellent museum. great catalogue of traditional balinese art in a beautiful and central location near the Ubud Palace"
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Beautiful quietude in the middle of Ubud. The art is good too! We really enjoyed our 9:00 AM visit here. There are 4 large buildings filled with Balinese paintings and carvings. A good introduction to traditional Balinese art."
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "Valuable and interesting collections in a beautiful `palace'. Although I don't really know how to appreciate traditional Balinese art, I find the paintings and artifacts exhibited in this museum fascinating and eye-opening. Some of the works are dated to hundreds of years and they show the exceptional skills of the artists on top of their creativity and sheer talents. It's one of the best art galleries in Ubud I've seen and worth a visit if arts and culture are your cup of tea."
        }, 
        {
            "index": 300, 
            "rating": "4", 
            "review": "learn about Balinese art........ I really enjoyed my visit to this museum - I wouldn't have classed Balinese art as my especial favourite but I felt my visit had given me far more appreciation of Balinese culture and their different styles of painting.There are wonderful wood carvings some of which use roots and distorted wood incorporated into the sculture. Other wood carvings a delicate and flowing -There was a collection of paintings on cloth which were most fasciinasting - niave in style and divided into squares representing months, lunar cycles, astrological signs - This collection was donated to the museum by a Dutchwoman (?) - for me it was the most interesting of all but there is enough to see to give you a culture lesson in a couple of hours!!"
        }, 
        {
            "index": 301, 
            "rating": "4", 
            "review": "Don't miss this essence of Bali experience.. Before you purchase any paintings, sculptures or carvings in Bali, this museum will give you a broad overview of the trends, quality and history of the arts in Bali. This was the first museum in Ubud, conveniently located right downtown (used to be surrounded by rice paddies). It has a comprehensive collection, and some wonderful older pieces in a beautiful garden setting. The collections are clustered in multiple pavillions, and walk you through classical, Ubud, Batuan, Sanur and Young Artist developments. There are also nice examples of the evolution of the carving traditions. Unlike the best western museum exhibitions, the captions often leave something to be desired, but the visual instruction is unparalleled. Even if you're not a collector, seeing the range and depth of imagery and styles, as well as the themes in the artwork is an education in itself. The pastoral scenes, by the river and village scenes span the years when Ubud was a tiny village, to now, when tourists with long camera are painted into the temple ceremony pictures. Pure insight into the culture you would otherwise have to read volumes to glean.One carving I admired led me to seek out the artist's studio in Mas. There I was able to meet him, see his other (available) pieces, as well as the catalogues from exhibits where he'd been featured. There is a small bookstore, and the price of admission includes a free beverage. They do offer classes in their open air pavillion, book ahead."
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "History of Ubud and Balinese Arts. Although the admission is a bit expensive (50,000 IDR/adult) for an Indonesian museum, it's because it's self-managed by a private institution. I find the collections are well-managed, some of them are going through renovation.There's no air-con in the building, so be prepared to suffer in a hot weather. But you can use your ticket to get a free drink in the museum's cafe.It has a number of workshops. Each takes around half a day.The museum has largely a collection of paintings, few are photographs and sculptures. Mostly the paintings depict the legends and daily lives (like farming) of the locals. The information of some artworks is incomplete, and I find the way they arrange the articles is a bit inconsistent. Nevermind this, it's still great if you want to get familiar with Balinese arts."
        }, 
        {
            "index": 303, 
            "rating": "4", 
            "review": "First Museum in Ubud. I don't know excatly what year it was builded, but I know it was build by the king of Ubud and a Dutch artis named Mr. Rudolf Bonnet,.. great collections of painting and sculptures and some of them anonimous..if you are art lover it will be good to be there.."
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "interesting and instructive. First you have to know that museum is not the same indoor institutian as we know from Europe and everywhere. Museum in Bali is anice and very beautiful park area with some open houselike buildings, small cafe and couple of beautiful buildins with nice paintings on the wall. This museum gives a very good overviews of Balines art. Walking around in Bali you can see that there is a perception of art of every place and person. In this museum will become clear where it comes from."
        }, 
        {
            "index": 305, 
            "rating": "4", 
            "review": "Workshops. Recently, We enjoyed taking a puppet making and gamelan class here on a very rainy day. Our instructors were warm, talented, informative and genuine. Would recommend to anyone interested in the arts with limited time in Ubud. The price for the workshops were fair. Schedule one day in advance."
        }, 
        {
            "index": 306, 
            "rating": "3", 
            "review": "interesting and different. there are 3 main buildings housing the permanent collections and special exhibitions from time to time. Grounds are pleasant to walk around. There were some displays which provide an historical perspective on art and infiltration of westerners into Bali art circles, plus some old pieces that help preserve some of the older local artists work. Also small selection of sculptures and carvings. Short on detailed descriptions in parts and good detail elsewhere for English speakers. No audio available. It is not an extensive gallery, unlikely to be very crowded, an hour will give a good look, 2 hours to get into more detail. The offer of a free drink at the cafe that comes with entrance ticket is a nice gesture. Acceptable toilet facilities on site and free."
        }, 
        {
            "index": 307, 
            "rating": "3", 
            "review": "can give a miss. there is nothing great except a few paintings which yu can see anywhere no need to pay ticket. only thing nice if yu want to have a cup of tea it is nice location in the crowed ubud"
        }, 
        {
            "index": 308, 
            "rating": "4", 
            "review": "Interesting Indonesian Art. Traditional Indonesian Art. Museum located near town center. Free soda included with ticket. They had an area where you could play some of the Indonesian instruments. We arrived around noon and I think there was a jam session of locals playing - quite charming. Helpful guards."
        }, 
        {
            "index": 309, 
            "rating": "4", 
            "review": "Balinese art. It is a lovely musuem if you like art. It is located in a magnificent garden and is divided into a few sections. The entrance fee is 50,000 rupiah -which can be seen as slightly overpriced but the collection of paintings is impresive, especially modern art. We visited it during a coffee festival which meant the place was full of coffee lovers. You get a free drink with the ticket and we had a chance to see gamelan practice."
        }, 
        {
            "index": 310, 
            "rating": "4", 
            "review": "Great overview of Balinese art. This art museum is spread over four buildings (including a fairly new one near the entrance steps) and focuses primarily on 20th century and contemporary Balinese art. The most enjoyable aspects for me were in Building I (where the I Gusti Nyoman Lempad collection is together with other earlier art styles less affected by the Western art tradition) and Building III (where wayang style paintings and tapestries are hung). Building II (which contains post-war art) and the new building (which contained a temporary contemporary art exhibition with paintings for sale and a display on the founding of the museum) were also good, but didn't captivate me as much as the other buildings. We were also fortunate enough to see an older man practising a rindik (Balinese gamelan instrument) outside Building I. He enough was nice enough to let me have a play of it!There is a lot to see at the museum and you might need close to 2 hours to do it justice. Admission to Puri Lukisan is Rp 50000 per person and includes a tea, coffee or mineral water at the cafe.During this trip, I also went to the ARMA Museum in Peliatan. If you had to choose between them, I would slightly prefer the ARMA Museum, mainly because the conservation practices are a little better there. Some of the older works in Puri Lukisan are starting to fade, though you can still clearly see the intentions of the artists."
        }, 
        {
            "index": 311, 
            "rating": "5", 
            "review": "Wonderful Museum and workshops for kids are excellent !!. We have known this Museum for twenty years now and know one of the former directors who always accompanies us there. The Museum Entrance has been rebuilt since we last came (in 2010) and the whole museum has been revamped and cleaned up.The permanent collection is, as always, excellent, fascinating and well presented.There was a new exhibition when we were there with new Balinese artists and historical background which was very interesting and worthwhile.Two children (age 10 and 12) did a painting workshop for a whole morning. The painter who taught the lesson spoke good English, was very talented and friendly and the kids had a great time. They even received traditional treats (fried banana). The price for the workshop is about 10 U$ per hour per kid. Paintre's name is I Wayan Warta Yasa.They also opened a new restaurant there, but we did not eat at the Museum."
        }, 
        {
            "index": 312, 
            "rating": "4", 
            "review": "A wonderful survey of Balinese art. This museum takes for the studious about 2 hours, for the quick though type, just under an hour. My husband and I took our time. It helped having done a little reading about Balinese art online and in my guide books before going so I had some sort of reference point, because there isn't much interpretive stuff at the museum. However they have an extensive collection of what is considered classical Balinese art and examples from some of Bali's top artists."
        }, 
        {
            "index": 313, 
            "rating": "3", 
            "review": "For art lovers who know their history of modern Balinese art period. An interesting art gallery heavily focused on the artistic commune that formed between local and overseas collaborators between the 1930s and 60s, it is situated in a large compound that looks to have been recently renovated, and of course, made to look a bit like a temple. The labeling and explanation is a bit hit-and-miss, sometimes providing adequate background info, and other times non-existent, which is weird considering how modern the whole place looks. Some quite old pieces exist, though really the art is a modern take on traditional Balinese design and themes, influenced by western sensibilities and containing an insane amount of detail. Art classes exist, though you need to prebook. The cafe on site has a nice dessert menu, and your ticket entitles you to one free drink."
        }, 
        {
            "index": 314, 
            "rating": "5", 
            "review": "Fabulous art in a lovely setting. The works on show here really highlight how little true art is being created and sold in Ubud, supposedly the cultural centre of Bali. I would have liked to have spent hours more here investigating the insane detail of the traditional paintings. The gardens are great too, and you get a free cold drink with the price of entry. Highly recommended especially if you intend to buy some art while you're there. Don't go shopping in the local \"fine art\" galleries and artists' cooperatives with their formulaic abstracts and talentless exotica until you've seen how good Balinese art can be."
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "Well worth a stop. Wo derail open air garden setting for some excellent artworks. We liked the history of Ubud artists and were especially taken with the works of I Gusti Nyoman who started drawing in his 60s and lived to 116!!"
        }, 
        {
            "index": 316, 
            "rating": "4", 
            "review": "small museum with nice wood work.. Do not expect a big museum,it is small but nice if you are interested in balinese wood work .I had feeling that it is more like an art gallery than museum to be honest.More on sale than display.It is In a very central location if you have 45 minutes to spare.why not?has nice gardens and a cafe."
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "A brilliant cultural experience. Our family of 2 adults and 3 children divided in two groups and tried mask painting and basket weaving. The 75000rp covered all our materials and morning tea and our teachers were very generous with their time. The allocated 3 hours turned into 5 because of our dedication! and we were grateful for their patience. The teacher taking the mask painting spoke no English and this was no problem even for our 9 year old who was happy to follow the steps. Nyomen was our basket weaving teacher and she spoke English well enough to teach us some Bahasa. Our 11 year old son had no problem following her directions although I think a much younger child would struggle.The best part was coming away from an experience where we had totally immersed ourselves in something different and each had a sense of accomplishment as we took our own souvenirs away along with the memory of just being there.The setting was beautiful. We each worked in a traditional pavilion among the museum grounds where it was quiet and just a delight to feel removed from the hustle of touristy Ubud. If you are looking for something a bit different and have the patience to sit and try something new then I would thoroughly recommend it. The museum also has batik painting, balinese dance and gamelon instruction.They also have a restaurant and lovely clean toilet facilities."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Must see!. This is one of the best museums I've ever seen (next to the Museo de Oro in Bogota). The grounds are beautifully landscaped for the small fee you pay (fee includes a free drink). The art features many Hindu, surrealist and landscaped art works. The Batik paintings in particular are so 3-D you can almost jump in. Great way to spend 2 hours."
        }, 
        {
            "index": 319, 
            "rating": "4", 
            "review": "Very ancient & informative. Had seen many temples at this stage, so not very impressed"
        }, 
        {
            "index": 320, 
            "rating": "4", 
            "review": "Good value art/craft classes. The Museum offers a range of classes from mask painting, woodcarving, offering making to Batik and traditional Balinese painting. I did the painting class, which was Rp350,000 for the day. I sat with an artist who showed me some sketches and for a start I thought I’d be doing something like ‘paint by numbers’, but I was pleasantly surprised. Once my choice was made, 2 clean sheets of paper were produced and I then spent the day learning how to sketch, outline, shade and paint using layer upon layer of color. The artist was very patient, showing me ‘step by step’ as he put it. If I needed help, he gave it. I was the only student, but he does take up to 4 people in the busy season. As well as the class drinks, snacks and a delicious lunch were included."
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "One of Ubud's major art museums. Entry is Rs 50,000 which includes a complimentary drink. This art museum is in the heart of Ubud and well worth a visit. There are excellent gallery spaces in a beautiful garden. Be sure to also visit Neka Art Museum (different from Neka Gallery) and Agung Rai Museum of Art (ARMA)."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "The real museum of Ubud. The single most important museum in Ubud, master minded by Rudulph Bonnet and the former King/Crown Prince. The museum holds a vast collection of the most important local artists, and the setting is outstanding."
        }
    ]
}