{
    "category": "Ubud", 
    "entity": "Saraswati-Temple", 
    "avg_rating_stars": 4.31359649122807, 
    "review_count": 456, 
    "rating_stats": {
        "poor": 3, 
        "average": 54, 
        "terrible": 0, 
        "very_good": 196, 
        "excellent": 203
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "3", 
            "review": "Closed doors. The front garden with its water pools was nice, but the main temple area itself closed so we were note able to see the actual temple itself, which was disappointing."
        }, 
        {
            "index": 2, 
            "rating": "4", 
            "review": "popular and pretty temple. alot of people, praying and standing at the temple.\nQuiet place whit good wheather (no so hot that the street)"
        }, 
        {
            "index": 3, 
            "rating": "4", 
            "review": "A little gem tucked away off the main road in Ubud. This lovely temple is just around the corner from the Palace. We discovered it by accident having decided to eat at the restaurant that backs onto the temple. We enjoyed the meal whilst watching the sun set around the temple. There are then lights along both sides of the causeway between the lily pools.There is a night show, commencing at 7pm. They start to put chairs and lights out around 6pm- so if you want a good photo be there before this time. We stayed for about an hour and a half, appreciating a perfect reflection of the temple in the lily pond.There are rather a lot of people around that really were prancing around the temple for photo poses, showing some disrespect to the sanctity of the place."
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "Good water temple. Nice little water temple, shame Starbucks had to plonk a cafe beside it, but once inside you don't notice and the noisy road becomes quiet. Lovely water lillies and temple art work."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Lovely but just another temple.. Best part is the ponds out front - took 5mins to see the whole thing then I went to the lotus cafe to eat. Lovely to see while in Ubud tho and it's free so do put this on your list."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Beautiful quick visit . Very beautiful temple, small and well maintained, you can walk around and enjoy a garden full of loto flowers. There is a café terrace if you want to stay a little longer and enjoy the views. "
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Family hols. Fantastic place to visit. Awesome. Plenty of photos to take. Very spiritual place to visit. The design of the temple so interesting. To think it was designed hundreds of years ago and the work that was done makes it even more fantastic."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "Would have appreciated some guidance . I know this isn't just for tourists but in daily use, however some guidance on what is going on would be nice"
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Peaceful. It's situated on the main road.but once We entered we feel like sitting for hours.best to spent a lazy afternoon or morning in this temple surrounded by Lotus pond.pond itself is gorgeous,not a crowded place at all."
        }, 
        {
            "index": 10, 
            "rating": "4", 
            "review": "Beautifully laid out and quiet when went there in the morning.. Only allowed to visit the main grounds as the actual temple area is for worshippers only. Not a problem as the grounds was beautiful with the lotus flowers on both sides and a grand gate to the temple proper. Nice place to just sit and enjoy the peace in early morning before too many visitors come. Nothing especially special but the overall was bautiful. Ponds had a bit of rubbish. Understand dance performances held there but did not attend,"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Peaceful and relaxing. The saraswati temple which for locals doesnt hold much significance (compared to a village temple) is tourist paradise. Not crowded like other famous temples and situated right at center of Ubud near Ubud palace, the temple is absolutely beautiful especially with lotuses in pond and easily accessible. A very nice cafe is situated near temple which offer great place to relax and drink coffee."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Easy to miss but don't!. This temple is easy to walk right by and not even realize that you missed it. The location is west of the Palace and you will find the entrance next to the Starbucks. We got there early enough to beat any sort of crowd (9am) and that allowed us to get some great photos!Very cool structure in the centre of Ubud."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "A must see in Ubud. Because of the beautifull lotuspond this is the Balinese tempel I enjoyed most in Ubud and surroundings."
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "Beautiful Pond. The pond in front of temple is beautiful and kind of landmark for Ubud. The beautiful lotus in the pond are worth seeing, besides hat nothing much to see, we went in evening when temple was closed, not sure If day time people are allowed inside .There is cafe Lotus where you can relax and admire the beauty and a Starbucks too.One of must visit place in Ubud."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Beautiful!. I absolutely loved it here! Mainly because of the Lotus Pond, it is gorgeous. I visited three times in the five days I was in Ubud. Easy location to find, both a cafe and a Starbucks situated in front offering views while you dine/caffinate."
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "most scenographic temple. located on the main road jalan raya, it is the most scenographic temple in Ubud...every night in high season dance shows are held in front of the temple."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "very beautiful. very beautiful with special style, there's Balinese dance show in the evening time, and must visit towice one in the morning to enjoy the nature and style, the other to see the dance show and have a nice meal in the resturent"
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Nice pond and lotus. It is located nearby Ubud palace just walk a minutes. Consisted with beautiful lotus and clean pond. There is a café and you can have meal while see the temple. We got a ticket for dance performance ."
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "beautiful temple. This was one of the most beautiful temples I visited in Bali. The pond at the entrance with lotus flower is stunning, particularly at the sunset, but there is more than the pond. Most people just look at the pond but I definitely recommend going inside. It is a small temple but it's beautiful, full of flowers, magical."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Temple. Beautiful, serene and stunning, my photo of lotus flower from the pond always a good talking point. Lovely day."
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Lotus Pond. The access gate to this location, the same gate as to the restaurant. What makes this pura looks more beautiful and peaceful is caused by lotus pond in front of the pura. You have to pass the pathway along with lotus pond in the left side and the right side. In the left corner of this Pura, a painting outlet seen there."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Fantastic pond at the front.. We didn't get to gobackdrop. inside the temple. The pond at the front is beautiful. Lovely place to take some photos with temple"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Stunning. Once again... AVOID the tourist crowd and go early. Very special place. Go with an open mind and heart :)"
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Magical. The 'demons' coming up out of the ground are just spectacular! Saraswati is the goddess associated with all forms of learning, study, and cultural activities, so it's appropriate that the Lotus Cafe (q.v.) right next door has Balinese cultural activities every night against the backdrop of this temple. Magical"
        }, 
        {
            "index": 25, 
            "rating": "3", 
            "review": "Good for photo taking. The temple is grate spot for taking the photo. However, you can explore just the outside and aroung the lotus pond, inside the temple is not allow to get in. Avoid to visit at the evening because they provide the dancing show and charge for entrance, so better visit when it free, except you want to see the dance."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Great temple. A fascinating temple that is several centuries old. I have so much things to say about this wonderful place but the most important one is that you must visit it."
        }, 
        {
            "index": 27, 
            "rating": "3", 
            "review": "No lotus flowers. Visited the temple during the daytime and there were no lotus flowers blossoming at that time. Maybe therefore it didn't leave much of an impression. It is located right behind Starbucks."
        }, 
        {
            "index": 28, 
            "rating": "4", 
            "review": "Beautiful an Quiet. A nice break from the busy main street in Ubud, some beautiful statues. No cost to get in like some of the other attractions. Small but very pretty and intersting."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "See a show here. A fantastic backdrop to perform in front of. Get there 30 mins early for front row seats. Have pics with the performers afterwards. Otherwise during the day you just look at it only. You cannot go into the complex behind."
        }, 
        {
            "index": 30, 
            "rating": "3", 
            "review": "Quiet temple beside cafes. We went to Starbucks Ubud and saw that it is right beside Saraswati Temple. The temple is beautiful and quiet in the early afternoon. Took few photos since we can't enter the complex."
        }, 
        {
            "index": 31, 
            "rating": "3", 
            "review": "Ok. This is a fun stop, but really will only last a few minutes. Its a beautiful temple, but there is not much in the way of history and not too much to see. Has also been commercialized by restaurants and Starbucks."
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Great. Great temple! Was suggested to Se it at night lit up and that was a great recommendation! Looks awesome! Can also see during the day as well!"
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Great for photos at night. We viewed the template and live music and dance performance by booking a table at the adjoining restaurant 'The Lotus garden'. The setting was amazing, you can't see the show all too well but the ambience is great, the restaurant food was also pretty good. During the day you can enter the temple grounds and take photos, though I'd suggest coming back in the evening to see it illuminated"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Nice . Nice temple, disappointed we were unable to enter but there is lots to look at, lotus ponds are stunning. At the front there's a restaurant and Starbucks."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "pretty temple. This is a very nice temple, with the green trees and the pond.You can take nice photos here.Go here in the afternoon, not to busy then."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "The lotus ponds are the star. Nice place to take photos. Quiet despite being in central Ubud. The lotus ponds make it different. Too bad it was raining but it's a nice recommended quick stop."
        }, 
        {
            "index": 37, 
            "rating": "4", 
            "review": "Temple in the town. I give it 4 stars because it's easy to find and get to, being in the center of Ubud. You can only see it from the outside and the inner temple is closed unless there is a religious ceremony."
        }, 
        {
            "index": 38, 
            "rating": "4", 
            "review": "Beautiful. It's worth visiting if you're around because complex (at least part available for tourists) is pretty small. Though its small it is also very beautiful :)"
        }, 
        {
            "index": 39, 
            "rating": "3", 
            "review": "Pretty. Very nice temple but crowded the day we were there. Again, if you have traveled in Southeast Asia, it was a bit underwhelming."
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Art and Nature lovers will love it. Located near a very chic looking StarBucks. The walk way to the entrance of the temple is all that you are allowed to see. But that is enough. The temple is closed and there is no fee to see this spot. The ponds surrounding the walk way is full of fishes and turtles. The special part would be the door itself. Just a majestic place to be. For artists this would be perfect place for sketching and etc..."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "amazing views and amazing food. we went on a tour and arrived here. great to go with a guide as he could tell you all the information you needed to know. just the most picturesque place ever. take your bathers and you can go for a swim."
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "Popular temple in a picturesque setting. Saraswati temple is one of the largest in Ubud and is a minute from the art market. The temple is elavated with beautiful pooled gardens leading up to the temple. There are organised dance displays on certain days and tickets are available from the tourist office located at the top of monkey forest rd on the left hand side. The office has dates and times for all the organised dances that are available in Ubud."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "worth a look. nice pond with lotus flowers, and at night a show in the front. Next to and behind that awful Starbucks."
        }, 
        {
            "index": 44, 
            "rating": "3", 
            "review": "Good for a quick peep. We had a look around the temple grounds today, unfortunately we couldn't go inside the temple itself but the lotus Lilly ponds made for a tranquil setting and some good photos. Sadly it's overlooked by a huge Starbucks that kind of killed the serenity for me. Deffo worth a pop in for a few minutes if your passing though."
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Very green and full of lotus!!. Its a bit difficult to spot this place its besides a small starbucks cafe.It very scenic with lots and lots of lotus.the surrounding is very pleasant and enjoyable."
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "probably the most serene and lovely location we saw in Ubud. we love the ambiance here. a perfect place to relax and reflect. the lotus pond is just too pretty for words! we went in every time we passed by! in fact i think we came back to ubud just to see this again!"
        }, 
        {
            "index": 47, 
            "rating": "3", 
            "review": "Temple at the centre of Ubud. The local know it better as Lotus Cafe. A temple surrounded by lotus ponds, breathtaking view, perfect for photography. They mentioned that they re having a traditional Barong dance performance at night but we didn't managed to catch the show. Perfect place to stop by, take pictures. They have souvenirs stalls & Starbuck coffee next to it."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Big Lotus Pond. In the centre of Ubud.. Has a very beautiful view with biiig Lotus pond.. You can fishing aswell. Taking picture is a must."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Oasis in the middle of Ubud town. Great little Oasis in the middle of Ubud-free entry. Near the Palace and next to a few coffee shops."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "beautiful place. Its a beutiful temple from outside, but always close from inside, open once in 6 months, We saw jogade Dance in eveing here, was good, live Bali traditional music was played"
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Beautiful Hindu Temple in Center of Ubud. This temple, dedicated to the goddess of learning and fine arts, is situated behind the Lotus Restaurant at the heart of Ubud Center. Find out when this temple will have its anniversary or another ceremony and get coaching how to dress and go with a local. It is an amazing temple! The beautiful facade hovers behind the Saraswati Stage, and performances are hosted almost every night against this entrance wall. Highly recommended."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "One of the best temples i have ever seen!. This has got to be one of the most beautiful temples I have been to. The lotuses make it even more subliminal. I went to Saraswati temple twice during my stay at Ubud - once in the morning and once at sunset. One gets to see very different shades of stone, water and flowers at both times. The soft music from the neighboring restaurant adds to the mystique. Its unfortunate that one cannot go inside the temple but even just the outside is worth it."
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "Blessing Temple. Nice View for photography~~Very different construction compare to other temple~~Please bring along your cap ya, its hot there if you go at noon time.."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Fascinating sights!. Wonderful temple with a lovely lotus garden out the front. Worth a visit. To note there are strict rules on dress code for entering the temple. Men and women must have shoulders covered and wear a sarong around the waist. Backpacks are also not permitted."
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Beautiful large lotus ponds. Located on the main Jl. Ubud Raya, very near the market and right next door to the Lotus Cafe, this is a lovely tranquil spot, with beautiful large lotus ponds that you can walk between. At night times there are regular performances by 'women only' dance troupes on the platform in front of the palace itself and, if you're lucky enough to be there at the right time, you might get to see young girls, some only 9 or 10 years of age, practicing their dance routines under instruction. They are the dancers of tomorrow, but already they have so much natural charm and grace."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Uniquely Constructed Temple. Fantastic temple which is free to visit and offers a pleasant experience for tourist. Not particularly big in size, but there are some great photo's opportunities. If you're not interested in taking photos, you don't need more than 10 minutes here. Certainly worth the visit whilst you're visiting Ubud Town Centre."
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Blissful experience. The temple entrance was really nice. The pond and the lotus plants and leaf around made the temple look really blissful. The temple has great places to take pictures.. Overall, blissful experience."
        }, 
        {
            "index": 58, 
            "rating": "3", 
            "review": "Beautiful grounds. The grounds in the water palace are beautiful and very well maintained, lovely to walk around. Beautiful setting behind Starbucks on the Main Street"
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Impressive. Beautiful water temple, ornaments on point and statues carefully carved. Has restaurants and a Starbucks within its compounds. Gift shop has impressive stuff, specially their scent sticks holders."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Serenity, essential Ubud. Right in the centre, small temple, but beautiful, serene place in the middle of Ubud chaos. The water in front makes for great photo opportunities. We visited during the day and it wasn't crowded at all. Go for a coffe at nearby caffe Lotus or Starbucks to enjoy the view (seriously, i have been to many Starbucks places all over the world and i think this one has the best view of them all, even better than the one in Tokyo overlooking Shibuya crossing)."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Breathtaking. This is just an amazingly beautiful place with a beautiful energy. My friend and I took our time and had a light lunch in the restaurant to soak in the vibes. One of my favorite places, for sure!"
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Peaceful place in the middle of Ubud. Nice place right by the Starbucks in Ubud. It also hosts a great show for various dances in the evening."
        }, 
        {
            "index": 63, 
            "rating": "3", 
            "review": "Okay to drop by. This temple is centred in Ubud and worth a quick visist. Not much to see but nice to drop by, its next to the starbucks at the central crosspoint in Ubud."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Pictersque. I was eagerly looking for the sign board for sarawati temple but could not find...just a sign saying lotus café...but when I entered the narrow entrance, the temple surrounded by the lotus pond was a picture perfect. Though we could not go inside the temple we have to satisfy ourselves with some pictures on the outside with lotus pond and the graceful temple entrace"
        }, 
        {
            "index": 65, 
            "rating": "3", 
            "review": "Pretty temple, but Starbucks??. An interesting temple in the heart of Ubud with an extensive lotus pond (that is pretty murky with trash in it). We were not dressed appropriately to go into the temple itself so I cannot comment on it. I suspect the sunset/evening time is a better time to view the pond and temple since the lotus flower will bloom then. And where WON'T you find a Starbucks?? Although it makes a good directional marker."
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "ONE OF LEMPAD LEGACY. The Kumuda Saraswati temple is one of buildings designed by I Gusti Nyoman Lempad, a famous Balinese style architect. The Lotus pond decoration in the temple entrance is very beautiful. The main temple itself is beautifully decorated with lovely carvings covered with gold leaf. Remember to put your sarong and sash when entering the temple."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Lovely Place for a Photo Op. Lovely Temple to stop and rest, have a coffee, take a photo. You need to wear a sarong if you enter. There is an outdoor cafe and Starbucks nearby to pause and take in the view."
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "Great Sunset View with Pond and Temple. Recommend shoot your photo at sunset time. Around 5-6pm. Its great that later you can directly see the show here at 7:30am.The light in the morning are from temple wall behind thus not really that attractive.The sunset however light up entire temple wall and beautiful reflection in lily pond in front. Iconic Ubud shot. Cannot miss."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Beautiful. A Temple you should not miss in Ubud! You cannot miss this Temple in the heart of Ubud and it is always worth it to stop in!"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "This is perhaps the most special temple in Ubud!. The day we visited it was a special day for Saraswati ceremony so did not feel as it was appropriate to intrude into the celebrations. But as you can visit this temple any other time I would recommend it and then sit in the restaurant at The Lotus Pond and enjoy the view."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "very nice temple to visit. just in the heart of Ubud central market surrounded by awesome resturants,one cannot miss to visit this temple."
        }, 
        {
            "index": 72, 
            "rating": "3", 
            "review": "Nice Temple at convenient Ubud location right next to a STARBUCKS!!!. This temple is in the heart (centre) of Ubud. Great for a photo shoot with reflecting pool. At night they have a traditional Balinese dance recital and temple provides an authentic background. Not sure if they actually allow you into the temple and but the entrance described above is quite spectacular."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Lovely. Very lovely temple to go and have a look at. Quite small but makes a great photo opportunity, just difficult to not have people in the way."
        }, 
        {
            "index": 74, 
            "rating": "3", 
            "review": "Nice for photography enthusiasts. A temple standing in front of a lotus pond. Great attraction right? Well sad to say this... nope. You can see better temples in Bali. The Lotus pond is vast. But water is disappointingly murky with just one bloom. And after all that you gt to see only the entrance door of the temple. That's it. In camera it looks good. So just go there if you want a good photoshoot. Otherwise really not worth it."
        }, 
        {
            "index": 75, 
            "rating": "3", 
            "review": "Seen many better on Bali. . disappointed . Really expected more after reading about the calm pink lilly pond infront of the temple, but not a bloom in sight! Just murky water with some rubbish floating and a sparse layer of lillies, broken pathways and overlooked by coffee shops. . Not calm.or peaceful at all. The temple itself was nothing special either. Seen many better in calmer more thought inspiring environments!"
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Free and good picture opportunity. Enter via the cafe lotus entry point off the main street close to kajeng street. It a great photo opportunity with the pond. Worth a quick stop and look around."
        }, 
        {
            "index": 77, 
            "rating": "3", 
            "review": "nice temple...one of many. The dance show in front of the temple is nice, and so is the temple itself. Not special, but nice to take some pictures while you're here anyway."
        }, 
        {
            "index": 78, 
            "rating": "3", 
            "review": "Nice, but not that special. One of the many nice temples on Bali, but not that special. Truth be told, I suppose it is a much better experience when the lotus flower at the ponds are still in bloom."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Even more beautiful in person . What more can I say but this is a beautiful temple!!!! IIts a must vist. It's even more amazing in person. There so much detail in everything here its almost a sensory overload! Great location right off of the mai road in Ubud. Bring a map or just remember the entrance us right next to the Lotus Cafe. We almost passed it!! If you've passed the Starbucks, you've gone too far.It's a quick tour at this temple, no more than 30 minutes of your time is needed here. We went during the slow season, but still surprised to see there weren't many people here.Also, no one was really enforcing the \"sarong\" rule here like at some other temple like \"Goa Gajah\". "
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Fantastic experience. May be difficult to get to the top with all the stairs, but well worth it in the end, unforgettable."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Beautiful temple which hosts excellent shows. Went for the temple at night to see the Ramayana Dance show. The temple is very beautiful and the show was excellent. Actors/Dancers were brilliant and the story of Ramayana was presented in a very unique way (compared to shows in India)."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Very beautiful. A small but beautiful tempel (front) in the center of Ubud, behind the Starbucks. You cannot go inside though."
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Peaceful, sacred, beautiful.. This was one of my favorite Temples in Bali. I felt connected to the divine. Peaceful water ponds, some steep areas but that doesn't detract at all. Excellent views driving to it!"
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "Lotus temple!!!. Nice photos you can take. Small area. Front portion occupied by a hotel. So you have to enter from side gate. Worth visiting for a photo session!!!"
        }, 
        {
            "index": 85, 
            "rating": "4", 
            "review": "Pretty lotus blossom. Waters from the temple at the rear of this site feed the pond in the front, which overflows with pretty lotus blossom. good view"
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Beautiful Temple provides quiet spot in middle of chaotic Ubud. Perfect place to step out of the busy streets of Ubud and soak up some serenity. This beautiful Temple is closed to visitors but the generously share the beautiful lily pads and peacefulness that surrounds it. There is a tea house/ restaurant that overlooks the water garden on one side and a Starbucks that you walk past on the other. A small gift shop allows you to purchase trinkets benefiting the Art Museum. This is definitely a place to stop for beautiful photos."
        }, 
        {
            "index": 87, 
            "rating": "3", 
            "review": "Close temple. On the positive side it is free. But then you do not get to see anything other than the lotus pond outside. I asked the guard outside when the temple is opened and it seems like it is usually not opened and is opened only privately during some occasions."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "A gem in the city.. A very very beautiful place in the middle of the Ubud. Reflection pools with lotuses inside provide beautiful photos."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "Nice. Very nice architecture and can be quite scenic late in the afternoon. This is right by the Starbucks in case you have trouble finding it."
        }, 
        {
            "index": 90, 
            "rating": "5", 
            "review": "Beautiful Temple. This beautiful temple is located in the Ubud Centre. It has many lotus flowers.It's great place to take a photo and enjoy starbuck coffee in front off this tample."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Too beautufil & centrally located!!. Centrally located.. Free admission.. Lovely balinese architecture.. Beautiful pond surrounding.. D temple.. Some souvenir l shops are there. But expensive... Closes early by around 630-7 . V just reached on time"
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Very Central. We didn't get to explore all of this temple as we ended up being pressed for time as traffic issues in and around Ubud on the Saturday that we visited reduced our time there.The temple is very centrally located, pretty close to the top end of Monkey Forest Road, unfortunately with a Starbucks stuck out the front of it.The entrance gates were probably among the best that we say in Bali and the lily pond is picture perfect."
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "Temple in the Heart of Ubud. Escape the bustle of Ubud and visit this serene sanctuary. The entrance is just past the lotus pond. The main door is closed. Dress appropriately and enter to the left."
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Free admission. while exploring Ubud it is good idea to visit this lovely temple. Beautiful lotus pond and decorated temple, should use Balinese sarong to enter ! I brought sarong by my own everywhere because as I know entering temple must wear it."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Old heritage site. This is one of the oldest hindu temples in Bali dedicated to goddess of learning, Saraswati. Its a beautiful structure and very well maintained, Inner sanctum is only available to worshippers, but nonetheless the temple is a must-see."
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Beautiful place. Had a caramel macchiato at the Starbucks in front of this temple around sunset. We had the best seat in the outdoor seating area with the view of the temple front and its surrounding lotus ponds. Simply amazing!"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Great Old Hindu temple. great looking old Saraswati temple, visit in the morning for taking picture and evening for traditional Balinese dance show. also visit Cafe Lotus for a relaxing Indonesian lunch"
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "easy to miss. WE just viewed this temple fromthe garden pools. It was a nice place to step away from the bustling streets. The Lotus Cafe was a great place to have a sip and relax with the view of this temple."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "One of the best in Ubud, must see. This is ancient temple in ubud.Very well kept, clean.There is a Starbucks cafe at the entrance, relax and have a coffee seeing over this beautiful temple."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "interesting picturesque. Guide took us here (4people) and was well worth iy, remember legs must be covered , locals will swarm you with Sarongs as soon as you pull up/ However they can be borrowed from temple. We spent around an hour here learning much about this Temple thanks to our tour guide, fascinating"
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Beautiful!!!. Ubud is filled with little temples all over the place, this one was an accidental discovery. It is so random because is next to a starbucks, and the view is very very beautiful!"
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Gorgeous & magical - if you can go inside (PLEASE respect local culture & rules). This is a magical little spot amongst the busiest area of Ubud, so unexpected but really gorgeous. I have been here for 5 weeks, driven by everyday, and had never even noticed it! I was blessed to be able to get inside the temple and spend an hour alone (except for a local groundskeeper). IMPORTANT: Do NOT attempt to go in to the main temple unless you have proper temple attire (for men and women this means long sleeve shirt (no, not a tank top) + traditional sarong with a sash, women hair pulled back, and do not go in if you are on your moon cycle). Also bring an offering (flowers & incense). Please respect local culture! If you are prepared to come in with this honoring and spiritual presence, you may be able to enter the main temple area. The entry as most pictures depict with the lotus pond is stunning and magical in and of itself though. What you see in the pics is everything if you can't go in the temple - the lotus pond area and front entry wall, which is a great place for pictures. Inside the temple, however, is absolutely stunning and very special, a place to be honored and connect with Saraswati. There is no fee to enter, and the Lotus Cafe that overlooks the pond is a great place to sit and soak it all in."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Prettiest temple in Ubud. This is definitely hands off the prettiest temple in Ubud with the lotus blooming and sun shining down on the temple. It is directly next to the Starbucks near Ubud Market and I missed it a few times as it is nicely tucked away. Definitely a must visit!"
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Very old and customs followed temple. Sree GNANA SARASWTI TEMPLE IS SITUATED AT ANANDBAGH, Hyderabad. It is old temple and very religious. It is situated on the road Sri Venkateswara swamy temple Malkajihiri and coco cola bottling co. MOULALI on the left side around 1.5kms. From Malkajihiri. Do visit"
        }, 
        {
            "index": 105, 
            "rating": "4", 
            "review": "What a water garden. Sitting here looking across the pond to the old temple is quite restful. Great photos, and well worth the visit."
        }, 
        {
            "index": 106, 
            "rating": "4", 
            "review": "Nice temple - but very limited grounds to explore. The Saraswati Temple is a beautiful Balinese Hindu temple, the likes of which can be found all over Bali and especially in and around Ubud.It's a beautiful layout with water ponds and lotus flowers everywhere.Entrance is free during the day and you can simply wander around.However, there is unfortunately not much to explore. the main courtyard is beautiful and good for pictures - but that's it.During evening time, there are traditional Balinese dance performances and the temple is beautifully lit up.My recommendation is to come during the evening for one of the shows (these are not for free). Much more of a cultural experience than just wandering the main courtyard for a picture..."
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "Peaceful. This is an open place, free for visitors to stop by. Unlike the more expensive and elaborate palaces and museums in Ubud, this is a place to just be without anybody hurrying you up or charging you for anything. Take pictures at leisure. Observe the beautiful details of the platforms, statues, trees and plants."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "Lotus blooms cluster. There is no entrance fee for Saraswati Temple and Ubud Palace which are not common in this bustle city. There is no need to enjoy either a coffee or a meal in Starbucks and Cafe Lotus, still you can have a full view of the beautiful lotus pond without a penny.When lotus blooms are in blossom,scents cloud everywhere. Besides, on its right side is Jalan Kajeng, a lane full of signatures on paving stones, instead it is a so-called \"Nobody Star Walk\"."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "Beautiful!. This temple is simply gorgeous. The doors, The statues, the water lilies, the moss, the trees. And its free! Get down there and have a look for yourself :)"
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Awe Inspiring. I am not very familiar with the Hindu religion but this was just jaw-dropping. We stayed at the Puri Saraswati bungalows, so we had ready access through the side doors, and dressed in sarongs to view the temple area. The music instruments are stored in the temple too, so a great opportunity to view them up close. What a triumph the statue of Goddess Saraswati is - towering and yet her attributes of art, music & knowledge seem quite accessible. Well worth venturing beyond the Lotus Pond!"
        }, 
        {
            "index": 111, 
            "rating": "4", 
            "review": "Grab a Starbucks and get the view. You can visit this place without needing to pay (quite refreshing to know since most places of interest - Obyek Wisata - in Ubud needs some entrance fees). You could dine at Cafe Lotus while enjoying the view of this temple or you could grab a coffee from Starbucks and do the same. Starbucks & Cafe Lotus share the same area. The Starbucks here seem to be cheaper than the Starbucks in Malaysia."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Beautiful temple in the hear of Ubud!. You must stop and have even a quick visit if you are in Ubud. One of the few temples open to the public. Remember to dress respectfully even if other tourists are not. Long skirts or sarong and shoulders covered. Nice lotus flowers out front. The Starbucks out front ruined it a tad for me but I suppose it makes it easy to find, though it's not hard at all."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "Take a dip!. I had someone to talk me through the purifying water ritual, which made it much more meaningful. Prepared to get wet!"
        }, 
        {
            "index": 114, 
            "rating": "4", 
            "review": "Pretty temple, no locals or entry I could see. The place is great for a quick stop. It is right near the Ubud Markets, Ubud Palace, just near Jl Monkey Forest and a number of key local attractions. Not as busy as the other temples nearby. Good for a quick 5-10 min visit. Near the Campuhan ridge walk to rice paddies too. There is literally a Starbucks at the entrance gate to this temple area. It is a strange blend of old and new; worship and commercialism; traditional and contemporary.The lotus garden on the pond is lovely. Temple looked intricate and interesting from the outside. I did not see anyone offering tours or entrance to the temple itself (it was around 2pm on a Tuesday), so you don't need to worry about covering up in a sari or sarong before you come here."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "Absolutely gorgeous temple. This temple is right next to a Starbucks; I would have never guessed that such an amazing beauty was there. The pond with the lotus flowers and the old stone architecture totally blew me away and left me amazed with it's jaw dropping beauty and serenity. Truly breathtaking. So much elegance and wonder. I went in the afternoon so did not manage to see or take part in any traditions, which according to a sign says you're allowed to as long as you're obeying and respecting their customs. Definitely drop by to check this great temple out when you're in Ubud town!"
        }, 
        {
            "index": 116, 
            "rating": "5", 
            "review": "What a find!. I was going for a dose of caffeine at Starbucks and found this! The cafe is located right besides the temple, what a location. This temple is really beautiful and takes little time to visit. It is peaceful and its calmness provides a great moment of reflection."
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "One-place enjoyment in town center. Please mention \"Lotus\" if you are asking local for direction to this beautiful place as our local guide also got confused when we just say \"Puri Saraswati\". Upon asking around a few times, finally we managed to find it and our guide laugh it loud as he actually knows and familiar with the \"lotus\" temple. Combination of holistic temple, spectacular lotus pond, great food and mesmerizing traditional dance all in one place. Really worth it!!"
        }, 
        {
            "index": 118, 
            "rating": "4", 
            "review": "An exceptionally beautiful temple!. We thought the temple was very scenic. We visited just when they were setting up the dance stage. (which takes place most evenings from 7:30 to 8:30pm). the lotus pond and the temple all reflected the twilight light and indeed made for a very pleasant view."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "Beautiful holy place and cultural site. A mix of worshippers, tourists like me who came to see a gorgeous temple and site, and mostly younger tourists who participate in bathing in the holy healing waters."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Very peaceful. Lovely temple in the centre of town.. The lotus ponds are delightful and the temple guardians particularly fierce. The cafe is a great spot for coffee or a cold drink."
        }, 
        {
            "index": 121, 
            "rating": "4", 
            "review": "very pretty temple. This is one of the few temples open to tourists, and it's quite big and very pretty. Before you enter the main temple there's a sign saying how to behave - please do read it, I was disappointed to see that not all visitors respected the request to put on a sarong even though they are available for loan for free!The sign also has guidelines for behaviour if you join in a ceremony, but it didn't say how to find out when ceremonies are on - maybe there's a website (though there isn't one linked to the Trip Advisor page), or maybe a hotel concierge might know? Unfortunately I didn't have time to find out.Adjoining this temple is a lovely cafe where you can enjoy the lotus pond over a drink :)"
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Do not miss this sight!. Wow, how well preserved! It really is worth a visit in gives you good insight into the Indonesian culture and believes. Very pretty!"
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Beautiful place.. Very peace full and full of culture. I saw people worshiping and found that was the most beautiful things. They were busy in their own world."
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Beautiful Temple and close to the Rice Fields. I Love Lotus flowers so when I found this temple on trip advisor I had to go. Unfortunately March is not the perfect time of the year because there are not many lotus it s not they're time. But it s a beautiful Temple anyway. And also it s a good point to start if you want to walk to Rice Fields, just continue the street of the temple going up and you make a nice walk until the rice fields and then just enjoy the locals and all the beautiful green"
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Beautiful Balinese temple in downtown Ubud. Well worth the visit just to see the intricate Balinese architecture and lotus pond. Was fortunate enough to catch a formal ceremony at Saraswati during my stay November 2015."
        }, 
        {
            "index": 126, 
            "rating": "5", 
            "review": "Great view from Starbucks Ubud. Please go to Ubud Starbucks at sunset, grab a drink and set on the tables outside to enjoy this unforgettable view, there is night performance but I didn't attend it"
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Experience Balinese Culture. Sarawati Temple is easily reached from the centre of Ubud, between Starbucks and the lovely Lotus Cafe. The temple buildings are the work of fine craftsman and intricately ornate. You can watch Balinese dancing and even have a lesson if you desire."
        }, 
        {
            "index": 128, 
            "rating": "4", 
            "review": "Peaceful place!. This is a nice and peaceful place, there is a lot of tourists there but still very nice to spend few hours there and take pictures. The visit is great and you have access to most of the \"rooms\" in that temple."
        }, 
        {
            "index": 129, 
            "rating": "4", 
            "review": "When in Ubud, be sure to visit.. This temple is picture perfect, especially the lotus pond and the central path leading to the temple itself. Also, the restaurant in front of the temple is really nice to eat. The food is average, but the location more than makes up for that."
        }, 
        {
            "index": 130, 
            "rating": "4", 
            "review": "A very nice Temple with Beautiful Lotus ponds. It is a very nice temple Located Downtown Ubud. when you are having a walk, pass by you will have very nice photos.The temple has a beautiful Lotus Pond that you will absolutely iconic :)"
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "A beautiful temple by day, the perfect backdrop for performances by night. I was fortunate to have an opportunity to visit the Saraswati Temple twice – once during the day, and once at night for a dance show.During the day the Saraswati Temple is one of Ubud's most picturesque places of worship, with a large lotus pond that makes for beautiful photos (if nobody is standing in the way and taking endless selfies, that is!).At night the temple becomes an atmospheric stage for traditional Balinese dance performances, but be careful as you take your seat as it can be hard to see where the walkway ends and the pond begins in the harsh glare of the stage lights!The cafe that sits alongside Saraswati Temple is pretty expensive, but the food we had was good and the view across the lotus pond was relaxing and peaceful."
        }, 
        {
            "index": 132, 
            "rating": "4", 
            "review": "Scenic, lotus pond, kecak dance, iconic highlights of Ubud. A temple of worship to goddess Sarasvati at downtown Ubud. A scenic stage and gate / gapuras behind a large lotus pond which makes it an iconic highlight of Ubud. At night, Kecak dance performance with light beams is held on the stage. In front of the temple is Café Lotus, and starbucks. A huge tree, probably Banyan tree, and a corridor of orchids on the sides of the temple. A good place for taking photographs, but since the place is at the center of Ubud town, can be very crowded and feels too touristy although the stone carvings are authentic and ancient."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "Beautiful Temple in Downtown Ubud. We had late lunch in the Lotus Restaurant with direct view to this temple. It's beautifully stood overlooking the lotus pond. It's location is right in the downtown Ubud, close to the Ubud Market."
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "Beautiful!!. Lovely place , can not remember how we got but charming , only drawback is the amount of tourists there ."
        }, 
        {
            "index": 135, 
            "rating": "3", 
            "review": "It was okay. It's located behind Lotus Cafe and Starbucks. It's a small temple with lotus pond inside. I wasn't lucky because when I got here the lotus flowers are dead. It's free to enter, but I was asked for a donation. There was a box to collect donation so I put my money there. A small amount of money should be fine. Don't forget to wear sarong before you enter the temple. Not so many things to do here. It only takes 5 to 10 minutes to walk around. And not many interesting objects if you want to get pictures."
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "Lovely. Nice little temple with a lovely pond full of lotus flowers worth a visit and it's FREE . You must wear a sarong before you enter men and woman."
        }, 
        {
            "index": 137, 
            "rating": "4", 
            "review": "Lily pads!!. Loved coming to Saraswati Temple. The pond on the way to the archway is filled with lily pads and if you are lucky you'll get a chance to see flowers blooming. The temple is rather small and there are sarongs available for you to wear. On the way out you walk past the restaurants which is a bit weird."
        }, 
        {
            "index": 138, 
            "rating": "5", 
            "review": "Very beautiful. In the middle of Ubud next to the Lotus cafe and the Starbucks. View it from Lotus though or just visit on foot. Very beautiful and tranquil area. There was a ceremony going on when I was there which was great to see. It's right in the heart of town so it's really easy to see."
        }, 
        {
            "index": 139, 
            "rating": "5", 
            "review": "Beautiful lotus pond. We visited during the evening when there were very few other people. It has a beautiful lotus pond and a golden arch at the entrance. Very peaceful."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "Most photogenic lotus pond!. If you're strolling down Ubud's Jalan Raya (main road), you might miss this temple and its fabulous pond as it's tucked away behind Cafe Lotus. But tuck in for a visit; either daytime, for a daytime close-up of the spacious lotus pond, or at night, when the temple's front terrace transforms into a stage for evening dance performances. Either way, it's a gem not to be missed."
        }, 
        {
            "index": 141, 
            "rating": "3", 
            "review": "Not vey sacred.. The temple is beautiful for taking one or two pictures. However, unlike other temples in Ubud, you enter Saraswati through a Starbucks and it doesn´t look very sacred anymore. Its nice if you´re walking around and find it, I wouldn´t waste my time looking for this. Not much to see and walk around."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Close to Ubud Palace, great view and pond. It's close to the Ubud Palace, there is great view and water lily pond. An Indonesian styled Starbucks and Cafe Lotus are just at the entrance."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Beautiful Temple. A temple dedicated to the Hindu goddess of art. I love all the temples in Bali so can't say anything other than gorgeous. This one has lotus flower ponds in front if it. Theres no entry fee and its kind of hiding between Starbucks and the Lotus Cafe. I dont think you can go in apart from special ceremonies but theres enough to see from the outside. Go in the morning, less people, better pictures!"
        }, 
        {
            "index": 144, 
            "rating": "3", 
            "review": "Quick pit stop. This place is a quick pit stop to enjoy the view and to replenish yourself with some nice cold soothing drinks from Starbuck's which is just besides the temple"
        }, 
        {
            "index": 145, 
            "rating": "5", 
            "review": "Temples are wonderful. All the temples in Bali have a beauty and this one does as well. You can feel the calm and serenity of this peaceful place."
        }, 
        {
            "index": 146, 
            "rating": "3", 
            "review": "interesting place.... temple in the heart of ubud...at night balinese dancing shows...many ppl watching from Lotus restaurant..."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "beautiful site right in Ubud. The serenity and beauty of this place is so uniquely Bali. It is located right in the centre of town and almost across the street from the market , so it's very easy to locate."
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "Lovely spot to escape bustle for 15 mins of calm. Not able to go inside temple but beautiful exterior and lily pond. Have a coffee in cafe next door...but seriously why would you go into the Starbucks on the other side..just wrong."
        }, 
        {
            "index": 149, 
            "rating": "4", 
            "review": "Great view , but only for a 10 minute visit!. Please note , this attraction is only a scenic stop for photographs and nothing else. You cant enter the temple , so really the only thing you can do is stand outside take a couple of photos and leave. If you are planning your trip , you only need to allot this place 10 - 15 minutes of your time. So dont bank on this being a full day activity. Besides that it is very scenic and lovely."
        }, 
        {
            "index": 150, 
            "rating": "4", 
            "review": "Beautiful exterior but couldn't go inside the temple. If you're in Ubud, stopping by the Saraswati Temple is worth it, but I would not make the trip to Ubud just for it. You can walk around the front of the temple and see the amazing lotus flower pond, but we were unable to go inside the temple - doors were shut and no-one was around. Unsure if it was because of the particular day we visited, or whether you can enter at all. Overall its worth a look if you're in the area."
        }, 
        {
            "index": 151, 
            "rating": "4", 
            "review": "Calm and serene . Beautiful temple with a stunning lily pond, truly an oasis of calm from the bustling traffic of Ubud. The temple itself was closed on my visit but it was still worth a visit."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Really nice temple and lotus pond. Just walk in and enjoy the beautiful lotus pond in front of the temple. You cannot really go inside the temple itself but it is conveniently located in the center of Ubud, so why not take a 10-15 minutes stopover and enjoy it for yourself;)"
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Beautiful temple in Ubud . If you are looking for some beautiful temple photos, check this place out. It is right off the street so not a far hike or drive at all. To get to it you have to go through a small entry way between the Starbucks and a cafe. We didn't see any signs for it, we had to ask the locals. It was closed when we arrived but it was beautiful so worth the visit!"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "A beautiful temple in the heart of Ubud. It was a pleasure to visit the Saraswati Temple of Ubud. As one of the most sacred temples in the region it was avert solemn location and somewhere that was to be respected. It's important to cover up as a sign of respect to the Gods. Not as busy as I expected, which made the experience a lot more spiritual."
        }, 
        {
            "index": 155, 
            "rating": "4", 
            "review": "Beautiful water palace. For some it may be a bit hard to differentiate between a Balinese temple (pura) and palace (puri). I think this is a palace, or water palace to be more specific. It is really a wonderful experienc if you have a chance to watch evening dance performances in the court yard and have dinner at the adjacent restaurant and coffee shop"
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "Nice temple with not so nice neighbours. The temple grounds were just amazing to walk through on the way out which led us through some villas on the right side of the temple (not the Starbucks side) we saw a beautiful white dog in a small cage who looked just miserable. That kind of spoiled this experience."
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "STUNNING TEMPLE PERFORMANCE STAGE. While the Saraswati Temple is a fully functioning Hindu temple, most tourists will only experience the facade which has a beautiful performing stage behind the famous Lotus Restaurant. Performances almost every night of the week give lots of options."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "Beautiful temple with lotus pond, nice spot for photo. This temple is located in centre of Ubud, behind Starbuck cafe Ubud. This is a place to do praying for Balinese Hindu and Saraswati Temple Ubud is one of them. As it is named, this temple is to worship Goddess Saraswati (Goddess of knowledge).Saraswati temple has a bit difference from other temples in Bali. This temple has water pond where there are many lotus flowers grow, the pond is the main attraction of Taman Saraswati temple.If you like to see Ubud Bali art carving, here is the place to see it. Almost every building in the temple has the touch of art carving from Ubud artists.When you are on holiday in Bali and plan to watch Ubud Kecak dance in Taman Saraswati Temple, it is better to know the schedule of the dance performance in that temple first. Because the dance performance at Saraswati Temple Ubud not held everyday."
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "Great Photo Opportunity . It's quite beautiful but small and difficult to get to, as there is little parking available due to the streets being so busy."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Beautiful. You can spend fifteen minutes in this place, take some good shots, and move on. Or you can spend an hour if you find a shady spot, and watch visitors express their own admiration for this place. Nightly Balinese dances are a treat."
        }, 
        {
            "index": 161, 
            "rating": "4", 
            "review": "Beautiful island of oasis in Ubud. Fantastic little temple in the middle of Ubud. Great place for photo ops. There's also a few cafes and restaurants nearby that have a view of the temple, so one can sip some coffee while admiring the architecture of this quaint temple."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Beautiful temple and ponds, friendly staff. We enjoyed this temple and its grounds. We paid about $6 for the 4 of us to go inside, and they dressed us all in traditional sarongs (including the kids). The staff inside were working on making a large animal for a temple procession and stopped to talk to our kids about it. One made my daughter a bouquet of flowers. In an unexpected bonus, they took photos of us in our garb and printed a large photo on the spot for us to take. Great cultural experience!"
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Best view on it from Lotus cafe. Nice temple. If you know one, you know the others. That's why: If you are bored of temples, just sit in the Lotus Cafe on mainstreet, have a cup of coffee (really good, best I found in 7 nights in Ubud) and enjoy the view of the temple portal. If you want to go in, do not forget the sarong and temple scarf."
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "Great vibes of a spiritual presence !. A compact layput with an outstanding image of Goddess Saraswati! A garden full of orchids and shade."
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "Best to check it early in the morning. This temple is located just behind the Cafe Lotus or to the Saraswati Bungalows and opens early in the morning (walk through the bungalows into the temple). You will be required to put on a batik (the bali wrap skirt everybody uses in temples) which is free to those wishing to visit the temple.The first thing it comes to mind is how peaceful this place is, specially when you manage to avoid all the visitors and, even if you don't, the temple is hidden by other stuff around getting you off track from coming here at times.Between the water lilies, orchids and the frangipani flowers the aroma around you is extremely pleasant and relaxing.The temple has two main sections, the outer garden (the one with the water lilies) in which you can walk freely without having to wear the batik and the inner temple displaying the orchids, frangipani trees and statues. In here you are required to wear a batik, well worth wearing it even on the hottest days to take a look at this temple, is beautiful."
        }, 
        {
            "index": 166, 
            "rating": "4", 
            "review": "Peaceful!. The temples in Bali are beautiful and peaceful. Feels almost like a meditation place. The place is surrounded by trees and magnificent architecture"
        }, 
        {
            "index": 167, 
            "rating": "4", 
            "review": "Great dance performance. It was very good place to take a picture and watch the balinese dance at afternoon. The place is very unique and beautiful."
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "Hidden Gem!. This temple is located bang on the Ubud shopping street. You might not notice it from outside, however if you walk into the Starbucks or the Lotus Cafe on the street, you will be able to enjoy the view of the temple from their interior. The temple has a beautiful lotus pond in front of it. When we went there, there were no lotus in bloom, but I can image now beautiful it will look during the full bloom season. You cant go inside the temple to see Goddess Saraswati, however it is still worth a visit if you are already in that area."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "Go with a Guide. I really had the time to learn and explore more of Balinese Hinduism with my driver/ guide, Mr. Nyoman Jiwa. The temple is often in use and the day I was there a very large family attended."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Gorgeous photos even if it is next to a Starbucks. The temple itself is gorgeous, but it was a bit disappointing having a Starbucks right next door. The temple stands out over others because of the water garden element."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "A Temple worth visiting. It is an old temple built in the Balinese tradition and architecture, with multiple scaring statues (to keep the bad spirits away ??) and with lots of flowers and ponds."
        }, 
        {
            "index": 172, 
            "rating": "4", 
            "review": "Beautifull, center of Ubud. Most beautifull temple in Ubud, in the centre of the town. At night will be dance performance. Entrance fee for the show 8 $. Next to the temple is a restaurant and a starbucks."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Beautiful Temple with Lotus Garden. My boy friend and I had a short walk around Ubud and found this beautiful temple on the side of main street of Ubud. I walk inside and found there are hundreds of Lotus flower which is very beautiful. The entrance is free but unfortunately I can't enter the inner part of it, it's limited to worship only."
        }, 
        {
            "index": 174, 
            "rating": "4", 
            "review": "PURA TAMAN SARASWATI, UBUD, BALI. This is a temple dedicated to the Hindu deity of learning, literature and art, Goddess Saraswati. The beautiful lotus pond adds to the charm of the holy temple, which is decorated with many fine carvings. The shrine contains giant masks, and statues of Goddess Saraswati ."
        }, 
        {
            "index": 175, 
            "rating": "4", 
            "review": "Peaceful, healing, history.... Peaceful, tranquil, healing and full of history. This is a must visit temple...assuming thats your thing. Sarong needed and can be hired if one isn't already carrying one on them."
        }, 
        {
            "index": 176, 
            "rating": "4", 
            "review": "Beautiful Temple. We were not there at a time when you could go behind the temple to watch a ceremony, but the outer gardens and grounds were beautiful!"
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Wonderful temple. the temple is in the heart of Ubud next to a starbucks coffee. It is really lovely and all the sea roses are so beautiful. But you have to know that you only can enter the temple if you are an hindu. But the place in front of the temple is really nice"
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "Mesmerizing Hidden Gem. It's another hidden gem as we were astounded to walk into this temple when we try to get our cuppa at Starbucks Ubud. The view was simply amazing and we managed to grab few nice photos though we didn't enter as the temple."
        }, 
        {
            "index": 179, 
            "rating": "4", 
            "review": "Photogenic temple, worth visiting. The first thing to point out is that this is not a palace, nor a water palace, it is a Hindu temple! It's proper title is Pura Taman Kemuda Saraswati, or Pura Taman Saraswati. \"Taman\" means garden, refering to the water lilies, and Saraswati is a Hindu goddess. There is a palace in Ubud by the way (it is called Puri Saren Agung), but there are no water gardens there.Most people wome to visit the water gardens in front of the temple. Its a pretty spot, and great for photos if not too crowded. You do not need to wear a sarong and sash to enter the gardens.The temple itself is small but also quite pretty. To enter the actual temple, you do need to wear a sarong and sash (or when ceremonies are taking place, full traditional Balinese dress).There are nightly balinese dance shows in front of the temple, behind the water lily ponds."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Beautiful setting. This temple is located in beautiful setting with manicured gardens. A perfect place to relax and enjoy Balinese art and sculpture. Sadly the water level of the lake was very low when we visited but glad we saw this place."
        }, 
        {
            "index": 181, 
            "rating": "2", 
            "review": "Not much to see. Stayed in Ubud for 2 days. Went to have a look at the water palace (Saraswati). Literally what you see on the pictures is all there is..a little pond on either side of a walk way leading down to a temple and a little open stage area where dances are performed. It's pretty and the detailing on the building very intricate as with all Balinese temples etc but it takes no more than 5 minutes to look at! It's free at least and worth a look if you pass by on the street but not worth going out of your way for."
        }, 
        {
            "index": 182, 
            "rating": "4", 
            "review": "Nice. Very peaceful and spiritual place. Good for photos. Free entry is a plus. You can just pass by it , no need to go there specifically ."
        }, 
        {
            "index": 183, 
            "rating": "4", 
            "review": "the Lotus flowers were the main attraction.. The temple is shut off from the public but the lotus flowers were pretty. Nice cafe overlooking the area."
        }, 
        {
            "index": 184, 
            "rating": "4", 
            "review": "Pretty to see - can't go in. We couldn't go in (or at least couldn't figure out how to) but it's pretty to see the front of. It's right off the main street in Ubud so you'll probably pass by it."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Beautiful garden. Very quiet and beautiful garden, and tempel behind it. Most people only visit the lotuspool, but the tempel behind it is well worth visiting."
        }, 
        {
            "index": 186, 
            "rating": "4", 
            "review": "Surprising . Very nice temple hidden in Ubud. On the front we are welcomed by a large lotus lake. On sides there are trees. Good idea for a hot visit"
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Blossoming beauty and ancient wisdom. Being on the other side of the world, I recall this place all the time while meditating, relaxing or in need of more internal power. I don't think someone coming to Ubud can miss this beautiful temple, which is special even in such a culture-reach island as Bali."
        }, 
        {
            "index": 188, 
            "rating": "3", 
            "review": "For photos, yes. Nice place for photos. Need not go specially. Nothing much to offer. Free entry is positive. Need not wear sarong to this temple."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "worth the stop. Our last temple, what a nice end to our travel. It's small and cute, hidden next to a starbucks. The lotus pond in front is totally charming. One of our favourites."
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "Beautiful specially if you're lucky enough to find it empty.. We visited it and were the only ones present when doing so. No one was even in the restaurant at the entrance and the Starbucks appeared to be closed. It's very hard to miss, specially for being so close to the Ubud market. The place is absolutely stunning when empty. Apart from us there was only a local cleaning the gardens to the left. We stayed for a while, took a few pictures and were completely transported. Would love to go inside and watch a ceremony but it was closed at this time. There was a bit of trash (water bottles) near the door, which was a shame..so please people drink all the water you want but do not leave your trash behind. This is supposed to be a holy place. Have respect. Visit earlier in the morning as you might be lucky and miss the crowds. As we were leaving a big group of 30 people appeared and the place was truly transformed. Visit when empty if you have the chance."
        }, 
        {
            "index": 191, 
            "rating": "5", 
            "review": "beautiful!. best time to visit this temple is during sunset. the pictures will turn out oh-so-pretty! and there's a starbucks right next door literally"
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Nice!. Easy access from the main road in Ubud (just between the famous Lotus Café and Starbucks). The temple looks pretty nice. We had luck and saw a dance show there."
        }, 
        {
            "index": 193, 
            "rating": "4", 
            "review": "Pretty and Quiet Spot. A pretty and quiet place to wander off the busy main street. Hundreds of beautiful lotus plants. Very hot and exposed to sun. Some rubbish in the temple pools which was a bit ugly to see."
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "Beautiful ornate temple with regular dance shows, du. Lovely ornate temple with beautiful lotus ponds surrounding the grounds. Regular dance performances which required a paid ticket available on the gate. We chanced upon a dance school where lots of local girls were perfecting their routine, wonderful to watch and see the future dancers. It was free too."
        }, 
        {
            "index": 195, 
            "rating": "3", 
            "review": "Beautiful temple, lots of people. This is the classic Balinese temple associated with Ubud. It is in the centre of town, is free to enter, and shares the same grounds as Cafe Lotus, whose tables look out over its lotus ponds. It makes for some very lovely photos if you can time them well between the crowds. It isn't large, and it doesn't seem possible to enter the temple itself, but a walk around the front and the ponds is still very beautiful. There are Balinese dances here at night, and a discreetly hidden Starbucks at the entrance to the grounds off the street."
        }, 
        {
            "index": 196, 
            "rating": "4", 
            "review": "Charming temple. This temple is right beside a starbucks cafe in Ubud. You do not have to pay if you just want to walk outside the temple which in my opinion was good enough. The temple is really pretty with a lotus flower pond in front of it."
        }, 
        {
            "index": 197, 
            "rating": "3", 
            "review": "Balinese temple with a big lotus pond. What makes this temple unique than other balinese temples was that there is a big lotus pond in front of the temple. Nothing much other than that, unless you are a worshipper."
        }, 
        {
            "index": 198, 
            "rating": "4", 
            "review": "serenity amidst chaos. Situated in the middle of ubud market, its a surprise.. a small place .enchanting with lotus gardens &the magnificent balinese architecture ..the 3rd best attraction in bali."
        }, 
        {
            "index": 199, 
            "rating": "5", 
            "review": "Excellent and MORE!. This was perhaps one of my best Ubud experiences. This place seems out of a book. It is beautiful beyond words. The entry is unassuming sorts, you enter and whoa! There is a lovely symmetrical temple - with a lotus pond in front. The Lotus café is here, so you can enjoy the unparalleled view from the café while catching some grub. There are timings for the temple but I happened to visit during an off time. The place was seemingly shut, but one of the doors being slightly ajar, a few people couldn't help but give in to their curiosity at this marvel. The complex inside is adorned with lovely majestic sculptures. It is very very quiet. And a deep sense of calm comes over you. Loved this place so much!Absolutely cannot miss this one!"
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "If You Love Temples.... Very photogenic. Keep your shoes on. Easy to walk around and have a good look. Drink in the atmosphere."
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "Nice temple with pretty lotus pond. Visited here and went and had a look around the temple. As normal you have to wear a sarong and sash around your waist but these are provided. Beautiful temple and the surrounding lotus pond also looked very pretty."
        }, 
        {
            "index": 202, 
            "rating": "5", 
            "review": "Definitely worth a visit. Small temple, mostly view from the outside.\nEnsure you have appropriate dress for further exploration (covered shoulders and knees).\nPhotos outside of water lily are amazing!\nGive yourself an hour to check it out."
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Great for pictures!. Very traditional style, very beautiful garden and lake. It was amazing, during the nightfall! If you have chance, go and see it :)"
        }, 
        {
            "index": 204, 
            "rating": "4", 
            "review": "lovley from the outside. Like most temples in Bali, this one is inaccessible inside. You can walk around the grounds, but you can't go in. The grounds are lovely, and there is a dance performance there in the evening."
        }, 
        {
            "index": 205, 
            "rating": "4", 
            "review": "Nice temple. This was my first experiense in Ubud. Had dinner at Lotus Cafe and sat there watching the temple. They had traditional dance and music later on and i bought a ticket. The temple looks fantastic in the darkness but the dance was not my cup of tea. More cultivated people will probably love it :)"
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Beautiful temple dedicated to goddess of wisdom.. It is short walk from monkey forest. There is statue of Goddess saraswati inside the temple and its impressive.There are also regular dance performances in night."
        }, 
        {
            "index": 207, 
            "rating": "3", 
            "review": "Average view. I read about this place, just behind Starbucks and came across it by chance. There is a nice pond and architecture, but nothing much else. We couldn't enter the temple. Maybe it would have been better to go at night, other people say it would be lit up."
        }, 
        {
            "index": 208, 
            "rating": "4", 
            "review": "beautiful ponds. I stayed next door in the bungalows and was able to access the temple without the crowds, it is very nice and peaceful early in the morning and when the lotus flowers are just out it is good for photos, the traditional performances are good to watch and the restaurant in front has fine food."
        }, 
        {
            "index": 209, 
            "rating": "5", 
            "review": "Beautiful oasis. Turn off the busy main road at the Starbucks to find this enchanting setting. You can't hear the hustle and bustle of the main road at all, very peaceful even with the soft cutlery sounds from diners at the neighbouring restaurant.\nWent at night around 10pm and we were the only people there so could sit and appreciate the surrounding."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "A quiet temple in the middle of a bustling street. The temple is situated in the heart of Ubud Central area that is bustling with tourists. Flanked by a Starbucks on one side and Café Lotus on the other, the main temple is extremely quiet and is maintained very well. There is an entry fee (IDR 30,000/person) and a Sarong is provided for each visitor for free if cost which needs to be returned after the temple visit (it's mandatory to wear Sarongs to a temple). A free photo (with print) is included in the price of the ticket. The temple closes around 5 P.M. Hence, plan you visit accordingly."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "Very Pretty!. Very pretty. Be sure to come at night when it is all lit up! Enjoy a lunch at the restaurant while overlooking the koi pond. There is also a starbucks right next store for some caffeine to keep exploring!"
        }, 
        {
            "index": 212, 
            "rating": "4", 
            "review": "Beautiful temple. Stumbled upon this beautiful temple while walking in the city of Ubud. Worth taking a look at. There was a restaurant next door as well which looked like a nice place for lunch."
        }, 
        {
            "index": 213, 
            "rating": "4", 
            "review": "Nice Escape From Ubud's Streets. A very photogenic courtyard with two large pools covered with waterlillys and lotus flowers as well as a large temple at the far end. Doesn't take very long to explore but it is a nice green and calm escape from the busy streets of Ubud. Would probably visit again."
        }, 
        {
            "index": 214, 
            "rating": "4", 
            "review": "hidden gem. great temple to visit surrounded by beautiful lilies and lotus flowers, you will need to either hire a sarong or ensure you have one with you to enter"
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "beautiful lily pond and temple. a good change to see lily ponds ... temple behind is really beautiful, and relaxing to just roam about. No hassling.\nEntrance is between Starbucks and Cafe Lotus."
        }, 
        {
            "index": 216, 
            "rating": "3", 
            "review": "Nice place to spend a lazy day. drive from kuta will take 2hrs, along the way will find the real life of Balinese. all those beautiful tiny house and rice field. get a good tour guide if you are not driving or biking.the place need a little sums of RP to enter and you will be amaze by the culture of Balinese. a lot of nice food stall or restaurants along the way. the temple is beautiful by the lake of the volcanic top."
        }, 
        {
            "index": 217, 
            "rating": "3", 
            "review": "Great Photo Opt!. Beautiful on the outside for photos etc. Inside like many other temples. Signs not posted well as to admitting, on the day we wnet we were not supposed to be inside and therefore got kicked out, but there was no sign saying this any where. Many other visitors showed up to go in and were turned away.Best for outside photos and great gelato place near by to enjoy and just take in the beauty"
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "Lovely temple. A lovely place to visit for the view but the Lotus cafe does not do great food.The temple is lovely and has a relaxed atmosphere."
        }, 
        {
            "index": 219, 
            "rating": "5", 
            "review": "Beautiful. Beautiful temple with night time music, it is centrally located so you can easily pop in on your way"
        }, 
        {
            "index": 220, 
            "rating": "5", 
            "review": "Lotus with the temple and Free!. Located in the Ubud Centre.Seraswati temple is no entrance fee and beautiful with Bali Temple and many many Lotus. It's great place to take a snap and enjoy starbuck coffee."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Nice Temple. Nice place to visit, a very unique characteristic temple with lotus pond. Do not miss the Balinese performance which will perform everyday at 7.30 pm. (80.000 IDR)"
        }, 
        {
            "index": 222, 
            "rating": "4", 
            "review": "Nice. When I went there is dry season. But still some lotus flower blossom. Right in the middle of the city. Ask around cuz you can easily miss it. Right behind Starbucks."
        }, 
        {
            "index": 223, 
            "rating": "5", 
            "review": "ohm.... Very lovely and amazing tample. Every single corner very beautiful there. Harika! The lotus make this tample look more pretty. I wanna bring 1 to my home... is it possible? :D"
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "Beautiful temple with lotus. Worth checking out if in Ubud as it already is in a central location. At night time they have dance performances"
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Nice. We found this close, but that was ok for us to see it just from the outside. Worth a visit, as it's in a busy nice area and will only take 10 minutes to see from outside."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Lovely Temple..... We visited Saraswati Temple on early Sept morning with our family. It was a very lovely temple with lotus ponds at both sides of the temple entrance. The beauty is very captivating and mind blowing....one look and one get mesmerised by the whole temple architecture.The entrance was grand...we bought tickets to enter and had to wear sarong despite wearing long pants. The Saraswati goddess statue was gorgeous to look at.The temple is small inside and only 15 minutes or so needed to visit this temple. Its near the main Ubud centre and one cant miss it. Next to it is Brahma temple. The staffs took our family photos inside and at the main entrance for nearly 2 USD each. We were 15 of us and so the photos turned out as a memorable one especially the effect of the temple architecture itself. It was a lovely temple indeed."
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "A peaceful little oasis in the centre of busy Ubud. This is a lovely little spot to sit in, away from the hustle and bustle outside. The water lily ponds are delightful. There is a restaurant and a temple that is not open to the public. You can sometimes see a wedding taking place in the wonderful grounds, and it is a popular forum for evening dance events. It is owned by the royal family, who still live here, we understand. There is no charge for entry."
        }, 
        {
            "index": 228, 
            "rating": "4", 
            "review": "Beautiful for photographs but costly to enter the temple. Stunning view and well-known as a good spot for taking pictures. There's also a restaurant at the entrance where you can have lunch while enjoying the view of the lotus pond and the temple. I was told that it was a royal temple, so it's a bit costly to enter the inside of the temple. It was Rp 60,000/person as I remember but I didn't get in.However, do stop by to pose and take good pics with the temple when you're in Ubud!"
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Beautiful temple & evening Balinese dance. This was an amazing cultural experience. The dancers and the story they were telling was incredible. I was mesmerized the whole time. They work so hard and the musicians were incredibly skilled as well. WORTH seeing for sure!!!"
        }, 
        {
            "index": 230, 
            "rating": "4", 
            "review": "Water-lily ponds. No cover charge, its like a park you just walk in and take in all the water-lily ponds that surrounds you."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Spectacular Temple. Right on the main street, worth a visit to see the lotus pond and the temple which graces the entire area. There is a café right next to it in case you want to make this a little stop from tourism."
        }, 
        {
            "index": 232, 
            "rating": "4", 
            "review": "Very beautifull and for free!. It looks great, it's in the middle of Ubud and it is free! It is a short visit but will give you a couple of fantastic pictures!"
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "Beautiful setting. Set behind the lotus ponds the temple has stunning architecture and is lovely to sit and chill away from the bustle of Ubud Main Street."
        }, 
        {
            "index": 234, 
            "rating": "5", 
            "review": "Temples. I never tire of looking at the temples, they are all so amazing and magical. I love the history behind them and enjoy the building of these magnificent structures. Nothing like this in Australia, all hand carved."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Beautiful little temple. The temple is close to the heart of Ubud and it's very small. You don't need more than 15 minutes to visit so don't miss it !"
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "A must see when in Ubud. Nested in the centre of Ubud, the lotus ponds in front of the temple are a surreal frame to this temple. I would suggest a double visit: one in the morning to take in the beauty of the place alone, and one in the late afternoon, especially if there is a dance show. The set and the dance choreography are breathtaking!"
        }, 
        {
            "index": 237, 
            "rating": "4", 
            "review": "Beautiful temple. Its a beautiful temple. Not too far from the main area. Not too crowded. So in all, a good \"to do\" for a cultural insight."
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "Wonderful place for lunch. This temple is closed but the lotus water garden in front is delightful and the lotus cafe is a special place for lunch."
        }, 
        {
            "index": 239, 
            "rating": "4", 
            "review": "Nice temple with reflections in the ponds. Beautiful temple with serene ponds in the centre of Ubud not far from the museum. We ambled about it and rested in the shade and just took in the atmosphere. Certainly worth a visit as you head down the main street in Ubud"
        }, 
        {
            "index": 240, 
            "rating": "4", 
            "review": "Ubud Lotus temple. The temple located behide Lotus cafe. There is the lotus pool in front of the temple. The temple is small but the lotus pool scenery made it so beautiful view. There is a Bali performance in front of the temple in every evening but have to pay for ticket."
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Must see in Ubud. Very nice temple with beautiful ponds with lotus flowers at the entrance! The cafe lotus next door has a view on the temple. Some dance performances are also located here."
        }, 
        {
            "index": 242, 
            "rating": "3", 
            "review": "disappointed. Another closed temple, one of many in Ubud. Disappointed.\nHow did Starbucks manage to share the garden with the temple?\nShocking...."
        }, 
        {
            "index": 243, 
            "rating": "5", 
            "review": "A small sanctuary. A beautiful temple next to a nice pond. We watched a very nice performance at night, the setting was perfect! I recommend it to the show at the Palace. We grabbed a beer before the show at Lotus Cafe."
        }, 
        {
            "index": 244, 
            "rating": "3", 
            "review": "Impressive entrance but once inside, very small and over quickly. The entrance is very impressive with large intricate doorways and the water feature covered in lily pads.Once inside though (must be wearing a sarong as with all temples), the area is very small with a just few buildings. The architecture after the entrance stays the in the same vain as you would see at other temples...If you are in the area you can stop by and it would take maybe 30 minutes of your time, but definitely no need to go out of your way to see it."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Small but nice. Beautiful small temple in the center of Ubud. The evening is theater. There is a restaurant where you can watch theater"
        }, 
        {
            "index": 246, 
            "rating": "4", 
            "review": "Huge and peaceful. Saraswati Temple is very high,very large and very impressive.I can only imagine how colourful and glorious when there are ceremonies there!"
        }, 
        {
            "index": 247, 
            "rating": "4", 
            "review": "Awesome Temple Downtown. Another great place to stop and appreciate the temples in Bali. There is also a starbucks, for people that need their coffee fix, and an adjacent restaurant beside the temple where you can eat/drink and enjoy the view.Because its right downtown, I recommend popping your head in to snap a few pics."
        }, 
        {
            "index": 248, 
            "rating": "3", 
            "review": "Nice photo opportunity. Probably one of the most photographed temples in town due to the eye catching lotus flower ponds in the foreground. The architecture is nice too, but after a while in Ubud many temples look very similar with their worn orange facades.In the evenings they sometimes put on a traditional Balinese dance performance, but I'm not sure how regularly this is. I opted to go to the nearby Ubud Palace for this instead. However, it's worth popping in to enjoy the view, and it is free to see the picturesque grand entrance, and maybe buy a refreshing frapuccino at the adjacent Starbucks."
        }, 
        {
            "index": 249, 
            "rating": "4", 
            "review": "Nice temple. Nice temple in the ubud area. Should only take about 15-20 minutes to walk around and look at the architecture."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Photogenic Temple. Wonderful place to sit and watch local life. Cafe nearby to sit and watch a local ceremony without being intrusive."
        }, 
        {
            "index": 251, 
            "rating": "4", 
            "review": "Peacefull place in center of ubud. This is a small but very charming place in the center of ubud where you can make great pictures with ruins an lotus waterfields"
        }, 
        {
            "index": 252, 
            "rating": "4", 
            "review": "Fast and nice. You can take shirt and Enjoyable look at The tempel and The plants in the Water. Beautiful and easy to see. Placed in The central of Ubud."
        }, 
        {
            "index": 253, 
            "rating": "3", 
            "review": "You're probably passing it anyway....the \"Starbucks Temple\". Great ponds with beautiful lotus flowers, typically beautiful temple area. The central location makes it a must-see because you'll inevitably find yourself walking/motorbiking by the Starbucks and then you'll remember \"hey, there's a temple right next to the Starbucks\"---no fuss, no entrance fee, what's not to love for a quick visit?"
        }, 
        {
            "index": 254, 
            "rating": "2", 
            "review": "Saraswati temple. Not much to see really. As per the usual custom the temple was closed, so just looking at the lotus pond and getting something to eat. Definitely give it a miss next time. It is free however."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Good as it's free, central and easy. You just walk in for a few minutes for a beautiful sight! Gorgeous lotus flowers and an impressive temple.\nDon't be scammed into paying to see it just walk in"
        }, 
        {
            "index": 256, 
            "rating": "4", 
            "review": "Beautyfull temple. A beautyfull temple just right in the center of Downtown. You can't miss it in visiting Ubud. You can sit down also in the Starbucks that is just located in front of this place."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "You can't miss it. It's behing Starbucks.. major photo op. Otherwise, it doesnt have much else. There are nice views if you sit at Starbucks or the Lotus Cafe."
        }, 
        {
            "index": 258, 
            "rating": "4", 
            "review": "Nice temple. Pura Saraswati is a nice looking temple, we had a good view of the show one night from our restaurant."
        }, 
        {
            "index": 259, 
            "rating": "3", 
            "review": "Starbucks backyard. A pretty temple right in the center of Downtown Ubud. There is a restaurant and a Starbucks (yes, a starbucks) at the front. So people usually stops there for a drink while watching this beautiful sight. You can't miss it if visit Ubud."
        }, 
        {
            "index": 260, 
            "rating": "4", 
            "review": "Lovely temple. This is a lovely Hindu temple in Ubud dedicated to Dewi Saraswati, the Goddess of Wisdom and the Arts. There is a pond here filled with beautiful lotus blossoms. Kecak dance performances are held twice a week in the evening."
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "A must visit. This is an absolutely beautiful area to visit. The lotus ponds are stunning, carvings exquisite. Hire a car for the day and enjoy all that Ubud has to offer."
        }, 
        {
            "index": 262, 
            "rating": "4", 
            "review": "Beautiful temple. it is a beautiful hindu temple in the central Ubud, accesible by feet. in the yard there is a beautiful lotus pond, the temple is locked but you can pay a fee and get inside. They also take you a photo inside the temple. I liked it :-)"
        }, 
        {
            "index": 263, 
            "rating": "3", 
            "review": "Always locked but pretty outside. Located behind restaurants. It's a neat place but in a months time we never were able to see in temple. Lots of people on grounds due to central location. It's cool if you can catch a dance rehearsal."
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "Food and Temple view. One of nice temple in Ubud, with lotus pond, great Kori Agung-mind entrance of the temple, amazing-complicated stone carving.\nAlso can enjoy your food-from lotus resto with the temple surface scenary.."
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "Beautiful views - take as many photos as you want free admission, central location. Very nice, you can see the lotus pond and take pictures of the Sarsvati temple for free. You can also (for small cost of about 10 dollars) attend the Balinese dances ceremony set at the backdrop of this temple, mostly with seats in the Lotus restaurant, but I personally think the Dances in the Ubud palace offer better views"
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "Beautiful!. The temple is beautiful, you must definitely see it. The only downside was that we weren't able to go inside...according to the person at the main entrance it's always closed to the public...but I have my doubts so double check this before going and while being there.If you are not able to go inside don't worry you can still take some pretty nice pictures at the entrance.It may be hard to find at first, but look for the Starbucks and you'll be right there since they're both at the same place."
        }, 
        {
            "index": 267, 
            "rating": "4", 
            "review": "Beautiful but couldn't go in. My wife and I were really excited to visit this temple since it had great reviews and lots of beautiful pictures. However when we got there we were disappointed that we couldn't go inside the temple (according to the person at the main entrance it's always closed to the public...but I'm not completely convinced about this, you need to check before and while being there).It may seem hard to find but it's quite easy once you know it's in the same place as a Starbucks....there aren't that many so it won't be hard to spot.You should definitely go and take some pictures at the entrance, but besides that you won't need more than 10 minutes."
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Very nice temple with the lotus garden. This is one of the nice temple in ubud. around this temple there is have a very nice pool with the lotus flower. in the evening they have a balinese dance show just in a front of the temple. That is make this place look so beautiful.."
        }, 
        {
            "index": 269, 
            "rating": "4", 
            "review": "Lotus Pond in front of Temple. The temple is usually not accessible. Best to check with locals on when/if you can get in. The lotus pond in front is good for taking pictures, this includes the front facade of the temple itself. Worth a quick stop to take some pics. It's located directly behind the Starbucks."
        }, 
        {
            "index": 270, 
            "rating": "5", 
            "review": "Magical Peaceful Oasis of Serenity. From the moment I walked through the gate and started down the stairs I knew I had entered a magical and very special place on this earth....the beauty and quiet are extraordinary and the healing waters flowing from the lovely spouts of the statues are accessible...everywhere I turned was another vista yet more beautiful than the next - I could've stayed there all day - I will definitely go back for an even longer visit next time I am in Bali"
        }, 
        {
            "index": 271, 
            "rating": "3", 
            "review": "Nice Lotus ponds. The temple is set behind 2 lotus ponds which is pretty but when we were there even though there was a sign requiring temple dress, even with temple dress, we were not allowed to enter the temple, so really it wasn't worth the visit just to see the lotus ponds and the temple gates"
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "great visit. a beautiful hindu temple set among water gardens . just buy a sarong and cover your head and you can go in to visit but shoe respect for their beliefs ."
        }, 
        {
            "index": 273, 
            "rating": "4", 
            "review": "Small, easily accesiable and shows you the balinese architecture. We went to this place during an early evening, when it was drizzling a bit. The place is easily accessible and one can't miss if in at Ubud central. Saraswati or Goddess of knowledge/wisdom is the principle deity here but as with other temples, you may not be able to see the alter / main temple. Outside itself is marvelous and it is a quick escape from the hustle, bustle of Ubud central. The temple is a small place, so one can finish in less than 30 min and have a cup of coffee at the Starbucks. Yes, there is a starbucks right at the entrance, or another cafe, if you are hungry. Families with kids, please be a bit cautious with the lotus pond, or while taking the pictures near the parapet."
        }, 
        {
            "index": 274, 
            "rating": "3", 
            "review": "A Big Temple in Central Ubud But Not Very Special. It is one of biggest temple in central Ubud and probably, very near to your hotel. You must definitely see its lotus pond when you walk around! Plus, it is free to visit. You can have some drinks in cafe near temple and enjoy the atmosphere! However, there are definitely bigger and better temples around Ubud that you must visit with special tours."
        }, 
        {
            "index": 275, 
            "rating": "4", 
            "review": "Beautiful lotus pond. Not a big area but the lotus here are beautiful (when they bloom of course). There are starbuck too, so you can enjoy your drink while looking at the beautiful lotus pond."
        }, 
        {
            "index": 276, 
            "rating": "4", 
            "review": "The best in Ubud, but nothing special. Placed in central ubud, You have to see this place, it one of the best in Ubud themself. But it is rather small. Usually crowded. There are lots of quiter temples in Bali. But If You want to see this place, go in night, maybe there will be some Balinese dance perfomance. In that case this is beautiful"
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "Great place to visit while in Ubud. Lovely Temple well worth a visit better if you have a local that can explain the history, very easy to get too, watch out for the monkeys keep your valuables hidden"
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "just what I had pictured .... just what I had pictured ... and heaps more. So many photo opportunities and great people watching too."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Temple + Starbucks. When I saw this place on the map I thought it must be wrong - seemingly on top of a Starbucks.There is a starbucks at the entrance to the outer courtyard with the lotus flowers, but it's quite inconspicuous. It's does boggle the mind a little, coming around the world to visit a temple and having to walk by a starbucks to get in.Anyway, well worth the visit. You should don a sarong before entering (some available at the entrance). This is my first time seeing lotus flowers up close, thought they were very impressive and unusual."
        }, 
        {
            "index": 280, 
            "rating": "4", 
            "review": "Nicest temple in ubud. It's very, with a quite suggestive entrance. You can have access to the inside only wearing a sarong, but it's definitely worth to observe and enjoy Balinese architecture and culture!free entrance."
        }, 
        {
            "index": 281, 
            "rating": "4", 
            "review": "if you are into sculptures, this is the place with entrance fee. Hi, went to this temple, and to Ubud Palace. Paid some entrance fee, overall place is worth a visit. For more entrance fee and souvenirs reviews, http://snapraw.com/album/7"
        }, 
        {
            "index": 282, 
            "rating": "4", 
            "review": "nice temple with beautiful lotos lake. The temple was empty in the late morning, we had a nice and peaceful visit. Not big but very nice.\nThe lotos pond in front of the temple is beautiful, offering scenery for great pictures."
        }, 
        {
            "index": 283, 
            "rating": "4", 
            "review": "Beautiful Heritage!. Very beautiful historic but not very well kept and presented like many other touristy places in ubud."
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "Randomly stumbled upon this beautiful temple. The most beautiful part of this temple is the lotus garden in the front. I always associate lotus with mystical stories for some reason, so it gave me that mystical feel.\nIt is only a few steps away from the Ubud Palace.\nWorth a visit. Has a Starbucks."
        }, 
        {
            "index": 285, 
            "rating": "4", 
            "review": "Beautiful Lotus Flowers . Saraswati Temple is a quaint little retreat just off the main road of Ubud by the Royal Palace. The temple is fronted by a lake filled with hundreds of Lotus Flowers and split by a path down the centre. The temple is fairly small but with a visit."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Charm, harmony and peace / Bűbáj, harmónia és béke. After rain at five pm especially beautiful (water drops on the leaves and lotus flowers). Situated between Lotus Cafe and Starbucks :-( in the center of Ubud"
        }, 
        {
            "index": 287, 
            "rating": "4", 
            "review": "Small but Beautiful.. Don't really expect to go really inside if the temple, like mostly all the temples in Bali you can't really go in there.But at the entrance there's a beautiful and lovely pond full of lotus.The architecture the temple (well the outside) is colourful and very photogenic.Best of all, no entrance fee, no \"massaaggee ??\" \"Takkksssiii ??\" for ten minutes.Don't miss the entrance, there's the \"Lotus Café\" in the front."
        }, 
        {
            "index": 288, 
            "rating": "4", 
            "review": "Located in Center. easy accessible to temple, but the noise is much, also the crowd. I would suggest other temples like puri tirtha(Holy water) instead of this temple."
        }, 
        {
            "index": 289, 
            "rating": "4", 
            "review": "Morning Peaceful Walk. Don't expect something big or very adorned. Sarawasti Temple is good for some morning, midday shots (even for weddings). Small, but totally tuned with Ubud's environment. Not far from Ubud Market, so if you have to be stalked by sellers, this is the place to relieve yourself."
        }, 
        {
            "index": 290, 
            "rating": "4", 
            "review": "Rare display of pink lotuses. Beautiful place. Go either close to the morning or close to evening to see the open lotuses. It's free during the day but closes at 6pm for a paid dance. I would suggest spending 5-6pm there or earlier in the morning. I've never seen a whole pool of lotus flowers like this."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Lotus And temple. I come with friends,i see the arcitectur is verry good,balinese arcitectur with lotus garden,if you come at evening we look like at romantic area,cause around the lotus garden they have Candlle light.and there are some restourant and cafe there.nice."
        }, 
        {
            "index": 292, 
            "rating": "4", 
            "review": "A nice walk around.......very quiet and peaceful.. A nice temple to visit and photograph...quiet, not crowded and lovely. Not the biggest or unique...but nice. Enjoy."
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "very interesting. the beautiful architecture and adornment on the temple buildings is amazing. The guides are helpful and informative. Truly an awesome experience."
        }, 
        {
            "index": 294, 
            "rating": "4", 
            "review": "Beautiful temple. I and my family visited this temple when we stayed in Ubud. Beautiful temple with amazing pool, i am very interested about the culture and design very unique."
        }, 
        {
            "index": 295, 
            "rating": "4", 
            "review": "Excellent Look. It was a pleasant drive to the temple. WHen you go to Ubud, you can go to a series of tourist places including this temple. Calm location and can spend 1-2hours."
        }, 
        {
            "index": 296, 
            "rating": "4", 
            "review": "Peaceful and calm. Just a short walk from Ubud town to find this peaceful and calm place...\nThe water lily ponds were beautiful...a very nice and quiet place to stroll around.\nStop by the Indonesian-chic Starbucks by the entrance for a different Starbucks expericen from anywhere else in the world!"
        }, 
        {
            "index": 297, 
            "rating": "5", 
            "review": "leaving calm and fresh and happy. this place was very peaceful and very beautiful there was a certain amount of calm that came over u as we entered.. we were lucky to be there for Nyepi celebrations and to witness all the offerings and it was a really beautiful experience."
        }, 
        {
            "index": 298, 
            "rating": "4", 
            "review": "Ignore Starbucks. Although Starbucks has opened next door, this does not detract from the serenity of the temple. The Lotus Cafe is a better place to have a tea and take in the surroundings of this Temple and grounds."
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "Work of Art. Temples are amazing to go to and this one is no different. Very beautiful...make sure you bring a sarong!"
        }, 
        {
            "index": 300, 
            "rating": "3", 
            "review": "Nice view, but very small. A nice and quiet place, very close to Ubud's main street, but also very small... You will take 5 minutes to see everything... Also, there is a stage and a Starbucks right in front of the temple, which makes it very awkward..."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Beautiful place for photos. I thought this was a beautiful place to take photos. It's right in the centre of Ubud and easily accessible. It's even better when the lotus flowers are blooming. There is also a cafe on the grounds of the temple where you can sit and take in the beauty of the place while sipping a cold drink."
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "Holiday Trip. Nice temple, this place consisted of many cultural things which made me feel amazing and interesting very much."
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "Very nice view. We really enjoyed lunch with temple view in Lotus restaurant. After eating we took great pictures in the temple. It's worth to visit it."
        }, 
        {
            "index": 304, 
            "rating": "3", 
            "review": "I thought this was the Starbucks Temple. There wasn't any information about this place. So I named it the \"Starbucks Temple\" as it's at Starbucks.\nIt really was lovely. But, not unlike any of the other temples in Bali."
        }, 
        {
            "index": 305, 
            "rating": "4", 
            "review": "Great Place for Photos.. We visited this wonderful little Balinese Temple only after the discovery that there is a hidden Starbucks just in front of it. I know, Starbucks, uggg. However, if you need to cool off for a few minutes, just walk into the stiffest AC in Ubud. It was nice. Anyway - The \"Water Temple\" sits just behind the Starbucks, and is a complex array of carved stones, archways, golden Balinese doors, Bonsai trees, and stairways. You can go inside if you are dressed appropriately, and we did go in for a quick walk around. The best part is the outside, with the flanking lotus ponds. We came back for evening photographs, waited out a quick shower, shot the pictures, and then went into the restaurant (Lotus Cafe) that sits almost on the grounds of the temple. Actually, if you go to eat here in the evening, on Saturday (I think) you will get a great view of the live dance performance at the base of the main stairway."
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "Incredible Setting. It was situated between the Lotus Café and Starbucks in Ubud city center. The temple is a gem in this cultural center of Bali-- easily accessible with an intimate setting and within walking distance to Ubud market."
        }, 
        {
            "index": 307, 
            "rating": "3", 
            "review": "Nice from outside. Lovely tradidtional Baliese Temple. Nest to Starbucksnear the Ubud Art market. Great pictures from the outside but it was closed so we were not able to go inside to explore."
        }, 
        {
            "index": 308, 
            "rating": "4", 
            "review": "Beautiful Temple !!. Beautiful temple amidst lotus ponds set in the heart of Ubud. Close to starbucks. IT has its own dance show in the evening. Great to take a few clicks !"
        }, 
        {
            "index": 309, 
            "rating": "4", 
            "review": "Very picturesque. This temple was set along side the road with water fountains and pools everywhere. Loved to see the natural backdrop and different areas of the temple from a \"birds-eye\" view. Make sure to see this on your trip."
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "Peaceful place with Starbucks. Yep, there is a Starbucks cafè on the temple's territory. But it does not bother the place, which is worth to visit. Great photos guaranteed."
        }, 
        {
            "index": 311, 
            "rating": "4", 
            "review": "One of those moments that took my breath away!. You never know what to expect whenever of the actual location no matter how much research or reviews you can read. Sarawasti Temple was one of a few temples in Bali that completely took my breath away the moment we walked into view of the pond. Everything about it is just mythical and riched with details and history. This temple is one of a few that if you are dressed properly are allowed into the temple grounds. If you enjoy history, cultures, mythical imagery, rich details this temple ground absolutely will have you snapping away every steps you made."
        }, 
        {
            "index": 312, 
            "rating": "4", 
            "review": "Worth a (quick) look. Our tour guide brought us here almost by accident, as one in our party commented she wanted to get coffee in town. As we were from the U.S., the tour guide assumed we wanted Starbucks and it just so happens that there is a Starbucks right next to the entrance to this temple in Ubud. There are beautiful flowers and lily pads in front of the temple which make for great pictures. In all, we probably spent 15 minutes here since we couldn't go inside the temple. Definitely worth seeing while you are in Ubud, but we enjoyed the Tanah Lot temple more than Saraswati."
        }, 
        {
            "index": 313, 
            "rating": "5", 
            "review": "Beautiful outdoor stage!. We watched the barong dance here and Really enjoyed the performance but also the atmosphere of the compound! Would love to see another show here! Los, great cafe to eat dinner and relax at."
        }, 
        {
            "index": 314, 
            "rating": "4", 
            "review": "Nice location for a quick look. We´ve seen this temple by \"accident\", as we wanted to go to starbucks. It´s a nice, quite place which is beautiful. But i think you don´t need much time, we were there for 10 mins and it was absolutely enough. The sea roses infront of the temple are cool and kinda \"romantic\". So this place is perfect for a quick stay."
        }, 
        {
            "index": 315, 
            "rating": "3", 
            "review": "Beautiful but not for the dance show. The temple is definitely worth popping by. The ponds in front full of lily pads are very beautiful and great for photos. I bought a ticket for the all female orchestra and dance. At night the temple looks even more beautiful, but sadly it started raining, so we were moved inside to a bit of a grotty room. The performance was still very good - but lacked the atmosphere that would have been outside! On my walk back home after performance I could hear the one opposite the ubud palace and that sounded amazing! With singing too. So would recommend trying that one"
        }, 
        {
            "index": 316, 
            "rating": "4", 
            "review": "Interesting, not the best in Bali. Amazing, unique, picturesque temple, but not the most impressive in Bali. Personally, I enjoyed more the pond with the flowers than the temple itself.There are a dozen more unique temples. I prefer the Royal temple and Tanah Lot.On the entrance to the Saraswati Temple there is a Starbucks and another cafe, pretty interesting, unexpected combination. Connection of East and West."
        }, 
        {
            "index": 317, 
            "rating": "4", 
            "review": "a nice little place. I enjoyed my visit to the Saraswati Temple.The temple was well maintained and clean.It's a jewel in the middle of Ubud."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Magnificent, just like Goddess Saraswati.. I was astonished with the magnificent lotus-pond that is in the forecourt of the temple, and the temple itself, probably hundreds of years old. Did not get the chance to go in but then, the view itself was mesmerizing. Located behind Starbucks Ubud, on the main road. Eye soothing while enjoying a cuppa!"
        }, 
        {
            "index": 319, 
            "rating": "4", 
            "review": "Beautiful temple. one temple in Ubud, Very beautiful temple with Balinese architecture. This temple is located in the middle of the town of Ubud."
        }, 
        {
            "index": 320, 
            "rating": "4", 
            "review": "Nice!. Not as awesome as expected. The lotus were not looking very healthy everywhere, for best views sit out at Lotus Cafe"
        }, 
        {
            "index": 321, 
            "rating": "3", 
            "review": "Visitors not invited. Visitors are not allowed to go inside the temple. The only good thing was the lotus pond in the temple campus. Beautiful campus."
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Temple visit. This is amazing place to visit, very spiritual and peaceful. My husband and I loved visiting this temple and enjoying the surroundings. There is a Starbucks coffee shop near by if you need to stop and have a drink."
        }, 
        {
            "index": 323, 
            "rating": "4", 
            "review": "Culture, history and scenic!. Large beautiful Balinese Temple full of history. This is one of the few Temples in Bali fully open to the public. Best to go with a local guide to explain the many shrines. Worth the time to gain a full understanding and appreciation for the culture rather than simply snap a few pics. After enjoy a short walk up the side street for shopping and lunch. Bali culture is very rich and detailed, we enjoyed every moment and hope to return soon!"
        }, 
        {
            "index": 324, 
            "rating": "5", 
            "review": "A unique condition. The Temple was in excellent condition. The cleanliness of the gardens and the buildings was also very noticeable.Staff were also very accommodating. "
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "Must see! Beautiful architectre too... The temple at first sight, the gate, is very colourful and intricate. We looked for an entrance to it, but did not find it. So we asked a passing priest how to go in. After a lot of translation, he told us to turn left into the next door hotel entrance into the Saraswati temple. If you do not visit the inside you know will miss most of the temple. The inside we saw a lot of beautiful statues etc. The architecture is fantastic. It will take about 15 minutes to see. It is worth the time."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Beautifull and Gr8 Architecture. Lotus pond is nice, clean and great architecture, night time lighting awesome especially for the bali dance performances."
        }, 
        {
            "index": 327, 
            "rating": "3", 
            "review": "Peace n nice. I like everything n it is nice..it is also clean from every aspect...plus da toilets is available n easy way"
        }, 
        {
            "index": 328, 
            "rating": "4", 
            "review": "Scenic and Relaxing. I was the only one here and there was a pile of sarongs to wrap around your waist to walk around. No activity which made it a little uneventful but the scenery is very peaceful and pretty. I read some people making a trip from Kuta or South Bali to go here - I wouldn't recommend going that far to see it."
        }, 
        {
            "index": 329, 
            "rating": "3", 
            "review": "Underwhelming. It was a very underwhelming experience for us. If you are staying in ubud, sure.If you are staying in nusa dua like we were, it's not worth the 1.5 hours to get there."
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "amazing culture show. must visit for culture dance show which starts at 8pm of one hour duration.beauty of show is only female artist perform,soothing music n mesmerizing dance.beautiful entry of temple with lotus ponds on both side.soothing lights at night.overall worth a visit."
        }, 
        {
            "index": 331, 
            "rating": "4", 
            "review": "Lovely Scenic Temple. I had this place bookmarked as a location to see in Ubud. Although we did not go inside the temple as we were told it is usually open for ceremonies only, it was a site to behold with the lotus pond, in the foreground of the wonderful Balinese architecture typical of the ancient temples in the Ubud area. The temple itself is next to Cafe Lotus which we got to admire the temple from and take some awesome photos. Definitely worth the humidity if you are inspired by the Balinese architecture and symbolism. In addition we were attracted to fact that this was a Saraswati temple, Goddess symbolising Knowledge, Arts and Culture who is often depicted in Hindu culture seated on a Lotus flower. Going inside would have added to the occasion but we respected that it was closed that day, unfortunately. So you may want to find out before hand if it is open. Plenty of cafes/restaraunts to keep you hydrated for walking around not forgetting the shade of massive tree that overlooks the ponds."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "Beautiful Temple. The Saraswati Temple was very beautiful and welcoming. They provide Sarongs on site for visitors and we were lucky enough to observe a special day in their calendar. The water features and scenery are beautiful and it really is a natural masterpiece."
        }, 
        {
            "index": 333, 
            "rating": "5", 
            "review": "Beautiful!. Gorgeous from the outside and inside. Just don't forget to bring your sarong, scarf, and shoulder coverings! I see that a few reviewers are upset about the Starbucks outside, but honestly, it's pretty tastefully done to match the local architecture -- and its a good spot for a bathroom break!"
        }, 
        {
            "index": 334, 
            "rating": "4", 
            "review": "Stop over. The Water Temple is worth a stop over, there is also a Starbucks Coffee at the gate if you want to rest your feet after the rice paddies walk."
        }, 
        {
            "index": 335, 
            "rating": "5", 
            "review": "Pictures can't capture how beautiful. Tucked away behind cafes (which was the perfect place to have my morning coffee) in the heart of Ubud but still beautiful and tranquil!"
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "Beautiful temple in Ubud. It is a must-see if you are in Ubud. Beautiful and peaceful. There are lotus ponds just outside of this temple."
        }, 
        {
            "index": 337, 
            "rating": "3", 
            "review": "Starbucks by the temple???. Was very disappointed when visiting this temple to find a Starbucks right at the temple entrance! Obviously this leads to people leaving rubbish and spoils the serene atmosphere!We were unable to go inside as it was closed, but did manage to take a few photos of the outside.If imagine when the lilies are in full bloom it would be quite pretty!Worth a visit, at night you can see performances at the temple from the lotus cafe."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "One of my favorite temples in Bali. I really like the set up of the temple with the pond all around. If you are hungry or needing some coffee, there is a restaurant and a coffee shop with tables facing the temple."
        }, 
        {
            "index": 339, 
            "rating": "4", 
            "review": "a must see when in Ubud. truly a beautiful experience.. the lush greens, the tranquil water and the natives paying tribute to their deities all make a wonderful and very \"ubud\" experience.. spending 1 1/2 hours wasnt enough. . . shopping for silk and ethnic table runners in the nearby stalls was great too."
        }, 
        {
            "index": 340, 
            "rating": "4", 
            "review": "Tiny oasis. Yes, it is small. Yes, it is gorgeous, full of bright flowers and ornate details. Feels like a tiny oasis among the bustling city."
        }, 
        {
            "index": 341, 
            "rating": "5", 
            "review": "Moonlight reflecting in the lotus pool. Be sure to check out this beautiful temple at night as well as during the day. Spectacular view. Too bad the dancing had been cancelled due to a ceremony the night we were there."
        }, 
        {
            "index": 342, 
            "rating": "5", 
            "review": "Traditional Dance in a heavenly place. We were lucky enough to see some of Bali's best dancers in the beautiful location of this temple. We enjoyed dinner beforehand and then sat and watched the dancing. The costumes, makeup and those gorgeous smiles were amazing. Great value as always in Ubud."
        }, 
        {
            "index": 343, 
            "rating": "5", 
            "review": "fascinating!!. fascinating place, its present energy, very beautiful, nightly dinners with national dances.be sure to visit everyone!!!"
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Beautiful Temple right in Ubud. This is a really pretty place. There weren't too many folks there when we strolled it. Great place, water, sculpture, Bali. Good for foto ops. It's right in Ubud, so you don't have to go far to see it when you're there. Worth it!"
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "loved this place- truly beautiful. fantastic hidden temple amongst the hustle and bustle of Bali life.\ntake the time to stroll around and take in the peace of this temple. Pack a sarong on your trip, every temple requires a sarong to be worn ."
        }, 
        {
            "index": 346, 
            "rating": "5", 
            "review": "Tranquil in the midst of hustle and bustle. wonderful temple. free to visit. take the time to look in. Tranquillity amongst the hustle and bustle of Bali."
        }, 
        {
            "index": 347, 
            "rating": "4", 
            "review": "A nice place you must say. No long time to visit, but nice area with Lotus. Ubud centertown, near the market center, you must go and see this place. A small one, with a nice coffee nearside. Old (closed) temple, and nice nature arround. Many lotus and quiet . ( except at nigth where sometimes you can have LEDONG dances with many people, but it's also interest to Watch )."
        }, 
        {
            "index": 348, 
            "rating": "5", 
            "review": "Very poetic. A small but SO charming temple in Ubud! With its waters and nenuphars, it is one of my favorites!\nThe adjacent Lotus Café is a very nice place for a quiet afternoon drink!"
        }, 
        {
            "index": 349, 
            "rating": "5", 
            "review": "Our trip. Great place to go.\nYou will see all religious people celebrating.\nwe went on Full Moon day, Poornima.\nThere were people even lined up for ritual bath.\nBut there were no noises, all was quite, disciplined and very smooth.\nSomething every one must learn.\nMust visit"
        }, 
        {
            "index": 350, 
            "rating": "5", 
            "review": "Just Lovely!. We were invited to attend traditional dancing here by our Villa owners, we were so taken by the venue we came back for another look in daylight. We were not dissapointed the place is gorgeous, night and day! But the dancing could not have been set at a better venue- it all just added to the experience. Cafe Lotus overlooking the Temple is also worth a visit for a bit of down time looking at the view."
        }, 
        {
            "index": 351, 
            "rating": "5", 
            "review": "Beautiful setting with lotus flowers. The temple is surrounded by lotus flowers in the ponds in front of the temple. The view is beautiful and worth a visit. There are restaurants nearby overlooking the temple, but I ate elsewhere. There are also traditional dancers there of an evening."
        }, 
        {
            "index": 352, 
            "rating": "5", 
            "review": "Beautiful place to stop for lunch or a coffee. Serene and peaceful, sitting next to the lotus pond at Cafe Lotus. Had a great Indonesian meal with drinks for $25AUS"
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "Beautiful. At main street. Nice pool with lotos plants. Good place to take some photos. Also cafe. Open till night."
        }, 
        {
            "index": 354, 
            "rating": "5", 
            "review": "amazing Balinese dance performance. when i reached temple at 7:30 pm there was balinese dance performance by balinese females for idr 80,000.it was amazing ,worth to spend .i saw few dance performances like barong dance,fire dance etc.but this was the best.nice lotus ponds,nice ambiance.must visit"
        }, 
        {
            "index": 355, 
            "rating": "5", 
            "review": "Completely Beautiful. Just a couple of steps off the street (behind Starbucks) you enter a haven of serenity and beauty. The lotus flower is quite amazing and the pond is beautiful. One of the best kept temples we saw and all completely free, not to be missed!!"
        }, 
        {
            "index": 356, 
            "rating": "5", 
            "review": "Nice lotus pond. This is a very small temple but the lotus pond is very nice to see.\nThe reflecting temple in the pond is enjoyable by day."
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "Lotus ponds. We were taken here by friends. I arrived and it was nice touches and great views of the lotus ponds. The cafe was looking nice.but didnt have lunch here.if I had more time.i would of attended."
        }, 
        {
            "index": 358, 
            "rating": "3", 
            "review": "A nice temple in the centre of Ubud. This is a beautiful temple, but it deserves more space. It feels like an add-on to the Starbucks at its entrance. Go early to avoid the crowds."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Go early to have the Temple to yourselves!!. We visited this Temple and its lovely Lotus Pool on our first day in Ubud, and it was truly peaceful. I suspect it is not quite so peaceful later in the day, but it is well worth the visit!! Given it's right in the centre of town and will only take a little while to look around, you've nothing to lose!!"
        }, 
        {
            "index": 360, 
            "rating": "4", 
            "review": "Lovely temple, in the middle of town. We spend an hour exploring the wonderful Lotus pond and the outside of the temple complex. Very pretty, lovely details everywhere, a little oasis in the middle of very busy Ubud. There is no entrance fee. The Starbucks café didn't bother us, its an old building that fits in with it's surroundings and we actually grabbed our self a nice iced coffee after our visit."
        }, 
        {
            "index": 361, 
            "rating": "3", 
            "review": "A little disappointing. I visited this temple during the day, it's right next door to Starbucks which took away some of the atmospherics for me. It's small and easy to walk around, it took about 30 minutes of my time but there are many statues to see. I imagine it's a more impressive experience at night when the traditional dancing takes place - this I got a glimpse of from the busy main street."
        }, 
        {
            "index": 362, 
            "rating": "3", 
            "review": "Average. Its a temple with lake view. Go there in the evening for dance performance or check out the cafe. Can spent 30 minutes"
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "Entrance at between Starbucks coffee and Cafe Lotus . Not so easy to find if you don't have this information, even some of the local drivers don't know about this place. Were not able to enter the temple but the carving outside is already very magnificent. Signboard stated about wearing sash or sarong when enter the temple, and female during menstrual period is prohibited to witness the ritual."
        }, 
        {
            "index": 364, 
            "rating": "3", 
            "review": "Convenient temple . The Saraswati temple was the first temple my wife and I visited in Bali. Our hotel had a shuttle that dropped us off on a block away from it. The temple is unique and beautiful although the Starbucks right at its main entrance takes away from its character. To our surprise there was only a few people looking at the temple which is nice when you are taking photos. You are required to cover up if you are wearing shorts or revealing shirts, but there are sarongs provided at the temple."
        }, 
        {
            "index": 365, 
            "rating": "4", 
            "review": "Neat Little Place. One of the first temples we saw in Ubud. Easy, as it's pretty much right there off the main strip. The place is pretty small as attractions go, but still neat to see all the stonework and the flowers. Lots of fish in the water. Some semblance of tranquility, even though the busy street is just out front.If you get thirsty or hungry, there's a restaurant and a Starbucks right at the entrance."
        }, 
        {
            "index": 366, 
            "rating": "5", 
            "review": "Easy to access, quick to visit. Like: the carivings along the stage and the font. Location in the town centre so little effort to see itDislike: wish it was larger!"
        }, 
        {
            "index": 367, 
            "rating": "3", 
            "review": "Lovely Lotus Pond. Although it's small, it's still worth a visit. Tucked behind Lotus Cafe and Starbucks, the temple is like a little getaway from the busy Jl Raya Ubud. It has a very nice lotus pond. You can't enter the temple, just admire the architecture from the compound. There is traditional dance every Thursday evening where you can enjoy from Lotus Cafe."
        }, 
        {
            "index": 368, 
            "rating": "4", 
            "review": "Grab a coffee and enjoy the view. Its definitely a nice temple and if you are in UBUD then you should come and visit. Its very small and you cannot actually go inside but its just enough to see the pond, the stage and the main doors.This temple is located close to the end of the famous Monkey forest road,with the palace close by and the market. You cannot miss the entrance as there is a big Starbucks and an Indonesian restaurant. We did not even know about the temple but the Balinese music got me going and looking for its source."
        }, 
        {
            "index": 369, 
            "rating": "2", 
            "review": "Starbucks ruins the atmosphere. It is hard to enjoy a temple visit when, just after the entry (free, even if you will find people at the gate trying to sell you tickets for the nightly dance show) there is an ugly Starbucks. I mean, it is right inside the temple, beside the lotus pools... To reach the water temple you have to walk between that one and another coffee-restaurant, Lotus bar, that practically blot out the view of the temple from the main street. This bar's outside tables are inside the temple as well. It's a shame, I mean, it's supposed to be an holy place..."
        }, 
        {
            "index": 370, 
            "rating": "4", 
            "review": "Nice but small. Overall, it was quite aesthetically pleasing; however the temple's main doors were closed so visitors are only allowed to view a small portion of the temple. The small lake was quite scenic and the temple was a nice backdrop. Would recommend for a small break in the centre of busy Ubud, however not really worth a visit otherwise. Entrance is also free."
        }, 
        {
            "index": 371, 
            "rating": "5", 
            "review": "Must see in ubud. Saraswati temple is in the high street of Ubud and we just wandered in whilst shopping. The temple was closed at the time - opening hours were 8 - 4/5 pm. so went back the next day, could go inside the temple - no hassle, no guides, making it quiet and serene."
        }, 
        {
            "index": 372, 
            "rating": "4", 
            "review": "beautiful. You can give the lotus cafe a miss, but don't miss the Lotus Garden next to it. It is worth the visit."
        }, 
        {
            "index": 373, 
            "rating": "5", 
            "review": "Peaceful setting & interesting temple. Had lunch at the lotus cafe, sat on the bamboo floor which was lovely, right next to the lotus pond. Beautiful setting as the lotus ponds lead up the the temple entrance! Doesn't cost anything to visit the temple but don't expect to get in unless u are wearing full Balinese dress, you can borrow a sarong & scarf at the entrance - there is a donation box as you walk in. Defiantly worth a visit if u are in ubud area! Nice to step inside a temple and get a look into Balinese religion. Great setting for photos"
        }, 
        {
            "index": 374, 
            "rating": "4", 
            "review": "Cool temple with a view!. This temple is really pretty with the lily pad lake in front. Definitely a spot for a photos. We went later in the afternoon and there was hardly anyone there which was better for photos. Not huge, so doesn't need a lot of time!"
        }, 
        {
            "index": 375, 
            "rating": "5", 
            "review": "Beautiful view.. Stuck in the Ubud downtown area it really worth the visit. Beautifull view and no entrance fee. I recommend!"
        }, 
        {
            "index": 376, 
            "rating": "4", 
            "review": "Very beautiful, good place for photos. You don't need much time, it's right in the centre of Ubud and it's one of the most beutiful temples in Ubud. At night they have a performance that is quite interesting if you haven't seen any yet."
        }, 
        {
            "index": 377, 
            "rating": "4", 
            "review": "Must-See in Ubud. The Pura Saraswati is located in the centre of Ubud at the main road. For me it was one of the prettiest temples in Bali (and I saw a lot ;) ). It's not that big but a beautyful picture with the lake in front of it. If you want to go in don't forget your sarong, you cannot rent it there. In the evenings you can see the legong dance here.A unique thing would be the Starbucks gong at the entrance ;)"
        }, 
        {
            "index": 378, 
            "rating": "5", 
            "review": "Very pretty temple - only 20 minutes needed. Very pretty temple in downtown Ubud. Best to combine with breakfast or lunch. Great for photography and portrait photos but I am not sure you can enter the temple complex."
        }, 
        {
            "index": 379, 
            "rating": "3", 
            "review": "Very pretty, tie it in with your lunch plans. This was a very pretty temple, but like most temples, don't expect to enter unless you are in full balinese dress. This really means that you can't spend more than 15 minutes appreciating the exterior of the building. We happened to visit the cafe next to the temple to make this visit more substantial and this was a good move, very nice food and gave us the chance to fully enjoy this peaceful setting."
        }, 
        {
            "index": 380, 
            "rating": "3", 
            "review": "Pretty. This particular temple is pretty and the grounds are nice. If you are near it, it is probably worth looking at, but I would not go out of my way to see it. Others may have a different view.Also, if you are looking for it, it is just behind Starbucks."
        }, 
        {
            "index": 381, 
            "rating": "4", 
            "review": "Quiet setting. The main temple was closed when we went. (Friday) I was told some dance programs happen early mornings or in the evening. The place had a huge lotus pond and the whole setting is idyllic. There is a Starbucks next to this and it's at out of a beautiful building too. There is also a cafe in this space. Its beautiful to just sit there while you sip your drink."
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "Very serene temple. This was an amazing temple. When we went there, folks were doing some artwork within premises, so it was even more nice. We enjoyed the beautiful idol of the Goddess Saraswathi."
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "Beautiful temple. The temple surrounded by lilies is beautiful. This is in the centre of town & is well worth the visit. We did not get to go inside as there was a royal wedding on during the week we were in Ubud but we do not feel like we missed out as the outside was stunning."
        }, 
        {
            "index": 384, 
            "rating": "5", 
            "review": "Grand Temple.. Amazing architecture and glimpse on the culture of Indonesian people. The grandness of the architecture, craftsmanship."
        }, 
        {
            "index": 385, 
            "rating": "4", 
            "review": "Nice.... Not a day trip, not a destination trip either, but another temple with interesting sites which makes for some nice photos"
        }, 
        {
            "index": 386, 
            "rating": "4", 
            "review": "Great food and ambiance.. Very nice location for a temple, smack dab in the middle of town. Couldn't ask for anything better...... except being right next to a Starbucks! It look a little of the mystic away."
        }, 
        {
            "index": 387, 
            "rating": "4", 
            "review": "A Calm and Quiet place, highly recommend.. Small and beautiful, can be missed easily given that it's commercialised and hidden by a restaurant in the front (seen this quiet a lot across temples in Bali, not sure why). Seems favourite with local kids, they fish in the ponds and the water garden. I found this place a must see, the statute of Goddess Saraswati, who bestows education and intelligence, beautifully portrayed, tucked in a corner, cannot miss this in white and gold. The orchids and adenium bonsai are a plus and beautify the place. An hour or less is enough to go around. The traffic of Ubud will take a lot of time for you to reach the place. At the entrance, people sell tickets, but that's not for entering the temple but for the dance performance in the evenings. So, watch out.The sad part is the temple is abused, cigarette butts and empty beer bottles thrown around. This is not good, request tourists to maintain the decorum of the temple and disturb sentiments of the believers, I felt bad and disturbed."
        }, 
        {
            "index": 388, 
            "rating": "5", 
            "review": "Beautiful. This place is just serene. Go at dusk to appreciate it by day and night. The show can be watched also from the Lotus Cafe."
        }, 
        {
            "index": 389, 
            "rating": "5", 
            "review": "hidden treasure. during a hot afternoon looking for refreshment we stumbled on upon this temple actually. we went to a cafe/restaurant and to our suprise we saw this beuatiful temple on the grounds next to the bar. we couldn't see this from te streetA\\s we came in we discovered it and we sat down at the low tables on the deck over the pond in front of the temple to have a drink and a bite wich were both very tasty by the way , we took a look around the temple grounds of coz and it was very nice and typical balinees so as we travelled on we told eachother that it has been a nice surprise for us and we recommend this place to everyone ."
        }, 
        {
            "index": 390, 
            "rating": "4", 
            "review": "Beautiful & peaceful. This was our first stop in Ubud .. Very peaceful & serene .. You can visit it when you're done with a long busy day shopping in Ubud, & chill in the Lotus cafe inside, contemplate the scenery .. It's definitely worth the visit .."
        }, 
        {
            "index": 391, 
            "rating": "4", 
            "review": "Beautiful temple, interesting dance (thurs). The Pura Saraswati Temple was definitely worth visiting during the day for some unique and beautiful architecture and scenery. We arrived early evening to catch the dance (every thurs 730) We were told the wrong time and ended up waiting over an hour for the dance to start. I think it was worth the wait, and enjoyed the costumes and skill of the dancers. My husband is harder to please and finally talked me in to leaving before the end of the show. The temple is definately worth a visit and easy to see if you are wandering through Ubud. Only see the dance if you like that sort of thing! I thought it was great!"
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "Beautiful Temple. Being from India, i can say that I have seen my fair share of temples :) But this temples stands out especially for the Lotus Pond surrounding it. The blooming lotuses, the rock architecture make the place very serene and peaceful.Sadly cudn't enter the temple :("
        }, 
        {
            "index": 393, 
            "rating": "4", 
            "review": "well worth the visit. Beautiful peaceful place right in thr hustle and bustle of Ubud, you can sit in quite a fancy restaurant overlooking it if you want but quite pricey. Well worth having a cold drink and a bit of respite though."
        }, 
        {
            "index": 394, 
            "rating": "5", 
            "review": "Beautiful Temple. This is a beautiful, very peaceful place. This is definitely worth a visit. It was very nice to get out of the hubbub of the Ubud streets and find the oasis!"
        }, 
        {
            "index": 395, 
            "rating": "5", 
            "review": "Peaceful and serene. A lovely visit to this temple and neighboring Lotus cafe. This is a beautiful temple definitely worth seeing. The Lotus cafe next door overlooks the Lilly ponds and temple so stop here for a quiet drink on your travels around Ubud and you won't be disappointed."
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "Purity. As I was travelling to Bali for Detox and Purification, I loved the feeling of getting myself purified in what Hinduist consider as THE purifying source for the body and soul ;)"
        }, 
        {
            "index": 397, 
            "rating": "3", 
            "review": "A very picturesque temple. Although the main temple is closed to the public (like many are) this temple is still very beautiful as on either side of the pathways leading up to it there is water with many lily pads on it. It is amazing that you can find such peace and tranquility when just outside there is absolute chaos."
        }, 
        {
            "index": 398, 
            "rating": "3", 
            "review": "A pond full of lotus and a starbucks. Nothing much to see here, the main temple is close like the rest of the temples in ubud. There is a starbucks for those who wants to just sit around. The pond do contain lotus but that is about all. Entry is free though."
        }, 
        {
            "index": 399, 
            "rating": "4", 
            "review": "Beautiful Lotus Flowers in front of Temple. After enjoying morning coffee in Starbucks Ubud, amazed by beautiful lotus flowers in front of temple. It's located in front of Starbucks. I suggest this place because it is a very good spot to take photographs or even painting in canvas. The ambience give you peaceful aura and stunning landscape."
        }, 
        {
            "index": 400, 
            "rating": "4", 
            "review": "Beatiful temple. This is a beatiful temple in the heart of Ubud. The access is free and there 's a restaurant overlooking the temple and the lotus pond. It is well maintained, not crowded and recommnded to take photos of typical Balinese scene. Parking however is bit difficult as it's only 1 lane with cars parking along the street."
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "Stunning temple. Wow is the one word that comes to mind. The most idyllic set temple i saw! Surrounded by lotus ponds it is breath-taking. Not much to do there but we booked a table at the restaurant (Lotus I think it's called) and watch one of the shows in the evening from the \"deck\" area - was excellent!"
        }, 
        {
            "index": 402, 
            "rating": "4", 
            "review": "Impressive!. A beautiful temple, very photogenic too. The frangipani trees must be so old ... the Lotus Cafe is a good spot to have a cold drink and admire the view of the temple."
        }, 
        {
            "index": 403, 
            "rating": "5", 
            "review": "Lovely Temple to Look at While You Drink Your Coffee. This is a gorgeous royal temple fronted by a very large lotus pond. You can't actually go inside the temple, but you can contemplate it and its pond while dining at the Lotus Cafe or Starbucks which front it. Very sumptuous. Makes great photos."
        }, 
        {
            "index": 404, 
            "rating": "4", 
            "review": "Worth paying a visit. The temple is located behind the Starbucks caffee at the Raya Ubud. It is on the same road as the Ubud palace. In December there were no lotus flowers, but I can imagine the temple looking wonderful if the waters are covered in flowers. Walking up to the temple is free, so no need to skip it when in Ubud. When back in the road walk a bit further until you see the sign 'Ubud rice fields'. I went there jogging 2 mornings and it was wonderful. The track goes all the way round through the rice fields and gives you a feeling of the real Bali!"
        }, 
        {
            "index": 405, 
            "rating": "5", 
            "review": "Very beautiful. This is located next to the lotus cafe. It's great to have lunch overlooking the beauty of the place. it's very central and good for a quick visit. Touristy of course, but if you are staying in Ubud (highly recommended) come here early in the morning before all the buses arrive."
        }, 
        {
            "index": 406, 
            "rating": "4", 
            "review": "Beautiful Temple behind Starbucks. This is a really nice temple just behind Starbucks in Ubud. Really quiet when we visited and one of the nicest temples I saw while in Bali."
        }, 
        {
            "index": 407, 
            "rating": "4", 
            "review": "Quick must see. I passed by this place early in the mourning (6 o clock), so that there was nobody else nearby and the place looked stunning with a rising sun."
        }, 
        {
            "index": 408, 
            "rating": "4", 
            "review": "Great start to the Ubud Experience. I read the tripadvisor reviews or never would have noticed this beautiful temple behind Starbucks. Very quiet with few visitors. Really nice!"
        }, 
        {
            "index": 409, 
            "rating": "5", 
            "review": "Hidden gem. A lovely example of a traditional Balinese temple conveniently located in the centre of town (behind Starbucks!)"
        }, 
        {
            "index": 410, 
            "rating": "3", 
            "review": "Nice clean place very close to Ubud Market. This looks like an old bungalow converted in to stay. Lovely sculptures. Small clean rooms. Before you check in ensure they air your room. The breakfast is nothing great but filling. compared to couple of other places we saw around the same area this was pretty decent"
        }, 
        {
            "index": 411, 
            "rating": "4", 
            "review": "Worth a visit. The Pura Saraswati Temple and Lotus Pond were beautiful and I'm definitely glad my husband and I went in. To enter the temple, we had to wear a sarong, and for a donation at the entrance we were provided the appropriate attire. The structures, statues and carvings of the temple were stunning. Visiting this site did not take long - but was well worth it since we were in Ubud."
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "Beautiful temple. Must visit if you are in Ubud. Not many tourists and you can sip coffee from Cafe Lotus (just across the temple) and enjoy the beauty of this temple."
        }, 
        {
            "index": 413, 
            "rating": "4", 
            "review": "Starbucks?. Of all places to find a tacky coffee shop in such a beautiful location. We found this place by accident while just cruising around Ubud. Well maintained and tidy and a pleasure for the camera lovers. A lot of people were in attendance on the day of our visit and I know why. Such a serene place and well worth the search. It would have been a great spot for a coffee but I don't like Starbucks. Plenty of seats about so a good place for a break and drink. The water gardens were pleasure to the eye. I would recommend this place to others if staying in central Ubud"
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "The hidden temple of Ubud. Pura Saraswati Temple is easily reachable in downtown Ubud and unfortunately not much visited by tourists. The reason: It is almost hidden behind Starbuck and Lotus Café's premises. But, being just a little bit curious, you'll get a chance to visit this magnificent temple surrounded by the most beautiful lotus flower ponds and ancient stone carved walls. Walk around, smell the flowers and let your mind fly away. You are in Bali, it is magic. Enjoy!"
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "Classic Balinese Temple on Lotus Pond. Pura Saraswati is an absolutely gorgeous Balinese temple located on a beautiful lotus pond. It was challenging to find among the bustling streets of Ubud, especially because it's tucked behind a Starbucks and Cafe Lotus, and not immediately visible! But once we found it, we were SO happy we did. We explored the temple, and then had a light dinner at the Cafe Lotus, which is perfectly good and provides a relaxing place to sit and enjoy the view of the temple as the sun sets. We would have stayed for the evening performance, but time was not on our side that day. Highly recommend!"
        }, 
        {
            "index": 416, 
            "rating": "5", 
            "review": "Ubud's most beautiful temple complex + best venue for cultural performances. Other than being marred by a Starbucks (of all things) at the entrance, this is the most beautiful temple complex in Ubud and by far the best venue to appreciate a cultural performance (sometimes they practice by the pond in the afternoon) as the backdrop is lit up at night. You can also go to the Starbucks (ugh!) and sit on the back veranda or go to the restaurant complex on the other side to watch a performance albeit both places are way overpriced for food/drink (ESPECIALLY the Starbucks!!!). If the lilies were in the pond were in bloom, the setting would be even more spectacular."
        }, 
        {
            "index": 417, 
            "rating": "5", 
            "review": "Beautiful Temple Complex. The Pura Taman Kemude Saraswati is a Balinese Hindu Temple, devoted to the Goddess of Wisdom, Science and Art. Situated in the city center of Ubud, with two nice lotus ponds. Worthwhile a visit!"
        }, 
        {
            "index": 418, 
            "rating": "5", 
            "review": "Beautiful! Also attend a performance there. Its not a big place, but has a beautiful lotus pond in front. Its between Starbucks and Cafe Lotus. I walked by the entrance half a dozen times, without ever noticing there was a temple here. It wasn't until I literally saw a sign announcing a performance that I realized it was the water temple. Definitely try to see a performance here, as it is an excellent venue. I watched The Ramayan Ballet, which was fantastic."
        }, 
        {
            "index": 419, 
            "rating": "4", 
            "review": "Wooow Amazing. we greatly admire the Balinese carvings, this temple is one of the temples we visited in Bali. Very complete carvings that have significance in Balinese culture in the capture of the Hindu story."
        }, 
        {
            "index": 420, 
            "rating": "5", 
            "review": "Great place and perfect venue to see traditional dance. Very nice temple in the centre of Ubud. Surrounded by lily ponds which look great, especially in the evening when the temple is lit up. Viewable from the nearby Cafe Lotus (which we didn't try) and the Starbucks near the entrance.We decided to watch the Balinese dancing here, although there is a lot of choice in Ubud. Glad we did as it was very atmospheric setting and a great experience, with a relatively small audience. One of the highlights of our holidays in fact. It seems they have different dance companies on during the week and I think we were lucky that ours was very good indeed (was a Weds).Would recommend it if you are lucky enough to be in Ubud!"
        }, 
        {
            "index": 421, 
            "rating": "5", 
            "review": "Amazing temple in the heart of Ubud. Beautiful scenery right in the middle of a busy town. Amazing pond filled with lotus and water lily, perfect for a picture backdrop or a screen saver. Can also sit and enjoy coffee at Starbucks while at the same time, nonetheless it's mostly crowded with people unless u be there early to grab a spot. It looks even better at night when the spot lights are up. I'm coming back again next year."
        }, 
        {
            "index": 422, 
            "rating": "5", 
            "review": "Gorgeous temple. I was wandering through Ubud and stumbled upon this amazing temple. The entrance grounds are quite the spectacle. Dozens of lily pads cover the pond with several in bloom - if you're lucky. I didn't go into the temple grounds but I very much enjoyed admiring the stonework and plants in and around the area. Definitely check this temple out if you're in the area, it's worth at least some time to explore."
        }, 
        {
            "index": 423, 
            "rating": "4", 
            "review": "Almost perfect if not for the Starbucks in front. It was really a surprise to find this right smack in the middle of central Ubud. You would not know there was a temple inside since the entrance there is a starbucks coffee. Walked in by accident and was amazed how beautiful it is. Not a bad spot to just sit and relax after shopping at Ubud market. They also have cultural shows here."
        }, 
        {
            "index": 424, 
            "rating": "4", 
            "review": "Beautiful. a very beautiful temple, one of the temple in Ubud is only 5 minutes from Ubud market. If you been to Ubud do not forget to pay a visit to this temple."
        }, 
        {
            "index": 425, 
            "rating": "5", 
            "review": "Beautifully enchanting. This temple is simply a great, take simply an hour out of the day and take a peek. Beautiful lily pads in the water surrounded by beautiful stone work.Also situated in the centre of ubud so so accessible"
        }, 
        {
            "index": 426, 
            "rating": "5", 
            "review": "Beautiful!!. Great temple right in the center of Ubud! Just enter next to the Starbuck's (-this must be the weirdest spot for a Starbuck's EVER!-) and enjoy the scenery. Great spot to take some romantic photos."
        }, 
        {
            "index": 427, 
            "rating": "4", 
            "review": "small, peaceful retreat. The approach to this temple through the lotus ponds is very beautiful and a perfect photo opportunity, but the inside although small is well worth venturing into. I have read a few reviews that says it is not always open, however we walked right in (mid morning) and had the place to ourselves. It was very clean and quiet with some interesting statues, and for the traveller with limited time is perfectly located in the centre of Ubud. The exterior is transformed at night with lighting for the dance show and is also worth seeing then even if you don't watch the show."
        }, 
        {
            "index": 428, 
            "rating": "5", 
            "review": "Excellent Temple, Not Touristy!. Pura Saraswati is one of the best temples in Bali. The temple features a full sized idol of Goddess Saraswati. Its a blessing in disguise that it does not figure amongst the frequented tourist attractions. There is no one hussling you to buy souveniers, no one heckling you to take guides. There's a pile of neatly folded sarongs kept at the entrance. To visit the temple, you have to pick up a sarong and wrap it on. No fee charged for the sarong, however, there's a donation box placed next to the sarongs and visitors may drop in a donation at their will."
        }, 
        {
            "index": 429, 
            "rating": "5", 
            "review": "This is OUTSTANDING !!! at the Lotus Resturant the view is great.. The Puri Saraswati temple is on the main road Jalan Raya about 2 blocks from the Ubud Market. ( which was redone last year ) It is easy walking. 2 gigantic lotus pools...beautiful carvings. The whole experience takes about 15 minutes once you arrive. Not to be missed."
        }, 
        {
            "index": 430, 
            "rating": "4", 
            "review": "Wooow, Beautiful Temple. If you are into Ubud town do not forget to visit the saraswati temple. Really beautiful and interesting. Our whole family after the way in the market about 1 hour we spent time visiting here."
        }, 
        {
            "index": 431, 
            "rating": "5", 
            "review": "My favorite temple in Ubud. Maybe because of the pond or the lotus or the layout of the place... but I went many times when I was there. Although it is a bit expensive you can enjoy a drink and the view at the café located on your left as ou come in from the street.The Pura Saraswati is a freat place for pictures, to meditate or just for a rest."
        }, 
        {
            "index": 432, 
            "rating": "4", 
            "review": "Nice temple for photoshoot. This is a very nice temple behind Lotus Cafe and Starbucks. When I visited the temple was closed, so I took pictures from outside. The pond in front of the temple is full of lotus plants. If you are wandering around the market area in Ubud, you can spend 10 minutes taking lovely pictures of the temple and the pond"
        }, 
        {
            "index": 433, 
            "rating": "5", 
            "review": "Artfully designed, nature inspired.. Artfully designed and nature inspired is a short description to define the beauty of this temple gate, park, ponds, and trees.Pohon kamboja (Frangipani), Teratai (Nymphaea) and other plants can create good serene view.The temple gate is splendid with its motif decoration and typical Balinese color."
        }, 
        {
            "index": 434, 
            "rating": "5", 
            "review": "Gorgeous. Absolutely beautiful temple and pond. A bit odd that it is right next to starbucks, but that is actually okay. After a long day of walking around in the heat and humidity of Ubud, you can sit down at starbucks, order a cold drink and marvel at this beautiful work of architecture."
        }, 
        {
            "index": 435, 
            "rating": "4", 
            "review": "Beautiful temple just behind cafe in the heart of Ubud. First time we went to this temple not because we knew there is a temple, but actually we went to the cafe for a lunch :) and when we went inside the cafe ... voila! There is a beautiful temple hidden just behind the cafe! Between cafe and the temple there are two ponds with lotuses inside it .... on the right and left side of the small pathway, the ponds are beautifully set and framed the temple ....Just the same name they gave for the cafe, \"Cafe Lotus\"!It's free to visit this temple, but you should wear a sarong."
        }, 
        {
            "index": 436, 
            "rating": "4", 
            "review": "Beautiful. One of the temples we visited in Ubud, located in the center of Ubud. Very beautiful temple, still keep and save today by Hindus in Ubud."
        }, 
        {
            "index": 437, 
            "rating": "4", 
            "review": "magical mornings. its beautiful nd early mornings nd evenings r magical ... u can go 2 lotus cafe fr breakfast nd sit at the table facing the temple , its just an unbelievable beginning o a day.."
        }, 
        {
            "index": 438, 
            "rating": "4", 
            "review": "The lotus pond is very beautiful!. Just behind Starbucks and there is \"Lotus cafe\"very nice atmosphere.Take a few great picture of the great architecture with the lotus pond!"
        }, 
        {
            "index": 439, 
            "rating": "4", 
            "review": "Well kept lotus ponds with a backdrop of Balinese temple architecture. Few steps onto the walkway with lotus ponds on your sides gives you uplifting sense of nature. The concrete facade of the temple welcomes you to the temple for a cultural spiritual charging."
        }, 
        {
            "index": 440, 
            "rating": "4", 
            "review": "Beautiful temple just of the main street. This is a stunning temple off the jostle of the main street in Ubud. The lotus pools are simply stunning and photo opportunities abound at every turn. Make sure that you have appropriate atire however. shorts and skimpy tops are a definite no-no! Cafe Lotus is on the corner but frankly I would not eat there as it seems rather third rate with tourist type menus in multiple languages. (also spotted a rat around the back). There are much better places to eat"
        }, 
        {
            "index": 441, 
            "rating": "4", 
            "review": "Beautiful Pictures of serenity. This temple provides some tranquility in what otherwise would be a very busy, loud street. The views from the outside are stunning, but note that you will need proper attire within the temple itself. You won't need more than 20 minutes here, but do make sure you add it to your itinerary. Cafe Lotus sits on the corner of this temple property with views of the lotus ponds and temple. I would recommend a stop at the Cafe for a relaxing drink, or to get off your feet for a bit, but don't waste your money on the food."
        }, 
        {
            "index": 442, 
            "rating": "4", 
            "review": "Best stage I've even seen. That was the most impressive stage I've even seen. It's a great experience to go there during the day and back at night for the spectacle. Also enjoyed getting to know a bit more about their Hindu culture. Recommended."
        }, 
        {
            "index": 443, 
            "rating": "4", 
            "review": "Lovely. Very nice for a quick walk around. The pond is beautiful, the temple peaceful. Although you get a great view of the pond and temple from the Cafe Lotus, don't make the mistake of eating there: the food is third rate."
        }, 
        {
            "index": 444, 
            "rating": "5", 
            "review": "peaceful lotus pond. Walked around the lotus pond and then grabbed a Starbucks on our way out. The temple itself was very beautiful and peaceful when we were there.. Not a lot of people which was nice to enjoy."
        }, 
        {
            "index": 445, 
            "rating": "4", 
            "review": "Lotus pond, Temple, Starbucks. Nice temple with a beautiful garden lotus pond area. Spectacular in full bloom. I went to the temple, ate at the restaurant, had a starbucks and saw a fire dance there. The back alley behind the temple is fun to walk around at night and it's fun to play with the dogs and later watch them greet their owners when they come home from work."
        }, 
        {
            "index": 446, 
            "rating": "4", 
            "review": "Stunning at dusk. When everything is lit up and the fountains are going, just before sunset, this place is gorgeous. Worth a visit just to enjoy the ambiance and snap a few photos. Easily accessible just behind Cafe Lotus and Starbucks - no need to visit Cafe Lotus in order to see the temple."
        }, 
        {
            "index": 447, 
            "rating": "5", 
            "review": "ANCIENT AND REAL TEMPLE. This is a very unique and magnetic venue to visit. It gives thetraditional Balinese Hindu belief and knowledge to all visitorswho are interested in understanding where the heart of Balioriginates."
        }, 
        {
            "index": 448, 
            "rating": "4", 
            "review": "Beautiful lotus pond. I accidentally discovered this when I stopped by the Starbucks right next to it. The lotus pond and the path that leads up to the temple is beautiful, especially when it's lit at dusk. I didn't try the restaurant there but it definitely looked nice and relaxing. I think it's well worth a stop to spend about 10-20 minutes here to enjoy the tranquility and scenery."
        }, 
        {
            "index": 449, 
            "rating": "4", 
            "review": "Ubud - Hidden Paradise. If you came to ubud.. don't forget to spend your time about 20 minutes to visit this place, you can see the lotus pond and if you are lucky you can see this blossom Lotus Flower on the pond. you can visit the temple, taking picture.. How you reach here?? If you know the Starbucks outlet in Ubud, the entrance is between Starbucks and Lotus Cafe."
        }, 
        {
            "index": 450, 
            "rating": "5", 
            "review": "Peaceful hidden place. Beautiful temple with lotus/ watergarden- spacious green areaLarge cafe Lotus/ restaurant with good view, also gazebo for artclasses"
        }, 
        {
            "index": 451, 
            "rating": "5", 
            "review": "Temple with a lotus pond. This temple also known as water palace,located beside cafe lotus,with a pond full of lotus,beautiful scene,traditional perfomance held at night here,each day with different programs,better check first,if it rains,the performance will be moved to an indoor venue."
        }, 
        {
            "index": 452, 
            "rating": "5", 
            "review": "Lotus pond and majestic temple!. I stumbled upon this pura waiting for my friend buying a drink in Starbucks (don't judge!). This is located just behind starbucks and what a find. Great view. We went there early in the morning so we had the view to ourselves. Nice and peaceful."
        }, 
        {
            "index": 453, 
            "rating": "4", 
            "review": "Great temple and lotus pond. A really nice temple and lotus pond. Just drink a cup of tea in the lotus cafe wit a view on the pura."
        }, 
        {
            "index": 454, 
            "rating": "4", 
            "review": "Tranquil. Well worth spending a couple minutes in this beautiful water garden while you're in Ubud. The setting at night takes on a magical feel thanks to attractive lighting. Whether you enjoy a meal in the overlooking cafe or just stop off for some quiet reflection on your way back to the hotel after a night out, you are sure to enjoy the pleasant surroundings. Don't forget your camera."
        }, 
        {
            "index": 455, 
            "rating": "3", 
            "review": "Very nice pond with waterlillies. This is definitely worth a look. The pond can be viewed easily. The temple however can only be entered if you wear a sarong that you have to bring yourself.FYI the restaurant Cafe Lotus has a nice view of this but for the rest is nothing to write home about"
        }, 
        {
            "index": 456, 
            "rating": "5", 
            "review": "FABULOUS TEMPLE with wonderful Lotus Resturant next door. Just beautiful a backdrop for a fablulous movie ...it has 2 lotus ponds big as soccer fields !. Dancing exibitions , with beautiful seating at Lotus Resturant.Right on the main street about 2 locks from the UBUD general market...which is a hoot and a treat."
        }
    ]
}