{
    "category": "Ubud", 
    "entity": "Satria-Coffee-Plantation", 
    "avg_rating_stars": 4.093851132686084, 
    "review_count": 309, 
    "rating_stats": {
        "poor": 13, 
        "average": 43, 
        "terrible": 16, 
        "very_good": 91, 
        "excellent": 146
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "4", 
            "review": "Cat -poo-cino definitely worth the effort. Like most people it was included on a tour, but with just us and the driver it was a gentle pace and relaxing. The gardens contain a lot of local fruit, herbs and spices, so it was good to see them all growing together to get an appreciation of what the plants looked like. At the end of the tour you are given a taster of various teas and coffees, free. There was no pressure to buy anything at any stage. However, my husband is a keen coffee drinker and was keen to try to luwak coffee, so bought a cup. He was very impressed, I had a quick taste and it was a well rounded taste - however even here buying direct it was expensive. Definitely worth the trip. We saw the 3 civets in the cage, but my understanding was they were just there to show you what a civet looked like, and more were wandering around - although I might be wrong?They didn't seem stressed in any event."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Must see for caffeine lovers :). It was fantastic to see this. Great place for tea and coffee lovers.You can also buy special bali coffee and tea here."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Luwak Coffee. Love the free coffee testing and the info of all sorts of coffee. Purchase the coffee whichever you like."
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "We ended up buying 10 boxes. We actually ended up going here twice. The first time was through our driver that we hired to take us around for the duration of our stay. This was one of his recommendations. The 2nd time was on our river rafting excursion and that was a little more formal. Our first visit wasn't really much of a tour since we didn't sign up for one. But our driver basically set us up to see how the coffee was made and then to a taste testing session.*warning* this may be obvious, but they give you about 16 different cups of coffee/tea...just take sips! We actually finished all 16 because they were SO good, but on the drive home had a bit of a stomach ache lol. They also let us try this apple type tobacco which was pretty good too, but it is very strong and unfiltered so be aware of that.As far as all the teas and coffees, I mean we ended up buying 10 boxes to go so that goes to show that they were VERY tasty and the lady sold us on how each benefits you health wise (whether it be true or not). And yes, we did try the Luwak coffee (cat poo coffee) and it wasn't really that bad. Just the idea probably will turn people away. But we did it to just say we tried it. There are other plantations around Bali so I'm not sure if there is a difference or not but I would recommend taking an hour to drop by one and trying all their flavors!"
        }, 
        {
            "index": 5, 
            "rating": "3", 
            "review": "Coffee plantation was interesting but the luwak Cat is like a slave !. I wouldn t go there again as those poor animals in a very small cage are showing mental problems due to there bad life kept in a cage. If you feel nothing looking at that / you have no heart and respect for life .. The staff was friendly the place is nice.they could still do there business without those animals there.."
        }, 
        {
            "index": 6, 
            "rating": "2", 
            "review": "Great little stop-off except for one thing... This a beautiful plantation with nice gardens to wander around and see the different tropical fruits as they are grown. The place has a very generous business model in which you can try the teas and coffees for free and choose if you want to buy. Unfortunately this is all spoiled by the presence of caged civets. These are the animals used to produce the Luwak (cat-poo) coffee. The cruelty issues associated with keeping these predominately solitary, nocturnal animals in battery cage conditions is well documented. The demand for the gimmicky coffee only encourages the continuation of these horrible practices. If I had done my research before I would have stayed away. If you do choose to visit, by all means enjoy the teas and coffees but please say no to a cup of Luwak."
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Nice coffee & tea. Our guide was very informative.We did a taste tester of all the different coffee & tea they offer. My favs we're the Luwak coffee & Lemon tea.There are assorted animals & birds through out the plantation aswell,which is pretty cool.You can take pictures with one of the baby Luwaks for a fee.At the end of the tour you can buy coffee & tea from the store.I'd recommend this place if your a coffee or tea lover."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "Cat-poo-chino :O) you have to try this coffee lol. Well worth the stop and visit :O) ...... you are given free samples of all the teas and coffees they have to offer and it is a small cost to try the special Lewak coffee ...... Cat-poo-chino lol Lots to see ...unusual things/plants to see ....interesting. Good shop where items of interest `T` shirts / Rice Wine / large selection of tea`s coffee`s etc are not too expensive to purchase/take home gifts :O)"
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Showcase for coffee. Attentive service and guiding around this plantation, which shows different plants, and gives you free samples of various concoctions from coffee, and chocolate to more herbal things and mixtures. Expectation that you might purchase so the driver can make a commission."
        }, 
        {
            "index": 10, 
            "rating": "3", 
            "review": "Coffee not good and really expensive. This is one of those tours where you feel like you are forced to buys inferior products due to the free tour and nice staff. Tour was educational but coffee was so horrible and though well I do like one of the teas. Equal to $10 USD for a portion of less than 10 teas."
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "Unexpected visit. Our driver pointed out the coffee plantation when we were driving through Ubud. We popped in and were quickly whisked through a small pathway with a guide. Our guide pointed out and explained the different coffee plants and tea leaves. You are given free samples of all the teas and coffees they have to offer and it is a small cost to try the special Lewak coffee. We were lucky enough to hold a Lewak and get a photo with it. Overall was an enjoyable visit and is worth the small cost to try the Lewak coffee."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Must Visit in Bali. Driver recommended this Coffee Plantation and it was incredible. The whole family enjoyed it even the six year old. The tray of teas and coffees were delicious, my favourites were coconut coffee, vanilla coffee and mangosteen tea."
        }, 
        {
            "index": 13, 
            "rating": "4", 
            "review": "Poo coffee, surprisingly good. For the moment we arrived we were so very well taken care of. Our host was simply delightful. This is a fun and educational activity and we learnt quite a bit.The tasting tray of teas and coffees is excellent and there is absolutely no pressure to purchase anything.The vanilla coffee and lemon tea were winners with us but the real surprise was the poo coffee - it was really good.The chocolate samples were enough to send us off to the shop to make a few purchases but at no stage did anyone pressure us to buy anything. This is a really interesting stop on the day trip to Ubud and we enjoyed it very much."
        }, 
        {
            "index": 14, 
            "rating": "4", 
            "review": "A coffee garden in the green. For those who wanna see the process of making Luwak coffee and this day sleeping animal - Luwak ( Only active and hunt for their food at night ) This is the right place to go. Although I didn't find the Luwak coffee to be as good as what I was expected but they do offer other selection of unique coffee variant to try on for free. Plus a beautiful padi field view, I believe this place can offer a moment of stamina restore after a tired adventures from other tourist spot."
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Delicious, fun and educational. As we were nearby at the Holy Springs, my local tour guide suggested we stop by the coffee plantation and it was amazing! I got a tour of the forest where they grow many different types of beans and plants. I even got to roast some coffee beans over the fire. The smell and feel of the warm beans was magnificent. After the tour, I got samples of delicious and natural teas and coffees. I chose to purchase a cup of the lewak coffee--which was delicious. Naturally, I bought some coffee and the best dark chocolate to bring back to NYC. Such a great experience!"
        }, 
        {
            "index": 16, 
            "rating": "4", 
            "review": "Great!. You get a free tour and free coffee and tea to try which is great! Poor animals in cages though which you clearly see don't have enough space to walk around .."
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "Interesting and beautiful. The plantations visitor area is set on a hillside overlooking beautiful views of the jungle. A guide shows you how the Luwak coffee is traditionally produced by demonstrating the shelling, grinding and filtering process, and you get to meet a couple of Luwaks although as they're nocturnal I don't think they appreciated being woken up by a poke in the backside on a rainy afternoon. From here you're taken to a tasting area where a selection of teas and coffees are offered to you to try,as is a cup of Luwak coffee but this isn't free but is is IDR 50,000. From there you go on to the shop where several products are offered to you including the very highly price Luwak coffee that personally I don't think is worth the price for its taste, but the cost isn't unreasonable as its entire production is done by hand and is very intensive. This is only a short visit but was a very interesting and worthwhile one."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Informative guide and great birws. This is a must see in Ubud - an informative guide takes you round the plantation and, at the end, you and your party get a number of free samples to drink overlooking the most beautiful of views. Definitely try the Luwak coffee!"
        }, 
        {
            "index": 19, 
            "rating": "3", 
            "review": "Interesting and educational with good free samples. It was interesting to hear all about the processing of the coffee especially that of the Luwok. Once we had samples we went to the shop where we were followed around by the server (clearly commissioned based) and didn't look that happy when I didn't want to buy anything but pay for the coffee we had. If I could give it 3.5 rating I would, it wasn't average but it wasn't very good either."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "Educational and fascinating with good samples. What an amazing experience! This was the highlight of our day trip. So many things to see here, not just coffee! Ginseng, cinnamon, pineapples, giant passion fruit, ginger, turmeric, papaw, lemon grass, coco plants, and a variety of tea. You can see the cats that poo the coffee, surprisingly they were asleep despite all the coffee! The coffee her was fantastic and we bought a cup each and enjoyed the view once our tour was over. Highly recommended!"
        }, 
        {
            "index": 21, 
            "rating": "2", 
            "review": "Not worthy . They give u 3 variety of coffee and 6 variety of tea for tasting and will explain u the benefits of all the tea variety for the special coffee they charge 50000rp(if u want to taste).its like a small nursery where they have a kept some trees. 5000rp for parking"
        }, 
        {
            "index": 22, 
            "rating": "4", 
            "review": "Great tea's and coffee !. Very relaxing, no pressure to purchase anything, the tea tasting was great, the coffee was good, the surrounding forrest was beautiful, bathrooms not so..."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Luwok Coffee. This was amazing I am not a coffee drinker and I was made into a believer with the Luwok Coffee. I bought one kilo of it and I intend to buy much more. Also I bought the turmeric tea which I love and will be ordering more of in the future."
        }, 
        {
            "index": 24, 
            "rating": "4", 
            "review": "Interesting visit. I enjoyed wandering around the place and learning about the coffees here. The coffee sampling is worth sampling and I also purchased some coffee to bring home."
        }, 
        {
            "index": 25, 
            "rating": "1", 
            "review": "Over rated. Not very scenic , felt like you were herded to the different areas so they can sell u overpriced coffee."
        }, 
        {
            "index": 26, 
            "rating": "3", 
            "review": "Come here only if you really want to buy coffee or tea. The coffee was delicious you get to sample about 9 cups. After you taste all the samples you can walk around the coffee plantation not much to see. I did like that the sales people weren't pushy at all. I would only recommend this place if you are going to purchase tea or coffee if you're not doing waste your time...go to the beach instead."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Delicious coffee!. Entry to this place is free so it is definitely worth the visit. You get free samples of coffee and at the end you can buy as much as you want. You also learn about their methods and the animals used to make the coffee.Highly recommend!"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "suprisingly informative. firstly I suggest going with a guide, as this was only made into a great visit because our driver came with us to explain everything as we walked through, otherwise it would have been a walk ended by some coffee. So, as you walk through your guide will explain all the plants that you see which was pretty amazing - cocoa plants, papaya, lemon grass, coffee plants, passion fruit, pineapple, vanilla etc. then we were greeted by a cute little lady that showed us how the coffee beans were roasted and ground, she then took us up to try over 10 I think, free samples of coffee and tea, overlooking an amazing view. The whole experience was amazing "
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Loved it. you get to taste many varieties of coffee and tea free of cost, brought home coffee and tea and perfumes and essential oils"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Great spot very educating. As a person who has been to Bali many many times i still look out for scams and tourist traps, lucky this is not one, just a short tour through garden with informative guide about coffee ,then you get to try teas and coffee's, ,all they ask is for you to look and maybe but from there shop on way out which we did,a bit costly but very good produce soworth it....enjoy its great fun"
        }, 
        {
            "index": 31, 
            "rating": "5", 
            "review": "Interesting tour. It was interesting to visit the plantation because the guide takes you through the various processes needed to make coffee, plus they show you the various plants grown at the plantation. Free taste of teas, coffee, hot chocolate and tobacco are offered - you need to pay a bit for the Luwak coffee though (I say it's worth it!). There's a shop with a lot of offerings to choose from - tea, coffee, spices, chocolate,natural beauty products, essential oils.."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Excellent, informative coffee plantation tour. Well-planned tour, allowing many interactions at various stages of the coffee production process. Included is a tray with many different types of tea and coffee to taste. You have to pay extra for the Luwak (\"catpoochino\") coffee, but it is a price worth paying."
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "Looks good, tastes better. Great little tour of the coffee roasting process and how each mix is flavoured. Ideal for a nice sunny day and coffee tastes great too! Wonderful tour guide Olid explained each flavour and gave us our first taste of the well known Luwak coffee!"
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Informative & delicious. Great opportunity to see how the teas & coffee are grown, processed & cooked. Yummy chocolate & delicious teas family made & served with a shy smile. Thoroughly enjoyed our sampling & brought lots of stuff home for us to enjoy when our holiday came to an end. Worth the effort!"
        }, 
        {
            "index": 35, 
            "rating": "3", 
            "review": "Just got to taste the tea/coffee, no explanation!. We visited here on a day trip. It was a nice place, you got given a tray of testers which could be shared between the two of us. However was just a marketing ploy to buy the tea/coffee afterwards. Our waitress sat with us and played with our little baby (which was lovely!) however it was just so that she could earn her commission. It cost 50000K to have a coffee that the beans are of the animal... We dont drink coffee so was a bit of a waste. Maybe if you are an avid coffee fan you may enjoy this"
        }, 
        {
            "index": 36, 
            "rating": "2", 
            "review": "If you are not a fan of coffee, it is not the place for you. They don't really tell much of information how they make coffee and tea. Just showed some part of the place, told us some small info, the animals slept already, tried some coffee and tea. Got some back home but tea was not that good not like at the place...wish there were more stuff to see like can get close to coffee and tea planting area and more details about it"
        }, 
        {
            "index": 37, 
            "rating": "3", 
            "review": "It's OK. I am a big coffee drinker. I had read good reviews from both trip advisor and a couple of tours books, so I requested our private driver to make a stop at Satri. I did walk through the plantation and sat with my family to enjoy free samples and IDR50K worth of Luwak Coffee, I bought some teas and coffee afterwards. There are so many coffee stops and plantations throughout island, I had checked a couple of others. I did not quite understand why Satri? The coffee is ok, just like the other two places, Other Ginger/Herbal coffee or teas samples are on the average side. The view of plantations is nice, but with too many tourists. I would recommend you make a stop if it’s on your way, not worth a detour. "
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Amazing (And I hate Coffee). When my partner and I stayed in Bali last year we went white water rafting. Our driver took us to this coffee plantation on the way there. Before going there though my partner and I didn't really want to, it was a long drive and neither of us really drink coffee.When we got there we had a tour and then a free tasting of all the coffee and tea they had. There was about 10 and they were all amazing. We couldn't believe how fantastic it was. Coconut coffee was our favorite whilst mangosteen and ginger were among the best. We didn't have any money on us while we were there, we were devastated because we couldn't buy anything, but our amazing driver told us he would buy it for us and we could pay him back when we got to our hotel, so we took him up on the offer. Unfortunately my partner lost the coffee on our last day in Bali at the beachwalk shopping centre, for some reason she took it with her and it was never to be enjoyed or seen again.I'm still mad at her to this day for it, its half of the reason why we are going back to Bali in September, can't wait to go back!I recommended the plantation to a friend at work and he loved it as much as we did. The coconut coffee was his favorite also."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Gourmet coffee tasting. Very friendly and informative guide explained all my questions. Tasted several different coffees and bought coffee and tea."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Nice tasting and grounds. Our guide stopped here. Though a bit commercialized there are many nice fruit trees and coffee and other plants to see. Then the nice tasting. Many different flavors that we're all pretty tasty. Prices seemed fairly high but comes with the territory. Worth a stop."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "amazing !. In the middle of all the hustle bustle is this tranquil place. Free entry , staff so informative and the tea's are so delicious ! loved the red ginger and mangosteen. try and walk out without buying some ... haha , trust me you wont !!\nNo probs bringing it back to aus either as its processed .\n\"Catpoocinno\" haha"
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "A beautiful place. I love this place! It's so beautiful and amazing. The people are so nice and the coffee/tea tasting on the end is awesome. The trip takes about 30 minutes. Everything is free except the luwak coffee and the souvenir shop. The only think I didn't like was that the souvenir shop was very expensive."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Worlds most expensive coffee taste test! Hmmm didn't taste like poop!. I was asked by my personal tour guide if I liked coffee. Of course I do! So he took me here. BEAUTIFUL plantation sights and then the poo of the Lewark coffee was introduced. I tried it. It wasn't bad but the thought had me kinda grossed out. I recommend going here! great experience!"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Sample City. Fun stop while touring around. Learned about how coffee is grown and roasted. Had a great time tasting all the free coffee and tea samples. Ended up buying a bunch of varieties to bring home, including some perfume for our daughter."
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Well set out coffee experience!. This place does not look like much from the front but once inside you are given a tour of the coffee making process and you are able to sample all sorts of teas and coffees in a spectacular setting overlooking the jungle. For coffee lovers I recommend trying and Lewak coffee as it is fantastic!"
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Coffee anyone?. Excellent visit learning about different coffees, very interesting grounds, good shop, brilliant staff who took time to explain. Glad I went. Thank you."
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Great place to stop and try this unusual coffee. Great place to try various coffees and actually see the Civat or Mongeese that create this unique coffee. Put some mossie spray on 1st though."
        }, 
        {
            "index": 48, 
            "rating": "4", 
            "review": "Great coffee experience close to Ubud centre. Located near Ubud this small enterprise offers an insight into their larger plantation. Get to see the luwaks (or civet) and get to sample the teas and coffees. Free entry but they do have a little shop where you can purchase."
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Wasn't expecting this to be do interesting. We went to the plantation as part of a day tour. I'm not a big coffee drinker and wasn't expecting much from the visit. What a pleasant surprise. It was great to see how all sorts of plants grow naturally. As well as coffee we saw vanilla, pineapple, pepper, ginger to name a few.We were offered 9 tea and coffees to try and given the option to buy, but with no hard sell.Well worth a visit."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "One of the best experiences in Bali. I was really impressed about the Coffee Plantation. It is indeed a must see attraction. There I could see how coffee, cocoa, tangerine trees really look like, also I could see the animal that \"makes\" coffee (Luwak), pineapple plant, cinnamon tree, vanilla plant and so many other exciting plants. They offer free tasting drinks(I recommend the herbal tea and lemongrass tea), and for 50k Rp you could have a taste of the Luwak coffee(it is very strong coffee). Also they have a shop where you could buy coffee and tea souvenirs and a bunch of other great stuff.The staff is very friendly and polite and very good English speakers, explaining you all of the processes for making coffee and growing the other plants. There is no entrance/visitation fee."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Worth The Visit. Whether you are a coffee drinker or not you will enjoy this stop. You pull into the parking lot and immediately begin walking down a path with a variety of coffee plants. Our driver pointed out the different varieties but there are guides available who work here. You walk past a couple of the cats that make the famous Luwak coffee. Then you will see a demonstration of how the coffee beans from plant to coffee. Afterwards, a guide will escort you to the tasting table where you will be given a sample of 12 items - 4 coffee, 4 teas and 4 hot chocolates. You will be given the option of tasting the Luwak coffee for 5 dollars....we shared 1cup. It tasted slightly less bitter than regular coffee. Then, you have the opportunity to go shopping at their building where you can purchase all the items you tasted plus a variety of spices. Note these items are expensive but we has a lot of fun & love buying things like this as souvenirs. I definitely picked up some saffron that I thought was a bargain at 6 dollars for 1/2 oz consisting the cost in the States.....and 1/2 an oz goes a long way. All in all this was a worthwhile visit that I would do again."
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Intersting place. Was guided by a local guide thru how the signature Luwak was produce. Seen many other types of assorted fruits plants/trees instead. Towards the end of the trip, was been brought to a rest stop to an open-air pavilion where they serve you their various beverage menu for try out.Very educational trip!"
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Absolutely loved this place. Our driver suggested that we come to the coffee plantation during our day trip and as neither of us like coffee we thought it would be a bit of a waste of time. However I was so wrong! It turned out to be one of the highlights of the trips! Our guide spoke fantastic English and she pointed out the coffee beans on the plants, the pineapple plants, aloe Vera, lemon grass etc growing out in the fields. We were showed the coffee beans in their natural form and then when they were roasted. I even tried my hand at roasting the beans and pounding them into ground coffee. We tried 15 teas and coffees and all were nice and some were amazing. The coffee does not taste like the usual coffee served back home so we loved it. There is a huge shop where you can buy the tea and coffee as well as some lovely gifts. Yes the shop is a little expensive but you don't pay for the tour and it was very educational. If you like food and learning how it grows and is processed by hand then this is the tour for you."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "Really interesting experience. Much more than just coffee!. We really enjoyed this, but we had a great guide which really helped. He talked us through the whole range of different fruits and plants, breaking off leaves so that we could smell them. We saw other guides just walking straight garden to the coffee and tea area. The tasting is free although here's an obvious expectation that you buy something which we were fine with considering the time and way we'd been looked after as well as the wonderful slection of free teas and coffees. Love place overall and a welcome stop on the tour. Not too sure about how well the animals are looked after as there were three of the civets in small cages which we didn't care for. I'd like to think they let them out to forage for the coffee but either way it's not something I can condone."
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Very nice!. This was a brief coffee stop during our day tour. We were shown around the plantation by a nice employee who taught us how the coffee was made and especially about their special luwak coffee. It was interesting to learn and at the end we were given free samples of their teas and coffees to try along with some banana chips. I don't really like hot drinks but tried a few and must say that their vanilla coffee is divine! My partner tried all of the samples and paid a little to have a cup of the luwak coffee which he said tastes rather fruity. Overall, it was a very nice visit and we are planning on returning before leaving Bali, to buy some coffee to take home with us."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Nice tea. Was a nice visit learning about the coffee process, the tea was nice and refreshing with an enjoyable atmosphere and scenery"
        }, 
        {
            "index": 57, 
            "rating": "4", 
            "review": "Beautiful and fascinating tour. If you enjoy seeing where tropical fruits and veggies grow, this is a good tour for you. We saw citronella, lemongrass, cacao, papaya and banana trees among others. Also the famous Luwal (cat poo) coffee was fun to learn about. You can sample a set of their herbal teas and coffees for free. PS - do not buy fragrance items from their gift shop because they are way overpriced and you can just get similar items from Ubud Art Market."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Try a Little of Each!. A wonderful little location for seeing coffee beans on the tree, vanilla vines and even papayas. Learn how the coffee beans are processed and then relax while they set you up with coffee and tea samples. Explanations are given and you are able to enjoy the views as you sip away. Shop for yourself or friends as they have tea, coffee and spices on hand!"
        }, 
        {
            "index": 59, 
            "rating": "4", 
            "review": "Interesting. An interesting guided tour to see the various spice and coffee plants. However, like many of the plantation tours, the tour is quick and you are led to the coffee tasting with a fantastic view and then to the spice shop. Interesting if you have never done it before."
        }, 
        {
            "index": 60, 
            "rating": "3", 
            "review": "Not my best port of call on my visit to Bali. Rather commercialised and canned type offering. Also quite pricey if I remember correctly. I love Kope Luwak and but every time I visit but the presentation here and the caged civits di not impress me. Sorry to say."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Wonderful guide. knowledgeable. We had a wonderful young man as our guide through the plantation. There where many tasty samples of different teas and coffees which you could try for free with an explanation of each one. You did have to pay $5 aus for the Luwak coffee but I felt this was well worth it after you hear how the coffee is made.Well worth a visit."
        }, 
        {
            "index": 62, 
            "rating": "4", 
            "review": "Coffee Lovers Paradise. For those who love coffee this is a must visit on your way to Ubud...do not forget to taste the Cat Poo coffee...!!"
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Coffee and Chocolate!. Visited the coffee plantation during a bike ride. We parked up and wandered through a well set out garden full of cacao trees, mangosteen trees, coffee trees. Very peaceful. Our guide gave us a run down on each of the trees and how they are used. We saw a little palm civet, the cute little animal that part digests coffee beans which are then used to make (I think) the most expensive coffee in the world. These little animals are caged for a month and then set free. We tried a selection of coffees and teas and I really recommend the coconut coffee which is delicious. I bought a packet plus some dark orange chocolate which is so very good. The Balinese at the plantation are charming and engaging. I really can recommend a visit here."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Must Go. This place falls on the way to udad temple if i remember the name correctly. It was not in our itinerary but our cab driver stopped here and told its a nice place u should go there. He was right we really liked the place not due to animal or art but due to the overall feeling. And the variety of coffee was amazing they give you small shots of coffee free of charge so that u can decide which one you want to order. Few of them were so nice that we ended up even buying the packets of coffee. Overall a nice break in between the journey."
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Quick Kopi Pitstop. We stopped here with our cycling tour...nice little walk through their plantation (cute jungle/rainforrest) The Coffees & teas are definitely worth a try, while enjoying the views. We also bought some of their Chilli Chocolate...which had a gr8 afterburn. Worth a quick stop!"
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Plantation. Was recommended by our driver. We found it peaceful and a great experience. Yes, you can buy their products, but you don't need to. You will enjoy it."
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Wonderful spot to stop . We loved this place. An amazing view and area to get some great pictures. You get to try out a selection of coffees and teas. I don't even like tea and I walked out buying some it was so good. If you want to try the kopi Luwak coffee it is 50,000 rupees per cup. Souvenirs costs between 100,000 rupees to around 250,000 but they do accept common forms of credit cards in the gift shop as well. The staff is also super friendly and knowledgable. Bring your camera and enjoy your time. I highly recommend this stop along the way."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Interesting. This was a great insight into how coffee is made, we had a great tour person who was very knowledgeable. The free coffee tasting at the end is a nice touch too"
        }, 
        {
            "index": 69, 
            "rating": "4", 
            "review": "Kuwak coffee and great teas. A nice roadside stop for delicious tea, a small tour and my first taste of Kuwak coffee. Friendly staff. Pricey for the coffee but a great gift."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Interesting place. A very interesting place to try coffee and tea at, the staff were very friendly and welcoming. they had nice flavored coffee, i really liked the Balinese ginger coffee and the mangostine tea. I took some back as a souvenir and now I'm really sad that they are almost over. :("
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "great teas & coffees to sample. something different to do while on holidays, this was a great experience, so many different beverages to sample, i was not sure about going here but truly enjoyed it - give it a go !!!!!!"
        }, 
        {
            "index": 72, 
            "rating": "4", 
            "review": "Interesting place to visit.. Interesting to see the different spices and coffee growing and how it is harvested. The little animal in the cage didn't look too flash. The tasting was very much enjoyed by our tour group. The Coffee Luwak was the best tasting coffee I have had. The different teas were also well worth trying.The prices for tea etc ok little on the expensive side but they are allowed through Aust customs which is a bonus."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "Tea and coffee are amazing , but poor animals . People who work there are extremely friendly . They laugh with you . Talk to you . Treat you in a nice way.First they took us in a tour to show us plants there and coffee bean trees.And other spices trees.Then they show us the animal it self that eats coffee beans and then poop them \" it called Asian Palm civet \" looks like a wild cat .The coffee comes from this animal called Luwak coffee and it's extremely expensive .There are different kind of tea there and some taste great and some taste just ok . Few kind of coffee and some taste good some not . They make you taste around 12 kind of coffee and tea for free but to get a cup of Luwak it costed us 50000 rupiah . And they show you how to make coffee from zero to the cup.Poor animals were sleep at this time because they wake up at night and eat coffee bean . Workers there claimed that this animal eat the good beans and refuse to eat the bad ones . And they actually don't force it to eat beans \" I doubt it \" as they love it eat it anyway. The rest of the day they feed them banana and pineapple . Anyway it was a good experience but I home they were honest about being good to the animals and if they can just release it from the cage .Ps. They have a small market and they sell all kind of coffee , tea , massage oil , perfume and chocolate . But it's not the cheapest choice ."
        }, 
        {
            "index": 74, 
            "rating": "4", 
            "review": "Taste, taste taste. we had possibility to get to the plantation and taste several coffee and tea from fruits we have never heard of... It was amazing, especially get to know background info about them and their healing effects. Nice experience, we have bought some as a souvenir and for private use."
        }, 
        {
            "index": 75, 
            "rating": "1", 
            "review": "Keep away. This is a horrible tourist trap that most driver's just stops at even if you do not wanna go..totaly vaste of time and money.The worst thing about this place is that they keep the animals in small metal cages that are out on display all day and theze are nocturnal creatures that get stressed by this life.You will be given a pretty story if you ask but it is all a lie when they say that the animals is just staying there for a short time...it is not true and theses animals sufferers a lot and are just feed coffee beans so they can make expensive coffee beans in an industrial way a not as is should be done by collecting the beans from the wild animals in the nature.This place should be removed from this list and make a 180 and walk fast away.Not recomended and will never ever go back."
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Little gem. Surprisingly good. Had a guide to take us through the spice plantation and then an extensive tasting plate of different tea and coffees. You had to purchase the cat. Poo coffee for about $5 but worth it to try. They have a lovely gift shop with realy food stuff. Try the organic chocolate. No pressure sales."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Try everything and be prepared to buy everything too!. So many different flavors of teas, coffees, and of course the world famous lombok coffee that is native to Bali. Definitely get the sample platter and try everything, you'd be surprised how much you'll enjoy each one. Our taxi driver suggested that we stop here on the way to our hotel and we thought he was just trying to hustle us so we were a bit apprehensive at first but this ended up being one of the highlights of Ubud. This is a MUST taste! lol"
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Nice visit. Worth a stop on the way to somewhere else. We went on a tour and it was in-between temples. I couldnt get over that Ludwig coffee where the little creature eats the coffee bean then poos it out then the woman washes it all off then roasts the coffee and gives you a taste (I wouldn't try it) but apparently it is a luxury item. Not for me - I really liked their assorted teas though."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Free taste of teas and coffee. as you walk into the Tasting are you pass but countless varieties of fruits and spices. They serve samples of 4 coffees and 7 teas which can be purchased in their shop. Great experience."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "Favourite stop on our day-long tour of Ubud. We ventured around Ubud on tour of about 6 different landmarks, this was probably my favourite stop. You didn't have to pay entry fee and we got a fantastic tour guide who explained everything at their plantation and answered all our questions. Was absolutely fascinated by everything they grow there, from Durian to pineapple, to ginger, tumeric, peppercorns and lemongrass. The coffee and tea tasting was fantastic, we were suckers and ended up buying a fair bit of stuff, but have brought it all home and everyone that has tasted it has enjoyed the product as much as we have!"
        }, 
        {
            "index": 81, 
            "rating": "4", 
            "review": "Coffee Lovers Will Enjoy It!. A peaceful place and you will be greeted by a staff who will teach you how to value good coffee. I love the vanilla coffee very much. The coffee body scrub sold here is quite cheap as well."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Pouring tropical rain but still had a blast. the herbal teas and coffee tasting was great tried the famous cat poo cino too.excellent!\nThe staff were brilliant well able to explain the process from plant to cup as done one onsite, we thought the chocolate was delicious but a bit overpriced.\nWorth a visit if you love coffee"
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "enjoyable. tasting, knwing every single detail in the coffee plantation world was a bliss for us. However we bought many tea bags and coffee. it was kind of expensive though. We tasted the luwak coffee known as the golden coffee! A new experience"
        }, 
        {
            "index": 84, 
            "rating": "1", 
            "review": "Nice view, however coffee and essential oils from the gift shop are poor quality. It's good for a short break;Lovely view;People who work there are nice and speak very good english;The coffee was instant quality. As a regular coffee drinker I was disappointed. The Luwak coffee was not that good either. I perceived it more acidic that the \"Bali Coffee\" , even if locals describe it the other way around. I had doubts about what goes into the coffee and tea that they sell. There are no ingredients listed on any of the packaging. The employees were able to describe the processing of the products in detail,insisting on the bio qulaity. I ended bought a few souvenirs, including two tiny bottles of essential oils. Two months later after arriving back in Europe I checked the recipients .  The top of the recipients is sealed by a rubber/plastic foil which has a powerful chemical smell. So much so that it almost neutralizes the scent of the content.  The consistency is as fluid as water.I threw everything out and decided to not to gift any souvenirs."
        }, 
        {
            "index": 85, 
            "rating": "1", 
            "review": "Tourist trap. Expensive shop with fake tee.. Local drivers get their share to take you there. On the way from the airport to Ubud our driver asked us if we wanted to stop somewhere on the way, for coffee. We said no as we were tired. After some time the driver said he needs a break and will have a coffee if we do not mind and took us to this place. The guy talked interestingly about plants they have and civets but he also said some things that are hard to believe, for example that they keep the animals in cages only for one week, then they catch another one from plantation and they replace it with the one in the cage. Then they give you some teas and coffee to taste which are nice but very very sweet. This part is also nice. Then there is a shop where you can buy low quality tees for exorbitant prices."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "A gorgeous view, coffee tasting, but I wouldn't buy anything there. My guide took us here and it was certainly a beautiful place. We sat down and they brought us a whole number of coffees and teas to taste - free of charge! So that was nice. However when I inquired about purchasing I was shocked at the prices. About 15$ for a small bag of coffee!!! I want to support local farmers and markets but that was exorbitant. I'm happy there but I wouldn't consider this a must do."
        }, 
        {
            "index": 87, 
            "rating": "3", 
            "review": "Interesting but not essential. Visited the Satri Coffee Plantation as part of a tour. It was interesting looking around the site, learning about how the different coffee flavours are produced as well as tasting. We did actually buy some Balenese coffee but my impression is that it was a pleasant experience but not really a \"must see\""
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Great Place. This was a great place to go to on a rainy day and check out how certain coffee beans are made! They have an amazing staff who guiding us around telling us about the process of the coffee and how it all came together. At the end you get a sample of coffee and tea and then you are able to buy bigger cups and sip on them overlooking a beautiful view. They also have a shop at the end where you can purchase the coffee and tea! They make great presents for friends and family back home! I loved the Bali coffee and lemon tea the best!"
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "Coffee tasting is delicious and interesting. Fun experience but feel very badly for the civets. I'm sure they could give them much better living conditions, especially for the high priced coffee they provide the owners."
        }, 
        {
            "index": 90, 
            "rating": "1", 
            "review": "Waste of time. A tourist trap. I recommend you remove it from the itenerary. I am not sure what is the point of having this. This coffee is not even drun in Bali."
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Pleasant & Genuine Experience. A short walk down their path, surrounded by coffee and cocoa, leads to a woman heating and grinding coffee beans.. they explain whats going on, the stages, then move onto the tasting table a few minutes walk away... they prepared 12 different drinks.. about 8 coffees, 1 hot chocolate and a few teas and we tried them - some interesting combo's.. then we went to their shop.. Given that it was all free, I was happy to buy a small bottle of their massage oil. Whilst it was slightly overpriced, the fact that the rest of it was free, and the girl explaining things was a genuine girl trying hard (and clearly from a poor background), I was happy to do so (and tip her).. Personally enjoyed this short visit"
        }, 
        {
            "index": 92, 
            "rating": "2", 
            "review": "Not for people who really know coffee. The coffee plantation is nice, full of different plants, pretty good for children maybe. But we were hoping to find some good coffee, but the coffee they have is really low quality, with lots of artificial flavoured coffee. We were pretty disappointed."
        }, 
        {
            "index": 93, 
            "rating": "3", 
            "review": "informative. nice informative walk through the gardens. explanation about the tropical plants like coffee plant and so on... coffee and tea testing with of course possibly to buy afterwards. bit expensive but still acceptable as small souvenir for friends."
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Must Do. went there from elephant ride and after being shown different plants and being offered to dry and then pulp the coffee beans they take you to there little shop and make you a tray of 12 different drinks, (free) to try and purchase if you wish. Webtried them all and then purchased some from the shop to bring home, all the processes are the same as traditional no mods to make it, even an old lady roasting the beans over a wood fired stove, short tour but is a must"
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Coffee made from poo!. Loved it! Didn't know what to expect but was good to learn something different , it's all free.... The hosts are lovely ... Never laughed so much in a long time! Wasn't going to drink it then though I'll never do this again why not? I enjoyed the coffee.."
        }, 
        {
            "index": 96, 
            "rating": "3", 
            "review": "Mixed feelings. Whilst it was interesting to learn about kopi luwak, the coffee was not out of the ordinary in taste and doesn't justify the cruel conditions under which the animals live. (Would there be any justification?) In spite of the touristy spele, the animals are not allowed to roam free nor do they live in clean enclosures. Being able to taste test the range of teas and coffees was fun."
        }, 
        {
            "index": 97, 
            "rating": "3", 
            "review": "coffee farm. ok not what I expected not very big,most of the time is spent tasting different teas and coffee, and to buy coffee there a bit pricey"
        }, 
        {
            "index": 98, 
            "rating": "2", 
            "review": "Tourist trap but enjoyable testing. Quick walk into fake plantation and then you can try all their thes and coffees. We enjoyed the testing (20 glasses for free). Their Luwak coffee at 50000IDR is not very good and too expensive. If you are french or italian do not try it, it looks like a bad instant coffee, you will be disappointed. Product in the shop are super expensive, but if you need to bring back some gifts they are fine for it."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "Great. The tour is nice and quick to show you how the coffee is made. The staff makes you feel comfortable and is very kind. Great experience."
        }, 
        {
            "index": 100, 
            "rating": "4", 
            "review": "Interesting & staff are informative. I'm not a coffee drinker but really enjoyed this little tour. Our guide was very well spoken when it comes to english. Was interesting seeing the Luwak and hearing about how the coffee is made.We did purchase a bag of the vanilla latte coffee powder which unfortunately didn't taste anything like what he'd made us at the coffee tasting :("
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Beautiful outing - to see spices growing in nature, coffee tasting. Loved our somewhat unplanned visit here. You get to see and experience the smells of many natural spices and herbs by walking through the jungle plantation. You then have the opportunity to see how coffee grows and is made the Balinese way. There is no official tour (our driver came with us), and the visit itself is free. At the end, you are rewarded with an array of 20 different coffees and teas to taste, which will blow your tastebuds away.Of course, there is probably an expectation that you will buy some of the coffees/teas in the shop, though we found these to be great gifts for people back home (much higher prices than average in Bali - but it is for tourists, no?). Make a stop here. Really something fun and natural to enjoy."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "Yum. You are shown briefly around the plantation, then whisked away to tastings ( my favourite part)' delicious , try the Luwack coffee most expensive in the world..then off to their shop to buy your favourites."
        }, 
        {
            "index": 103, 
            "rating": "3", 
            "review": "Tourist trap. The welcome coffee and tea was interesting. Difference preference for everyone, but you should be able to find something you like. I particularly loved the coconut coffee. Just try and take a look at the shops, just leave if not interested. It was a stopover from my day tour, I wouldn't particularly come all the way for this."
        }, 
        {
            "index": 104, 
            "rating": "3", 
            "review": "Trying Bali Coffee was nice. It was interesting trying all the Bali coffee's and teas they had to offer. I really enjoyed the vanilla coffee, ginger tea, lemon tea, and coconut coffee. The normal Bali coffee was a bit bitter and the hot chocolate was not 'milk' chocolate. I went to a couple of the different coffee places as well (part of different tours you can do in Bali) and they all had the same things. Always worth a try when they give it to you for free as part of the tour! Enjoy!"
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Taste the legendary Kopi Luwak.. The famous Luwak coffee is certainly something to cross of the list when in Ubud. Along with a beautiful selection of teas and other coffee flavours given to you on a plate to taste, you can learn more about the famous 'cat poo coffee' and purchase some from the gift shop at a fraction of the price that it sells for in the UK."
        }, 
        {
            "index": 106, 
            "rating": "3", 
            "review": "mini tour of coffee planation. Basically ended up a self guided tour because the guide gave very little comments other than the basic information of the site. More could have been said about the types of flora and fauna in Ubud Bali. Although it was interesting I thought it was very commercialized with the emphasis on selling their products. I did buy some special coffee to bring home to family but was disappointed with the products especially for the price they were charging. I would probably not go back there again."
        }, 
        {
            "index": 107, 
            "rating": "4", 
            "review": "Nice little stop over . Staff are lovely and its interesting to have a look round and the free samples of tea and coffee are both tasty and unusual. But unsurprisingly the whole thing is geared towards selling some tea or coffee to you in the gift shop at the end, which is pretty expensive and them some"
        }, 
        {
            "index": 108, 
            "rating": "2", 
            "review": "Tourist trap. They offer samples which are interesting but is just a tourist trap they give you a 10 minute tour and then a tasting but it's all about the volumes they can get through with selected trip operators and when you go to the shop lol buy elsewhere don't pay 10 times the price"
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "Drink your Luwak coffee here. Coffee lovers hear about the famous Civit Cat coffee, called here Luwak. It is reputedly the most expensive and superlative tasting in the world. A walk through the gardens to the terrace overlooking the incredible visits of the plantations allows one to choose to taste the coffee for about the price of a Starbucks in the US. My taste buds failed to rise to the challenge of finding the coffee ethereal. But it was fun to see the smelly civit cat and try the legendary coffee. The setting is spectacular."
        }, 
        {
            "index": 110, 
            "rating": "3", 
            "review": "Coffee Plantation,more like local fruit garden tour!. Hoping to get experience of a real coffee plantation tour. Stopped by Satri Agrowisata on way to Titra Empul Holy Springs. The walk through the garden was pleasant with each local fruit tree represented. If you have not seen durian, cocoa, coffee, soursop, jackfruit, mangosteen, you can see it here all in one place. The coffee part was disappointing. They set up a demo station to show how coffee bean was roasted by pan frying and then pounded and sieve to get the fine granules. After which you proceed to coffee tasting (this was complimentary unless you want to taste the Luwak Coffee at IDR 50,000. All the samplers have honey and was very sweet so hard to tell their true flavor. They do have tobacco grass you can roll up to smoke (n/c) - great if you are a smoker! After sampling they direct you to the gift shop where the products are sold. No pushy sale here (thank goodness) but everything higher price Han shops/supermarket in Ubud. We bought some gift items as felt bad for the girl who was assigned to be our guide for the tour and tasting as believe if you don't buy she does not earn commission. We paid with CapOne visa and they were going to charge us 3% credit card charge and we told them our visa company does not charge the 3%. They did take it off - so be aware here. Pleasant visit but no true coffee plantation tour."
        }, 
        {
            "index": 111, 
            "rating": "4", 
            "review": "Great variety of Products! You can even see the infamous Luwak Cat!. Great drinks and farming products! Their Kopi Luwak (coffee) is good! I know I'm not an expert in coffee but the flavor really tastes different! Their products for drinks are very good, nice flavor and good price. Recommended if you stay in Ubud! Ask your local guide to take you here."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "Coffee Plantation. We travelled by taxi to the plantation, it was very nice to see how all the coffee is produced and cocoa as well, and many more variety of plants. After your walk through the plantation there is a coffee shop and you get to drink the traditional Balinese coffee. Also to buy souvenirs. Not too bad but once is enough."
        }, 
        {
            "index": 113, 
            "rating": "1", 
            "review": "very expensive useless coffee. i lovd everything in bali apart from this stupid coffee we bought.. the place was nice scenic view of the place was amazing ... but i feel cheated because i bought this coffee which was suppose to be organic high quality stuff but which actually is third grade quality coffee after preparing its leaves behind a black residue... seems like the coffee is adulterated ... i would recommend everyone to visit the place but never buy anything from these hyped tourist places"
        }, 
        {
            "index": 114, 
            "rating": "3", 
            "review": "Clever Use of the Family Land. The family land has been planted for three purposes, grow and sell coffee, show the tree/bush/herb plants of the region, and make money. It is satisfies its ecotourism billing if you have a guide to point out the plants and their uses. The civets that help produce the special coffee are caged to view. Tastings to suit your interests are offered as a preliminary to enticing you to buy in the shop. Coffee, tea and various fruit and herbal teas are available."
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Great Service. We stopped in for a look around and were surprised at how much fun we had! The young man who greeted us was very knowledgeable and the tea/coffee tasting was amazing! Recommend to stop by as is a great experience! We purchased a few teas and some coffee but is worth the extra $.."
        }, 
        {
            "index": 116, 
            "rating": "3", 
            "review": "Worth a look - great views!. Brief but interesting trip. Fantastic view from the terraces. Felt a little sorry for the cats however. Worth a look in though."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "I learned a lot about coffee and spices in Bali. Very organised and staff are trained well in Engish. I learned a great amount of how coffee is made here and why it tastes so good. Nice to have the free samples of all the teas and coffee available to buy in the gift shop."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Interesting. We enjoyed our visit and tasting all the different varieties. The guide was very informative and you can buy your favorites in the shop to take home."
        }, 
        {
            "index": 119, 
            "rating": "3", 
            "review": "Interesting. The staff was great and the coffee and tea was good! interesting tour and great fun to get to taste everything!The shop was very expensive however but did have large variety of items, great for gifts!"
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "fun tour. our tour guide was extremely happy and cute and loved explaining the poo-coffee..she was so sweet...she then let us taste test 10 coffees and teas...all amazing..def worth the trip (free) and bought some coffee...tried the Kopi Lukaw (poop) for $4/cup...a days pay for our tour guide"
        }, 
        {
            "index": 121, 
            "rating": "2", 
            "review": "The cofee taste is so so.. The view is so good.\nThe taisting drink of jacooneko coffee is very expencive.\nFree tasting drink is poor."
        }, 
        {
            "index": 122, 
            "rating": "4", 
            "review": "Interesting. Very informative with extra friendly guides & staff.\nCoffee expensive to buy in the factory shop.\nDo buy vanilla essence to bring home-the best I've ever used."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Nice Stop. We were able to sample some nice beverages and made a few purchases. They had a nice demonstration on how they make their products"
        }, 
        {
            "index": 124, 
            "rating": "4", 
            "review": "Great tour, super country drive. The drive to Satri is fabtastic. It's one straight road outside Ubud and the road is simy jammed packed with artisan boutique cultural shops. The road seems to stretch for miles and the shops are endless. I dyou are looking to buy any sculptures or artwork this is a haven. All the wares are presented beautifully outside the hop doorways. When you arrive at Sati, everyone is very professional and friendly. YOu go on a tour which is not extraordinary but certainly capture the key essence of coffee growing. At the end of your tour, you are seated at a table to sample several different beverages.You can spend all day with the samples if you like, There is no pressure and you are encouraged to relax with the beautiful mountain views. After your tasting, the exit path takes you through the souvenir store. I knew that I wanted to buy sone treats, but there is absolutely o pressure to buy anything at all.All in all it's a really nice day or half-day trip out. It's nice place to go as a group, but I was alone and felt really relaxed and recharged. I didn't stay very long because I had a driver that I was paying for the day and we had to start our journey back."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Fascinating tour of coffee plantation where they produce Kopi Luwak coffee.. Tremendous tour. We saw numerous types of plants and fruits throughout the plantation, and were able to taste test a dozen of their most popular coffees. They also produce the Kopi Luwak coffee which was made famous by the movie, \"The Bucket List.\" There is a very good demonstration of how the coffee is processed by natives, a time-consuming process to say the least. Very friendly folks."
        }, 
        {
            "index": 126, 
            "rating": "3", 
            "review": "Ok. A tour guide explains the different types of coffees they make and give you several samples to try , some are very tastie some not so good , but at less you can try before you buy .Only one problem I had with this was the little Asian Palm civets locked In a cage to make the Luwak coffee ... Let them out please !"
        }, 
        {
            "index": 127, 
            "rating": "4", 
            "review": "Relax for a minute. We found this an interesting stop. Some of the coffee testers I didn't enjoy but loved others and purchased."
        }, 
        {
            "index": 128, 
            "rating": "3", 
            "review": "Interesting to see.... It is interesting to see, but if you are coffee lovers, you will not really enjoy it.Some of the coffee drink offered for free are instant quality, The coffee what you can buy are over price compare to similar in Ubud and packed in plastic bags.There is nice nature around, chance to see coffee plantation."
        }, 
        {
            "index": 129, 
            "rating": "1", 
            "review": "Horrid tourist experience. We were taken here by our driver after we wanted to stop for a coffee. This isn't the place for a nice cup of coffee but more a tourist pastime. We were taken at a very very slow walk around the \"plantation\" by a bored girl who recited her lines at regular intervals. The coffee tasting was small and mean and we couldn't wait to get outta there! Save your time and money"
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Beautiful drinks and pleasant staff.. Luwak coffee and amazing teas served here. The grounds are also pleasant. Pricey gift shop though.Loved it."
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "Unique Bali coffee experience - \"Cat Poo Cino\" :-). We came across this gem by chance. It offers free entry and a free tour of the plantation is provided, where guests can see coffee beans, cocoa beans, spices and fruits all growing naturally - including many that we had no idea how they looked in the natural form. We also saw coffee beans being hand roasted. After the tour, guests are invited to taste a selection of 7 hot beverages, and another 6 on request, all for free. Think Bali coffee, vanilla coffee, sweet potato coffee and spiced hot chocolate. Guests ate also invited to try Luwak coffee - a bean eaten by a cat like animal, digested and then extracted from the animals waste - hence cat poo cino! Definitely a strong unusual brew, costing 50,000 rp, around $5 which is pretty expensive by Bali standards, but worth it for the unique experience!"
        }, 
        {
            "index": 132, 
            "rating": "5", 
            "review": "Drink everything except Kopi Luwak. This place is a relaxing place where they sell home grown tea creations and coffee to tourists and locals. It is a great place for purchasing a gift for someone. The tea tastes nice when you are there but when I got them home, it tastes a little different. The prices are a little steep here."
        }, 
        {
            "index": 133, 
            "rating": "1", 
            "review": "Torturing animals!. Do not drink or buy coffee Luwak! The civet cats are kept in cages and made eat only coffee beans, which shortens their lifespan significantly! Also, they are nocturnal creatures, but to entertain the tourists, they keep them awake in the day time...Their unnatural diet (mainly coffee cherries) causes a lot of health problems and leads to premature death. Time to wake up people!!!!"
        }, 
        {
            "index": 134, 
            "rating": "4", 
            "review": "Coffee delight. This is a free attraction. You can just walk in visit the forest and get a delicious plateau of different coffee's and tea's to try. If you want to bring some home, there's a nice little spice/coffee shop.You can also check out the Lowak's, too cute!"
        }, 
        {
            "index": 135, 
            "rating": "4", 
            "review": "TASTE OF LUWAK COFFEE. Had a great tour, they offer samples of all their coffee & tea. It was an experience to see them roasting the coffee beans. Be prepared to buy their products after sampling the drinks."
        }, 
        {
            "index": 136, 
            "rating": "4", 
            "review": "Interesting place, good tea and coffee. . We went there as part of a tour around bali and fortunately our driver had a lot of knowledge about the plants and the place in general. Maybe it's a bit unfair to rate it 4/5 as the 4th point is actually to his credit. But anyhow, it's a beautiful place and they give you a lot of free tasters of their products. You're not obliged to buy anything afterwards, but it's hard not to as their different teas and coffee are really good. There was a girl there telling us some stuff about the process and the products which I found quite interesting. She did seem as if she was a bit tired of telling the same things over and over though. Then again, she was pregnant so maybe she had an off day. All in all, a nice place for a quick visit and some tasty beverages. The cat poo chino is good but a little pricey (50k idr)."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "Satri Coffee and spice. Was there this week, had a great tour, they offer samples of all their coffee, so delicious, of course you end up buying which is good, highly recommended. Beautiful setting/."
        }, 
        {
            "index": 138, 
            "rating": "2", 
            "review": "not worth it. the products are overpriced, they are just ordinary and the same as the one u find in street vendors. We were visiting it only because this place was included in our tour."
        }, 
        {
            "index": 139, 
            "rating": "3", 
            "review": "Nice experience, Coffee just so so. Good experience to see how they roast the bean. Dislike seeing cat were kept in cage and fed with beans. Coffee are not natural as they were so sweet and artificial."
        }, 
        {
            "index": 140, 
            "rating": "1", 
            "review": "WORST TRIP EVER. BASED ON ANIMAL ABUSE.. Don't bother going. Animals are caged and used for their poop to give us 100 dollar coffee that is rather boring in taste! They harass you into purchasing products that are CRAZY IN PRICE!"
        }, 
        {
            "index": 141, 
            "rating": "5", 
            "review": "Good place for coffee/tea additct. I really love coffee, hence it really fit me. I enjoyed Luwak coffee very much, it costs okay for me to try it. It really tasted good."
        }, 
        {
            "index": 142, 
            "rating": "2", 
            "review": "Not worth to visit. Was there in December and only a few coffee plants. They explained to you how the luwak coffee came from. There you will get to taste different types of coffee. However, if you want to try the luwak coffee, you need to pay IDR 50,000 for a small cup. The place is fill with mosquitoes and I felt not worth a visit."
        }, 
        {
            "index": 143, 
            "rating": "5", 
            "review": "Great Experience!. Another great experience in Bali- the coffee plantation tour! Since I used to be a coffee addict, now a tea lover.. this place was really fit to me. when I walked through the pathway leaded by the local guide, my mood turns into better seeing different kind of plants, trees and spices particular for main coffee ingredients. then, our guide lead us to the processing area and showed us the demo. after showing us everything including animals, there was a free testing of coffee with different kind of flavors like Luwak, Gensing, Cocoa, Vanilla and etc. They have a shop for their products if you want to buy coffee, tea, spices and other souvenirs. We had a great time in this place. Also, there is an orange plantation on the other side of the road."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "Very interesting tour. We really enjoyed our afternoon at the coffee plantation. Very informative and such a peaceful environment. Enjoyed a Luwak coffee and purchased more to take home with me. The little animals are very sweet"
        }, 
        {
            "index": 145, 
            "rating": "3", 
            "review": "Leeway coffee. No Lweewak for me. They show you how the animals are feed the coffee beans and how they extricate and roast the at the other end. Very new venue; gardens are immature. And 30% sugar is added to the tasting menu consisting of flavored yes and coffee gratis. There is a gorgeous view over looking the plantation house."
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "Interesting garden tour, processing demo and coffee tasting. This wonderful \"green\" plantation specializes in traditional-style coffee growing and production. First you visit their civet zoo where these little guys help produce their Luwak \"poo\" coffee. They digest the outer husk of the bean and excrete it. Then workers wash the leavings, winnow the inner husk away, hand roast it over a wood fire, pound it into fine granules using a large wooden mortar and pestle, then sift it and re-pound it. Then they bring you attractively presented complimentary tastings of regular coffee, vanilla coffee, cocoa coffee, cocoa, lemon tea, ginseng tea, and more. A taste of the Luwak coffee costs about $3-not my favorite coffee. They grow all the herbal teas and cocoa on the plantation. Their tasting area overlooks a lovely, breezy rice terrace and pool. Definitely worth a visit."
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Interesting experience. It is definitely an interesting experience, all the new tastes and flavored experienced at the source. Not too much development from that point, might evolve in the future..."
        }, 
        {
            "index": 148, 
            "rating": "3", 
            "review": "The tea was great. On arriving were rushed very quickly through the grounds. Our guide was not interested in having us look at anything, Three minutes into the tour of the lovely surrounds, one of the woman proceeded to chop the head off a chicken in front of the kids. It was off putting and took away from the tranquil surrounds.I drink a lot of coffee and did not enjoy this coffee. The tea was great, but as others have commented when you are ushered into the shop, it is just sugar powder and not tea at all."
        }, 
        {
            "index": 149, 
            "rating": "5", 
            "review": "A Lovely Surprise!. When we booked a taxi for a tour around the Ubud region this was not on the agenda. However further to a conversation on my love of coffee our driver Wyan suggested we call in. What a great surprise with a lovely tour followed by tea and coffee tasting - all free!"
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Best coffee and great scenery. Our tour guide thought we would like to experience this place and thank goodness he did. It was interesting to see how they make coffee and chocolate and the animals that help in the process. Their coffee is amazing and you get to try testers at a nice location up high overlooking plantation. Great to visit"
        }, 
        {
            "index": 151, 
            "rating": "4", 
            "review": "Catpoochino delicious. On your tour around Bali it is likely that you will be brought to one of the Coffee plantations - your driver will receive commissions for any purchases that his clients make. You are not obliged on are you pressured into purchasing although this trip includes a coffee tasting experience. I thoroughly enjoyed the whole experience and consider it a must do if you are in Bali - Satria staff were excellent and fun and made our visit fun. the coffee and other products on sale are expensive but at least you know where they are from - the coffee in the markets is approx. 1/3 the price."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "lovely experience. Had a great tour by one of the lovely guides, & then tasted the teas & coffees which was fantastic. Tried the lovely Luwak coffee & it was like a Japanese tea ceremony with the coffee being brewed in amazing individual pots - great experience & lovely clean setting - loved it"
        }, 
        {
            "index": 153, 
            "rating": "5", 
            "review": "Great tour with explanations and samples. When we arrived we were the first there, the young man took us around the property explaining the process of coffee making and then we got to sample many types of tea and coffee - iut was a fantastic experience that was really enjoyable - even dared to try the Luwak coffee!"
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Best Coffee Ever. The tour was very interesting and you won't believe how good the coffee is. We had a very peaceful afternoon looking out over the rice fields with the best coffee in the world..."
        }, 
        {
            "index": 155, 
            "rating": "5", 
            "review": "Great tea and coffee tasting. Staff are friendly and you are taken to your own table with loads of tea and coffee to taste and a bonus at the was awesome Bali chocolate."
        }, 
        {
            "index": 156, 
            "rating": "2", 
            "review": "Nice place to visit , but they sell you different coffee. It was a nice place to visit and the coffee and tea were delicious at the plantation. We purchased several bags of the pre made coffee and when we got home it tasted nothing like what we had. In particular the flavored coffee. We very disappointed to say the least"
        }, 
        {
            "index": 157, 
            "rating": "3", 
            "review": "Nice but Quick and Overpriced . Our tour guide was lovely and funny :) she took some nice pictures of myself and my partner overlooking the panoramic views.The tour was very quick and sadly not lot of plants on the plantation were in season at the time so we didn't see much. We saw the Luwaks which were really cute, it was a shame to see them in such a tiny cage which is why I gave this an average rating.We stopped for tea and coffee sampling which was nice, good selection of 10 or so samples.If you are expecting good, strong coffee like back home then I would recommend against this place as most of the testers are tea and you only get a couple of small cups of weak coffee to try.The whole idea of this place is to sell merchandise which is very over priced. We felt a bit obligated to purchase something. We grabbed a bodyscrub which we could have gotten in town at half the price.Overall good but not what we expected."
        }, 
        {
            "index": 158, 
            "rating": "3", 
            "review": "The 8 cups of various flavoured coffee didn't taste good. It took less than 10 minutes to finish touring the small plantation area with four caged \"musang\". Luwak Coffee was served at IDR50,000 per cup whilst they served us another 8 cups of coffee in various flavour free of charge. Luwak Coffee tasted alright but not the others."
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "Very nice and casual activity. This activity can be completely free if you choose which is always nice! You get to have a nice walk through the gardens with all the local fruits and flowers. Then they show you and allow you to participate if you wish in the traditional process of making the coffee. 12 different tasters of coffee and tea are complimentary as a welcome drink. If you want you can then purchase something from the gift shop, or you can pay about $5 US to try the Luwak coffee.Lovely afternoon and you can spend as little or as much time and money as you wish. The staff is friendly and it's beautiful scenery.The only reason I did not give 5 stars is because the luwaks were kept in very small cages and put on display. They are nocturnal animals so should be sleeping during the day. I did not like seeing their natural way of life disturbed, and, although I understand they are important in the process for the Luwak coffee and am not against that, I wish I could have at least seen them in a nicer more natural environment."
        }, 
        {
            "index": 160, 
            "rating": "5", 
            "review": "Coffee coffee. An interesting place to halt on way to Mt Batur. One get to see the different types of coffee with a very hospitable staff. Enjoy different flavors of tea and coffee and visit the place. A short halt of 30 minutes a very refreshing."
        }, 
        {
            "index": 161, 
            "rating": "1", 
            "review": "Probably great coffee, if you can ignore the luwak´s caged up.... The place is great and worth a visit.., but with beautifull stressed luwak´s caged up with no water, it is hard to sit and enjoy your coffee.\nWe gave all the animals Water and they drank like crazy.\nIt is devastating to see how we treat our animals for our own pleasure..."
        }, 
        {
            "index": 162, 
            "rating": "5", 
            "review": "Worth a visit. Stopped here as part of day private tour. Really enjoyed the tour and seeing the different plants and coffee beans and learning about the lowak coffee. Our guide was friendly and informative. Tasting the coffees and teas on terrace enjoying a wonderful view ended the tour wonderfully."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "Nothing like learning about Lowak coffee. I thoroughly enjoyed my walk through the plantation and tasting the different coffee flavors. I ended up buying coffee, chocolate and spices. Saw the Lowak animal and learned how they processed the coffee"
        }, 
        {
            "index": 164, 
            "rating": "1", 
            "review": "Don't buy anything from them!. Spent a bit of money buying the tea only to come home and fine that it's just a bag of sugar! And the leukat coffee is just ordinary coffee so dnt buy into it trust me"
        }, 
        {
            "index": 165, 
            "rating": "5", 
            "review": "What a wonderful surprise.. We had a morning to spare so decided to do some last minute shopping. We asked our driver where we could get some coffee and to our surprise we ended up with so much more. The tour was informative and really pleasant. Then we participated in the tea and coffee tasting. Yum yum. It was all so delicious and the staff wonderfully friendly."
        }, 
        {
            "index": 166, 
            "rating": "5", 
            "review": "Great tour and great Views. Really interesting the tour guides English is excellent and gave us a lot of information as we walked through the plantation. the view as you sample all the different types of coffee is amazing and the Luwak is interesting to sample"
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Great views while trying different coffees. We really loved our stop here. It's nice to walk through and see all the different things being grown and then to sit and sample the coffee and tea while overlooking the terraces is nothing short of amazing."
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "Definitely a great stop on our trip. I was so excited that all the coffee was organic, and made in Bali. I also never thought a coffee from poop of a cat would be good, but was great coffee. If you like coffee or tea, and like to know about native plants, a fun way to spend 30-45 minutes."
        }, 
        {
            "index": 169, 
            "rating": "5", 
            "review": "coffee. great place to visit lovely staff they will take you around and you can sample the different types of coffee also see how the coffee is roasted"
        }, 
        {
            "index": 170, 
            "rating": "5", 
            "review": "Horray for Coffee and Tea Lovers!. I really enjoyed visiting this coffee plantation. We tasted different varieties of coffee and teas. We love their vanilla coffee and the mangoesteen and lemon grass tea. The staff were so nice and very accommodating. They showed to us the trees/plants of the some coffee. I find this trip an interesting and very informative . We also bought some coffee and tea to bring home. Unlike other places we visited in Bali, this place has no entrance/admission fee. You just go there and try their coffee and teas and it's up to you if you want to buy some to take home."
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Hidden Gem. This place was fab. The people who showed us round were so helpful, kind and interesting. They all spoke great English and I loved that it is a family run business. Great little shop at the end with some lovely bits to take home. Loved it and would highly recommend this."
        }, 
        {
            "index": 172, 
            "rating": "4", 
            "review": "Amazing Coffee. Enjoyed my visit here and tasted many flavours of coffee, also had a shop so I just had to bring some home"
        }, 
        {
            "index": 173, 
            "rating": "3", 
            "review": "ok for a quick stop. stopped there for a quick stop . the coffee and teas are expensive , they do you show you the different kind of trees that grow variety of fruit and spices ."
        }, 
        {
            "index": 174, 
            "rating": "4", 
            "review": "Nice. Stoppoed off on the way back to Umalas and was a lovely distraction. Nice samples and got some tea to take home. Had a picture with the owl as wel try the poo coffee"
        }, 
        {
            "index": 175, 
            "rating": "3", 
            "review": "Spice Garden walk. Wanders through the spice garden identifying the various plants from which we get our beverages. Coffee beans, cocoa pods, vanilla beans, aloe Vera plants, pineapples and spices. There was a tasting session followed by a visit to their shop for purchasing personal supplies."
        }, 
        {
            "index": 176, 
            "rating": "1", 
            "review": "So wrong. Rare coffee,exclusive,bull.This coffee after passing through the digestive tract of a Luwak was at one point painstakingly collected by gathers in their natural environment.Great.Now visit to see these animals caged,feed all sorts of coffee beans to digest and the outcome is collected from the cage.You can see these animals are stressed,it's daytime,they(some)stalk up and down their cage,they naturally should be asleep and out in the trees not stuck in a tiny cage.Exptoitation,simple."
        }, 
        {
            "index": 177, 
            "rating": "5", 
            "review": "Great coffee and teas!. I don't drink coffee and really enjoyed this place. It was delicious! It had different teas to enjoy in addition to the coffee."
        }, 
        {
            "index": 178, 
            "rating": "3", 
            "review": "same same. in ubud area is maybe 50 eco farm plantation,or more.I taste kopiluwak in 3 diferent farmsand have same taste,but the prices are more expensive if you compare to supermarket in ubud."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Informative visit. Amazing and extremely informative. You will be freed a taste of 12 teas and coffees, including the famous Luwak coffee, which has beans coming through a civet intestine. We watch the process for how they make the coffee - all laboriously hand done, as are most things here."
        }, 
        {
            "index": 180, 
            "rating": "5", 
            "review": "Poop coffee. Try specialty civet coffee, made from the poop of civets. Must like real strong, bitter coffee. Add lots of sugar. Other coffee is offered for tasting."
        }, 
        {
            "index": 181, 
            "rating": "5", 
            "review": "Must visit!. A really beautiful plantation with very friendly guides that tell you about the plantations which they have such as coffee, cocoa, vanilla etc and the highlight is the luwak coffee (catpoochino). It is very interesting that they show you the process that the coffee goes through and I even got to roast and grind the beans! Tasting the selection of teas and coffee was also a highlight!"
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "Loved it. Great tour of the plantation and lovely to try all the different coffees. Felt a bit sorry for the caged Luwak cats :("
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Worth a vsit. Very cool experience...great food and coffee...we loved it. They offered a great variety of coffees and se sat overlooking the plantation, great views"
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Great Coffee and Tea. Awesome coffee collection and plantation. We loved it so much that we bought a lot to take with us.."
        }, 
        {
            "index": 185, 
            "rating": "5", 
            "review": "Coffee and Tea: a must visit. Wonderful learning and tasting experience. The surroundings are charming, and the teas (not just the coffee) delicious!"
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "Taste amazing tea and the famous Luwak coffee!!. Very interesting! You'll find a big plantation in the balenese jungle where you'll learn many things about fruit trees, tea and, of course, coffee! People present you how the special \"Luwak coffee\" is made! At the end, it is degustation time! You'll be able to taste a dozen of different flavored tea and coffee. It is very delightful! You could also spend50 000 RPS for a Luwak coffee - a must do for coffee addicts in Bali!"
        }, 
        {
            "index": 187, 
            "rating": "5", 
            "review": "Great place. Oir driver stopped here and we were very impressed. Beautiful scenary and he pointed out ginger, pineapples, lemongrass etc in the gardens. We learnt about the coffee process and the Civets/Luwaks. Then tried 12 teas and coffees for free (and paid 50000 tp try the Luwak coffee) and shopped for teas and coffees to take home to family in their shop :)"
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Great Experience. A must do tour!! Free samples of Balinese traditional coffees, teas, various flavored coffees and teas.. Homegrown traditional tobacco to sample for cigarette smokers. Free testers for home brew spirits. Something for everyone. You can also buy them in their shop for you to take back to your country.."
        }, 
        {
            "index": 189, 
            "rating": "5", 
            "review": "Great place to learn more about coffee and tea. The staff is very nice and informative, they explain everything ! At the end of the track you will have the chance to taste various teas and coffees for free ( and buy the one you loved after).Even if you are not a coffee or tea addict you will appreciate this activity."
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "Interesting and fun experience. Stopped here for a free tour of the coffee plantation. Saw cute sleeping civets and fresh fruits and herbs growing. They gave us a lovely sampler tray of all of their coffees and herbal teas, and you can pay 50000 IDR for a cup of Kopi Luwak. This was definitely worth trying and after having learned how it was made, I wasn't afraid to try the cat poo coffee. It was delicious. They have a shop where you can buy all of the coffees and teas that you have tried afterwards, as well as many other products, like incense, organic coconut oil, lip balms, creams, spices, etc. I think they make a killing off of the tourists that come through here. We bought a lot of great souvenirs to bring back, though I'm not sure that these are the best possible prices since its such a tourist spot. The herbal teas are so fantastic though, I wish I bought more! We learned a lot and even got to help roast the coffee beans and grind them up for Luwak coffee"
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "Interesting place to visit. A must see, the view you get when hyou sit to try their products.\nYou can try for free all their teas and coffees (except the luwak coffee which costs like 4$ the cup) and to be honest I did no like it.\nTHe balinese coffee was very very good and not too much expensive."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "Very interesting and educational. Our driver stopped here on the way to Ubud and we had no idea what to expect. We were pleasantly surprised at how interesting and educational the tour was. We had our own guide and she showed us through the gardens, past the animals and the coffee-making process. After that we sat down and had a chance to sample the different coffee and tea varieties. Finally we went to the gift shop where we could purchase, coffee, tea, souvenirs or a range of other things. There wasn't any pressure to buy."
        }, 
        {
            "index": 193, 
            "rating": "5", 
            "review": "Tea and coffee samplings...yum!. Wonderful experience...had a great time sampling the different Bali teas and coffees! I had purchased some items to bring home to family and friends!"
        }, 
        {
            "index": 194, 
            "rating": "4", 
            "review": "Great little place. We stopped off here on our way to a tour of the rice paddies. We were shown the many different fruit and veg they had growing there. We were shown the processing methods and then we were shown to a table where we were give glasses of approx 15 different types of coffee and tea (for free). I thought this was brilliant and all it them were really tasty. The views from the seating area were fantastic. We were offered to try a cup of the Luwak coffee for 50k (this is very expensive for a coffee but it's not every day you get to try something like that). Then we were taken to the gift shop which we seed a bit pricey but had all the coffee previously tried as well as various spices produced at the plantation. Overall I would definitely advise people to visit here, especially coffee lovers."
        }, 
        {
            "index": 195, 
            "rating": "4", 
            "review": "Awareness about a´coffee. I learned a lot in this place and also about being grateful. I truly did not know about the whole process of making coffee and how much work was behind. I got to taste and even buy with me the amazing Luwak coffee. And I also got to taste so many different kind of coffee´s and tea. It was very educational and Im glad that I got the experience."
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "Very educational . We learnt a lot of how they make their coffee, she showed us and took us through the whole process. You then get to sit down and taste all the different coffees and teas that they have and you can purchase them to take home. I loved it! "
        }, 
        {
            "index": 197, 
            "rating": "3", 
            "review": "Traditional Indonesian Coffee. all the hotels i stayed at in Bali served this great Indonesian coffee. I thought the Bali coffee that i bought here would be the same, sadly it was not. Also bought a couple of different varieties in the herbal tea...however for some reason they very very sweet. I definitely bought the NO SUGAR variety. Would dread to imagine how sweet the sugar version is.....So im a little disappointed as i bought 3-4 different varieties....and i haven't been thrilled with the flavour."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Luwak coffee , now Iv'e had the best .. Very enlightening . Tried Luwak coffee and many other products , produced there .A very comfortable facility ."
        }, 
        {
            "index": 199, 
            "rating": "3", 
            "review": "Yeah it's a touristic trap. At the entrance we really didnt know how much the tour will cost and nobody was able to answer us. The tour was very quick, the guide showed us cinnamon, coffee lemon grass and other at least for european interesting plants. Then we had a degustation, about 13 different teas and coffee for free, we liked it very much. The only coffee, typical one costed 50,000 rupias. I didnt like it so much, so it is according to me worthless. At the end of the tour we were invited to the shop, where everything was soo much expensive, unless for me. So I dont recommend to buy there anything."
        }, 
        {
            "index": 200, 
            "rating": "2", 
            "review": "Tourist trap. TYpical tourist stop off for day trippers (I'm sure the drivers get commission for stopping there). YOu do get free coffee tasters with the hint to buy a special coffee which is hard to say no to. Great view of the valley from the cafe."
        }, 
        {
            "index": 201, 
            "rating": "5", 
            "review": "Great Coffee. Amazing View. We visited the Plantation as part of a day trip to Ubud. What an amazing place. The coffee tastings were great & the view over the rice paddies was amazing. Staff & service were excellent & all for free. Can highly recommend."
        }, 
        {
            "index": 202, 
            "rating": "1", 
            "review": "Coffee lovers. This is a must for all you coffee drinkers. Take your time indulge with all the different flavours. It's really worth experiencing the different flavours"
        }, 
        {
            "index": 203, 
            "rating": "5", 
            "review": "Awesome place in Ubud! . Our guide Cok suggested this place as we were coming from visiting some temples. It was very interesting and interactive. I loved the tasting at the end which of course lead us to but quite a bit! The lemon grass tea and coconut coffee were two of my favorites."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Coffee plantation tranquility. Loved this little tour through the plantation. Learned a lot of the history of Balinese coffee and how they kept the lawack coffee beans hidden from the dutchies. Great sampling and could buy our favourites"
        }, 
        {
            "index": 205, 
            "rating": "3", 
            "review": "Interesting but also expensive. This place was somewhat interesting and informative, they showed the different plants and the luwak.\nBut the guide sounded like she was bored and the prices were expensive."
        }, 
        {
            "index": 206, 
            "rating": "5", 
            "review": "Amazing tasting coffee! . Our driver from Legian to Ubud asked if we wanted to stop here on our way. Not a coffee drinker myself and thinking I just wanted to get to Ubud we stopped anyway as I'm in Bali so why not and my wife loves coffee and tea? Oh. My. God! This coffee and tea was very good. They make it all there but what is different is that it's all powder. They make the coffee into powder and add spices and other flavors. Most have 3-4 ingredients and you can get them without sugar added or honey added. You try about 15 different coffee and teas and pretty much all taste great! Enjoy the setting, enjoy the coffee and support and local business. The teas are also amazing. Powder as well but strong. Not like tea bags in the USA. They also have lewuk coffee which is ok. Weird drinking it knowing what it comes from. Not a huge operation and very peaceful. No pressure to buy the coffee but it tastes so damn good we had too. Our taster spoke very good English and had a great story about what he wants to do in life. Sorta sad to listen to it but he was very optimistic about his future. Listen, talk, enjoy coffee and relax in this beautiful setting!"
        }, 
        {
            "index": 207, 
            "rating": "4", 
            "review": "An interesting experience - Poo coffee being the highlight.. Well this was a great \"little\" stop on our day tour that we had privately and personally planned.The stop was suggested by our driver so we thought, why not.We were warmly welcome to the cafe/store/demonstration/animal enclosure and seated to be given a taste of 8 or so varieties of coffee and tea. What was to be a quick visit was soon becoming a long one....at our choice.They went through the process of picking to roasting and preparing the beans for a final product. Explained the process of the \"poo\" coffee and how that comes about.Each and every tea and coffee we tried was amazing...and yes...we LOVED the poo coffee.There is a store there where everything you tried is available yet no one was pushy for you to make a purchase.We did enjoy a couple of extra cups of coffee while we were there though which is brewed right at the table while the beans are being roasted behind you."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "A Brief Trip to Ubud - Bali. If you like coffee or tea it is well worth a visit to this small plantation, with an opportunity to see some coffee being roasted and a chance to taste various blends of coffee and different teas. Bet you won't come away without buying some!"
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "A Coffee Experience .... The Kopi Kuwak or Civet Coffee is probably over-priced and i personally don't believe it all comes from the wild as i gotten to know it is mass produced with the civet bred on farms ... so unless $$$ is in excess this can be a ruthless buy which is heavily promoted even at the farms for a princely price of IDR50000/- per cup."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "I Don't like Coffee But I Loved This. Really special tour of how coffee is made from plant-to cup. I loved the young man who took us for our tour. We decided to drink the lemur coffee and it was pleasantly nice. I enjoyed all the other tasters too."
        }, 
        {
            "index": 211, 
            "rating": "5", 
            "review": "Coffee and tea extravaganza. This was an experience I will never forget. Did not realise there were so many types of coffee and teas. We tasted them all, watched how they are made and the staff member was ever so helpful in her tour. We bought lots of teas and coffees to bring home and am enjoying them"
        }, 
        {
            "index": 212, 
            "rating": "2", 
            "review": "Nice tea.... Not amazing for animal lovers. So to be fair firstly the tea and coffee tasting was lovely. When you arrive you are greeted by a staff member, he then shows you the type of coffee trees in a small sample garden area. This is charming but not the actual plantation. You are then shown the beans in a few states of processing. Then the sad part happens when you are offered to hold a bat which clearly doesn't like being out during day, never mind the rabies situation in Bali and the risk to you health. After which you are shown a hedgehog and four darling little animals in cages. After this you head to a table to sample tea and coffee all of which are lovely. You then are encouraged to purchase tea and coffee to take home for about $15aud a bag which we did as we felt we had to as there was no charge for the other elements. Honestly I wouldn't come back due to the animals being shown however the coffee and tea is nice so maybe if you are a bit less sensitive then it would be okay."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "The luwak coffee is a must-taste!. Situated in the most picturesque valley, you can try a whole variety of coffees including luwak which comes from coffee beans partly digested by civit-like animals"
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Excellent for coffee lovers. If you love coffee this is a must do.I found this very interesting and the coffee and tea amazing.I have done this tour every time I go to Bali."
        }, 
        {
            "index": 215, 
            "rating": "5", 
            "review": "Yummy coffee and teas. Excellent place to try different Indonesian coffee and teas as well as the famous Luwak coffee. We enjoyed this place. No pressure to purchase and set price so no need to haggle - but we did manage to get a discount as we loved the coffee so much and bought quite a bit inn the end"
        }, 
        {
            "index": 216, 
            "rating": "4", 
            "review": "Nice coffee place. Knowledgeable staffs who speaks rather decent English. Love the Ginseng coffee and Mangosteen Peel Tea which is really easy to go down on the throat."
        }, 
        {
            "index": 217, 
            "rating": "5", 
            "review": "A definite stop on your way back from Kintamani. Our taxi driver suggested this plantation on our way back from Kintamani. To be honest I wasn't really up for it - but when we stopped and got out I knew it wasn't what I thought at all.You are led through the plantation by a guide that tells you all about the coffee beans as well as the cocoa they grow too. Everything is done by hand - it takes 45mins to roast the coffee beans over a fire (which was damn hot for the lady sitting there doing it) and about 2 hours to do a kilogram of beans (I hope I have remembered that correctly).Everything is very well orchestrated - and it doesn't have to be a long stop either - we were in and out within an hour I would say. After you go through the plantation and hear about the process and of course the Luwak and the \"poo\" coffee (*giggle* from my 5 year old daughter)...you get to do a full taste test of all the teas and coffees they produce. We loved just about all of them - we bought the Vanilla coffee, Coconut coffee, Mango tea, Rice (yes Rice) tea and Lemongrass tea. And of course...had to get the 100% cocoa powder for hot chocolate for my daughter.It was well worth the trip and I would say definitely make this as a stop on your way to or from Kintamani. And its not tedious for kiddies either - short enough to manage!A big thank you to the team at Satri - we are still drinking your coffee here at home and enjoying it...thinking of you!"
        }, 
        {
            "index": 218, 
            "rating": "5", 
            "review": "great farm!. My husband and i really enjoyed stopping by Satri Coffee plantation. OUr guide was so nice! totally forget his name. very interesting to see how their plantation works and more importantly really like supporting these people in their farming and staying close to nature. if you arent into farming or crops or that sort of thing- then skip but if you are! stop by - we really enjoyed it , learned a lot and got some great coffee and vanilla beans!"
        }, 
        {
            "index": 219, 
            "rating": "3", 
            "review": "Luwak Coffe Stop. Friendly staff offering free samples of their Tea and Coffee. we bought some from the shop. Its an ok stop on the way back from the local temples."
        }, 
        {
            "index": 220, 
            "rating": "4", 
            "review": "Poor luwak . The experience was great with a little tour around the plantation and 12 tasters of different drinks, and it was all free! But it was sad seeing the luwak (a cat-like animal) locked up in a tiny cage."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "Great experience, don't miss on your trip.. I wasn't a coffee drinker until stopping by here. When the driver suggested it, I went for the view of the plantation. The staff were welcoming, great service. Views beautiful & great introduction to the plantation, the process & tasting opportunities. I fell in love with coffee here & haven't stopped. A rich smooth flavour, in all it's varieties & don't miss the tea! Great experience. Worth stopping in for."
        }, 
        {
            "index": 222, 
            "rating": "5", 
            "review": "Great coffee. If you like coffee and tea this is a must. Great tasting session at the end and great coffee. Reasonable prices."
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "Choice of coffee.. Very nice coffee plantation with a guide to show you around and explain things to you. Lots of coffee samples to try and buy if you want to."
        }, 
        {
            "index": 224, 
            "rating": "5", 
            "review": "great. Got to see how they make coffee also tasted the most expensive coffee in the world and see animal who eats coffee bean.great place to go."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Soo beautiful 😍. Great time at the plantation. So beuatiful. Great coffe and our guide was sweet. Try the lemongrass the and the vanilla coffe. It's so good."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Yum. Had a great time, had a small tour and then stopped for some tastings which were all so delicious! Bought some coffee to take home unfortunately it was expensive so only got a small bag"
        }, 
        {
            "index": 227, 
            "rating": "4", 
            "review": "Great experience!. A great experience and an amazing opportunity to sew how, not only the kopi luwak, but different spices i cultivated. And it's free!"
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "À must see and do!. The coffee plantation is locaties in a beatifull landschapje. USB an experienced guide As you will walk through all kind of spices, fruit trees and of course coffee and cacao trees. You dan see the luwak cast who are there only to show. Coffee tasting is free and enjoyable. Even for kids who love the ginseng coffee. The luwak coffee you have to pay but who not. The shop is expensive. IT is your own choice. We loved thuis visit. Friendly people!"
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Wonderful coffee/tea tasting & informational tour!. We stopped here on the way back from the Titra Empul temple and were treated to a very informative tour of the grounds including seeing all of the natural fruits & spices growing in their natural habitat. We also saw the Lewaks sleeping in their cages (as they are nocturnal) before tasting the famous Lewak Coffee. First we were treated to a tasting of 12 cups - 7 coffees and 7 teas, all flavoured naturally by the fruits we saw earlier (ginger, apple, lemongrass, etc.). The guide was so nice & friendly that by the end we were taking pictures together and even added her as a friend on Facebook! We also bough some souvenirs to take home (coffee & teas). A great stop for any coffee/tea lover!"
        }, 
        {
            "index": 230, 
            "rating": "4", 
            "review": "Great place to call in for a cuppa. Small, neat tidy place set up for tourists. Once seeing the plants and 1 caged animal, you are treated to some sample coffees. You must pay the $5 to have the Luwak coffee otherwise no point going there. You then can choose to buy the overpriced coffees on way out. Will only take about 30 mins."
        }, 
        {
            "index": 231, 
            "rating": "4", 
            "review": "Amazing coffee and tea tasting. . We had a guide to show us around the plantation, and point out what plants where what and different types of fruit. There are displays of a variety of coffee, vanilla, cinnamon etc to feel and smell. You can also see them roasting the beans and grinding them and have a go yourself. A guide will then take you up to a benched area where you can taste a variety of tea and coffee grown on the plot. This is amazing and they all taste very good especially the coconut coffee and lemongrass tea. The only thing we didn't like about this place was the caged civets, the enclosures are far too small and just not very pleasant. But overall the experience was good. "
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Informational and tasty!. There's a great, informational tour at the beginning and a free coffee/tea tasting at the end. All the coffees and teas are delicious. They also have really cheap lewak coffee and all of the lewak animals roam wild, instead of being caged like other planations. The gift shop has tons of great coffee, tea, incense, and fragrances (locally sourced) too. A must for any coffee or tea lover!"
        }, 
        {
            "index": 233, 
            "rating": "3", 
            "review": "A place for coffee. The place was full of coffee trees, and some fruit and herb tree. We walked through a stony path, looking at many ripe and unripe beans bearing from trees. At the middle, they taught us how to grind and roast coffee in the traditional way. What I disliked was the lack of exhibit to experience"
        }, 
        {
            "index": 234, 
            "rating": "3", 
            "review": "Not exciting. Probably could have done without wasn't informative and coffee is not good not worth the $5 per cup but hey you gotta do it!"
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Delicious. Going to this plantation was crazy to see! The guides were knowledgeable and would stop and give you details at every station. Trying the teas and coffees are not like having traditional westernized coffees. They have a thick sludge on the bottom, but don't let it ruin your experience! The \"Poo\" coffee was great, I plan on getting some shipped over since we finished ours within a week."
        }, 
        {
            "index": 236, 
            "rating": "3", 
            "review": "I love my coffee. By accident I was brought there by a guy in the street. I guess he gets commision or he has to do with my tip. I love my coffee, so it' s not the first plantation I visit. I am not sure if the coffee is still being processed the way they explain it. And the coffee is really expensive. But still, everything that has to do with coffee is ok with me. The coffee, tea and cocoa tasting is fun I do wish they wouldn't add palm sugar and so forth to the coffee. Strong and black that's the way!"
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Coffee please. Very well organised, informative and a fantastic range of teas and coffees to enjoy. The best part of course is the Luwak coffee which can be purchased."
        }, 
        {
            "index": 238, 
            "rating": "5", 
            "review": "Highlight of Ubud. I really enjoy the coffee plantation! So amazing and good! The shop at the end of the tour is very expensive unfortunately ! You must try the Luwak coffee"
        }, 
        {
            "index": 239, 
            "rating": "4", 
            "review": "Glad we stopped. I had no expectations about the Satri Coffee Plantation but as a coffee lover I was intrigued. The welcome was warm and information plentiful about how the coffee produced. The tastings amongst the picturesque back drop was well worth the time. Loved it and left with quite a bit of coffee, tea and natural skin products. You won't be disappointed."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "Awesome. Learnt so much they have such a different variety of plants in there plantation from coffee to cocoa vanilla beans mandarins they call orange beautiful drinks to try bought some home will return next visit"
        }, 
        {
            "index": 241, 
            "rating": "5", 
            "review": "Amazing tasting. To tell you the truth, I really didn't feel like going to a Coffee Plantation...been there, done that elsewhere.But I truly enjoyed every minute of it! The Tea tasting platter was amazing.It was so well explained, by a sweet host, smiling, patient...every time I liked something, he would be so happy for me! Everyone who works there is super king and ... It was delish!! Full descriptions of the medicinal virtues and subtleties...wow!!!Then when the host told me I could go to the boutique to but these products, well...I could bring these delicious tea, coffee and honey back home with me.As a matter of fact I had some Balinese honey last night at home, and like magic, I was brought right back to the most beautiful island I've ever visited!!!!"
        }, 
        {
            "index": 242, 
            "rating": "4", 
            "review": "good. loved the mangosteen tea and herbal lemon as well as there orange chocolate interesting story about the coffee"
        }, 
        {
            "index": 243, 
            "rating": "2", 
            "review": "Its more sale shop. They dont explain enough about the coffee as they just offer you to try the taste and try their best to make you buy some expensive coffee.."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Surprised. Wasn't too sure about stopping here but really gold we did. On arrival given a brief tour of the garden with an overview of each fruit tree as well as coffee and chocolate. We then sat down for free coffee and tea tasting including locally made chocolate in lovely surroundings over looking paddy fields. Very friendly staff and entrance to the plantation if free also. That said we spend about $40 on tea to bring back home!"
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Capoochino with a difference!. Very informative and interesting. Originally I wasn't overly fussed about stopping here but was really glad we did. Sampled many herbal teas and organic coffees. Opportunity to purchase products if you wished, but certainly no pressure by Putu, our guide, to do so."
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Try the best and most expensive coffee in the world!. An English speaking guide took us around the plantation and showed us coffee, cinnamon, vanilla, cocoa, ginseng and ginger growing. We also saw the luwaks sleeping (they are nocturnal). We could also see the entire process of coffee production taking place - beans, roasting, grinding, and sifting, all done by hand in the traditional manner. Then we could sample many different flavored teas and coffees - this tour is not just for coffee lovers. The tour was free, but if you want to try luwak coffee you have to pay a small amount. The luwak coffee was indeed the best coffee I've ever tasted, so don't miss it! Also take some money to buy coffee or tea on the shop. You'll definitely want to after you try the samples! We only spent about an hour at the plantation, yet this tour was one of my best Bali experiences!"
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Wow!. This place was a short visit for some quick local knowledge on the makings of Lewak coffee. Our tour guide was very passionate and we enjoyed our time with her. This is a great attraction to visit after the rice terraces and perhaps on the way to the volcano as it doesn't take much time but is definitely something worth doing."
        }, 
        {
            "index": 248, 
            "rating": "4", 
            "review": "Had to try the Luwak Coffee. This was a really fun attraction. The tour of the plantation and tasting of various teas and coffees is free, but the Luwak coffee tasting is 50,000 rupiahs (about $5 CDN) per cup. It was definitely worth sharing a cup of it to say you've have coffee made from beans in weasel poop! On your way into the plantation, there are many plants growing from pineapples to ginger and sugar cane. Take your time strolling in to check them out. You can see and feed the animals while you walk in. A guide will great you and show you how they make the coffee. They'll provide you a tray of coffees and teas to try out and escort you through the gift shop when you are done your tasting. It was a great learning experience and would suggest to anyone that this is a \"must do\"!"
        }, 
        {
            "index": 249, 
            "rating": "5", 
            "review": "Try the luwak coffee. Worth a visit to say you've tried luwak coffee when you get home. It's the only place you'll be able to afford a cup of it to be honest. Lovely but a little cruel the way the civit cats are kept wired on coffee in cages."
        }, 
        {
            "index": 250, 
            "rating": "4", 
            "review": "Luwak Coffee. This was a nice little diversion on the way to the volcano one day. We were able to sample various teas and coffees produced by this family coffee plantation."
        }, 
        {
            "index": 251, 
            "rating": "5", 
            "review": "Interesting. Didn't know much about coffee until you visit a coffee plantation. Truly a unique experience. And they offer tastings for free whilst you sit down to a beautiful view!"
        }, 
        {
            "index": 252, 
            "rating": "5", 
            "review": "Great tasting coffee and teas!. We arrived expecting more of a \"plantation\" feel but it's more like a beautiful lush tropical garden on the edge of the jungle. The Luwak's definitely prefer to eat coffee beans! There's no pressure to buy anything after the free tasting (there's about 5 coffees to try and maybe 8 'tea' varieties) although you do have to pay to taste the Luwak coffee. We did spend quite a lot of money in the gift shop here (for Bali standards!) but we absolutely loved so many of the coffees and teas that we just had to take some of each home! We did get them all through Australian customs!"
        }, 
        {
            "index": 253, 
            "rating": "5", 
            "review": "Excellent Coffee - worth a visit. As this was our second trip to Bali, I needed to try real Luwak Coffee. The Satri plantation was beautiful, clean, and didn't feel like a gimmick for tourists. I had a chance to look at the coffee making process as well as sample all different types of Balinese coffee. And yes, I did drink a cup of the Luwak coffee (was good!) and bought quite a few packages to take home to family and friends. The staff were very friendly and accommodating. We never felt rushed or pressured to buy anything.The only negative from the whole visit was being ambushed in the parking by street peddlers after the visit to the plantation. I can't fault Satri for this, but my advice is when you visit, get back into your transportation quickly after leaving the plantation to avoid the trinket salesmen :-)"
        }, 
        {
            "index": 254, 
            "rating": "3", 
            "review": "Nice experience. Coffee very expensive.. We visited a coffe plantation with our driver- it's really fun and a good experience, especially if you like coffee. You get to try the different coffees and of course the luwak coffee- after the tasting you go to the shop. We had to find out the that we paid almost double the price compared to any other place in town."
        }, 
        {
            "index": 255, 
            "rating": "3", 
            "review": "Luwak Coffee. We visited this area on recommendation of our driver/tour person. Convinced they must get commission. Sampled different teas/coffees complimentary and purchased Luwak Coffee IDR 50,000 for a cup and IDR 2250000, 50gr to take home for later, was told it would be more expensive else where. We found it at the airport cheaper!"
        }, 
        {
            "index": 256, 
            "rating": "5", 
            "review": "Excellent information and demonstrations. A great setting in the mountains where you walk along a path and are shown all the different coffee, cocoa and fruit plants/trees. Then a guide will show you the process of transforming the coffee beans from the tree into something you can drink - you can even have a go at roasting beans too!. Further down the path and to a shelter you taste all 12 varieties of coffee and tea they produce fro FREE - including the famous and rare Luwak coffee (which cost us $100,000Rp). Then into the shop to purchase which ones we liked. We were not pushed or hurried through and felt very welcome. A great place to relax after a day driving to the Volcano."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Try Luwak coffee. Luwak coffee or the poop coffee is tagged at its high price for a reason. One of the strongest coffees I have ever tasted. The host gives a nice tour of the region with no pressure to buy anything. There are 9 complimentary coffees served against the backdrop of steep green coffee plantations. That experience itself is enough to make the trip worthwhile."
        }, 
        {
            "index": 258, 
            "rating": "5", 
            "review": "Luwak coffee is a must. Great guides who show and explain how all the different coffees and teas are made. They also give you about 10 different teas and 10 different coffees to try including the famous luwak coffee. Well worth the visit"
        }, 
        {
            "index": 259, 
            "rating": "5", 
            "review": "So interesting!. I love bringing groups here, Tim, the owner makes it so interesting. There is a half hour talk all about producing coffee with a demonstration, finishing with coffee and chocolate cake on the lawn. They also have splendid souvenir shop with goodies that you will not find anywhere else. Just go, and at the same time, help Tim raise money for the \"Save the Rhino\" fund."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "Coffee, Chocholate, Vanilla, Cinnamon,& Tropical Fruits!. If you are staying around Ubud and you are tired of visiting so many different big temples and want to see something different, you must visit this coffee plantation field! There are Coffee, Chocholate, Vanilla, Cinnamon,& Tropical Fruits in the field! They prepare their special coffee in front of you as well! You can taste all 12 drinks for free and order one of them you love most (this is ethically obligatory) ! Plus, if you want, you can buy more from shop but prices were expensive for me. You dont have to purchase at all."
        }, 
        {
            "index": 261, 
            "rating": "4", 
            "review": "Do try Kopi Luwak. Kopi Luwak (Luwak coffee) is one of the weirdest and costliest coffee around the world. But its a must try!. i also loved other variations of the teas and coffee specially the lemongrass tea is simply amazing!"
        }, 
        {
            "index": 262, 
            "rating": "5", 
            "review": "Wasn't very impressed unfortuantly. The guide spent about 2 minutes explaining the process and it was very hard to actually see any of the plantation as they hurried you through a prepared walkway. As soon as the coffee tasting was over you were hurried into the shop and hoovered over by your guide until you were made to feel guilty enough to purchase the over priced goods."
        }, 
        {
            "index": 263, 
            "rating": "4", 
            "review": "you get to taste amazing tea, coffee and chocolates!. has nice stuff to offer. You can take back a lot of material from here. If you do buy the wine from there, the packaging is pretty bad. You might need to store the wine in better plastic bottles with tighter caps if you want to carry it back in your Check in baggage. Ours emptied enroute in the bag itself."
        }, 
        {
            "index": 264, 
            "rating": "4", 
            "review": "Not bad for an hour's stop off. Our driver took my husband and I here on the way to Ubud after we'd asked for some sightseeing en route. Having visited similar plantations in India, this was on a smaller scale but still nice and shady. Our guide was a young cheeky chappy so we had a laugh as well as learning about the plants and comparing uk / bali usage of ingredients. Unfortunately the mongoose are held in very small cages with bars on the floor so I would like to suggest that improvements are made to the housing of these animals please!We were seated in a shady area at the end of the tour and brought out a big selection of teas and coffees to try. The 'special' mongoose poo coffee is not included - this is charged at 50K rupiah per glass if you want to try (we did just for the fun but it's not very nice!). All the drinks have a lot of sugar in so taste quite nice, but we really liked the mangosteen tea, coconut tea and spiced chocolate drinks so decided to buy these in their shop at the end. They also sell spices and other bits. The prices are not cheap but I had no issue with buying the ones we wanted (and they accept credit card). Beware - they have a snake in a box by the shop where they try to get you to hold it for a picture (I imagine for a fee). My husband hates snakes so we made it very clear to our guide who told the photo lady no for us. "
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "More relaxed and informative than most coffee plantations.. We've been to coffee plantations before, where they run you through the trees, give you samples and then push you into the gift shop...but not here! We had a lovely guided walk in the plantation. Our guide took the time to show us species of tropical plants including coffee. The products are all organic and they only produce and sell in their own shop, so they can sell out of some of the popular products toward the end of the day. She answered all our questions and visited with us while we sampled coffees and teas. She was friendly and informative and we felt most relaxed. We suggest you get here earlier- we arrived at 9:30 and by 10:45 when we were leaving, the parking lot was full. Tour and tasting are free (except Luwak coffee-$50,000 rupiah same as other plantations), products in the store are comparably priced to other outlets."
        }, 
        {
            "index": 266, 
            "rating": "5", 
            "review": "Great coffe and tea. We drove into this parking area and walked down a gravelly path and we were shown some jack fruit snd some coffe trees and then we walked down further to where some young girls and some women were roasting some coffee beans. This lovely young lady who spoke excellent english came over to us and explained exactly what they were doing and showed us the difference between a male and female coffee bean and explained how the male coffee bean has more intense flavour. We were then given a tasting similar to a wine tasting but with several different coffees and several different teas. I loved the mangisteen tea and my wife loved the rosella tea. We the were given some lowak coffee which is very expensive as it is made from the poo of the sivet. The sivet is a small cat like nocturnal animal who eats the coffee ripened coffee beans then passes the beans still intact in its faeces. Its poo is collected and cleansed and treated till it is safe and the made into loeak coffee. Well worth the experience great time."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Please go here! . Authentic coffee and tea and cocoa plantation - first a little tour of the produce grown and explanation of the processes, then a free taster of 10 coffees and teas - coconut, vanilla, ginseng coffees, ginger, lemongrass teas, and then even option to try 5 more flavours for free! Luwak coffee is obviously a Balinese delicacy and any visitor should try it - 50000 IDR (£2.50) for a cup. Beautiful views of the huge plantation. Great shop - we bought lots of professionally packaged authentic Balinese coffee and chocolates for ourselves and as gifts to take home. The man who took us around was so lovely. Please tip him something when you go, he looked so shocked when we gave him a little something for his help. It isn't a long trip - maximum 45 mins to 1 hour. It is complexity free unless you want to try the luwak coffee."
        }, 
        {
            "index": 268, 
            "rating": "4", 
            "review": "Good experience!. Fun learning about indonesian coffee plantation and growing techniques. Also it is very interesting to learn about the kopi luwak a unique technique of making coffee in this country. Good one time experience."
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "The Coffee is Great Especially the Lewark!. This is a must if you would like to learn the history of coffee making in Bali. All the different coffee plants are shown with your guide explaining in full detail. You can sample the coffees for free but the Lewark coffee is IDR50,000 but well worth the cup thereof! This is the very expensive coffee processed from the coffee beans eaten by the Lewark which you can also see, very cute little mammals. Yes, you drink coffee from the poo of the Lewark! Just try it, when you understand you will really appreciate!! The taste is unique and exquisite!!"
        }, 
        {
            "index": 270, 
            "rating": "1", 
            "review": "Place is nice but . Me and my husband had nice coffee to taste they gave us deferent kind of coffee and we decided to buy more then we find at home they cheated us the coffee u Taste it's not the same u buy the just gave us like brown powder and doesn't related to coffee at all by all means so just avoid to buy any thing from them"
        }, 
        {
            "index": 271, 
            "rating": "4", 
            "review": "facanating experiece. we arrived and were greeted by a lovely young man with great English,he walked us through the garden explain the different plants they harvested and allowing us to touch and smell the leaves.We then seen the mongoose who eat the berries that the coffee comes from .This got the kids attention and they were also able to have a turn at hand grinding the beans.We sat down to a free coffee & tea tasting session and we asked if which one we like the best.The tea and coffee was lovely and the kids loving tasting the tea too.The plantation is set in a beautiful area and we were able to get a few good pics.Only let down for me was we were told that the plantation was the only place to buy the coffee or tea in Bali,so we stocked up but when arrived at the air port was selling it for a third of the price.Ir is a wonderful tour and well worth popping in for a cuppa"
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Beautiful. The plantation was beautiful. I was a little hesitant when our guide took us there thinking it was kind of a tourist trap. It kind of was but I didn't mind since the plantation was so incredibly gorgeous. We strolled through it on a rainy day and our guide pointed out all the different fruit/flower trees. It was kind of magical. I even enjoyed the tea/coffee tasting which of course leads to spending money..didn't mind spending money here though. Totally worth it."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Great coffee.. Beautiful views, fabulous coffe and an interesting place to visit. A plesant place to be on a warm Bali day. Lots of interesting things to learn about coffee."
        }, 
        {
            "index": 274, 
            "rating": "3", 
            "review": "Worth a look if you're going past. My wife and I enjoyed having a guided tour of the 'plantation', with the guide explaining the different plants and how the coffee is made, including that which is made from the droppings of Lewaks (similar perhaps to a possum). At the end of a short tour you are given a number of different coffees and teas to try, then the option to purchase any of them. The coffeees are reasonably expensive but you don't have to buy anything if you don't want to. The whole thing probably took an hour - we went there as part of a day tour around Ubud and surrounds."
        }, 
        {
            "index": 275, 
            "rating": "4", 
            "review": "Must visit for coffee lovers. I am a coffee lover and hardly leave a chance to try out new coffees. Freshly brewed and local cultivation is an added advantage. You can taste and then buy whatever you like. Price is something you need to be careful about though."
        }, 
        {
            "index": 276, 
            "rating": "4", 
            "review": "taste authentic coffee. To actually be in the coffee plantation and see the lush trees and then try the very good brew afterwards. It is such a great experience."
        }, 
        {
            "index": 277, 
            "rating": "1", 
            "review": "luwak coffee. Please do not drink or buy this coffee as the civet cats are kept in appalling environments purely for the novelty for tourists in drinking this coffee. They are kept invery small cages, some with wire mesh floor so nowhere to walk/stand. I was told they are released after 5 years!!"
        }, 
        {
            "index": 278, 
            "rating": "5", 
            "review": "Lovely way to spend an afternoon. When in Bali moments. Has an excellent store to pick up locally grown coffee, teas and various spices. The process is very interesting."
        }, 
        {
            "index": 279, 
            "rating": "3", 
            "review": "Coffww. While this place is slightly interesting it is a rip off the purpose is to sell over priced tea and coffee."
        }, 
        {
            "index": 280, 
            "rating": "5", 
            "review": "Great insight. Wonderful area, interesting information and \"hands on experiences\" not too far from Ubud. Worth a visit."
        }, 
        {
            "index": 281, 
            "rating": "3", 
            "review": "take it or leave it. A quick walkthrough the garden before sitting down to try the various samples which are all fantastic - unfortunately what you buy to take with you is a pale imitation. If you feel guilt tripped into buying something by your pleasant guide just get something small - the prices are frankly insane!"
        }, 
        {
            "index": 282, 
            "rating": "4", 
            "review": "Great Coffe. Coffee plantation tour is a nice addition to your Ubud tour. The place is nice, you are given information about various coffee and trees. Then they give you various coffees to taste for free. The view from this place in pleasant. At the end, you may choose to buy coffee of your choice."
        }, 
        {
            "index": 283, 
            "rating": "3", 
            "review": "Very small attraction. Worth going if your passing through but not a lot to see , but of a let down really as I'm quite the coffee fiend ."
        }, 
        {
            "index": 284, 
            "rating": "5", 
            "review": "Well run and great experience . We visited the Sitria Coffee plantation after a trek to Mt Batur . They have it well set up and give you a thorough and factual experience. You are shown coffee plants, different beans and have a practical demonstration of the preparation of the coffee and spices used in the making process. You are also introduced to the Lewak, a coffee bean eating cat/possum. The coffee beans that are not digested in the Lewak are collected and processed to produce a curiosity. One that I satisfied by tasting Lewak coffee and I can report that I found it a very smooth drink. The plantation also does a nice tasting and if you find one you like then you can buy some in the gift shop. The staff are very pleasant and make the experience worthwhile. There is also a good selection of teas available. "
        }, 
        {
            "index": 285, 
            "rating": "3", 
            "review": "Kind of a tourist trap.... It's a coffee farm, that is basically there for tourists. It is a stop on most tours through Bali regardless of what else you are seeing.Pros: it's relatively quick. The lewacks are cute, but sleep during day. Cons: tourist trap!, they are there to try to sell you coffee and junk merchandise only. Buyer beware the super expensive lewak coffee is simply not good, brought some home and expertly brewed it...the cheaper bali coffee is better but even that is overpriced. Conclusion: avoid if possible, but if you take a tour (which you should also avoid) you will inevitably stop here, but you can at least breeze through quickly!"
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Remember The Bucket List??. Who can forget that wonderful scene in the hospital room when Morgan Freeman so gently debunks Jack Nicholson's elitist coffee bean and service gear? Well here it is - the genuine kopi luwak (sp?) coffee bean and the animals that 'produce' it. Here it's dubbed 'cappoochino'! And, yes, it must be the most expensive coffee in the world and, frankly, we didn't think it was worth it. You get to sample (for free) about 12 different coffees and teas (a couple of which were outstanding) but you have to pay for the poo bean coffee. This plantation is worth a stop for sure. It's free, the attendants are sweet and friendly and I even got to stir some beans that were being roasted."
        }, 
        {
            "index": 287, 
            "rating": "3", 
            "review": "A variety of coffee for tasting. The place is ok has Luwak coffee. I am not sure if I would want to drink that since it is made after feeding a coffee seed to Luwak and subsequently processed from its excreta. The shop inside had a wide variety of tea/coffee powder."
        }, 
        {
            "index": 288, 
            "rating": "4", 
            "review": "Fun stop. My husband and I and three year old daughter went to the coffee plantation, we had a private guide who showed us all the different plants growing on the farm before handing us off to the staff who explained the coffee process to us! It was great to know I'm not the only one with grounds in my coffee - the Balinese don't use coffee filters! We enjoyed the samples, even my daughter loved the teas and took a small sip of the coffees. We bought some treasures to take home for family too"
        }, 
        {
            "index": 289, 
            "rating": "4", 
            "review": "Awesome coffee. Enjoyed a great range of teas - the lemongrass is fab - and coffees at this lovely plantation. But it's the Luwak coffee which is the star. It is pricey but tastes so good. The staff explain how it's made so it's no wonder it's expensive. Well worth the visit."
        }, 
        {
            "index": 290, 
            "rating": "1", 
            "review": "Not the real thing. Kopi lewak is \"the most expensive coffee in the world\" because the civets supposedly select only the choicest of beans. If you lock them in cages and feed them any beans, it defeats the purpose! Now you just have poo coffee, and really sad-looking cute animals :-("
        }, 
        {
            "index": 291, 
            "rating": "4", 
            "review": "coffee tea anyone. interesting place - sampled lots of great tea and coffees but of course the \"cat coffee\" was a treat- great story go and research it."
        }, 
        {
            "index": 292, 
            "rating": "4", 
            "review": "Kopi Luwak. The most expensive coffe on the world, made from the excrements of small lovely animals. Indosnesians call them Luwak. You will see how this coffe is made and you can taste some other tea and coffe from the producer. Very interesting and nice nature."
        }, 
        {
            "index": 293, 
            "rating": "5", 
            "review": "Lewak coffee making. This is a great tourist attraction of Lewak coffee production. We were met by a guide who explained the plants and fruit trees as we walked down to the Lewak animal cages. I've never seen a giant passionfruit before, it was the size of a football ! The cages each had one animal per cage with fresh coffee beans for consumption. Then there was the pooped beans waiting for collection. We then saw the beans drying, roasting, grinding process etc. It was all very interesting. Finally we went to the sampling balcony where there are tables to sit at whilst waiting for free samples of teas and coffees. Each tray had a variety of seven samples. We did purchase a cup of the Luwak coffee and it is absolutely an acquired taste. This is a definite must do tour."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "fabulous place. I visited here today whilst on a whistle stop tour with a driver. My driver pointed out which bushes were the Bali coffee and which weren't. There are lots of other fruits growing there which were nice to see in their natural environment. The girls there explained about how the coffee is processed and how the Lewak coffee is different. You get to try several different types of organic teas as well as different coffees for free, however you do need to pay to try the Lewak coffee. i was looking forward to trying it, but strangely enough it wasn't as nice as the normal Bali coffee. The ginger tea is to die for and so good for you."
        }, 
        {
            "index": 295, 
            "rating": "4", 
            "review": "Very enjoyable. Was really looking for the kopi luwak coffee, but strangely ended up enjoying the other teas more. Enjoyable and interesting, worth a visit"
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "Amazing!!!. My partner and I loved this place!!!! It was such an amazing experience and one that we still talk about. The ride out there is beautiful from Ubud (I would suggest going on scooters if possible to experience it fully). The staff there are amazing, relaxed and are happy to sit and chat to you about their lives and villages etc. The teas and coffees are all free samples and you could sit there for hours looking over the forest drinking the amazing teas and coffees and never spend a cent. Once you are finished before you leave make sure you go through the shop and buy some of the teas to take home with you! We bought heaps and we are still drinking them! Wishing we bought more!"
        }, 
        {
            "index": 297, 
            "rating": "4", 
            "review": "Coffee Time. Great time to reach to coffee plantation area and see the animal which eats the seeds of coffee and after 3 days it comes out after many enzymatic reactions. It's the most expensive coffee in the world- Luwaq. One cup is 50000 rupees equal to 4 dollars.Many other coffees you can try for free.Good introduction. Love it."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Luwak. Great walk seeing how they make Luwak and seeing all other produce (a blessed bali). And then trying different types of coffee and teas. Loved it"
        }, 
        {
            "index": 299, 
            "rating": "4", 
            "review": "I drank poop coffee!. This is a must see! The samples o's tea and coffee were delicious. The view of the terraced rice fields was unique, but drinking coffee that is processed through a mercat was a new experience. This was fun!"
        }, 
        {
            "index": 300, 
            "rating": "4", 
            "review": "Wrong information . The exact name for this place is Satria agrowisata, located in tampaksiring, not in ubud. Kindly correct this information, or perhaps merge it with the 'real' Satria agrowisata's TripAdvisor page as it confuses travellers like me."
        }, 
        {
            "index": 301, 
            "rating": "5", 
            "review": "Well worth a visit. Great selection of locally grown coffee and tea. Samples are provided of all products and available for purchase. Nice to visit something authentically Balinese."
        }, 
        {
            "index": 302, 
            "rating": "4", 
            "review": "The CatPooChino!. The Loumak is a little animal that eats the coffee beans and when it comes out the other end it is harvested and made into the most expensive coffee on the planet. But besides that you can taste all their coffees and see how herbs and fruit are grown. Very interesting...."
        }, 
        {
            "index": 303, 
            "rating": "5", 
            "review": "Amazing coffee and herbal tea tasting!. loved walking through and learning about the different things grown here, from ginger, cinnamon, cocoa, to coffee, mangosteen, and rosella! Had our sampler in the most beautiful setting! Definitely worth a visit and would love to have taken home all the teas!"
        }, 
        {
            "index": 304, 
            "rating": "4", 
            "review": "A must try - poop coffee. A unique experience and worth trying. A guide greets you and takes you on a quick tour (15-20 min) of the farm where they explain the process of how they make the poop coffee, show you all the various spices they also grow there which was very cool. You then grab a table along a mountain side with incredible views and they bring you 8 different coffees and teas to sample for free all made from the ingredients from the farm (ginseng tea, cocoa, vanilla coffee and more). If you want to try the poop coffee it was $5 CAD. You can walk down and out on to a wooden terrace for a further view and great picture opportunity. Once you're done your coffee samplers you walk through a store where you can buy some of what you tried if you like. They weren't pushy and didn't force you to make a purchase though. Neat experience to try if you have about an hour."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "An absolute must - free!. You are guided through the plantation to view various coffee trees, cocoa trees & fruits.Our guide had excellent English & enlightened us on the journey of a coffee bean into our mug - it was GREAT!Then, we were prepared a sample of 8 coffee/teas - Bali coffee, Ginseng coffee, Coconut coffee, Mocha, Cocoa, Lemongrass tea, Saffron tea (with Tamarind & Tumric) and Ginger tea. My oh my YUMMY!!! Not to mention the breathtaking view!! Couldn't resist getting a few packets of coffee to bring home. The ginseng & coconut coffee was our favourite!"
        }, 
        {
            "index": 306, 
            "rating": "5", 
            "review": "kopi luwak. that was probably spelt wrong sorry. I was loath to try the kopi luwak but it truly is amazing and when you see the process you realise that there is nothing 'yucky' about it at all."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Really interesting. This is well worth a visit .Firstly there is the walk through the gardens where there is every imaginable fruit and plant -bring a local guide to get a full explanation - by the way everybody in Ubud seems to know all local details! Then you see the traditional way of coffee making - still in use. Then to the sampling menu of coffees and teas for free unless you want to taste he 'special one'. Everything is explained in detail by the gentle hostess. I think I have kept several illnesses at bay as a result of the various teas I drank. Then off to the shop - but no pressure to buy anything- still it is hard to resist all those 'cures'."
        }, 
        {
            "index": 308, 
            "rating": "4", 
            "review": "Possum Poo Coffee A Must!. Great place. The staff guide you quickly through the process of making their unique Luwak Coffee (yep..those little possums eat the bean, poo the bean and that thar bean makes coffee!!) and you can have a go at roasting the beans and crushing them. You end up in their cafe which has the most beautiful views of the plantation where you are served a selection of all their coffees along with, if you wish to pay for it, a full cup of their signature Luwak coffee.By the way...it tasted amazing!"
        }, 
        {
            "index": 309, 
            "rating": "4", 
            "review": "coffee & a view. i love plants & therefore i loved the coffee plantation tour. they have all sorts of exotic plants growing that you can photograph. this one had tasting tables with a view. ( there are many plantations in a row, so perhaps they all have a view )? you try out approx 12 types of coffee/teas. some are REALLY good. ( i wish i would have bought the lemon grass tea ), but i bought mangosteen & rosella ( which is different from rose! ) and i bought bali coffee. this plantation is organic. thats why i bought here as opposed to a cheaper market, because i know its organic. yes, its cheaper in the markets. at the end of the tastings they ask if you want to try the luwak coffee for 50,000IDR ( approx $4.50 USA ) . this is the Luwak animal poo coffee. i tried it because this is probably how the guy gets paid. and they probably get commission by what you buy in their shop. so if you like the guy, buy up."
        }
    ]
}