{
    "category": "Ubud", 
    "entity": "Authentik-Bali-Day-Tours", 
    "avg_rating_stars": 4.886363636363637, 
    "review_count": 88, 
    "rating_stats": {
        "poor": 0, 
        "average": 2, 
        "terrible": 1, 
        "very_good": 2, 
        "excellent": 83
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Great experience . We had a great day with Ayu as our guide. It was just the two of us and her so we could adapt the trek as per our preference, including an earlier finish than originally planned.Loved walking through the villages and taking the local tracks down to the river, crossing it (wasn't expecting wading in waist deep water but all fun), walking the rice fields, chatting to the farmers and visiting locals, including a fantastic art collection/museum. I recommend anyone with a genuine interest in local Bali life to try this tour. Ayu is a lovely guide and I hope the business continues to thrive in the future."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Great day trekking with Ayu . Our first day in Ubud couldn't be better spent than trekking with Ayu from Authentik Bali. Super friendly, fun and informative - Ayu has great English to match. The trekking was exactly as challenging as we hoped. We got a decent sweat on and was rewarded with a swim in a waterfall. Lunch provided was beautiful too. Prepare to get you shoes and feel wet - it's inevitable, but as it's so warm you don't mind. Would thoroughly recommend this tour."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Just amazing. I booked this hike before we went to Australia, there were 10 of us ranging in age from 11-48 and we all had the best day of our holiday. Ayu was our guide, she picked us up promptly at our villa, and en-route took us to a local market, off the tourist track. We tasted unusual fruits and beans, Ayu told us all about the market and how the locals shopped there. Throughout our journey Ayu explained the areas we were driving through, the Balinese culture and the Hindu religion. We started our hike watching and learning the process of drying the rice, this was a great way to start. We made our way through forests, we crossed rivers, climbed river banks, and emerged breathlessly to the beautiful rice fields. We ate a lovely lunch sitting on rocks in the river, after a refreshing swim. There were no other tourists around, which was fantastic.Ayu took us to villages, she brought us into a local home where we had tea/coffee and ate traditional sweets. She told us all about the homes, what each building was used for and the temples that each home had.Nothing on this trip was too much bother, Ayu was patient when we slowed down, she told us all about her life growing up in Indonesia and provided us with a greater knowledge of Bali. She emailed us after our trip offering help and advice for the rest of our holiday. I can't recommend this hike strongly enough, they are incredibly flexible and will provide a hike to suit your needs."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Wonderful day in the rice fields. We spent a wonderful day hiking in the rice fields with Ayu. We saw beautiful landscapes and learned a lot about the balinese culture and traditions thanks to our guide. For lunch, we had a typical local meal, freshly cooked by a local family. Great experience!"
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Beyond expectations! . We did the hike today with Augustin, who speaks Indonesian, seems to be on very good terms with local farmers, and knows a lot about their culture. We saw people working in the rice paddies, strolled through villages, were offered coffee by locals on multiple occasions, and had some coffee. Best of all was trekking through the jungle, where we pushed through dense vegetation to \"find\" a waterfall. Waded downstream through a gorge, with water waste deep at points (there was the option of a different path). Midway we had a lovely lunch (made by Augustin partner) while looking over gorgeous rice paddies. It really felt like going on a hike with a friend who knew the place inside out. One has to be reasonably fit to do the hike we went on, but Augustin also adjusts it based on the ability of participants. We are so glad we went on this tour! This was just an awesome experience."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Great tour on the \"authentik\" side of Bali. We went with Ayu for this full-day tour in July. This turned out to be our favorite day from the full vacation on Bali. There were actually no other tourists around and we could see local people working on the rice fields, washing their clothes, or taking a bath in the river. Ayu was very knowledgable about everything and always told us some extra info and background - especially when it came to rice and the full process of growing and harvesting it. She also told us about life in Bali and Indonesia in general, and we learnt a lot by just talking to her about her experience of growing up here. Also, a very large plus is that we scheduled the visit the day before at 10 pm and they were super-flexible to take us on the tour the next morning. And even the next day, after the tour ended, Augustin provided us with some great recommendations on where to spend our remaining time in Bali. Thank you both for the great experience! "
        }, 
        {
            "index": 7, 
            "rating": "3", 
            "review": "Cool tour but missing a highlight. The tour was cool and Augustin could also explain us a lot about the Balinese people. But for the price of 65 Dollar per person it was not too great. A highlight (like visiting a school what I've read in several reviews) was missing."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "A great day! . We had a great day with Ayu! She gave us a choice of easy or harder track. We chose the latter as we really wanted to see some waterfalls! The track was challenging indeed .we got wet and dirty but we loved every minute of it. Ayu is a great guide and extremely friendly. Would definitely recommend it!"
        }, 
        {
            "index": 9, 
            "rating": "5", 
            "review": "Excellent day seeing the real bali. If you're after an adventurous day out, off the beaten track, then this is your type of trip.Ayu picked us up and drove us to our starting point near ubud and within 100 metres we were off the beaten track walking through the rainforest, jumping across creeks, slipping down muddy trails, wading along rivers, climbing ladders, jumping across the top of weirs, crossing rice paddies and learning about the real Bali.Bring your Tevas, Keens or other enclosed toe outdoor water sports shoes or sandshoes to protect your feet, but be ready for them to be wet and muddy at the end of the day.An excellent day out. You need to be reasonably fit and not afraid of walking the edge of drop offs/cliffs etc.We did the medium walk which was 10km of up and down trekking and we slept well that night.Thanks Ayu, The trek, your local knowledge on Bali culture and explaining the farmers way of life combined with your vibrant personality and the nasi campur lunch made it a great day out."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Brilliant. This should definitely be number 1 on your list of things to do if you want to experience the real side of Ubud and Bali as a whole. Augustin is a great host who has made friends with the locals of the areas he goes to. You will trek through places not touched by commercial tours and experience things not available on any other tour.We hiked through dense forest, through rice fields, swam in a river with local boys, had coffee with a rice farmer, climbed through ancient structures and watched a cock fight (which may not be for everybody, including me, but helps you get a sense of rural life). Augustin is funny, not afraid to say what he thinks and can answer every question you ask very thoroughly. Can't recommend this tour enough!"
        }, 
        {
            "index": 11, 
            "rating": "5", 
            "review": "Authentic and Beautiful Trek with Amazing Guide. My wife and I booked a day hike with Authentik Bali. Ayu, one of the owners, was our guide. She was prompt for pickup at our hotel and we stopped once to get another hiker before driving to the beginning point. We started the trek walking thru a rural village before getting to the countryside. Bali has changed a lot in the 20 years since we first came here, but once we got to the rice fields, it was like going back in time. This was no tourist hike! We crossed and walked through the river several times, navigated our way across tiered rice paddies, were greeted by workers in the rice fields, children bathing in the river, and even a few cows.There is some scrambling up and down but most of the hike is pleasant and flat. Ayu was a wonderful guide, knowledgeable about the Balinese culture, the flora and fauna, and the environment. She is energetic and passionate about what she does and it shows. She showed us how they grow and harvest rice and took us to where the farmers were using a machine to separate the chaff and bag the rice for sale. She even brought a nice gift for the farmers.There is a simple lunch served that you eat by the river after you climb down from a temple made by Giants. Strangely, one of the highlights of the journey was when my wife and Ayu spied a small puppy that had been abandoned in a drainage canal and rescued it. We took it back to Ubud and Ayu spent two hours with us until we found a rescue shelter willing to take it in. She even changed her dinner plans to make sure the puppy was taken care of. How many tour guides will go this above and beyond? We had a wonderful day with Ayu and our companion and would book this again without hesitation. Authentik Bali is a company with a soul that truly cares about bringing the beauty of Bali to the rest of the world."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Hidden Bali countryside trek. 3 adults just completed a great trek with Ayu, she is a beautiful person, a local Balinese who guided us through villages, rice paddies, forests, rivers and made a hugh improvement to our Balinese knowledge. She spoke excellent English and had a fantastic rapport with the locals. The walks are varied according to the group with a maximum of 6 people. We walked for 10km, at our pace, took 6 hours but felt pretty tired at the end with the heat. The trek took us to places we would never have experienced otherwise. You need foot ware to manage water, roads and a bit of mud. Something to hold your water bottles would make the walking easier. The trek is pricey but probably worth the amount esp for long term memories! I hope their business goes from strength to strength!"
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "An amazing experience. So much more than just a tour! . Augustin picked us up on our hotel on time and drove us to a place he decide to go to, based on the people of his day tour. He told us a lot about a the Balinese culture and walked us around the ricefields of Ubud. It was an adventurous tour that we really liked. Worth every penny. We would really recommend Authentik Bali tours!"
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Day trek. Cracking day out, absolutely loved it. Augustin really looks after you and takes you places you never get to see. If you can, a must day out!!"
        }, 
        {
            "index": 15, 
            "rating": "5", 
            "review": "Amazing. We did a one day hike with Augustin. We had an amazing day with beautiful landscapes and authentic villages. Augustin was really good prepared. He had water and food with him. Worth the efford and money!!"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Unique, amazing adventure!. This was a real adventure! We went through rice paddies, the jungle, and small villages. My husband and I would never have been able to have this experience on our own. We highly recommend a tour with Augustin for people who want a unique trek outside of the tourist area. We recommend wearing hiking shoes."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "Fantastic. A must-do.. I've just gotten back after a trek with Augustin and it was fantastic. For an expat he has an amazing knowledge of Bali and in particular the areas surrounding Ubud. Taking you through the rice fields and speaking to the local people you forget that he hasn't lived there all his life. He took us to a spectacular waterfall for a simple but delicious lunch before driving us back to the hotel.Now for everyone who is thinking of doing this tour I feel it necessary to tell you that it is a TREK. We're talking walking through muddy rice fields and bush sometimes with steep inclines in the Bali heat. So you need to be reasonably fit. But it is ABSOLUTELY worth every step to experience the real Bali and some lovely people."
        }, 
        {
            "index": 18, 
            "rating": "5", 
            "review": "Great experience. If you want to avoid beach for a day in Bali, definitely go for the authentik track. Augustine is a great guide, knows locals, acts like a one, and that is why you will not only enjoy lovely walk in beautifull nature, but you will as well learn more about Bali than through wikipedia. Go for it!"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Epic . You won't experience Bali without trekking with Augustin. Hands down our favorite part of our vacation. I've never reviewed anything on Trip advisor but this was worth giving him a glowing review. Oh and the lunch was great too!!"
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "A truly Authentic experience!. We heard about this tour via tripadvisor and it was not a disappointment! A great experience from start to finish! Augustin tailors the treks to the clients! We did the jungle trek and was amazed at all the stunning views of the rice fields, the jungle and the local villages. If you want something away from the usual tourist crowds this is definitely a tour for you! We did not see one tourist whilst trekking only lovely locals going about their day to day lives! It's amazing to see the relationship Augustin has with the locals! They were always pleased to see him and would offer us fruit and drinks! His local knowledge is fantastic and is happy to answer any of your questions. Definitely a must when visiting Bali!!!!"
        }, 
        {
            "index": 21, 
            "rating": "5", 
            "review": "Wicked tour with an awesome guide. Had an amazing trekking tour with Augus. He's just an awesome guy and the tour was so much fun! thank you for the most amazing day in Bali! if you read this, do the tour!11 I can't recommend it enough! 11/10"
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Fantastic day trip through jungle and rice fileds. We had a private hiking tour with Agus in March 2016. Everything was very well organised (pick-up at the hotel in Seminyak, transport to the starting point by car, food, drinks, etc.) and worked like a Swiss watch. The hiking tour itself was great fun, walking through the jungle, crossing rivers and rice fields. The landscape was phenomenal and the hike was easy to moderate (I had a knee surgery recently and could follow without problems). Agus is very knowledgable with Bali, the landscape, the culture and the local habits. On the ways we met a lot of people, who knew Angus from previous hikes, ending up in a chat with locals and getting a coffee. Great fun!"
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Lovely rice fields walk with interesting guide. We asked for an easy walk to suit our ability, but my understanding is that Augus will tailor the difficulty and content to your requirements.it was wonderful to get out of tourist choked Ubud and to enjoy the quieter sights and sounds of the countryside.Augus himself is a charming young man with a lot of enthusiasm for what he is trying to do with his own life and for those around him. It was simply a pleasure to spend time in his company.Thank you!"
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Simply wow. We were wowed from the beginning. Augustin is a very nice and knowledgable person. He speaks local language which is a nice touch when visiting local families. If you are fit enough ask for the most \"difficult\" track which give you adrenalin, breathtaking views and very very local experience. We have never had a track before so we were little bit afraid but Augustin explained us how to walk safely. This acitivity is absolutely \"must do\" when in Bali! Can´t express enough the feeling when we arrived back to the hotel, took off shoes and were just thinking about what we just experienced. Thank you Augustin!"
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Excellent day tour!. We were very happy with the day tour that we got with Augustin! An amazing trek through 'real' bali and we got to experience and explore what it is like for every day living Balinese people. Agus speaks the local dialect and was able to answer all our questions and more! Absolutely worth the trip and we got to meet some very friendly locals and get a better understanding of their way of life and culture. Well recommended to everyone looking for an authentic experience. AAA+++"
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "Bali Day tours with Gusty. Gusty is a Balinese people who is very kind and helpful. He organised to us 5 days on Bali he tried to show a most important things in Bali. We are viewed a lot of beautiful places , my wife dream was hugs Orangutan baby and everything was come true .So Gusty 's a personal driver and tourist guide, he's fee was fair, not expensive. If you want to check him call: +62 82 146580919 or 082 146580919 email:gustitours@yahoo.com"
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Great trek. Enjoyed my trek with Agus through the Ubud countryside. Rice fields, streams, jungle and first hand encounters with the locals. Also enjoyed his stories about living in Bali and the local habits. Agus was very responsive on my e-mail requests and got back to me within a very short time. Highly recommended for people who want to see the real Bali past the tourist attractions."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "A must when in Bali. I was lucky to hear about Agus and his treks from someone on my flight to Bali. So glad I did. You could head out on your own and try to follow a trek from a travel book, you’ll probably see some pretty things and probably get lost more than once (trust me I know from experience). Or you can head out with Agus and not only see the beautiful scenery Bali has to offer, but also meet the beautiful people in their villages and homes far from the influence of tourism. If you want to meet real farmers in their fields and share a coconut or coffee with them, Agus’ treks are the way to go. No artificial tour fluff or souvenirs in sight, just Bali. In addition to the trek itself being amazing, arranging it was a breeze. Just a couple of emails and I was picked up from my hotel and on my way. It was a fantastic experience and definitely set a high bar for the rest of my trip."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "Most amazing day in Bali. I had de the chance to do several trekking days with Augustin and to be honest it was my most amazing days in Bali! It is always perfect. Beyond being extremely nice, Mas Agus is a Bali lover, he definitely knows Bali even better than some local people. He will bring you through amazing rice fields, rivers, villages giving you a taste of the authentic Bali. And the luxe in all that is that you will not see a single tourist: discover of the rural work and life, discussion with farmers, visit of traditional houses, lunch in the middle of the rice fields,… Without forgetting to be sporty!In Bali, you should of course rent a scooter to discover by yourself but you should also definitely go trekking with Mas Agus, I promise that you won’t be disappointed and you will discover the real traditional Bali. Not the one you can see with tour operators. With the different paths he knows he will always be able to adapt it to your physical conditions, the weather, what you want to see,… Definitely to be done!"
        }, 
        {
            "index": 30, 
            "rating": "5", 
            "review": "Great day trip. Kudos to Agus for charting these hiking routes. This was an excellent break from the hyper-touristy areas of Bali. We did not see any other tourists on our hike. If you read the Authentik Bali website or some of the reviews you'll know that Agus picks his routes based on the people in the group on a given day. Our group happened to be suitable for one of the more challenging hikes, which included wading through a small river (water was up to my chest at one point), climbing incredibly steep mud paths, and treading very carefully across rickety \"bridges\" and narrow rice field ridges. You do have to be careful and watch your ankles because the grass often obscures where you can step safely, and you also don't want to ruin what the farmers built with their bare hands.If this kind of hike doesn't sound like fun you should probably let Agus know ahead of time so he can have an alternative in mind. As other reviewers have mentioned, he also shares a lot of interesting information about Bali culture along the way."
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "Best Day trip. Went to the holy spring water temple. nice place and beautiful culture to see and experience the cold spring waters"
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Best person in all of Bali. Agus knows half of Ubud or more. We had a truly authentik experience getting to meet local farmers, having local teas and ONE FARMER PICKED A FRESH PINEAPLE AND CUT IT ON THE SPOT FOR US. Augustine is friends with everyone and is a genuine legend."
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "Brilliant day!. This trek was one of the highlights of our trip. Augustin is so knowledgable about the area and the people, it was a real insight into the real Bali. We walked through paddy fields, waded through rivers, visited local farmer's compounds, climbed hills and crossed a very ricketty, very high bridge of which I was terrified but I did it!! Thank you, Augustin for a brilliant day."
        }, 
        {
            "index": 34, 
            "rating": "5", 
            "review": "Great way to experience the real Bali. I’ve been on many hiking tours around the world and I must say that this one was exceptional. Our guide Augustin was very knowledgeable and entertaining. He is a great observer who is able to shed light on many aspects of Bali culture that I completely missed as a tourist. He adds so many funny and interesting anecdotes that I feel I got my money’s worth from the stories alone.The storytelling however is barely the tip of the iceberg. The hike itself was a wonderful adventure, thoroughly challenging and fun. We spent a full day soaking in the spectacular scenery Bali has to offer; meandering up and down rice fields, wandering through rivers and waterfalls, visiting local villages and enjoying the warm sun. Throughout the day we took plenty of breaks and had insightful conversations not just on Bali but all sorts of topics. There was no rush, no sense of needing to get anywhere, just time to spend enjoying the journey and the great conversation.Beyond that, what really set the day apart were a couple of fun sections that expanded our expectations for this tour. I think Augustin likes to keep these a surprise so I’ll just say that be prepared to get wet and push your sense of adventure a little. The experience is amazing. We had an unforgettable day with Augustin and I highly recommend this tour to anyone visiting Bali."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Photo treck. We had a great time walking around the Ubud area for 5 hours. During this time I had the opportunity to have nice shots while enjoying the forest, crossing rivers, visiting couple of families and understand their culture and style of living. Excellent time recommended for all ages."
        }, 
        {
            "index": 36, 
            "rating": "5", 
            "review": "One of the few interesting things to do in Bali. I found Bali to be extremely touristy, with the center of Ubud and other towns being packed with street vendors, taxi drivers and massage ladies harassing you on the streets every second, with every street filled with restaurants and shops catering to tourists, with all signs in English. A complete and total sell-out. Hence why I was thrilled to explore the untouched parts of Bali. Augustin was excellent at taking us to some off the beaten path locations. We hiked alone (4 of us) through majestic and peaceful rice fields, visited local villages and learned about the villagers' way of life, even did a very wet hike when we took a shortcut through the river after passing a waterfall (very Indiana Jones like and super fun!). I definitely would not recommend wasting your money going to Bali, as there are maaany other places in SE Asia that offer much more without being so touristy, but if you're really going there, then this tour is really worth it. The beauty in Bali is in the untouched places, not the crowded and messy touristy areas. This tour will show you the authentic exotic beauty that's around."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "If you want to see The real beauty of Bali, book a tour with #authentikbali. . This dude knows his way around the backend of Bali. This day tour is worth so much more. He understands authentic and understands the island and it's people. The trek was a once in a lifetime experience, but his stories and knowledge priceless. He is passionate about what he does and it showed. Take good trekking shoes and bring your waterproof #gopro. Your gonna get wet! Well worth it Augustine! Stellar experience"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Cool adventure full of surprises. We just saw the reviews and decided to book the tour without knowing much what was waiting for us. Waterfalls, rice fields, walking in the river, visiting a local family, climbing... And a special thank you for Augustine for the great stories and perspective to the local culture and people. Take proper shoes for the trip! It was an adventure we will remember for a long time."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Best hike on Bali. We did the day tour with Augustine and we loved it! We visited a balinese family, walked through the rice fields, went to a secluded waterfall and had a really good time. We can very much recommend this tour!"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "The hidden paradise. Did my trek with Augustin and realised that after having visited this island more than ten times I had never seen this side of Bali. Pure nature, spectacular landscapes and the river crossing especially was an incredible experience. Augustin is a great tour guide and knows everything from the local language to the landscape itself. All the Local villagers know him and invited us in for coffee and tea. The lunch was overlooking the paddy fields and was very picturesque and very special. I would love to go again on one of his other tours again as it's an experience of a lifetime.Five stars for a very reasonable price! Recommended for people who wish to see the non-touristic natural side of Bali as it was 30 years ago."
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Amazing trek in Bali. Did the trek with a friend in late October 2015. Was a wonderful experience. The group is limited to 6 people (we were 5 overall). It is really all about the less travelled road and hidden sceneries. You get mudy, you get dusty, you get wet, but most of all you end the day happy and full of great memories. Augustin is a great guide that explains everything clearly and keeps the group interested. Wholly heartedly recommend this trek if you like an adventure and want to see Bali as you always wanted too."
        }, 
        {
            "index": 42, 
            "rating": "5", 
            "review": "stunning. This is one of the best experiences available in Bali. Hats off to Augustine for his passion and allowing others to join him. He will take you on a hike through forest, river. rice paddies, villages. You will see a side of Bali that most tourists don't know exists. There is something in his tours for everyone you don't need to be a fitness freak, just have a desire to see something amazing, Bali as it used to be."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Awesome experience in Bali. We were spending a week in the Ubud region since we wanted to avoid the more touristy Kuta anyway. If you like experiencing the less travelled road and learn about the culture of the place you are visiting, then Augustin is the right guy for you. We had a fantastic day with him, he takes care of every little detail - even had a water-proof bag in his backpack to carry our mobiles and camera, which we had not thought about. He will pick you up promptly, and takes care of water and food for the day. He also bought a little bird as a present for a family whose home we were going to visit - nice touch. As everybody else is saying, be prepared for some hill climbing and water wading, so you will get wet and dirty, but that is part of the fun. We got to see up close things that we would have never, ever seen if it were not for Augustin, all accompanied by his great sense of humor and his knowledge of the Balinese culture. The jungle, the rivers and cascades, the gorgeous rice pads and the lovely Balinese people. Thank you Augustin for this truly amazing experience!!"
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "\"Into the wild\"! No 1 activity in Ubud. Back to the top!. If you come to Bali and even close to Ubud you have to book a tour with Augustin! We have been in Bali for almost a week now and this is the best activity and the most fun we had so far! You get a very good view behind the facades of organised taxi tours to prearranged shops and temples. Enjoy the lush green rice terraces while standing inside them, not from a car window or a restaurant terrace, so you can actually see and understand how the rice is grown. Put your finger at the pulse of the island while raising your own a little, climbing up and down dusty hills and crossing shaking bamboo bridges. Take in all the jungle has to offer while wading through a small stream that gently cools your feet. Augustin has an excellent knowledge of the area and the people here and you can learn so much just by talking to him. He speaks excellent English and has a very open mind and personality, so he is very easy to talk to and like. He will show and tell you as much as possible and even brings and carries lunch and water for the hole group, so you really get your moneys worth. He talkes to a lot of locals as he meets them during the hike making jokes and getting the latest news. Plus: if you are even a little bit of a Bear Grills fan: the whole experience has a bit of a \"into the wild\" feel to it. So what are you wating for? Grab your hiking boots or other sturdy footwear (recommended) and some quick drying clothes and book your trek today! (best done a couple of days in advance (a few more in high season) via email)"
        }, 
        {
            "index": 45, 
            "rating": "5", 
            "review": "Very interesting. Very interesting, better to realize it bearing in mind the time and the peculiarities of this day that segui a rigid program. It walks and speaks with the people of the market"
        }, 
        {
            "index": 46, 
            "rating": "5", 
            "review": "Road less traveled ..... My friend and I chose Authentik Bali tour to experience trekking and seeing the local side to Bali. We were not disappointed. The tour took us through beautiful scenarios of rice fields , streams , forest and villages. Our guide Augustine was informative and funny. The trekking started out with walking through some forest eventually leading to the rice fields which seemed endless. Soon enough we were wading through some streams and seeing a more jungle like the locals.There was challenging climbs and challenging treks down hills but and you will get a bit dirty . This is part of the journey. A nice homemade lunch was provided by Augustine and a little rest before the trek continued. Our group was 6 people . Appropriate for the tour at hand. Be advised the sun can be brutal but of course that's why you bring sunscreen . We also met locale rice farmers , villagers and even came upon a cock fight . Overall , a trek that will allow you to see the ' local ' Authentik Bali and mingle locally on a road less seen. A must trek for those searching for a different Balinese view "
        }, 
        {
            "index": 47, 
            "rating": "5", 
            "review": "What a great adventure.. No regret! I love the adventure assisted by Authentik Bali with Augustin, this is real Bali. Walked through chili farm, rice fields and have chat with the local farmers who was picking chillies then continue to a secret destination that not known by many peoples, Im Indonesian but I don't know where's beautiful hidden places located but Authentik Bali does. Love it and want to do it again to see more."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Great guy and great trek!. We had a great time on our trek with Augustin. The small group (3 couples) plus Augustin made the experience a lot more personal and we could ask as many questions as we wanted. Augustin is very knowledgable and it's clear to see he has embraced Bali, respects the locals and the culture. We trekked through jungle, waded through rivers, explored rice paddy fields and visited villages and local families. He even carried lunch for us! Tip - prepare to get wet so wear something suitable, as well as sturdy trainersOverall a great experience and perfect way of seeing authentic Bali - thanks!"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Excellent experience..!. Augustin picked us up promptly and proved to be a mine of very interesting information regarding daily life in Bali, it's culture and rituals. The places he took us to were not your typical tourist trap locations - he has genuinely spent time locating trails and families to introduce us to with whom he has built up a friendship. He even brought sweets with him for their new born baby! The one family he introduced us to were the carpenters for the local temple and their home was truly beautiful. He took time to explain everything from the layout of the home to the fact that the kitchen for example is considered a dirty place and that offerings are never made there.Once we were trekking in the jungle we were soon found ourselves wading into the rivers and using the locals paths and mambo bridges - it was amazing. At one point we came across a load of school children waking down the road we were crossing (we were definitely NOT following the road!). It turns out they were going to a local festival to welcome back the spirit of one of the men who had died recently. Augustin then changed his trekking route and we went to the festival too for 30 minutes or so before returning to the jungle once more to continue.We stopped for lunch (which was very nice) in the paddy fields and sat with the guys that were ploughing up the paid fields with the mechanised plough thing (Japanese cow?).Overall this was a truly immersive experience in both the culture and beauty of Bali along routes uniquely discovered by Augustin himself. Very highly recommended for those who don't want the usual tourist experience. Awesome!"
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Authentic and Naturally... SPECTACULAR . A six hour experience well worth it! You gotta get dirty to see the sights and experiences which no other tourists will see. Not only do you pay for the trek and the sights, but also the insights and knowledge that Augustine provides. He's lived in their shoes and understands their culture on a whole different level and he loves it. It shows in his energy. STRONGLY RECOMMENDED if you want to get to know the local culture."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Awesome experience!. We were really looking forward to this day hike around Ubud and when Augustine first picked us up we asked him to provide us with an adventurous day (he told us that he has about 8 different treks that he has routed out depending upon that day's clientele).We were a group of 6 which is the maximum size that he will take and everyone was in decent shape so it made for a fun day. Our first stop was in a local village at the compound of a fairly well off family. It was neat to see up close and personal. The family certainly likes Augustine!From there, we took off on our adventure hike, off through the rice terraces and down to a little river with a cool, secluded little waterfall. From the waterfall, we trekked down the river (walking in it for about 20 minutes as there was no path along the banks).It got fairly deep at one point (maybe 3 to 3 1/2 feet) so be prepared to get wet and dirty.After the river we stopped for lunch in a quiet corner of the rice fields. Lunch was a traditional Balinese meal and was quite tasty. Then back at it - through a mind boggling maze of rice terraces and then back across a ravine that included crossing a narrow bamboo bridge. Total time spent was approximately 8 hours. At 900k, it was one of the more expensive tours that we have taken so far but it was also one of the best, so we felt that we received good value for our investment and have many good pictures and memories from our day on the Authentik Bali trek."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Really fun and interesting. The trek was amazingly beautiful and we got to see Bali from a locals perspective. Augustin did a great job of explaining everything along the way and has a great relationship with all the locals. The trek itself was pretty intense (we're very sore) but definitely worth it. Wading through rivers and scaling cliffs was exactly what we wanted. We were also able to visit a locals villa which was amazing and something we'd never be able to do on our own. It's a great experience and definitely worth the money."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "A Must-Do if you are looking for Authenticity. I have booked a day with Authentik Bali for my parents. They were looking for an original attraction, out of the beaten paths (Wich is not easy to find in Bali).They were absolutely happy about their day with Authentik Bali ! They told me it was the best thing they did so far in Bali. They ate in remote villages, exchanged with some real locals, walked accross rivers... They were searching adventure and authenticity, and thanks to Augustin, they found it !!"
        }, 
        {
            "index": 54, 
            "rating": "5", 
            "review": "You really do see the real Bali. I was feeling unwell on the morning of our tour and nearly decided not to go. However I'd been looking forward to it so decided to go - I'm really glad I did.Augustin was friendly and very knowledgeable about Bali, its people & its culture. Originally from Paris, Augustin speaks the local language fluently and has a really kind way with the locals; so much so that as part of the tour we simply walked onto people's land and met the families that lived there and observed their way of life. Augustin bought some flip flops for the little boys of one family & they were absolutely delighted with them; their faces were a picture!We met a family who were carving and painting wood for a new temple, and another from whom Augustin managed to buy a stone for a new ring he wanted. We got to learn about Balinese families, their religion and how they make a living. All of the locals were very kind- simply flash them a big smile as you approach and they'll smile back and wave at you.The day was tiring; we walked up rice paddies, we trekked through jungle, we waded through rivers, but we saw some beautiful scenery.Augustin kept us fed and watered throughout the day.If you want to learn about the Balinese culture and see it first hand, this is the trip for you.TIP - you walk all day, it is hot, it is dirty, and it is wet, so wear sturdy footwear, clothes you don't mind getting muddy and wet & wear bug spray and sun cream - and enjoy! :)"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Exciting, action packed day out. We spent the day with Augustin and 4 others, it was a great day! From walking between the rice paddies to wading through the river it was a fun, interesting day out. I think this was one of the more extreme trecks that Augustin does, it was challenging to say the least! Getting wet and dirty is expected as is a bit of climbing, sliding on your bottom and stumbling into wet holes! We met local people with whom Augustin has a very good and genuine relationship (Augustin is fluent in Balinese). He explains to you their way of life, culture, food, work, living arrangements, architecture and much more. We stood in the river under a waterfall, climbed up and down ravines, walked and waded through a river and ate lunch under the shade of banana trees. On the practical side: Augustin provides lunch and water for the journey. Wear enclosed shoes with grip soles that you don't mind getting wet. Only take a small bag that you don't mind getting dirty. Don't worry about the difficulty level as Augustin tailors the treck for your ability and footwear once he meets you.This was an adventure. We saw the real side of the Ubud region. Truly an amazing day away from the tourist traps."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "A very unique experience - we loved it!. It was obvious that Agus had a very good relationship with the locals - he speaks fluent Indonesian. He taught us a lot about Balinese culture and they way things actually work in Bali which was very insightful. Agus is very respectful of the locals and I am certain that his kind and caring nature unlocked our ability to experience something quite unique.The trek itself was brilliant - we had such a fun day trekking through rice paddies, wading/swimming through rivers and climbing up gorge like structures. We met so many locals - many of which clearly do not see tourists very often so it felt like a very unique experience for us. The day was fairly active so be prepared to get dirty, wet (wear trainers!) and some good exercise. We loved it!!We met a lovely family and had tea on their property. It was really interesting to hear all about Balinese traditions and structure of the house hold etc. Although this is a little more in price compared to other tours, I would highly recommend it. We found it to be a truly unique and authentic experience, and we valued it immensely."
        }, 
        {
            "index": 57, 
            "rating": "3", 
            "review": "Something different with potential for more . Having been on many treks especially in Indonesia this was one of the easier/less stimulating ones. I fully appreciate you can only go as fast/ difficult as the slowest member and whilst this is a trek it's not an adventure race but the pace was very very slow. We stopped a lot. Augustus was very good at integrating with the locals and made a huge effort with them, we stopped numerous times and sat down at people's houses. This was great after the first one, two but got a little tedious. I love seeing countries and peoples natural homes etc and I'm all for 'seeing the locals' but I would love to have been more involved rather than sat watching Augustus chat to them. I was also confused about the price (totally my fault) however had I known it was $90 oz dollars I probably wouldn't have come. It was VERY expensive for what you got. I'm really sad that I'm writing this and Augustus is a lovely chap making a great business venture but I'm all for honesty and feedback to improve things. There's so much potential here to do more and maybe this trek is great for the less active and the less 'travelled' people."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "The best way to discover Ubud. This was one of the best experience I've ever had. Augustus made us see the real Ubud. We had the chance to meet Indonesian people, understand more about their culture. The tour itself is magnificent, the landscapes are spectacular: we crossed rivers, saw riz fields, walked into the jungle. In my opinion, this day tour is the best thing you can do in Ubud."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "CAN'T MISS IT. We were in Ubud for only two days and I didn't regret to spend one of them with Authentik Bali( Augustin ). He is the best !!! You will be amazed by the landscapes. You will visit Indonesian typical house and meet several people. Then,you will walk through the jungle, the richfield, and even the water jump. An unique moment that you can spent with family and friends. Moreover, the guide know so much about real Indonesian culture. If I could I would do it again and again. A mind blowing experience !!!"
        }, 
        {
            "index": 60, 
            "rating": "4", 
            "review": "Fun day out that shows different side to Bali. Really fun and interesting day out trekking through rice paddies and rivers (tip: wear shoes you don't mind getting soaked!). Met lots of local people to get a real slice of life on the island. Augustin is a knowledgeable and relaxed guide who is at home in his surroundings. Would recommend for people that want to see a more local side to this lovely island."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "Great, authentic tour to see the real Bali. Fantastic day exploring the villages with Augus! You definitely see a side of Bali that you never would otherwise. We visited several villages to get a sense of how the locals live, trekked through the forest, walked through rivers, and visited the most fantastic waterfall. Augus' ability to connect with locals gives you a wonderful inside view into the life of Bali outside of the tourist hubs.Practical advice: wear clothes that can get sweat and dirty, pack light (though you can leave stuff in Augus' car), and wear sunscreen and bug spray. Prepare for an awesome time!"
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "A great tour guide. What a great day on this tour with Augustine. An awesome tour guide who is so well respected by the local people that they let us come into their houses and have coffee, watch them in their places of work and let us spend time playing with their children. All because of the relationship Augustine has built through respect and not cash. We had a great day which involved plenty of walking through rice fields, rivers, walking tracks and villagers. We even saw a giant . Did the tour with a great group of people whom I hadn't met before. There was a small group of 5. Great day. Gave me a great appreciation of the Balinese and my own life. Thanks Augustine."
        }, 
        {
            "index": 63, 
            "rating": "1", 
            "review": "No Reply for Two Days - I'll call you later. Apparently he works alone and gets 'too busy to respond to email'. So I waited two days, and then called him. He said 'can you send me an email'? I told him I did that two days ago and he promised to call back two hours later to book our tour in the morning. No call for three and a half hours so I called again at which point he informed me he was fully booked for the entire week, but he didn't give me that information before \"in case he had a cancellation\". So no trekking for us this trip and I'm disappointed that he was rated so well and gave us such poor service. I strongly recommend he gets a helper or at least learns to carry his schedule with him."
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Incredible Experience!. It was an amazing journey and incredible experience to behold; with amazing sights and meeting locals along the way. Every trek could be different and if I knew it would have been that hardcore I would have taken different clothes and shoes!The only thing I would add is to take some plasters and wipes as you're likely to get a few cuts along the way!"
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "Serious adventure. Coordinated with Augustin last minute and joined a group of four from Perth. I have done my share of intense trekking over the years and this ranked among my top experiences. We hiked among rice patties, up and down gorges, swam through unnamed rivers. Also experienced the quieter sides of village life away from the hustle and bustle of main tourist areas. Augustin is a great guide - knows a lot about Balinese culture and offers interesting perspectives being an expat. Bring bug spray!"
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Absolutely Incredible Experience. There is no doubt in my mind why Authentik Bali Tours is rated so highly...it was, hands-down, one of our best experiences in Bali, and truly one of the best experiences I've ever had on a trip anywhere. In one 6-hour span of time, I was: challenged, pushed out of my comfort zone, exhausted, excited, nervous, amazed, educated, and most importantly...enlightened. Make no mistake about it...our trek (and the guide adjusts them all individually based on each group) was not easy. Within the first 10 minutes, we were already in the jungle, I'd already seen a spider the size of my hand (and I'm quite afraid of spiders, lol), and I was sweating like I'd just run a mile...except I'd only been walking for 10 minutes. During the trek, we hiked down to the ruins of a Buddhist Temple, crossed a rope bridge, walked through a mile or two of rice paddies (and even got the chance to help some of the ladies working), climbed/crawled up steep and very muddy hills, through a river, through villages, etc. Two of the highlights for me, though, were 1) getting to visit some kids at a local school, and 2) being invited into two different homes/work areas of local villagers for food, tea, and to see where they live, etc. The graciousness of these Balinese people is remarkable and humbling, and these experiences were only possible because our guide, Augustin, has built sincere relationships with these people. I was muddier and dirtier and more sweaty than ever...but this experience was worth it in ten-fold. Our guide, Augustin, was fantastic. He answered our millions of questions, he taught us tons about the local culture and people, and you can tell that he not only loves what he does, but that he also has a true respect and care for the people has befriended via his treks. If...no...WHEN I return to Bali, I will 100% book another trek with him, and I would highly recommend this to everyone else as well. A truly authentic and rewarding experience...so incredible!"
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "great trip. we had a wonderful day and the trip is realy great. on that day it was raining and we started with the river. very interesting experiens and realy autentic. try it!"
        }, 
        {
            "index": 68, 
            "rating": "5", 
            "review": "amazing. like to see authentik Balithe distance was sometimes to far-you have to go very early and come back before dark"
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Amazing views, amazing tour guide. Far and away, the best tour that I have ever taken. We started the day with a celebration at a Hindu temple and passing out erasers to local school children during a coffee break. Augustine is fluent in Indonesian and has used it to build relationships with locals, which we met along the way. The views were breathtaking and the hike included many different places that were never mentioned in any of the guide books I have read. Jungles, temples, ravines, rice fields - you are sure to see them all! Thank you for the experience of a lifetime, Augustine!"
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Perfect Team 6 one day boot camp in Ubud. Augustin took us, a group of four Frenchies few miles North East of Ubud. A mix of jungle, river crossing and walk through the rice fields. A fantastic day that we still feel... after 48hrs. Augustin is speaking the local language and has good connections with the local people which makes we felt welcome by all the folks we crossed. At last but not least, if we have one advice is you guys willing to do this treck need to have the proper walking gear. Expect to come back dirty and that's probably still a week word. Very good value for money and probably the unique occasion to discover what's behind the touristic Bali."
        }, 
        {
            "index": 71, 
            "rating": "5", 
            "review": "A dream day experiencing true Bali!! . Wow! Having found Augustin on trip advisor we managed to book a day tour and.... What an incredible day we have had. From the beginning to the end the trek was full of fun and learning about how people really live in Bali and there are some sensational sites to see! Augustin was absolutely fantastic and as he knows so many of the locals you get a chance to experience balinese life. Our day was a mixture of river wading and jungle trekking to seeing balinese work, houses and schooling. Augustin we cannot thank you enough for showing us the amazing sites. It has truly been an amazing day. "
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Eco Cycle Touring. We started the tour with a wonderful breakfast and after 13 miles of mostly downhill cycling, we ended with a very nice lunch. In one of the villages we saw a traditional Balinese home compound. This was the poorer side of Bali that is not part of the 'typical' tourist excursions. We passed through many villages and rice fields on this journey. It was a ride that all levels of ability can experience. Including older children (perhaps 8 or 9) up to older folks in their late 60's or early 70's. For those who wish for a more challenging cycling tour, they do offer a split in the group toward the end with a greater endurance challenge."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Discover true Bali. A very nice day with a great impression of how the farmers and workers live on the country site around Ubud. You will see the people And their true surroundings! The guide is very knowlegable and speaks their language. Just don't forget your shoes! Can't really do the track on flip flops/ sandals, lol.."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Truly Authentic. After spending most of our trip in the southern surf towns, my wife and I were looking for a \"non-touristy\" experience in the heart of Bali. This is exactly what we got with Authentik Bali! Agus was an excellent guide and provided a unique experience by exploring local villages, ancient ruins and dense jungle. Agus has a great relationship with the local Balinese which can lead to improvised trips alone the way. I feel as if we could do the same trek on different days and have a completely different experience. If you want to spend the day experiencing the real Bali without running into any other tourist, this is definitely the way to do it. I would highly recommend anyone visiting the island to dedicate spending one day with Agus!!"
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "A must to do in Bali. After almost 2 year in Bali is the best thing to do far from all I test before.This trek is so real, people you met are so nice, the land scape is amazing and Agus the insider It's just perfect. Nice, polite he know when he has to speak with you and tell you some stories but also he know how let you enjoy with your familly if needed.BIG thanks again Agus to show me some real jungle at only 15km from my house !!!Good luck and all the best"
        }, 
        {
            "index": 76, 
            "rating": "5", 
            "review": "Wheelchair Accessible rice fields. we were a group if approximately 12 members, disabled and helpers. We really enjoyed the rice field trip with Augustin our French guide speaking fluently Balinese. He showed us wonderful rice fields and explained a lot of things that are not in books. Then we had a nice cup of coffee in a family house yard. Agus is really a caring person who brought a really new opening to us, enjoying a marvelous discovery although in a manual wheelchair and one member of our group who is blind, had a blast. Thanks a lot Agus! Terima kasih Agus!"
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Incredible. Excellent tour. Be prepared! Shoes...and stretching yourself. The guide was great and replied all our questions. We saws many nice sceneries, talked with population. Worth!"
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Unique and unbelievable adventure !. Far from crowed and high touristic attractions, I was so pleased to discover the real Bali ! Agus is as authentic as his treks, offering unknown and rare adventure around wonderful nature! Feeling safe all during the walk, agus is very professional, attentive to your needs and proposes different paths, following your needs, sport levels and wishes. Ideal for all people who want to explore the \"real\" Bali !"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Hellooooo real Bali!. What a unique, unforgettable, exquisite experience. The sights, the families, the interactions, the exposure - this is what travelling is all about. Augustin is a confident, charismatic and intuitive guide that has many connections and friendships with the locals. It was a well-rounded day trip with swimming, jungle trekking, balancing on the rice field terrain and seeing the homes of locals and farmers. He was so generous by always paying for any coffees or drinks along the way and brought us a delicious lunch as well. I feel so grateful for having experienced this and I would recommend it to everyone wishing to experience a true sense of Bali."
        }, 
        {
            "index": 80, 
            "rating": "5", 
            "review": "legendary experience. If you are after an unpretentious good solid walking tour experiencing the real interior heart of Bali. Do not hesitate. Leave your fancy clothes at your hotel. Prepare for a Sensual overload of nature and life in the in hills fields and rivers of Bali. You might see Ancient overgrown temples, beautifull river banks, jungle tracks. Dip you feet in the cooling river as you have a nice traditional lunch, meet the rice farmer for a cup of coffee at his house.You will astounded. amazed. you wont want to go back to your hotel.Well i enjoyed my self any way."
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Great hiking experience. Augustine is truly a great guide, and has an in with local Balinese people. If you want to experience what life in Bali is like outside the usual touristy hustle and bustle, Authentik Bali tour is a way to go. Word of warning; if you are relatively young, be prepared to do some considerable jungle trekking :)"
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "Most memorable experience of Bali -- wonderful guide!!. We were in Bali for 12 days and we wanted to explore the authentic side of Bali and it's less touristic nature. Found Augustin by chance, and the trekking guided by him turned out to the best experience we had in Bali. He chose one of the most difficult trek for us, saying we are younger, and it's full of adventures and surprises! He took us through amazing jungles, rice fields, local villages, river, waterfall.......a path less traveled! It's a childhood dream came true for me and my partner. Augustin is amazing! Reliable, full of knowledge, fluent in local language and experienced! With him in the front, we felt relaxed and nothing to worry about. We enjoyed the whole trip enormously!If someone is interested in listening to the true heartbeat of Bali, Authentik Bali is a must while your stay in Bali. Strongly recommended!"
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "The Best experience in Bali!. I thought I know Bali until I did a trek with Agus! I discovered mazing places with stunning views only Agus and à few locals know.. This beautiful island has no secret for him, I learned more about Bali in one Authentik day than during the all the years I'm living here for! A unforgetable experience.."
        }, 
        {
            "index": 84, 
            "rating": "5", 
            "review": "Amazing treks with an incredible guide!. I spent the whole day with Agus and discovered places I never thought existed, even in a place like Bali. This is really the kind of service you need if you are looking for an authentic experience. Last but least: guide Agus is truly funny and helpful!"
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "Not to be missed!!. Terrific treks that take you to the heart of Bali. Pure nature and freedom brought to you by someone who shows real passion for what he does. Thank you Augustin for making us remember why we moved here. We spent an adventurous journey away from the crowded coast and we loved it!!For those on holidays or living in Bali, is a must do. Looking forward to see you again for another one very soon."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "Must do!. Unforgettable experience, a must do in Bali ! Augustin will take you to discover beautiful landscapes (rice fields, forest, river...) and very nice local people. Forget your watch, live it deeply and take your time to enjoy. Perfect for everyone even if you are not used to do trekking. Highly recommended!"
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "The only way to see the real Bali. Even though I live in Bali, I have never had such an experience with Bali's nature and inhabitants. I learned more about Bali in one day with Agus that I have learned in one year living here (even though I'm very curious and was already a lot in contact with locals).I clearly advise this wonderful experience to anybody, it is THE way of discovering the real Bali. We were among friends and laughed, crossed a river, had a coffee in the middle of nowhere... great souvenirs, that's for sure."
        }, 
        {
            "index": 88, 
            "rating": "5", 
            "review": "Best Trek in Bali!. I've done 2 differents trekking with Authentik Bali, and they were both really amazing. I actually loved the first one so much I had to book a second one.Augustin is really nice, professional and fun to hang out with during the day trek. He will also teach you a lot about the Balinese culture, which makes this day even more interesting.I also love the fact that Augustin helps you to discover Bali in not a too touristy way. You're going off the roads, in the middle of the rice fields and hang out with the Balinese working there, have a cup of coffee with them, even visit their homes sometimes.To me, that's the best way to see the real Bali.Thanks Augustin!"
        }
    ]
}