{
    "category": "Ubud", 
    "entity": "Neka-Art-Museum", 
    "avg_rating_stars": 4.376344086021505, 
    "review_count": 465, 
    "rating_stats": {
        "poor": 3, 
        "average": 50, 
        "terrible": 2, 
        "very_good": 173, 
        "excellent": 237
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Excellent overview of Balinese art. Having visited the Blanco and Agung Rai museums on a previous trip I decided to see how Neka measured up. I really loved the variety on offer at Neka, from photography to the Lempard collection, every piece is a standout. The descriptions accompanying the artworks are very helpful and definitely give you a greater understanding of Balinese culture and how the artists are influenced. Less refined than Agung Rai, but the grounds are lovely and the collection absolutely compensates for this."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "Best Art Museum in Ubud. If you only have time for one Art Museum while in Ubud, go here. It houses the best and most comprehensive collection of Balinese art, throughout the centuries."
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Not to be missed.. The best museum I've been to in SE Asia. Great variety, beautiful buildings and a rich review of the major developments, strands and influences of Balinese art.Set aside 2.5 hours and gift yourself a visit to the Neka. Their gift shop is very reasonable as well.Enjoy!"
        }, 
        {
            "index": 4, 
            "rating": "4", 
            "review": "A little bit of history and a whole lot of art. This was a great way to see what original Balinese art was and how it has changed over the years through Western influence. The museum is well-organized and worth a few hours of your time."
        }, 
        {
            "index": 5, 
            "rating": "5", 
            "review": "Enjoyable. Kids loved it. Great art museum.. This museum was amazing. The art is magestic, interesting and well laid out. The buildings and gardens are beautiful. A good introduction to the strong and unique culture of Ubud and Bali. Our kids really enjoyed it (3 under 10 yo) which is not easy! So much energy has been invested in this museum I was very impressed. A really nice place."
        }, 
        {
            "index": 6, 
            "rating": "5", 
            "review": "Museum with many kris collection.. The museum is designed with some separate buildings. The visitor is encouraged to walk through a series of galleries, starting with classical paintings and progressing to contemporary Indonesian art. One of the many foreign artists whose collection displayed in the museum are paintings by Arie Smit. The thing that makes this museum different from other is the collection of keris some people call it \"kris\" (an asymmetrical dagger blade with distinctive-patterning Achieved through alternating laminations of iron and nickelous iron) I think it has the largest kris collection compare to the other museum in Bali. The kris collection originate from various regions in Indonesia."
        }, 
        {
            "index": 7, 
            "rating": "5", 
            "review": "A tru art museum. Everything about the local culture is highly fascinating. It appears to be the best museum in town from what we visited."
        }, 
        {
            "index": 8, 
            "rating": "4", 
            "review": "Beautiful museum. My sister and I came here on a afternoon and were shocked to see literally no other tourists. Compared to the other art museums in Ubud I would say that this one manages best to cover the largest range of painting styles."
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Beautiful Museum. Great place to visit and see works of art from different styles, mediums and time periods. Beautiful grounds as well!"
        }, 
        {
            "index": 10, 
            "rating": "3", 
            "review": "nice but not manything to do in sight. if want to see the art is good to see but, price of art is not affordable fir us , nice if we a collector of art,"
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "Relaxing and peaceful. The grounds are beautiful and the architecture stunning. We were tired from the bustle of Bali and this was an oasis of peace for us. I was with teenage girls and they loved it."
        }, 
        {
            "index": 12, 
            "rating": "5", 
            "review": "Nice way to spend a rainy day in Ubud. Aside from the great Balinese art, the beautiful grounds of this museum will relax you. Went here when it was raining instead of visiting a temple and we were not disappointed. Do look out for the doors and frames of the paintings, they are masterpieces as well."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "A great museum that celebrates the island's culture through art.. A wonderful museum on large grounds - gardens and Balinese architecture. There are several buildings which display works depicting the island history, myths and developments in style as outside influences crept into the traditional work and also the reverse happening.I particularly liked the paintings depicting the everyday lives of Balinese-the wedding, funeral, harvesting ceremonies. The wayan shadow puppets, the Hindi religious symbols and several scenes from the Mahabharata. The spiritual and ritualistic life is easy to follow in these works as are the beautiful landscapes of Bali and of its people- calm, serene & good natured.The museum was founded by Suteja Neka and also has the personal collection of Neka who was an avid collector. Maybe his interests were nurtured by his father who was a sculptor and then by his friendships with many overseas artists who may have encouraged him to collect art and then museum.I noticed an Aust artist - Donald Friend's work hanging which was great as I believe he did spend some time in this ideallic island.There is a reception pavilion, a souvenir and book shop and a pavilion with open sides where one can have a rest.Also the photography pavilion was well worth looking into - The museum runs educational programs in art & culture of Bali.This is another museum that can be considered of international standardAlso has works of overseas artists "
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "A magical Keris collection. The collection of Keris kept in the museum is well worth a visit for anyone even remotely interested in this traditional and revered mystical weapon. if you speak only English it is hard to make yourself understood with the staff, so finding information is quite hard. I suggest you buy the book on sale at the counter called \"Understanding Balinese Keris\", which goes into detail describing some of the finer pieces in the collection. Apparently, if you get lucky, you might get to meet Mr Neka himself, who is known to walk people through his collections. But I had no such luck unfortunately. Some of the descriptive signs on the displayed Keris are wrong and seem to have been swapped out. This doesn't take away from the beautiful kerisses, but it is a bit confusing."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "Excellent. Top notch art museum, beautiful setting, well worth an hour. Traces development of art styles in Bali from olden times to present"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "Wonderful collection of Balinese art works. Batuan artists capture the complexity of traditional life alongside heaving tourism. Wonderful! Don't miss the Photographic archive collection of early black and white photographs documenting the training of young dancers in traditional performance. also some strong sculptural works. Allow plenty of time as there is much to see."
        }, 
        {
            "index": 17, 
            "rating": "5", 
            "review": "One of the Two Finest Art Galleries in Bali!. Wonder what Bpk Suteja Neka has accomplished: a collection of fine art that speaks the aesthetic history of Balinese, Indonesian and expatriate artists in Bali through the 20th Century and into the 21st. Fantastic to see the drawings of Lempad, the nationalist and new artists of decades past, and the wonderful Dutch and other European artists. See the Neka and also the Agung Rai."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "Well decorated private art & sculpture collections. It is walking distance from antonio blanco art museum & located in the centre of ubud,bali.it is well decorated museum with garden.entrance fee 75000 rupiah per person.a large collections of modern & ancient time art of bali preserved in 4 buildings.a map is provided by the authority bt it is not useful.in this museum most of the art had description that is useful to visitors to understand the art.it has a suvenior shop also.photo taken is allowed inside."
        }, 
        {
            "index": 19, 
            "rating": "4", 
            "review": "Not as good as it used to be, but still worth a look around. There used to be a lot more paintings in here in years gone by, but it's looking a bit empty these days. So many of the paintings are much of a muchness, and you get the feeling that the artistic flair that gave rise to the modern Ubud has now given way to a mechanical form of art that largely lacks inspiration. Which is sad, but is perhaps inevitable, as the younger generation of Balinese look for their income in different ways.But the building is beautiful, with a lovely temple in the middle, and so this gallery is worth a stroll around if for no other reason than to admire the building itself."
        }, 
        {
            "index": 20, 
            "rating": "4", 
            "review": "Still worth it. Bali and especially Ubud used to have a strong painter culture with both European and Indonesian painters ever since the 1920's. Not very much is left of it. How to make a living out of painting if driving a taxi gives you a steady income, my driver cum painter told me....This museum traces back that fruitful period and is well worth a visit (it seems a bit empty nowadays, while there more and more tourists here...). Anyway, go have a look and you'll be surprised. Very nice building too. Restaurants near by."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "The local art collection. we had Ubud trip and headed visiting this museum. It is located bit far from Ubud city. Overall this is good to learn about Bali especially art aspect."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Beautiful museum. A must visit, Beautiful, and Inspiring museum. Various paintings divided sistematically based on its term of period or style. The categorisation is clear. Very interesting place. Also nice and important to bring your teenagers here to introduce them to many beautiful paintings. The building is bright, huge and nicely composed."
        }, 
        {
            "index": 23, 
            "rating": "4", 
            "review": "Nice museum, worth a visit. Happily surprised with this museum, worth a visit. $7.50 AUD per adult and free for kids. Several different collections from traditional to modern."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "A special opportunity to experience the entire spectrum of art in Bali. Not to be missed.. A visit to Neka Art Museum gives you an insight into the fantastic creativity of Balinese artists and their influence on visiting artists also. Suteja Neka has created a peaceful environment of multiple pavilions laid out in the manner of a Balinese compound, all set in a restful garden setting. For a crash course on Balinese painting history or an in-depth exploration, Neka Museum is the first place that I would recommend for you to visit. Allow some time for your visit. The paintings are all carefully labelled with details of the artist and descriptions of the myths and legends that make up the image. The quality of the paintings is of the highest. Not mentioned much is the sculpture, but there are examples of wood carvings from the best Balinese sculptors. The Pavilions themselves also are entered through wonderful old Bali doors. The garden is scattered with mostly anonymous stone carvings, but amongst them are quite a few by I Wayan Cemul, the famous primitif sculptor, associate of Rudolf Bonnet."
        }, 
        {
            "index": 25, 
            "rating": "3", 
            "review": "Don't walk there!. Its mostly uphill from ubud centre so get a taxi if which there's no shortage of offers. Content appreciation is very much in the eye of the beholder. A tad overrated imho."
        }, 
        {
            "index": 26, 
            "rating": "5", 
            "review": "An escape from the hustle with an excellent art collection. The family of four (kids 13 and 10) thoroughly enjoyed visiting this museum. It was almost empty of tourists – just 5-6 other people in the entire museum – which was a great relief. The collection is really excellent too, covering early Ubud and greater Bali painting from the early 1900’s through to modern art, photos and more. Set in a series of 7-8 villas in a relaxing compound and with full English explanations for every display, this was a great visit. Allow about an hour to explore and there’s a bunch of nearby restaurants for lunch afterwards."
        }, 
        {
            "index": 27, 
            "rating": "5", 
            "review": "Excellent Museum. What a great museum, very high quality of fine arts, from Bali's senior Maestros and beyond, what a Collections,typical balinese traditional works from the hands of highly experienced, classical, modern, abstracts, contemporary, young artists style, all they have, also can bee seen very high valuue of Kris, traditional blade as symbol of energy, spirit and power. Just see it, let's see again, also fine"
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Wonderful work of colors. Compare to other art museums in town, this is more modern style. Also, it has A LOT of fantastic artwork. I especially like a floor full of colorful painting, the themes are about flowers and the most important festival guluntan. In other museum you won't find such vivid expression about that festival. It is def worthviisiting."
        }, 
        {
            "index": 29, 
            "rating": "4", 
            "review": "Neka Art Museum has a good range of Balinese Art. I enjoyed the Neka Art Museum as they hold a wide range of art from traditional Balinese style artwork to more contemporary and also art created by visiting Westerners, The museum is made up of several separate buildings set in lovely gardens. It was a very relaxing setting. The café received beautiful breezes but had little for sale. I feel it is really worth a visit to see a huge variety of artistic styles in one place."
        }, 
        {
            "index": 30, 
            "rating": "3", 
            "review": "Try it since its along the way... Driving to Ubud from Seminyak, it's one of the first attractions in Ubud. The highlight of the museum is Arie Smit. I am not an art critic, so take my comments with a sack of salt! It's European and Balinese art fusion, if there's such a word for it. I went to both Neka and Musuem Puri Lukisan. I like Neka better because it's more contemporary. It's smaller though. Puri Lukisan was all dark and grey. So if you are into Balinese art and have 75k rupiah to spare, try one of these in Ubud to fill the time."
        }, 
        {
            "index": 31, 
            "rating": "2", 
            "review": "not great. nothing much to see, if your already in Ubud it's ok to have a wander around but wouldn't make a special trip"
        }, 
        {
            "index": 32, 
            "rating": "4", 
            "review": "Good. It is a good place to go if you want to pass a few hours, the grounds are nice and the Gardens well maintained . As with any gallery in the area I've been to I think the price is a bit high really but that's how it is in the area. The cafe dosent tee ally stock much and price for water was high"
        }, 
        {
            "index": 33, 
            "rating": "5", 
            "review": "A great museum with paintings and a collection of daggers (Krissen).. I love art and I enjoyed four hours of the art present . Did not have enough time to see everything . Tourists apparently , are not going to Bali for art , because I was almost entirely alone in this vast museum. I am Dutch and several Dutch painters like Bonnet and Hofker were present. I loved it. The kriscollection (daggers) is wonderful."
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "Interesting collection of paintings and sculptures. The collection wasn't as vast as Arma museum, but the contemporary paintings were very interesting. Nice place to visit if you are not in such a haste."
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "Photographs OK here!. Unlike some of the other art museums in town, this one permits photographs without flash or tripod. This is a great way to easily take home images of the beautiful paintings and other graphics and sculptures displayed in well-lit galleries in several small buildings that have excellent visitor signage. Each artwork has a brief description in English in addition to identifying information, which I also photographed! The art displayed spanned a range of styles and dates in Bali. There were many stunning works of art here that we experienced. The most enjoyable art museum we visited in Ubud. Definitely visit when here!"
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Nice escape from busy Ubud. This museum has a good selection of art from Balinese and foreign artists. Most of it is well presented and I was happy to view it all in peace and quiet. Not many visitors around which was an added bonus. The price is 75k to get in. They allow photography as long as you dont use flash or a tripod. Overall it was worth it just to be in a tranquil setting and view some nice art work. There is quite a bit of emphasis on the museums founder which I thought was a bit over the top."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "A must go for Balinese culture, history, and art lovers. The Neka family started off as artists and their success brought them the wealth in Ubud (owning Komaneka resorts). They gave back to their community by creating this art museum which is full of history, culture, and art. Highly recommended!"
        }, 
        {
            "index": 38, 
            "rating": "4", 
            "review": "Overview of Balinese Art. Quiet museum offering great overview of local art. Read the introductions to each room to learn about the evolution of art in Bali. Really interesting."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "You better visit this..... The view and experience of the calmness of garden and green beauty, I should not say any word about that. That is even out of the words."
        }, 
        {
            "index": 40, 
            "rating": "4", 
            "review": "Beautiful museum. I enjoyed the beautiful garden setting of this museum. A. Lot of the art works were standard for Bali and strangely a whole building devoted to a bad western artist. The highlights though were the Lempad room, the photography archive and particularly atonishing the huge collection of Keris ceremonial knives."
        }, 
        {
            "index": 41, 
            "rating": "4", 
            "review": "a must. A very fine collection of paintings, also of modern artists. I think a must if you want to see what good Indonesian painters are creating and contributing to the art scene."
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "Mighty Fine Intro to Balinese Art. Neka Art MuseumI caned my way from town just sightseeing on my way to my destination; Neka Art Museum. It took around a hour, me with sciatica bending over every 50 meters. I got there though. I did NOT expect the price to be so high, but paid it anyway. It's like 6 USD. I like the layout. It's on a continuous path directing you from room to room. I spent “about” 90” there. “Hardly” anyone was there. Neat, for me. As usual, some things appeal & others don't. Make a decision & move on to the next painting. All labeled in English. I read the ones that appealed to me, eh? I enjoyed my time there....NO hassle to BUY anything."
        }, 
        {
            "index": 43, 
            "rating": "4", 
            "review": "Wonderful authentic Bali artwork. This was a second visit to this art museum and it was a joy to see some of my favorite paintings again. This is well worth a couple of hours of your time while in Ubud."
        }, 
        {
            "index": 44, 
            "rating": "4", 
            "review": "Very interesting and peaceful . The Neka museum is really interesting to visit, especially the first 2 pavillons, dedicated to traditional balinease painting. I learned a lot about the balinease culture and rituals. The space dedicated to photography from the 1930's is also worth to have a look. The garden is nice and the place peaceful. It's pleasant to escape from the Ubud downtown crowd for 2 hours as there were only few people when we were there. Besides it's cheap (15.000 rp)!"
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Great collection but lack of light. we just stepped up wandering around Ubud and found this museum just on the road side. The collection are a lot and various but no sufficient light inside. We need to look closer and closer to see the details of the stuff!"
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "Nice Museum. This museum is not big but is stock with good quality balinese and indonesian art and paintings. The location is central and ideal place to spend an hour or so."
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "pleasant; interesting. Private collection of Balinese painters, displayed in pleasant surroundings.Special pavilllion for Arie Smit and his impact on young generation of Balinese artists"
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Welcome, said Bapak Neka. We were driven to the museum and got free entry as guests at Komaneka Rasa Sayang. A friendly voice rang out \"welcome, welcome to my museum\". We were delighted to meet Bapak Neka who upon finding out where we stayed, generously gave us two signed books and proudly led us to the keris room. We even got to hold a keris. Such beautiful objects. Fans of mokume gane and damascene, this is a must see. We spent over two hours looking at the many many paintings, sculptures, photos, kerisses and tried to absorb as much as we could. The paintings are by great artists such as Smit, Friend and Lempad. The grounds were beautiful and guests could help themselves to the fruit grown here. A visual delight, close to great eateries and other galleries and you are guaranteed to feel the generous spirit of the Neka family. Why not visit the Neka gallery downtown as well?"
        }, 
        {
            "index": 49, 
            "rating": "5", 
            "review": "Se the variety of Balinese art without being hassled to buy.. A large, well set out display of a variety of Balinese art styles.They are displayed in a complex of buildings in Ubud."
        }, 
        {
            "index": 50, 
            "rating": "5", 
            "review": "Beautiful settings with rich content. This museum contains excellent work of famous Balinese and foreign painters. There is hall with beautiful Keris collection (traditional dagger). Museum shop worth to have a look too."
        }, 
        {
            "index": 51, 
            "rating": "5", 
            "review": "Nice art in a beautiful museum. Different kinds of art are exposed in beautiful buildings. I really liked the Ubud-art-paintings. The gardens add some extra value to the experience. In the back there are some amazing wooden sculptures off a man and a women."
        }, 
        {
            "index": 52, 
            "rating": "4", 
            "review": "Some amazing Pieces. To get a sense of where Balinese Art has come from to where it is now, It is a very good place to start, Very quiet and nice grounds. Dont forget to check out the pond on the left before you enter the first gallery, The stone work is lovely.You can take pictures, just no flash. Also some great old photographs from the 1930's I think it was."
        }, 
        {
            "index": 53, 
            "rating": "4", 
            "review": "Good introduction to Bali via its art over the decades. This museum is just right across from Naughty Nuri's, a BBQ place famous among Chinese visitors (the BBQ spare ribs is delicious). Neka is named after Sutejo Neka, an artist whose father was a famous wood carver. This museum is huge and sprawled across a few buildings. The artwork tells of the history of Bali and its people including artists like Dutchman Arie Smit who is well-respected by the Balinese artist community as the man who encouraged the young artist movement in Bali. It takes a while to traverse and enjoy the art here so make sure you have at least 1-2 hours to spare."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "An interesting walk through of Balinese Art.. An interesting style of architecture greets you in this family run Museum and the pleasant atmosphere prepares you for the journey through the relatively moder history of Balinese art! The plentiful works are well dispayed in a logical manner so anybody can understand the evolution that has taken place! great visit on a too hot or rainy day!"
        }, 
        {
            "index": 55, 
            "rating": "5", 
            "review": "Loved the Kris (Indonesian knives) colllection.. Great museum offering a lot to see and experince. The staff was very helpful and the owner gave us a personal tour because it was a slow day and we got there early when there were few visitors. Best collection of Kris knives in the world. Art of all types and interesting buildings and grounds. Well worth going for a couple of hours."
        }, 
        {
            "index": 56, 
            "rating": "5", 
            "review": "Fascinating (if somewhat neglected) collection in peaceful setting. This was our second visit to the Neka art gallery and not a lot seems to have changed in the 7 year gap between visits. The collection is spread throughout a series of airy pavilions in a lovely garden setting on the edge of the Campuhan River. The earlier Balinese paintings and the work of Arie Smit (who unfortunately died last week - just before his 100th birthday) were my favourite galleries - although I fell in love with a beautiful Balinese painting of the Animals disembarking from Noah's Ark. The place was very quiet and we spent about 2 hours looking around. It feels a little neglected and although it has a lovely terrace, the coffee shop is more of a snack bar than a place to linger and relax. We headed back down the hill and stopped at the Indus restaurant for lunch and a spectacular view. A lovely way to spend a morning."
        }, 
        {
            "index": 57, 
            "rating": "3", 
            "review": "Not air conditioned!. The paintings were lovely and very varied, and as a photographer I particularly liked the photography collection, but I just couldn't enjoy it all because, with no air conditioning, it was just too hot! If you're going to go, do so early in the morning or late in the afternoon."
        }, 
        {
            "index": 58, 
            "rating": "4", 
            "review": "A great way to come in contact with Balinese Culture. A visit to the Neka Art Museum is a great way to come in contact with Balinese Culture. Bali is a great vacation destination and among all the rush of beaches and surf, bars and restaurants, you miss the culture of Bali and it's people.The Neka Museum presents a good example of contemporary Balinese art painting and sculpture. A good way to know more about Bali."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Best museum!. Please visit this beautiful place in your first days on Bali. There are a lot about their culture and you will know what's for this and this. Very interesting museum. Next time we will be on Bali will go there again! Incredible atmosphere and very interesting to see their past on photos!"
        }, 
        {
            "index": 60, 
            "rating": "3", 
            "review": "An Education in Balinese Art and its Development. The early works before Balinese artists learned perspective from the Europeans are displayed first leading to the illustration of its development to modern day. Also foreign artists' work associated with Bali are displayed upstairs. The site is built in the style of a temple compound with features in each building.Toilets and shop and car parking available."
        }, 
        {
            "index": 61, 
            "rating": "4", 
            "review": "Keris Secret. We were surprised and delighted with not only the wonderful selection of Arie Smit paintings, but also the second floor display of rare and historic keris. Don't miss this aspect of the museum. And if you're lucky. you might even encounter Pak Neka himself who is a regular visitor."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Must See for Art Lovers. This museum offers both modern and older Balinese works. English descriptions of the art adds to your understanding of each piece. Housed in 4 or 5 buildings in a park with gorgeous landscaping adds to the experience. When we were there, only one other couple was seen."
        }, 
        {
            "index": 63, 
            "rating": "5", 
            "review": "Excellent Art Museum. I'm always a bit wary when I go to art museums, usually they are full of religious art. This one was mostly filled with wonderful contemporary pieces in all mediums. Full of life and colour, the pieces were well displayed, the building and grounds were immaculate. I highly recommend. It was worth the time and money spent."
        }, 
        {
            "index": 64, 
            "rating": "4", 
            "review": "Great Collections. Exellent Balinese art in many styles by numerous artists. However, the drawbacks are that not all works have signage and explanation. Also the lighting is poor and it's very hot. Know that he local ducks might walk into the galleries to join you."
        }, 
        {
            "index": 65, 
            "rating": "5", 
            "review": "A diverse blend of painting, sculpture and black and white photography. Visiting the Neka is a relaxing, peaceful and cool way to spend some time away from the outdoor heat. The museum displays a range of interesting art by famous Balinese artists and East-West (foreign) artists who have been Bali residents and who have created their unique Balinese work. The Australian artist Donald Friend for example. The Gallery is a diverse blend of painting, sculpture and black and white photography - with the galleries set in beautiful Balinese buildings and gardens. The exhibitions and rooms are set out in a sequence that sensibly directs visitors from one exhibit to another. A very satisfying outing!"
        }, 
        {
            "index": 66, 
            "rating": "5", 
            "review": "Lovely art museum. spent a couple of interesting hours looking through this museum. There is an amazing amount of wonderful pieces of art, I am no expert but even to me I could see the importance of all these wonderful pieces, it is so good to see that they are being shown is such a wonderful place!"
        }, 
        {
            "index": 67, 
            "rating": "5", 
            "review": "Beautiful. In an oasis of calm, this museum offers a fine introduction to Balinese art, and the various influences on their unique pictoral tradition."
        }, 
        {
            "index": 68, 
            "rating": "3", 
            "review": "Great work, lazy staff. When we exited the museum at 4.35pm we found that the gift and book shop was closed even though the website says that the museum is open until 5pm. When we asked the security guards why it was closed they said the guy had gone home.The security guards were not in uniform and were just sitting around smoking. They made us feel that the Neka staff are so totally lazy. The fact that the book shop could just close because the guy wanted to go home is so totally unacceptable. At 4pm in one gallery a security guard started to close the windows in preparation for going home, but this cut down the light and made it difficult to see the work.The museum sell tickets and therefore have an obligation to customers to deliver the service that they have paid for. Mr Neka has assembled a great collection and it is well worth a visit, but the total laziness of the staff does not do justice to the arts of Bali."
        }, 
        {
            "index": 69, 
            "rating": "5", 
            "review": "Ari and Neka. Mr Neka became Ari Smits agent many many years ago. Ari's work inspired by the landscape around him and the changing light have produced fantastic collectable works. These styalised pieces have in turn, encouraged and influenced local artists. Both Ari's and younger artist's work hang in the gallery also owned by Neka. Both places are well worth a visit. The museum is especially peaceful and wonderful to visit in the mornng sunlight."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "Neka Museum. Free ticket from Komaneka Tanggayuda and it was a peaceful, wonderful experience! Beautiful artwork and serene atmosphere."
        }, 
        {
            "index": 71, 
            "rating": "4", 
            "review": "contemporary paintings and a huge private collections of keris. For an understanding of Ubud as art village, just go to this museum. You will find work of some of the painters who made Ubud become famous as an art village."
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Fabulous collections. I first met Mr Sutedja Neka in 1975 he was an man bossed with collecting art from all sources. And happily so , as he now has an amazing collection for visitors and art lovers to explore. He has one of the most extensive and complete collection of Krisses ( traditional knives) from all over the Indonesian Islands. Also wonderful collection of Ari Smit paintings. He also has collections of Famous balinese and western artists. Well worth a visit."
        }, 
        {
            "index": 73, 
            "rating": "5", 
            "review": "Stunning Balinese Sculptures and Paintings. This is a great art museum showcasing a vast array of traditional to contemporary Balinese art from sculptures to paintings and photographs from a wide range of artists. You can easily spend around 2 hours here fully absorbing and appreciating the artistry and beauty of what you're seeing. Highly recommended."
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Huge Cultural Museum. Balinese art pieces at its finest. This museum is very large and it took us a couple of hours to appreciate the art work."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Great cross section of Balinese art. This place is worth a visit. It has a great cross section of Balinese art and is set in a nice garden. You can walk between here and then downhill to the Blanco Art Museum within 20 mins."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "Great gallery. An interesting museum and gallery of Balinese art. Well displayed and informative. Great cross section of work from traditional to contemporary work."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Step into the past!. It's easy to imagine how the wealthy few live when you visit this amazing museum. The setting is exquisite and the art also. Every time I visit, I still am in awe. Plus there is so much there to see that repeated visits are beneficial to absorb it all in."
        }, 
        {
            "index": 78, 
            "rating": "4", 
            "review": "If you fancy Bali art, go museum not tourist shops. Neka is the second bali art museum I have visited. The size is just nice to go through in 2-3 hours. It provides a brief and private review of Bali painting history, from traditional to modern."
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Beautiful art museum. Wondering around the different art galleries was really enjoyable. There is a wide range of art to suit all tastes situated on lovely grounds"
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "Stunning Paintings. Diverse collection from traditional to modern. Well worth a visit and well priced. Bit of a hike if you are staying in the centre of Ubud"
        }, 
        {
            "index": 81, 
            "rating": "3", 
            "review": "Very average - buildings and gardens beautiful. The gardens and buildings are pretty awesome. There were some interesting and intricate pieces of art but nothing seemed startling - this may in part be due to the overall poor lighting of the displays. It is quite dark in many areas and because many of the artworks themselves are intricate and utilise quite dark colours it was often very hard to see details."
        }, 
        {
            "index": 82, 
            "rating": "5", 
            "review": "You need to see this. The collection is excellent. Local artists, many European trained. The building themselfcare beautiful. The art is so varied. Many of the pieces are excellent"
        }, 
        {
            "index": 83, 
            "rating": "3", 
            "review": "Great Collections, Nicely Curated, Terribly displayed. There are some very amazing paintings in there by amazing artists, but the lack of proper lightings and just generally meh building make the experience less exciting"
        }, 
        {
            "index": 84, 
            "rating": "3", 
            "review": "Like it, good to see local art. We had free tickets to this through our hotel. It was worth the trip to see the local art and learn about Bali. Overall I wasn't incredibly impressed with it but it was enjoyable enough. If you're looking to see some art though I would recommend going !"
        }, 
        {
            "index": 85, 
            "rating": "3", 
            "review": "Very average art pieces in poor lighting. Although some of the views and the use of old traditional Balinese buildings to house the art were nice, the art itself was nothing special in my opinion. Costs 75,000 per person to enter and most of the lights were either broken or hadn't been switched on either which made for a pretty average experience. Have definitely seen better artwork in this region."
        }, 
        {
            "index": 86, 
            "rating": "5", 
            "review": "AWESOME MUSEUM!. I really love this museum, it's like a small garden. You also can have some coffee in it. There are two painting from different times but seems like painting it together. That's really amazing. Worth to visit and worth to spend a day in it."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "great selection great settings. This a museum absolutely worth visiting, if you want to see some real beauty in a peaceful beautiful environment a bit outside of the crazy, noisy city centre. I took a motorbike taxi, paid 40 000 rupees and asked the driver to come back 2 hours later. But it is also worth walking backwards as there are many great galleries located on that main road."
        }, 
        {
            "index": 88, 
            "rating": "4", 
            "review": "Important national and local art collection. Some really beautiful work, grouped in a series of galleries on the road north-west out of Ubud. Majority of the pieces have a description and if they can stretch to more about the link between the key philosophies that might help."
        }, 
        {
            "index": 89, 
            "rating": "5", 
            "review": "outstanding collection of art. If in BALI , one must visit the Neka Art museum. Seeing huge number of bali paintings in European art galleries, Mr Neka an avid art collector and artist set up this museum. Cultural aspects of Bali, contemporary work and historical aspects, very old rare painting collection, is all there in Neka art museum. Statues and silhouettes also adrorn the surroundings.A must vist in Ubud, BALI."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "A great overview of Balinese Art. In a setting which look like a palace, many small buildings allow you to discover the local art, with local and foreign artists who lived in the island.There are very clear explanations of the painting, when it refers to traditional pictures, which allow foreigners to understand what is represented and the meanings behind the symbols. A special exhibition of Keris (Kriss), the traditional dagger of Bali, display around one thousand units. Interesting, however, you need to be a specialist to understand all the variety presented.You can take as many pictures as you want in the museum, provided you don't use flash.Plan between one and two hours for the visit."
        }, 
        {
            "index": 91, 
            "rating": "4", 
            "review": "Balinese art in a beautiful setting. Tired of shopping, touring and eating? For a deeper, more relaxing look into Balinese culture, spend some time at the Neka Art Museum in Ubud with its four buildings and lovely garden! This is a lovely little museum of well-displayed Balinese paintings – both traditional and contemporary. While there, don’t miss the Kris room – an absolutely fascinating collection of kris of every size and style."
        }, 
        {
            "index": 92, 
            "rating": "4", 
            "review": "Balinese Art. a small Museum of Balinese Art, presenting colourful paintings with typical motives and the influences of western artists, who came here in the early 30's of the 20th century"
        }, 
        {
            "index": 93, 
            "rating": "4", 
            "review": "very interesting museum to learn about bali styles. the museum has 4 buildings, in a nice garden. Included in the ticketprice is a something to drink and a local sweet"
        }, 
        {
            "index": 94, 
            "rating": "4", 
            "review": "Nice mix of traditional and contemporary works. The gallery hosts a nice mix of traditional and contemporary works, worth a visit. Nice surrounding garden too."
        }, 
        {
            "index": 95, 
            "rating": "5", 
            "review": "Honouring the history and art of Ubud. This is a fabulous gallery and museum with a varied collection of traditional, modern and contemporary works. The information provided is well explained . The layout of the galleries and the beautiful gardens make for a very engaging experience."
        }, 
        {
            "index": 96, 
            "rating": "4", 
            "review": "Good Bali museum . I liked the photo gallery the best. The modern art was subpar but I'm not a real art dude. Good selection of historical paintings."
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "Museum Art Love Bali. One of the most beautiful museums I have ever visited. It doesn't have interactive presentation, or something that will make your kids go wild, but art, setting, friendly stuff - everything there is - supreme!"
        }, 
        {
            "index": 98, 
            "rating": "5", 
            "review": "For all serious art lovers ..it is a must. If you only visit one art museum on Bali ..it should be this one ..it has the best collection of both Balinese and modern era paintings ... do take time ..its a beautiful stroll through the grounds ..enjoy the vibrance and dynamics of a wide variety of artists .."
        }, 
        {
            "index": 99, 
            "rating": "5", 
            "review": "A don't miss when in Ubud. Amazing art work, beautiful setting, friendly staff, and a great gift shop. Don't miss this stop, and be sure to give yourself enough time to visit all the buildings and the lovely grounds."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Peaceful and informative attraction. Firstly,may we suggest that you visit in the afternoon to try and avoid the bus loads of tourists. This was a most pleasant visit as we had it to ourselves! Although there was not a large variety of European artists,the Indonesians represented were excellent (Affandi,Dullah etc.) Even if you are not interested in the art,the old photographs and the wonderful Indonesian Keris collection alone are worth a visit. To add to the atmosphere,you could sit quietly in a small courtyard and listen to the rind in player.Overall a superb hour or two."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Bali Art. Wonderful Balinese art. Many styles of carvings and paintings all displayed in spacious galleries and on tropical paradise grounds. I wasn't familiar with Arie Smit before coming here. Now I am a giant fan of his. This is the must see art museum in Ubud."
        }, 
        {
            "index": 102, 
            "rating": "5", 
            "review": "A. Education on Balinese art in one visit.. This is must visit for anyone who wants to learn about Balinese art and history. The museum is lovely, and divided into periods so you get an overview through time."
        }, 
        {
            "index": 103, 
            "rating": "4", 
            "review": "Good if you have extra time. The museum is a reflection of Balinese art, its a good idea to stop by if you have free time of as part of your walk to downtown galleries. you take a walk through it and not spend much time."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Nice Museum. If you are the one who'd like to feel the real Balinese art, you should visit this Museum. Highly recommended."
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Which to choose .. As there are 3 main Art Museums in Ubud it is hard to say which one to choose , so maybe just visit the one nearest to you . Neka has a marvelous collection especially of Ari Smit plus some beautiful Kris Swords and Daggers ."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "pressure free. A unique experience, wondering the art museum and admiring the different artist work. We were left alone not like other places and felt no obligation to purchase a item, well worth a look ."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "Worth your time. A collection of Balinese and foreign art, classic and modern that will appeal to all levels of art lovers. The group of buildings are magnificent. The work very intriguing."
        }, 
        {
            "index": 108, 
            "rating": "4", 
            "review": "An impressive collection. The collection was huge and contained local artists work as well as foreign artists who made Bali their home and others who captured images on their travels. Mr Neka was obviously quite a visionary."
        }, 
        {
            "index": 109, 
            "rating": "4", 
            "review": "Interesting even if you don't normally like art. There's art all over Ubud, but this is a must see art museum. The museum is laid out of several pavilions each with a different style of painting. Visit should take about an hour. I i'm not normally fussed about art but this museum is Bali artists or about Bali and perfect for an entry level interest into art. Small bite size chunks of different artists."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Don't Miss It!. We love this place and always visit when we return to Ubud. Superb artworks and photo's, well laid out and just wonderful roaming around, no one else about and the rain falling."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "A step into Balinese Art and culture.. A wonderful experience to visit this beautiful gallery and museum. The setting is stunning in beautiful picturesque gardens. Don't forget your camera and allow plenty of time. The permanent display of Arie Smit is simply stunning and not to be missed. There is a small cafe for a cold drink when the heat becomes too much. The gallery shop sells fine prints and books."
        }, 
        {
            "index": 112, 
            "rating": "4", 
            "review": "Interesting art- worth a visit. 3 travellers and I wanted to see a bit of culture and we're all interested in art. We walked from Ubud town to the museum, which felt like a long time but we stopped in loads of local art galleries en route. Neka arts is a lovely location and has lots of Bali art through the years, however none is dates from that long ago. Best place to see some artwork and sculptures. It's worth a trip as it's not expensive and very interesting. Easy to navigate around and not busy."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "had a nice time. beautiful museum , lots of collection , great array of Balinese art and history and a beautiful collection of Kriss swords. Good place to visit ."
        }, 
        {
            "index": 114, 
            "rating": "4", 
            "review": "Great for art. The art work at this museum is pretty cool. It's fairly big and worth spending a bit of time at. There is also a restaurant just opposite it which is supposed to be very good.The only thing I didn't like and found really disconcerting was how this guy, who seemed to work at the museum, as a gardener or something, had 3-4 cockerels in little baskets in the museum garden, right in the centre of the complex. He kept taking these cockerels out one by one and hitting them with both hands on their sides, making them angry, and getting each one to peck one of the other ones in a basket. Hearing these cockerels screeching was pretty horrible and went on for a while. We had just passed a cock fight that afternoon so it was pretty obvious that the guy was training them to fight. Cock fighting is technically illegal in Indonesia I think but it still goes on. I found it pretty disturbing and it did spoil my visit. I'm assuming that it was a one off event and doesn't happen often. I hope not anyway."
        }, 
        {
            "index": 115, 
            "rating": "5", 
            "review": "A great museum. Great array of Balinese art and history and a beautiful collection of Kriss swords. Good place to visit during the middle of the day to get out of the sun."
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "A great overview of both classic and modern Balinese art. Though having visited on several occasions, in May I took a houseguest who is an artist and it was interesting to get her reaction. She particularly loved much of the more modern work by locally famed Dutch and other European artists. Their colours were still fresh and vibrant and quite inspirational. It's cheap. Easy to walk round and surrounded by lush gardens. A really pleasant morning."
        }, 
        {
            "index": 117, 
            "rating": "5", 
            "review": "Fantastic experience. Great collection of Balinese art. Balinese is so artistic, there art works are seen everywhere in the village not just in the store or museum. The visit to Neka let me understand and appreciate Balinese art more!"
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "Important place to better understand Bali. The museum consists of several buildings with a variety of paintings. For me, I had no idea of Bali before coming here. So it was a very pleasing experience for me to get a grasp of the Balinese life through those paintings. Of course it won't tell you everything you want to know about the Balinese, but you will be able to see a little bit of the Balinese Hinduism, some of their own history, the Balinese daily life and their idealistic life style and so much other stuffs. The art museum wast the first to make me appreciate the Balinese."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "A must visit.. Neka Art Museum is on my list of must visit whenever I am in Ubud. I have often visited the gallery and have seen the development of the gallery over that time. The museum is situated above Ubud and is only a few moments away by taxi and if you're hot on arrival I recommend sitting, for a short while in the naturally aired arrival area to cool off before going to see the collections of art works. The arrival area has a wonderful view of green trees and home-lets across the gorge. The museum itself is divided into about four main gallery buildings, in the traditional Balinese style and they are easily accessible and the directions from the reception area are clear to follow. The gardens around the paths and the buildings are a delight. The art collections are quite substantial and contain traditional Balinese art forms, an photographic collection of early days in Bali and very good Balinese/Indonesian contemporary collection of artworks also. There is also a book shop near the reception area and a store with an array of Balinese clothing and artifacts. On the down side there is only a small snack bar in the arrival area which sells snacks and cool drinks - tea and coffee. And the toilet facilities are small also and are situated on the main road side of the arrival car park."
        }, 
        {
            "index": 120, 
            "rating": "3", 
            "review": "Quiet and interesting. It's a nice museum if you have some time left in Ubud. Interesting to see foreign influence on Balinese art (esp dutch influence).there are some nice paintings and the museum is situated in a lovely garden. Museum shop is quite poor and restaurant seemed closed."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "Outstanding Museum. The museum exceeded our expectations. We visited the museum for a total of seven hours on three visits. The collection of Balinese art is very impressive and provides an understanding of their culture and religious beliefs and practices. Also, we found the Balinese Keris(dagger) collection magnificent. We wish we read the book, \"Understanding Balinese Keris: An Insider's Perspective,\" by Pande Wayan Suteja Neka, before visiting the collection because it provided valuable information regarding the significance of keris. The daggers are not only weapons but works of art with spiritual, cultural, and religious importance."
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "A nice morning stop. I loved the original art carvings and paintings, but even more astounding were the ordinal photos from the 1920's and 1930's! It reminded me of \"the King and I\" The setting is lively and the do have a wonderful shop with beautiful things."
        }, 
        {
            "index": 123, 
            "rating": "3", 
            "review": "Nice little museum with local & international art. Entrance admission to the museum was included for free with stay at our resort (Komaneka), so we decided to stop in. It was worth the trip, as local art was scattered across numerous traditional buildings including paintings, sculptures, etc. The art was very nice, and we spent a good hour exploring the various rooms. Across the street is a great little restaurant with fantastic pork ribs worth trying!"
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "Old and modern art ..great.. Great Museum..is a must too..Especial I like that mix between old and new art(ist) . Also the building is nice."
        }, 
        {
            "index": 125, 
            "rating": "5", 
            "review": "Number One Museum. Beautifully organized and landscaped. Gives you the complete evolution of Balinese painting. Best art museum in Bali."
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "Outstanding art collection. a beautiful place to visit, take a stroll through some of bali's artist collections away from the noisy traffic"
        }, 
        {
            "index": 127, 
            "rating": "5", 
            "review": "Beyond Our Expectations. We spent many hours viewing the art in the delightful museum. We thought we were tired of art museums until we came here. The work was lovely and well documented for English speakers."
        }, 
        {
            "index": 128, 
            "rating": "4", 
            "review": "A Great Way to See Balinese Art. There is a lot of good/excellent art, but the place is actually a gallery where art is sold as well as a museum. The buildings are beautiful. We were there in the rain and it was spectacular. Also, there are lots of signs that teach you about schools of Balinese art as well as temporal stages. We loved it. By the way, no one pressed us to buy anything."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Classic collection. well lit, cool inside. I like that photos are allowed, but no flash or tripods. This is a well organised collection of both traditional and contemporary work. My daughter did not like it as much as I but for an art collection without frills, it is hard to beat"
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Certainly Bali's most comprehensive collection of local and Indonesian art.. The setting of the Neka museum itself is worth the visit. But if you're truly interested in either Balinese or Indonesian modern art you'll be at the museum for hours."
        }, 
        {
            "index": 131, 
            "rating": "4", 
            "review": "Understanding Indonesian culture through art. This museum gave us a good understanding of Indonesian culture through the art. It takes a while to move through so allow a few hours. It's not a flash museum but you have to admire Mr Neka for developing and donating this huge collection. It cost 50,000 to enter. Cafe is pretty basic but fine for a drink and rest halfway through. Now art for sale has a context. I can tell what style is represented etc."
        }, 
        {
            "index": 132, 
            "rating": "1", 
            "review": "Peace and serenity. Neka Art museum is a place I love to come to and also bring friends...it is more than an art experience it is a place of connection to the culture and history of Bali.....Make it part of your journey..."
        }, 
        {
            "index": 133, 
            "rating": "4", 
            "review": "Another dimension. The Neka Art Museum has a wide variety of Indonesian Art and I could have spent ages wandering around. It is a quiet and serene place to daydream."
        }, 
        {
            "index": 134, 
            "rating": "2", 
            "review": "Great setting, limited appeal. Not much Balinese or modern art in collection struck much of an aesthetic chord. Some striking sculptures and one or two pieces stood out from a rather dull throng of flat often busy canvases. Some expertise in Hindu myths needed to appreciate quite a few."
        }, 
        {
            "index": 135, 
            "rating": "3", 
            "review": "Great pics. We really enjoyed the old photos. Didn't like the Dutch guys work much but it was interesting seeing the progression of Balinese art"
        }, 
        {
            "index": 136, 
            "rating": "5", 
            "review": "Neka is wonderful. The range of art is amazing, and we had the good fortune on our last visit to meet Mr. Neka himself."
        }, 
        {
            "index": 137, 
            "rating": "5", 
            "review": "It was nice to visit. After we visited all wood carving and batik workshops we know how advanced the Balinese art. They are very crafted and artistic. It is definitely different than western arts. You can feel and see Balinese arts in Neka art museum and you will feel vivid colors with sophisticated skill in works. It was not that busy when we visited, so it was really nice and peaceful to walk around without crowd."
        }, 
        {
            "index": 138, 
            "rating": "3", 
            "review": "A bit disappointing. Nice pavillions but was disappointed by the display. However they have a wonderful foto exhibition - must see. The shop was better than other museum shops, staff was very friendly"
        }, 
        {
            "index": 139, 
            "rating": "4", 
            "review": "Amazing museum. Beautiful pavilions with traditional and modern Balinese art. I was the only visitor in the museum when I visited, which made it even more peaceful."
        }, 
        {
            "index": 140, 
            "rating": "5", 
            "review": "great for viewing kerises. hidden gem , large collection of keris. over 200amazing to view for those interested, has also paintings on the other wing depicting Balinese society, affordable entry donation"
        }, 
        {
            "index": 141, 
            "rating": "4", 
            "review": "Great Museum to know the history about bali. very lucky I met Neka. He was very nice and friendly. will say thanks to Neka provide a great place let us know the local arts."
        }, 
        {
            "index": 142, 
            "rating": "5", 
            "review": "Extensive Traditional Art. I loved all the many varieties of traditional art on display. Some new but many of the art pieces were antiques. Personal and extensive collection of art."
        }, 
        {
            "index": 143, 
            "rating": "4", 
            "review": "A lovely little museum showcasing Balinese art. The museum displays traditional Balinese artwork over several periods in one pavilion, and includes contemporary Indonesian art in several other pavilions. The museum is beautifully maintained. I think we stayed about an hour."
        }, 
        {
            "index": 144, 
            "rating": "5", 
            "review": "A must see!!!!. We loved it and could have stayed longer. Will be returning to see more next time in Ubud. The art work was stunning and the history so interesting. Great for lovers of art and to learn and appreciate the magic of Bali"
        }, 
        {
            "index": 145, 
            "rating": "4", 
            "review": "Beautiful museum. We visited this museum as part of a tour so we only had a short amount of time there. The museum is well laid out with lots of meandering corridors so you get lost in the art. The paintings on display are truly beautiful. There are pieces you can buy with a service where they with roll and wrap canvasses for you to tale home; this is a great service for travellers.The only downside was the absolute filth of the toilets!"
        }, 
        {
            "index": 146, 
            "rating": "5", 
            "review": "excellent collection. Set in numerous pavilions, the collection of art ranges from traditional to abstract modern. All are nicely annotated - well worth the walk up ( or take a taxi from the centre) !"
        }, 
        {
            "index": 147, 
            "rating": "4", 
            "review": "Give Neka Art Museum A Chance & Visi. Whenever you get the chance to stay in Ubud for more than 2 days. Do give this quirky art museum a chance. It's full of painting and art work that represents the way of life in Bali. Some of it will tell you the mythology story behind what you normally see around in Bali. The Pro: The entrance fee is not expensive. Not too many people in the museum that will make you feel like in an over crowded spot. The Con: not enough signage to tell you about the art in there."
        }, 
        {
            "index": 148, 
            "rating": "4", 
            "review": "Very nice museum for short cultural moments. This private museum displays beautiful paintings of Balinese and foreign painters. The complex is well maintained and the garden is very nice."
        }, 
        {
            "index": 149, 
            "rating": "3", 
            "review": "Interesting place. The Louvre it isn't,but there is some fine art to be admired in this museum. The Keris (dagger) room is very interesting. The gardens and the presentation of the art are top notch too. It's some way out of town."
        }, 
        {
            "index": 150, 
            "rating": "5", 
            "review": "Neka Art Museum - History of Balinese Art in one beautiful place. The Neka is one of the most comprehensive art museums in all of Bali. If you're interested in Balinese art and history, the Neka is one place where you can spend a day or even two.Highlight of the Museum is the kris exhibit...one floor is dedicated only to the Kris - Sacred knives of the Balinese. Hundreds of absolutely stunning and priceless pieces are exhibited on this floor.This is a museum not to be missed!"
        }, 
        {
            "index": 151, 
            "rating": "5", 
            "review": "Diverse range of artists and mediums.. I liked it all. Well presented, spacious and excellent standard of art work. The range of art work is diverse and offers a good insight to Balinese life and perceptions."
        }, 
        {
            "index": 152, 
            "rating": "5", 
            "review": "Exceptional Collection from Early Balinese to Modern. Necks is an absolute must see gallery that holds an exceptional collection of artwork, the best in Bali. The Neka is the vision and life time of collecting by the Balinese owner. Purpose built bale(Indonesian) style buildings each hold a different style of work. The early traditional Balinese collection is a great starting point, through to the collections of the European artists who settled in Bali during the 1940's and influenced the style of painting. I was fascinated by the pavilion with early photos taken by an American couple giving an insight into a more traditional period. A famous Balinese artist, Lempad is showcased in another pavilion of his outstanding pen and Ink drawings. I spent many hours at Neka and came back a number of times during my stay as I found it fascinating,with a diverse collection that is unique even by world standards( if you are an art lover!) . Stop at the basic cafe next door for a cool drink overlooking the ridge and enjoy the cool breeze."
        }, 
        {
            "index": 153, 
            "rating": "4", 
            "review": "Lots to see here. I believe art lovers would definitely come here.. everything's here were about arts. What i really like are Keris sword spot. Indonesian keris and their sculpting technique and was breathtaking.. apparently no guide that can tell us story here.."
        }, 
        {
            "index": 154, 
            "rating": "5", 
            "review": "Wonderful art work. Located about a mile from the downtown, Neka has an array of Balinese--and Bali-related--art work in 7 separate buildings. Each building has its own themes and focus. Great collection of early Bali photographs as well"
        }, 
        {
            "index": 155, 
            "rating": "3", 
            "review": "Disappointing. I like Balinese and Indonesian art and was looking forward to going to Neka after all the good reviews. Unfortunately I found it a disappointment. There were not that many paintings, the interpretation information was pretty limited and the over all feel was not engaging. Poor comparison to my experience at ARMA."
        }, 
        {
            "index": 156, 
            "rating": "4", 
            "review": "An art education. I especially enjoyed the first two rooms with the older art. Very worthwhile - and fascinating to see how newer Balinese artists have combined classical techniques with modern styles"
        }, 
        {
            "index": 157, 
            "rating": "5", 
            "review": "Excellent representation of Balinese art. It was our first visit there. We learnt a lot about local art and local artists from our visit here. It was both interesting and informative. Highly recommended. The museum was well laid out."
        }, 
        {
            "index": 158, 
            "rating": "5", 
            "review": "An incredible collection of Indonesian and Balinese art, from traditional to contemporary. This is the art museum to visit in Bali if you like art. This places art showcases a huge variety moods and techniques spanning decades in Bali and Indonesia, all accompanied by detailed English descriptions of the inspiration and history behind each piece. Plan to spend a couple hours if not more here and prepare to be impressed!"
        }, 
        {
            "index": 159, 
            "rating": "4", 
            "review": "Balinese Art on display. We had lunch at Naughty Nuri's (amazing by the way) and Neka was directly across the street. This museum had a nice mix of traditional and modern Balinese art as well as photography. Definitely worth the small entrance fee especially if you're already across the street for lunch."
        }, 
        {
            "index": 160, 
            "rating": "3", 
            "review": "Not artsy people but found Neka disappointing. My partner enjoys art museums however I not so much. We went on the advice of previous reviews however was disappointed with the trip. If you enjoy Indonesian art then you will like your time visiting Neka Musuem however if you are on the fence then I suggest spending your time elsewhere."
        }, 
        {
            "index": 161, 
            "rating": "4", 
            "review": "Excellent art and cultural education. The museum is well displayed and laid out. I asked the driver who dropped me there to pick me up in an hour and he said that \"I wouldn't be able to read everything\" and he was right - as I was only half way through after an hour. There is a huge amount of information about the Balinese history and culture in the paintings and information presented in the Museum. We had enjoyed a Kecap dance and I appreciated leaning about the history behind the performance at the museum. The cafe is very basic selling only drinks and ice cream-but I was lucky enough to find Naughty Nuri's just across the road for lunch!"
        }, 
        {
            "index": 162, 
            "rating": "4", 
            "review": "The best museum in Bali. You can see different Balinese paintings from the traditional to the contemporary in this museum, especially the latter is the essence. If you are not in a hurry, try to stay there much longer to see the collections housed from one building to another. It seems to be the best museum in Bali, not only in Ubud. Don't forget to pay a visit to the exhibition displaying different knives, especially those from the Court ."
        }, 
        {
            "index": 163, 
            "rating": "5", 
            "review": "The detail of the art is outstanding.. Take your time here, there is so much to see. Rp. 50.000 Adults and Free for children 12 and under. The best 50,000 ($5.00) I ever spent."
        }, 
        {
            "index": 164, 
            "rating": "4", 
            "review": "Good collection of Balinese Contemporary Art. I enjoyed the plahttps://e2.tacdn.com/img2/sprites/big_ratings_v1.pngce, typical Balinese architecture, with separate buildings. Nice and peaceful."
        }, 
        {
            "index": 165, 
            "rating": "4", 
            "review": "Nice Art. Beautiful gallery that shows the different type of art coming from the diffrerent parts of Bali. You will also understand the way the Balinese mind works."
        }, 
        {
            "index": 166, 
            "rating": "4", 
            "review": "Very nice Museum for Bali. Old, newer and modern paintings. Large Criss (knife) collection . 8 galleries. Can be done in an hour or more if you want. Have been to Bali many times and this is one of nicer museums."
        }, 
        {
            "index": 167, 
            "rating": "5", 
            "review": "Beautiful Balinese Art. Plenty to see here. Learn about Balinese culture through artwork and photo displays in this lovely setting. A great spot for a break from the heat of the day, too."
        }, 
        {
            "index": 168, 
            "rating": "4", 
            "review": "Very interesting!. Wonderful private collection of Balinese art, telling the story of the progression of this art and the Balinese culture."
        }, 
        {
            "index": 169, 
            "rating": "4", 
            "review": "Nice collection!. We got a complimentary trip to this museum whilst staying at Komaneka Bisma Resort. It's owned by the magnate after whom the resort was also named. Most of the gallery is his collection or art and artifacts which are all very amusing to experience. The handicraft gallery was also very good but a bit pricey."
        }, 
        {
            "index": 170, 
            "rating": "4", 
            "review": "Fantastic place to spend some time. Neka Art Museum is a fantastic place to enjoy the atmosphere of Balinese art and culture. Not only the paintings but the whole museum with several buildings in this very beautiful set up is worth to see. It is a very calm and quiet place. The history of Balinese art is presented in several buildings and explained in English and Japanese. Also the influence of European artists who lived on Bali is shown very well. There is no air conditioning in the buildings, be prepared for this. But a large pavilion where you can take a rest and have some refreshments and a nice museum shop. "
        }, 
        {
            "index": 171, 
            "rating": "5", 
            "review": "Impressive collection of Balinese, Indonesian and foreign artists work. If you are interested in viewing Balinese art from the pre-tourist era\nto the present day, plus a wider view of Indonesian art and paintings by foreign artists living in Bali, then you will be amply rewarded by spending a couple of hours in this beautiful museum."
        }, 
        {
            "index": 172, 
            "rating": "5", 
            "review": "Take time to enjoy the variety of styles in a lovely site. In one site here comes a kaleidoscope of art experiences. The Museum is best if one slows down and looks at the links between tradition, the thirties period and modern trends. The site itself is worth the short trip from the town centre or if adventurous there are varied and pleasant walking tracks back to town as well. The cafe offers pleasant refreshments and then there rice terrace views if the oils, watercour and pastels are not enough."
        }, 
        {
            "index": 173, 
            "rating": "5", 
            "review": "Fantastic experience. There is a few different buildings - each building has its own theme. In the middle there is an ancient music instrument to play, lots of fun. I have to admit I am not a art and musuem - have to visit kind of person. But this museum is definitely worth visit. It looks bit far from city center - by motor cycle it will be OK."
        }, 
        {
            "index": 174, 
            "rating": "5", 
            "review": "I enjoy atmosphere of this place. Great collection, nice calm atmosphere, a bit difficult navigation, we have not the personal attention here."
        }, 
        {
            "index": 175, 
            "rating": "5", 
            "review": "Best Collection. One of best collections of early impressionist Dutch and local artists and sculptors. Give yourself at least half a day. A full day would be better."
        }, 
        {
            "index": 176, 
            "rating": "3", 
            "review": "Nice museum. This museum was okay - good selection and variety of art pieces. Very quiet as we were pretty much the only two on the grounds. We stayed for about an hour or so which was long enough."
        }, 
        {
            "index": 177, 
            "rating": "4", 
            "review": "Lovely quiet setting. tjis museum is described as inferior to the other museums in the area but I loved it the galleries are open and large and though there were very few people there on a rainy afternoon I liked the large surroundings. The displays on the different forms of Balinese art were informative."
        }, 
        {
            "index": 178, 
            "rating": "4", 
            "review": "Beautiful museum with extensive collection of Balinese art. Very well organised collection of art from Bali. Every painting in the permanent collection has also a text introduction, which really helps you to appreciate the collection. I'd reserve at least two hours to explore this beatiful museum."
        }, 
        {
            "index": 179, 
            "rating": "5", 
            "review": "Beautiful paintings and artwork. I love Art and this place was serene and just filled with creativity. However, the place was empty. There weren't any other tourists there. Also, it was only 50,000 indonesian rupiah to get in which is about 5 bucks."
        }, 
        {
            "index": 180, 
            "rating": "3", 
            "review": "A look into Balinese art. It was good to see the differing styles of Balinese art &culture.The museum is house in a traditional temple style building. It has many rooms, depicting many styles by different artists. They range from bamboo ink drawings, acrylic paintings and sculpture.Worth a look!"
        }, 
        {
            "index": 181, 
            "rating": "4", 
            "review": "Very lovely and educational. Lots of great art, and beautiful surroundings. Great carvings like mermaids in a tree branch. Educational. Nice shop with ornaments. Serence and lovely ponds and trees."
        }, 
        {
            "index": 182, 
            "rating": "5", 
            "review": "History in Art. Able to view/read about time period or art w/ explanation. Large areas, many pieces to peruse. Low entry fee."
        }, 
        {
            "index": 183, 
            "rating": "5", 
            "review": "Great examples of Balinese art with good captioning.. We spent a couple of hours here and found the art works well explained and interesting as an outline of the development of Balinese painting and to a lesser extent, wood carving. At 50000Rp, the admission was good value for what you got and worth the effort to go."
        }, 
        {
            "index": 184, 
            "rating": "5", 
            "review": "Balinese/Indonesian art at its best.... we took advantage of a rainy morning to visit the Neka Museum, and we were glad we did. This is a real gem of a museum. The collection of mostly modern Balinese/Indonesian art is housed in a series of pavilions that are themselves quite interesting--and set among lovely gardens. Take the time to visit this hidden gem--you'll be glad you did!"
        }, 
        {
            "index": 185, 
            "rating": "3", 
            "review": "Interesting Place. The museum has 7 rooms mix of painting, pictures and woods art. Some rooms are fabulous others or not worth seeing. One room is available for temporary exposition while others are mostly for permanent collection."
        }, 
        {
            "index": 186, 
            "rating": "5", 
            "review": "great museum. It is a series of old buildings with traditional art and modern. Some Dutch art from artist from Holland who has lived here for a long time. There was a wonderful collection of keris - traditional daggers. Lovely gardens."
        }, 
        {
            "index": 187, 
            "rating": "4", 
            "review": "Quiet and paceful. Located in a big land. Interesting local and western style arts.The ticket was IRD50,000 per person."
        }, 
        {
            "index": 188, 
            "rating": "4", 
            "review": "Great museum of Balanese art. Neka Art Museum contains a very good collection of historical and recent Balinese art including a room devoted to the Dutch painter Arie Smit who spent most of his life painting in Bali and inspired some local Balinese to found the \"Young Artist\" style of painting. Some of their work is also on display. After you see the work here, you will be better prepared to assess the work for sale in the various galleries in and around Ubud."
        }, 
        {
            "index": 189, 
            "rating": "3", 
            "review": "Contemporary art . It's a small museum for contemporary Balinese art, it was interesting and surprising. We only went there because it was part of our tour, however it's a pleasant experience but wouldn't go there exclusively."
        }, 
        {
            "index": 190, 
            "rating": "4", 
            "review": "Interesting collection and calm environment. Interesting collection of local art and close to Naughty Nuri’s so you can have a bit of food after visiting (or before). The gift shop also has some nice items to bring home for friends and family."
        }, 
        {
            "index": 191, 
            "rating": "4", 
            "review": "For a rainy day. Great exhibitions spread over different pavilions. It gave a good history perspective of paintings and other art. My wife and I in particularly liked the daggers exhibition."
        }, 
        {
            "index": 192, 
            "rating": "5", 
            "review": "A good selection. I have been pleasantly surprised by the art museums in Ubud. I am not a specialist or an artist myself, but I do enjoy looking at other peoples work and am usually full of admiration for their skills and creativity. This one has taken longer to visit, we were there for 2 hours but I could have been there for three easily. There is a bigger selection of artists and styles than at Puri Lukisan museum (which is a really beautiful museum by the way). I visited on a Sunday afternoon and there were not many people there. If there had been a coffee shop within the grounds I would have had a break and probably left my children there and stayed longer. There is a kind of refreshments place once you are out, but not very welcoming."
        }, 
        {
            "index": 193, 
            "rating": "3", 
            "review": "Interesting experience. You can meander through the various galleries and take in the differing styles of painting. It was an interesting experience but nothing outstanding. We had just been to the museum and felt that it had more to offer. It is well worth a visit as my taste in art will differ greatly from yours."
        }, 
        {
            "index": 194, 
            "rating": "5", 
            "review": "Awesome!. There are a lot of galleries and atteliers selling pictures and sculptures with Hindu theme around Ubud but nothing compared to this museum. The artwork there is so fascinating and rich that it could be in one of the biggest museums around the world.But when you walk around the rooms - without the crowd tipical from those big museums - you can feel the hindu culture even with your eyes shut."
        }, 
        {
            "index": 195, 
            "rating": "3", 
            "review": "Not so much into art. It's just that I'm not to much into art so it's difficult for me to give a better note. The surroundings are good though, and the styles of paintings are really diversified"
        }, 
        {
            "index": 196, 
            "rating": "5", 
            "review": "So glad we visited. To put my review in context, I have only a very basic knowledge of the Arts, but I was very impressed and really enjoyed my couple of hours at the Neka Art Museum. So much beauty inside and out - the grounds and buildings are just lovely. There was a great mix of local and international pieces, traditional and contemporary. The diversity of the collection and inclusion of many sculptures kept my 8yo interested for longer than I expected! Next time I would definitely arrange a guide. The entrance fee was approx $5 AUD - I think my son was admitted free of charge - so even if you only have half an hour, it's very worthwhile and affordable."
        }, 
        {
            "index": 197, 
            "rating": "4", 
            "review": "Wonderful works of art- It helps to have an Enthusiastic Guide. We were treated to a walk through of this beautiful museum by our local tour guide, Dana Lee. He is a retired teacher and obvious art lover. He took us through this museum and had something to say about every piece of art and artist. There is a lot to learn. There are also a lot of steps and it can be warm...so drink a lot of water and wear good shoes."
        }, 
        {
            "index": 198, 
            "rating": "5", 
            "review": "Beautiful Bali paintings and Kriss Museum in Ubud. A beautiful Museum in a 1 ha parc in Ubud.A lot of paintings from Bali (local and foreigners painters) in the different display rooms and buildings.The nice surprise was the impressive large room upstairs displaying and impressive collection of balinese Kriss (Keris).Ask for explanations on those fantastic old and less old local big knifes / swords..."
        }, 
        {
            "index": 199, 
            "rating": "4", 
            "review": "Balinese art. Neka art museum is a Great gallery of celebrated Balinese art! Visit to appreciate and learn of the Balinese art of over 100 years . this experience will also aid in shopping for painting souvenirs."
        }, 
        {
            "index": 200, 
            "rating": "5", 
            "review": "Wonderful. We visited with a guide who had worked at the Museum for 15 years and recommend same to anyone who wants to fully appreciate the experience. Much has changed in Baliense art over the last 100 years with European influences bringing several new styles. The museum houses a wonderful cross section of all styles and major artists. Room after room full of stunning pieces, the art is truely beautiful. The building themselves are laid out in the style of a Baliense family compound and feel welcoming throughout. Thank you Ngakan."
        }, 
        {
            "index": 201, 
            "rating": "4", 
            "review": "Neka - beautiful gallery. This is my second visit to the gallery and each time I have really enjoyed it. A great way to learn about Balinese art."
        }, 
        {
            "index": 202, 
            "rating": "4", 
            "review": "Learn More About Bali Through Art At the Neka. Okay, I admit it. I am a sucker for art museums. I take the time on each trip to view a couple museums. The Neka Art Museum with collection of art by Balinese, Indonesian, and foreign artists represented the natural beauty, life, and culture of Bali. The collection of buildings displaying the art had a lovely flow. The buildings & the garden were visually pleasing. The entrance cost was very inexpensive compared to many art museums that i have visited in other countries. On your way back to downtown Ubud take the time to stop for lunch at the lovely Indus Restaurant or try Pulau Keklapa for their good food & views."
        }, 
        {
            "index": 203, 
            "rating": "4", 
            "review": "Lovely museum. In visiting several buildings, you get a pretty good idea of the influences in Balinese arts. We really liked our visit."
        }, 
        {
            "index": 204, 
            "rating": "5", 
            "review": "Sensational. Fabulous collection of Balinese art as well as European art influenced by Bali. Lovely location. Take your time. Lots of buildings to explore. Nice gift shop."
        }, 
        {
            "index": 205, 
            "rating": "4", 
            "review": "Worth visiting. Good collection but not as interesting as Arma , also can be a little confusing with all the different rooms . Both places have nice garden settings . I would not recommend Nuries Cafe over the road , it's hot ,overcrowded , overrated and expensive ."
        }, 
        {
            "index": 206, 
            "rating": "4", 
            "review": "Excellent gallery. Go and visit this lovely gallery on your next trip to Bali. We loved the cool interior and the lovely choice of art work."
        }, 
        {
            "index": 207, 
            "rating": "5", 
            "review": "An education in Balinese art. This actually is an art museum! Entry was included in our hotel package, so we went along, fearful that it might be a shopfront. The museum is set out in several buildings and a recommended route is provided. Paintings of different styles are displayed and explained as you work through the museum. The strong influence of Dutch artist Smits dominates a part of the museum. The last room contains an overwhelming number of Kris and swords.Sure, there is a small shop at the exit, but not unlike all museums.A really worthwhile showcase of art and relics that will give you a deeper understanding of Balinese Art."
        }, 
        {
            "index": 208, 
            "rating": "5", 
            "review": "Great fund!. Beautiful little museum filled with lots of traditional paintings. Highly recommend. Also there is no charge to go into the gallery, unlike many of the others in Ubud. Worth a look if you are in Ubud a long time or just like us love galleries."
        }, 
        {
            "index": 209, 
            "rating": "4", 
            "review": "Very interesting. Loved the different types of art - traditional, modern and a very interesting section of photographs with stories."
        }, 
        {
            "index": 210, 
            "rating": "5", 
            "review": "Great selection of Bali Art. We liked the variety of the different styles of the art collection. With limited time, we were able to immerse ourselves a little bit in Bali art."
        }, 
        {
            "index": 211, 
            "rating": "4", 
            "review": "Keris for days!!!!. This place was great.\nBeautiful grounds, impressive art pieces, amazing collection of Keris.\nI spent a few hours taking in the different building and was really impressed by the diversity of styles and great representation of Balinese art.\nI recommend doing Naughty Nuri's for lunch before and walking off the ribs at Neka."
        }, 
        {
            "index": 212, 
            "rating": "5", 
            "review": "Nice Balinese Art well presented. This was my sexond visit to the gallery. There is an excellent mix of traditional and modern Balinese Painting and sculpture. The quality of the work is very good. The gallery is spread over a number of different buildings with a logical flow for viewing. The buildings are all open so if you are looking for an air conditioned place for a break this is not it. This a must see in Ubud if you enjoy art."
        }, 
        {
            "index": 213, 
            "rating": "5", 
            "review": "Xcellent collection of traditional & contemporary Balinese art. You will find this on the busy road going west from Ubud, but still well within the cafe and shopping precincts. The Ubud Writers' Festival has Neka at its heart each October. We visited between sessions at the festival. There is a comprehensive collection of traditional Balinese art by a huge range of artists - based on spirituality, agriculture and nature. There are rooms of Europeans who fell in love with Bali such as Arie Smit, Rudolf Bonnet, Antonio Blanco, one Walter Spies painting and the Australian Donald Friend. There are the modern artists who humorously entwine tourist culture with traditional painting styles.There are different buildings with lots of seats and windows for cool breezes and views - and gardens between each. Neka has a very well stocked gift shop with prints, books, postcards, calendars and lots of the usual ikat, sarongs, jewellery and so on.There are similarities to ARMA at the other end of Ubud. Both are highly recommended."
        }, 
        {
            "index": 214, 
            "rating": "5", 
            "review": "Probably the Best Art Museum in Bali. Neka has an extensive collection of both traditional and contemporary art. If you have to choose only one museum to go to, this is the place. For those who would like to dig a bit deeper, the museum also published books that offering a very interesting insight on the development of contemporary art in Bali. Do go!"
        }, 
        {
            "index": 215, 
            "rating": "3", 
            "review": "Decent art museum. This is a nice art museum with a good mix of art. It is no Met or SFMOMA, but for a local town, it provided some decent pieces to look at."
        }, 
        {
            "index": 216, 
            "rating": "5", 
            "review": "good opprtunity for understand about indonesian. good opprtunity for understand about indonesian. a little far from ubud center but very worthy."
        }, 
        {
            "index": 217, 
            "rating": "4", 
            "review": "balinese traditional museum. when we went to bali, our driver took us to this museum. you can see many kinds of balinese old traditional tools"
        }, 
        {
            "index": 218, 
            "rating": "4", 
            "review": "Huge range of Balinese art and a great photography room. Worth a visit if you're in Ubud and enjoy art/discovering different styles of art. There's a huge range of Balinese art from different periods in time and also a fascinating photography room with photos of Bali in the 1930s"
        }, 
        {
            "index": 219, 
            "rating": "4", 
            "review": "variety for arts. there are so many kind of arts here, paintings, statues in each building. nice garden make you enjoy time during see the arts. the souvenir shop and toilet cleanliness need to be improved"
        }, 
        {
            "index": 220, 
            "rating": "4", 
            "review": "Enjoy the beautiful art of Bali. I always try and find time to visit this museum when in Bali . Well set out and gorgeous paintings and art. Really will enhance your visit to see such amazing Balinese art. Also has some great photos that will take you back many years to how different Bali used to be ."
        }, 
        {
            "index": 221, 
            "rating": "5", 
            "review": "A good eclectic mix. There was an excellent selection of art and well set out. It was nice to have the displays in several buildings and gardens to take a break."
        }, 
        {
            "index": 222, 
            "rating": "4", 
            "review": "Well worth a visit.... I am glad I took the time to visit the museum - very interesting indeed.\nIt is a beautiful setting and the gardens are really lovely.\nThere is a gift shop and a cafe also, which is handy."
        }, 
        {
            "index": 223, 
            "rating": "4", 
            "review": "attractive place. You can see some masterpieces in Bali. Good for walking and have a knowledge of arts of Bali."
        }, 
        {
            "index": 224, 
            "rating": "3", 
            "review": "Nice gallery. Was a nice little gallery that was included in our hotel stay. Had many lovely pieces by local artists. Worth the trip."
        }, 
        {
            "index": 225, 
            "rating": "5", 
            "review": "Excellent Collection. This is not a world class museum, but it has a world class collection. Some of the best of Indonesia's talent are represented here. Anyone interested in balinese paintings, and some who admires the copycats sold on the street side, will appreciate the works of the masters from who they all originate from. Bali is rich in history and culture. This museum represents it well."
        }, 
        {
            "index": 226, 
            "rating": "5", 
            "review": "Excellent Insight to Balinese art history.. Great collection of traditional (and modern) Balinese paintings. Worth a visit here,nicely set out. A good insite into Bali's art history."
        }, 
        {
            "index": 227, 
            "rating": "3", 
            "review": "Worth a visit. Visited on the way back into Ubud after doing the extended circular Campuhan Ridge walk. Already tired so possibly not in right frame of mind. Nice pavilions with different types of art. My son liked the room full of Keris daggers and swords. Probably would mean more to you if really arty but some interesting pieces. 50,000 entrance fee"
        }, 
        {
            "index": 228, 
            "rating": "5", 
            "review": "Art without pressure!. Great gallery! Good selection - no pressure. Interesting surrounds! Loved the temple in the middle and the lack of heavy selling! Bravo!"
        }, 
        {
            "index": 229, 
            "rating": "5", 
            "review": "Neka art Museum. We received a nice iced tea on arrival and saw the great gardens with lovely terraces and viewed people learning their craft. The history and art work was very different"
        }, 
        {
            "index": 230, 
            "rating": "3", 
            "review": "A mix of interesting and boring Balinese art. The temple lies just outside the center of Ubud and features several buildings, each with a different style of art.Featuring a cross-section of Balinese paintings and sculptures, the art ranges from very good to just average. Some of the paintings are heavily influenced by Hindu religious stories, while others depict normal life in Bali.My personal favorites were the wood and metal sculptures.Since we stayed at a Komaneka hotel we got in for free. Otherwise the entrance fee is 50.000 rupiah."
        }, 
        {
            "index": 231, 
            "rating": "5", 
            "review": "Balinese art in stunning surrounds.. I had not seen a great deal of Balinese art prior to my recent trip to Ubud, but I am very pleased I stopped in at this Museum. Neatly kept with beautiful gardens around, the art is well presented. Most of the gallery is more traditional Balinese art, however, there are a couple of rooms for more modern pieces, and I found that really interesting. If you only have a couple of days in Ubud, then I recommend this one be added to your 'to do' list!"
        }, 
        {
            "index": 232, 
            "rating": "5", 
            "review": "Must Visit. This is the best museum in Ubud, has been long established, has a variety of traditional and European influenced art works. Also a very impressive exhibit of Kris's (permanent exhibition) the special daggers that the Balinese revere."
        }, 
        {
            "index": 233, 
            "rating": "4", 
            "review": "Neil art gallery ubud. Paintings and photos gave a real insight into history and culture of Bali. Changes in painting styles were clear as different influences impacted on traditional Balinese themes."
        }, 
        {
            "index": 234, 
            "rating": "4", 
            "review": "a nice art collection. in my mind not as beautiful as the Agung Rai Museum it is still worth a visit. It also shows the development of Balinese art over the last 100+ years."
        }, 
        {
            "index": 235, 
            "rating": "5", 
            "review": "Not just an art gallery. This is an important collection covering all periods of Balinese paintings. Photos and weapons and woodcarvings also on display."
        }, 
        {
            "index": 236, 
            "rating": "5", 
            "review": "Excellent. The best art museum in Ubud spanning all schools of Balinese art. Set aside two or three hours. A small walk up the hill to get there. A bookshop on site."
        }, 
        {
            "index": 237, 
            "rating": "5", 
            "review": "Excellent. The best survey of Balinese art on the island but more than that - there are photographs, krises and woodcarvings. Well prewswented with a bookshop."
        }, 
        {
            "index": 238, 
            "rating": "4", 
            "review": "Nice gallery. Good points : Complete and diversified gallery (modern, contemporain, ...), very interesting. Cheap. Nice area. Bad points : very bad lighting, shame for an art gallery. Toilets to avoid, and even the reception guy tried to get money out of me offering me a lift by motorbike... Glad I made it to there but won't go back as I'm not passionate about Indonesian art."
        }, 
        {
            "index": 239, 
            "rating": "4", 
            "review": "Very interesting. A lot of interesting art set in a lovely setting. Old and new art. Indonesian art from all ages. Private collection by Mr Neka."
        }, 
        {
            "index": 240, 
            "rating": "5", 
            "review": "The best!. Spend a few hours and see the real art of Ubud!!There are different rooms for the styles which makes it easier to see the styles!"
        }, 
        {
            "index": 241, 
            "rating": "4", 
            "review": "Lovely. Thebest art gallery in Ubud emcompassing all schoos ofBalinese painting. Also photos and weapons. Set aside t least 3 hours. Well worth it."
        }, 
        {
            "index": 242, 
            "rating": "4", 
            "review": "Art Museum in Ubud. This museum gives you insight into Balinese culture and history. The grounds are very well kept and the collection is varied and we found it interesting in spite of not being big art fans. The cost was free with a stay at Komaneka at Bisma and the hotel shuttle stops there as well. Worth a visit."
        }, 
        {
            "index": 243, 
            "rating": "3", 
            "review": "Traditional art.. Worth a visit if only to see the gardens surrounding the place.The art on display is like storytelling of days gone by in Bali.Quite different by other standard galleries.Fine work all the same."
        }, 
        {
            "index": 244, 
            "rating": "5", 
            "review": "Nice collection. A nice, large collection. I was most interested in the new Indonesian Art, although the collection of Foreign Artists living in Bali was also nice."
        }, 
        {
            "index": 245, 
            "rating": "5", 
            "review": "Beautiful. This museum has a lot of traditional Balinese art as well as paintings by the Dutch painter, Water Spies and some of his students. It is well laid out, has exhibits ranging from traditional to contemporary, and is easy to get around. One building had an exhibit of old photos donated by a couple who lived on the island in the early 20th Century. The photos are of different ceremonies, dances, etc. Truly spectacular! Don't miss it!"
        }, 
        {
            "index": 246, 
            "rating": "5", 
            "review": "Linda Vall loves painting. First visited the Neka Museum around 14years ago.......could not miss a second visit when we were in Ubud in July2014. The paintings are lovely, and the museum exudes an overall quiet from the hustle and bustle of downtown Ubud.Don't miss it if you are looking for something to do in Ubud."
        }, 
        {
            "index": 247, 
            "rating": "5", 
            "review": "Small but beautiful museum. Some western museums by their very nature can be dull, 'stuffy' and not particularly inspiring, Neka on the other hand is open, clean, airy and situated in very pleasant gardens. Some great art works there ranging from traditional artworks through to the contemporary: sculpture, wood carvings etc. I particularly enjoyed the photo gallery containing images from the 1930's etc and the large upstairs gallery devoted to the ceremonial dagger, the Kris. This alone is well worth the visit. Entrance fee is 50,000 IDR (at the time of writing less than USA$5) and certainly well worth the money."
        }, 
        {
            "index": 248, 
            "rating": "5", 
            "review": "A must do in Ubud even if you're remotely interested in art.. This is a superb collection of works in a beautiful setting giving an in depth opportunity to understand the cultural and artistic significance of Ubud. The works exhibited will blow you away!"
        }, 
        {
            "index": 249, 
            "rating": "4", 
            "review": "Goood collection. First museum in Ubud and stedily improving from there. Wide selction of paintings and a kris collection. Great introduction and a good thing to do. Recommended."
        }, 
        {
            "index": 250, 
            "rating": "5", 
            "review": "Great place. Beautifully set out gallery showcasing the history of Balinese art and well catalogued. Highly recommended to spend a morning or afternoon."
        }, 
        {
            "index": 251, 
            "rating": "4", 
            "review": "Nice collection and variety. The buildings and grounds of this museum are as nice as the art inside. Great collection of old and new paintings. Set up is a bit strange like benches to rest one that don't face paintings ..or wonderful statues that have something behind the that take away slightly from the piece. Do spend some time in the Classic Balinese section. If you read the descriptions it will tell you a story contained in the picture. I learned quite a bit about the myths and history of this wonderful island."
        }, 
        {
            "index": 252, 
            "rating": "3", 
            "review": "Really mixed bag. The kris collection was GORGEOUS and really diverse. If you have any interest in ceremonial knives, go and enjoy!The rest of the collection was eclectic and didn't provide any overview or clear timeline of the development of Balinese artistic traditions. It felt very hit or miss."
        }, 
        {
            "index": 253, 
            "rating": "4", 
            "review": "Good cross section of Balinese art.. This is a great museum of the recent history of Balinese painting. The place could do with some better text on the wall which explains the significance of the artist or the style and how it links to the development of different styles, but I don't think this is in the style of this place. I am amazed by the lack of archival display techniques but it is definitely in the style of the Bali way."
        }, 
        {
            "index": 254, 
            "rating": "5", 
            "review": "Wonderful site. A must visit, easy walk north from Anini Raka where we stayed, other wise about 30 mins walk from Ubud town."
        }, 
        {
            "index": 255, 
            "rating": "5", 
            "review": "Extremely good museum. The Neka has an excellent collection of traditional Balinese art. This and the ARMA museum are essential destinations."
        }, 
        {
            "index": 256, 
            "rating": "3", 
            "review": "Perhaps my expectations were unrealistic. Balinese painting has a very particular style, and I suppose I don't particularly like it. Not that I dislike it or can't appreciate the creativity and composition, use of colour etc, I just find myself getting quite tired and a bit disinterested quite quickly.I also can't help but ponder (this may be my underlying problem) that I am looking at representations of Balinese life as seen (I think exclusively), through the eyes of men, be they locals or visitors, and that not infrequently concern young, semi-naked women. Having said that, I did find a number of extremely painterly works. The gardens are pretty, it's a good place to escape central Ubud, note that the cafe closes early, and it's cool. I'd certainly recommend you visit as the written notes to paintings are informative about Balinese traditions and culture.Only people who want something for nothing would baulk at the 50,000Rp entry fee."
        }, 
        {
            "index": 257, 
            "rating": "4", 
            "review": "Worth the walk!. Quite the walk to go there but it's worth it! Can't say I'm a big fan of Balinese art (although I love some of the paintings) but it is definitely interesting and the explanations are well doneFun thing was that we went to a Kecak dance the day after and were able to understand most of the story thanks to the explanation panels at the museum!"
        }, 
        {
            "index": 258, 
            "rating": "3", 
            "review": "Exotic place. Not big place, but has quite a collection. Good place to rest and wonder for art lover.We had free tickets from the villa, really clever idea actually"
        }, 
        {
            "index": 259, 
            "rating": "3", 
            "review": "Ok, I'm no art lover so read with a grain of salt.... Neka Art museum is like your typical art museum. It's situated between several buildings across its grounds with each building featuring a different era or type of art. There is no air conditioning in the buildings so if there's no cross breeze, plan for it to be hot.They have a gift shop with your typical Indonesian wares, with ridiculous prices.Our tour package included a visit to Neka which is why we went. If I had to pay, I'm not sure I would have visited."
        }, 
        {
            "index": 260, 
            "rating": "5", 
            "review": "best painting museum in bali. the museum have large collection for balinese painting, time through time and some art collection beside paintings, worth to visit!"
        }, 
        {
            "index": 261, 
            "rating": "5", 
            "review": "quiet and well laid-out gallery.. Super selection of traditional and modern pieces. Virtually no other visitors. Excellent value. (I intended this review for Neka, not ARMA)."
        }, 
        {
            "index": 262, 
            "rating": "4", 
            "review": "Definitely worth a visit.. If you fancy a bit of culture while in Ubud, this lovely museum, about a 15/20 minute drive from the centre of Ubud, hosts an excellent collection of Balinese paintings, drawings, and sculpture; pieces by contemporary Indonesian artists, and a very interesting photographic archive of Balinese life in the 1930's and 40's - as well as possibly the largest collection of ceremonial daggers (keris) you will ever see. There is a small entrance fee. Take a bottle of drinking water with you, you may need it."
        }, 
        {
            "index": 263, 
            "rating": "5", 
            "review": "Best Art Gallery. No doubt this is the place to get the best overview of Balinese art in a peaceful, tranquil, we'll kept setting,"
        }, 
        {
            "index": 264, 
            "rating": "5", 
            "review": "Worthwhile visiting. Beautiful collection of Balinese and foreign artists work depicting Balinese life and people. Building and history also interesting"
        }, 
        {
            "index": 265, 
            "rating": "5", 
            "review": "An essential stop if you're in the Ubud area. An incredible museum, which highlights the extensive cultural heritage of Bali - and in a beautiful setting amongst the rice terraces."
        }, 
        {
            "index": 266, 
            "rating": "4", 
            "review": "Huge Collection. It was a big collection. Not as diverse as Agung Rai. We went because we were staying nearby. I don't think I would go out of my way to visit unless you are a big art lover."
        }, 
        {
            "index": 267, 
            "rating": "5", 
            "review": "Our favorite museum in Ubud. One of our favorite place in Ubud with a large collection of painting and photos. A very nice place to learn more about Bali history and Balinese custom."
        }, 
        {
            "index": 268, 
            "rating": "5", 
            "review": "Most interesting. We are not into art to any great extent, but enjoyed the comprehensive display. We were surprised that we filled in two hours without any difficulty"
        }, 
        {
            "index": 269, 
            "rating": "5", 
            "review": "Comprehensive collection of classical and contemporary Balinese Art. Being a collector of Indonesian contemporary art, I have longed admired the unique style, composition of Balinese art and the talented artist who created them. At Neka museum, featuring a comprehensive and nicely curated collection, I was able to appreciate all the beautiful Balinese art by both classical as well as contemporary Balinese artists such as Nyoman Gunasa. What makes Neka special is that you get to admire Balinese art in its original source - Ubud where the artists drew inspiration from over the ages and you get to see the evolution and progression of Balinese art from the traditional composition depicting village ceremony and life in intricate illustrations to the dynamic expressive style of contemporary Balinese artist, expressing the soul and beauty of Ubud, it's spirit , culture , history and heritage in vibrant brush strokes and vivid colors. Certainly a MUST VISIT for lovers of Indonesian and Balinese art."
        }, 
        {
            "index": 270, 
            "rating": "4", 
            "review": "Balinese art old and new. The price of the entry ticket is far too much but the gallery itself is marvellous. You can wander through the different rooms taking in the old artworks with their unique style and on to modern paintings. It gives you the impression that the natural world, the spiritual world and our human condition are major forces in the minds of the artists. A lovely reflection of Balinese culture."
        }, 
        {
            "index": 271, 
            "rating": "3", 
            "review": "Interesting assortment of art. Interesting museum showing artwork that probably won't survive very long due to the fact that this place isn't climate controlled. Best to take a long then head across the street to Naughty Nuri's for some great BBQ!"
        }, 
        {
            "index": 272, 
            "rating": "5", 
            "review": "Perfect collection of art and documentary. If you are into art don't miss this museum. There is a vast collection of Neka's paintings. If you are into art don't miss this museum. There is a vast collection of Neka's paintings."
        }, 
        {
            "index": 273, 
            "rating": "5", 
            "review": "Great afternoon. Neka has a fantastic and interesting collection. A lovely afternoon spent meandering through the many pavilions. Informative and varied collection of artworks; thoroughly enjoyed!"
        }, 
        {
            "index": 274, 
            "rating": "4", 
            "review": "Impressive, well kept museum. Being an artsy fartsy person, I notice that many art galleries in the country is not well taken cared of... except for this one. The collection is impressive, very informative, the English translations actually makes sense, they even have Japanese translations. The art gallery is well put together and categorized. They have Ubud style, Batuan style, Foreign artists and pavilions for specific famous artists such as Lempad Pavilion.It's clean and the merchandise store is filled with great Balinese art books. Well worth a visit!"
        }, 
        {
            "index": 275, 
            "rating": "5", 
            "review": "Informative Gallery. Recommended for people trying to appreciate Balinese culture, not just art lovers. A bit out of town, but a downhill walk back, the collection is very well organized in a series of buildings set in nice grounds. The collection includes photos from the 1930s as well as contemporary art . Well worth an hour or two of your time."
        }, 
        {
            "index": 276, 
            "rating": "5", 
            "review": "Small museum but very nice. While in Ubud art lovers should stop by this very nice museum. The mix of western and balinese styles of the art collection, the set up of the museum in balinese traditional architecture with its courts, gardens and carved doors, the quietness of the place, all this make your visit to Neka highly enjoyable. It is like having a rest from the crowded and busy city. You are not going to spend three days in it, like you may in le Louvre or in the MET, but the art collection in itself is very interesting and will fill 2 or 3 hours of your life with beauty."
        }, 
        {
            "index": 277, 
            "rating": "5", 
            "review": "art hunting. Collect art - and having being shown round umpteen galleries with a million masters - this one has the cream of whats on offer."
        }, 
        {
            "index": 278, 
            "rating": "4", 
            "review": "Arts lovers must see. This collection includes a wonderful combination of both traditional and modern works. The museum is situated in lovely grounds."
        }, 
        {
            "index": 279, 
            "rating": "5", 
            "review": "Fascinating. Great collection of Balines paintings very well set out in a lovely setting just outside Ubud. Spend about 3 hours to see the lot."
        }, 
        {
            "index": 280, 
            "rating": "4", 
            "review": "Worth a couple of hours.. If you are interested in art this is a must. The Arie Smidt exhibition is very uplifting. The buildings and grounds are also very peaceful."
        }, 
        {
            "index": 281, 
            "rating": "5", 
            "review": "It's like visiting a someone's home. Neka Museum is more than a museum. The art pieces are housed in a big old bungalow with beautifully manicure garden, which makes you feel as though you are entering into someone's private home. It has a huge collection of Indonesian paintings that date as far back as 1930s. You get to appreciate the stark difference of Indonesia then and now. We spent an hour there, awed by the intricacies of the paintings and wondering the whole time, how these pieces look so perfect despite been hung so close to the open windows, exposed to the humidity.Note: 3km fm centre of Ubud.Go by taxi,fares are cheap and bargainable."
        }, 
        {
            "index": 282, 
            "rating": "5", 
            "review": "Great exposition of Balinese art. Having been to most of the other galleries in Ubud I would rate this my favourite (though ARMA is close) because it explains so well the development of Balinese art from the 2 dimensional influence of Javanese puppets to the present."
        }, 
        {
            "index": 283, 
            "rating": "4", 
            "review": "Interesting art and beautiful grounds. There are probably about 200 pieces in this museum -- not a huge representation of local art. Still the works were very interesting and broadly representative of the short history of Bali art. The grounds are beautifully maintained. I am glad to have seen it. The price was modest."
        }, 
        {
            "index": 284, 
            "rating": "4", 
            "review": "Good and quiet. Very nice, a moment of escape in a crowded Ubud.Go there if you love paintings. The place is huge, and quiet, and spacy. Nice!"
        }, 
        {
            "index": 285, 
            "rating": "3", 
            "review": "Not As Good As what i Expected. I have a high expectation on Neka Art Musuem before i pay the visit. It is an average art musuem i would say. Nothing much impressed me."
        }, 
        {
            "index": 286, 
            "rating": "5", 
            "review": "Beautiful Hofker drawings. don't miss them, because they're only in 1 pavilion. Have a look at the historical and comtemporary art from Bali"
        }, 
        {
            "index": 287, 
            "rating": "4", 
            "review": "a must see. This museum should be a must see for all visitors to Ubud. The paintings are incredible and there is a good history of Bali in the artwork."
        }, 
        {
            "index": 288, 
            "rating": "5", 
            "review": "One of the top 2 Galleries in Ubud. Beautiful setting with wide collection representing all period of Balinese art. I took a few gansa (instrument) lessons with Wayan which was enlightening in learning more about Balinese music."
        }, 
        {
            "index": 289, 
            "rating": "5", 
            "review": "Neka Art Museum. a significant art museum which presents an historical and artistic perspective of Ubud. The museum is housed in a most impressive a set of interconnected buildings. Needs to be visited!"
        }, 
        {
            "index": 290, 
            "rating": "5", 
            "review": "Good Museum in Ubud. With Blanco Museumn (more for the place and atmosphere), this is my favorite in Bali. Collections are nice and interesting. The museum is quite big. The price is not as ridiculously expensive as in Nusa Dua."
        }, 
        {
            "index": 291, 
            "rating": "5", 
            "review": "Worth a visit!. The place to go on your first day in Ubud. It will give you an excellent overview of the many styles of Balinese art with representation of most of the islands famous artists. Cool and breezy rooms and a gorgeous garden with resident geese."
        }, 
        {
            "index": 292, 
            "rating": "4", 
            "review": "A good overview of art history. i liked a good selection of pictures and photos but I missed some statues. A convenient location close to stores and some other galleries."
        }, 
        {
            "index": 293, 
            "rating": "4", 
            "review": "Time. Make sure you give yourself enough time to view this museum entirely. Since they have huge interesting collections."
        }, 
        {
            "index": 294, 
            "rating": "5", 
            "review": "An excellent introduction to Balinese art. We wanted to understand the history and influences of Balinese art before making any decisions to purchase and this was the perfect education! Well curated and really interesting. Well worth a look if you are into art."
        }, 
        {
            "index": 295, 
            "rating": "5", 
            "review": "More than the art.... The art was wonderful, the presentation and the grounds were breathtaking, and the social history told through the paintings was delightful."
        }, 
        {
            "index": 296, 
            "rating": "5", 
            "review": "A wonderful collection. Simply a wonderful collection of paintings of different style and age from the old to the modern. I have been here several times and never get tried of it! A must in Ubud."
        }, 
        {
            "index": 297, 
            "rating": "3", 
            "review": "It was ok. The art was cool, some funky modern art as well, didn't expect that. The grounds were a bit smaller than I would have thought, but overall ok."
        }, 
        {
            "index": 298, 
            "rating": "5", 
            "review": "Excellent museum. The museum and garden are beautiful in themselves. The collection is unsurpassed. The owner has made a point to collect along the range of Balinese art, and it's very good.Once you see this, and then you go to the street-----you'll understand why most of painting be sold on the street is tourist stuff. And you'll be able to spot what might be good.This is a lovely place to spend a few hours."
        }, 
        {
            "index": 299, 
            "rating": "5", 
            "review": "Fascinating!. Though I am not the biggest fan of art museums, I found the Neka Art Museum very interesting and fascinating. No doubt, the paintings are beautiful but what I enjoyed the most was how the paintings tell you a lot about Balinese culture (and its development over time due to western immigrants), religion, myths and history!"
        }, 
        {
            "index": 300, 
            "rating": "5", 
            "review": "beautiful gardens and lovely displays. An easy place to roam, even in rainy weather. Relaxed environment, pleasant surroundings, beautiful art work. I loved the photos from the twenties."
        }, 
        {
            "index": 301, 
            "rating": "3", 
            "review": "ok.. We walked all the way from Ubud Center there, but somehow the art wasn't that great. There are many nicer smaller Art Galleries on the way which I suggest to stop by."
        }, 
        {
            "index": 302, 
            "rating": "5", 
            "review": "Ubud culture. The museum is a beautiful building in itself and has calm attractive gardens, content of the gallery is extremely interesting"
        }, 
        {
            "index": 303, 
            "rating": "1", 
            "review": "Too Many Paintings. There was not much heritage or story connecting the art: too many painting. It was also an expensive entry fee!"
        }, 
        {
            "index": 304, 
            "rating": "5", 
            "review": "Excellent selection of Balinese art. This is a private museum with a very good selection of Balinese paintings displayed in several buildings. The best art museum I have been to in Bali."
        }, 
        {
            "index": 305, 
            "rating": "5", 
            "review": "See real Balinese art, not just the tourist stuff on Monkey Forest Road in Ubud. If you go to art museums when you visit cities in America or Europe, you absolutely should visit the Neka Art Museum. You will learn a lot about how Balinese see the world. The art there stems from Germans and other Europeans teaching Balinese Western art techniques in the '20s and '30s. Then they took the ball and ran with it. So visiting this museum is both an artistic and a cultural experience. It includes art by Westerners with Balinese subjects.When we went the museum was practically empty expect for us and Russian-American couple we're friends with. This is a serious art museum with worthy art in it, from abstract expressionist works to the most typical Balinese paintings--colorful, crowded depictions of the busy work and social life that's all intertwined for most Balinese. It's a short drive from Ubud, doesn't cost much to visit, and is on attractive grounds. Tourists would do themselves a favor by spending less time at cheesy, tropical-generic tourist attractions and more at uniquely Balinese ones like this. Whatever genre of art you like, from avant garde/ironic to more traditional expressions, it can be found here."
        }, 
        {
            "index": 306, 
            "rating": "4", 
            "review": "Do not miss it. It is a good museum, especially if you wish to understand the balinese art. It is required to forget about museum in Europe before to enter: in Indonesia and in general in Asia, it is not easy to find a nice place with the passion for Art. And to not miis the Keris part, really beautiful."
        }, 
        {
            "index": 307, 
            "rating": "5", 
            "review": "Great collection, beautifully housed. The Neka museum is set across 8 different pavilions, some only large room sized, within beautiful lush gardens. The highly polished crimson floor tiles and white walls establish an excellent canvas to display the art. The art is all quite recent, with the earliest coming from the mid 20th century. It covers traditional Balinese painting, highly complex and generally telling stories of every day life or of Hindu legends; modern Balinese painting by indigenous artists; and art by visitors who settled in Bali, mainly Dutch, Australian and Phillippino. The explanations for each picture are comprehensive, and the art is logically arranged by style or artist. 1.5 to 2 hours gives you a comprehensive look. It's a good walk from Ubud Palace if you are fit- otherwise a simple cab fare. After visiting, we were comfortable that the painting we had bought the day before had some grounding in genuine Balinese painting--probably smarter to go to the gallery first though!"
        }, 
        {
            "index": 308, 
            "rating": "5", 
            "review": "wonderful. I liked this museum a lot, there is a great collection of art spread over different buildings.The grounds are beautiful."
        }, 
        {
            "index": 309, 
            "rating": "4", 
            "review": "Museum with great library of balinese arts and painting. Liked: good library of balinese paintings and art pieces. The museum is well maintained, airy and cleaned. The neka museum is owned by the komaneka resort and komameka guests have free complementary tickets and shuttle to the museum. The best thing is its location because the museum is just opposite the world famous naughty nuri's warung which served great pork ribs Disliked : the souvenir section is not very well maintained , suggestions to the management if they can stocked the souvenir section with more paintings and artifacts for sales.Verdicts: good place to visit in the morning around 1100am, it will take around 1 hour to tour the museum and thus by noon you can pop over to naughty nuri's warung for lunch"
        }, 
        {
            "index": 310, 
            "rating": "5", 
            "review": "the best Museum. Beautifull well kept colonial buildings in a tropical garden (beautifull butterflies and spiders) with a great colection of paintings and sculptures. All in all the most beautifull museum I know!"
        }, 
        {
            "index": 311, 
            "rating": "4", 
            "review": "Great gallery. Beautifully presented gallery specialising in all the schools of Balinese art, including the owner's fine kris collcection. Well woth a visit."
        }, 
        {
            "index": 312, 
            "rating": "3", 
            "review": "Nice to see. I thought that Neka could have done with a little facelift. Some paintings seemed lost in the building, possibly only because of it's positioning. Still worth a visit, its close to Ubud Centre and not expensive. Amazing original B/W photos from 20/30'S Bali."
        }, 
        {
            "index": 313, 
            "rating": "3", 
            "review": "You have to love Indonesian art. Beautiful setting with a large collection of Indonesian art. Skip the lunch options and just tour the collection. Better food awaits close by"
        }, 
        {
            "index": 314, 
            "rating": "4", 
            "review": "the best gallery in Ubud. The gallery houses a fine collection of paintings from every school of Balinese art. Highly recommended. Takes about 2 hours to get round."
        }, 
        {
            "index": 315, 
            "rating": "5", 
            "review": "Terrific art with detailed explanations. I really enjoyed this museum - beautiful Balinese paintings from many time periods, as well as some sculptures and photos. Excellent explanations beside each work really enhanced my experience."
        }, 
        {
            "index": 316, 
            "rating": "5", 
            "review": "Superb, and don't miss the kris collection. We were attending the Ubud Writers and Readers Festival (5 star!) in October, and one of the main venues was the big pavilion at Neka. So of course we took the opportunity to re-visit an old favourite and were delighted. The setting is as lovely as ever, the whole museum is superbly maintained and the work is beautifully displayed. And a surprise - we were encouraged to visit the newly-opened kris gallery, up the staircase near the reception desk. An extraordinary collectionof these ceremonial knives, with excellent interpretive material and an informative display of how a kris is made, step by step. A great addition to a wonderful art museum."
        }, 
        {
            "index": 317, 
            "rating": "5", 
            "review": "Great insight into Balinese culture. Take your time walking through here and you will learn much about the island and it's people. It's a wonderful old building full of bright paintings, sculptures and photography and well worth a visit."
        }, 
        {
            "index": 318, 
            "rating": "5", 
            "review": "Wonderful chance to see Balinese Art. I was in Ubud for an Art Class, so a visit to Neka was a must. This has an excellent collection of local art by both Balinese and foreigners. This is a must for any art lover."
        }, 
        {
            "index": 319, 
            "rating": "5", 
            "review": "Very interesting. Enjoyed our visit to see traditional and contemporary Balinese art and sculpture. The architecture of the museum and gardens was beautiful.Worth a visit if you like Balinese art and culture."
        }, 
        {
            "index": 320, 
            "rating": "4", 
            "review": "Step into Bali's history. This should be on your list of places to visit in Ubud and allow at least a hour to see some incredible artwork from local and overseas artists"
        }, 
        {
            "index": 321, 
            "rating": "5", 
            "review": "amazing arts in Bali. How amazing art works and artist in Bali!!! The prints with the tranditional story, can make our know more about this county"
        }, 
        {
            "index": 322, 
            "rating": "5", 
            "review": "Fine Art. The Neka Art Museum is great. It is set in a wonderful area, shows excellent art objects. We loved the huge terrace with the cafeteria for relaxing."
        }, 
        {
            "index": 323, 
            "rating": "2", 
            "review": "No place to eat. Wonderful art collection if you are seriously into eclectic and enjoy the off-beat. Gives a good sense of Balinese art past and present. Some very creative modern art. But the cafe is a non-starter. Don't count on it for a meal."
        }, 
        {
            "index": 324, 
            "rating": "4", 
            "review": "Highly Enjoyable. Would definitely recommend this museum and then to also attend at the Neka Gallery as you won't be disappointed with either. We also made some purchases in the museum gift store to be given as gifts; prices were reasonable."
        }, 
        {
            "index": 325, 
            "rating": "5", 
            "review": "Very interesting. An excellent way of spending an afternoon in Ubud, plenty of interesting stuff, and conveniently placed to finish off the day with a few beers and the best pork ribs in the world across the road at nuri's."
        }, 
        {
            "index": 326, 
            "rating": "5", 
            "review": "Surprisingly good. Really interesting and complete. It shows all the history of Bali with its tradicional animic rituals and special swords. Photos in black and white depicting the island in the 40s were fantastic, then you could see what was Bali before the mass tourism. Many pictures made by the westerns and natives are awesome as well showing specific details that help us to understand better the traditions of their culture. A must in Ubud. It was empty when i went there by bicycle so i enjoyed more."
        }, 
        {
            "index": 327, 
            "rating": "4", 
            "review": "Beautiful art and grounds. The Neka art gallery is a wonderfully laid out history of Balinese art. The grounds and buildings are beautiful. Definitely a good place to walk off the ribs and beer from Naughty Nuri's across the road!"
        }, 
        {
            "index": 328, 
            "rating": "4", 
            "review": "Good place to learn about history of Balinese art & culture.. MIt houses many exhibits, mostly paintings from old to contemporary. I like the ones on Hindu mythology , Ramayana. It is a quiet place. Can take your own sweet time to look at the paintings & the captions."
        }, 
        {
            "index": 329, 
            "rating": "5", 
            "review": "interesting place. we liked it. definitely worth checking out on your way to monkey forest for example...since its located in the same road pretty much"
        }, 
        {
            "index": 330, 
            "rating": "5", 
            "review": "Neka Art Museum. It was a lovely, quiet serene and quite large gallery in the middle of Ubud. I just loved it. It had a large selection and variety of excellent art from many fine Balinese painters ( mainly). Of course the whole building had wonderful carvings which is common to most Balinese buidlings. I would like to have spent more time there and well as other galleries. Ubud is such a busy place that this was a real oasis of genuine Bali with no one trying to sell you anything."
        }, 
        {
            "index": 331, 
            "rating": "3", 
            "review": "Interestin but expensive. interesting, not too big, with good explanations , but expensive. Worth a visit if you want to see a few pieces of antique balinese paintings .."
        }, 
        {
            "index": 332, 
            "rating": "5", 
            "review": "If you make only one \"cultural visit\" make it this one. A quiet and wonderfully curated collection of Indonesian art.\nMake sure you leave time to see the photography section which is a great trip into the country's past and culture."
        }, 
        {
            "index": 333, 
            "rating": "4", 
            "review": "Good museum with explanations on Balinese art periods. Nice museum, similar to the Puri Lakisan Museum. The photography exhibit offeres a nice glimpse into Bali before the intrusion of tourists and heavy western influences. Good explanations about different periods in Balinese art. Also, a small exhibition of I Gusti Nyoman Lempad's work, an internationally known Balinese artist. And another section on contemporary Indonesian artists."
        }, 
        {
            "index": 334, 
            "rating": "3", 
            "review": "The Best. Many museums that we have visited, Neka museum is one that we admire. You do not forget to visit to this museum if you come to Ubud."
        }, 
        {
            "index": 335, 
            "rating": "4", 
            "review": "Most interesting museum. This was a well designed and maintained museum with wonderful exhibits of art, woodwork and pottery. I also enjoyed the separate section devoted to the Balinese weapons. The location high up the valley with majestic views was an extra benefit."
        }, 
        {
            "index": 336, 
            "rating": "5", 
            "review": "A wonderful place to appreciate Ubud Arts. This museum is next door to Uma by COMO, and is said to be the most comprehensive collection of traditional and modern Balinese paintings on the island. Entry costs £4, and the collection includes 6 pavilions covering Balinese painting from the 17th century onwards, as well as European and American artists and photographers who have lived and painted in Bali, and had an influence on local artists. It is well worth an hour's visit. For the full review and images, please visit - www.thelondonfoodie.co.uk"
        }, 
        {
            "index": 337, 
            "rating": "4", 
            "review": "the classic one. Named after a Balinese teacher Suteja Neka who collected paintings as a means of artistic documentation, this museum is unique because its collection of foreign artworks by Balinese, other Indonesian, and foreign artists all were inspired by the natural beauty, life, and culture of Bali.We love this museum because they still keep the classic style of the museum, in here you can see the \"Keris\" collection, old photography, painting and many more.Suggestion : - After going around in this museum, you can try the restaurant across the road call \" naughty nuris \" and try the pork ribs, would be delicious."
        }, 
        {
            "index": 338, 
            "rating": "5", 
            "review": "Good museum and gardens. Excellent museum, and lovely gardens, near the centre of Ubud. A good place to start a trip with an introduction to Balinese culture."
        }, 
        {
            "index": 339, 
            "rating": "4", 
            "review": "Quiet day at the museum. Very nice to be able to get an overview of the Balienese painture in a setting, enable you to get out every now and then and relax and reflect upon what you have seen. Very nice gardens and I spent an instructive and relaxing afternoon."
        }, 
        {
            "index": 340, 
            "rating": "5", 
            "review": "A Museum definitely not to be missed!. I was looking forward to visiting the famous Neka Art Museum in Ubud as word has it that they have a fantastic Kris collection (or Keris in Indonesian). The museum also houses art collections from the early classical Balinese paintings to the transitional styles and the Ubud and Butuan style paintings. There’s a section for young artists and contemporary style paintings (which I couldn’t appreciate!) and contemporary Indonesian art, including some black and white photographs. On display are also works by current Indonesian artists and some foreign artists, as long as these have been inspired by the culture, natural beauty and life of Bali in them.We were highly appreciative and humbled that Pak Suteja Neka, the originator, founder and current Director of these precious art and Kris collections offered to show us around and give us a tour of his awesome collection, which originated as a passionate hobby, now is recognized as an institute of international standing. We began with the the amazing kris collection. In 2005, UNESCO declared the Indonesian keris as a great cultural achievement of world humanity. The kris is much more that just a weapon. Each piece has some history and story to tell, has been decisive in winning battles, has given their owner power and strength, and it goes on. Considering the time they were forged, the craftsmanship is utterly amazing and mind boggling, not to mention the inlaid decorative precious jewels and stones, delicate carving, the balance between blade and handle, etc.The art collection comprising over 300 pieces, grouped and classified, is housed in several buildings and rooms, which in themselves have been patterned in Balinese architecture. Much information about early Balinese life and culture can be gleaned from these precious art works. They are so priceless with regards to research, education and information for anyone who’s interested, and an inspiration for non-Balinese visitors. Unfortunately, we didn’t have the luxury of spending much time at this section, but had a overall account with details of certain interesting pieces pointed out to us. It was however, sufficient to have an appreciation of the cultural and life style changes that transited over the years in Bali through the eyes of various artists!You can spend an entire day if you’re so inclined, to look closely at the collection, or you can browse them in the groups that they are shown without getting into small details, and still appreciate the changes or transition in the culture, life, and the natural beauty of early and contemporary Bali.Whatever you choose to do in Ubud, don’t pass up the chance to visit this awesome museum. It’s not to be missed. And it’s definitely worth a return visit!Neka Art MuseumRaya Campuhan St.Kedewatan Village, Ubud Gianyar 80571The Museum is opened :Monday-Saturday: 9 A.M.- 5 P.M. \u2028Sunday: NOON - 5 P.M. \u2028Closed: National Holiday.ADMISSION FEE \u2028for the Permanent Collection.\u2028Rp. 50.000 Adults and Free for children 12 and under."
        }, 
        {
            "index": 341, 
            "rating": "4", 
            "review": "A must for those who are interested in Balinese culture and history. this visit needs a minimum of 2hrs time as one should visit the pavilions according to the history of painters living in Ubud - since a century and more."
        }, 
        {
            "index": 342, 
            "rating": "4", 
            "review": "Balinese art also collection of kris daggers. Even if you don't much care about art, it's worth coming here just to see the fine collection of keris (or kris) daggers, with jeweled hilts and curved blades. The best such collection I've seen. They are, however, all behind glass which makes them difficult to photograph. This collection is on the second floor, and you may have to ask someone how to find it. Plenty of paintings and statues, representative of several different genres and styles. Some old and some new. A very fine place, overall."
        }, 
        {
            "index": 343, 
            "rating": "4", 
            "review": "Visit this Museum when in Ubud. Our driver from Samaya Ubud suggested we spend an hour here. And true enough, we completed most of what we wanted to see in an hour. We enjoyed our visit. Even my young children seemed to have a good time. For those with young children, watch out for some dangerous and very low windows on the second floor of some of the buildings. The management should put in some safety grills on those.Aside from traditional Balinese paintings, we found many contemporary styled paintings and interesting sculptures. I particularly liked Arie Smit's works. I also found a room full of old photographs of Balinese life which were interesting.The interiors of the buildings are not very posh and lack airconditioning that most modern galleries have for preservation of the art work. I wonder how the Museum keeps the paintings in good condition. The grounds are nice with some ducks on the lawn and people playing Indonesian instruments in one pavillion.It's a pleasant place to spend an hour in the afternoon when it's too hot to do much else."
        }, 
        {
            "index": 344, 
            "rating": "5", 
            "review": "Worth seeing. We were really impressed with a great Bali art collection in a beautiful setting. It is really worth visiting.We highly recommend going there and spending some time."
        }, 
        {
            "index": 345, 
            "rating": "5", 
            "review": "Best collection of Balinese art. This museum has a well laid out and well explained collection of Balinese art, including old temple paintings. The gift shop is excellent and has beautiful local craft items for sale."
        }, 
        {
            "index": 346, 
            "rating": "3", 
            "review": "Good Bali Museum. Good museum but not the best. Kinda out of the way to get to. If you need to kill a few hrs and have nothing else to do its worth it... But if you don't have the time ur not missing much."
        }, 
        {
            "index": 347, 
            "rating": "5", 
            "review": "Beautiful collection.. Great painting collection. Clear explanation, it world class museum. Don't forget to add this place when you're goin to trip to Ubud. Great experience."
        }, 
        {
            "index": 348, 
            "rating": "4", 
            "review": "nice to visit. A great place to learn more about the work of the bali. Many painting are on display in this museum, there are a few of the many who have reached age decades. It is remarkable the work of people in Bali, especially in Ubud town."
        }, 
        {
            "index": 349, 
            "rating": "4", 
            "review": "Worthwhile to appreciate the evolution of art in Ubud. The exhibitions have some really good explanations of the different art styles and the evolution of the styles and techniques over the years, from original traditional styles to modern day. The exhibition using incomplete paintings to illustrate the techniques used in traditional Ubud style paintings was illuminating. There are also detailed explanations of the significance of certain images or icons in Balinese traditions (i now understand what carvings and statues of horses are so popular! I loved the photos from the 1940s. Best of all was having the opportunity to learn about the art without any pressure to buy! I came away with a much better understanding of what I was looking at in the shops, and a real appreciation for the amount of time and effort that goes into some of the works."
        }, 
        {
            "index": 350, 
            "rating": "4", 
            "review": "Good for the art lover to see a historical development. This private museum is layer out with a clear historical development in Balinese art. The influences of European art can clearly be identified as you wonder thought he various buildings. A very nice selection of key contributors and a diverse range of stylistic approaches throughout the 70-90's. the collection really is just a lot of works hanging on the walls with a sense of lack of preservation beginning to prevail. The Arie Smit works are particularly of interest."
        }, 
        {
            "index": 351, 
            "rating": "4", 
            "review": "Small museum with a few interesting wood sculptures. By world-class standard, this is a tiny museum. I am not interested in paintings in general and have nothing to say about that. But it does have a few some museum-quality wood sculptures. For a place that is known for producing world-class wood sculptures, it is a puzzle why there is not a museum with a huge collection of wood sculptures. A master sculptor in Ubud even claimed that there is no such museum in the whole Indonesia. The master sculptors are wasting their talents in Indonesia?"
        }, 
        {
            "index": 352, 
            "rating": "5", 
            "review": "Diamond of Ubud. If you want to get into the heart of Ubud's art, this is the place you must visit. Every pieces and every details are marvelous. Don't miss this love art museum."
        }, 
        {
            "index": 353, 
            "rating": "5", 
            "review": "good paintings. A lot of beautiful paintings by Balinese painters.A must see!The pavilions were artfully decorated. One pavilion is contributed to a Dutch painter Arie Smit."
        }, 
        {
            "index": 354, 
            "rating": "3", 
            "review": "Must to Visit. Museum one of the many museums in Ubud. Nice place, we can learn how to draw people Bali story taken from about Hindu culture. Each image has its own meaning and many styles we can see, there is traditional or modern style."
        }, 
        {
            "index": 355, 
            "rating": "3", 
            "review": "Learn about Balinese art culture. Modern to older traditional paintings and a little history of Bali, a good way to get an overview and understanding of Balinese culture."
        }, 
        {
            "index": 356, 
            "rating": "4", 
            "review": "Great art museum. Huge art museum a bit out of town but worth the trek if you're an art lover. Good variety of art spans through a few different buildings."
        }, 
        {
            "index": 357, 
            "rating": "5", 
            "review": "This is a good place to start if you're thinking about buying art in Ubud. This is a lovely museum and I enjoyed it entirely. There was good history and a fine display of Balinese art from several eras. I wish the gift shop had more choice and better quality prints for sale."
        }, 
        {
            "index": 358, 
            "rating": "5", 
            "review": "Cool museum. large open air museum with cool collection of paintings and wood craves.displaying artworks of famous artist both traditional and contemporary, I really enjoyed this museum and recommend it to everyone who will visit Ubud."
        }, 
        {
            "index": 359, 
            "rating": "5", 
            "review": "Worth visiting for the many masterpieces in the museum. Initially, I was hesitant about visiting the museum. There are many free art galleries in the same area and this museum charges an entry fee of 50,000 IDR. Moreover, I find going to a lot of small local museums a let down after having been to the top museums in Paris, Florence, Vienna, Zurich etc. It doesn't help that I also don't like the dark palettes of traditional Indonesian paintings. Despite all these misgivings, I still went. Boy, am I glad I did! I was stunned by the masterpieces by artists like Affandi, Arie Smit, Walter Spies, Dullah, J. Elizalde Navarro, I. Walter Pasti et al. This museum is stock full of canvases to delight the senses with colour, energy and and an almost uncanny life-like expressiveness. If you only want to visit ONE museum in Bali, make it this one."
        }, 
        {
            "index": 360, 
            "rating": "5", 
            "review": "Wow, take the time to visit Neka. This museum is a bit out of the way from downtown Ubud, but was worth the taxi ride. It's a large, open air museum made up of many different buildings and works of art including a balinese paining area, Indonesian contemporary artists, puppets, and an area for Gusti Nyoman Lempad. I was truly amazed by the collection and felt the entrance fees was undervalued at $5 US. The gift shop was a great stop if you didn't buy any sarongs in the market. They were exquisite here."
        }, 
        {
            "index": 361, 
            "rating": "5", 
            "review": "Must see. Lovely shop with fine quality Balinese crafts, Museum has extensive collection of traditional and contemporary art, beautiful, quiet gardens."
        }, 
        {
            "index": 362, 
            "rating": "5", 
            "review": "Best in Indonesia. The Neka Museum is one of the best in Indonesia. It is housed in a series of charming Balinese buildings with lovely gardens populated by ducks and birds. The collection show the evolution of Balinese art from traditional to contemporary with a scattering of expat artists who changed modern art in Indonesia. A great 2 hour visit."
        }, 
        {
            "index": 363, 
            "rating": "5", 
            "review": "Great Place. Good place to learn about balinese paintings and keris, good place to hang out... the price is worth the view... Friendly staff great collection.... a must see...!!! Been there several times with friends and collegues"
        }, 
        {
            "index": 364, 
            "rating": "4", 
            "review": "Comprehensive, well organized collection- a delightful education.. This large museum, while not as beautifully situated or centrally located as the Museum Puri Lukisan, nonetheless has an unparalleled, extensive collection of painting, sculpture and carving the reflects the evolution of Balinese art. The museum's founder was the son of a carver famous in the 60\"s; the depth of the collection reflects their friendships with the major luminaries on the Balinese art scene.There paintings are grouped by styles, with explanations of the evolution and differentiating features of each described. Not all the paintings are attributed, but until western influence, Balinese artists didn't usually sign their work, so some of the minimalist signage is to be forgiven. Sculptures are scattered throughout. There is a nice range and depth to the works, even the more contemporary pieces. Exclusive to this museum is a huge collection of Kris, or Balinese daggers, many prize winning from contemporary competitions. Mokume-gane blades, golden, ivory and wooden handles and sheaths, gemstone encrusted Ganesha's- even if you do not like weaponry (me!), the beauty of some of these pieces is not to be denied. (Always pains me to see the artistry that we invest in weapons, however there is ritual religious significance to the Kris, which may be why such beauty is invested in its creation.)Gift shop with books and prints of selected work on site."
        }, 
        {
            "index": 365, 
            "rating": "5", 
            "review": "Neka Art Museum. This is a wonderful display of Balinese art. They have a numb of galleries displaying a range of work. I was particularly blown away as they say by the work of one of Bali's famous woodcarvers whose name I have of course forgotten. Look out for the carving of the prone deer with her young one sheltering behind her- it was so evocative that I felt quite weepy.They have the usual museum facilities with the bonus of a pleasant view over the gorge"
        }, 
        {
            "index": 366, 
            "rating": "4", 
            "review": "Art gallery a highlight.. Gives an insight into the culture of Bali in the last century and the power of one artist to fire up an arts community. Beautiful work."
        }, 
        {
            "index": 367, 
            "rating": "5", 
            "review": "Great Museum. Brought Indonesian art, both traditional and contempory to life and gave real meaning to it. Some amazing pieces to see. Definately one of my favourite museums. Can highly recommend a couple of hours here."
        }, 
        {
            "index": 368, 
            "rating": "5", 
            "review": "Thoroughly enjoyable. Wonderful setting. I loved learning about Arie Smit (a Dutchman) who settled in Bali and helped young Balinese artists express their painting in a more contemporary style.An interesting photography section depicting Balinese life before many Westerners travelled there.Definitely recommended."
        }, 
        {
            "index": 369, 
            "rating": "5", 
            "review": "Wonderful museum. I really enjoyed this museum and highly recommend it to everyone, who is interested in Balinese culture. There are a lot of famous paintings, which reproductions you can see all over Bali. The museum is quite large, so plan on spending at least 2 hours there."
        }, 
        {
            "index": 370, 
            "rating": "3", 
            "review": "Mostly for art buffs. Very good if you are extremely interested in Balinese culture and art. If not you will probably find it a bit boring, there is little here to blow your mind or provoke you."
        }, 
        {
            "index": 371, 
            "rating": "4", 
            "review": "Great overview of Balinese Art and Large Kris Collection. The layout of the art has a chronological taste of all the major historical Balinese artists and artists who were inspired by Bali. Historical photographs were in a separate bungalow. The Kris collection is amazing, but some of the information is vague."
        }, 
        {
            "index": 372, 
            "rating": "4", 
            "review": "Not only Art they also have \"Kriss\" balinese dagger collection. The museum organized very well and profesional, it s good place to know how art improved..\nCollection of aold artisant until young artis.."
        }, 
        {
            "index": 373, 
            "rating": "4", 
            "review": "Very nice gallery in beautiful property. We visited the gallery yesterday and loved the house it is based in and the gallery. The pictures are spread over a few pavilions and we particularly liked the ones with contemporary Balinese art and photos. Very easy to navigate and front desk are very helpful. Also has a nice shop at he end of the tour. Would highly recommend a visit."
        }, 
        {
            "index": 374, 
            "rating": "4", 
            "review": "One of the biggest in Ubud. I actually did not really plan to visit this place, it was unplanned but I kinda like it. It's nice to see something different and actually I they have so many things to see and I never thought about it before..I got a lot of informaton about art and history which is actually very nice to know :)"
        }, 
        {
            "index": 375, 
            "rating": "4", 
            "review": "Nice collection. A nice collection of art from the past and present, nice grounds, good for a visit- please take down the endless pictures, rooms full, of the owner, Mr. Neka, not artistic but narcissistic, nice man but less is really more"
        }, 
        {
            "index": 376, 
            "rating": "4", 
            "review": "Beautiful art and paintings. We had the opportunity here to admire a wide choice of skilled realistic, figurative and asbtact local painters. We were highly surprised by the harmony, textures and interesting compositions from these fine local artists. This museum and others are a must to anyone visiting Ubud."
        }, 
        {
            "index": 377, 
            "rating": "4", 
            "review": "Surprisingly good.. It's a short list, but the Neka Art Museum is probably *the* museum to visit in Ubud. (Avoid the Rudana - like the plague.) First, the pros: the curation. Here, the history of Balinese painting - from the traditional wayang/Kamasan style, to the works of the so-called transitional era, to the prolific Ubud and Batuan schools of more recent years - is laid out chronologically in separate galleries, with explanatory labels in English, for both broad thematics and individual pieces. The walkthrough ends with several rooms of contemporary Balinese art, which runs the gamut from gestural canvases to abstract sculpture to the local Young Artists movement of the 1960s and '70s. There are also galleries dedicated to specific artists, the most prominent of which is probably Arie Smit, whose work fills an entire floor. (Anyplace else and Smit's brand of recycled Primitivism-meets-Impressionism-meets-Cloisonisme would look embarrassingly vapid - he was painting this stuff even into the '80s and beyond - but here he's a force to be reckoned with. God help the Balinese.) The Lempad gallery, on the other hand, while far more modest in scope, is a revelation. The small drawings which the master has become known for are both aesthetically unique (insofar as Balinese art history is concerned) and fascinating social documents, providing quirky, humour-laced insights into the everyday life of the island in the first half of the 20th century. In short, while the collection may seem a little uneven, the curation - of a surprisingly high standard for an institution of its kind, i.e. a provincial Indonesian museum - deserves a shoutout. Now, the cons: It's a bit of a trek from downtown Ubud. Unless you have transportation, hoofing it over may not be a good idea ... The lack of air-conditioning is also something of a distraction (although, to be here, most other museums hereabouts suffer similar issues). Otherwise, two thumbs up."
        }, 
        {
            "index": 378, 
            "rating": "3", 
            "review": "Nice Location. I liked that you could just walk in and stroll around the museum.I was told that it was the best art museum in town but I didn't have the same impression."
        }, 
        {
            "index": 379, 
            "rating": "5", 
            "review": "Had the whole place to myself. This is a good museum and it's not that big so it is not a huge time commitment. The collections are separated into different buildings and it is laid out to move you through time. The building is also worth a look."
        }, 
        {
            "index": 380, 
            "rating": "5", 
            "review": "An Important Collection. The Neka Art Gallery is set in a series of pavilions in a large garden compound. Each pavilion has a different theme showcasing different styles of art produced in Bali. There is traditional balinese art from several different \"schools\" based in different villages, the beginnings of western influence on Balinese artists, the work of some influential foreign artists who lived in bali, some fascinating photography, and a collection of contemporary art. Some of the works are wonderful, some less pleasing perhaps, but there is great importance in having a collection like this which reflects themes and developments and trends in the history of art in Bali. This is a most important cultural collection and should not be missed by anyone who has an interest in visual art"
        }, 
        {
            "index": 381, 
            "rating": "4", 
            "review": "Fantastic museum. They have a huge number of beautiful traditional daggers called kris. Interesting black and white pictures of Bali in the 1930s as well as beautiful oil paintings of Bali life. The museum is housed in several small buildings linked by paths through gardens. Worth a look."
        }, 
        {
            "index": 382, 
            "rating": "5", 
            "review": "Wonderful museum and grounds!. I ended up walking all the way there from central Ubud because I did not realize how far it was. I would not recommend doing that!\nBeautiful grounds and buildings. It was most enjoyable and the art works were very interesting and diverse."
        }, 
        {
            "index": 383, 
            "rating": "5", 
            "review": "absolutely worth a visit. A lovely mix of Asian and western art, set in pleasant gardens, a place for quiet contemplation and the appreciation of Bali's artistic heritage."
        }, 
        {
            "index": 384, 
            "rating": "5", 
            "review": "Great Indonesian Art. This is probably the best art museum in the Ubud area, and includes artists from various parts of Indonesia"
        }, 
        {
            "index": 385, 
            "rating": "5", 
            "review": "First introduction to Balinese art. Visiting this Museum is between the 2-3 first things that any visitor should do in Ubud - if there is any cultural aim in his/her visit.In the Neka museum you can see paintings, sculptures and photos of the traditional Balinese life and art. Most of the paintings are from XX century (not very old). It was during this century when Ubud became the cultural hub of the Balinese life, and many artists flourished there.And after visiting the full musem, nothing better than crossing the street and go directly the Putri Bali Spa for getting a good foot massage!!"
        }, 
        {
            "index": 386, 
            "rating": "4", 
            "review": "Worthwhile visit. This is a great visit to get a feel for the local art scene. If you stay at any of the Komaneka hotels you can get a free pass. Even so, I would pay to go as it's really interesting."
        }, 
        {
            "index": 387, 
            "rating": "5", 
            "review": "Interesting Varied Collection. There was a wide variety of art at this museum. I especially loved some of the more contemporary wood carvings and the pictures by Arty Smit."
        }, 
        {
            "index": 388, 
            "rating": "4", 
            "review": "Museum Neka, if you are interested in beautiful paintings.. Museum Neka has beautiful paintings. I liked the paintings of Bonnet very much. Outside there is a nice view over the valley. A good place to spend some time."
        }, 
        {
            "index": 389, 
            "rating": "4", 
            "review": "Cultural Oasis. This collection of paintings, sculptures, carvings and photographs is fascinating and enjoyable. The items on show are outstanding and must be amongst the best on Bali. The exhibits are well laid out and labelling is quite informative as well. There were only a handful of other people there which made for a very relaxed two or three hours. The surroundings are beautiful - typically Balinese.There is the usual souvenir shop - though we found this one worth a look. We were a bit disappointed with the cafe offering - though the view was great.Highly recommended for anyone interested in Balinese art and culture."
        }, 
        {
            "index": 390, 
            "rating": "4", 
            "review": "Great collection in beautiful surrounds. Lovely to escape the heat and stroll through the cool & quiet rooms of this gallery. The collection is well spread out and offers a wide variety of locally produced art from reknown Balinese & foreign Artists. Enjoy the calm as you stroll through & choose your favourite artist. Lovely garden setting."
        }, 
        {
            "index": 391, 
            "rating": "5", 
            "review": "Great Art museum, Old to contemporary Art!. You probably will take time to look around this museum at least an hour and if you are interested in Art, more than 2 Hours! this is great balinese art museum. Please try."
        }, 
        {
            "index": 392, 
            "rating": "5", 
            "review": "Good place to visit again. You can see various paintings here. If you aren't interested the painting, you still feel calm and comfortable atmosphere here even if just walking this museum Neka."
        }, 
        {
            "index": 393, 
            "rating": "4", 
            "review": "see of arts at ubud. neka art museum is at sangingan roads,front of nuris warung the entry gate to this museum .if you want to see the art ,more better visting this place and nice of collection inside ."
        }, 
        {
            "index": 394, 
            "rating": "4", 
            "review": "CULTURE AND A CUPPA. The museum's fabulous as a place to view and experience Balinese artistic expression. The restaurant's great for lunch or dinner ... or just for a coffee."
        }, 
        {
            "index": 395, 
            "rating": "5", 
            "review": "Wonderful!. Amazing collection of art, beautiful grounds, much better than the gaudy museum down the road! Definitely visit!"
        }, 
        {
            "index": 396, 
            "rating": "5", 
            "review": "To be seen. This is the perfect place one needs to go when experiencing Bali. It's lovely, informative, good for you, does not feel too educational or too institutional. The outdoor spaces are soothing. It's designed very much in the Bali spirit and makes for a wonderful afternoon or early morning."
        }, 
        {
            "index": 397, 
            "rating": "4", 
            "review": "Excellent collection or art in nice surroundings. We cycled up from Ubud town centre - a bit uphill but not too bad! The museum is reputed to have the best examples of Balinese art and didn't disappoint. We saw a wide variety of traditional paintings - many based on the aesthetic style of old puppet shows - through to those of the Ubud School depicting everyday life, and contemporary artists doing more abstract work. The Arie Smit collection was lovely too. Interesting sculpture as well, both traditional and modern. The setting itself was peaceful, set out among a quiet compound of gardens and pavillions. It was good to absorb something really Balinese, away from the tourist-centric Ubud town centre. Definitely worth a visit."
        }, 
        {
            "index": 398, 
            "rating": "4", 
            "review": "Best art gallery in Ubud. Very well laid out. Nice cool buildings. Good descriptions. Spend 2 or 3 hours there and don't miss the photographs."
        }, 
        {
            "index": 399, 
            "rating": "5", 
            "review": "Art Historical. a good overview of the development of art in Bali, so you leave w/ a historical overview of the development, esp. of painting, on the island. The KRIS collection is amazing, and I didn't think I would care much for just looking at \"knives\", ceremonial or otherwise, but these are fascinating and beautiful."
        }, 
        {
            "index": 400, 
            "rating": "5", 
            "review": "Excellent Balinese Art Museum. I don't know why there aren't any other reviews for this place. I think it is by far the best art museum in Ubud, perhaps Bali, but I can't really vouch for that. This is a delightful place to spend an hour or two."
        }, 
        {
            "index": 401, 
            "rating": "5", 
            "review": "Great!. Very interesting collection of Balinese work. It gives the visitor a wonderful overview of modern and traditional work. Bali is over 80 percent Hindu and in the museum it explains how their art and religion is completely intertwined and one cannot be without the other. We loved it. One and a half hours is probably all you need to fully enjoy it."
        }, 
        {
            "index": 402, 
            "rating": "5", 
            "review": "Lovely art museum: a FANTASTIC collection of keris!. A friend and I enjoyed our visit to this museum: I hadn't known of its existence before our driver Kadek told us about it, or I would have checked it out sooner.The photos and paintings are very interesting and informative. I enjoyed the whole place, but the special display upstairs of the traditional weapons, the kris/keris, was just mind blowing. Anyone who has an interest in knives, swords, damascene steel and the like would be riveted.It is astounding how many different named patterns of damascening can be found on just one blade- my favourite had five separate patterns on a blade that can't have been more than 30cm long.The displays were fascinating, the surroundings were quite beautiful and tranquil. Not a place for little kids, or people with mobility problems, as there are a lot of changes in level. Certainly not what a lot of people would regard as entertaining, but if you are interested in the history and aesthetics of Bali, I would say it is a must, along with the Puri Lukisan museum and the puppet museum, both of which are also in Ubud."
        }, 
        {
            "index": 403, 
            "rating": "5", 
            "review": "MIND BLOWING. A marvellous insight into the non-tourist Ubud. One of the best museums I have encountered in my many travels around the world"
        }, 
        {
            "index": 404, 
            "rating": "3", 
            "review": "A little dull compared to the other options in Bali. We visited Neka free of charge, as we were provided with entrance tickets through our hotel (Komaneka). Although some of the paintings were interesting, we were a little bored during the visit. We had planned to spend a few hours here, but were done in about 45 minutes/1 hour."
        }, 
        {
            "index": 405, 
            "rating": "5", 
            "review": "Interesting Museum. Very tranquil and beautiful buildings within glorious tropical gardens with such an interesting mix of art of the different periods in the history of Bali."
        }, 
        {
            "index": 406, 
            "rating": "4", 
            "review": "Mix of contemporary and traditional art. We loved the contemporary art at the Neka. The Museum is set in lovely grounds and is a good place to explore and get a feel for Balinese culture, through art."
        }, 
        {
            "index": 407, 
            "rating": "5", 
            "review": "A must. The art work here is amazing and beautifully presented, we are so glad to have made the effort to go. We even met Mr. Neka."
        }, 
        {
            "index": 408, 
            "rating": "5", 
            "review": "Immerse yourself. This is simply brilliant. For a taste of historic and contemporary art and culture, this is a must-see. Artistic, sensitive, well-balanced, insightful, I could go on... but if you are interested in Balinese sensibilities, this is a do not miss 1/2 day"
        }, 
        {
            "index": 409, 
            "rating": "5", 
            "review": "Great Collection of Keris. I loved the collection of keris, and fortunately had the assistance of an Indonesian gentleman who helped me with the relevant stories associated with that instrument. This art museum is very different to Museum Pasifika in Nusa Dua. For art lovers and/or people who appreciate Balinese culture, both museums are a \"must see\"."
        }, 
        {
            "index": 410, 
            "rating": "4", 
            "review": "Cultural History. I loved the detailed explanations of the art- it really illuminated the culture. The vintage photography room from the 40s was my favorite. Amazing to see how little has changed!"
        }, 
        {
            "index": 411, 
            "rating": "4", 
            "review": "History in Ubud.. A most interesting museum, beautiful buildings and history."
        }, 
        {
            "index": 412, 
            "rating": "5", 
            "review": "Balinese art. Neka gallery has a wide range of paintings from and about Bali - local artists and foreign artists who have influenced local art. It's comprehensive and has some truly beautiful stuff. It's also a beautiful place. Really worth a visit."
        }, 
        {
            "index": 413, 
            "rating": "5", 
            "review": "Time well spent.. 80 years of Bali art, much of it from Ubud. Allow plenty of time. I had 2 hours and it wasn't near enough. Had to go back the next day."
        }, 
        {
            "index": 414, 
            "rating": "5", 
            "review": "Need more time. We had 2 plus hrs to kill and we did not manage to see all the galleries! Such beautiful artwork on display! They depict the religious, cultural and even political aspects of bali life that we visitors take for granted! It was made even more enriching especially after we watched the evening dance performances! It made us appreciate some of the artwork even more! Although there were some recurring themes, the different artists had different interpretations which made it very interesting! In addition, the fact that it was not like a typical musuem (without the airconditioning and typical museum lights) created a unique experience for us! Highly recommended for avid cultural enthusiasts but do some prior reading/performance watching for further value add!!"
        }, 
        {
            "index": 415, 
            "rating": "5", 
            "review": "Neka Art Gallery: Important Venue for Indonesian Art. The Neka Art Museum is one of Bali’s most important venues for Indonesian art and art by international artists focussing on Bali. This place has several pavilions of paintings and some sculpture, most depicting village life and the everyday rituals and mythology of Bali. Traditional Balinese painting, like Buddhist and Hindu art I’m familiar with, is highly detailed, colourful, and representational, sometimes in a deliberately naïve style. Some of the contemporary Indonesian painting on view looked much like western painting from the 50s, some was reminiscent of German expressionism, and some more like Gauguin. [We were staying in the rice fields and, walking down the street towards the Neka, were also able to visit several contemporary art galleries and studios, the most interesting of which was the Sika Gallery of Contemporary Art.] Entrance to the Museum is 50,000 rupiah (about $5.50).After immersing ourselves in art, we felt a powerful hunger coming on and staggered out of the Neka and into Naughty Nuri’s barbeque house just across the street, where we munched on BBQ’d chicken and pork, along with several other art lovers. Both places are highly recommended. See more info and pictures here: http://lmaclean.ca/2011/10/ubud-art-music-and-dance/"
        }, 
        {
            "index": 416, 
            "rating": "5", 
            "review": "Beautiful museum. The grounds are lovely and the art is thoughtfully and well displayed. The wall signage is excellent and the explanations help in understanding the history of the art. It should not be missed."
        }, 
        {
            "index": 417, 
            "rating": "4", 
            "review": "Nice collection. a very nice collection, especially the traditional paintings!"
        }, 
        {
            "index": 418, 
            "rating": "5", 
            "review": "Biggest art museum in Ubud.. Many buildings housing art from different Balinese eras. Most are more modern. Also statuary and carvings. This is my favorite museum in Ubud. Allow several hours to see it all."
        }, 
        {
            "index": 419, 
            "rating": "4", 
            "review": "worth a visit. Good selection of classical Balinese style paintings, with good explanations, as well as more modern work. Very impressive exhibit of kerises with good interpretation."
        }, 
        {
            "index": 420, 
            "rating": "4", 
            "review": "Great gallery. I think this is the best gallery in Ubud. Well laid out."
        }, 
        {
            "index": 421, 
            "rating": "5", 
            "review": "Visual wonderland. Excellent Balinese art - very well curated in several buildings set in a superb, terraced garden. Great value including a welcome icy drink at cafe before leaving. A calming but energising place."
        }, 
        {
            "index": 422, 
            "rating": "5", 
            "review": "Excursion. Well worth a visit - beautiful buildings and very interesting exhibits"
        }, 
        {
            "index": 423, 
            "rating": "4", 
            "review": "Beautiful setting in lush gardens. In the middle of almost nowhere in Ubud, Bali, is this large art gallery which shows off local (and imported) talent. A walk through in about an hour will give one a very good appreciation of the beautiful artwork from local artists. I suggest you visit numerous top quality galleries after your visit to Neka - not before."
        }, 
        {
            "index": 424, 
            "rating": "5", 
            "review": "Must see art from Tempo Doeloe to now and do not forget to visit the KRIS-department. Beautiful paintings of Bali from the past and present. Inspiring pictures, paintings and a beautiful kris-collection."
        }, 
        {
            "index": 425, 
            "rating": "4", 
            "review": "Good introduction to balinese arts. There are a ton of different art alleries, art museums etc. in Ubud.But this is clearly the best one to get an overview of the development of paintingstyles in course of time in Bali. Also, the building and surroundings are quite nice.The museum is a bit far out of central Ubud, but I'd still recommend all Ubud visitors to go there, if they have the slightest interest in local arts."
        }, 
        {
            "index": 426, 
            "rating": "5", 
            "review": "Good collection. Good collection, in hot mornings and afternoon, it is better to call a taxi to go there even you are in the center of Ubud."
        }, 
        {
            "index": 427, 
            "rating": "3", 
            "review": "Good way to get a quick overview of Balinese art. I liked the contemporary art and Arie Smit rooms the best."
        }, 
        {
            "index": 428, 
            "rating": "4", 
            "review": "Great for a morning's outing. Took the kids here, there was just enough to look at without them getting bored and annoying. Lots of historical paintings, sculptures and a substantial weapons collection. Excellent view from the restaurant veranda over ravines and rice fields. Worth a look."
        }, 
        {
            "index": 429, 
            "rating": "4", 
            "review": "Worth a visit. We found this visit very interesting. It was great to see the introduction of many different styles to Bali over the years. We even met Mr Neka who started the museum many years ago. He is a very interesting man."
        }, 
        {
            "index": 430, 
            "rating": "4", 
            "review": "Very peaceful. This museum was quite interesting, such a contrast of art styles to look at. The gardens and surrounding grounds were beautiful. We received free passes from our hotel, nice way to spend an hour."
        }, 
        {
            "index": 431, 
            "rating": "5", 
            "review": "Too much to see in just one visit. Anyone with even a passing interest in Balinese art will find much to engage them in the extensive collection of traditional and contemporary art. Set in beautiful grounds, the Museum is organised in pavilions. I was particularly taken with the Batuan style, with intricate and humorous paintings that warrant many viewings. They have so much detail and wit that they are reminiscent of the best graphic novel art of the West. Give yourself plenty of time. The art of many of the Western artists who made their home in Bali is also on display. The Rp 50000 admission is well worth it."
        }, 
        {
            "index": 432, 
            "rating": "4", 
            "review": "For Ubud, a first choice. For the rest of the world, a good collection in an interesting building. In Ubud, it's probably the best thing in town. If you're in Ubud, visit this spot."
        }, 
        {
            "index": 433, 
            "rating": "5", 
            "review": "Great Overview of Balinese Art. A comprehensive collection of art that covers a lot of ground. There is plenty of commentary in English and Japanese to explain the works and help viewers understand their significance. I think this museum offers much better value, at the same price, than Pura Lukisan."
        }, 
        {
            "index": 434, 
            "rating": "5", 
            "review": "worth a visit for the architecture alone!. this gallery has a great selection of balinese art & also a room of arie smit who is a dutch man who has spent his life in bali. his work reflects the daily life perfectly! he has a great passion for the people which shows in his paintings! enjoy! also across from naughty nuris!"
        }, 
        {
            "index": 435, 
            "rating": "4", 
            "review": "Best Art in Bali.. Beautiful grounds and buildings filled with outstanding Balinese art."
        }, 
        {
            "index": 436, 
            "rating": "5", 
            "review": "Neka Neka. If you are in Ubud don't miss this place's collections, WoW!"
        }, 
        {
            "index": 437, 
            "rating": "5", 
            "review": "What a gem!. This place has them most amazing collection of Keris (swords) and other art. I spent a couple of hours here and loved it."
        }, 
        {
            "index": 438, 
            "rating": "5", 
            "review": "Balinese art at its best. A comprehensive survey of Balinese art with useful explanatory captions. The buldings and grounds are delightful in themselves. Free entrance (and shuttle service) if you're staying at any of the Komaneka hotels."
        }, 
        {
            "index": 439, 
            "rating": "4", 
            "review": "Outstanding. Great place to gain an understanding of Balinese painting"
        }, 
        {
            "index": 440, 
            "rating": "5", 
            "review": "museum. Very nice museum and there are always some dance group doing some balinese dance loved it."
        }, 
        {
            "index": 441, 
            "rating": "5", 
            "review": "The real history of arts and dance in Bali. Black and white photos as well as genuine paintings tell the story of how Bali's art and dance left the sacred space of temples and was made public - it is a great museum in a beautiful compound."
        }, 
        {
            "index": 442, 
            "rating": "4", 
            "review": "Lovely Museum. A great way to spend an hour in Ubud. I only wish that the traditional art section had matched the modern art section in scope, but never mind. And its a great excuse to stop in at Naughty Nouries across the road for the best BBQ in Ubud."
        }, 
        {
            "index": 443, 
            "rating": "5", 
            "review": "Fantastic, really requires more than one visit. There is so much here to see and take in. Excellent window on the varieties and depth of Ubud art."
        }, 
        {
            "index": 444, 
            "rating": "3", 
            "review": "easy walk through. good collection but one of many others in Ubud. the gallery in Tepi Sawah was equally good."
        }, 
        {
            "index": 445, 
            "rating": "4", 
            "review": "Art at it's best. The Museum was very interesting a great opportunity to see how Indonesian art had changed over timeI am always amazed at many of the paintings there is so much detail in them it would be interesting to know just how long it took the artist to paint the many figures shown in much of the work The museum is so much more professional than some of the quick art done and turned out in the galleries around the shopping areas in Ubud"
        }, 
        {
            "index": 446, 
            "rating": "4", 
            "review": "Large collection of paintings and other art works and well presented.. I spent an hour or two at the Neka Museum on a rainy day in December. There are a collection of buildings with some two stories and you will see everything by following the signs. I found the photographs most interesting and apart from the paintings there were some impressive wood carvings. There is also an impressive collection of keris upstairs in the main building."
        }, 
        {
            "index": 447, 
            "rating": "4", 
            "review": "Always great as Theresia are some good indonesian painters to see. Do go as it is worth to see. It will take you an hour of two max And in front you can have one of the best luches. Spareribs excellent. Good walk from THE center of ubud"
        }, 
        {
            "index": 448, 
            "rating": "3", 
            "review": "worth a look. Its an icon in the area for those interested in art. That said, its not a wonderful collection, but rather a collection of works of artists that were most likely handled by the owner."
        }, 
        {
            "index": 449, 
            "rating": "4", 
            "review": "Enjoyed. Did this as it was raining and was worth it - some lovely art work and surrounds."
        }, 
        {
            "index": 450, 
            "rating": "5", 
            "review": "Balinese Art Overview. Fantastic place to get a solid overview of Balinese painting and sculpture. Best gallery in Ubud."
        }, 
        {
            "index": 451, 
            "rating": "4", 
            "review": "A Huge Collection of Balinese Works. For a very small fee, you get to see a large collection of Balinese works. You get a sense of how the art had evolved over the years."
        }, 
        {
            "index": 452, 
            "rating": "5", 
            "review": "Indonesian art in a beautiful building , with superb garden surrounds. Saw early artworks through to modern indonesian art."
        }, 
        {
            "index": 453, 
            "rating": "5", 
            "review": "See the museums in Ubud!. Neka and other main museums (there are 3 all together) are small but very interesting. Make the time to see them."
        }, 
        {
            "index": 454, 
            "rating": "4", 
            "review": "worth a visit. some great art that gives a feeling of the island."
        }, 
        {
            "index": 455, 
            "rating": "3", 
            "review": "A good place to start. Ubud is also famous for its painting and sculpture art and this is the place where you can see how art in Bali evolved from time to time. if you love art, then this place is a must visit site."
        }, 
        {
            "index": 456, 
            "rating": "5", 
            "review": "The most comprehensive Museum in ubud. I think museum neka has the most variety Collection of fine arts. You can see the evolution of art in Bali from the very old crafts to contemporary paintings from local and international artists"
        }, 
        {
            "index": 457, 
            "rating": "5", 
            "review": "i love the NEKA gallery. this is my favorite art museum in Ubud. I like the grounds and usually if you go in the morning you will have all the airy rooms to view yourself. Really enjoyed all on view by painter Arie Smit, and overall a great collection of paintings in the museum, spanning the history of Balinese art. Excellent photography exhibit as well. Grab a drink and relax on the pretty veranda before heading out."
        }, 
        {
            "index": 458, 
            "rating": "4", 
            "review": "Good impression of Balinese art. Very nice museum with several beautiful works of art. Gives you a very good impression of Balinese paitinn and sculpture."
        }, 
        {
            "index": 459, 
            "rating": "4", 
            "review": "Bright colours. The paintings show the life and colourfulness of the people of Bali"
        }, 
        {
            "index": 460, 
            "rating": "5", 
            "review": "Magnificent overview of Balinese art + expat painters and their influence. Great introduction to Balinese art - with very helpful descriptions. Excellent selection of paintings, beautifully displayed. Pavilions are also devoted to various ex-pat painters, including Arie Smit and Donald Friend. We spent over 3 hours there - a very enjoyable visit. This is devoted to displaying a comprehensive selection of paintings in a permanent exhibition - it is not a gallery devoted to sales. so one can enjoy the art without hassle. I suspect going early in the day was a plus - in that we did have the place very much to ourselves!"
        }, 
        {
            "index": 461, 
            "rating": "5", 
            "review": "Just great - a must do. Do not hesitate. Just go. You will probably spend more time than planned. Great overview of Balinese art with some masterpieces. Wonderful atmosphere."
        }, 
        {
            "index": 462, 
            "rating": "4", 
            "review": "Extensive collection of modern Balinese artists. They gave an extensive collection of Balinese art with among others a large amount of the important works of Arie Smit. Former Dutchman who fell in love with Bali.\nWe spend almost 3 hours in the museum strolling through the different galleries. This museum was better than the ARMA."
        }, 
        {
            "index": 463, 
            "rating": "4", 
            "review": "perfect overview. perfect overview of balines paintings,\nclean, good light, no guards, only a few tourists\nenough info on the walls\nnice environment\nyou can combine this with visiting a few art shops in the street"
        }, 
        {
            "index": 464, 
            "rating": "5", 
            "review": "Excellent Introduction to Local Art and Art History. After reading about the various museums of art in Bali, this was the one that stood out to me as being the most interesting, and I wasn't disappointed. The Neka Art Museum isn't large (and doesn't appear to be at all handicapped accessible, just as a heads-up) but it is well laid out and very pleasant. While it was a little bizarre to wander around a museum whose \"climate control\" was open windows and verandas, it did make for a pleasant experience. The art was laid out roughly chronologically, with the first halls introducing the older styles of art, then showing how the art started to change and how that change was localized to different parts of the island. The last rooms showed an array of modern Balinese art, and also art done by foreigners who had come to Bali.If you have any interest in art and want a flavor of what the local art scene has been like for the last 150 years or so, this museum is well worth the visit."
        }, 
        {
            "index": 465, 
            "rating": "5", 
            "review": "Wonderful, wonderful art museum in Ubud. I visited the Museum Puri Lukisan and the Agung Rai Museum of Art (ARMA) which were both very worthwhile, but Neka Art Museum was the last thing I did in Ubud and I loved this one the most. It is open daily from 9am to 5pm and the cost is Rs50,000. It is located just a couple of kms out of town on Jalan Raya Sanggingan. If you are walking, just follow the main street towards Campuan, cross the bridge, walk up the hill and keep going until Neka appears on your right.Give yourself plenty of time as this is a wonderful and extensive collection. There is traditional Balinese work, Balinese and other Indonesian contemporary art, entire pavilions devoted to Arie Smit and I Gusti Nyoman Lempad, extensive displays of artists from abroad who painted in Bali and much more. I really enjoyed Abdul Aziz, Johan Rudolf Bonnet, Willem Gerard Hofker and Donald Friend and many, many others.The pictures are well labeled and well exhibited. This is an excellent collection."
        }
    ]
}