{
    "category": "Ubud", 
    "entity": "Ubud-Kajeng-Rice-Fields-Walk", 
    "avg_rating_stars": 4.507575757575758, 
    "review_count": 132, 
    "rating_stats": {
        "poor": 1, 
        "average": 8, 
        "terrible": 0, 
        "very_good": 46, 
        "excellent": 77
    }, 
    "reviews": [
        {
            "index": 1, 
            "rating": "5", 
            "review": "Keep Walking. If you just venture behind the JL Raya for 5 - 10 minutes then granted you will see some rice fields. Keep on walking though it's a really nice route it's not a difficult walk even for people staying in the middle of the rice fields it's worth doing."
        }, 
        {
            "index": 2, 
            "rating": "5", 
            "review": "wow go great view. this place is haven the view is never seen before good place to when weather in nice so can walk down"
        }, 
        {
            "index": 3, 
            "rating": "5", 
            "review": "Beautiful. A great way to wind down for lunch after sitting on a bus with average air conditioning. The views were beautiful, the staff were lively and the food was delicious."
        }, 
        {
            "index": 4, 
            "rating": "5", 
            "review": "Nature walks around Ubud. I love spend time to walk on this trekk. It takes about 2 hours walk and exciting.\nSome organic foods places while trekk here. Better sunset spot also from this track. Remember the motorbike often behind or in front of you."
        }, 
        {
            "index": 5, 
            "rating": "4", 
            "review": "Beautiful walk. nice walk through lush rice fields. Some artists and shops on the way where you can buy expensive souveniers. At the end of Ubud you can find Arjana bungalows - super location cheap and beautiful scenery nice bungalows."
        }, 
        {
            "index": 6, 
            "rating": "3", 
            "review": "Nice pictures but have seen more spectacular scenes. We took a ride on a motorbike a few km out of Ubud to the rice terraces. But for someone like me who as seen Baguio and Sagada in the Philippines, these terraces are pretty tame, not close to being majestic in scale, more just a nice stroll for some decent pictures"
        }, 
        {
            "index": 7, 
            "rating": "4", 
            "review": "Tranquil and beautiful. Lovely walk on paved paths- rice fields are stunning. Easy walk except for the heat. Beautiful scenery- artists and silversmiths along the way."
        }, 
        {
            "index": 8, 
            "rating": "5", 
            "review": "nice walk. Ubud is all about greenery and all about strawling around, this has been great time while walking and enjoying good view and sipping cup of coffee"
        }, 
        {
            "index": 9, 
            "rating": "4", 
            "review": "Early morning joy. Best to walk very early morning. The light is beautiful to make photos and the air is cool, nice to walk. It's pure joy to take in the sights and smells along the path. The rice fields are serene, soothing and peaceful to experience. Highly recommended."
        }, 
        {
            "index": 10, 
            "rating": "5", 
            "review": "Good walk. Good easy walk from main street of Ubud, takes about 15 mins to reach. We only took photos of the surrounding area didn't walk to far in off the rest of the fields. Good for early morning or late afternoon to avoid the heat and it's free."
        }, 
        {
            "index": 11, 
            "rating": "4", 
            "review": "last days of Beauty. If it would not be for the hundreds of Motorbikes driving nonstop this beautiful path, it would be one of the last walks in Ubud able to show what a rice-field walk should be. Unfortunately you need to step off the path every second to let a motorbike pass.Why is it called WALK? it is meant to be a clear air walk through what remains of a rice-field panorama, but greedy people just continue to build Villas, Hotels and home-stays along the path impeding walkers to have the pleasure of enjoying it."
        }, 
        {
            "index": 12, 
            "rating": "2", 
            "review": "Kajang Rice Firlds. Unless you absolutely have no time to go Ubud or other terrace rice padi fields else don't bother as it's really nothing special. Bali has many other more interesting padi fields."
        }, 
        {
            "index": 13, 
            "rating": "5", 
            "review": "Unexpected tranquility . Not far from the busy markets and noise of ubud you have this gem tucked away. We went be scooter (recommended) and had lunch at sweet orange which looked over the rice fields and made me not want to leave."
        }, 
        {
            "index": 14, 
            "rating": "5", 
            "review": "Breath taking Bali at its best . It may be only rice fields but WOW X it's a beautiful sight to see X we popped to a cafe and sat and enjoyed the views for as long as possible X there is a minimal charge to visit the location a matter of a couple of ££ I was thrilled with the place lots of tourist shops to peruse and places to eat. The place is currently deemed a unesco heritage site and it doesn't fail in taking your breath away X idyllic serene and a great insight to Bali culture."
        }, 
        {
            "index": 15, 
            "rating": "4", 
            "review": "Nice if you need a walk and to see some Green. I loved this place and went for a walk there most days, Its so green and nice, Also on the left when you enter there is a guy selling coconuts and he goes and picks them fresh for you and sometimes sells coconut oil and its the best i have bought in Bali. `i went to a warung to the left but it was nothing special and double the price of the local Warungs, But its not very big but good to see it take about 20 mins from central Ubud so its not far.Also bought a few things on my way up there some presents and clothes from the women on the left side they give you good prices and do not make much money as most people shop in the market, but i got very good prices from them better than the market and they are so nice. They all have families and children and sometimes i sat with them for a couple hours and ask them about family life in Ubud and they work very hard indeed. B=They are also very beautiful ladies. its the the first lot of stalls just before lotus meditation Centre. Jalan Kajeng is a very nice street and some cool places to stay and central ubud but very quiet. My favourite place to stay as i stayed here for 5 months.:)))"
        }, 
        {
            "index": 16, 
            "rating": "5", 
            "review": "A great walk through rice fields. It's great that this is easily accessible from Ubud town. Really nice to take it slow and appreciate the rice fields and scenery. The best would be to go in the morning or evening when it's not hot. The signs in Ubud are not easy to spot, as they look like all the other commercial signboards."
        }, 
        {
            "index": 17, 
            "rating": "4", 
            "review": "What a surprise.... Easy to miss the sign on the main street of Ubud, that takes you along a narrow path that opens up to the rice field walk...Such a surprise to leave the bustling town center and be in the beautiful country side in only a few minutes walk..."
        }, 
        {
            "index": 18, 
            "rating": "4", 
            "review": "A great escape from the busy city streets. Worth doing, and we found the walk out to sari organic cafe a bit nicer than this one. Both are good, we just preferred the other one. It's a great way to escape the busy city streets"
        }, 
        {
            "index": 19, 
            "rating": "5", 
            "review": "Absolutely beautiful!!!. 3 guide books had 3 different ways to get to these rice fields - very frustrating - but the path is actually easy to find and a short walk puts you in an amazing labyrinth of rice fields with an incredible system of irrigation. There is a sign at the alley entrance to the path next to the museum - between the museum and the street. It's marked clearly. A definite must: easy walk, huge contrast to the craziness of Ubud."
        }, 
        {
            "index": 20, 
            "rating": "5", 
            "review": "UpHill Walk but worth it. We where lucky enough to be staying on Jl Kajeng (The lane next to Starbucks) there are lovely views of the rice fields once you get up there, mind you it is about a 1km walk to the start of the rice fields, and mostly uphill. We had a scooter, so walked from our villa, but saw a lot of people walking up the slope out of breathe. The walk is lovely, great spot to take photos, don't forget your insect repellant, lots of bugs about, you come across plenty of Warungs for a drink, and also along the walk is located the number one rated restaurant in ubud Lux Cafe."
        }, 
        {
            "index": 21, 
            "rating": "4", 
            "review": "Enjoyable self-walking tour. Great place to while a way a few hours from the hustle and bustle of Ubud town. Started this walk at the alley next to Starbucks, stopping at the Sweet Orange warung along the way for refreshments. We continued until the path ran out, then followed a narrow track which ran around houses (not sure if it was right, but we eventually exited near Lotus restaurant!)."
        }, 
        {
            "index": 22, 
            "rating": "5", 
            "review": "Easiest and Most Pleasant Ricefield Walk in Ubud. Go up Jalan Kajeng to the top. The road is a subscription road, with every square meter having been purchased by individual families or local businesses at the time the cement was done. The road curves left at the top. Go up the hill and park your motorcycle and continue on foot out into the ricefields. If you are lucky with the clouds, you can see Gunung Agung on the NorthEast direction, or at least part of it. Along the way, local sharecropper farmers will be happy to climb a coconut treat to bring you a coconut. In about 40 minutes walk, if you bear left, you will find yourself coming down in the Campuhan neighborhood. Or you can of course retrace and retreat down Jalan Kajeng. Cold drinks at Starbucks where Jalan Kajeng meets Jalan Raya, or ice cream and cold drinks at the Lotus Restaurant next to Starbucks."
        }, 
        {
            "index": 23, 
            "rating": "5", 
            "review": "Worth the mosquitos . This feels like a secret escape from the \"hustle\" of ubud. Just a short stroll away from town, this gem is a free walk through the rice paddies right parallel to the town's busy and arty streets. Enjoy waking through the fields, see farmers at work, stop off at the rest spots to refuel if need be, get eaten by bugs, count the ducks hard at work, and just enjoy the fresh air."
        }, 
        {
            "index": 24, 
            "rating": "5", 
            "review": "Fantastic. The start of this walk is a little disconcerting. After a few minutes walking it opens out onto beautiful rice fields. The walk is pretty flat. There isn't much shade from the sun.There are a couple of warungs further along and we had lunch at the Sweet Orange Warung. A very peaceful place to eat lunch and take in the views.Would definitely recommend for those trying to escape the crowds and yet is still practically in the centre of Ubud."
        }, 
        {
            "index": 25, 
            "rating": "5", 
            "review": "Rice terrace in Central Ubud. wherever place you are staying in central Ubud ..you need a walk only 20 minutes to get here.Find a fresh breath and see how the local farmer living."
        }, 
        {
            "index": 26, 
            "rating": "4", 
            "review": "Experience a taste of the real Bali. This is a nice easy walk which you can take from either end as they both start and finish along the main Ubud road. If you go early enough, you can see the rice farmers starting their day, releasing ducks into the fields and herding them around. It can get busy in parts where motorbikes share the pathway but further along the path narrows and you will only pass other walkers as you meander around the rice fields."
        }, 
        {
            "index": 27, 
            "rating": "4", 
            "review": "Be careful after it rains. We entered the walk at the reportedly more scenic entrance, which is on Jl Raya Ubud just east of Museum Puri Lukisan and indicated by a small sign. The inclined pathway leading to the rice fields is very narrow, and because it had rained heavily 2 days earlier, the pathway was still very wet and muddy in some areas. Unfortunately, my teenage daughter did slip and fall in the sloped, slippery mud. The pathway later, while still only a few feet wide, had a very steep drop off on one side, so considerable care is needed while walking.Once reaching the rice fields, the walkway is very level and safe. We walked a loop through the rice fields and exited on Jl Kajeng road, which we walked on to get back to Jl Raya Ubud by Starbucks.The rice fields are very expansive. We went in the late afternoon, and saw the sunset over the trees in the distance. The temperature was cool at the time. At dusk, I was bitten by at least one mosquito, so wearing repellent is also advised."
        }, 
        {
            "index": 28, 
            "rating": "5", 
            "review": "Fantastic self walking tour in beautiful rice fields. This walk through the beautiful rice fields is well worth an hour of your time. It is quite amazing that such a beautiful place exists literally 10 minutes from the busy streets of Ubud. The farmers are working in the fields, and there are ducks and birds everywhere. And along the way there is a fabulous Café, the Sweet Orange Café (Warung). Time your visit to stop here for something to eat or drink. The food is awesome and it is so serene and quiet. To go on this walk, walk down the road between Starbucks and the Temple (Jalan Kajeng). It is a nice walk of itself. Keep following it until you walk up a small hill, and then you will be in the rice fields. After a while you come to a path that goes off to the left (and has a Sweet Orange sign). Follow this around and you end up back on the main road, about 80m down the hill from where you started. DONT miss this walk when in Ubud. It is well worthwhile."
        }, 
        {
            "index": 29, 
            "rating": "5", 
            "review": "One of my favourite memory's of Ubud. I LOVED this walk. We started on Jalan Kajeng and loved the paved road that led to the walking path. It's a lovely view of rice fields with friendly farmers working the fields then a bit of jungle (keep going, you haven't taken a wrong turn!). Just make sure you walk carefully as there are a few steep drops. Highly recommend stopping at Sari Organik for a drink/meal towards the end. Healthy & delicious!We walked reasonably slowly & stopped a few times to take photos and the walk took around an hour. A lovely way to see local Ubud."
        }, 
        {
            "index": 30, 
            "rating": "4", 
            "review": "Pretty, enjoyable, no guide required. This walk was very nice, you definitely don't need a guide. It's not particularly long. I ended up walking it 1.5 times because I didn't understand how it is laid out. If you walk up Jl Kajeng (very easy to find, street is labelled, the street has concrete pavers with messages written on the whole way) then you are already on the walk. You don't turn down any alley. You just keep walking all the way to the end of the street (a decent distance). When you get to my photo, go up where it says no car and the walk begins for real. Unfortunately I thought it was a dead end and turned around here and went all the way back and started from the other end, opposite Casa Luna restaurant. This entrance is clearly labelled rice fields and has about 150m of small paths before you get out to the rice fields"
        }, 
        {
            "index": 31, 
            "rating": "4", 
            "review": "Brilliant way to start the day. The rice field walk is best enjoyed in the early morning, especially if you like to take photos. People are around tending the fields, ducks are busy hard at work and there is even a little shop where you can grab a drink and relax. Incredible that this rural outlook is so close to Ubud but definitely away from the noise and madness."
        }, 
        {
            "index": 32, 
            "rating": "5", 
            "review": "Beautiful morning rice field walk . It's wonderful, free of charge, you can do it by yourself at you own pace and the entrance street from the main Ubud street is well marked. Just do it in the morning when it's not so hot!"
        }, 
        {
            "index": 33, 
            "rating": "4", 
            "review": "A sweet little walk just behind main st Ubud. This is a free self guided walk that takes about 40 mins to an hour depending on how many stops you make. I went at about 4.30pm to try an avoid the midday heat. Stopped for a cool drink at sweet orange cafe and watched sucks being herded from paddy to paddy. Also watched locals working in the fields. I walked clockwise and finished near star bucks. The entrance is marked but not that easy to see. The path is easy to follow. Worthwhile, especially if you don't want to pay big bucks for the tours."
        }, 
        {
            "index": 34, 
            "rating": "4", 
            "review": "No need a guide!. We needed up to 2 hours walking through the scenery rice field. Great view, friendly local farmers. If you are fond of rice terrace just walk wandering. Early morning is the best trip and you don’t need a guide to go there"
        }, 
        {
            "index": 35, 
            "rating": "5", 
            "review": "What an unexpected delight. When I wandered into Ubud this morning I couldn't work out why all my friends had sent me - the town seemed a bit average - so I set out in search of this walk. I did it backwards, starting out on the long unassuming road between the Starbucks and temple and was about to turn back when at the top of the hill, I found the most incredible sight. I spent at least an hour wandering around up there - going past the route marker before doubling back. The views are beautiful and it's so quiet and serene - hard to believe it's so close to the centre of town. A must visit in Ubud."
        }, 
        {
            "index": 36, 
            "rating": "4", 
            "review": "Short, level, picturesque. We did the walk in a clockwise direction starting near to and across the main road from Casa Luna restaurant. (Entrance isn't well marked, ask at Casa Luna perhaps.)Be aware, the first approximately 150 metres are very uninviting as you weave through a narrow lane with unsure footing. After getting through that bit however, it becomes much different, MUCH better.You amble along a decent path through verdant rice fields (hence the name!) and the occasional dwelling or warung (cafe), the latter providing a stop for refreshment or seated viewing of your surrounds. (\"Sweet Orange Warung\" looked particularly inviting.) The circuit isn't long and the whole thing took maybe 40 minutes or so, plus stops. The last half is not so picturesque southbound along Ubud's Kajeng Street through \"urban\" (?!?) Ubud meeting the main road next to Starbuck's.Relaxing and interesting without investing a lot of time nor effort."
        }, 
        {
            "index": 37, 
            "rating": "5", 
            "review": "Great for early morning walk or late afternoon to catch sunset. I have walked this many many times because it makes me happy. The first time was about 7 years ago; it has certainly gotten built up since then. However it is still lovely - and Sari Organic - an organic restaurant with an attached farm - is a favourite destination for delicious food and drinks as you view the rice fields. You can buy produce to take home. Don't miss it friends!"
        }, 
        {
            "index": 38, 
            "rating": "5", 
            "review": "Beautiful . Definitely worth the trip up to Ubud to see these beautiful rice fields, magnificent view from the top terrace. We didn't bother walking down as it was really hot and we didn't have a lot of time but just from the top was enough."
        }, 
        {
            "index": 39, 
            "rating": "5", 
            "review": "Peaceful. Nice place for a stroll early in the day or late of an afternoon. Grab a Starbucks on your way or after!"
        }, 
        {
            "index": 40, 
            "rating": "5", 
            "review": "Must see. Our tour guide took us through the rice fields and despite all the rain the view was still beautiful. Would good again for sure"
        }, 
        {
            "index": 41, 
            "rating": "5", 
            "review": "Great treat. We stayed along Ji Kejeng and it is a great walk with nice eateries along the way. Very nice walk and close to town."
        }, 
        {
            "index": 42, 
            "rating": "4", 
            "review": "Great find.... We found this accidentally while wandering the lanes behind the lotus temple. A fabulous walk, there are a couple of steep bits, and a couple of places that I found a tad hairy (mainly because I don't like heights) but these were over and done super quick & more than compensated for by the rice fields and gorge scenery. We stopped for coconut water (10,000RPI) and a little later for a beer.Well worth spending a couple of hours."
        }, 
        {
            "index": 43, 
            "rating": "5", 
            "review": "Thank you trip advisors for this one. I had seen the sign but taken it no further, nearly missed one of my best days so far. It is a bit of a walk but if you can, go. I had a coke at a little warung, watched stone carvers building a temple, was invited into a school to watch very young children learn to dance and sing, all this before seeing the paddies!! As I saw the first paddies a man, 54 and proud of it, climbed a tree to cut me a fresh coconut to give me a drink, 15,000. The paddies are beautiful. All this just minutes from the town. Will post pictures when I get home."
        }, 
        {
            "index": 44, 
            "rating": "5", 
            "review": "Check it out!. Maybe this is not as popular as tegallalang rice terrace among tourists but the scenic is simply stunning. I did exploring the terrace through path which is one of memorable experience in Bali. The small trek was inspired totally "
        }, 
        {
            "index": 45, 
            "rating": "4", 
            "review": "Great find. I read about this on TA & it was certainly worthwhile. Despite differing opinions it wasnt that hard to find: there's a road between Ubud Palace & Starbucks. If you have a bike or scooter, you can ride a fair portion of the way & then enjoy the walk thru the paddies. There are several warungs to quench your thirst. I can recommend Sweet Orange - buy a coconut face for 5 bucks towards local community works!"
        }, 
        {
            "index": 46, 
            "rating": "4", 
            "review": "free rice field experience.. difficult to locate. long walk from main road. not suitable for older people.. lovely experience. free!"
        }, 
        {
            "index": 47, 
            "rating": "4", 
            "review": "Local Rice Fields.. It's kinda amazing.From the lively streets of Ubud you walk into a small alley, around a wall and Poff!You're traveled back 30 years and are walking among rice fields, not on a large road, but a little pathway.After a while one or two cafes or restaurants pops up in the middle of the rice fields where you can enjoy a fresh juice of almost any fruit there is for as low as 15k and take a rest in the shadow while you enjoy the scenery and stillness."
        }, 
        {
            "index": 48, 
            "rating": "5", 
            "review": "Self walk. We really enjoyed getting out on the trails by the rice fields. It was quiet, breezy and refreshing after the noise and heat of the streets. You are never far from a spot to eat or drink and there are other accommodations/restaurants to check out as you wander, plus you see locals at work in their fields."
        }, 
        {
            "index": 49, 
            "rating": "4", 
            "review": "Tough walk. We went to Ubud to look at the rice fields and look a coffee plantation. We went down a very short way on the walk as it is fairly steep. I would suggest that you would need to be fairly fit, because when you get down and take it all in, you have no way but to start the trek up. It looks like hard work, and not for the faint hearted. When you are about to go down, keep an eye out for the old man where you can get your photo take for about 2000 ruppies and you can wear his hat and hold the pole and 2 baskets. Not a bad look. Otherwise it is very beautiful and great for photos."
        }, 
        {
            "index": 50, 
            "rating": "4", 
            "review": "NICE LITTLE STROLL AWAY FROM BUSY STREETS. This is a lovely little walk, either early in the morning or when the streets of Ubud become unbearably hot in the afternoon. Stop for a drink or a bite to eat at the friendly little Sweet Orange Cafe in the middle"
        }, 
        {
            "index": 51, 
            "rating": "4", 
            "review": "Beautiful. This place is a little hard to find. An alley leads up the hill to the rice fields. The walk is beautiful, the rice fields are abundant, verdant...a balm to the soul."
        }, 
        {
            "index": 52, 
            "rating": "5", 
            "review": "Peace & Quiet. Blink and your miss the sign but, worth finding. Walk 5 minutes past Ubud Palace, pass Starbucks, Lotus Cafe and you turn left down a very narrow alleyway. There's a small sign advertising the rice fields.It's about a 400 metre walk along a narrow walk way up some steps until you reach the main rice fields. A track runs through the middle. Local farmers tend to their crops and there's plenty of opportunity to see wild birds, insects and great photos of real Bali."
        }, 
        {
            "index": 53, 
            "rating": "5", 
            "review": "Beautiful walk through the rice fields. Just off one of the main roads was a sign for the Ubud rice fields. Following this sign we encountered and amazing view over some beautiful rice fields in the middle of Ubud. It gets really warm, but most of the walk is at least partially in the shade. There are at least two little cafes on the walk where you can stop for drinks."
        }, 
        {
            "index": 54, 
            "rating": "4", 
            "review": "A lovely, easy stroll off the beaten path. Highly recommended - great for young kids, beautiful scenery, and a slice of old Ubud. A really pleasant way to spend an hour during a cool Ubud afternoon."
        }, 
        {
            "index": 55, 
            "rating": "4", 
            "review": "Interesting Walk, Hard to Find. This walk will take you past many rice fields and farmers tending to their properties. There appears to be many different ways of accessing this walk and at times it is difficult to know if you are still on the right path. We walked for about 1.5 hours and only saw 2 other tourists in that time so if you are looking to escape the hustle and bustle of Ubud, this walk is perfect."
        }, 
        {
            "index": 56, 
            "rating": "4", 
            "review": "Another nice walk close to Ubud center. Though there is a lot of development compared to when I first began coming to Bali in '97, this is still a nice walk. You walk Kajeng street, round the bend, go over a bridge and walk up a hill to the ridge. There you go right along a small gang lined by coconut palms, you get the feeling of how Bali use to be. That is until you get to the new hotel that's been built. But even with that it's a beautiful walk where you can see reflections of village life. Roosters and hens, along with chicks roam freely. The occasional snake. The local Balinese tending the rice fields, the rice always at a different stage, so the feel is changing with the cycle of the season. There's a local selling fresh coconuts so do partake. The juice is delicious and best of all, nutritious. Others selling paintings or other things to earn some money.On a clear day you can see Mt. Agung (the navel of the world for the Balinese) on the right and on the left the mountain range that starts with Batu Karu and runs northwest through the National Park.Bali is even more wonderful when you get off the beaten track and it doesn't take much to do just that. Enjoy!"
        }, 
        {
            "index": 57, 
            "rating": "3", 
            "review": "A sample of the peaceful Balinese countryside. Some nice views of the rice paddy fields can be seen on this easy walk. 10 minutes in and I felt as if I was transported to a different world - a world that is the contrast to the crowded and noisy streets of Ubud. However having stayed in Sidemen (a small village about 1.5 hours drive away) before arriving in Ubud, I must say this walk was only a small sample of what quiet and peaceful can be. Highly recommend visiting Sidemen if you appreciate these scenery and want to have a real experience of the peaceful Balinese countryside."
        }, 
        {
            "index": 58, 
            "rating": "5", 
            "review": "Escape in the Rice Fields. I thoroughly enjoyed my walk in the rice fields. It was an escape from the bustle of Ubud.Walking along the main road of Ubud, you will come across a tiny whole in the wall with a sign that says Rice Walk. Peering down the alleyway you think this must be a mistake, trust me, it's not. This walk takes you into a dimension of peace and solitude. I completed the full walk which is easily indicated on one of the local tourist maps. It is marked with the dotted line and the full trek probably took about 4 hours with a bit of a break for lunch at Luxe Cafe. I encourage anyone to take this walk if you like nature. It will change soon, as they are already building more villas in the middle of this walk. Take this opportunity now before it changes too much."
        }, 
        {
            "index": 59, 
            "rating": "5", 
            "review": "Away from the hustle and bustle. We walked along Kajeng street to get to the rice fields. Lots of little stores to browse along Kajeng. Such a peaceful little street. Lots of motorbikes zipping along so be aware of that. Then you arrive at the rice field and it is so peaceful. So tranquil. It's so quiet and you can hear the swishing of the rice as the wind blows. There was an older Bali man playing the flute which just added to the whole experience. This was one of my favorite things in Ubud."
        }, 
        {
            "index": 60, 
            "rating": "5", 
            "review": "Mesmerizing. The view is just incredible. There are lot of shops around this area and i just loved this place for its simplicity."
        }, 
        {
            "index": 61, 
            "rating": "5", 
            "review": "My favourite walk. If you do the full loop this walk gives you a glimpse of every aspect of Bali from tourist developments to ricefields to jungle. I just hope this walk doesnt go the way of much of Ubud and becomes part of the tourist development program which seems to drain away all authenticity."
        }, 
        {
            "index": 62, 
            "rating": "5", 
            "review": "Must Go, Very Good, Beautiful walk . If thinking of doing the walk to the rice fields start at the Saraswati Temple and watch the lotus flowers and the beautiful temple. Then just start walking from there to the rice fields, it s a very nice walk you do the street up and at the top start to enter the rice fields. It s great to interact with the locals and see them work and contemplate the amazing rice fields. You find a few spots of pairing artists with beautiful paintings if you want to buy some. The walk can be long so try to avoid the hottest parts of the day. It's really worth it."
        }, 
        {
            "index": 63, 
            "rating": "4", 
            "review": "Morning Walk in Ubud - Rice Fields. While staying in Ubud, this is one of the must-do's in the area. Wake up early, wear enough clothes and start walking during sunrise. There are a lot of rice fields to visit on the way. Recommended for couples and honeymoon visitors!"
        }, 
        {
            "index": 64, 
            "rating": "5", 
            "review": "Secret paradise in Ubud central area. Only few steps from the entrance way you'll find the hidden paradise of Bali's nature. Do not waste your time at Campuhan ridge walk. Ubud Kajeng Rice Fields are far better.Come see it. Come feel it. This small but wonderful paradise is waiting for you.PS Sweet Orange Warung (restaurant) is highly recommended for food & drinks surrounded by terrace rice paddies!"
        }, 
        {
            "index": 65, 
            "rating": "4", 
            "review": "Famous rice fields. Ever receive pictures of rice terraces n your email? These might not be the ones you have seen, but they are pretty interesting. Don't just stand on the street and look across the valley at them. Find one of the few paths and venture to the other side and walk the fields. The trail is very primitive and you have to have good shoes and feel comfortable on uneven surfaces. Once down one side you cross a bamboo bridge for the climb up into the terraces. It's an adventure and you are sure to get your own scenic pictures."
        }, 
        {
            "index": 66, 
            "rating": "4", 
            "review": "Lovely walk. A lovely walk through the outer edges of Ubud. we throughly enjoyed walking this loop. Lovely views and an interesting path on the way back."
        }, 
        {
            "index": 67, 
            "rating": "4", 
            "review": "Refreshing . Best place to go for relaxing our eyes with the green colour of the rice fields. Best to do here is sitting and enjoy coconut while enjoy the rice fields..."
        }, 
        {
            "index": 68, 
            "rating": "4", 
            "review": "Rice fields. Had no idea rice could be grown on such steep terrain. Totally amazed even getting the rice to a road is a feat on its own. Spent about 30 minutes taking photos, still amazed when I see the photos"
        }, 
        {
            "index": 69, 
            "rating": "3", 
            "review": "DO NOT MISS!. beautiful way to immerse yourself truly into the local way of life and scenery. Early morning or dust is best time."
        }, 
        {
            "index": 70, 
            "rating": "5", 
            "review": "One of the Best Things I Did. At midday I had this walk virtually to myself which was a bonus but it was very humid. They are building villas right next to the path so a walk to do now rather than left for another trip. Great views, friendly farmers and fantastic food at Sari Organik. You don't need a guide."
        }, 
        {
            "index": 71, 
            "rating": "3", 
            "review": "R u interested in herbs? O rice quality. U need Atleast 2 hours for it.. So that u can walk around the whole field\nNothing interesting unless u r fond of rice quality , type of rice o herbs .. Uses of rice extra\nJust normal gardens\nMakes no point to go far just to view it from the top"
        }, 
        {
            "index": 72, 
            "rating": "5", 
            "review": "Relaxing easy sunrise walk. This is another easy waking option for all age groups. Mostly flat. You will walk among rice fields, with ducks taking morning bath, chickens waking up the neighbourhood, and occassional locals who tend to the fields. I recommend to see it now before it all disappears. It seems that every year there is more consteuction and the rice fields are slowly being unattended and converted into villas. Again, best taken at sunrise to avoid the heat and the crowds."
        }, 
        {
            "index": 73, 
            "rating": "4", 
            "review": "a beautiful, unique site. So classic for this part of the world, and so unique to see & photograph. This is perfect for photographers and those who can appreciate the unique 'rice culture' of Asia"
        }, 
        {
            "index": 74, 
            "rating": "5", 
            "review": "Amazing sights!. Walking the Rice fields walks of Ubud is an experience unlike any other. The terraced mountain walks are delightful and mesmerizing! It is a must do when in Ubud."
        }, 
        {
            "index": 75, 
            "rating": "5", 
            "review": "Dramatic views!. Tegallalang rice terraces have to offer some dramatic views. The vista sprawls down and away to the rice terraces on the slopes across the valley. A local elder, a farmer who owns the land invites visitors to sample his green coconut drink, as well as to purchase woven hats that he makes from coconut leaves as well as posing with visitors for a small fee. This ancient valley has a timeless quality whether there are tourists there or not! Must see."
        }, 
        {
            "index": 76, 
            "rating": "4", 
            "review": "A great walk, no tour guide needed. Just behind the main road of ubud you will find this magical place. Its a long walk but its surely worth it. you pass through plush rice terraces on a beautiful footpath with nothing but the sound of water trickling through the 900 year old technology aqueducts."
        }, 
        {
            "index": 77, 
            "rating": "5", 
            "review": "Rice fields. Wow there are so many ricefields was great to walk talk with people who are amazing. Also lots of temples nearby to visit and see the daily offerings. These people are so friendly and kind."
        }, 
        {
            "index": 78, 
            "rating": "5", 
            "review": "Excellent introduction and easy walk in to Ubud. Loved this walk in to Ubud from our hotel. Many little cafes and artists along the way and lovely ice cold bintnangs waiting in Ubud for lunch :D"
        }, 
        {
            "index": 79, 
            "rating": "5", 
            "review": "Beautiful — and on a clear day you can see Gunung Agung. Up above my former house (now a ruin), this rice field walk can provide on a clear day a lovely view of the sacred mountain volcano Gunung Agung. The local rice farmers are friendly, and would be pleased if you can buy a fresh coconut cut from a tree. As sharecroppers, they are economically disadvantages, and will appreciate if you can buy things they are selling."
        }, 
        {
            "index": 80, 
            "rating": "4", 
            "review": "Early morning walk in Ubud ricefields. We started this at the ramp off Jalan Raya Ubud leading to Sari organic around 7am and took about 2 hours to follow the path through the ricefields past increasing amounts of construction, new villas and hotels being built, through a more peaceful, almost rural setting and then back out near the start of Jalan Suweta into town. Total about 8k walk. Great walking early in the morning before tourist traffic steps up. There is nothing really open at this time but a lovely time to get a sense of villagers waking up and going about their daily lives. Fabulous escape from Ubud traffic at this time in the morning, only a couple of scooters going past until you get closer to town. Highly recommend especially before all the ricefields disappear in a frenzy of new villas!"
        }, 
        {
            "index": 81, 
            "rating": "5", 
            "review": "Nice walk close to town.. Hot, buggy but worth it. Good lunch and massage on way back to town. Great day! Lots of vendors selling things for less money than in town."
        }, 
        {
            "index": 82, 
            "rating": "4", 
            "review": "Amazing views, great people 😍. We visited the rice fields after hiring some mopeds from a local shop and using google maps to navigate. It was an amazing experience as we were able to see more of the countryside on route. It's definitely worth making your own way rather than using a tour guide but try to set off early as it gets very busy. There wasn't a big range of restaurants in the area so worth taking some snacks and then travelling to Ubud for some food!"
        }, 
        {
            "index": 83, 
            "rating": "5", 
            "review": "Beautiful easy walk through the rice fields with gorgeous sunsets. Short story:Ubud is well known by its art, rice fields and food. This walk pretty much joins all three into a single experience that allows you to see first hand the hardship life farmers have, the beautify of the scenery and the art these people can create. Truly inspiring walk; well worth your time before sunset.I highly recommend to do it close to sunset as you will get to see the rice fields with proper day light but also its beautiful transition into the golden hour to then the pink colours filling the sky. There is also lots of talented painters using traditional techniques to recreate the rice fields or their protector Ganesh (an elephant headed deity) reproduced with intricate details. You will also find some restaurants/cafe's were to take a seat to enjoy the view.Take with you plenty of water (about half to one litre per person), sunscreen (depending on the hour) and lots of mozzie repellent. Oh, and a flash light would be good as well as the road get irregular at times.Longer story:After walking up and down (or east to west) of Ubud at 4:00 - 4:30pm we decided to go for a short walk around the nearby rice fields in preparation for the \"Campuhan Ridge Walk\". One of the good things of staying in “Abangan Bungalow” is its close proximity to the entrance of the rice fields/terraces, so we took water with us, a little bit of insect repellent and off we went.The entrance does not look like much and you got to pay good attention to motorbike’s horn as locals will be travelling from/to the rice fields, but if you continue moving forwards eventually you will find yourself surrounded by some beautiful landscape, lots of rice, farmers working pretty hard to get their crops going (don’t take picture of them unless you are ready to pay some money), artists painting and some truly beautiful sunsets.If you go in December sunset will happen at some point between 6pm to 6:45pm, meaning you need to start walking around 4 to take a good look, find a spot where to look the sunset and grab a bite. I love photography, which made this walk even more enjoyable, the golden hour starts 15 minutes before sunset, giving you a different perspective of the landscape.Some restaurants/café around will provide mozzie repellent, but don’t count on it as there are plenty of people walking around and it goes quickly when it rained a few days before.Finally but not least, this walk gave us perspective… You (and lots of other tourists) are walking around right next to farmers, when done at the right time you see them wrapping up their day, meaning they get to get their shower/bath for the day right on the stream irrigating the rice fields, they do not have comfortable lives, water at home or money as the matter of fact, the rice fields are their source of income, food, water and enjoyment; yet they are happy when you walk next to them. Smile at them once and they will immediately smile back, say hi (they know few English words: hi, thanks, sorry, please and no-money are the common ones) and tilt their heads in a friendly way. We got to talk to some artists and farmers, really good people. If you want to get the human side of Ubud (and you should) talk to them, try to help them as tourists are their way of getting a life a bit easier."
        }, 
        {
            "index": 84, 
            "rating": "4", 
            "review": "Lovely walk. A nice and easy loop from the main road in Ubud. We went in the morning and there just us and a couple locals working in the rice fields."
        }, 
        {
            "index": 85, 
            "rating": "5", 
            "review": "A beautiful walk that can be done as a loop to enjoy different scenery on the way back. This really is a lovely walk to take, though try to avoid the midday heat and walk either in the morning or later in the afternoon. I was surprised by how quiet the route was before lunch - I passed far more locals on the route than I did tourists which was very refreshing. I did the walk as a loop up from the Starbucks (up Jl. Kajeng) then all the way up past Luxe Villas (the path gets much narrower after Luxe Villas and I thought I'd missed a turn), then continue along the path along a little stream and eventually it loops back around and joins up with the trail that goes past Sari Organik (well worth a visit) and then all the way back down to the main road coming out next to Abangan Bungalow (just up from the Campuhan Ridge Walk trail turning). In total the walk was just over 4km, and was very comfortable. The full loop took me around 1hr30mins, and it was at a leisurely pace. Pointless taking a guided tour."
        }, 
        {
            "index": 86, 
            "rating": "4", 
            "review": "Rice Fields. Beautiful views with people harvesting the crop. Maybe more info boards could be erected to give history and growing info to tourists. Local shops to wander around but it costs money to get into the village as a tourist - 400 each.When you get out into the country side on day trips you get to see lots of villages and rice fields also."
        }, 
        {
            "index": 87, 
            "rating": "5", 
            "review": "Lovely view. A tropical amazing experience. This was my first time in Bali and I enjoyed my stay very much. The rice fields were beautiful to see. You can also walk inside and go up we did it and had a nice view."
        }, 
        {
            "index": 88, 
            "rating": "3", 
            "review": "Nice walk. You do not need a guide to walk this track. It is easy to find and well pointed out in LP. Vieuw is ok.but the last year they build a lot of houses, spa's and even two bigg hotels in the middle of the sawahs. What a pitty. That means that the walkingtracks now have been used by motorbikes. There is nothing left from serenity."
        }, 
        {
            "index": 89, 
            "rating": "4", 
            "review": "A peaceful lane. Stumbled upon this lane after our visit to a water palace behind Cafe Lotus. The lane is broad and paved with stones with people's names on them. Walking down the lane while reading texts on the road can be quite interesting but we got bored after a while. The lane is quiet and peaceful unlike the other busy streets on the other side of the main road (Jalan Raya Ubud) so we decided we are gonna stay at one of the guesthouses of this lane for our next visit. Didn't know we would see rice fields if we keep walking. We actually turned back when we reached a junction as it seemed from google map that the road would lead to a dead end."
        }, 
        {
            "index": 90, 
            "rating": "4", 
            "review": "Morning Constitutional. My favorite Ubud walk is Campuen Ridge. The Kajeng rice field area cannot rival it for stunning beauty, but I walk here at least three mornings a week. Go for the sunrise and see volcanoes coming out of the mist. Lots of ducks, farmers working the paddy. As someone said, too much construction is ruining the area, like everywhere in the world, but still nice. You can go from Jalan Kajeng or follow Rice Paddy sign near the Lotus Cafe and temple along Jalan Raya, or further up towards Sari Organik and they can all be loops. I like to finish at Sari to see their beautiful garden and have a special morning juice. If you go further north one Km you hit a village. In the morning you see single file lines of tourists being led. It boggles my mind. Why pay for something that is both free and super easy to access, and who wants the distraction of being caught in a group? Okay I'm elitist, but that kind of tourism is a disease."
        }, 
        {
            "index": 91, 
            "rating": "5", 
            "review": "Spend a whole Day out there. This was one of my Highlights during my Bali trip. Such a nice nature and you will see a lot. If you have the chance stop at Nyoman the coconut man right at the rice fields. He's the best!"
        }, 
        {
            "index": 92, 
            "rating": "5", 
            "review": "Nice Terrace farming. Ubud is around 40km from Kuta Bali. We went to Ubud Rice fields for have a look at the technology they have invented to do the terrace farming. It is excellent! Yes you need to walk a lot to see the entire rice filed and that is a valley so lots of up and down is there. But at last you will feel that yes this is really unique."
        }, 
        {
            "index": 93, 
            "rating": "5", 
            "review": "Quite and Peaceful. The rice field foot path was a very quiet and peaceful walk. Great early morning and late evening stroll with excellent views of the rice fields. There are art stores down the path as well as eateries overlooking the fields."
        }, 
        {
            "index": 94, 
            "rating": "5", 
            "review": "Great walk highly recommended. Follow the directions as stated by a prior reviewer - right at Abangan Bungalows turn off west along Jl Rayan Ubud, then second left after the bungalows. A beautiful tranquil walk through beautiful rice terraces. Having done a number of walks around Ubud this is for me the top for an experience of being in the rice fields away from the hustle and bustle of Ubud. Highly recommended. My advice is to walk to the end and return the same way as the road walk back is pretty uninspiring. Enjoy."
        }, 
        {
            "index": 95, 
            "rating": "4", 
            "review": "Not what it was. In the past, when we have had guests staying with us in Ubud, we have taken them on this walk to show them the beauty of the rice fields. We normally start in Jl Kajeng which is a delightful small road leading north from the busy Jl Raya. This road is a delightful start to the walk. Unfortunately however the township is moving further and further up the path as more and more tourist venues are being opened and rate encroaching on the rice fields. Sadly some of these have been designed in a manner which is most unsympathetic to the rural setting that they are capitalising on and have created a few eye sores. Once you leave these behind the walk is peaceful and pretty enough but not what it once was. I recommend that you take this walk in the early morning before it gets too hot and there are too many others walking the track. Breakfast at the Sari Organic cafe on the return walk (after crossing the irrigation channel) is a nice reward for your efforts."
        }, 
        {
            "index": 96, 
            "rating": "5", 
            "review": "So peaceful. We had this walk pretty much to ourselves and it was a beautiful way to spend a few hours. It is calm, serene and gorgeous"
        }, 
        {
            "index": 97, 
            "rating": "5", 
            "review": "you can walk by yourself!. The ricefields are beautifull to see. But you dont need a guide!Walk Jalan Raya Ubud in western direction till Abagan Bungalows on the right hand side. Just befor the bungalows, turn right on a Climbing road. Take the second left (the first and the second are nearly together) and you wull have a good walk. After 800m there is the Sari Orgaanik farm and a restaurant on the left hand side: Warung Bodag Maliah."
        }, 
        {
            "index": 98, 
            "rating": "4", 
            "review": "Rice field lover. If you love ricefields and nature. You will love this route. Though the first part is a bit unprotected from the sun, th e middle. Is charming. Small path with many lovely warungs. I think you wont resist going into one as I did."
        }, 
        {
            "index": 99, 
            "rating": "4", 
            "review": "Terraced rice fields. Just a short walk up and down through some paddy fields. It was cheap to do although I objected to then be asked for a donation on the way. Short but some pretty views of the terraces. I am sure if travelling around Bali you could see similar elsewhere less commercialised. If you are around Ubud worth seeing but not worth too much travel time."
        }, 
        {
            "index": 100, 
            "rating": "5", 
            "review": "Quiet and beautiful walk. Kajeng street is a beautiful quiet street with great shops. If you keep going past the community center, you'll end up in the rice fields. You are still very near the central Ubud street but you feel miles away! Totally worth it. Take your time, soak in the atmosphere. It's very relaxing."
        }, 
        {
            "index": 101, 
            "rating": "5", 
            "review": "Beautiful Easy Rice terrace walk. You should do this around 5:00 when the light is really great. Its a short walk from around the Palace. Head up JL Kajeng at the sign for rice terraces. Its a little walk up the road until you get to a no car path. Follow that into the rice fields. You can then make the left turn before you get the Samara villas which will take you right through the fields and back to Ubud JL Raya. Lush beautiful rice paddys."
        }, 
        {
            "index": 102, 
            "rating": "3", 
            "review": "Peaceful morning walk.. In Indonesia, I started my day but earlier than usual. I got a scooter ride by my homestay to the starting point of the walk at 8 am. Walked along the footpath until you see a man who sells cold drinks. You need to get down and walk pass him on your right and turn left. Keep walking pass a bridge on your right. You will get on to Ji Kajeng and walk back to Main street or get a Ojek. I was back at 1030 am."
        }, 
        {
            "index": 103, 
            "rating": "5", 
            "review": "Pretty terraced green, lush rice fields.. Take a leisurely walk through the terraced rice fields. Very picturesque and serene. Nice way to unwind. Easy walk, but some gradual inclines."
        }, 
        {
            "index": 104, 
            "rating": "5", 
            "review": "Great exploring . Headed for Kajeng road after reading these reviews. It was great exploring through the rice paddy fields. You can see farmers tending to the fields and along the way there'll be places to buy coconuts or bananas from locals. We didn't just follow Kajeng road and kept following the path which makes a greater loop and takes you onto some thin dirt paths but once further in the views are even nicer and tourists more few and far between. We started on the Kajeng Junction closest to Ubud Palace and eventually turned the loop that crossed a small bridge when we saw a large remote abandoned concrete multi-storey building now occupied by locals but even then we saw a couple keep walking further in. We stopped for a massage at a small spa near the end with open rooms facing paddy fields during sunset which was amazing! Bring a torch in case you are still walking in the dark (Like us after the massages). The path is good but it's also good to make yourself more visible as there are many scooters going both ways so need to keep your ears open! Also say hi to all the people you pass, they were friendly and always acknowledged us with a smile and hello/nod (even the elderly man bathing in the irrigation water!)"
        }, 
        {
            "index": 105, 
            "rating": "5", 
            "review": "Excellent! 10 minutes walk from the Center fo Ubud!. This is wonderful way to see the country side, yet just minutes from the center of Ubud. Walk 700 meters through the quaint village on Jl Kajeng and you arrive in a green zone, no cars. Walk up the hill and you will feel like you have landed in another planet. Emerald green rice paddies surround you in every direction. A few sophisticated and rustic restaurants / places to stay are scattered among the rice field with vast spaces in between them. The walk takes you through a jungle and back into open rice paddies. Leisurely about a two hours walk though beautiful Bali nature. Go north on the path at one point and you can visit an organic vanilla farm that sells fresh vanilla beans. All in all a wonderful easy stroll."
        }, 
        {
            "index": 106, 
            "rating": "5", 
            "review": "Exceeded expectations. We discovered this walk towards the end of our Bali stay. We had already done the campuhan ridge walk several times and loved that. This was easily as good, if not better. It felt more remote and tranquil with beautiful views of lush rice fields. We were concerned we would get too hot as we did the walk between 10.30 -12, but the path was shaded and it was very pleasant. Highly recommended."
        }, 
        {
            "index": 107, 
            "rating": "5", 
            "review": "A walk to remember. This is essential is you are visiting Ubud. Walking through the rice fields is magical - the sights and sounds. Follow the paths as they lead into town and pass all sorts of unexpected delights - restaurants, artist's booths, an organic farm, and a yoga house to name a few."
        }, 
        {
            "index": 108, 
            "rating": "5", 
            "review": "Amazing. What an amazing place to visit. So peaceful away from the hustle and bustle of Ubud itself. Within a 10 minute walk from the main Street you are in the peace and quiet of the rice fields. We all loved it. Watching the people go about there daily work within the fields. Small cafe type place ell into the fields with great fruit juices and lemon grass and herbal teas. Would recommend this to every age group. Just loved it."
        }, 
        {
            "index": 109, 
            "rating": "5", 
            "review": "A must-do in Ubud. First off, Kajeng is a most charming street with so much less traffic than the other spots. Make a day out of this and stop for a spa at a charming little place right at the end of the street (very cheap, good quality...can't remember the name). Have lunch at either Luxe, Sari Organik or Pomengrante."
        }, 
        {
            "index": 110, 
            "rating": "5", 
            "review": "Nice & calm. Nice & calm walk - not too short, not too long.Paths are easy - even for five years old kid, as my son. Don't forget to take beverages & insects repelent (part of route leads throught the forest)."
        }, 
        {
            "index": 111, 
            "rating": "5", 
            "review": "Incredible. I absolutely loved this outing. The rice fields are amazing when you see them up close. They are truly beautiful and the surrounding shops and cafes are so different from downtown Kuta. A refreshing change and highly recommended."
        }, 
        {
            "index": 112, 
            "rating": "5", 
            "review": "See Ubud here as it is meant to be .... Ubud used to be a small village in the rice fields between canyons and river gorges .. And the terraced rice fields is what made it all worth wile to come \"up to Ubud\". nowadays you have to search for them.. Kajeng lets you experience the original Ubud."
        }, 
        {
            "index": 113, 
            "rating": "5", 
            "review": "A beautiful stroll in another world. Having left the Ubud city masses and traffic behind us and got on the trail through the rice fields we were hit by the beauty, peace and tranquility of the walk. We could hear a variety of birds but sadly saw few but saw lots of dragon flies. We only had an hour before our appointed meet with the taxi back to our resort in Jimbaran but wished we had several. It was like a step back in time with people working the fields, small buildings acting as home and shop too and smart ideas to keep the birds at bay from scarecrows to wind chimes. We'd have loved more time to browse and chat."
        }, 
        {
            "index": 114, 
            "rating": "5", 
            "review": "Wicked walk!!. Beautiful views at sunset, a nice evening stroll that doesn't take up too long. Very easy going, and a couple of lovely restaurants part way round!"
        }, 
        {
            "index": 115, 
            "rating": "4", 
            "review": "Serene experience. Did a walkthrough early in the morning with two kids. Fun way to spend some time before breakfast. The rice fields are very picturesque and quiet."
        }, 
        {
            "index": 116, 
            "rating": "4", 
            "review": "Take alternative route starting next to Puri Lukisan Museum. This is probably still the best rice field walk you can do staying from Ubud center. Having that said,we were a bit shocked how much construction work is going on in the fields destroying the beauty. The best alternative is to start not from Kajeng, instead look or ask for a small path next to Museum Puri Lukisan on main street. Use OSMand App for offline maps and download Indonesia map. The trail is in there. This alternative will meet the Kajeng track after 1km or so. Why choosing this route? Simply because it is more beautiful and more natural. Because of the narrow path at the start in Ubud no bikes are disturbing you on this route. For the same reason, there is no construction work on this part. Best rice field views close to Ubud! If you continue to the end, you pass one of th gorges and climb up to track leading back to Ubud via Sari Organic. Nice part at first. But the closer you cone to Ubud the more the buildings dominate the rice fields as an 'ugly architectural symphony'..."
        }, 
        {
            "index": 117, 
            "rating": "4", 
            "review": "When you need to get the heck out of Ubud, take a few steps toward Jalan Kajeng and. When the crowds of tourists make you feel like you've come to the wrong place, take a very short walk to Jalan Kajeng, turn right and within a very short time you'll be back in the Ubud you should be in, or used to visit. The pace of life slows right down, and you can walk for about 30 minutes to the north until the trail dwindles into a ricefield path. Trust me you'll feel refreshed and ready to face the hordes again, or you may decide to stay somewhere quieter."
        }, 
        {
            "index": 118, 
            "rating": "5", 
            "review": "A must-see in Ubud. Any visitor to Ubud should venture out among these rice fields. It's all so perfect you'd think it had been created by some resort designer at the cost of millions -- coconut palm-lined rice fields as far as the eye can see, birds everywhere, frogs and fireflies at night -- but this is just the real heart of Bali on display, and nothing could be more traditional. Pay a visit to Sari Organic and some art galleries on the way."
        }, 
        {
            "index": 119, 
            "rating": "5", 
            "review": "A rice field walk so close to Ubud to ignore. These rice fields are so close to the palace. A walk around the short path lasts about 45 minutes. There is a small Cafe!! On route where you can buy a split coconut for about 40,000 rupiah. A couple of the farmers keep cockerels so there is plenty of noise about half way round. A narrow path greets you towards the end but be careful of he drop into the creek as you approach the road towards the palace."
        }, 
        {
            "index": 120, 
            "rating": "5", 
            "review": "Absolutely beautiful. It was breathtakingly beautiful.The ricefields in the late afternoon sun is among the most beautiful things I have seen. The farmers were working in the fields and it was so peaceful to walk there. If you visit Ubud don´t miss this."
        }, 
        {
            "index": 121, 
            "rating": "5", 
            "review": "a walk through the ricefields. i did this walk alone and came across a few fellow tourists and a few farmers. it was so relaxing and peaceful. picturesque and wonderful"
        }, 
        {
            "index": 122, 
            "rating": "5", 
            "review": "Rice Fields in Ubud. This is so amazing to see and walk around. It is a must when you go to Bali. Wear comfortable shoes. We went on a dry day so we wore our sandals and had no problem."
        }, 
        {
            "index": 123, 
            "rating": "5", 
            "review": "Rice fields for days. The best walk. Fantastic views, watch your step. Great for morning before breakfast. Go at sunrise. The only bad thing is someone built a monstrosity in the middle of one of the rice fields. Another decade and Bali will be ruined with that sort of thing. (Illegal, degrades the land, ugly as sin, and no people actually live there, what fantastic rich people there are!). Go now, before the rest of it is ruined."
        }, 
        {
            "index": 124, 
            "rating": "5", 
            "review": "A walk in nature. Fabulous walk through the local rice fields. A lovely stroll away from the hustle and bustle of downtown Ubud. There are a few lovely cafes along this walk that offer great food and peaceful majestic views of the landscape."
        }, 
        {
            "index": 125, 
            "rating": "4", 
            "review": "Amazing Rice Field. In Ubud they grown rice in a different manner. People like me is used to see the rice field in plain land. But Ubud people grow rice in hilly area. Its a magnificent view of green rice terrain. You can choose one hillside restaurants and take lunch while viewing the nature."
        }, 
        {
            "index": 126, 
            "rating": "4", 
            "review": "A great photo op for any photog. It's a lovely walk and a great photo op for any budding or professional photographer. The place is almost a cliché now but it's still well worth a visit. Highly recommended."
        }, 
        {
            "index": 127, 
            "rating": "3", 
            "review": "It is a simple view type area. It is also located in Ubud. It is a small terrace type rice field, local people charge parking fee & some entrance for this area. Some very good restaurants are also loctated on the steps with a very good view of these fields..Vinod TandonDelhi"
        }, 
        {
            "index": 128, 
            "rating": "5", 
            "review": "Pleasant walk. I was only looking for the yoga house and ended up on this walk. It's beautiful and there were not many tourists around, the street is easily missed from the main street. Lovely views at sunset, had dinner at Sari Organik which was a great finish for the walk."
        }, 
        {
            "index": 129, 
            "rating": "5", 
            "review": "Great walk. Nice view. Good food on the way. Friendly farmers with big smile on the face. Flat . Go early on the morning when is not too hot"
        }, 
        {
            "index": 130, 
            "rating": "5", 
            "review": "Amazing worth the drive out there . If you want breath taking photos and an amazing view this is the place to head , it is a long drive from kuta or nusa dau but is sure worth the wait"
        }, 
        {
            "index": 131, 
            "rating": "5", 
            "review": "Go at sunrise. This is a beautiful walk to do first thing in the morning. I know it's hard when on holidays but set the alarm, you will find it worth it. Coming from Jalan Bisma you turn right, cross the road and look out for a small hand written sign that says ricefield walk. It is a narrow path between two buildings that can be slippery. If you miss that sign follow the main Jl Kageng as described by previous review. Greet the day, say pagi to the locals, watch the sun climb over the tops of the palm trees. It is on my to do list every time, and as often as I can whilst in Ubud and I never tire of it."
        }, 
        {
            "index": 132, 
            "rating": "3", 
            "review": "Nice walk. The walk starts at the T-junction, Monkey Forest Road and the main street Jalan Raya (Ubud Palace) and you walk towards Café Lotus and take the 1st street to the right. This is the Jalan Kajeng, you see the big cement tiles lying with the names of people from all over the world. (Ubud's version of Hollywood Stars Avenue). Keep following this road, after this it goes a little bit upwards. In the beginning you walk on the cement floor, after you see the first rice fields. Ahead you'll get a little irrigation canal with a concrete edge. Walk along the narrow concrete edge of the little irrigation canal. Walk further and you will see a bridge to the left of you. (Or the remains of a bridge, on the top right you see a building). Cross this bridge and go to the other side. At the top you will see an option to take a rest and you can buy a fresh coconut. Very tasty! Continue on the narrow path and see again the rice fields with the ducks that keep the fields clean. Ahead you'll at several restaurants among others Sari Organic. When you walk further, you come back on the main street of Ubud. Nice walk."
        }
    ]
}