{
    "category": "Las-Vegas", 
    "entity": "Rainforest-Cafe", 
    "avg_rating_stars": 2.6607142857142856, 
    "review_count": 112, 
    "reviews": [
        {
            "index": 1, 
            "rating": 2, 
            "review": "2 stars is about right. Other than the nice decor and settings there is little to desire.\n\nWe went through the typical 1 hour wait to be seated, then 30 minutes waiting for food. And food was terrible, blend and rubbery, even the chocolate lava that kids crave didnt come out right, too sweat and watery. These kinds of crap for $29 per dish?\n\nThe only delight besides decor was the folks bringing kids balloons and tricks with twisting them."
        }, 
        {
            "index": 2, 
            "rating": 2, 
            "review": "Very slow. Food was just okay. Took forever to do anything. I've never seen anything like it. It's not as good as the one at Disney either."
        }, 
        {
            "index": 3, 
            "rating": 3, 
            "review": "Much better than I expected. I stopped here with family while we were on the strip and needed a child friendly restaurant indeed I was not expecting too much but I was actually impressed that the food was better than expected. I wouldn't have come here without a family with children to eat by myself.  However I will recommend it to families with children their father himself from the strip and need and entertaining environment along with better-than-expected food for a theme styled restaurant."
        }, 
        {
            "index": 4, 
            "rating": 5, 
            "review": "Came here last night, our server Jimmy was great and the food was good. We got the clam chowder in a bread bowl and another appetizer for a light late night bite."
        }, 
        {
            "index": 5, 
            "rating": 5, 
            "review": "What a great time we had. We have been coming to Rainforest Cafe in Las Vegas for 15 years. We always have a good experience this time was no exception. We were treated so good. Seated quickly and Douglas our server was great. We were even allowed to order a dish that is no longer on the menu. It was a dish we love. Thanks to everyone being so nice on Black Friday."
        }, 
        {
            "index": 6, 
            "rating": 2, 
            "review": "we used to love this place,been customers for years. called and made a reservation today, and they neglected to tell us that they changed locations. we valeted at mgm and walked half mile through the casino to find out that they weren't there anymore. thanks for ruining the day."
        }, 
        {
            "index": 7, 
            "rating": 1, 
            "review": "We have a rain forest cafe close to home and the service has always been great as well as the food so we decided to try this one out. To start we and one other table were the only people in the dining room I should have taken that as a sign. Our server took about 10 minutes to come wait on us by then we were ready to order drinks and food. Then 20-25 minutes went by still no drinks or appetizer was brought but then EVERY thing was brought out at the same time my burger was burned so black I took one bite and didn't eat any more the server wasn't concerned at all. Do not go to this place if your in Vegas so many other amazing places to eat on the strip"
        }, 
        {
            "index": 8, 
            "rating": 1, 
            "review": "If i could give negative stars i would. From start to finish it was horrible. It was my nieces birthday so before they arrived i let the hostess know we had a birthday girl, that we wanted to add the volcano dessert. when we were finally seated they took almost 20 mins to ask us for our drinks. my brother in laws mojito had zero amount of alcohol. the waiter gave him an attitude rolled his eyes and then replaced it. we asked the birthday girl what she wanted to order. the waiter snapped and said i can just come back and started walking away. we had to call him back because we were already ready he just couldnt wait for two seconds for the little girl to order. He got my sisters salad wrong but she ate it anyways since we had already been waiting for so long. then he brings us the check. so we reminded him about the birthday dessert that we wanted to surprise my niece with. which now the surprise was ruined. so for every other birthday at other tables over 6 or more waiters would go sing. when they came to our table it was our waiter and one other. please dont go here!!! unless you like over expensive food and getting treated like garbage"
        }, 
        {
            "index": 9, 
            "rating": 5, 
            "review": "Roast beef tender.  Big portion.  Ordered calm chowder to go with it.  Excellent meal.  Fun atmosphere."
        }, 
        {
            "index": 10, 
            "rating": 4, 
            "review": "I took the kids here expecting to suffer through it all. But it was really enjoyable. The kids love it and the food has improved a ton since the last time I came here."
        }, 
        {
            "index": 11, 
            "rating": 5, 
            "review": "Great burgers! I did not like my order, so they fixed it at no charge! The storms are great!"
        }, 
        {
            "index": 12, 
            "rating": 3, 
            "review": "The Rainforest Café is just a gimmicky restaurant but it's a fun place.  During your meal, the animals along the edges come to life.  In the middle of the restaurant are visible stars of the night.  The different animals make noises, moves and the restaurant is alive.  Our waiter was attentive.  I ordered a sandwich and my daughter ordered from the child's menu.  My sandwich was ok but my daughter's pizza looked like a frozen pizza that was heated up.  Nothing special about the kid's menu.  She had the fruit, which was a handful of grapes and I had the fries.  Our waiter came and refilled our drinks.  We went before the dinner rush.  It wasn't crowded when we went for dinner and we were able to get a table pretty quickly.  I did notice that there was a waiting room full of people when we were leaving.  The downstairs is the giftshop.  I do like the alligator (or is it crocodile?) in the \"swampy\" area as you walk in.\n\nGiven the choice, don't sit outside.  Sit inside.  For the most part, you're paying for the rainforest experience and you'll miss out on it if you sit outside.  You're not coming to this restaurant for the food."
        }, 
        {
            "index": 13, 
            "rating": 1, 
            "review": "Took my son for a special dinner, and I have to say if he didn't love it so much I would have been pissed off. I had made reservations since it was Valentine's Day and I wasn't sure how busy they were going to be. During the call I requested to sit outside which they said no problem. When we arrived they sat us inside, I asked if it would be a problem to go outside since my 3 year old was asking. The hostess rolled her eyes and told me she guessed that was fine but I'll have to wait a long time for a server. She wasn't joking after almost 15 minutes someone came and took our drink order. The drinks then took another 10 minutes. Once we ordered our food I asked for an app of chips and guacamole. The food took 56 minutes! And the chips never came out by this point we were starving! Our server rarely visited us, took forever to get our refills and was just so nonchalant and mind you the place was empty! At the end of the meal I asked if he minded taking a picture of the two of us. He left for 5 minutes before he came back. By that point another table had offered to take it for us. I'm glad my 3 year old enjoyed it but I was disappointed. Such a big corporation like Landrys should have way better staff! I'm only giving it a star because the atmosphere is way better than the old one at the mgm"
        }, 
        {
            "index": 14, 
            "rating": 5, 
            "review": "Great time. Our server was Jimmy. He was the most funniest guy ever. He made our time more enjoyable. The food was good. Expensive but what do you expect for the strip? The food kind of took a while but the place was packed. We will return."
        }, 
        {
            "index": 15, 
            "rating": 3, 
            "review": "The theme was fun and our daughter loved it. The food was mediocre at best and overpriced. Our waiter was annoying and just seemed to be going through the motions. It was fun for a one time thing, but we wouldn't go again."
        }, 
        {
            "index": 16, 
            "rating": 1, 
            "review": "Been to a few Rainforest Cafes, Downtown Disney Anaheim and DisneyWorld. Was looking foward to celebrating my sister's birthday here, should've looked elsewhere! The place is tiny! 1/10th the size of other locations with only rundown 5 animatronics at most. \nThere was maybe 7 other guests in the entire place with 3 servers, 1 hostess and 2 table boys. You would think service would be on top right? Wrong! Slowest service I've ever had! Had to practically beg for refills. Never got extra napkins and to top it all off you think they would've for the 4 of us to be present when they brought out the cake, nope! Two were in the bathroom.\nNot to mention it took 30 minutes to get the dry cold food and another 20 for dessert.\nDon't waste your time or money here! Very disappointed, looked forward to it the entire trip."
        }, 
        {
            "index": 17, 
            "rating": 1, 
            "review": "I didn't even get to try the food here. The restaurant was completely empty and we were told  needed to wake up our disabled baby to remove her from her stroller because strollers aren't allowed. I suggested just pushing her into the corner next to our table. Our waitress with a straight face said someone might get seated at the table next to us IN AN EMPTY RESTAURANT! DISGUSTING"
        }, 
        {
            "index": 18, 
            "rating": 1, 
            "review": "WORST SERVICE I HAVE EVER HAD. EVER. My reservation at 7 that turned into a 3 hour dinner.... are you kidding me?\n\nThe place is cool and all, I used to go to the one at MGM when I was in grade school but this was disgustingly terrible. It took us literally 30 minutes to order because the server kept leaving the table after we ordered..... It took 45 minutes for ONE appetizer between 12 people to show up and our cocktails weren't even out yet! Are you kidding me???? Then after a hour and a half after me complaining twice wondering where the hell our food was another 20 minutes rolls around and they start giving out the food SLOWLY, like not even in one sitting!? In the first wave of food they literally gave my friend her dinner salad and our food didn't come out until an hour after her salad. They gave out food to 12 people like in  10 minute increments. Are you freaking kidding me? The food was okay, and seriously so overpriced. but WTF seriously guys? Get it together... worst service I've ever encountered in my 22 years of life. I SERIOUSLY SAT THROUGH 8 \"RAINFOREST\" SHOWS MY WHOLE TIME THERE. F this place. Stay away at all costs.\n\nProbably the worst birthday dinner I've ever had."
        }, 
        {
            "index": 19, 
            "rating": 2, 
            "review": "First time going to any Rainforest cafe, the setting is awesome!! But sadly my experience wasn't so great.. \nI made reservations 24hrs in advance for my party, who ever I spoke to on the phone was a great help and they even took a note saying I was celebrating my mothers birthday.. As we arrived we where greeted by the very happy hostess which was another good start. But when it came to ordering our waiter never gave us his name, took our order and left. He never returned until a good 40 minutes later to get our refills. When he came back he dropped our drinks off and left. He never came to check on us while waiting for our food or came to tell us that the kitchen was behind. We waited a little longer then an hour to get our dinner, that arrived at 8:20. We didn't order appetizers and half of our party where children, so the orders where pretty easy and small. After we got our food we ate and talked. Waited around for the check, assuming the waiter would do a birthday celebration like they did for the other 10 tables being served, he never did. Why ask if I'm celebrating anything if you aren't even going to acknowledge when we are there, why we came in the first place? The manager I happened to speak with after my dinner was extremely apologetic and told me she would have a talk with her employee, she also said that she saw the note on my ticket for a birthday and doesn't understand why he didn't celebrate for us.  I spent over 100$ for dinner and the customer service was the worst I ever had. Another problem I had was with the bussers walking around clueless with plates of food. Not knowing where they were going.  All in all, I would not recommend this to anyone anytime soon, the staffing or training needs to change/improve."
        }, 
        {
            "index": 20, 
            "rating": 3, 
            "review": "Very entertaining place to eat. The animals move and the occasional thunderstorm rolls thru. The food was pretty good as well. It definitely feels like a kids restaurant but the menu is made for kids and adults."
        }, 
        {
            "index": 21, 
            "rating": 5, 
            "review": "Took my family here to celebrate my son's birthday. We have been to the Rainforest Café at Downtown Disney and in Tempe, Arizona and always enjoyed it. I read the reviews and ALMOST did not come here thinking it would be horrible and a waste of money but we are super glad we came. We were sat right away, service was excellent and the food was good. Hubby had the Luau platter, it didn't quite look like the photo on the menu but was very tasty. The kids all had a great time and my son loved his lava cake, our server Bill was great.  We went on a Sunday approx. 4pm. Would definitely go back."
        }, 
        {
            "index": 22, 
            "rating": 5, 
            "review": "Andre was an amazing server tonight! He made my mother in laws birthday tonight awesome! Excellent service and food! Thank you so much for looking out for us tonight and making her feel extra special! Awesome experience!!"
        }, 
        {
            "index": 23, 
            "rating": 5, 
            "review": "Honestly, I just came here because I saw the outdoor seating. You get an amazing view here, I have no idea why you'd want to sit inside. \n\nAnyway, I've only seen a Rainforest Cafe once before and it was in a mall so I figured it was kind of crappy. The food was actually pretty good with a lot of seafood options. They also let me walk in with a drink without making me discard it.\n\nI would definitely recommend this place for the view and the food!"
        }, 
        {
            "index": 24, 
            "rating": 1, 
            "review": "This place sucks so bad. I don't even know why people bother coming here when there's plenty of better choices around it. \n\nThe food here is so over priced for basic American food that I thought I was going die looking at menu. I went for a birthday and they wouldn't let our party sit down until everyone got there. \n\nOh god. When it came to ordering that was a disaster. Our server took my order and then walked away? Even when he came back five minutes later, it took him literally 20 minutes to get everyone's order. There was 11 of us...\n\nONE HOUR AND HALF LATER...\n\nI was the only one that got my sad soggy little island Caesar salad $7. No else got their food yet. Then slowly we got nachos and then that's it! No ones drink even came yet. So the birthday girl complained and their excuse was \"they wanted us to get our appetizers first\". Okay that's a lie. There was only two of us that got appetizers. Also our waters were never filled either! \n\nFinally one by one, every 5 minutes, the food was finally coming out! I got my chicken tenders $10 and it only came with 3 pieces? The buffalo sauce tasted just like red hot. \n\nWhen we got checks, our server just put all 11 checks on the center of the table. Too lazy. \n\nThis place is a tourist trap and I will never step foot into a rainforest cafe ever again."
        }, 
        {
            "index": 25, 
            "rating": 2, 
            "review": "Not the greatest - food was extremely mediocre for the price - things take a very long time. Our server and the manager were very kind so I added a star for that. Just would never eat here if I could help it.  Ive had better Mahi from Costco in the frozen fish. The shrimp was worthy of a fast food place. Everything was cold. Only other highlight was my 7 year old loved the decor"
        }, 
        {
            "index": 26, 
            "rating": 1, 
            "review": "If you could leave a zero star I would.  Took 20 min to sit when no one was in the place.  Lady forgot about us.  \nFinally sat down and Doug stopped by to tell us he'd be back to get us drinks.  15 min later I had to find he manager Robert to take our drink order.  10 min later Doug shows with our drink orders and no apology.  \nAfter waiting 25 more minutes for food we got up and left.  This was so much better when it was at the MGM. \nTry waiting an hour with hungry 3 year olds that long forest cafe."
        }, 
        {
            "index": 27, 
            "rating": 5, 
            "review": "5stars only because of Jimmy. A dinner and.a.show. He is an incredibly funny waiter. You have to.ask for Jimmy.\nHe made us comeback. Kids had a blast with all the trivia he had for them."
        }, 
        {
            "index": 28, 
            "rating": 2, 
            "review": "First of all, for locals - the location sucks!  Its really difficult to get to.  Its is at one of the most busiest and difficult intersections for both pedestrians and cars. \n\nWe parked at the Miracle Mile parking lot which is basically at the back of the property... then walked through and exited the Miracle Mile Mall, then had to go up to the pedestrian bridge to get the Rainforest cafe.  THERE IS NO OTHER WAY TO GET THERE!  The Miracle Mile parking lot is crazy busy.  And there are a lot of \"questionable\" people just hanging around in the parking lot.  Also going up the elevator to get to the pedestrian bridge... ran into a security guard escorting a totally drugged out guy that looked like he was about the heave.  Not exactly what I wanted my kids to see.\n\nSo we get there.  There is about a 30 minute wait.  With two restless kids this is tough.  When we finally get seated... half the restaurant is empty!!!  Why the wait?  They were short-staffed, and the kitchen was backed up.  After ordering, food was up after about another 30 minutes.\n\nThe food was actually pretty good.  I ordered a grilled chicken sandwich which was excellent.  The fries also good.  Kids meals were decent.  We also ordered some kind of avocado burger which was also pretty good.\n\nThe prices though were crazy.  I'm not sure if it was because it was located on the strip, or if it was just because it is a Rainforest Cafe.  The decor is neat... for the first 10 minutes, then it feels mundane.  Between the prices, the wait time, the location... I think I will pass the next time.  There are easier and more convenient places to eat."
        }, 
        {
            "index": 29, 
            "rating": 4, 
            "review": "Went here for breakfast and this place is really cute. I got the oatmeal which came with toast and a lot of fruit. Very filling and one of the cheaper places I've eaten so far. Definitely kid friendly with all the rainforest decorations, electronic animals, and a simulated rain storm."
        }, 
        {
            "index": 30, 
            "rating": 2, 
            "review": "The Cobb salad had brown lettuce and was tasteless. The chicken was tender but entirely tasteless. The Salmon was overcooked and tasted like it was cooked from frozen. The brown rice it came with was undercooked and had dried pieces of rice in it. At least the waiter told some funny jokes."
        }, 
        {
            "index": 31, 
            "rating": 4, 
            "review": "Real nice atmosphere. Inside and outside seating. A nice place to bring your kids. \nI been there 3 times. For breakfast and lunch. Egg poach for breakfast and Salmon for lunch are on point. \nService getting into the restaurant is a little shaky. The guy that welcomed me into the restaurant on two occasions was not polite.\nAsk for Arelly as your waitress. She was wonderful, polite, quick and knows how to treat customers. \nI visited on a Sunday afternoon and didn't understand why I had to wait 15 mins for a table upstairs and downstairs was empty. There was no waiter at the bar. The non polite guy said the waiter was upstairs. \nI will return and recommend to friends."
        }, 
        {
            "index": 32, 
            "rating": 5, 
            "review": "Warning!- the restaurant is no longer in the MGM- it moved down the strip to 3717 Las Vegas Boulevard South.\nThis review covers their 2016/2017 New Years Eve party ONLY.  The location was perfect for watching the fireworks. The restaurant was not over sold so there were no lines at the buffet  or bar.  The entertainment was a hoot (shout out to Dustin Balloon guy & Michael the Magician). Also their female manager spent the night hustling and making sure the party ran smoothly. This was one of the few rocking parties on the strip that would could bring your children to.  We will definitely go back next year!"
        }, 
        {
            "index": 33, 
            "rating": 1, 
            "review": "Service is horrible and management needs training on how to approach a table when there is a problem....NOT \"hi what can I help u with?\" \n\nWorst customer service! The story is to long to even type....it's horrible"
        }, 
        {
            "index": 34, 
            "rating": 4, 
            "review": "I came to this rainforest cafe with 12 people in total. We made reservations the day before and called the day of the dinner just to re confirm. This is a new location. The old location was inside of the MGM. Now I guess I can say I have been to both. \n\nHere's the deal. I have been to the old rainforest cafe in Vegas and the locations in Atlantic city,FL and NYC. There all pretty solid. I recommend bringing kids here. The ambiance is truly what you are paying for. The kids will love it. We had no children with our group. Just big children lol. \n\nThe staff was very nice and accommodating. The service did take a bit. But there was a miss hap on our part with the ordering and a few people drank too much at the pool. So there was some confusing moments. Luckily there was a fish tank and one of my friends spent 15 mins starring at the fish. Kinda saved the evening. \n\nThe food is just like chain style food. Chicken dishes burgers. The appetizers are where it is at in my opinion. I just ordered a chicken quesadilla. It was good. The drinks are funky and different a lot of tropical themed drinks. Hence the name lol. I do think the food is good but pricy for what you receive. \n\nThe mistake we made was ordering a lot of drinks here. The drinks were expensive. Between the 12 of us. Food and drinks. It was just over $100 a person. It's not bad. But for $100 a person I would have rather done a pre fix dinner at a staleskhouse or a higher end eatery. And have drinks there. But your really paying for the experience and atmosphere here. \n\nOverall. This rainforest cafe is nice no complaints really. The food is always consistent. The drinks are a bit pricy. But the new location has a nice view of the strip. I prob will be back"
        }, 
        {
            "index": 35, 
            "rating": 1, 
            "review": "Worst restaurant I've ever been too. Had breakfast there. Side of fruit had moldy grapes in it. The only thing not disgusting was the oatmeal."
        }, 
        {
            "index": 36, 
            "rating": 3, 
            "review": "We had a great costumer service, we had a nice view and great drinks ,we enjoyed,about the food I think they need to work on that."
        }, 
        {
            "index": 37, 
            "rating": 4, 
            "review": "Ines was the best waitress I have seen in a long time! She was very personable and joked around with are party! Hats off to you for 5 star service! Food was good but margarita lacked as it tasted like a mixer was used, thus the 4 stars instead of 5."
        }, 
        {
            "index": 38, 
            "rating": 1, 
            "review": "Waitresses are horrible, extremely slow and everyone was rude. Kept bumping my wife's chair and head, never said excuse me or sorry.....,took an hour to get 2 burgers. Maybe 4 tables is too hard to keep up with."
        }, 
        {
            "index": 39, 
            "rating": 4, 
            "review": "We ate here right after they relocated. Not bad, and it's sort of a tradition to eat on my birthday there, so we went tonight. \n\nWe weren't disappointed for a Rainforest. While the menu has been paired back over the years and some favorites are gone, we like the atmosphere. The MGM location was second only to Chicago for me, this new location is sparse and almost desolate and too small. On with the food. \n\nI had the Pastalaya with Caribbean Rice and my wife had a BBQ chicken breast with mushrooms and melted cheese. \n\nThe Pastalaya was very good even though the spicy Creole sauce was a little too thick. The andouille sausage was spicy, the chicken and shrimp were tender. \n\nMy wife's chicken was tender. The topping was a good with the melted slice of cheese. \n\nAll in all, it was what we expected. Too bad that the restaurants at many of the Landry spots have become predictable, less interesting and more formulaic....chicken, ribs, burgers, shrimp, steaks, etc. Change the name and the menus are 90% overlap. Good, basic fare but being back the inspiration which gave us the Rasta Pasta and other signature dishes at the other Landry's places before Landry's bought them."
        }, 
        {
            "index": 40, 
            "rating": 5, 
            "review": "This atmosphere is like that of no other! It's so calming and unique; there's décor and sounds just like that of a Rainforest! The food is exquisite and there's even a magician that comes around to each table and entertains folks! I highly recommend this place!"
        }, 
        {
            "index": 41, 
            "rating": 5, 
            "review": "So we came here for my sisters 21st birthday. She's a grown woman child...so it was fitting. It was a party of 13 and a baby. Jimmy was our server along with (I think his name is) Alex. He looks kind of like a thinner, taller Josh Hutcherson. Either way. Both of them were AMAZING servers. Jimmy put his \"salesman routine\" on a bit thick and it got kind of annoying at times. Especially because, as I was walking by a door I heard him say \"I do it for the sales...\" Lol. \n\nBut anyways. Aside from the great service, the food was pretty good too! I had a big chicken and fruit salad and more than a few drinks. Everything was awesome. The environment was great and we love all of the animatronics. We've loved coming here since we were kids. I do miss the old place though. It was probably too big for the amount of business they normally have. Either way. Love it."
        }, 
        {
            "index": 42, 
            "rating": 1, 
            "review": "If you don't mind waiting over a hour for your food then your good, food is meh. I wouldn't come here again. Such a waste of a Vegas lunch, I could of went some where way better in the same place but whatever."
        }, 
        {
            "index": 43, 
            "rating": 2, 
            "review": "I love the Rainforest Cafe, we have been to multiple locations and it's been my favorite place since I was young. However, this location was my first bad experience. I was excited because this is one of the newer locations in Las Vegas and I live here. But this has been the worst experience yet. We came in for lunch, it was about 11am. We saw out waitress once to get our drinks, and once to bring us our food. We had to ask someone else for our check cause by that point we thought we were never going to see her again. She was very kind, just not on top of service. Our food took about 40 minutes, and there were only two other people in the whole place. I got Chicken Parmesan, which was just okay. & my boyfriend got a sizzling plater with ribs and some other meat, which he said the ribs were good, however he didn't eat any of the other meat because it was salty. Everyone was kind, but it just wasn't very good service."
        }, 
        {
            "index": 44, 
            "rating": 2, 
            "review": "Super slow service.  They had more workers than patrons and workers were just talking and walking around.  We had a party of 11 and only one waiter.  No help from other workers.  Had to stop another waiter to ask where our waiter was after he went missing for 20 mins.  We didn't even order our food yet.  Waiter comes and brings drinks, then we wait another 45 mins for food.  After food comes , he's missing one order, so that person waits another 15 mins.  They need better management here. Visit on 09/07/16."
        }, 
        {
            "index": 45, 
            "rating": 3, 
            "review": "Came here last a few weeks ago. We were surprised they moved locations from MGM to PH. The food was consistent with other RFC. Probably will try out something else next time. Very fun for the kids though."
        }, 
        {
            "index": 46, 
            "rating": 1, 
            "review": "TL;DR over priced food with poor quality.\n\nMy daughter loves this place so we only come for her birthday. Went last year to the MGM location and it was decent. Called for reservations, and they could have given me a heads up that they just moved, but didn't. I parked at MGM, went and saw they had moved. Walked to planet Hollywood. When you walk in, it feels super crowded with all the gift shop items. There's not a clear sign on how to get to the restaurant. Walking up those stairs feels a bit tight.\n\nTwo in my party ordered burgers. The meat was dried out and overcooked. The buns also tasted like they sat under a heat lamp for way too long. For a $250 meal, we were not satisfied at all. Don't bother going, unless you just want the flashing lights and loud animals."
        }, 
        {
            "index": 47, 
            "rating": 1, 
            "review": "The WORST service I have ever experienced, lazy, rude and just didn't care.  25 minute wait even with a reservation and no one else there waiting! The restaurant was empty and that should have been my red flag to run as fast as I could.  \nA restaurant in that location should be top notch and I don't know how they remain open today. \nI have been to many other Rainforest Restaurants including the one at MGM Grand years ago and were very happy. The management and staff all need to be replaced ASAP. \nI am in the hospitality industry and came here because the kids and family were visiting from out of town. \nI will make sure that everyone I know doesn't waste there money or time on this establishment."
        }, 
        {
            "index": 48, 
            "rating": 1, 
            "review": "The food was ok, way overpriced but that I can deal with however the service is terrible. We went here as a group to celebrate my sons 16th birthday on a Wednesday night, first they lost our cake that we had delivered and then once found it was served frozen, secondly they forgot one of our party guests order completely and brought it out finally at almost the same time as the brought the cake. It took two hours by the time we had finished our meal as the service was so slow. I would not return."
        }, 
        {
            "index": 49, 
            "rating": 5, 
            "review": "1st time here & had a wonder experience with my 2 toddlers. Our waiter RANDY WAS AMAZING!!! He was super nice & by far made it one of the best experiences with his friendly manner & attentiveness. We did make a reservation as we came in on Christmas for an early dinner. My kids loved the animal decor & enjoyed the chowder."
        }, 
        {
            "index": 50, 
            "rating": 4, 
            "review": "Rainforest cafe' is a bar (the drinks can be strong) and merchandise store on the first floor. The environment is loud and filled with jungle noises. Great for children, dates and hanging out with friends. Second floor is the dining area. All the servers are dressed in safari uniforms and there are more elephants, monkeys, birds in the tree tops and vines. Jasmine our server, was the most upbeat, happiest, informative waitress out here!My mouth watered as I read the menu choices... Blackened tapia and ceviche...jungle steak and shrimp mmmmm!! I chose the blackened tilapia and ceviche. All in all enjoyable experience."
        }, 
        {
            "index": 51, 
            "rating": 3, 
            "review": "Came here a little after 4pm on a weekday...wasn't busy, seated immediately, served quickly, polite service, etc.  Food was ok but, it's not exactly Ruth's Cris or Morton's Steakhouse.  People complaining about the price...where do you think you are?  Vegas hasn't had cheap food for a long time.  Would give it 3.5 stars but that wasn't an option.  Salads are overdone with dressing so get it on the side.  Chicken sandwich was pretty good, fries were pretty good.  Happy hour drinks at the bar only but, they are cheap (not a lot of alcohol).  Artichoke dip was pretty good.  Music is a bit loud but not overwhelming."
        }, 
        {
            "index": 52, 
            "rating": 1, 
            "review": "The food was horrible to the point of inedible and be careful bringing little ones here because of the sounds and the rainstorm.  It was also very expensive.  Yuck!"
        }, 
        {
            "index": 53, 
            "rating": 3, 
            "review": "New location, not as great. No amazing fish tanks. No fish tanks at all actually. Food not great. We had Jessica as our server, she was good. The hostess Cecila also was great, gave us a good table. It's fun to do with smaller kids once or so, but that's it. It's superbly overpriced, but that the Vegas Strip for ya."
        }, 
        {
            "index": 54, 
            "rating": 3, 
            "review": "I enjoyed a good simple Garden salad here today. My sever was flexible and added some avocado on the side which wasn't part of the dish. That was much appreciated. The Seasonal vegetables I ordered were stir fried squash, zucchini, capsicum and onion - tasted nice with a little Parmesan sprinkled over. I sat on the patio to watch \"The Strip\" below as I ate lunch. It was very pleasant. Inside is very dark, due to the rainforest theme and decor. There's a regular \"rainforest\" show inside which simulates rain in the forest. Nice service here, thank you."
        }, 
        {
            "index": 55, 
            "rating": 4, 
            "review": "Great staff, decent food & fun atmosphere for the kids! Very roomy & comfortable setting."
        }, 
        {
            "index": 56, 
            "rating": 1, 
            "review": "For of Harmon & Las Vegas Blvd this restaurant sucks. First this place was dead. We had to wait for a clean table on the outside balcony. Our appetizer was give to someone else and we order salads that came out wilted and old looking. The shrimp in it was the only thing half way desent. Basically we spent a 100 bucks on two souvenir tiki cups. This place sucks and we will definitely not be back. Maybe it's that corner spot because Bubba Gump Shrimp is not good either. I don't think I will ever try Twin Peaks."
        }, 
        {
            "index": 57, 
            "rating": 4, 
            "review": "To be fair, I would rank food and speed of service at 3 stars. However, one of the children in our family has multiple food allergies, and they did a really great job ensuring that they were taken care of."
        }, 
        {
            "index": 58, 
            "rating": 5, 
            "review": "Omg great food!  Great service.  Make a reservation or walk by and get on the list while you shop.  They texted us when we should start walking back to make the list.  \n\nDo not get the cheap steak.  The primal is where it is at.  You can upgrade any combo or what we did was get the primal and add on the shrimp for 6.99. The coconut shrimp was great and the grilled shrimp was awesome too.  \nGosh the mashed potatoes were amazing!  Especially with the steak medium rare.\n\nI wish we didn't clean the plate so fast or I would have posted a photo!\n\nAnther trick is to get the souvenir drink and SHARE it.  Haha then get the $6 refills.  You can even change drinks.  \n\nBest service with Hugo!"
        }, 
        {
            "index": 59, 
            "rating": 5, 
            "review": "This place is soooo fun for kids. My sons in awe with all of the animals that move every 10min. The food good too. Had the coconut shrimp Wes had some little hamburgers with potato salad. Fun atmosphere"
        }, 
        {
            "index": 60, 
            "rating": 3, 
            "review": "Well this is the new location that moved from MGM Grand. \n\nSo let me start by saying it's pretty cool everything looks great no more fish tanks. \n\nThe place was empty. Most likely because no one knows it m over and it's possibly the hardest place to locate. I think the holy grail would be easier to find bits outside on the very end on Harmon and lvblvd. At street level it's hard to find.  \n\nOnce you find the place assuming you ever do its rain forest just in a smaller package. Staff are friendly and inviting. \n\nWe were seated pretty quick due to the lack of customers. We got our drink orders and food orders pretty quick. Food was \"ok\" my kids got the pizza which they ate all of. I got the awesome sampler it was more like ok sampler but wasn't bad but at 18.99 I expected more. My wife got the rasta pasta again 18.99 We expect more, my dad got the flat iron steak combo. He says the ship was great had to send the steak back because it was rare and he wanted medium, then he got it back they took is sauce. \n\nI do have to point out the staff was really great and friendly, everyone that passed us enter acted with our boys which is awesome. The manager came out she was fantastic. \n\nI would recommend trying it out but I think they need to drop the prices a bit.  It's not Disneyland so you can't charge these prices."
        }, 
        {
            "index": 61, 
            "rating": 1, 
            "review": "Let me start with the waiter, he was horrible.  We ordered an appetizer and told him to bring it with the kids meals.  The kids food came out 30min before the appetizer and our meal came 30 min after that.  By the time our food came out (2 salads) we were so mad we had lost our appetites and the kids were already restless.  \n\nThe food was also bad.  Pre-frozen meat and veggies.  Not worth the price nor time.   Also, another review said the waiters were like convicts they were right.  I wasn't comfortable being served by them.  Will never go back much less take my kids there again.  You are better off going to McDonald's if that's the kind of food you like at least you won't overpay for the previously frozen food."
        }, 
        {
            "index": 62, 
            "rating": 3, 
            "review": "So so order the appetizer platter chicken strips came out under cooked everything else was OK sent out new ones as a replacement? Overall ok overpriced for ambiance"
        }, 
        {
            "index": 63, 
            "rating": 3, 
            "review": "as expected....decent service...good food...kids enjoyed it....if u like this chain...u will like this entry...and the food here tastes better then some of the big name resturants...hint hint..gordon ramsey.."
        }, 
        {
            "index": 64, 
            "rating": 4, 
            "review": "The animatronic animals were great to see, they really add to the rainforest feel. I had the hickory BBQ chicken and it was fantastic. Service was friendly but a bit slow, but it was lunchtime so it's understandable. I highly recommend anyone, especially those with children, check this place out"
        }, 
        {
            "index": 65, 
            "rating": 4, 
            "review": "Ray helped us navigate the menu and specials.  The atmosphere was definitely a Rainforest.  The food prices were comparable to Las Vegas, but the portions were large and filling.  Great dining experience, food, and service."
        }, 
        {
            "index": 66, 
            "rating": 1, 
            "review": "Our lunch party of 10, at 1, took over a hour to get our food, and the food was terrible!  Don't go there if you're a foodie!"
        }, 
        {
            "index": 67, 
            "rating": 4, 
            "review": "First time coming here with my family. We were seated very quickly. Staff was friendly and knowledgable of the menu. The food was a bit pricey in my opinion, even when using coupons, the sales tax just brings it right back to original pricing. (Bummer) Steak was amazing amazing amazing! Definitely great experience.. I can see coming to this restaurant for special occasions."
        }, 
        {
            "index": 68, 
            "rating": 4, 
            "review": "Our experience tonight was great, the kids loved the experience, the food is pricy for what it is, however our service was excellent!  Seating was quick and our server Oscar was wonderful.  He was helpful, patient, kind and quick!! Thanks Oscar!"
        }, 
        {
            "index": 69, 
            "rating": 4, 
            "review": "The decor  is typical Rainforest Cafe with the animated animals etc. \nOur waitress, Tina, did a great job making sure our drinks were filled and we were satisfied with everything.  \nThe food was good and not pre-done. I am gluten free and they sent the chef out to answer any food questions and to make sure that what I was ordering was GF.\nThey gave my son a plastic safari hat, sang to him and gave him a price of cake since we were celebrating his 10th birthday."
        }, 
        {
            "index": 70, 
            "rating": 2, 
            "review": "Forest of Disappointment\n\nI went here with friends because one of them has a nine year old boy.  Big woo! This place was boring, overpriced, and past its prime.  After a 25 minute wait (for eight people) the service was good and the food was average.  You are better off giving your kid a coloring book and taking them to the zoo."
        }, 
        {
            "index": 71, 
            "rating": 3, 
            "review": "I am a local but my kids wanted to come for some time.  I finally decided to take them on a Wednesday afternoon.  \n\nTwo things: \n\nThe kids LOVeD it and would of given this place a 5 star due to the decor and the lightening theme. \n\nI hated it. The service sucked.  I had to pull the hostess to find our server after seeing two people after us get served"
        }, 
        {
            "index": 72, 
            "rating": 1, 
            "review": "The atmosphere was great and our grandson loved the animatronics.  The food was horrible though.  $18 for nachos that were very skimpy portions, tasted like they were heated in a microwave with stale chips, and our daughter had to ask for salsa to go with them.  My husband has an avocado burger that wasn't very good either.  My grandson and I split the Hawaiian Kahula pork and ribs.  The ribs were very fatty, but the kahlua pork was the best I have ever had, but there was only a small scoop of it.  They served macaroni salad and rice with it so we paid $26 for a very expensive macaroni and rice dish.  The host was friendly, but we were trying to surprise our grandson with the animals and when he seated us he said have you been here before?  When we said yes he said okay so you know about the thunder and lightening and animals moving!  Spoiled the surprise for our grandson!"
        }, 
        {
            "index": 73, 
            "rating": 1, 
            "review": "I always eat at the Rainforest café in downtown Disneyland and when they were located inside MGM. This new development is pretty cool. I didn't even know they moved location. \n\nI came for a birthday party of 30 peoples. The birthday girl decided to sit outside in the patio. The view was so beautiful and sorry to say that's all the positive I can say about this Rainforest café. \n\nIf you are planning to come here, be sure to give yourself 20-30 min walking time.  The hostess told us to park in the Planet Hollywood parking garage. It is sooooooooo far from the restaurant. We then later on found out they have this hidden parking area but its so dark and looks very dangerous to park at.  \n\nOMG it was so freaking hot outside in the patio.  It didn't help when you look over to Twin Peaks (restaurant next door) has they have a mist machine blowing to cool down their customers. \n\nCustomer service was just okay. Nothing special. The food I ordered didn't taste like how I normally order it from other locations. Can't remember the name but it was a pasta dish with Sausage marinara."
        }, 
        {
            "index": 74, 
            "rating": 1, 
            "review": "We needed a quick bite and are fans of the one in Florida. All went well until I bit down on a hard chunk of plastic in my nachos. They took them off the bill but it was still extremely off putting. Nachos were good before that though."
        }, 
        {
            "index": 75, 
            "rating": 1, 
            "review": "It makes me sad to review this restaurant so low as it used to be one of my favorites when it was at MGM, and I still highly recommend the downtown Disney one. But this was more than a disappointment. The girls at the stand on the first floor were very nice. We were excited and told to go upstairs. Once we arrived the hostess there with really short hair was unbelievably rude. My friend asked if we could sit in a different area, so literally made an annoyed noise and walked away with no answered. returned minutes later and started walking that way so my friend said is that a yes and she said kind of. I couldn't believe her. Then led us to a table with a highchair and when I removed it myself, as we didn't need it, there was so much trash and a fork under and I commented on it and all she did was laugh. After convincing our friends how awesome this place was I was instantly embarrassed. Our server was nice enough. My friend split a drink and he brought a new one, but some of my friends didn't like that he didn't even try to help with the mess just dropped napkins. It just seemed like nobody cared much. Maybe from sitting there he had to stay longer for us but for the most part he was nice, and he also forgot my salad. And the nachos which I usually love, were not very good. Overall it was very disappointing and I'd recommend going somewhere else for dinner!"
        }, 
        {
            "index": 76, 
            "rating": 3, 
            "review": "First time at this particular rainforest cafe. Been to others in California and the one that used to be at MGM. If the weather is right, the outdoor patio is the way to go. I came here for my daughters graduation. Nice clear warm day and the view from outside was great. Most come for the animatronics inside with the thunder and lightning. Your coming for the atmosphere not for 5 star food. Obviously food is themed to the restaurant. Your not going to get a Zagat rated steak or seafood. I got the bacon burger and it was made to my specifications. It was good. Service was ok. All in all, food is overpriced but your on the strip so it makes sense. Won't be back anytime soon but not because of a poor experience, but because I live here and you play here."
        }, 
        {
            "index": 77, 
            "rating": 1, 
            "review": "Mediocre at best. Definitely about the experience not the food. Way overpriced and blah."
        }, 
        {
            "index": 78, 
            "rating": 1, 
            "review": "Food came out cold...took forever. Gave us new fries but we have been here an hour and a half. Took forever to get refills on drinks."
        }, 
        {
            "index": 79, 
            "rating": 4, 
            "review": "I was so surprised when I saw that the old location shut down, but I have to admit that the new locations has its perks. Don't expect cheap food when visiting any rainforest cafe- you pay for the entire experience! the food was good, but the overall dining experience was amazing. Our server  (his name is Alex ) was very professional and friendly, but what stood out the most were the AMAZING views over the strip from the outside patio!"
        }, 
        {
            "index": 80, 
            "rating": 2, 
            "review": "Upon arrival at hostess podium there was an older gentlemen who was not very attentive nor cared about seating our group, even after we asked twice about being seated. We were the only ones there so he clearly just didn't care. Went to PBR instead and had a blast."
        }, 
        {
            "index": 81, 
            "rating": 1, 
            "review": "I love the Rainforest Cafe. But, this one has a lot to be desired. I wanted the fish but since I don't like coleslaw I asked for veggies. I was told they could not do a substitutuion fro this meal. So, I ordered the double cooked chicken with the rice. What a HORRIBLE meal! The chicken had absolutely no flavor, none. No salt, no pepper. The gravey they give you had some taste but not enough to help. The mashed potatoes were ok, but they needed some flavor. They were, esentially plain potatoes. The rice was the worst! Not cooked well, very under done and the beans were also not cooked well making the dish gummy, BLECH!\n\nI asked the server for a to go box, figuring I would try to make it paletable in my room, then got up to go to the ladies room. When I came back my table had been cleaned! The server looked at me with this look of horror on his face. He ran to get the manager and I explained to her what had happened with this meal. She told me I certainly could have gotten the veggies with the fish and she was sorry for the bad experience. She offered to make me another meal, but there was no way I was going to eat it. She did put the meal on the house, which I appreciated."
        }, 
        {
            "index": 82, 
            "rating": 5, 
            "review": "This place was inside of a mall I believe so I was just going to walk by and find something else on the strip but the setting caught my eye it was so nice. The restaurant really gave off a rainforest vibe. The food was sooo delicious and my family and I went at happy hour so we tried a little of everything . The happy hour prices were really good I am talking 6$ 7$ small meals, overall I highly recommend this place and the customer service was good."
        }, 
        {
            "index": 83, 
            "rating": 5, 
            "review": "Had a wonderful time and enjoyed all our food & drinks! It was my mothers birthday & our server Tracey made it very memorable with her wonderful attitude & permanent smile she had on her face! The staff came over and sang happy birthday which was so nice and thoughtful! Food was great, the drinks were delicious, & the service was amazing! Can't wait to come back again"
        }, 
        {
            "index": 84, 
            "rating": 2, 
            "review": "Expensive but to be expected.  It's a kid place and you pay for the atmosphere not the food.  Go for the cobb salad or salmon.  Everything else is eh."
        }, 
        {
            "index": 85, 
            "rating": 2, 
            "review": "I decided to bring my family here figuring it would be a good place for the kids to be nicely distracted so my husband and I can eat in peace for once. Big mistake....Here I go....First thing that rubbed me wrong....we made it clear we wanted our sour cream with our appetizer....our server forgets the sour cream. He finally realizes and runs to grab it AFTER we had already finished our appetizer where the sour cream was needed. Then the server says he had to go get the sour cream separately as that was the only way he can do it without charging us.  Did he really think we would care about being charged extra for sour cream or was he just saying that because he forgot? We all make mistakes, own up man. Say u forgot, if u did, who cares. That was Strike 1. The  manager comes by and asks us how we were doing ...I say great. We are not one to complain. Whatever no big deal. After a few minutes the runner drops off our burgers and fries and we noticed they didn't have ketchup on the table. Wth. So we patiently waited for our server to return so we can ask for ketchup.....he didn't return and our burger and fries were getting cold so I made my husband walk to their service well and ask for a bottle of ketchup. That was Strike 2. The server finally returns....\"how's everything?\" Great I reply as I think to myself \"It's ok...no big deal let's keep the kids happy and make this a happy family dinner\".  30 minutes pass, we finish our meal and server comes by and yadda yadda ask if we want dessert whatever. No thanks just the check please. As we wait for our check, my 2 year old son chokes on a tortilla chip and started coughing and coughing and then vomits on himself. Sigh. We don't have any napkins so I once again  tell my husband and daughter to run and ask someone for some napkins so I can clean up my son and the mess. While my son sits there in his own puke my husband and daughter comes back empty handed with no napkins as they were told they will send someone out to clean for us. Strike 3. I tell my daughter to just grab the damn napkins off the empty set up tables next to us. I wiped and cleaned up the seats and table and my son. Our bill never came. By this time I'm livid. A porter finally arrived with a huge dish bucket and asked What needed to be cleaned. LMFAO I CLEANED IT UP ALREADY???? We get up to leave, as we weren't going to wait anymore. The server was still MIA with our bill. We go to the front host and ask if they can pull up our bill so we can pay as we were livid and leaving!!! They ask what's wrong ? Who's our server. Yadda yadda. Whatever. The same manager comes out and asks what's wrong...ha! What difference does it make??? I told the manager...how I don't like to complain as I'm in the same industry but this was just plain ridiculous. She made it a point to say she did ask us how we were doing before and I should of said something if I was not happy. Lol!!!!! She asked us the first 15 minutes we were there. She wasn't there for any of the other problems we had. Our server wasn't a bad guy. I'm sure he tried his best. Assuming he was busy was why he couldn't get back to us when he was needed. Ok. If we have to run around and ask for shit....then that's just plain silly. If my kid choked and threw up we shouldn't have to sit and wait for help. We should of immediately been helped. Napkins rags whatever. The server finally met us at the host desk and gave us our bill and we felt bad for him to have to see us angry and talking to a manager. I did thank him for his service but I'm still aggravated I had to wait for him for literally everything. It shouldn't have to be like that and if he has too many tables than he can handle then he needs to let them know as customer service is sacrificed when you can't be there to help us. It was not pretty and I was not happy in the end. We could of just walked out on our bill and no one would of even known. That's the crazy part. I loved the atmosphere and my son was wide eyed amazed at all the animals everywhere and had fun but that was the end of it. I won't be going back."
        }, 
        {
            "index": 86, 
            "rating": 4, 
            "review": "We had a large group of 38 people and Manny and Lawrence did a great job.  The inky reason why its only 4 & not 5 stars is because of the food service.  The filet of Mahi Mahi and 2 crab legs that was placed on my plate was a joke. The Mahi Mahi was bite size no bigger than 2\"x1\" and way over cook. The crab legs were the skinniest and so dried out. Even the shrimps were over cook. The saving grace were our waiters.  Thank you."
        }, 
        {
            "index": 87, 
            "rating": 5, 
            "review": "Had never been to one of these restaurants...was not disappointed. We went because we had received $10 off coupon but I'm glad we did. Probably the best spinach dip I've ever had. Not to mention the decore was incredible.  Our waiter was also amazing very friendly..and not bad to look at either ;)"
        }, 
        {
            "index": 88, 
            "rating": 4, 
            "review": "Solid 3.5 stars so I rounded up to four. Service was great we were seated fast and server was very attentive. My wife has a food allergy and they were super careful with her food not to allow contamination the food was good kids loved their menu.  I love the mashed potatoes they are the best of any chain restaurants real potatoes not instant.  Yes the rainforest theme is cheesy hey but it's for kids and they enjoyed it."
        }, 
        {
            "index": 89, 
            "rating": 4, 
            "review": "We were here last Saturday(Jan02,2016) for dinner to celebrate my kiddo's bff's birthday. First and foremost, Rainforest is geared towards kids and the young at heart. It's not a romantic place to bring a date unless she's into animals roaring every now and then and kids running around.\n\nThis new location next to Planet Hollywood seems smaller than their old location at the MGM but still as cool(according to my daughter). Food wise, it's to be expected, nothing special and expensive. Although, the two people in the group who ordered salads were pretty impressed with their food. I had the clam chowder and it was not bad. There was not much in my tiny bowl, a little salty but at least there were clams in there. The kids enjoyed their food and had a lot of fun.\n\nOur server was awesome too. He was pretty busy but very accommodating. If it was not too cold, it would have been nice to sit in their patio/balcony, overlooking the strip.\n\nHere's a tip for those who are planning to go there....DO NOT park at Planet Hollywood and go through Miracle Mile. It's a looooooong walk. Park at Cosmopolitan and take the bridge or pay $5 at the parking lot across the street and take the bridge.\n\nFood and price - 3*\nFun factor for kids - 5*\nService   - 5*"
        }, 
        {
            "index": 90, 
            "rating": 1, 
            "review": "I've only been to one Rainforest Café before and it was amazing (food, service, special effects, etc). I had hoped I could repeat the experience and  chose this restaurant for dinner with my mother. \n\nWe both had the guac burger and unfortunately, it made me very sick. Usually you can't go wrong with a burger and fries at a place like this, but oh boy, yes you can. Unacceptable and something that makes me lose trust in a restaurant.\nOn top of that, the service was extremely slow. I know I won't be coming back and can only tell you: don't go!"
        }, 
        {
            "index": 91, 
            "rating": 1, 
            "review": "Now, let me start off by saying that I love Rainforest Cafe. I've been to the one in Anaheim & Ontario and I've always had exceptional service. Just the other day, I went for my 21st in Anaheim and it was amazing.\n\nThis location however - horrific. We were seated fairly quickly because nobody was there and that was the end of something that could have been great. It was about 8 when we went and it felt as if it was 90 degrees inside. I ordered a drink, and they put way too much mint in it I was literally drinking mint with every sip. Server took it back and I just asked for water. Server, don't remember his name, he was very quiet and didn't give us the service I've been given at other locations. He didn't check on us after serving the food. \n\nThe food, salty. I got the chicken fried chicken as I always do, and it was just so salty. My boyfriend got some seafood and it immediately made him run to the restroom. My boyfriend also knocked down his drink by accident and I told another server, since mine was nowhere to find, and it took them literally 20 minutes to help us wipe it down. \n\nNever again, very disappointed."
        }, 
        {
            "index": 92, 
            "rating": 5, 
            "review": "Well, unlike many people reviewing this Restaurant/café, my wife and I enjoyed it 200%.  We went there for breakfast, so may be dinner time is different.\nThe waiter (Randy) was one of the best waiters I have had service my table.\nPolite, jovial, attentive.  He constantly checked on how we were, took our orders accurately. The food was excellent and looked like photos on a menu.\nRandy even went to another table to remove plates when he saw the people were waiting on their waitress to come back.\nSo may be, we were lucky and had the perfect server.\nThe setting and atmosphere is great.  You just want to tale photos and spend more time."
        }, 
        {
            "index": 93, 
            "rating": 1, 
            "review": "Well, if you want to see convicts serve and cook food. this is the right place!  Between the gang tattooed waiters to chefs that don't wash hands after a big dump, the only safe food are overpriced nachos.  I really though I was on a set of the MSNBC prison break.  The only thing that was missing was a good food fight.  The base was so loud that I thought the low rider civic was parked in the kitchen.  I guess it became better when the magician came to the kids.  Overall, it's a good experience, I gave it 1 star."
        }, 
        {
            "index": 94, 
            "rating": 1, 
            "review": "Came here for lunch with the kids, it was pretty slow in the middle of the day, the waitress took FOREVER to greet us at the table and take our drink order. She was nice but didn't seem sincere what so ever! Kind of like a robot. The food then took forever and they don't have very many options at all! The kids pizza was ok, tasted super cheap. My husband and I shared a pasta and appetizer. They were OK. They rarely checked on us I wouldn't eat here again. The decor is really cool but the food is way over priced and wasn't all that great. 1 star for the crappy service and the over priced limited menu"
        }, 
        {
            "index": 95, 
            "rating": 4, 
            "review": "We almost didn't come here because of all the negative reviews. I like taking my family of son and spouse and daughter and spouse and their almost 2 year old daughter and 6 month old son.  Made reservations for a highchair, possible 2nd highchair, stroller parking and seats for 5 adults.  No problem and we were seated pretty quickly even with a change of 4 more adults.  (We called ahead of time)  Party of 11.  We all were very comfortable and not crowded.\n\nLets be clear.  If you want gourmet food, this isn't the place.  I do have to admit, that we all really enjoyed our meals very much.  The food came out pretty much in a timely fashion with appetizers first, followed by entrees.  I was prepared to get a bite when I got home, but I was pleasantly surprised.  Coconut shrimp . .yum.  Haven't been to a Rainforest in years, and was most pleased with this visit.\n\nA lot of the success of our visit was our server, Andre.  Very efficient and wasn't rattled by seprate checks and out inability to get it together in the beginning to even get a drink order together, much less the rest.  He also was very personable, professional and helped with our positive experience.  His \"helpers\"  were also spot on.\n\nThe best part?  Granddaughter, Saturn, loved the animals and atmosphere and especially going crazy at our table every time there was a lightning storm.  She would scream and squeal and flail her arms around amidst huge grins.  Thanks to the storm, no one was bothered by her and my exuberance.  So much fun.  We will be back and will not fear the food and service as other yelpers have warned.  All 11 of us had a great experience."
        }, 
        {
            "index": 96, 
            "rating": 1, 
            "review": "Lame. Way lame. Interior is still from 1992. There is no atmosphere just a cheesy decorations. Very disappointed. Is was way better at mgm."
        }, 
        {
            "index": 97, 
            "rating": 2, 
            "review": "My friends were visiting from Illinois, and they are big fans of the Rainforest Café. I had never been to one, and they were paying, so off we went.\n\nThe Vegas location used to be in the MGM, and now it is hidden away in an offshoot mall near Planet Hollywood. There wasn't much foot traffic, and we got a seat right away.\n\nFirst off, it reminded me of Denver's Casa Bonita--but not in a good way. Lots of small rooms with fake jungle greenery and mechanical animals blaring away in the background. Too bad there were no waterfalls or cliff divers to take our minds off the food.\n\nI'm not a food snob, but my meal was WAY overcooked. I had the Parilla Yucatan plate off their seasonal menu: bacon-wrapped shrimp, grilled chicken topped with cheese, and mahi mahi topped with mango salsa. The seasoning was great, but the proteins were as tough as burlap. Nowhere near worth the $22 price tag.\n\nMy friends ordered mozzarella sticks, a cup of clam chowder, fried shrimp, and the jungle steak and shrimp. They seemed pretty pleased, but the food looked pretty pedestrian to me. And even though we didn't have any alcoholic drinks, the meal was over $100.\n\nThey are tourists. It's a tourist trap. And they were happy, so I'm glad for them. But with so many other great restaurants in Vegas, I know I will never be back. And I'll try to steer my other visiting friends away as well--unless they have a hankering for animatronic apes and overpriced food!"
        }, 
        {
            "index": 98, 
            "rating": 4, 
            "review": "The food actually wasn't as bad as I was expecting it to be. Our waiter Doug was working his super hard to make it a great experience for us. For what it is a family friendly, chain with classic american food in a tourist spot it delivered exactly what was promised."
        }, 
        {
            "index": 99, 
            "rating": 1, 
            "review": "Been to Rainforests in Chicago and Florida and while this has the appearance, the food was mediocre and service worse. Hostess not accommodating with which open table to sit at. Waiter was inexperienced. Food was so so. Had coupon for appetizer that they wouldn't fully honor for grub they buy in bulk from a food service company and then microwave. The only thing memorable is remembering to never go back."
        }, 
        {
            "index": 100, 
            "rating": 1, 
            "review": "Well first of all it took almost an hour for them to seat us when they said the wait was only about 30 minutes. We had a party of 8. I mentioned we had a birthday when they took our name down. So then we get seated and notice there are many tables open in the area they sat us. (Huh took an hour to seat us with this many tables) Then about 15 minutes goes by as we watch 4 others big tables get sat down and a server comes and asks for our drink order and tells us she is helping out our server for a moment because she was pregnant and needed to us the restroom. Ok...... didn't even bother to walk around our table to take our order kinda yells from the end of the table what did each of us want. Ok now we wait for our drinks to come, mind you that took almost another 15-20 minutes. Not even together almost one drink at a time. We order an app to Start with, the app comes out and takes another 5 minutes to get us side plates. Then our server comes to the table to take our order and does nothing but complain how she's pregnant and that she might need to leave to the doctor. Now we sit for almost an hour before we get our entrees, in the meantime our server has not been seen nor has anyone come by our table to take our dirty app plates or ask if we needed any refills on our drinks. We finally get the servers attention to get refills on drinks and she doesn't even take the dirty plates from our table. Dinner has finally gotten to the table(now that it's been over 2 hours that we have been in this place) my sister order a burger and it was so dry and tasted like dirt, my mom ordered fish and chips she could almost knock on the table with the fish....my nephew got kids shrimp and Idk what to say about that it was just bad. The whole dinner was ridiculous. Some other waiter comes to the table to ask if we needed anything in which we tell him about the burger and the fish. He brings the Manger Cathy over to the table and she says that she will take it off of our bill. Now this whole time our server never once came back to see if everything was ok nor did she ever mention her name. Now in the beginning I mentioned we had a birthday.....yea what wtf for???? They went and sang to many other tables but never our! Biggest disappointment ever. It  was as if Cathy the Manger didn't even care that our experience was bad. From the wait time to be seated to the wait for someone to take our drink order from the time they took our order to getting our food to the horrible food that came to our table. Can't believe we paid $200 for that bs."
        }, 
        {
            "index": 101, 
            "rating": 3, 
            "review": "This place is pretty cool with its crazy jungle theme. My kids really enjoyed the environment and loved the food. I just wish there was a little more variety of food but besides that the whole experience was pretty nice and good food."
        }, 
        {
            "index": 102, 
            "rating": 1, 
            "review": "This place is one of the worst chains.\n\nI've been to the one in Downtown Disney and my biggest complaint there was the service staff.\nAgainst my better judgement, I chose to give the company a second chance and went to the one in Las Vegas for a celebration dinner.\n\nAbsolutely HORRIBLE.\nThe service was slower than a snail.\nI mean there were no more than 4 tables in this place (and mind you this was around dinner time) and our server was hardly ever around. We hardly saw any service staff.\nShe took way too long to greet us, so we ordered waters and decided to go downstairs for the cheap margaritas across the hall. No one told us we couldn't bring them back in. (Not that there was anyone around) Once we got our waters. She walked away before we could order appetizers. Even that took 25+ mins for them to arrive.\nTowards the end of our meals our server announced a different server was taking over the table.\nWhen this guys brought the check, things were on the wrong tabs.\nIt was a mess.\nI don't think anyone in my group was impressed.\n\nThe slow, terrible service and the lack of wow of the food...\nI will NOT be returning.\nYou can't make me."
        }, 
        {
            "index": 103, 
            "rating": 1, 
            "review": "I am writing this review from the toilet seat in the MGM hotel. I ate at the Rainforest Cafe last night and have had explosive diarrhea ever since. Supposed to drive back to LA today. Prayers please."
        }, 
        {
            "index": 104, 
            "rating": 4, 
            "review": "Happy Hour Mon-Fri 3-6pm\n\nIf you like fruity sweet cocktails this is place for you.  HH specials are $6-$8 apps and $3-$5 drinks.  For me the real deal is getting their specialty cocktails in the souvenir glass and then refills are only $6.  Green Python is my favorite but I've tried them all.  Strawberry Mojito and Blue Nile are also good choices.  I usually tell them to keep the glass.  I have enough at home to open my own gift shop.  This was my first time at the new location in Planet Hollywood.  Bar area is smaller and I was bummed to see that they don't have the animal leg bar stools anymore.  Those were my favorite.  Our bartender was great, always checking on us and refilling our drinks.  We ordered Mozzarella Sticks and Rock Shrimp Tacos.  Nothing amazing but good bar food.  A solid spot for HH if you are in PH."
        }, 
        {
            "index": 105, 
            "rating": 2, 
            "review": "Muy mal servicio, lento, toman la orden y se olvidan de ti. Hay que buscar al mesero para pedir mas bebidas. Lastima, ya que la comida es buena"
        }, 
        {
            "index": 106, 
            "rating": 2, 
            "review": "Meh...that's pretty much what I have for this place. It's expensive, the food is kind of ehhh. Point is that it's never going to be my first choice for a place to eat. But, if I am on the strip with kids and I don't mind paying exorbitant amounts of money for mediocre food so they can have the cool animatronic animal experience. Honestly you could probably do better though by going to a restaurant at the mirage and going to the secret garden there. That way your kids will see real animals for probably the same cost."
        }, 
        {
            "index": 107, 
            "rating": 1, 
            "review": "Our waiter was Kieth... Or at least I think that was his name.  The reason I am not sure is because we rarely saw him. We got seated, ordered our drinks and poof gone.  When I finally got his attention, I asked for extra lemon for my ice tea. He came back with 2 pieces... Not sure if that qualifies as extra.  Again poof gone.   We finally ordered our lunch and waited for our food.  Food finally came I sat there with an empty glass.  I had to wave him down AGAIN asked for a refill and a bowl of lemon, thinking I may get more than 2 pieces... Well guess what! I got 3 pieces of lemon.  Not sure if Rain forest cafe is low on lemons, I mean they charge a lot of $$$ for a meal you would think they could afford to spare a few extra pieces.  Any way as I said our waiter was MIA for the whole meal EXCEPT when he was trying to push this Member's Card on us, all of a sudden he became waiter of the year.  We said no and yup you guesses it... GONE!  Over $100 dollars later, if it wasn't for the company the meal would have been a waste of time.  A great place was ruined by 1 crappy employee.  P.S. the restaurant was NOT busy, so that was not a factor of the HORRIBLE service we recieved."
        }, 
        {
            "index": 108, 
            "rating": 1, 
            "review": "I visited here because of my kids but \nreally poor service poor food\nplease go to Popeyes or Macdonals\nNightmare at Las vagus"
        }, 
        {
            "index": 109, 
            "rating": 1, 
            "review": "Ok, I'll save you time and money and just let you know that this place is a bust. Yeah, the atmosphere is kinda cool but that's all that it's got going for it! Food was horrible. Service, meh and we waited forever for our food that I was sorely disappointed in. Our appetizer and meal came out at the same time and the kids meals came last. Completely in the opposite order that our server told us he'd bring it out to us. My kids didn't even like their food and they ordered pizza and the macncheese. What kid doesn't like any kind of pizza that set in front of them?! It's because it was THAT gross. If you find that you really still want to go there, just take a walk through the place and then Go eat at Chilis just down the way. (Because let's be honest, I wish I would have just done that!) You WILL thank me for it! I really only want to give it a 1/2 a star and that's just for the atmosphere, everything else was barf. Yep, I said it. Barf."
        }, 
        {
            "index": 110, 
            "rating": 2, 
            "review": "This was my second visit to this location since their recent relocation. The first visit was about three weeks ago and I left telling my friends that it was the best burger I have had in a long time! I had been raving about it so much that they wanted to try it out tonight! I ordered the exact same thing as I did last time, but it was awful! They forgot the onion ring in the burger, they put the mushrooms that were supposed to be within the burger on the side and the meat had no taste! I wish I would have received that burger on my first visit to save me from having to return. Would not recommend."
        }, 
        {
            "index": 111, 
            "rating": 1, 
            "review": "There is nothing special about this place.  I only ate here because I didn't have plans and was tired of walking around and it was close.  I'd call it chain food garbage generic burgers sandwiches and pizza.  Ok cool they got some waterfalls and animatronic wildlife.  Maybe it's great for kids but I don't bring my kids to Las Vegas."
        }, 
        {
            "index": 112, 
            "rating": 1, 
            "review": "Having been to the Rainforest Cafe, when it was at the MGM grand in Vegas, I was very excited to eat at this restaurant again with my boyfriend and its new location at the Planet Hollywood hotel and casino, however our dining experience was horrible. We got seated out on the balcony, overlooking the strip and a server came over with whom we ordered our drinks. We then got our drinks 15 minutes later which we tried to remain patient over. Thinking that it was a simple mistake of the staff running behind we then ordered our food and waited nearly an entire hour before getting it. I couldn't believe the wait for our food was so long since it was 9:30 at night and the restaurant was not even busy. During this time that we were waiting multiple servers walked by us without ever asking if we needed refills on the drinks that were brought nearly 40 minutes before. We were both getting really hungry and eventually had to pull a server aside (no one was checking on our table) to ask how much longer it would be. We were informed that someone had dropped a plate of food and therefore we would have to wait longer for it to be remade. I understand mistakes happen but, we weren't even told this until around 40 minutes of waiting. As more time went by we felt like we were, quite frankly, forgotten. With the restaurant not being anywhere close to full this made no sense to us. About 15 minutes later we FINALLY got our food which was cold. It was disappointing to us because we had waited so long for our food and because the entrees at this restaurant are not inexpensive. As soon as our plates were placed on the table the server said, \"okay, enjoy\". This would've been fine but, we hadn't even been brought napkins and silverware. Since we didn't see any server in sight we had to get up and get silverware for ourselves. We had issues then getting our check and to-go boxes. The entire experience was extremely disappointing because I know the Rainforest Cafe is able to deliver good service, from their previous location but, this was anything but good service. I don't think we'll be returning to the Rainforest Cafe anytime soon."
        }
    ]
}