{
    "category": "Las-Vegas", 
    "entity": "Archi's-Thai-Kitchen", 
    "avg_rating_stars": 4.0843373493975905, 
    "review_count": 332, 
    "reviews": [
        {
            "index": 1, 
            "rating": 5, 
            "review": "Best Thai food in town! My fiance and I go here every month to get Tom Yum soup and panang curry!"
        }, 
        {
            "index": 2, 
            "rating": 5, 
            "review": "This place deserves 5 stars based on these 3 things:\n\n1. AFFORDABLE PRICE: My parents, sister and I visited this place on a Sunday night while visiting Vegas for the weekend.  We ordered soup, pad thai, chicken larb, seafood salad, stuffed chicken wings, sticky rice, thai tea and thai iced coffee.  The total bill was $64!!!  $64 for a complete meal with soup, appetizers, sticky rice, drinks and noodles is pretty dang good!  Not only that, but the dishes weren't dinky and were plentiful!  The Thai Tea and Thai Iced Coffee also came in huge glasses. So much that my parents didn't finish their drinks and had to take it to go.  I'm used to a very fat bill with small portions every time I visit a Thai restaurant back home in California, so $64 looked great to us.\n\n2. GREAT FOOD:  Not only was the place very affordable for a Thai Restaurant, but it was amazingly delicious.  BEST CHICKEN LAAB/LARB I EVER HAD IN MY LIFE! (From a restaurant, that is.  I still think Mom & Bro-in-law makes the best larb in the world).  It was a perfect combination of salty and sour.  I find that some restaurants make it too salty or don't add enough of that larb stuff..... rice powder/toasted rice powder.  I immediately tasted a hint of rice powder and asked my mom if she did too... just to confirm it.  They also added just enough cilantro and greens to add that fresh herb taste to it.  Everything was in perfect unison.  It was just damn PERFECT!\n\nEverything else was great; Tom Yum Soup was flavorful, seafood salad was fresh, pad thai was also delicious and the sticky rice was heaven!  It was kept in a bamboo warmer and had that home quality taste just like the way Grandmas makes sticky rice.\n\nWe ordered a 4 spicy on a scale of 1-10 and it was just perfect.  It was pretty spicy for a 4, but it was just about right.  We got our pepper kick without totally burning off our tongues.  I come from a family that eats spicy food, so I recommend asking for 3 or lower if you can't really take the heat.  \n\n3.  GREAT SERVICE:  I was put in charge of searching for restaurants to go to during our trip, so initially, I was thinking about taking my parents to a more fancier, \"Best Thai Restaurant in the Country\" place.  But last minute, I decided on Archie's because of the reviews that stated this place was a small, family owned restaurant.  Knowing my parents' preference and my own as well, I knew we would enjoy the food and atmosphere of a small restaurant.  The 2 waitresses were super friendly and often checked back on our tables to see if we needed anything else.  They also came back around to refill our water twice.\n\nThe only negative about Archie's is that it's away from the strip.  It's not too far, but its a few miles.  Also, the restaurant is located on a very dark shopping center.   The shopping center was deserted and.... kinda creepy."
        }, 
        {
            "index": 3, 
            "rating": 5, 
            "review": "So far, best Thai food I've had in Vegas.  now have 2 locations...one on Flamingo and one just North of the 215 in the Southwest....One of Flamingo is original.  Small restuarant on inside but quaint.  I usually do take out and they are always on time....CLOSED ON MONDAYS...the other location..nicer interior...I prefer the spicy basil chicken....excellent"
        }, 
        {
            "index": 4, 
            "rating": 5, 
            "review": "Archi's has some of my favorite Thai food. \n\nTheir Pad Thai is definitely up there as one of my favorite Pad Thais ever. It always tastes fresh and delicious and flavorful every time I have it. \n\nOther favorites are pad prik king (they do not skimp on the ginger, which makes it even more delicious), pineapple fried rice (probably my favorite pineapple fried rice ever. They add curry or something that makes it different and more flavorful than others), and their curries. \n\nThere's a reason why this place is one of my family's to go place when we go out to eat, because their food is consistently good and delicious. \n\nIt's definitely one of those places in Vegas that I like to go to every time I visit. \n\nAlso, I love that they have a drive thru window when you get your food to go. It's perfect for lazy people like me."
        }, 
        {
            "index": 5, 
            "rating": 5, 
            "review": "I've been coming here for years. This place is the absolute best Thai cuisine you will ever eat, period. Then an exclamation point!\n\nMy fave dishes is the eggplant spicy. I usually order the eggplant spicy with tofu because it feels like I'm getting more food, though it's delicious with the beef, too. \n\nYou also order your food based on how spicy you want it...  \"Spicy number 4,\" my dining companion might say to the waiter. \n\nI think the spiciness levels depend on who's in the back cooking that day, but go for spicy number 7. Ask for the spice caddy if your spice level isn't enough. \n\nWhat else....  The panang and the other curries are very good, too. The only time I have been disappointed with my experience at Archi's is when I ordered the Thai pancake. It looks better than it tastes, trust me. Period."
        }, 
        {
            "index": 6, 
            "rating": 4, 
            "review": "Very nice local Thai food place. Good service, fresh food and clean environment."
        }, 
        {
            "index": 7, 
            "rating": 1, 
            "review": "We ate on 9/14/11 at lunch. One of the four of us ordered Pad Thai noodles with chicken, hot level 3 (1 to 10 levels). At 11:30 pm my 80 year old mother spent the entire night until 5:30 am vomiting. That was Wednesday, today is Sunday and she still has nausea and feels terrible. taking a anti-nausea over the counter medicine the pharmacist recommended. My parents traveled to Las Vegas to celebrate their 60th wedding anniversary from Denver. The vacation has been ruined because we choose to eat at Archi's.  This morning she ate a piece of toast we hope she will feel good enough to travel Tuesday."
        }, 
        {
            "index": 8, 
            "rating": 5, 
            "review": "Off the strip and well worth the drive or cab. Less than half the price than anything on the strip and way better. Tried the pad thai, Tom kha and egg rolls and everything was absolutely perfect. The best!"
        }, 
        {
            "index": 9, 
            "rating": 3, 
            "review": "Friend and I ate here for dinner in June 2012 after an intense game of ultimate frisbee so we were pretty hungry.  I had the $10 pad thai which was okay and my friend had something which he said was ok.  The portion sizes were huge as neither of us could finish our respective dish.  \n\nIf I had gone to Archi's for a lunch special I'd rate them 4-stars as the food's fine, restaurant decor nice and service friendly.  Otherwise I'd say they're average for a Vegas Thai eatery."
        }, 
        {
            "index": 10, 
            "rating": 1, 
            "review": "Been to Archi's for years, Waited tonight for along time without even a glass of water, finally got up walked out and goto Applebee, They have wonderful server there... It's not the owner's fault, but with terrible servers... If I can't count on the restaurant who have a standard of good service, will not bring any other friends there..."
        }, 
        {
            "index": 11, 
            "rating": 3, 
            "review": "Please stop the nonsense of soda in a can so you can recharge me $1.95 of half a glass of Diet Coke. Nothing worse than a great meal and then you feel ripped off on freaking SODA!! Get with the program and buy a soda dispenser and have free refills LIKE THE REST OF THE CITY!"
        }, 
        {
            "index": 12, 
            "rating": 5, 
            "review": "Food was amazing. Very spicy. Love hot food and got 5/10 which was still very hot. Highly recommend even though its off the strip a bit."
        }, 
        {
            "index": 13, 
            "rating": 5, 
            "review": "Came here with my Elite yelping buddy Jewelyn.  Wow, the interior is very different from the one on Ft. Apache and Sahara.  The decoration or theme makes you feel as if you're in someones house and the seats are very comfortable.  Good service and a nice clean restaurant.\n\nNow as far as the food goes, Archi's is one of the best thai food in Vegas.  Everything is good but my favorite, which I also recommend is the spicy eggplant (you have an option of which meat you'd like too add on it). There pad thai is is great too but the one in asian thai cuisine is slightly better, but still delicious nonetheless. \n\nI recommend this Archi's over the other one because of its interior theme and comfortable eating.  It gets pretty busy during the evening so I suggest coming in the early afternoons so you can enjoy the food in peace."
        }, 
        {
            "index": 14, 
            "rating": 5, 
            "review": "Food is always good. Servers are very friendly. Not ever disappointed when I come here"
        }, 
        {
            "index": 15, 
            "rating": 5, 
            "review": "Food, service and ambiance. This place will give any Thai restaurant a run for its money. This nice little restaurant is tucked away in a small shopping center near Flamingo and Jones. The restaurant itself is small but the decor is nice and neat. We had the  panang shrimp, beef pad see ew and catfish delight. The food was so tasty and flavorful that we did not have any leftovers. What a great place. If you have never been to Archis...you need to go soon!!!!!!"
        }, 
        {
            "index": 16, 
            "rating": 3, 
            "review": "I give it a three star because I was half way down my fried rice and  found a hair in it, it totally grossed me out, otherwise five star!"
        }, 
        {
            "index": 17, 
            "rating": 4, 
            "review": "After spending all day at work on Yelp, I decided to stop by here when I got off so I could have some curry before heading home. I placed my order on the phone and the lady said \"OK, see you in 15 minutes at the drive-thru window,\" that got me super excited!!! I wouldn't have to get outta my car in my stinky, bacteria infested work clothes, turn my car off, turn my car on, waste more gas... bla bla bla.. Yeah, the drive-thru really got my blood pumping.\n\nUpon getting there, I almost passed it. I saw the drive-thru easily, but I wondered how anyone could eat inside?? Looked so tiny.. Maybe I will have to discover that at a later time.  \n\nI got my green curry, #6 spicy home, and it was still piping hot after my 30 min drive. Archi's definitely does not skimp out on the content in their curry, plenty of chicken, plenty of bamboo shoots, basil, and plenty of zucchini(which is the first I have had in my curry.. yumm). And they give you just enough rice:] \n\nNot a complaint, I was a happy girl with my curry take out. So, why not 5 stars? Because it's not. Yay! I'm a fan. We will keep it as that."
        }, 
        {
            "index": 18, 
            "rating": 4, 
            "review": "It's nice to find a good Thai restaurant in Vegas.  I didn't expect much from this place, it it some what surprised me.  I love the tomyum soup and the coconut chicken soup.  Yes, I am that crazy about soups :)  The food here was pretty decent.  Some of the items could be better, but you know what, we ordered 7 dishes and only 1 of them wasn't too good.  That's more than what I expected :)"
        }, 
        {
            "index": 19, 
            "rating": 4, 
            "review": "Hungry for Thai food, I checked this website for some suggestions in my area and all I can say is \"Thank you\".  This was a great recommendation and I will definitely be back.  I got the Pineapple Chicken Curry as take out and loved it.  Very fresh flavors and the staff was nice.\nI am already looking at their menu, trying to decide what to try next."
        }, 
        {
            "index": 20, 
            "rating": 4, 
            "review": "Great service! The food was served in a timely manner. We ordered panang and tofu, Tom Kha gai soup, and pad see ew. Everything was so delicious! The Tom Kha Gai soup was so good. I Highly recommend that soup. It tasted really refreshing. The server accidentally served us the wrong dish. She apologized and gave us the right dish so fast. She was super nice!"
        }, 
        {
            "index": 21, 
            "rating": 5, 
            "review": "I have to say...\nI always rank food at ethnic restaurants based on the simplest thing they make.\nI ordered Pad Thai, which is a good standard at a Thai place. Hands down, BEST PAD THAI. It's the best I've had. EVER.\nWe're had Tom Ka soup to start. I read on some review that it was bland. Www decided that we'd try anyway. Not mad we did. It was great. Super full of flavor\nMy husband had Pad Ke Mow. AMAZING. BEST HE'S HAD.\nThe service was awesome. Not overbearing but they came around enough that were didn't feel ignored.\nPrices were great. Servings were big. I'm a big girl. I can eat anyone under the table. It's true. However, i brought home leftovers."
        }, 
        {
            "index": 22, 
            "rating": 4, 
            "review": "From the time I moved to Vegas, I've been hearing about this Lotus of Siam rival. My man and I were searching for a different place to go and decided on Archi's since we were not far away. Not sure how they did it, but these folks nailed the \"cozy living room.\" Most tables are part booth, part chair, but all of them are comfortable and the lighting really adds to this resto's intimacy. Determined not to get our Thai standards, we opted for the silver noodles salad (sans chicken) -- which was an absolute stand-out, and the curry fried rice with crab meat (salivation central!!) Not so great were the seafood omelet (though the sauce that came w/ was delish!) and the eggplant with shrimp dish (while everything was properly cooked, the dish was super-duper bland -- my man and I were brainstorming things to add to spice this bad boy up!) Will I come back again? Absolutely!! Love this resto's ambiance and that they're mixing it up by offering folks more menu options than what the average thai place offers. Service is fantastic, with folks constantly checking up to make sure you're enjoying your meal.  Final plus: they stick to their guns on the spice level factor.  If you order a 5 of 10 on the spicy scale, expect to get exactly that!"
        }, 
        {
            "index": 23, 
            "rating": 2, 
            "review": "Food is delicious, but Service get very slow at times. Also had an incident of when a waitress hit me in my head with plates and when my husband argued about it with her she said it was my fault for not keeping my head out of her way."
        }, 
        {
            "index": 24, 
            "rating": 3, 
            "review": "Coming from Chicago I wasn't getting my hopes up on finding a authentic Thai place in Vegas...plus this place was in a strip mall. But, for the most part it was not as bad as I thought it to be. I wasn't that hungry so I ordered chicken satay with cucumber salad. The chicken skewers were huge but when I bit into them it was mostly fried and dark meat which I didn't really like. At first, it was good but then the grease got to me. The cucumber salad helped with that and I had some of my sister's rice which was very flavorful for white rice. Her husband ordered a shrimp curry that looked really good. He said it was good but not as good as this other Thai place in Chicago. The place was set up really nice considering it was in a strip mall. Lastly, those had to be the most comfortable chairs I've ever sat in while eating at a table in a restaurant! I could sit in those all njght!"
        }, 
        {
            "index": 25, 
            "rating": 4, 
            "review": "The best way to describe Archi's is consistently good Thai food.  \n\nI find myself eating Archi's at least once a week.  The recipes are excellent.  Great Pad Thai, Curry, Fried Rice, and sweet and sour pork.  The dinner prices are average but the lunch specials are great.  For $8 you can have the soup of the day, a spring roll, salad and your meal which is a very large portion.\n\nThe only inconsistency is the service.  Most days the service is friendly and fast but on an occasional busy lunch, the service can be slow and you may find yourself feeling unwanted.  I caution going to Archi's at exactly 12 noon.\n\nOther than that one complaint, Archi's is near the top of the Las Vegas Thai food scene."
        }, 
        {
            "index": 26, 
            "rating": 5, 
            "review": "I love this place!  The lunch specials are great.  I go here for my birthday every year to get Mango & Sticky Rice.  Pad See Ew is my favorite dish."
        }, 
        {
            "index": 27, 
            "rating": 4, 
            "review": "Great place to go for Thai food.  Good quality, authentic, tasty, and reasonably priced."
        }, 
        {
            "index": 28, 
            "rating": 4, 
            "review": "The food was great and prices are reasonable. Wait staff had a hard time keeping up because it was busy, and bathrooms were not clean even though we got there when it opened, but hey, it happens. Would go again."
        }, 
        {
            "index": 29, 
            "rating": 4, 
            "review": "Best spicy basil pork dish in Las Vegas.  Has subtle spicy and basil taste.  With ground meat.  Pork requires longer cook time than beef/chicken so the meat gets infused with the seasoning.  Chicken was good, but pork was better.   I like my spicy basil dish dry, not wet, and for the most part, Archi's does make the dish dry.  A wet dish means it wasn't cook long enough to infuse the meat with the flavors.  Unfortunately, the dish is inconsistently cook (sometimes wet and not as flavorful) so removing one star.\n\nThe other dishes that I tried were ok, but I didn't try many because I almost always got my favorite dish.\n\nNote that the restaurant sign outside does not light up \"Archi's\", only \"Thai Kitchen\".  So when you are looking for it in the dark, concentrating on finding a restaurant named Thai Kitchen because the Archi's is invisible.  Parking is plentiful out front (strip mall).  \n\nThe restaurant inside is warm and comfortable.  Service is very friendly."
        }, 
        {
            "index": 30, 
            "rating": 5, 
            "review": "I have been here a few times and they have the Best Pad Thai I have ever had.  Even better than Thai restaurants in California.  The fish cakes and eggplants was good as well."
        }, 
        {
            "index": 31, 
            "rating": 5, 
            "review": "One of my favorite Thai places in town. Great food and great lunch specials. They have good service too."
        }, 
        {
            "index": 32, 
            "rating": 4, 
            "review": "I am convinced that Archi's has influenced a lot of Thai restaurants in town.  In my opinion, this old restaurant has set the standard for Thai restaurants that stay moderately authentic, while at the same time appeal to the general public.  In my opinion, Archi's is a solid Thai restaurant, but it lacks the uniqueness and higher level of authentic Thai that I look for in a Thai restaurant.  \n\nMy Thai friend who is a cook told me that Archi's has good stir fries, but forget about the curries.  So, I thought I would try both.  We ordered the Thai tea, which was excellently balanced with sweetness and cream, the pad cha cha cha, the panang with chicken, and tom kha with chicken.  Let's start with my favorite dish, the tom kha!\n\nI loved the tom kha (khi)!  It has nice whole shrooms, with basil and a fairly good amount of lime juice, along with other yummy herbs.  The coconut milk was generous, and very creamy.  I think it could have been made a little more sour, since I prefer my khi's to be puckeringly sour!  However, underneath Thai Grill, this has to be one of the best tom kha's I have had.  \n\nNext up is the pad cha cha cha, which is a mixed seafood stir fry dish with a lightly spicy teriyaki sauce, and bamboo shoots.  The teriyaki sauce itself was a little bit on the generic side, but tasty enough to enjoy.  What did wow me though was the freshness of the squid.  It was nice and soft, not chewy at all!  \n\nThe panang, which I have heard was good from different people (and not so good from my Thai cook friend), was in my opinion an excellent version of the standard panang you'll get at any Thai restaurant.  It also reminded me of the chu che salmon at Thai Style Noodle House, but with a little less character.  Overall, it was tasty, but not overly unique.  I still think Thai Grill has the most unique curry flavors to date.  However, compared to other Thai restaurants, this version of the dish has a nice balance between sweetness, coconut milk, and herbs.  \n\nI struggled between three and four stars with this review.  However, Archi's has long been the favorite for a few Thai people I know, but today there are a few better restaurants out there.  For the sake of their history though, and their ability to help make Thai food popular in Las Vegas, I am settling on a four star rating today due to the previously mentioned facts, and that awesome tom kha!"
        }, 
        {
            "index": 33, 
            "rating": 4, 
            "review": "This place is to die for!! The red seafood combination curry is THE BOMB DOT COM! This place is nothing less then amazing! The serves are always coming to check on you and are very courteous. The place is super clean. Fresh vegetables, great portions, and service is excellent. This place is my absolute favorite Thai food spot. They are quick with your order and they have never disappointed with the flavor and quality of their food. They only thing I disapprove of is they are closed one day of the week!! Lol"
        }, 
        {
            "index": 34, 
            "rating": 1, 
            "review": "Well the food is so so not really good\nI was eating lunch with all my family this morning\nAnd the food was terrible and the server is unfriendly ..."
        }, 
        {
            "index": 35, 
            "rating": 4, 
            "review": "Can we say \"the perfect place for business ladies lunch?\" \n\nI was met with a smile, the place smelled wonderful. My party arrived shortly thereafter, our server was prompt and polite. The music wasn't too loud or distracting and the food... The food was awesome. I had the pineapple curry with just a dash of spice to kick it up and it was PERFECT! \n       Our server was attentive to our drinks, she checked in on us enough but not too much. She brought the check out when we were ready and didn't mind when we stayed and chatted a while once we were done. \n       I will return, I will bring more clients there and I can't wait to try other items on the menu."
        }, 
        {
            "index": 36, 
            "rating": 5, 
            "review": "I love pad Thai and I will be coming back here for more. Quiet place, courteous staff, large portions for a good price and food is delicious. They also ask you for a spice scale on your food on a 1 to 10 scale rather than mild, medium and spicy which I liked and I haven't seen that before."
        }, 
        {
            "index": 37, 
            "rating": 5, 
            "review": "Great Thai food, always enjoy the curry and Tom Yum Soup"
        }, 
        {
            "index": 38, 
            "rating": 5, 
            "review": "I wish I have mOar friends so I can order moAr dishes!! I can't get enough of the Pad Thai so I'm always content with just that. \n\nEverything here is great!  When they ask you how hot you want it on a scale of 1-10, try going lower than usual because I think they eye ball the spiceyness-touch.  Either that or the cooks have no taste bud because they are hardcore smokers..\n\nIf you don't know where to start try their Panang Curry, Tom Kha (coconut soup), or Pad Kapow. \n\nTheir sister's property on Rainbow is just as consistent as the Flamingo one (original location) just bigger and newer looking.  They have a third property on Sahara that I haven't been to but I can guarantee it'll be just as good.. \n\nNo refill on Thai tea ;/"
        }, 
        {
            "index": 39, 
            "rating": 2, 
            "review": "The pad kee mow was awesome! The country curry was bland and tasteless.\n\nFor the price there should've been a much larger size of the pad kee mow."
        }, 
        {
            "index": 40, 
            "rating": 5, 
            "review": "Portions were quite generous (we were stuffed beyond belief) and the food was top notch. Great service too. I typically like medium spicy food. I ordered my larb and my seafood green curry as \"7\" and I was ON FIRE. Mind you, both were so damned good that I ate them and just let my mouth flame. My other half ordered pad thai - it was huge. for dessert we had the mango mochi as one yelper suggested - it was quite yummy and was an effective means of cooling of my flaming mouth. I would come back here in a heartbeat. I wish the east coast had thai this good!!!"
        }, 
        {
            "index": 41, 
            "rating": 2, 
            "review": "This review is based on their drive thru take out. I ordered the pad see ew with chicken. The meat was definitely precooked and possibly frozen. The meat basically crumbled in my mouth. There was a TON of oil at the bottom of the bowl which suggests two theories, one.... there was too much moisture from the frozen chicken being thawed or two ......they just used a ton of oil to give moisture to the precooked chicken. \nAs far as flavor... It was okay. Had they cooked the chicken fresh, it would have been so much better. I probably won't come back because I know thai places that cook with fresh ingredients."
        }, 
        {
            "index": 42, 
            "rating": 4, 
            "review": "Pros: Authentic, savory, good quanity of food. Probably one of the best Thai restaurants I've been to. Wait staff is very friendly and quick to respond.\n\nCons: Can get spicy....from a scale of 1 to 10 if you order 5 and up, its guaranteed to burn your face."
        }, 
        {
            "index": 43, 
            "rating": 5, 
            "review": "The pad Thai is amazing....the best...we got it with a heat of four and it was hot but still flavorful...the basil pork was okay but I wouldn't get it again...Pretty much Italian sausage with veges....stuffed eings were good too..."
        }, 
        {
            "index": 44, 
            "rating": 5, 
            "review": "It is hands down one of they best if not the best Thai resturant in Las Vegas. I can never get enough pad thai and not to mention spring rolls. I can be seen getting take out here atleast once a month."
        }, 
        {
            "index": 45, 
            "rating": 4, 
            "review": "Wow! This place was fantastic. So, we didn't dine in, but rather did take out on a nice summer day when we would just rather eat out at the pool. I got the Thai Chow Mein, the wife got Lard Nar and we both had Thai iced teas. All items were very delicious. The Chow Mein was much lighter than I've had, but loved every bit of it. My only complaint with my dish, was that the tofu was only lightly fried. It was pretty soggy. It had a good flavor, but really would have liked it with a bit more crisp. The wife's lard nar was really good. The noodles were some of the best I've had. The gravy was a bit soupy, more so than other lard nar's we've had. The Thai iced tea was great. Not as sweet as others, which was nice. \nI am excited this place is so close to where we live, as we definitely will be back."
        }, 
        {
            "index": 46, 
            "rating": 4, 
            "review": "Good service, authentic food & quite environment :) we ordered crab fire rice, seafood green curry & pad Thai they are very yummy!"
        }, 
        {
            "index": 47, 
            "rating": 4, 
            "review": "After the all the great reviews here, we just had to check out Archi's. We fly into Vegas once a year for a convention and we are always looking for a great place to eat \"off the strip\". We did Lotus of Siam last year. Archi's has a lot to live up to. Took a $20 cab ride out here. Food is good but not great. Menu is a bit sparse. Green curry was very average. The ginger beef dish was very good and so was the salad and the chicken satay sticks. We don't need a full bar in a restaurant, but they'd probably get more business if they served beer and wine. You cannot buy ANY alcohol here at all so we settled for tea and water. Had to wait forever to get a cab back to the strip. Overall, food is probably a 4 1/2. Location and decor is about a 3 1/2 . Service was very good. Overall, a good restaurant, but nothing special and for the $40 cab ride out and back, we feel the Lotus of Siam has this place beat hands down, due to closer location to strip and much more interesting menu."
        }, 
        {
            "index": 48, 
            "rating": 3, 
            "review": "This place is right across the street  Kenny Guinn J.H. I went to Kenny Guinn years ago and this place got there after I left. But I went there and it was pretty good considering they have drive thru! Imagine that a drive thru for Thai food. Pretty convenient. Service was ok, but they could pay a litte more attention to detail in food."
        }, 
        {
            "index": 49, 
            "rating": 1, 
            "review": "This place has horrible service. They took 30-45 minutes just to bring one plate out. I would recommend the other location. I wouldn't waste my time."
        }, 
        {
            "index": 50, 
            "rating": 5, 
            "review": "This place is a must!  Not going to win awards for decor but who cares when the food tastes so good?!?!  \n\nPadsiew, padthai, geuidew-nam, you name it it tastes great.  \n\nI've eaten at his other places and like this one (the original) the best!\n\nI don't think we've had a bad dish here. You can't go wrong.\n\nI think they deliver too!"
        }, 
        {
            "index": 51, 
            "rating": 4, 
            "review": "This is the first Thai restaurant I tried in Las Vegas and I have been going back since. To me the original W. Flamingo location is the best if even only for nostalgic purposes but it is very small and only seats around 20 people. The other two locations are much bigger and more comfortable but something about the food is just not as good. \n\nI love getting the Tom Kha soup and mint chicken! Im getting really hungry just typing about it! The lack of 5 stars is due to the inconsistent spicy rating system. Some times I order a spicy #5 and its fairly bland and other times it burns a hole in my esophagus. But other than that the food has always done a spectacular job of quenching my Thai food cravings."
        }, 
        {
            "index": 52, 
            "rating": 5, 
            "review": "WE LOVE ARCHI'S!!!!  We were in Vegas one year celebrating our anniversary and we were craving good Thai food.  The front desk lady at the Venetian recommended Archi's.  So taking her advice we tried this place out.  Since then, we try to hit up this place whenever we are in town.  I swear this place is sooooooooooooooooooooooooooooooooooooooooooooooo  yummy!  :) :)  Their yellow curry is exceptionally good and very flavorful. I highly recommend it.  We typically order their Pad Thai and Pad See Ewe and Satay as these are our favorite Thai dishes.  Archi's does a great job with them all.  Everything we have tried thus far has been awesome. \n\nWe look forward to eating at this place whenever we come to Vegas."
        }, 
        {
            "index": 53, 
            "rating": 2, 
            "review": "I don't get it. \n\nThis was probably the most un-Thai like Thai food I've ever had. I had a lunch special. Red curry with some fried things resembling eggroll and wontons, some steamed rice and some really nice lemongrassy soup. The soup was the only thing I enjoyed.\n\nThe curry was...bland.\n\nBland...Thai...food. I can't imagine much worse in culinary sins."
        }, 
        {
            "index": 54, 
            "rating": 4, 
            "review": "This restaurant is certainly a hidden gem! It is a little ways from the strip, but it us worth it! \n\nThere were two of us and we ordered the Kung pao chicken and shrimp pad Thai! We also got an appy of the Thai spring rolls.\nThe very best part of the meal was the low price!!\nGreat restaurant!!"
        }, 
        {
            "index": 55, 
            "rating": 5, 
            "review": "We usually go to the one on Rainbow and Sunset if possible. But for Lunch orders to be picked up, this place is the best. Usually a few people are in the dinning room, but super quiet. They have seating in the back and it's totally awesome back there. \n\nTheir staff is amazing and have never said no when asking for extra chop sticks or sauces. I'll always be a fan!"
        }, 
        {
            "index": 56, 
            "rating": 2, 
            "review": "Have been enjoying their food for the past year, went for a business lunch at 11:45 and we sat there for over 50 minutes before any food came to the table. Two other tables had the same problem as us. We had the same service problem three weeks ago at their other location. Called the manager to the table and he wanted to lay the problem off on inexperienced wait staff ... as if that were an excuse in general, but it was the same waitress I've seen around the place for the past year.\n\nFood tasted good, but the delay just makes it too hard to justify taking a chance when business is involved."
        }, 
        {
            "index": 57, 
            "rating": 4, 
            "review": "I went to this location only to find out, they have a location close to my house.  Fortunately, I was heading to the strip so it didn't matter.  Started with the beef salad.  It was nice and fresh with a nice light flavorful sauce.  I asked it for 8 out of 10 on the heat scale.  I didn't find it hot, so if you like spicy, order everything at a 10.  I also had an order of combination pad thai and penang curry.  The pad thai was the weakest of the dish.  A little on the dry side.  I ordered the curry at a 10 and it was nicely executed with decent heat, definitely not hot as I wanted.  The food is good quality but a little \"white washed\"."
        }, 
        {
            "index": 58, 
            "rating": 5, 
            "review": "We love Archie's.  Why?\n1)  Delicious pad thai, and pad woon sen.\n2) Huge portions at reasonable price.\n3) Great atmosphere. this is like an oasis in the Mojave desert."
        }, 
        {
            "index": 59, 
            "rating": 5, 
            "review": "Wow food there is amazing. I went with a local vegas friend and man we ordered way to much food but it was sooooooooooo good. I love eating thai food and this place is authentic."
        }, 
        {
            "index": 60, 
            "rating": 1, 
            "review": "This is strictly to the owner/owners I eat at Archie's once a week sometimes twice. I walked in at 9:35 Tuesday 8/18 to order to go and a young man told me the kitchen was closed! Kitchen does last call at 9:30! Seriously? If this is the case why isn't this included in operation of hours? Second of all I have never been turned away ever and I have came in at 9:45 sometimes 9:50 because me and my wife are off at 9 and we meet to go dine at Archie's. Please post your kitchen all of a sudden closes at 9:30? I could understand this if you had a bar! This was a bad experience, and I have been to this restaurant about 25x this year alone"
        }, 
        {
            "index": 61, 
            "rating": 4, 
            "review": "I like to get off the strip and eat when I'm in Vegas. These are the places that are worth the drive and won't rape your wallet. My friends and I came here because of the great reviews on yelp. The place was a small little restaurant with drive thru. I recommend this spot for Thai food loving people. \n\nWe ordered the Pad Thai, Pad See Ew, Red and Yellow curry , Pinapple Fried Rice and Tom Yum Kai soup. Everything that came out was delicious. Also got the Thai Tea which came in a large glass and filled me up. I came out here extremely full and satisfied. Next time for you usual Las Vegas STRIP eaters. Try getting out of the area for a bit and give the hidden gems a try."
        }, 
        {
            "index": 62, 
            "rating": 5, 
            "review": "My second favorite of the Archi's locations around town. They have all the same great menu items. Some cosider this their favorite location because it's the original, but I enjoy the rainbow location's ambience and service slighty better. Still great and definitely worth the trip here though! \n\nAs with all the Archi's locations I stick with tofu, pork, beef and vegetable most of the time. The chicken always tends to be a little dry and overcooked. Just my personal opinion. Pad Thai, Papaya Salad, Curries, Tom Kha with Veggies and Thai Jerky are my favorites, but there really isn't a bad thing on the menu, except the Thai Macaroni, just stay away from that!\n\nHappy eating!"
        }, 
        {
            "index": 63, 
            "rating": 4, 
            "review": "\"Hurts so good\"...it's gotta be the theme song to Archi's.\n\nThis place needs a disclaimer or some kinda waiver form.  They need to let you know that if you want to be macho and order some spicy food, they are gonna beat you like a 2 dolla ho.  my goodness, this place is serving up some super spicy food...on to the experience...we arrive around noon on Sunday and are promptly seated.  Menu looks to have typical thai fare and I roll with the pad kee mao which is flat rice noodles with veggies, basil and your choice of meat.  I order the beef and then comes the million dollar question:\n\nHow spicy would you like that sir?\n\nThat's so loaded when you're asked that in front of  a bunch of friends.  it's like the 'do these jeans make me look fat' question.  it's complicated.  I like spicy food and at thai places around the bay area, i order med-hot and i can finish my food and enjoy the heat.  Here, they have a scale of 1-10 here so I feel like 7 is pretty safe.  That along with a thai iced tea seemed like a safe choice and then it begins...\n\nthe noodles came out piping hot and it honestly did not look spicy.  there wasn't any chili oil or a bunch of chili flakes.  It looked like a great dish of noodles...until i took my first few bites.  holy hell, the noodles were marinated in devil piss or something.  I could not stop sweating.  halfway through my dish, it looked like i ran a marathon.  beads of sweat running down my cheeks.  The thai iced tea was my life line.  I was a sweating mess by the end and I couldn't finish my food because the heat was too punishing.\n\nDon't get me wrong, the food was delicious.  flavor profile was great,  but it was....painful.  minus 1 star for no warning on the heat scale being off the charts.  Order a 4 or a 5 and enjoy the food.  Seriously.  If you challenge the heat, remember this: \n\nHot In and Hot Out."
        }, 
        {
            "index": 64, 
            "rating": 4, 
            "review": "I'm really picky about Thai food since we go to some good places in the Bay Area.  But Archi's Thai is just as good as our favorite Thai place in the Bay.  The crab fried rice was YUMMY and the pad see ew was really good too.  It was nice alternative than eating on the strip and they have a drive thru too.  It was reasonable priced and I'm sure we would go again the next time we are in Vegas and we have a car."
        }, 
        {
            "index": 65, 
            "rating": 4, 
            "review": "This place doesn't look like much but it is soo good.  We came here for lunch and everyone was talking it up so I was excited.  I had the Pad Thai lunch special and it was great.  They asked me for spicy level 1-10 and I gave them a 7 but I could have gone higher.  However my co worker gave them a 5 and was chugging water - so it all depends.  This place has great portions, good lunch specials and it was delicious."
        }, 
        {
            "index": 66, 
            "rating": 5, 
            "review": "Sawadikap! *:) My husband's family and I went to this restaurant to celebrate my sister and brother -in-laws' birthdays. This restaurant doesn't serve alcohol, so if you love wine, bring your own bottle. We had some papaya salad, chicken satay and salad for a start. I had a green curry tofu dish for my entree. Hubby ordered pad thai for his entree. But I wouldn't order pad thai here. Overall I enjoyed my dish. I think the green curry came out great. I finished the whole plate *:)~  I do recommend the green curry. We'd visit again the next time our trip brings us to Vegas. Enjoy!"
        }, 
        {
            "index": 67, 
            "rating": 5, 
            "review": "Great service rather you dine in or take to go. People that work here are always smiling and even when they are busy they seem to enjoy their job. Did I mention the food is amazing!? Can't say I have had one bad thing here. Crab Fried rice, Mongolian, Yellow chicken curry! All amazing."
        }, 
        {
            "index": 68, 
            "rating": 4, 
            "review": "I'm going to base this review on my aunt's and cousins' reactions because they aren't on Yelp and I don't typically choose to eat out Thai food (since..well...my family is Thai so I get the best of it ALL the time at home!):\n\nVisitin from the Bay Area, my aunt and uncle were craving Thai food, so my Vegas-residential-cousins took us here because they believe that it is the MOST authentic Thai Restaurant in Vegas.\n\nAnd they were right. My aunt (who cooks the most AMAZING Thai food) loved everything we ordered:\n\n1) \"Oyster Pancakes\" \n\n2) Pad Lad Na \n\n3) Moo Krapow (Pork Krapow)\n\n4) Yum Woonseen (Glass  noodle salad)\n\n5) Moo Pad Prick (Pork tossed in a chili based sauce)\n\n6) Khang Bhaa (Clear soup curry with veggies and meats) \n\n#1-5 all tasted pretty darn authentic to me, too! \n\n#4 was super spicy! (Maybe bc I'm a weak sauce Thai person...)\n\n#6 wasn't on the menu, so my uncle special ordered it - he didn't think it was all that and feels that you should just stick to ordering things on the menu because that probably wasn't something they knew how to make properly..\n\n---AMBIANCE---\nThis restaurant is pretty small, and on a Thursday night for 5 people - we had to wait about 15 minutes before being able to sit. \n\nThe decor is very very simple with a few paintings scattered here and there. They play very soft Thai classical music in the back that made me feel like I was in Thailand momentarily...\n\n---SERVICE---\nMy aunt was very impressed with the waitresses -- who were all very sweet, smiley, efficient, and polite. (Thai elders are very hard to impress...and they were thoroughly impressed).\n\n---VALUE---\nHuge amount of food! We had tons left overs.\n\nSupponsingly you can come here for lunch and get a huge entree and an eggroll for about $6.50."
        }, 
        {
            "index": 69, 
            "rating": 5, 
            "review": "AHHHH! I absolutely love this place. My cousin and her husband who practically eat anywhere and anything at anytime they want because they can afford it told me this is one of their favorite restaurants. And after trying it out for myself I can definitely agree! Let me start with the interior, this location is sort of has an odd stand alone building in the middle of a parking lot for a shopping center. But the inside is really nice because it's like your Aunt's classic living room, which has a nice home feel to it. I ordered the Pad Thai, which was in the lunch specials part of the menu. Let me just say the best Pad Thai I've ever had! Amazing flavor! I'm getting hungry just thinking about it! Service was good too and always good to know since Asian restaurants can be really rude sometimes. I recommend this place to everyone and I have been ever since I've tried them. 5 stars well deserved!!"
        }, 
        {
            "index": 70, 
            "rating": 5, 
            "review": "they have a drive-thu pick up window pretty sweeet , their restaurants clean. Spicy beef salad is my s#!&"
        }, 
        {
            "index": 71, 
            "rating": 5, 
            "review": "Love this little thai Kitchen.  My favorite Thai restaurant in all of Las Vegas.  I especially like this location, not their other locations.  The food is always up to my standard, and I have eaten a lot of thai food from all over the place, including in Thailand.  The place is small but very clean, the service is fast, and wait staff very frlendly.  I have recently moved far away from this place but I still continue to drive to it whenever I need a Thai fix."
        }, 
        {
            "index": 72, 
            "rating": 5, 
            "review": "My favorite thai restaurant in Las Vegas! Man their thai tea is amazing! I've never had a dish I didn't like. Their staff is very friendly and attentive. I'll be back again and again."
        }, 
        {
            "index": 73, 
            "rating": 5, 
            "review": "I'm really not going to delve into the authenticity of this place with my review. I'm not Thai, I don't know how to cook Thai food.. I'm really no expert. That being said...\n\nWe went for lunch today and I was blown away by the food. We were the only patrons when we arrived at 11:20. By the time we left at noon, it was packed. Arrive early my friends! \n\nLunch specials are a reasonable $6.95. I've never seen a Thai place with lunch specials, but clearly I've lived a sheltered existence. \n\nChicken pad thai - I guess they make it the \"Americanized\" way, but I don't care.. it was so damn tasty. The portion is quite large for a lunch portion (approx 2 cups?). I couldn't finish half of it. I almost made myself sick trying to eat it all.. yup, I'm a fatty.\n\nBeef with bell peppers - a much more modestly (read: appropriate!) sized entree. The beef was very high quality for an asian stir fry type beef and the bell peppers were tasty as well. While there's nothing special about this dish, it was of high quality and it seemed to be relatively low calorie if you're eating light. Served with white rice.\n\nAll lunch specials were served with a wonton (seemed to have meat in it? yumm), egg roll (just ok!), and soup of the day. The soup today was chicken coconut soup. I think the lady called it that because I'm not asian, because it tasted like Tom Kha Gai to me! A mini cup of Tom Kha Gai to wash down my pad thai with? I'm in heaven. \n\nService was fast, and like I said many times.. the food and ingredients were all top knotch. A pleasant surprise for $6.95 each! I'll definitely be hitting this place again."
        }, 
        {
            "index": 74, 
            "rating": 3, 
            "review": "Pros: the portions match the price point therefore come hungry !!! Haha food is of quality and the atmosphere is nice. While the service isn't completely catering to the customer it is still good and they will come to you once you call them over. \n\nCons: first of all this is totally opinionated so make your own judgement on the following statements: I was not as intrigued by the flavor combinations. I've ordered my three dishes (pad Thai spicy string beach chicken and Panang curry) at many Thai restaurants  and this restaurant has to have my least favorite in flavoring. It was very under seasoned for me personally. All I rated in the Panang curry was coconut milk whereas other places I get a more fragrant herbal smell and overpowering taste. Also the chicken was completely over cooked I had to chew on it like it was bubblegum. \n\nAs of returning, this restaurant goes on my maybe list because it is out of my way and I wasn't 80-100% satisfied"
        }, 
        {
            "index": 75, 
            "rating": 5, 
            "review": "I finally had the chance to check out Archi's for a lunch date. I could kick myself for missing out all of this time. I live not far from this small yet cute and cozy Thai restaurant and have passed by it every day. The menu is full of many good looking options and we tried the lunch special shrimp pad thai and sweet and sour shrimp. The service is friendly and the food is delicious. Mmmmm yum yes I want some more! Thai me up please!"
        }, 
        {
            "index": 76, 
            "rating": 5, 
            "review": "BAD ASS Thai! (Sorry maybe i should have used that description with thai food) but it is GREAT! The key things I look for in Thai and other ethnic foods are 1. Quality 2. Taste #. Consistency! if this restaurant has met these criteria I will frequent these places always...and I do! Every trip to vegas after finding this place I have eaten here! Never disappointed and food is always great! Don't get me wrong...Hawaii has its share of good thai food but this place...for some reason BEATS them every time!"
        }, 
        {
            "index": 77, 
            "rating": 4, 
            "review": "Every time I visit my brother in law, I demand we go here at least once! The thai iced tea is amazing, and my favorite dish is Ginger Chicken! So good!"
        }, 
        {
            "index": 78, 
            "rating": 5, 
            "review": "Archie's does it right. They are great about acknowledging my daughter's allergies. Chicken & eggplant, pad soon sen, and pad prik king are some of my favorites. Flamingo location has a take out drive though. Super convenient."
        }, 
        {
            "index": 79, 
            "rating": 4, 
            "review": "Thank you Yelpers of Vegas for leading me to this great  choice for dinner :) On my visit here my party tried the following dishes and were not disappointed!\n\n- Pad Thai - tasted great! The portion pretty much matched the price and we ate it all up. \n- Spicy Basil - Here they rate their spicy from a level of 1-10 which is probably too much of an array to tell how much spicy you really want. I was with a party of people who couldn't handle their spicy so a 3 was just right for them. \n- Satay - delicious appetizer, serving of 4 so it was the easiest to split.\n- Pad Pak - great choice if you want to get in your veggies with some Thai spice.\n\nOverall, it was worth the trip off the strip for saving some money without giving up great taste. This place does have a lot of space but I'm still very glad that I made reservations because it filled up that night! Service was very friendly and my water never reached the bottom :)"
        }, 
        {
            "index": 80, 
            "rating": 4, 
            "review": "I've had home made thai food,  and this was the first time I've been out for it.  I was not disappointed.  This place was excellent!  The food was great,  the service was good,  and the prices were very good.  We ordered the spicy basil,  red curry, pad thai, chicken satay,  and stuffed chicken wings.  Everything was absolutely fabulous.  We will definitely visit this restaurant again!"
        }, 
        {
            "index": 81, 
            "rating": 4, 
            "review": "What a delicious last meal in Vegas, all thanks to Archi's Thai Kitchen, I'll will be back! \n\nDishes: Fresh Springs Rolls, Chicken Pad Thai, Beef Pad Thai and Shaved Ice \n(Pictures will be posted)\n\nArchis has a VERY friendly waiting staff! As for the atmosphere, it has this vintage and inviting feeling like a house! It was nice enough so you didn't feel cramped. I would highly recommended trying the pad thai! Coming from NYC, and having a love for Asian cuisine this is probably one of my top two places. The shaved ice desserts is deceiving because it was not shaved ice. When I think of shaved ice, I think of Malaysian Ais kacang (ABC). This seems more like a type of ice cream but the texture is different from store bought brands. The shaved ice here is some type of ice cream topped with condensed milk and boba! I would still recommended this dish as well. \n\nThe only reason this restaurant did not get five stars was because of the Fresh Springs Rolls. Fresh Springs Rolls reminds me a lot like sushi.The steamed rice paper that wrapped the other sides is unable to hold all the other ingredients. When you pick it up everything falls apart making it very hard to eat."
        }, 
        {
            "index": 82, 
            "rating": 4, 
            "review": "Last night, my family and I had dinner here. The place was clean, orderly, and the staff was very cordial and friendly. The dishes didn't take long to receive either. That was a super good thing because I was stupid hungry after a 6hr tattoo session! I don't remember how much it all cost because my bro (THANKS BROSKI!) snatched and covered the bill before any of us could grab it. I'd recommend this restaurant to others. I'm sure they'd enjoy it as much as we did. I would have given them 5 stars if the portions were just a lil' larger and the chicken was sliced instead of ground. Tastes the same but I like that texture better."
        }, 
        {
            "index": 83, 
            "rating": 5, 
            "review": "Best Thai food I've had in many years.  Great service, huge portions.  Everything was fresh, tasty and a fine example of the cuisine.  Well priced.  The best meal I've had since arriving in Vegas over a month ago."
        }, 
        {
            "index": 84, 
            "rating": 4, 
            "review": "This is my favorite Thai place in Vegas so far.  Looks like a fast food joint on the outside (even has a drive-thru window for quick take out pick up), but inside it's very classy with cozy tables and an aquarium.  The food is always fabulous!  I would highly reccommend the Spicy Eggplant, and of course the Pad Thai.  Skip the spring rolls though.  Spiciness levels can vary- sometimes \"5\" is just perfect, other times way too hot, so be careful!  Excellent service- very polite and friendly servers.  Never much of a wait either."
        }, 
        {
            "index": 85, 
            "rating": 5, 
            "review": "the catfish delight is my favorite dish in all restaurants in vegas. i truly mean this from the bottom of my heart."
        }, 
        {
            "index": 86, 
            "rating": 2, 
            "review": "It takes 20 minutes just to get something off the damned lunch menu. Left me NO time to sit down and enjoy it. Huge black mark in my book."
        }, 
        {
            "index": 87, 
            "rating": 4, 
            "review": "Small place, you can hear your neighbors conversation but, greatest Tai food better than fancy places and the bill is half the price."
        }, 
        {
            "index": 88, 
            "rating": 5, 
            "review": "This is my favorite Thai restaurant. I have frequented this location on average 2 times a month for a couple years now.\n\nI usually order the Po Tak soup and Chicken Panang Curry sauce with extra veggies. It comes with rice. When I don't get soup, the Pork Satay with peanut sauce is usually my alternate choice. The satay is the best I've ever had because of its tender, large chunks of meat, and the peanut dipping sauce. \n\nHe usually gets the Pad Kapow (pork) and the Pad Thai (chicken). They are excellent.\n\nMy favorite dessert in the summer is their fresh imported mangos with sticky rice and coconut milk. \n\nThey add spices according to your liking and tolerance level. I like my food a little spicy - but not hot. A three is perfect for me in the summer and a four in the winter. He usually gets a level 10, and I usually watch as he drools and eats packets of sugar. \n\nI enjoy their Jasmine hot tea, the excellent service, clean restaurant, and atmosphere. Ask for Ten, she's the best server."
        }, 
        {
            "index": 89, 
            "rating": 5, 
            "review": "I love Archi's close to home and delicious every time!"
        }, 
        {
            "index": 90, 
            "rating": 5, 
            "review": "I love this place but I wish they picked up the phone to do Togo orders more often . Ahh I call all the time . Sad face ."
        }, 
        {
            "index": 91, 
            "rating": 5, 
            "review": "When I have enough time and appetite that craves good Thai food, I hit this place. Unlike typical Thai places, this one doesn't smell and tables are clean. 5 stars for that. Service is really good. And food tastes much better!!\n\nTheir basil rice is amazing! For some food items they use Sesame oil and I don't like it."
        }, 
        {
            "index": 92, 
            "rating": 2, 
            "review": "We found Archis to be the \"olive garden\" of Thai reastaurants. The food is fresh but flavorless. It is laughable that they claim to be an authentic Thai restaurant. The service is very cold and distant. There are many Thai restaurants better in Las Vegas."
        }, 
        {
            "index": 93, 
            "rating": 4, 
            "review": "Can you handle the heat?\n\nAfter reading some of the other reviews,I went with 3's and 4's on my order.  I had carry out Beef Salad, Pad Kapow with chicken, Spicy Eggplant and Thai Iced Tea.\n\nDespite going low on the number values for spiciness, I gotta say that even 3's and 4's still kicked my butt.  \n\nThe food is good and the service is friendly.  Just be sure to order a lower number than usual!"
        }, 
        {
            "index": 94, 
            "rating": 4, 
            "review": "Archi's is the next best thing to Lotus of Siam in Vegas. It is closer to my place, and it's VERY good! Their curry & catfish are my fave and I love them spicy! If you want authentic Thai food, go to Archi's!"
        }, 
        {
            "index": 95, 
            "rating": 4, 
            "review": "Stopped here while in Las Vegas for a trade show. The service was good, the place was clean with nice lighting, and most of the tables were full. Had the green curry and spring rolls. Food was great - I made sure to order mild after reading the reviews on here. The sticky rice wasn't exactly right - it was more like steamed rice - but it was still tasty. I agree with many other reviewers that this place is more Thai-American than purely Thai. But that's not a bad thing - the food was delicious, fresh, and fast. I definitely recommend Archi's Thai Kitchen."
        }, 
        {
            "index": 96, 
            "rating": 5, 
            "review": "My family and I have been going here for about 3-4 years and we absolutely love it. We get the same things every time (despite the increase in prices due to popularity). Staff pretty much know what we want by heart lol and they always recognize us when we stop by. They're friendly and considerate + getting your food never takes too long. I can't even think of a time they ever got our order wrong and it's a pretty large order considering my family's size! They're overall a great place and we always recommend them whenever anyone ask about local Thai food!"
        }, 
        {
            "index": 97, 
            "rating": 5, 
            "review": "One of my favorite Thai places to go to for lunch.   Extremely cheap and really delicious food.    The service was pretty quick, my girlfriend and I were seated in a booth right away and we took advantage of the lunch specials.  \n\nEach of our lunch specials came with soup (cucumber soup?) which I downed quickly and a salad.  I ordered a beef and curry dish while my girlfriend chowed down on her pad thai.   I liked this place's pad thai better than Lotus of Siam's however I still crave Lotus' beef penang..mmm.\n\nThe Thai Iced tea served here was well made here too."
        }, 
        {
            "index": 98, 
            "rating": 5, 
            "review": "I was in Vegas for the night, and had called my cousin out for dinner. We had initially wanted to go Italian, but at the last minute decided that Thai was a better option. The window sticker suggests that this is the best Thai food in town, and leaves room to wonder whether it really is. We started with the fresh spring rolls, and ordered pineapple fried rice w/ shrimp, spicy eggplant (which they label as eggplant spicy) w/ tofu, pad pak w/ chicken, and the pad kapow w/ beef. \n\nTo start, the spring rolls were rolled with a non traditional rice sheet, and were not made with the usual ingredients. Even the peanut sauce seemed a bit lacking. The spicy eggplant had just enough grease to make it delish, and the fried rice was to die for. I barely touched the pad pak, and almost steered clear of the pad kapow - like eating mashed up beef patties. Despite the less favorable dishes, I am still craving me some Archi's!"
        }, 
        {
            "index": 99, 
            "rating": 5, 
            "review": "Love this place.  Eat lunch there once a week.  Red curry lunch special is only about $8 or $9 dollars.  It comes with soup, salad, rice, egg roll and the curry.\n\nNice decor, good service, low prices and tasty food.  What more could you ask for?"
        }, 
        {
            "index": 100, 
            "rating": 4, 
            "review": "Best panang curry in town. Service is excellent although the younger employees' English is iffy. Great take out as well."
        }, 
        {
            "index": 101, 
            "rating": 5, 
            "review": "A HIDDEN GEM in the Vegas desert!!!!!\n\nThis place is excellent. The food was great. Service top notch and friendly!\n\nWe have eaten in many Thai restaurants and this one is most likely the very best we ate in.  Zagat rated four years in a row and many other countless awards this place has accumulated including a Michelin award.  With that fact in mind, we are in for a treat.\n\nWe ordered Garlic Pepper Beef and Ginger Ginger Ginger Chicken.  Both plates were FLAVORFUL and DELICIOUS.  I think the word I was looking for is UMAMI !!!!!\n\nThis one, is a must stop for anyone that is craving for Thai food.  It is very authentic and prepared by Thai cooks.  EXCELLENT prices as well and definitely worth the wait when food is being prepared.\n\nThe staff was very friendly and attentive.  Keep up the GREAT job!!!!!\n\nFood     =     A+\nStaff      =     A+\nDecor   =     B+"
        }, 
        {
            "index": 102, 
            "rating": 4, 
            "review": "In the mood for Thai. stop by one of the few Archi's. Everything is good. Prices are reasonable and the atmosphere is good."
        }, 
        {
            "index": 103, 
            "rating": 5, 
            "review": "Great food. One of the best Thi places in Vegas.  Highly recommended . Been here few times and each time been great"
        }, 
        {
            "index": 104, 
            "rating": 4, 
            "review": "Love this place! So good! Nom Nom Nom!!! Love the amount of veggie friendly options they offer!"
        }, 
        {
            "index": 105, 
            "rating": 4, 
            "review": "Archi's is an old dependable.  Having been to 3 of the locations over the years, you get very predictable quality food at reasonable prices with pleasant service.  Short of having spectacular food, that's about as much as you can ask for in a Thai restaurant.  \n\nAll of their locations are pleasantly decorated, but the Village Square branch is bigger and more modern in its setting.  I find Thai restaurants to have generally pleasant service overall, but I think Archi's goes even a step beyond that.  Their food is at least good, with some great dishes.  I'm partial to the Thai Toast, a must have appetizer in my book.  It's a flavorful meat \"stuffed\" onto toast slices, served with cucumber & onion salad.  LOVE this dish.  Their papaya salad and beef salad are also very good.  For main dishes, I like all their curry dishes and the spicy basil dish, and you can't go wrong with their pad thai.\n\nUnless you find that spectacular Thai place, this is the place where you will not be disappointed and can find some great surprises.  There's a reason why this chain is so popular and continues to expand.\n\nTable-for-1 Factor:  I went to lunch at the Flamingo location and there were several people eating alone.  So it's at least good for lunch, and I think it will be okay for dinner as well.  Atmosphere isn't intimidating so I don't think it will feel too awkward."
        }, 
        {
            "index": 106, 
            "rating": 4, 
            "review": "Dissizzsum good Thai food.  Ordered 5 different dishes, with varying heat from 3 to 7.  The satay appetizer and pad Thai are some of the best I've had in Vegas as was panang curry.  Everyone enjoyed their dinner and service was great.  Will def return!"
        }, 
        {
            "index": 107, 
            "rating": 4, 
            "review": "My husband used to be in Vegas for work pretty frequently and he loved this place so when we stayed at the palms this weekend we had to stop by (it's probably less than 2 miles down the road). We split the wontons and the red curry for lunch and it was plenty of food for both of us.  The curry had great flavor without being too spicy ( I don't like things super spicy so we ordered it as a 2 out of 10)."
        }, 
        {
            "index": 108, 
            "rating": 4, 
            "review": "Went in on a Saturday night for an early Mother's Day dinner. I had heard wonderful things about this place so we decided to try it out! We ordered pad Thai which was delicious and a hearty serving, Mongolian beef (Mongolian sauce over beef with opinions, bell peppers, mushrooms and carrots although it had more veggies then beef) but had an over all good flavor and tenderness and last we ordered spicy basil chicken (ground chicken with zucchini bell peppers and basil)which had excellent flavor. Our entrees were ordered at a spicy level 7 which had spice but wasn't overly spicy.brhe restaurant was small and quiet and we had a 2 yr old toddler so next time we will be ordering take out unless it's a date night!  Loved the food here we will definitely be eating this again!!!"
        }, 
        {
            "index": 109, 
            "rating": 5, 
            "review": "Archie's opened a third location! It is located in the Village Square at Sahra and Ft. Apache. As usual, great food! The owner cooked it himself!\n\nI can't believe kayla's comments. She's obviously isn't famaliar with Thai food to say Archie's food is \"un-Thai.\" As a matter of fact, the curry is made from scratch, not from a paste. I had a Thai maid when I lived in Asia and I KNOW WHAT REAL THAI FOOD tastes like and THIS IS IT!"
        }, 
        {
            "index": 110, 
            "rating": 4, 
            "review": "This place is great as far as quality of food and value all rolled up into one. We went w/ the green curry (the only thing my wife seems to order any Thai restaurant we go to) and I got the beef pad kee maw.  Throw in a big thai iced tea and the whole thing came to just a a few cents over $20.  \n\nThis definitely would've been more at Krung Thai and Thai Spice so you simply can't beat the bangness for the buckness."
        }, 
        {
            "index": 111, 
            "rating": 1, 
            "review": "The service is absolutely disgraceful. I stayed in Thailand and had always enjoyed the world famous Thai hospitality...but sadly not in this restaurant. Good was good but the service brought everything down to 1 Star rating. If there was a half-star rating...they probably deserved it"
        }, 
        {
            "index": 112, 
            "rating": 5, 
            "review": "My friends and I were staying at a resort off the strip which took forever to get into and out of due to construction. We looked to Yelp for dinner choices because we did not want to get stuck in more traffic on Las Vegas Blvd, did not feel like walking in our high heels, preferred to spend our dollars on booze, and were sick of 24-hour cafe food choices. \n\nWe ended up at Archi's for a quick, cheap and tasty meal. We shared some Fried Wontons, Seafood Soup, Pad Thai and Chicken Yellow Curry (all spiced to # 6). All had excellent flavor and were perfectly spiced (I know it is spiced correctly when my nape is sweating even while my tightly clipped bun is still dripping from my shower).  The service was quick, the prices are reasonable, definitely a must-eat if looking to venture off the strip."
        }, 
        {
            "index": 113, 
            "rating": 5, 
            "review": "I love this place!! Our office orders every week. We can never get enough! They are so friendly too. We have the most pickiest foodies and they always accommodate!"
        }, 
        {
            "index": 114, 
            "rating": 5, 
            "review": "Best Thai I've ever had.  \n\nThe Pad See Ew with pork was just ridiculously delicious and\n flavorful.  I still dream about it.\n\nThe yellow curry with chicken is the best ever.  \n\nThe Rad Nar is a little more muted in flavor than the others but was also very good and cooked well.\n\nWe were the only people in the restaurant, and the service was excellent.\n\nI would make it a point to come here every time I'm in Vegas, it's that good."
        }, 
        {
            "index": 115, 
            "rating": 4, 
            "review": "雖然他是美國式的泰國食物，可是還蠻適合我們亞洲人的飲食。裝潢的還蠻有泰國為風味，價格還蠻優惠實在。我很喜歡來這邊吃飯，因為這裡的服務，服務態度非常好！適合跟朋友來這邊吃飯聊天。是一個不錯選擇的地方！"
        }, 
        {
            "index": 116, 
            "rating": 4, 
            "review": "Today my fiancé with me went to this restaurant, the food was awesome. I love the Tai Tea and the coconut seafood soup. The only thing not good is the services. Tonight was a bit busy and I observed not enough server. When I ready to order, the server came and asked me what I want, I just want to point the food name on the menu and show it to her, I was checked the name where is it, just 2 second, she asked me \" are you ready to order?\" Asked me two times, I feel not good, like they push you to hurry up. After that, she left a couple moment when I ordered and she said nothing like\" I'll be back.\" I work in restaurant too, I really understand when is busy, everyone will become crazy. I mean your restaurant is very good, the location, decoration and the food is awesome. But if can more friendly it will be more more awesome for the whole image.  I will come back next time, I hope I can see the different because I really love this restaurant!!"
        }, 
        {
            "index": 117, 
            "rating": 3, 
            "review": "This isn't a very fancy restaurant, but it's a nice atmosphere if you want to come with friends and have a decent meal.  I had the Cashew Nut with tofu, spicy level 7 (on a scale of 1-10).  There weren't many customers in the restaurant, so my food came very quickly, probably in less than five minutes.  The portions were of a decent size, but they were a little too liberal with the onion.  The whole dish was basically covered in onion.  It's like they chopped up an entire onion and put it on my food.  I didn't mind because I'm fine with onions, but for most people it might be a little much.  \n\nThe wait staff was very friendly.  I'm not a very bossy person so they don't really have to do much for me.  \n\nOverall, a decent meal, decent portions, at a good price."
        }, 
        {
            "index": 118, 
            "rating": 5, 
            "review": "I do not miss Vegas, but I definitely miss Archi's. \n\nI used to go to Archi's about once a month with the ex, and we would order Thai iced teas, either the red or yellow curry tofu and the basil tofu, each at level 7-9...mind erasingly good. Unlike most Thai places, when you ask for spicy they give it to you on the Thai scale rather than the 'yeah right, whitey' scale, which I've come to recognize as a mark of respect. The service was always terrible and the place is tiny, but the heavenly food makes up for these mortal flaws.\n\nI know this constitutes blasphemy, but in terms of vegetarian Thai food I think Archi's holds its own against Lotus of Siam."
        }, 
        {
            "index": 119, 
            "rating": 4, 
            "review": "They have a couple of locations in town by far this is my favorite location! Not as packed as the other ones better customer service and they give you larger portions of food! So far everything I've had has been very very good... Be careful the spicy goes up to 10 I got five and my lips are burning a little . Enjoy"
        }, 
        {
            "index": 120, 
            "rating": 5, 
            "review": "So my friends have been begging me to try this place because I live down the street and I figured what the hey I'll bite. My boyfriend was stationed in Thailand so he is verrrrry picky. I am on my way home from work and decide I'm going to call in an order. So i call and order the spicy eggplant with pork (recommended by the girl on the phone) an order of Thai wontons and an iced Thai coffee. I show up in 15 minutes and wait for maybe about 5. Service is amazing. So friendly and sweet. Gosh that's hard to find in Las Vegas. She brings out my iced coffee and I'm in love. It's so yummy. I believe it's made with condensed milk which is why it's so amazing. I get my food and go home . They have put plenty of napkins and two forks. Awesome. We settle down and begin to eat. Omg the spicy eggplant is a 10! It's amazing I prefer it a spicy level of 8 and it was perfect. Just enough heat for me. I tend to love spicy food the hotter the better I was scared of 10 but I think I could try it next time. The wontons were mixed with pork and shrimp and they were decent nothing to complain about. The eggplant  stole my heart. My boyfriend also loved it all. So Archis has faithful customers with us!"
        }, 
        {
            "index": 121, 
            "rating": 4, 
            "review": "This is the best Archis in Vegas and the best Thai in Vegas. I've been a fan for lots of years. We ate here last night. Everything is good. I love this location! I love the drive thru pick up."
        }, 
        {
            "index": 122, 
            "rating": 3, 
            "review": "It is finally time to write a review for a restaurant that's grown up with me. As many others, I too remember a time when Archi's was an obscure & tiny Thai restaurant on Flamingo. If I had written a review even up until 2 years ago, I would've given them five stars. But now, things have changed. We've both grown up and moved on to \"bigger and better\" things. However, with an increase in size and popularity (and price), has come a decrease in quality, quantity of food, and service. It is a sad and tragic tale that hopefully might turn around soon? \n\nI miss that restaurant. Now, the food is simply just okay. The portions have gotten significantly smaller and the prices have gone up. The flavor explosions that I would experience earlier have turned into a decently pleasant experience. I love that you control your own level of spiciness. As a Korean family, we always opt 6 or higher\n\nNow, to the food! \n\n1. Papaya Salad: Always consistent and fresh! My family and I always ask for $3 extra. It's a great dish to clean off your palette to start off a meal.\n2. Pad Kee Mao: Any flat Thai noodle dish is a fave of mine, but I just love this dish. It has a great blend of textures with the chewy from the noodles and the crunch from the lettuce and also has a little kick to it. \n3. Spicy Basil Beef: This dish is okay. It's essentially minced meat seasoned with basil and other vegetables. It's a good lunch dish and is to be eaten with rice. It can be a bit salty at times. \n4. Red Curry: This dish has its good times and bad times. I love the depth of the coconut milk but I have received the dish a bit watery with less variety of vegetables. \n5. Catfish Delight: If you're looking for something a little different, I think this is a GREAT dish. Crispy catfish in that blend of I don't even know what! It's amazing! It's a literal foodgasm! The catfish is always fried to the perfect crispiness. TIP: Try to eat it right away or the catfish will get soggy...\n6. Eggplant & Tofu: As a former Vegetarian, I like this dish with fried tofu. The blend of favors is great. HOWEVER, there are times when the eggplant is cooked inconsistently and many times when the eggplant is undercooked. \n7. Pad Thai: I had to review this dish right? It's a mainstream staple! Archi's Pad Thai is stil the best I ever had. I will profess. It's not too sweet, it's not to sour, it's not too salty. It's always just right. \n\nIf you work a day job. Archi's also a great place to pick up lunch to-go! There's a drive-thru that makes it convenient. Overall, yes, this place has a spot in my heart, but it has started to deteriorate ever since I have left abroad for school."
        }, 
        {
            "index": 123, 
            "rating": 4, 
            "review": "This Archi's location is just down the street from my temporary housing arrangement, and I pass by it regularly on my way to my doctor's appointment.  It is located in a fairly old strip mall on W. Flamingo and timing was perfect today for me to drop in for a quick lunch and check out what Yelpers have said was a reasonably priced lunch special from a Thai restaurant. \n\nWhen I arrived around 11:30am, there were already several tables occupied with diners having their lunch.  But I was quickly greeted by one of the petite waitresses and seated at a large table that can comfortably seat 4 or 6.  I felt a little guilty since I was dining alone.  But it didn't end up being an issue since the restaurant didn't get packed as I thought it was based on how hectic the place gets during the mad rush of the lunch crowd.\n\nAnyway, I noticed that their selections of lunch specials is rather small compared to their entire menu offerings.  But I went with their Red Curry with Chicken and also ordered a Thai Iced Coffee.  The waitress soon returned with a really generous size glass of Thai Iced Coffee, it is definitely the largest glass of Iced Coffee I have ever been served. Happy Surprise = +1 on my Yelp meter.\n\nThe Red Curry with Chicken was alright.  The flavor of the curry and the 5 spiciness on the Thai spicy scale was good. But the chicken was really tough, and I didn't care for it at all. The egg roll served is 99% out of the box, and you can really taste the prominent white pepper in the filling or the wrapper.\n\nAmbiance is good, the dining area is rather small, but it didn't bother me. And during lunch there was good amount of ambient lighting from outside, which I believe is a good thing.\n\nAnyway, I am going to have to come back and try some more of the cooking of the Thai mothers and grandmothers working in the back. Because I was seated at the table facing the small window where the kitchen passes the prepared plates to be served, and all I see are a bunch of women on the other side working in the kitchen."
        }, 
        {
            "index": 124, 
            "rating": 3, 
            "review": "To sum it up pretty good Thai food.  I was in Vegas staying on the strip and one of my  friends lives In Vegas, so we decided to take advantage that she has a car.   The restaurants on the strip are great but really pricey. This place was maybe 2 miles off the strip. I ordered pad thai and liked it but have had better. I felt the place was kind of cramped inside and think it would be really loud if it was full. The server was nice and attentive."
        }, 
        {
            "index": 125, 
            "rating": 4, 
            "review": "I am a huge fan of Thai food.... wish the beer didn't match the price of a plate of food!"
        }, 
        {
            "index": 126, 
            "rating": 4, 
            "review": "Food and Service very good.  Ran into a few dishes we were not crazy about, but overall recommended."
        }, 
        {
            "index": 127, 
            "rating": 5, 
            "review": "This has got to be the best Thai food on the west coast. Everything is amazing. The summerlin location was the one to rope me in. Busy, electric vibe. Great for eat in or take out! Located next to a movie theater and pottery place as well as ice cream. Great family location. \n\nHere at the original location on flamingo and it's a totally different vibe. Reminds me of the Chinese place Tracy eats in 'Oh God, book 2' where she says good bye to George burns (aka God). It's swanky, peaceful and very zen. \n\nToday I'm picking up take out for a work pot luck. Pineapple curry ( with chicken) #2 spice. Warning. #4 made me cry. But I loved every drop!! And pad Thai with shrimp, also #2!  \n\nThis is a great place for a date night. Super close to the strip just Down from the palms. I've tried about 1/4 of the items and it's all to die for!\n\nMy only complaint is they aren't in Henderson!! But worth the drive!!\n\nVegas is Hot in the summer but Archie's is always the Hot spot for Thai food."
        }, 
        {
            "index": 128, 
            "rating": 5, 
            "review": "Fantastic food and environment in dodgy looking building. And I am very hard to please when it comes to Thai food."
        }, 
        {
            "index": 129, 
            "rating": 4, 
            "review": "Everyone stays on the strip in vegas but we found a gem off the strip!\nThis place is really good! It's nice a quiet, the price isn't too bad, and the Thai food is legit! :)\n\nWarning: When they ask \"how spicy?\" they have a 1-10 level. 10 being most spicy. We should we could take it since we usually we medium spicy level so we asked for a 6. The waiter looked at us and said that we should get a 3. We said are you sure? we can take spicy food! And he said trust me! So we asked for a 4 for the tom yum soup. The soup came out and a 4 was spicy! \n\nWe went back the next day because the food was so good and that time we ordered tom yum with a level 3. Perfect! :)\n\nI don't know how spicy a level 10 is but I'm glad we listened to the waiter the 2nd timea round.\n\nI would definitely recommend you to check out this restaurant if you go to vegas!"
        }, 
        {
            "index": 130, 
            "rating": 5, 
            "review": "Every time I'm in Las Vegas I make a point to go to Archi,s for some of the best Thai food I've ever had! Believe me, I'm a foodie and I don't eat at crappy restaurants! The staff is very friendly & accommodating. Make sure to take care of your server, they have families to go home to and provide for as well!"
        }, 
        {
            "index": 131, 
            "rating": 3, 
            "review": "This was my 2nd time trying Thai food and it was NOTHING like the thai food ive tried before. . . AT ALL lol. i thought it was gonna taste somewhat like chinese food lol Cuz that's what it taste like the 1st time i had it in Cali. But it didnt. It was very different. We went for lunch and we got our food really fast. too fast maybe lol. I had the chicken pad thai and thai ice tea. The food was chewy. Idk if thats how it's supposed to be because again, i'm not really that familiar with thai food. It tasted kinda bland. Not saying it was bad tho. The tea was very strong and it tasted like if whatever caramel or sugar or whatever is they out in there, was burnt. when the ice melted i enjoyed it more. it was okay.\nLater on that night i was getting cravings for the pad thai sooooo... couldnt have been that bad, right? lol."
        }, 
        {
            "index": 132, 
            "rating": 5, 
            "review": "This is my favorite Thai restaurant in all of Las Vegas! It's a tiny place with a constant stream of customers but I've never had a problem getting a table.\n\nSome of my favorite appetizers include: beef & chicken satay, stuffed chicken wings, and glass noodle salad.\n\nI'm not the biggest curry fan but I really enjoy their green curry.\n\nIf you have room in your belly for more food, you have got to try the pineapple fried rice! Enjoy!"
        }, 
        {
            "index": 133, 
            "rating": 5, 
            "review": "For the one time I have been ......... Fantastic Food!  Service was quick, friendly and they constantly followed-up to see if I had any additional needs.  Ordered the Pad Prik King with Chicken and the Beef Salad at a 7 for both on the spice scale.  Had a nice kick to it but not over powering.  Tons of flavor in both dishes.  The thing that was most noticeable was the use of fresh ingredients in the Beef Salad.  It literally just reeked of freshness.  Would highly recommend this restaurant and will definitely be back the next time I am in Vegas!"
        }, 
        {
            "index": 134, 
            "rating": 5, 
            "review": "I love Archi's.  All 3 locations but I do have to complain about this specific location because of their customer service.  Very inattentive, rude servers.  This is why I do not go to this specific location.  I go to the one on Rainbow.  Food is delicious, good price, and honestly, one of the best Thai restaurants in town."
        }, 
        {
            "index": 135, 
            "rating": 4, 
            "review": "Delicious and not too far from the strip!\n\nFood\n- Papaya Salad: the best I've ever had. The dressing was soooo tasty we couldn't stop eating it despite it being super spicy (we decided on a 7 spice level for all of our food and the papaya was the spiciest!)\n- Pad Thai with Shrimp: The noodles and sauce itself was delicious.  It wasn't too sweet and was just how I like my pad thai. The shrimp was nothing spectacular though.\n- Eggplant and Beef: SOO GOOD! I admit I'm not a big fan of eggplant, but this dish was very good. The beef was cooked perfectly. Not chewy at all. \n- Masaman Curry with Chicken: This was my least favorite dish out of the 4 we ordered. It was a little too rich for my taste. Don't get me wrong. I am a big fan of all types of curries and I usually like the creamy Thai curries, however this one was just a little too much for my taste. The potatoes were a little undercooked and the chicken a little overcooked and rubbery. \n\nService\nGREAT! Amazing! They are so attentive and friendly. \n\nAmbiance:\nLike a small casual cafe/mom&pop shop. We expected a fast food type of place seeing that it had a drive thru, but we were surprised with the casual nice setting. \n\nI'll definitely be stopping by at Archi's whenever I'm in Vegas! Simply delicious!!"
        }, 
        {
            "index": 136, 
            "rating": 5, 
            "review": "This place is awesome! The lunch menu offers many delicious meals at a cheap price (~$7.50 - 9) which includes a bowl of soup and potstickers!\n\nThe customer service is excellent. Great smiles, drinks were refilled without having to asked....they are very nice :) The place looks upscale too like any other Thai restaurants. Nice paintings, comfy seats and clean tables - just a nice place to dine.\n\nIf you are staying in Vegas strip, this is only like 10mins. Go there and check it out. You won't be disappointed.\n\nCons: the place is kinda hidden. You may have to drive around in the parking lot to find it. They don't accept AMEX."
        }, 
        {
            "index": 137, 
            "rating": 5, 
            "review": "This is the place to go for Pad Thai! The fresh spring roll is really good too as an app. When we dine here the food comes out very quick and hot (temperature). It's also very convenient to order up how spicy you want your dish using a 1-10 scale with 10 being nuclear reactor meltdown hot. If you are looking for good Thai good, go to Archi's."
        }, 
        {
            "index": 138, 
            "rating": 4, 
            "review": "Pretty solid Thai food, comparable to Thai food in LA, not too far from the Strip. Other pluses are that its cheap and clean too. \n\nEnjoyed:\n- pad see ew with tofu\n- beef thai salad- note: when they ask how spicy you want it, I would think about what you would really say (on scale of 1-10 with 10 being spiciest) and then take it down 1 of 2. \n\nDefinitely recommend this to anyone looking to escape the Strip, for some normal priced, good tasting Thai food. \n\nAlso, I think there might be drive through? But not sure, as that would be the 1st Thai drive through Ive ever seen! (see pictures)"
        }, 
        {
            "index": 139, 
            "rating": 5, 
            "review": "This is where I go when I crave Thai. It's convenient, even has a drive thru when I order take out. Go to items on the menu: pineapple fried rice, Tom kha soup, pad Thai, pad see ew, papaya salad and chicken larb. My husband liked the ginger chicken. He's not a big Thai food fan. Their Thai iced tea is great as well."
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "Archi's simply rocks! I have tried several other places that are closer to me but I always end up driving back across town to Archi's because it's just better.  The staff is always friendly and efficient.  The food is always amazing.  The Thai basil fried rice is a must have...but then so is the beef salad and the yellow curry.  The flat rice noodles with pork is to die for.   I am waiting for the day they open a location on the east side of town!  Till then, I will keep going back to Archi's Thai Kitchen cause I just gotta."
        }, 
        {
            "index": 141, 
            "rating": 5, 
            "review": "Love this place best Thai food I've had in town!! Great service recommend to all!! But don't believe me you must come try it yourself."
        }, 
        {
            "index": 142, 
            "rating": 4, 
            "review": "Love the food!! Delicious & authentic!! \nI've been to all 3 Archi's Thai, here in Las Vegas. I go to Archi's Thai Kitchen more often than the other 2 because this location has a 'drive-thru' and that's awesome. I'm in and out of the house all day, everyday, and it's great that I can call this place up and they have my order waiting for me at the drive-thru 15-20 mins later. Very practical. For the most part, the people have been polite and friendly at this location. I definitely have no complaints when it comes to the food. Always delicious. I would definitely recommend this restaurant."
        }, 
        {
            "index": 143, 
            "rating": 5, 
            "review": "I love Archi's! I come here whenever I am craving pad thai. It's delicious and it's ready fairly quickly. I still have yet to find a better place to get thai food."
        }, 
        {
            "index": 144, 
            "rating": 5, 
            "review": "Hands down one of the best places for Thai food in this city! We always get the chicken Pad See Ew, Basil beef, and our 3rd item we try something new. Mongoalian beef is also great but I wish that they added more meat and less veggies but the sauce is great! We also end our meal with to-go Thai Tea drinks. Yummy!"
        }, 
        {
            "index": 145, 
            "rating": 4, 
            "review": "The food is really, really, really GOOD, but what I didn't like is their Thai Tea is not refillable like other restaurants :("
        }, 
        {
            "index": 146, 
            "rating": 4, 
            "review": "Consistently great thai food,pad thai and red curry on lunch specials a few around town so you don't have to travel to far"
        }, 
        {
            "index": 147, 
            "rating": 3, 
            "review": "Pretty good. I like Pam Asian much better but this place was ok. The basil dish I got do lunch was a bit different than expected by the taste was good. I asked for 3 on spice scale and really glad I didn't go higher. My mouth was a touch on fire for a 3. Service was ok. I liked the ice tea. It had a bit of a bite to it. Nothing harsh but a little something something. I'd go back but only if I'm in that area. I'll go to Panna Thai right near my house or drive to pan Asian. But this place was definitely aok!!!!"
        }, 
        {
            "index": 148, 
            "rating": 3, 
            "review": "Has something changed? I haven't been to Archis for about a year but before had been frequent for many years. Tom Yum still almost the same but the basil fried rice was very lacking which before the flavors just came out so well and the pad Thai was a disappointment. It used to taste like they actually cared about upholding a standard but now it tastes like status quo. Anyway I guess I have to try other Thai restaurants which I have and I've only liked Lotus. Anyone have suggestions?"
        }, 
        {
            "index": 149, 
            "rating": 3, 
            "review": "It's so hard to like Thai food at restaurants when you know nothing beats homemade. Nevertheless I ordered take out with an open mind. Three stars for promot service, pick up was less than 30mins. \n\nI would give one more star except the flavor was not flavorful. It was somewhat bland, just okay and edible. Also \"medium spicy (5 in a scale of 1-10)\" is pretty much the same as \"not spicy\". I had two dishes to compare, no difference, no kick. I ordered for myself spicy Pineapple beef curry and no spicy sweet and sour chicken, spicy pad Thai. \n\nAnd biggest complaint of all, I found two long strands of dark hair in my husband's pad Thai. I didn't just find it.... the longest strand of hair was in my mouth mixed with the noodles!!!!!! Ugh. \n\nIt's not the worst thing in the world but please tuck your hair back when cooking/carrying/packing the food. It's kind of gross especially I don't know if this person washed their hair or had lice they didn't tell anyone about. Definitely not from my short blonde hair or husbands bald head.\n\nOverall, I'll stick to our koonyai's homemade dishes but if you want a restaurant style meal, there are better places than this one - not impressed."
        }, 
        {
            "index": 150, 
            "rating": 5, 
            "review": "No complaints yet about Archi's. Pin Kaow used to be my favorite for Thai in Las Vegas, but their service has been slipping in the recent years. Archi's is always busy and the food is always consistent which means they're definitely doing something right. The lunch specials make it a perfect spot for lunch."
        }, 
        {
            "index": 151, 
            "rating": 4, 
            "review": "Food and thai tea were absolutely delicious. The ambiance is a little confusing, you almost feel like you're in a house."
        }, 
        {
            "index": 152, 
            "rating": 5, 
            "review": "A delicious Las Vegas staple for excellent Thai food and service. The original location on flamingo is still the best and the lunch special can not be beat."
        }, 
        {
            "index": 153, 
            "rating": 4, 
            "review": "food good, service quick....\nwere were looking for a dinner spot before our next show and we decided to give this place a try since it had good reviews and multiple locations.  we were in a hurry to eat dinner so we can make it back to the strip for the next show and we made it with no problem even after be held in traffic on Flamingo road due to DUI control roadblock.  It was just after the super bowl so I guess this a good thing.  Anyways, the service was friendly and fast.  We had they Pineapple curry and Phad Thai.  The Phad Thai is among the best we have ever had.  The noodles were firm but not rubbery and the sauce was not too sweet or sour.   The curry was good too....a little on the soupier side but was smooth and spicy.  Maybe it's because it was made from powder rather than paste.  Their brown rice was just okay.  A little too fluffy for my liking.  All for under $20, what a great deal.  I even made it to the show with time to spare."
        }, 
        {
            "index": 154, 
            "rating": 5, 
            "review": "I've been here twice and had great experiences both times.  \n\nFirst time, a friend and I shared yellow curry, pad thai, and eggplant.  Everything tasted great.\n\nSecond time, I ordered TAKE-OUT yellow chicken curry, rice, and a thai tea for about $11 total.  The yellow curry was delicious and lasted me for 3 meals.  \n\nReally nice place for sit-in or take-out."
        }, 
        {
            "index": 155, 
            "rating": 4, 
            "review": "This is damn good Thai food. Better than Ping Kaow, if that means anything to anyone. \nThe Pad Thai was perfect in my opinion, noodles were perfectly cooked, not mushy or too hard, I asked for a spice of 7 and still ended up putting more chilies in it - loved the look on the waitresses face when she saw that, Oh You want it more spicy, she asks?! Why yes I do! \nSpeaking of spice, they spice cart had a nice assortment of pickled Thai peppers, not the jalapenos you see at the other places. Nice touch, Also had an interesting sauce that I think she said was fish sauce and garlic with pepper flakes. Whatever it was, it was good.\nI've only eaten there once and will definitely go back to try other dishes but from visit number 1, the food, the service and overall charm of the place, I highly recommend it!"
        }, 
        {
            "index": 156, 
            "rating": 4, 
            "review": "We went there during last year December, first we found this restaurant in Las Vegas because of Yelp's reviews, so we gave it a try.  We went there during lunch hour, and there were so many to go order. Services is excellent even they were so busy during lunch hour. We order Shrimp cake, Pai Thai, and Red Curry Rice, the food quality are excellent ! That's surprise me, I always thought Los Angeles's thai food are good, now I change my mind !"
        }, 
        {
            "index": 157, 
            "rating": 5, 
            "review": "This is my standard now for Thai food.  The curry is great but the Pad Thai CANNOT BE BEAT.  They even have drive thru window at their Flamingo location only."
        }, 
        {
            "index": 158, 
            "rating": 2, 
            "review": "The first time I tried this restaurant was almost 4 years ago.I am of a Thai and Chinese origin so I have been eating Thai dishes all my life. I know that the restaurant doesn't really target Thai person but still they should make at least decent food. My friends and I ordered green curry,stirred-fried spicy flat noodle.The green curry was a bit watery(green curry supposed to be a bit thick and creamy with coconut milk),the spicy flat noodle was so so and the way they cooked the flat noodles was not quite the way it supposed to cook..The service was ok not excellent.\n\nI was there once and decided not to go back there again.To me the only good thing about this restaurant is its ambience."
        }, 
        {
            "index": 159, 
            "rating": 5, 
            "review": "Archi's is my favorite place to go to for Thai food in Vegas! Not only is their food always delicious, but their service is what sets them apart from other restaurants.\n\nI like to go here with my boyfriend, and he likes to order pad thai with a very extra well-done fried egg on the side. I guess it can be kind of an odd request, so other restaurants that we've been to under cook the egg. However, at Archi's they always listen to exactly what we want. One time the egg came out and my boyfriend took a bite of the egg. It wasn't completely well done, but it was definitely nothing to send back or worry about. But our server noticed it immediately and asked if we wanted a new egg. We politely declined because we didn't want to hassle the cooks, but the server brought one out anyway. I loved how attentive he was to our order. The staff is very friendly and they don't mind joking around with us. \n\nThe service and food is what puts Archi's on another level. This is definitely my go-to place, and sometimes I wish I could eat there everyday for lunch because the lunch specials are a great price and include great portions as well. Overall, highly recommended!"
        }, 
        {
            "index": 160, 
            "rating": 4, 
            "review": "Small, quaint place\nIt was nearly empty when we came in on a Saturday afternoon. Great food and service was fine. Definitely will come back for more"
        }, 
        {
            "index": 161, 
            "rating": 4, 
            "review": "High points: CONSISTENCY, takeout is packaged well, DRIVE THRU TAKEOUT (Flamingo only,) & reasonably priced.\nLow points: Closed on Mondays, no delivery.\nU Must Try! Ginger chicken (sooo gingerly,) Spicy basil (flavor explosion,) PANANG anything (thick not soupy,) Chicken larb, & Pad see ew (flat noodles w/egg & Chinese broccoli. \nCertain dishes I found to be better elsewhere but my favs here are consistent. Not a huge tofu fan but Archie's does it well with curries. And unless you're a professional spicy eater, anything over a level 5 can hurt you!"
        }, 
        {
            "index": 162, 
            "rating": 4, 
            "review": "Have gone twice so far to this location and have not gone to the other locations yet. \n\nI do understand why people say it's good and I must go to try it, but it's a steep cliff to say it's up with the best Thai ever. Had lots of Thai friends in LA and lived a stone throw from LA's Thai Town. \n\nFirst time-  I grab the \"basics\" usually on the first go at a place to see how things measure up. Sure they may have a standout exotic dish, but if they can't cook the staples of their culture- it's not gonna cut it. So ordered a chicken panang and some ground pork with basil and some spring rolls. The panang was pretty good- just different from what I normally have as it had a heavier hand in coconut cream than most places I've experienced it. Different, but good. Pork basil is good, but really...can you fuck up ground pork, zucchini, basil and chilies? Its just a simple comfort food I like. \n\nNext time we grabbed another of the panang and this time did a pad thai. I'm not sure about the pad thai...it was good enough, but was missing something flavorwise I couldnt pinpoint...maybe needed more tamarind? I hear good things about the Pad Thai so I don't know if this is an off day or  what my palette is looking for is different, but I'll give it another shot the next time around. \n\nService is friendly, but not the most attentive at times with our lady going to the back for long periods of time.  Portions and price is very fair, we had a bit of left overs for my lunch the next day. \n\nI at least see that they are trying to keep things authentic and made with love here so I can appreciate that. Good if I'm in the area, but I wouldn't drive this far specifically for this spot as its rather far from where I live."
        }, 
        {
            "index": 163, 
            "rating": 5, 
            "review": "Every location I have ever stopped at has never disappointed me. Archies is the best the panang with sticky rice or basil chicken not to mention the shrimp fried rice.... OMG good food!!"
        }, 
        {
            "index": 164, 
            "rating": 5, 
            "review": "Great food. A little Americanized but great nonetheless. Noodle dishes are the absolutely best I've had, and I'm a pad thai junkie. Not too sweet, not too spicy (Unless you alter the spice rating), it is perfectly balanced. The meat dishes are perfectly seasoned as well. I haven't had a chance to try the curry, but I've seen a lot of other diners eating it and I've heard a lot of great things about it. For appetizers, the stuffed chicken wings are my favorite. I don't know how they do it, but it's two, over sized drumsticks stuffed with noodles and vegetables, fried golden brown and served with a tasty plum dipping sauce. You have to try it. Also, in my opinion, Thai cuisine has the best fried rice amongst all Asian countries. Try Archi's pineapple fried rice and tell me you don't agree.\n\nThe location on W. Flamingo is the original spot, its extremely small and accommodates about 25-30 people max. But the decor is very \"homey\" and full of great people. The service is friendly, attentive and helpful. The new location off of S. Rainbow and the 215 is a whole lot bigger, but food and service is as consistent as the original location. If you love Thai food, you have to try this place out."
        }, 
        {
            "index": 165, 
            "rating": 3, 
            "review": "When a co-worker said \"Hey, what about Thai Thursday?\", I said I'm in. Then to find out we were going to Archi's was even better. I didn't know there was more than one location, so that was a pleasant surprise, as I had never been to this location. My pepper steak was good, although the \"4\" wasn't as spicy as I was anticipating, so I will bump it up next time. The lunch combo comes with soup, an egg roll and a won ton. Good portion, good price and good food. One in our group ordered Sweet and Sour something and didn't get her meal until the other seven of us were almost done. The other meals just kind of filtered out to the table as they were done. It's kind of hard to eat with friends when everyone is getting their meal at different times. I am definitely a fan of Thai Thursday and will be back. A more prompt delivery of the meals and this is a four star experience."
        }, 
        {
            "index": 166, 
            "rating": 5, 
            "review": "This place is the best!\n\nPineapple fried rice.\nPineapple curry.\nCoconut ice cream.\n\nAmazing. :)\n\nDrive through window.\nAwesome price.\nI always buy an extra order of rice because there is enough curry to last for days."
        }, 
        {
            "index": 167, 
            "rating": 5, 
            "review": "archi's was great, went here for my sis-in-law's bday n they were very nice and affordable too.\n\npeople from other states shouldnt be so snobby bout tryin food from somewhere else, stop comparing it to LA or NY...i swear, it's these 2 places that are so snobby when it comes to food, believing their place is the best one...dnt u realized, it's wherever u grow up that u prefer the taste? so just enjoy the food"
        }, 
        {
            "index": 168, 
            "rating": 5, 
            "review": "This place is beyond amazing, the staff is super friendly, the restaurant is very well maintained and neat and the food is delicious. The wait time was a lot shorter than expected and the staff was super courteous. This is a must visit!"
        }, 
        {
            "index": 169, 
            "rating": 5, 
            "review": "The mother of all Thai food places.  I used to put Banana Bay (Hacienda Heights, CA) in this honor, but it has been demoted.  Being Vietnamese-American, I was drawn to the Catfish.  I usually have a 4 spicy but once I misordered and cried throughout the meal.  Too hot, to compose myself but too good to stop eating.  \n\nService is wonderful for a date and also fast enough for a lunch treat (if you can fight the traffic at the time).  Besides their catfish, I recommend their curries, friend tofu, and Thai iced coffee.  \n\nThey have a new location on South Rainbow, I heard.  Damn, right by my old house, too!  Well, the journey of the Nomadic TL continues!"
        }, 
        {
            "index": 170, 
            "rating": 4, 
            "review": "An update, ordered again on a weekday in the afternoon and everything went very smooth, food was ready and delicious, everyone loved it. This will be a weekday favorite for me,"
        }, 
        {
            "index": 171, 
            "rating": 4, 
            "review": "The food is very  delicious. Original Thai food, good portion.  Atmosphere is nice not crowded, clean and simple decor.  Ordered chicken satay, papaya salad, namtok moo spicy 5 came out perfect for me. They also have pick up window. Waitress is awesome."
        }, 
        {
            "index": 172, 
            "rating": 2, 
            "review": "I was in Las Vegas for a convention and stopped by for a quick lunch. Boy, was I disappointed! Just a simple order of lunch special, it took them 1/2 hour for the food to come. I ordered a simple Pad Thai, it tasted awful and very salty. The waitress was rude and had an attitude. It's very pricy for a noodle dish so small."
        }, 
        {
            "index": 173, 
            "rating": 5, 
            "review": "The Flamingo location is sooooo much better than Rainbow. I live closer to Rainbow but will take the extra to go to the original. First the food is fresher and more flavorful. Example we had shrimp pad Thai and chicken larb yesterday and it was fantastic. We ordered a level 5 spicy but could've been hotter. That's the only downside you're never sure how hot the chef will make it but either way it's pretty darn good. The rainbow food always tastes fishey no matter what you order and not in a good way."
        }, 
        {
            "index": 174, 
            "rating": 4, 
            "review": "3.5 stars rounded up.\n\nQuiet Thai place with good food! Came here for an early dinner and the restaurant was pretty quiet! It wasn't empty, there were several groups of people eating but I guess everyone was just eating verrrry quietly :)\n\nFOOD:\n- pad prik king with pork (spicy level 10) - yum! And most definitely spicy! The heat doesn't really hit you until you eat more of it, but when it does woooo-eee that's good! Green beans were still crispy and the dish wasn't too oily.\n- pad kee mow with chicken (spicy level 10) - this wasn't as spicy as the pad prik king but still very yum! Good breather from the spiciness.\n\nSERVICE: Decent. The servers seem a bit lackadaisical but the restaurant wasn't crowded anyways. We had to ask for water refills, and for the fish sauce & chili mix. They never brought us that little tray with the sriracha either! \n\nAn older couple came in when we were eating and they appeared to be regulars since the staff welcomed them very warmly and brought out a dish without them even ordering. So sweet to see :)\n\nVENUE & LOCATION: Restaurant is home-y. We sat in a booth and the chairs look very cushy. Plenty of parking all around."
        }, 
        {
            "index": 175, 
            "rating": 5, 
            "review": "At first, I was  bit hesitant about going to a drive-thru Thai joint but I was pleasantly surprised with the quality and flavor of the food.  This is the best Thai food I've had in Vegas so far.  The spicy scale extends from 1-10 so you can get your dish to your liking.  \n\nGreat Thai food for the price.  I'd definitely recommend this place to friends."
        }, 
        {
            "index": 176, 
            "rating": 4, 
            "review": "I was pleasantly surprised with the cleanliness and quality of this Thai restaurant. I developed a fondness for Thai quinine after visiting Bangkok and it's beautiful little islands years ago. Most Thai restaurants around town don't meet my criteria (for cleanliness, especially)... but so far so good on Archi's place. I recommend trying their Thai Tea, Chicken Rad Na, Pad Thai, and be sure get an extra side of Peanut sauce. :)"
        }, 
        {
            "index": 177, 
            "rating": 5, 
            "review": "Best Thai food ever. Staff is always friendly and on point. Food is always great. Price is very reasonable for what you are getting. I highly recommend Archi's."
        }, 
        {
            "index": 178, 
            "rating": 5, 
            "review": "Consistently great Thai food! Order your food's spiciness on a scale of one to ten, and they always know to put just the right amount. I don't really have one specific favorite dish bc I love them all. However, you must try the pin kapow (chicken), red curry, pad Thai with shrimp and their Tom yum soup. For the red curry, I usually skip the meat and ask for extra zucchini. A bowl of steamy hot rice complements this red curry like no other. Excellent service whether you're dining in, picking up or drive thru!"
        }, 
        {
            "index": 179, 
            "rating": 3, 
            "review": "I feel the need to preface this review with the disclaimer that I was spoiled, horribly, after living near the Argyle stop in Chicago for a few years. (For the uninitiated, this was basically Thai Food Paradise.) So my standards might be pretty high. And Archi's had been hyped; I'd been told by a lot of native 'Vegans that Archi's is \"The Best Thai\"...and I feel like I'm about to Blaspheme.\n\nThe food's not bad. It's quite decent. But it's nothing terribly special, to me. The pad thai is good, but not in any way that sets it apart from the other pad thais in vegas. The curries are again, good, but their flavor seems to rely more on heat than the build of flavors in curries that truly knock my socks off. That seems to be what Archi's does well; everything is at least \"decent\". Nothing is bad. But nothing is amazing, either. I have never craved Archi's; I crave the Panang Curry at Pan Asian, or the Pad thai from Prin Kaow, nor whatever it is my husband always orders from Weera. Archi's is a safe bet, a good lunch place, decent takeout with a group.\n\nBut it doesn't have any favorites. It has no \"Woah. I must tell someone.\" Factor. So, in conclusion:\n\nPros:\n- Nothing noticeably bad in many visits.\n- Polite staff, reasonable wait times, several locations.\n- Starbucks of thai; you will get exactly what you expect, every time. \n\nCons:\n- Nothing noticeably great in many visits.\n- A lot of \"Americanized\" thai dishes, not as much variety as one could hope for.\n- Starbucks of thai; you will get exactly what you expect, every time."
        }, 
        {
            "index": 180, 
            "rating": 1, 
            "review": "I was not impressed with this Thai restaurant. The ambience was missing, and the service was severely lacking. My friend and I decided to give it a try after hearing many good reviews, and it was a mistake. We came there at lunch time and had to wait to get seated. The place was extremely small and dirty. There were many pieces of food thrown about on the floor and the odor was not very pleasant. Eventually, when we got seated, the waitress was rude; she threw the menus down on the table and did not provide any pleasantries. \n\nOur food was average at best. The spice levels were completely wrong. I like my Thai soups at 3 at most, and it came out at 6. Upon asking the server to amend this mistake, we were met with attitude and frowns, even though I was very polite about my request. The food was okay, but I didn't feel that it was fresh tasting. In fact, the rice was rather dry and traditional Thai drinks were tasteless.\n\nI didn't really like anything about this place. Maybe, I'll give it another try at its other location, but I am never coming back to this one."
        }, 
        {
            "index": 181, 
            "rating": 5, 
            "review": "AMAZING.  I've been in Vegas now for about a year and a half and this is hands-down the best Thai in the city!   The building is so-so, but really, it's all about the food --- and they do it well."
        }, 
        {
            "index": 182, 
            "rating": 5, 
            "review": "Delicious food. Thai tea is yummy! Great service. Comfy atmosphere."
        }, 
        {
            "index": 183, 
            "rating": 1, 
            "review": "I visited Archie's restaurant on Flamingo and Jones. I just ordered a Thai coffee to go and asked The girl with braces (she did not have a name tag )to make it with easy ice. \nI I paid for it and left and  shortly after I was surprised to  discover that the cup was full with ice. There was not even three quarters of the cup that weren't filled with ice. The drink is not cheap and I really don't want to pay for coffee and get ice. I even took a picture of it. Too bad I can't post that too\nI am disappointed."
        }, 
        {
            "index": 184, 
            "rating": 5, 
            "review": "love archi's!  both locations!  my favorite is their spicy basil fried rice.  you can give them a spice rating from 1-10, and they are usually pretty accurate.  their eggplant dish is great and their pad thai is perfect.  we usually get a variety of their apps, including their satai and thai toast.  service is very friendly and efficient."
        }, 
        {
            "index": 185, 
            "rating": 4, 
            "review": "This is my favorite Thai restaurant in Vegas. The inside is pretty clean and the food has traditional flavors. Servers are efficient even if they aren't all that friendly. Definitely order a side of peanut sauce, cause it goes with everything. I really liked the way they decorated the restaurant. It felt authentic. Prices are ok, but no real bargain."
        }, 
        {
            "index": 186, 
            "rating": 5, 
            "review": "This place is \"GUILTY\" of turning me into a half Thai. I've been eating here 1 or 2x a wk, every wk ever since I moved to Vegas 4 yrs ago. Never had the cravings too much for Thai food before. Archi's is truly the best Thai place I've ever been to. I definitely have lots of favorites here: Pad See Ew, Panang Curry, Pineapple Fried Rice, Pad Thai of course, Spicy Eggplant, Pad Prik King...but even after having them over and over again, I can't get tired of them. The \"new\" dishes that I try periodically don't disappoint me either. Heard the original owner, Mr. Archi was a taxi driver here in town long ago, right? Thank God, he gave up that job~!"
        }, 
        {
            "index": 187, 
            "rating": 3, 
            "review": "I heard good things about ARCHI'S and last time I came on a Monday they were closed but now open 7 days a week.\nUnfortunately it was just standard Thai Food that I can get anywhere I want in Los Angeles, and the Pad Thai was a bit too sweet...\nOur Tofu appetizer was decent...\nThe #6 spice wasn't spicy and I know this because I don't like Spicy Food..."
        }, 
        {
            "index": 188, 
            "rating": 5, 
            "review": "Friendly staff. Repeat your order though as English is 2nd language to avoid miscommunication. Food was ok. Pad Thai too clumpy though. But it was easy to find and nice people and food was pretty good."
        }, 
        {
            "index": 189, 
            "rating": 5, 
            "review": "Always have had a great dinner here & at the other locations in Vegas.  Food is plentiful & delicious!  The staff has always been super friendly."
        }, 
        {
            "index": 190, 
            "rating": 3, 
            "review": "Archi's had a charming, rustic feel to the place. On the inside, the decor relies much on objects placed in the room, and not fancy decorations adorning the walls. The paint looked old, and there were some patches on the wall. Overall, the restaurant looked clean and it was a little busy when we were seated.\n\nTheir food didn't really blow me out of the water. I have had better Thai food in Vegas -- the food here is just average. I had the yellow curry, which comes with jasmine rice and your choice of meat (I chose beef). They asked me for the spiciness on a scale of 1-10 and their 4 was just right; not too hot, but just enough spiciness to be flavorful. It was a filling meal, but there are probably better places out there with the same price range as Archi's. When it came to dessert, they had mochi ice cream on the menu. Unfortunately, the waiter told us that they didn't even serve it anymore (menu update?). \n\nI'd probably come back because it's in close proximity to where I live, but I wouldn't say it's as amazing as all the hype it seems to have."
        }, 
        {
            "index": 191, 
            "rating": 4, 
            "review": "Food was delicious. The tofu here is WAY WAY better than the tofu at Komol. Plump vs. hard, dry, & shriveled. The flavors are definitely there, too. \nBest part is that they're vegan friendly and willing to omit the fish sauce/shrimp paste. \nAnother special thing about this place is that they offer whole, fresh coconut to drink and eat! Now that's hard to find. It was delicious, but REALLY filled me up. A coconut with all its water and meat can be a meal in itself. I suggest sharing it with another person if you're getting it for dessert."
        }, 
        {
            "index": 192, 
            "rating": 5, 
            "review": "As good as it gets. In a town rife with AMAZING thai places i dare say Archi's is THE BEST. \nIt beats everywhere just on the merit of the food alone. If an angry ogre facefucked you with this food and punched you in the stomach, you'd thank it.\nFact of the matter is that the ambience and service are good to so you don't need to worry.\nYes."
        }, 
        {
            "index": 193, 
            "rating": 5, 
            "review": "This spot is probably the best Thai food I've had on the West coast.  It may be a small establishment, but the spices rocked my socks off!\nI especially enjoyed the pad thai w/ chicken + shrimp.  The Massaman Curry w/ medium spice level was delish as well!  \nI will definitely come back for more heat next time!\nYesSir."
        }, 
        {
            "index": 194, 
            "rating": 1, 
            "review": "Disappointing at best- had fresh spring rolls, came wrapped in crepe not rice paper as advertised on menu- had pad Thai- kinda a big glob of noodles with a a few slices of carrot and green onion and no peanut garnish- nota keeper!!"
        }, 
        {
            "index": 195, 
            "rating": 4, 
            "review": "First off I always compare thai food to ping kaow, it's just how my mind works and it's a good reference point for comparing vegas thai food\n\nI have been here 3 times now and it has been solid every time.  I do like pin kaow better overall but this place is still well worth eating.  The lunch special is fantastic and I had it with red curry and it was great..  The tom kha gai soup here is awesome and probably better than kaow. \n\nThe reason I like pin kaow a little better is there pad thai is probably the best I have had and pad thai is one of my favorite things in the world so there you go.  I would bet that half the dishes are better at one place and the other half is better at the other."
        }, 
        {
            "index": 196, 
            "rating": 4, 
            "review": "There are some good Thai restaurants in Vegas and Archi's Thai is definitely one of them.\n\nTheir lunch deal is reasonable at $8 and comes with a great soup. We ordered Ginger Ginger Ginger and Pad Thai, both had nice presentation and portion."
        }, 
        {
            "index": 197, 
            "rating": 5, 
            "review": "This place has the best Thai food in Las Vegas. We always order the Garlic Pepper Chicken, Papaya Salad, and the Shrimp Fried Rice. The garlic pepper chicken isn't that garlic or pepper. It has chicken placed on top of a broccoli bed. It's very tasty; it has lots of flavors. The papaya salad is great; we get a spice level of 3 (1-10) and it's a great level for me. The shrimp fried rice is one of my favorites. It has great taste in the cookery and has lots of veggies and shrimp. This place was great in general. 5 stars all the way."
        }, 
        {
            "index": 198, 
            "rating": 4, 
            "review": "One of the best Thai Places I know,   Never fails to impress guest from out of town, out of the country.  Food is as close to Authentic thai food. Curry are a bit spicy. If you palate does not want Very Spicy food then request the spiciness to be 0, otherwise 4 or 5 spiciness is already VERY spicy for the typical palate."
        }, 
        {
            "index": 199, 
            "rating": 4, 
            "review": "Archi's is my favorite Thai Restaurant in town.  I would have given this location 5 stars, except it is the smallest restaurant I have ever seen.  Sometimes the wait can be 30-45 minutes.\nOther than that the food is EXCELLENT.  The Red Curry is so rich and flavorful, it is probably my favorite.  The Tom Kha soup is sooo good, the Pad Thai is great.  The service is excellent, and the prices are reasonable.  Go for lunch, they have excellent lunch specials for $6.95."
        }, 
        {
            "index": 200, 
            "rating": 5, 
            "review": "The Archi's Thai restaurants in Las Vegas are my \"go-to\" restaurants for myself and my visitors, who have never been disappointed and ask to go there again at their next visit.  I love the Country Curry at Archi's Thai Kitchen, as well as the vegetable fried rice. I like what my friends order as well.   I am vegetarian and there are plenty of vegetarian choices.  The waitresses are good and always ask me if egg is okay (in the fried rice), since they are familiar with a vegetarian's needs.  They refill the drinks often.  Although I definitely know true Thai food (I ate homemade Thai food nearly daily for seven years that was prepared by many different immigrant Thai women) I like Archi's because I can order the amount of spice I need, versus eating the usually very spicy food at the center I attended nearly daily.   It might be a little \"Americanized\" with some dishes, but as long as my guests love it, and I love it,  I don't care.  I usually see a few Thai families at Archi's, though predominantly a mixture of other races.  It is a pleasant demographic. What I really love most about Archi's is the consistently very, very fresh vegetables and food.  I also like that the Clark County Health Department gives \"A\" grades to Archi's (I stay up on that).  I took visitors to Archi's a few months ago but it was too busy at lunch, so I took them down the street to a more expensive well-known Thai restaurant that has had good Las Vegas Review Journal reviews in many years past) and it was definitely not fresh food like I get at Archi's, and that is an understatement.  If Archi's is a little more Americanized in that way it is  okay with me.  I have ordered Archi's take-out for parties at home and it is always a big hit."
        }, 
        {
            "index": 201, 
            "rating": 4, 
            "review": "Always good here. Nice and clean good service. Red curry with tofu is very good. Papaya salad is very good as well. My favorite Thai restaurant"
        }, 
        {
            "index": 202, 
            "rating": 1, 
            "review": "Waitress didn't speak good enough English to get my order right, but then too she was walking away from me as I was still in the middle of my order. Thought she had it right, Cashew nut with tofu, but I guess not.\nFor $10 I got a Small plate of vegetables, mostly onion and carrot! When I said where is the Tofu she said the Tofu costs $2.95 extra!\nDon't go here hungry, you'll starve!\nI've been in restaurant work as a server and bartender for decades. There is not a chance that they served me more than EIGHT OUNCES of vegetables. And mostly onion ($.79per pound) and carrots ($.49per pound)! broccoli and 4 baby corn and some sugar snap peas in sauce. Cost to them? I'm guessing about $.75. Cents that is!! 75 CENTS for $10! \nI ordered brown rice, it was given white....but brown costs $2.95 extra! Rip off! But I don't eat white rice, guess that is my own choice but still $2.95 is extreme. Not like we are sitting at the top of the stratosphere or something. \nI tried to complain that the portion was upsetting to me but again she doesn't speak English well enough to understand. I give up. \nIt was really frustrating."
        }, 
        {
            "index": 203, 
            "rating": 4, 
            "review": "I was impressed by this place.  I've been wanting to try this place for a while, and I finally got the opportunity to last night since I was around the area.  \n\nThe place itself is small, but not crowded.  It was very clean, nice decor, and nice ambiance.  \n\nWe had the Thai Toast, Beef Jerky, Chicken Pad Thai, Panang Curry, and the Pad Prik Pow.  \n\nStarted with the Thai Toast and Beef Jerky.  The Thai Toast has minced chicken and shrimp inside with cucumber salad on the side.  I had mistaken the cucumber salad for dipping sauce, but it was still good.  I say cucumber salad is good dipping sauce for Thai Toast.  \n\nThe Beef Jerky had the perfect combination of tender and thick.  Full of flavor.  \n\nThe Chicken Pad Thai came in a huge plate.  I say it's good for at least 2-3 people, depending how hungry you are.  On a spicy level from 1-10, the spicy level we ordered was a 7 and it was spicier than I expected!  I absolutely loved the flavor.  \n\nI ordered the Panang Curry with a level 5 spicy level (out of 10).  Again, also spicier than expected, which is awesome. \n\nLast, I had the Pad Prik Pow.  This also had a spicy level 5 out of 10 and spicier than expected.  I had to order some Thai Iced Coffee to cool my taste buds.  \n\nArchi's Thai was a great experience with great food, and great ambiance."
        }, 
        {
            "index": 204, 
            "rating": 4, 
            "review": "I went here with my boys on Friday and we thought it was good.\n\nWe had Pad Thai, red curry and spicy fried rice.  They were all good and very spicy which we like, #8 spicy and my eyes were running LOL!\n\nThe only thing I didn't like was the ice tea which was made with powdered tea yuck.\n\nService was great and  price was right."
        }, 
        {
            "index": 205, 
            "rating": 2, 
            "review": "Took 45 min to get 2 veggie dishes. They told me \"they are packing it up\" for 20 min when I asked for my money back they finally had the order ready. It was average. Too oily and way to spicy for the number I ordered. Used to be a good place needs better staff"
        }, 
        {
            "index": 206, 
            "rating": 4, 
            "review": "Love this place. My fiance loves the spicy basil beef and I love the shrimp and broccoli. Their soups are very good as well. Great service, great food. Definitely give it a try"
        }, 
        {
            "index": 207, 
            "rating": 4, 
            "review": "Yummy place! Very good salads! Service is decent as well, don't usually eat Thai food. But I was able to try some things here... Turned out to be a cool experience. :)"
        }, 
        {
            "index": 208, 
            "rating": 5, 
            "review": "My boyfriend and I just moved to San Francisco from Vegas. We've tried sooo many Thai restaurants here and NONE compare to Archi's Thai Kitchen on Flamingo. Archi's Pad Kapow is something we CRAVE but simply cannot find in the bay area and we are sooo sad. We are seriously going through Archi's withdrawal. ARCHI'S, WE MISS YOU TERRIBLY!"
        }, 
        {
            "index": 209, 
            "rating": 4, 
            "review": "Damn good.  Yes its in the middle of nowhere, far west of the Strip, but worth it.  Small place but cozy.  Pad Thai with pork was great.  The pork wasn't just ground up and mixed in but sliced and cooked separately so it was tender and flavorful.  Also had the coconut curry catfish which was amazing."
        }, 
        {
            "index": 210, 
            "rating": 4, 
            "review": "Food was good. We like spicy food and asked for scale 10 spiciness and we got it! We ordered papaya salad, Pad Kee Mao and Pad Thai. Pad Kee Mao was better than Pad Thai.\nThe decor was very refreshing, too."
        }, 
        {
            "index": 211, 
            "rating": 5, 
            "review": "First time eating Thai food in Las Vegas.  I'd say its pretty good!  I came because of its rating on yelp and its worth it.  Quick and courteous service.  Favorite dishes, so far, (because we'll be back) papaya salad, and the seafood fried rice. Both should be a spicy level 3. We  got the 5 and it was too spicy. Curry chicken seemed salty and watered down. Stuffed chicken didn't seem fresh.  Both chicken dishes weren't bad. \n\nNo matter what, I can't wait to try this place out again!"
        }, 
        {
            "index": 212, 
            "rating": 4, 
            "review": "This place is great. Huge portions for the price, fast service, and the flavor is amazing. Have been here a few times and i have never been disappointed."
        }, 
        {
            "index": 213, 
            "rating": 3, 
            "review": "Our family is a huge fan of Pin Kaow.  We were going to try Prommares, but instead chose Archi's.  \n\nFood - I had the Tofu Pad Thai (spicy level 6) and Vegetable Fried Rice.  The Pad Thai was ok.  I wasn't blown away from it and wasn't left wanting more.  I asked the server to fry the Tofu crisp and it came out soft.  They should have fried it a little bit longer.  The spice level was appropriate and enjoyable.  I felt the same way about the Fried Rice.  It was just ok.\n\nAtmosphere - The restaurant is small and the tables kind of feel on top of each other.  We prefer a more private dining experience.  We had a party of 6 people and that is probably the most I'd try to take here.  There is enough room to get larger groups in there, but it wouldn't feel comfortable in my opinion.\n\nService - The service was good.  The servers were friendly.\n\nWill I return?  Probably not.....unless I'm invited there by a friend or family member."
        }, 
        {
            "index": 214, 
            "rating": 4, 
            "review": "Love Archie's lunch menu! I usually go to  the Rainbow and 215 location, but decided to make a stop at this location for lunch today because I had heard the cooking style here is better. But honestly I couldn't tell the difference. \n\nMy usual lunch order is the red curry with chicken. I ordered spicy #4 on today's visit and whoa was it spicy for my taste. The order of thai tea sure helped! Their lunch items average anywhere from $7.95-9.95 and it comes with your normal soup, salad, eggroll, fried crunch, rice, and entree of choice. Very filling :)\n\nThe wait staff was friendly and the restaurant itself was clean, although I think I prefer the newer & more spacious rainbow and 215 location. \n\nOverall I definitely recommend this place for thai food!"
        }, 
        {
            "index": 215, 
            "rating": 4, 
            "review": "Yum.  After I've been pining over Pin Kaow and then finally loving Surang's, now I've tried Archi's.  Las Vegas does NOT have  bad Thai food.  Boy am I happy about that.  I love this place too!\n\nWhat I ordered:\n\nPad Thai - Yum!  It has a spicy kick to it, I definitely recommend it because it's different than the normal sweet taste. I don't normally eat this dish either but EVERYONE likes to order it.  But it's really good here!\n\nCatfish Delight -  This was ok, it was a little on the saucy side, but I still finished the entree pretty much all by myself.\n\nPanang Curry w/ Beef - BEST I have EVER tasted.  It was so good!\n\nMango with Sweet Rice - Good, but a little much on the coconut sauce.\n\nIf you love Thai food, go here!  I loved it!"
        }, 
        {
            "index": 216, 
            "rating": 5, 
            "review": "Best Thai food I've had.  I've had  few small restaurants in Henderson and East Vegas that were sub par.  Was introduced to Archi's by some friends and come back to eat every time I visit Vegas.  They marry the perfect spiciness to sweet in their Pad Thai.  Not overly greasy, very fresh and authentic along with good service.  \n\nI used to work up the street so came for lunches about once a week.  Had a nostalgic food moment, so I had to write about it.  \n\nChicken Pad Thai (get it SPICY!!) - Winner.  Good Thai Ice Tea as well.  \n\nReasonably priced.  I believe they have a fullbar, so you can get your drink on if you'd like."
        }, 
        {
            "index": 217, 
            "rating": 4, 
            "review": "Really nice clean comfortable place. Ordered Pad Thai- with tofu. Big plate of tasty Pad Thai, too greasy for my tastes, though. Good service. Fast and friendly. My friend got the stuffed wings- ok he said, nothing special."
        }, 
        {
            "index": 218, 
            "rating": 5, 
            "review": "Archie's is such a great option for Thai Food! I love their Pad Thai and they make the best egg rolls. Lunch specials are super awesome and the drive thru is extremely easy!"
        }, 
        {
            "index": 219, 
            "rating": 5, 
            "review": "Craving thai food?\n\nVegas yelpers... thanks for the awesome reviews!\n\nCame here on Friday for lunch with another fellow Vegas elite yelper!\n\nI had the pad thai noodles with chicken... no spice... and I was in love! I would love to come back for another thai fix soon!\n\nGood location, indoor seating, clean, causal dining, okay customer service, no waiting. Good for small groups.\n\nThai me up!\n-Miss Yelp 2011"
        }, 
        {
            "index": 220, 
            "rating": 3, 
            "review": "Food was great. Authentic pad kee Mao and a great green curry gravy on the seafood curry special. Be warned, they serve no alcohol at all which was a bit of a disappointment for the whole group I went with after our trade show ended and we wanted to get away from the strip to unwind. The service was so so, a bit delayed and terribly attentive. The food also came out one or two dishes over the course of about 10 minute. Great food, casual environment. I would recommend take out!"
        }, 
        {
            "index": 221, 
            "rating": 5, 
            "review": "My favorite Thai restaurant of all time!! One of my old Thai co-workers back in Cali recommended this restaurant when I told her I was moving to Vegas. Boy was it the best advice I ever listened to! I no longer live in Vegas, and I still crave for it. It is usually the first place I go to after I get off the plane! We always order the same things - beef salad, tom yum soup with shrimp, basil fried rice with beef, the catfish or the pad prik king with chicken. I usually choose spicy level #7 out of a 10 being the highest. Last time I cam here, the tom yum soup on that level was too spicy b/c all I can taste was the spice. I will definitely turn it down a notch to maybe 6. LOL Man, I want some now!!!!\n\nOnly downside is that the workers may not be too fluent in English. Well, homegirl didn't understand us too well, and I definitely didn't understand her. We still got what we ordered though, so it's all good! ;)"
        }, 
        {
            "index": 222, 
            "rating": 5, 
            "review": "These guys have the best Thai food. We tried all their plates when we were living in Las Vegas trying to find something we dislike, but it never happened. This is a must try!!"
        }, 
        {
            "index": 223, 
            "rating": 4, 
            "review": "This is a standard for all of our trips to Vegas.  The food is generally authentic Thai and it's a reasonably priced meal off the strip without the hustle-and-bustle.  I always get the spicy basil and beef, and it never disappoints.  The red curry is almost always solid; you can wash it down with a Singha beer; and the service is always warm and friendly"
        }, 
        {
            "index": 224, 
            "rating": 4, 
            "review": "I love Archie's! This was my first time at this location and I was pleasantly surprised! I ordered the Penang and it was delicious !\nI always order a 4-5 at Archie's and I love spicy food but a 4 here was actually pretty spicy for me !"
        }, 
        {
            "index": 225, 
            "rating": 3, 
            "review": "After remembering coming to Archi's and having a delicious meal, I convinced some of my friends to trek across town for some Thai dinner. However, after eating here, I wonder if I was struck with early memory loss because our meal was varying in degrees of deliciousness.\n\nHitting nearly dinner time, the place wasn't too busy, so we were seated immediately. The waitstaff were very attentive in refilling our drinks and answering miscellaneous questions. One of my friends ordered the Yellow Curry (heat level at 3/4) while the other ordered Pad Prik King (heat level at 0 - she's a big wuss when it comes to heat). I decided to get my favorite, Pad Thai (heat level around 5).\n\nAll of our dishes came out on a timely basis, but some were let downs. My friend's curry lacked much of its heat and also much of its flavor. Literally, the Pad Prik King had more spice than his curry - sad considering what they requested heat wise. He ate a majority of it, but set foot to devouring our dishes instead. The Pad Prik King and Pad Thai were good, but nothing extraordinarily spectacular. Our mounting hunger after watching two movies resulted in both the noodle dishes' demise, but all three of us agreed that we've had better elsewhere.\n\nUltimately, Archi's is not what I remembered it to be years ago. Prior to my first visit two years ago, I kept hearing so many accolades for this place, but after this recent visit, I'm not sure if it's well-deserved."
        }, 
        {
            "index": 226, 
            "rating": 4, 
            "review": "My favorite Thai spot in Vegas! Hole in the wall, mom and pop. If you are looking for some real authentic Thai food, don't go to the fancy Thai restaurants on the strip and pay more when you can get the real thing for a fair price on Flamingo(and newer location on Sahara). \n\nI usually order the Tom yum soup, papaya salad, and pad seew with chicken at every Thai place I try. All very yummy at Archie's.\n\nThere are spice levels from 1-10. 1 being mild and 10 being the most spicy. I ordered all 6 on the spicy dishes. I love spicy food, meaning I love jalapenos, habanero, Thai chili peppers. 6 was a little too spicy for me, but after a few bites, I got used to it. I think 5 would be perfect. At least you can add more of your own peppers to taste. I can't even imagine how spicy a 10 would be. I can imagine level 10 being on \"man vs food\".\n\nThe Thai iced tea was good, served in a huge glass. They do put tons of ice, so if you would like more liquid then ice, I'd tell them to lay off the ice a little. I personally like it with a lot of ice though. The thai iced tea also neutralizes the spicy hotness in your mouth.  \n\nThe only negative comment I have about archi's is the bathroom. It's not very clean and there were no paper towels or extra toilet paper.\n\nGo here for real delicious Thai."
        }, 
        {
            "index": 227, 
            "rating": 5, 
            "review": "Love to eat at Archi's! I always order the Koo Wah Kai? (Koo Wah Kie) It's a seafood dish with flat noodles. Soooo Yummy! I have always been pleased with the service! I've ate here about 6 times now. I will be back :) P.S. My boyfriend loves their curry!"
        }, 
        {
            "index": 228, 
            "rating": 4, 
            "review": "Went for lunch on Saturday.  We split the Pad Thai as an appetizer, and each ordered a curry dish, plus Thai iced teas.  The Pad Thai is amazing, however we found both the Panang and Country Curry disappointing.  The place is really small, feels like sitting in someone's living room, but the service was very good.  I'd definitely go back, the pad thai alone is something I'll probably be craving later."
        }, 
        {
            "index": 229, 
            "rating": 4, 
            "review": "Can't get enough of the chicken pad thai and an ice cold thai tea. Customer service is a bit short of what I expect but the food is delicious."
        }, 
        {
            "index": 230, 
            "rating": 5, 
            "review": "Had lunch here last week and the silver noodle salad was scrumptious. My husband had the yellow curry and really enjoyed his too.  Service was good but it was a bit noisy as it's a small place.  Well worth the occasional wait."
        }, 
        {
            "index": 231, 
            "rating": 4, 
            "review": "Stuffed Chicken Wings\n- Flavorful and tasty\n- Most thia restaurants do this dish w/ a breaded coating, which IMO would have brought this dish over the edge! :)\n\nPad Kee Mao Chicken\n- Flavorful dark meat chicken in the dish.\n- Mild/Medium spiciness was perfect, slightly spicy but not quite spicy as medium! :) \n\nService was prompt and friendly.\n\nLocation was hard to find. Exterior is questionable w/ the random drive-thru window and the 100% authentic Thai food logo... the strip mall is rather seedy and ghetto... the food definitely makes up for it! :)"
        }, 
        {
            "index": 232, 
            "rating": 5, 
            "review": "Ate at this Archi's a few days ago...had the lunch special of spicy basil with chicken. It was AMAZING! Ive eaten lots of Thai food, but this ranks as one of my favorites in Vegas. Highly recommend!!"
        }, 
        {
            "index": 233, 
            "rating": 4, 
            "review": "this place is gooooooooood! very fresh. small but good. ordered ground chicken n basil, crab fried rice n spicy beef salad.\n\nIts one of my favorite thai spots in vegas. Its clean food.\nI like lotus of siam too, but sometimes that place gets a little dirty. So for me, Archies is a safe bet for my tummy."
        }, 
        {
            "index": 234, 
            "rating": 4, 
            "review": "My brother, sister, her boyfriend, and I came here after finding out that Lotus of Siam was closed for the day.  We still had a craving for Thai food and ended up here.  It's been years since I've eaten here! One thing that I love about this place is that you get a gigantic glass of thai tea with just the right amount of ice and mixture of tea and cream.  Most other places will give you a regular sized glass and fill it up with ice and it's finished before your food even comes.  This gigantic glass lasts throughout the whole meal and then some!\n\nWe ordered chicken larb (medium spicy) with a side of sticky rice, papaya salad, chicken pad thai, and chicken pad see ew. The entrees came with steamed rice and we didn't have to order it separately. The food altogether was yum. They had asked how spicy we wanted the larb, but they didn't ask for the papaya salad.  I feel like they made the papaya salad medium and the larb mild when I had wanted the larb to be medium.  The larb was ok, although I've had better larb at other Thai restaurants.  \n\nI love the homey feel of this restaurant.  The way that it is set up makes you feel like you are sitting at home enjoying a home cooked meal.  The overall service was excellent and they even packed up our food at the end. The pricing was reasonable as well.  For our meal, including 3 thai teas and 1 thai iced coffee, the total came out to $75."
        }, 
        {
            "index": 235, 
            "rating": 5, 
            "review": "Best thai food on the west coast. Seriously. I got their spicy level 10 on my Pad see yee and was in spicy hell heaven.\n\nIt's restaurants like these that keep me excited in vegas when I'm bored with the fancy schmancy places in the casinos."
        }, 
        {
            "index": 236, 
            "rating": 5, 
            "review": "When craving Thai food this is the place I run to. The spicy eggplant and pad Thai are my favs. Very clean atmosphere as well"
        }, 
        {
            "index": 237, 
            "rating": 2, 
            "review": "Haven't tried Las Vegas's Thai selection, so I thought, TODAY IS THE DAY! I've been recommended two places, Pin Kaow and Archi's. Since Archi's was closer to me I decided to go with that. \n \nThe restaurant itself looked like a house that was remodeled into a restaurant. Cute and cozy. Looks like a nice place to have a lunch with some friends. I ordered the Pad Kee Mow and the Yellow Curry. I'm just going to assume that curries are already pre-made for the entire day and when ordered, they just heat it up for it to be ready to serve. And Pad Kee Mow's doesn't seem too difficult to whip up either. So why the long wait? I try to play in all possible reasons for the wait before I critique. Lots of people? Nope. Short staffed compared to the number of customers? Nope. I'm patient for the most part, especially if the food makes up for all of it! But sadly, it didn't. \n\nThe Yellow Curry was a little watered down to what I'm used to. The flavor was just not strong enough for me. I wouldn't say it was totally bland but, the curry itself was just not hitting those taste buds like I wanted it to. The Pad Kee Mow was..okay. I wished there was a stronger basil flavor and more noodles. You could tell all the vegetables that came with the dish were canned. Just didn't give off the high quality thai cuisine I had hoped for. \n\nBetter luck next time? I hope so!"
        }, 
        {
            "index": 238, 
            "rating": 4, 
            "review": "This was quite possibly the best meal I ate while in Vegas; it was definitely the most bang for my buck. I went with a group of 6 people. Two of the members of our party were locals, and they were smart enough to call ahead and make a reservation -- this place is pretty small.\n\nI was not disappointed with the food. I ordered a Thai tea and it was surprisingly big for $3. The shaved ice in it was different than what I am used to, but I liked it. I ordered the spicy eggplant. The server asked how spicy we wanted our dishes on a scale of 1 to 10; she warned us that 4 is approaching \"the danger zone\". I have been to Thai places that overestimate their spiciness, so I went with a 6. It was pretty damn spicy, but delicious. I wish I could have taken home my leftovers because I couldn't eat it all!\n\nI will definitely make my way back here next time I'm in Las Vegas -- since it's off the strip it's very lowkey and service was great."
        }, 
        {
            "index": 239, 
            "rating": 3, 
            "review": "First let me say we eat at Flamingo and Rainbow locations. The food is 5 star in both places. \nLast time at Flamingo place there was no hostess and I saw no sign about seating. We seated ourselves (2 of us) after 1 minute.  Lady came over with menu and told us in a nasty way we are not to seat ourselves in the future. We were so embarrassed we walked out. We have been coming to both locations for a while. Food is great both places, but now we only go to Rainbow. \nIf you get a bad hostess or waitress it ruins the meal."
        }, 
        {
            "index": 240, 
            "rating": 4, 
            "review": "I remember when Archi's first opened back in 2003-2004 and it was this little hole in the wall Thai place not many people knew about. I only knew about Archi because I own the hair salon (self promo : haircolorxperts las vegas) in that same shopping center. Though the years have passed since Archi's opened, the quality and service you get have always remained constant. The prices have increased about $2 dollars over the years, but I will still remain a loyal Archi's customer. The only reason I'm giving them 4 stars is because they are closed Mondays, and I can't get my Thai tea. \n\nPS: They have the best thai tea in town."
        }, 
        {
            "index": 241, 
            "rating": 4, 
            "review": "I ordered the Spicy Eggplant at a 2, because I read the reviews, and I am a scarey cat. I ordered it with beef, but the eggplant and the basil was my favorite part. My lovely friend ordered the Mongolian beef at a 4. We both could have gone up a few notches with the spiciness, but besides that the food was great! He also ordered a Thai iced coffee, which was good. Yumm.  I would like to go back and try the seafood \"pancake.\""
        }, 
        {
            "index": 242, 
            "rating": 1, 
            "review": "Here is horrible\nEvery customers will know they have a bad customer service. For sure they won't refill your drink and take care.\nI was really disappointed with their service.\nAlso they have a lack of English. So It's hard to understand them.\nFoods are good. But service is terrible.\nThey seemed to need money only. Don't have any sense and passion of working.\nThey don't smile tho.."
        }, 
        {
            "index": 243, 
            "rating": 4, 
            "review": "4.5 Stars\nI asked what was best and was told the Thai Chicken with basil.  It was really delicious and at $8 for dinner a good deal too.  It's a good 4 star rating but with the good price they deserve and extra half a star.  I will be back for sure."
        }, 
        {
            "index": 244, 
            "rating": 4, 
            "review": "When I go to Vegas, having a meal is a rare occasion. After 3 days of only consuming alcohol and one cup of noodle, Archi's was absolutely necessary. \n\nThe ambiance is cozy, but a little weird.  You really feel like you're straight up at your auntie's house. No music..... so all you hear is distant awkward family convos and... silence. But the service is comparable to going to your aunt's too. Everyone there is very welcoming, kind, and warm.\n\nThe food was gooooooooooooooooooooooooood. And not just because it was my first time eating after three days... lol. I eat at Thai Town in Hollywood all the time so I wasn't expecting this place to compare, but it really did.\n\n+tom kha - IT'S A MUST. Very different from every place I've ever tried. Coconut based, but they add a sour/spice flavor. Delicious...\n\n+pad thai- wet and saucy... perfect mix of sweet and spicy.\n\n+I'd choose the papaya salad over the beef salad if you're leaning towards one or the other. The beef was kinda hard to chew.... but the flavors were all there. \n\n+crab fried rice - it was average... you taste more of the egg than the crab."
        }, 
        {
            "index": 245, 
            "rating": 5, 
            "review": "best tai food in town. I've tried lot of places but archis is my favorite. customer service is good but the food is great. i recommend archis to everyone that likes tai food."
        }, 
        {
            "index": 246, 
            "rating": 5, 
            "review": "AWESOME! This is my fav spot! Everything is great. The curry is out of this world. If they delivered to my apt. I would be eating thai every day..."
        }, 
        {
            "index": 247, 
            "rating": 5, 
            "review": "Love their tom yum chicken soup and the ground pork with basil. Server was good when the restaurant wasn't busy. They just plainly suck during peak hour. Overall, I forgive them for the sucky service after I get my tom yum soup and my pork basil. Restaurant is clean too so that's a plus."
        }, 
        {
            "index": 248, 
            "rating": 5, 
            "review": "Best Thai food I've had in a long time.  Vegetable Panang was delicious, and chicken fried rice also top notch.  Service was good, location convenient, atmosphere quaint, and staff nice.  Highly recommended."
        }, 
        {
            "index": 249, 
            "rating": 5, 
            "review": "Service was spot on, super friendly host. Great portion sizes, great value, tasty dishes with fresh tasting ingredients. I can eat a whole lot and ordered two dishes, both were great and very filling. You can order spice level 1-10 on any dish and even get Thai peppers on the side. Will be coming back."
        }, 
        {
            "index": 250, 
            "rating": 2, 
            "review": "My husband and I just had dinner, and I did Not leave happy. we are In Vegas for 4 night and thought we would try this place out because of the reviews from yelp, what a mistake! We ordered 4 dishes and the portions were small and two of the dishes were very sour, they were the Tom yum soup with shrimp and pad Thai with shrimp. I ate it because we were hungry, from a long day of swimming. I am from la and I've had good Thai food, this place was not! We spent $40.00, it was totally not worth it. I would of been happier eating at Thai BBQ in down town."
        }, 
        {
            "index": 251, 
            "rating": 5, 
            "review": "Wow, the family had lunch at Archi's Bisto today since it was our only day off together in a very long time.  We were not disappointed.  We started our lunch out with a Papaya Salad, something new for us, but quite delicious.\n\nMy wife had Kung Pao Chicken, my daughter had Chicken Fried Rice and I had the Pad Thai Chicken.  We all went with the #5 seasoning and found it perfect.\n\nOur drink glasses never got empty, something my daughter appreciates, haha.  We got to the restaurant around 11:30am and were able to be seated right away, but by the time we left they were getting pretty busy.  Even with that, all of the staff, from bus persons to servers were all very attentive and friendly.\n\nWe really enjoyed the atmosphere, the Bistro is not that big, so even though they were getting busy, it still wasn't so noisy that we were not able to carry on a conversation at our table.\n\nWe will definitely be back to Archi's again.  Highly recommended."
        }, 
        {
            "index": 252, 
            "rating": 5, 
            "review": "My husband and I love this place. I think everything here is really good. The pad kee mao is very good. The Tom yum soup is very good as well although I wish they had it in a smaller portion so I could just have a cup of it as an appetizer. Also the pineapple curry with shrimp is very good. I really enjoy going here."
        }, 
        {
            "index": 253, 
            "rating": 1, 
            "review": "Very poor customer service. Not only have I had to repeat my order multiple times because they don't speak proper english, but they've always made me wait 2 times as long for my food. I leave to go pick up since they don't deliver, each time I extend my arrival 5-10 minutes after they say it will be ready and when I arrive my food is never ready! \n\nThe last time I went the lady yelled at me in front of everyone saying \"do you want food or not\" uhm, yeah lady! I paid for it. Waited 40 minutes for it, nope! Took my refund and walked right out!"
        }, 
        {
            "index": 254, 
            "rating": 5, 
            "review": "My son works at the Pizza Hut in the same plaza and told me they are always busy and lots of Cops eat there so it must be good .  Ha ha .  Well , we went last week and Wow !  Love the food .  I had the Spicy Basil Chicken and they ask you on a scale of 1 to 10 how spicy you want .  I got the 8 because I love a kick .  My son got the Mongolian Chicken with a 5 and we got an order of Chicken Fried Rice at a 7 .  I was really surprised at the big slices of Chicken in their fried rice , so many places skimp on that , not this place and it tasted great .  My sons Mongolian was sweet with a little hot and my Basil Chicken was perfect .  We had plenty left over for the next day and it also came with two white rice containers and that rice was perfectly cooked .  We love Asian Food and this is probably one of the best I have had in Las Vegas , no kidding .  I have had Thai Food before , but this is tops !  The dining area is small , but we ordered ours to go , so no problem .  They were full the night we went , but our food was prepared in a reasonable short time .  I will be going back .  I want to try the Pineapple Chicken Fried Rice next time ."
        }, 
        {
            "index": 255, 
            "rating": 5, 
            "review": "I have eaten here twice and done takeout several times and every time service has been impeccable and the food has been absolutely delicious. I would highly recommend this place to anyone looking for delicious Thai food in the area. Servers and staff are very friendly and willing to make recommendations and help out those who have questions. \n\nFor the entrees the restaurant goer picks a dish and then whichever meat they would like: chicken, beef, pork, or tofu. Or for an additional charge one can add shrimp. Every dish can be ordered spicy on a scale of 1-10 and I usually order around 4-5, but I really like this spicy scale. I would highly recommend Spicy Eggplant and Spicy Basil. Tom Kha soup is wonderful and I enjoyed the Fried Tofu, Wontons, and Fish Cakes. I liked both the Green Curry and Yellow Curry, but Panang will always be my favorite Thai curry."
        }, 
        {
            "index": 256, 
            "rating": 5, 
            "review": "I wish they would open up one of these in San Diego- WOW, it was soooo good.\n\nHad to deliver some of my art to a collector in Vegas, and we picked Archi's for dinner, as the other place we read about out near it was closed (ended up being a lunch only place) But I'm glad it was, this place was such a find. Read about it from Yelp on the iPhone while searching for something else nearby.\n\nAnd at first we were a bit hesitant, the name didn't sound all that Thai, but it went well with the modern/clean decor, which made the atmosphere very nice. It's much nicer than your standard Thai restaurant for sure, and the staff was very friendly, every one of them. \n\nThe food was spectacular, very fresh and came out quickly. Appetizers; spring rolls and stuffed chicken wings, and it went uphill from there. I liked they asked what level of spice you wanted (1-10), but I just asked for 5 and asked for the spice so I could add to my liking, and they brought out a whole array of them, so I added different ones at will. \n\nAll dishes were superb, for the wife and myself both (we split the dinners, Chinese style as usual), and I can't wait to go back and deliver the next batch of art there, just so we eat here. It was about 15 minutes from downtown, as we stayed near the airport. (VEry clean Hampton Inn for only $44 a night by the way, w/ breakfast!)."
        }, 
        {
            "index": 257, 
            "rating": 4, 
            "review": "Amazing take out option. Love the green curry...and you can trust their spice levels. The mango and sticky rice is a must when it's in season."
        }, 
        {
            "index": 258, 
            "rating": 4, 
            "review": "I like my Thai spicy. Most places I've been here don't really have the bite I'm looking for but I was very pleasantly surprised when my friend took me out for dinner after work at Archi's. \n\nIt was a pretty small restaurant but I don't really mind so long as when I get my curry it tastes good, lol...\n\nThe staff were really nice and even though there was only 1 person taking care of like 10 tables by themselves, they always kept topping off my water and came to check on us every 10 minutes like clockwork. Some places don't give you that same kind of customer service, which is a shame, but I was thoroughly impressed with it...especially given that they seemed a little understaffed.\n\nHats off to Archi's, I wasn't expecting much when I first walked in but they rocked my socks off."
        }, 
        {
            "index": 259, 
            "rating": 5, 
            "review": "OH ARCHI'S ! You have a place in my belly. The service is great, the food is so yummy, prices are reasonable, I feel like its the best thai in town (just my opinion!) \n\n It's addictive. Once you eat here, you'll want to pick up takeout a few days later. Yes it's that good! Oh, and to date I have never had to run home immediately following a meal IF you know what I'm sayin... I probably just cursed myself though. Oh and they opened one by my house on rainbow, but I still love the Flamingo location the best!!"
        }, 
        {
            "index": 260, 
            "rating": 4, 
            "review": "Well, I guess the Yelp peeps has got it right again! Not only yelp said it ... Zagat and Michelin said so too. Once I saw the signs, I was like .... this will be a good dinner. \n\nWe ordered the fresh spring roll for appetizer, crab fried rice, mixed veggies with beef, and spicy basil with pork in \"medium\" spiciness. The appetizer was an interesting combination of chinese sausage, cucumber, and fish cake(?) - the taste with the sauce was interesting to say the least. It is worth a try if you don't want that fried stuff once in a while. The crab fried rice was one of the best I had, the price is very reasonable for the amount of fried rice we all had. The veggie beef was tasty and the beef wasn't too chewy IMO, and the spicy  basil pork, though was spicy, the taste was there and it was PERFECT with white rice. Yes we got white rice on top of the generous portion. Too bad that our hotel has no fridge nor microwave ....... we could not bring it back.\n\nIF I wanna eat Thai in Vegas, we will be here again"
        }, 
        {
            "index": 261, 
            "rating": 5, 
            "review": "Archi's the OG of the three Archi's over town and it's definitely a good stand by for good authentic Thai food.  Everything I've eaten here has been consistently super tasty!\n\nI recommend....\nThe good ol' standby's:  Pad Thai, Anything spicy basil, Panang Curry, Chicken Satay, Tom Yum Soup.\n\nConclusion:  Consistently.  Authentic.  Tasty.  Get it spicy!  =)"
        }, 
        {
            "index": 262, 
            "rating": 5, 
            "review": "way off the strip, but soo worth it.  we came here on the way home after a friend suggested it.  being asian and having drank the night before, all i wanted was some pho!  pho in vegas? hmm not happening, so won ton soup was the next best thing!\n\nit was jam packed with veggies and won tons.  i was shocked at how generous they were!  the broth was delish and slightly buttery...but i love butter, so no biggie to me!  \n\nthe service was amazing, refilling our water all the time. \n\noh and they have a drive thru too!!"
        }, 
        {
            "index": 263, 
            "rating": 1, 
            "review": "I dined here 6/20/08 and had the worst service ever!  I have actually been eatting here for the last 4 years and use to go to the original location on torrey pines and flamingo, and since they have opened the one on rainbow and 215 i have been going there instead.\n\nI ordered lard na, and it was served to me chunky with a weird odor.  I tasted it and it was disgusting, I called the server to switch my order and explained to him and her that the noodles were either burnt or old one or the other.  I have ordered the dish in the past and it has never tasted or looked like the way they served it to me that day.  \n\nThe waitress said if she takes the food back it would be a lost to the business and she would have to pay for it!  I was shocked, apalled and offended with her response.  I am not one of those customers that eats all their food and then sends it back for a free or different meal.  The plate was practically untouched and still she refused to take it back, saying it was business policy.  \n\nI asked for a manager, which she said wasn't there.  I am very fimilar with the establishment and knew that Archi himself would be at the other location working, so I had her give me the number to speak to him myself.  \n\nI explained to Archi the situation, and he too said that they never ever take food back, and that his cooks prepare meals the same way every time.  I am of south east asian descent myself, and I know exactly what the dish is suppose to look like, and last but not least I have eatten there before with out the burnt and odor smell.  \n\nIt wasn't until I told him that I would put a bad review, and that I worked in the F & B industry was when he said that they make exceptions once a year.\n\nThats bull if you ask me.  If you are in the area try kin paow on rainbow and windmill, price is comparable and food is much better than archis.  If you disagree, the day any of  you ever dispute the food trust me you will be upset with their \"business policy!\""
        }, 
        {
            "index": 264, 
            "rating": 2, 
            "review": "i had the lunch special pad thai chicken i was undecided between that and pad thai shrimp the rice noodles where stuck together as if they had beeen using the same noodles all morning. I got my food for take out and lets just say im not a pan i will continue to go to thai noodle house YUCK. eggrolls were good though"
        }, 
        {
            "index": 265, 
            "rating": 4, 
            "review": "I admit ...when I first caught glimpse of this place, I was a little scared.  It looked like an old converted In-and-Out, with outside seating and an old drive- thru window.  Truthfully, I was actually starting to doubt my friend's choice in lunch options AND Yelp.  Terrible, I know.\n\nBut, once again, I should learn NOT to judge a book by its cover.  I mean, I should realllllly stop that.  \n\nArchi's is cute and cozy inside, with about 10 tables.  We were lucky enough to score some lunch specials ($7), which came with an entree, soup and a spring roll.  My basil chicken was really tasty, but the 'mild' spiciness was a tad too hot for me!  And, I can take spice!  Whoo.  My friend's pad thai was also really good and a little on the sweeter side (which I enjoy!).  We were seriously dehydrated as we were just exposed to the insane Las Vegas heat, so we were glad that the waitresses were attentive and refilled our glasses pretty often.  Satisfaction with our first meal in Vegas!  \n\nSo, lesson learned!  I'll be less judgmental next time, I promise."
        }, 
        {
            "index": 266, 
            "rating": 4, 
            "review": "Have been here several times, and once to their South Jones location.  This location was better.\n\nQuality of food is very good, service is pretty good, good value, good options from the menu are the Larb, Panangs, Pad Thai, Curries.\n\nCrowd at restaurant is fairly diverse, only issues I have had here is sometimes patrons can be disruptive - nothing the restaurant is really responsible for except maybe a gentle and respectful reminder to their patrons to be respectful of others (usually issues with very loud/raucous conversations or pre-teens not acting appropriately).  As the dining area is small - this kind of behavior turns easily disruptive to others."
        }, 
        {
            "index": 267, 
            "rating": 5, 
            "review": "My favorite Thai place in town. Even when I travel I have yet to find better Thai food. The employees are great & the food is fresh! We get a beef salad every time we go! Everything from the curry to pad Thai to sticky rice dessert. It's all amazing! I even go with my BF who grew up with a Thai mother & this is his favorite place to go as well (:"
        }, 
        {
            "index": 268, 
            "rating": 2, 
            "review": "For pickup service only:\n\nFirst of all, I'm honestly kind of bummed that they don't offer delivery.  They're not far, but...when you're really hungover, and looking for something quick to eat, you don't want to have to drive anywhere.\n\nThat being said, we could have chosen to order from a place that DOES deliver, so, not a deal breaker for us.\n\nMy fella and I were nursing hangovers on Sunday, so we placed an order and he went to pick the food up, while I stayed in bed with the blankets over my head.\n\nWe ordered:\n\nShrimp pad thai:  Meh.  the shrimp was REALLY dry.  the noodles were decent.  \n\nChicken pad thai:  Meh...little sub par for me, really...I liked the pad thai at the monastery food fair better, and that had tofu in it. (and I generally do NOT like tofu AT ALL.)\n\nMasaman curry:  THIS was good.  Really good.  Not too spicy (I'm a wuss), and it had plenty of chicken, and potatoes.  If I could make one change, I'd have them send more rice with it...I ended up having to make a cup of rice this morning for my leftover curry for lunch.  Not a big deal, but...it would have been nice to have everything ready.\n\nThai coffee:  standard.\n\nSo...all in all...this is not the best Thai food I've ever had, but its certainly not awful.  I'd order from here again, and might even venture out to eat in their dining room to experience the service."
        }, 
        {
            "index": 269, 
            "rating": 1, 
            "review": "Very rude employess!\nToo sweet , too salty, also when we complianed about the taste. They did not offer a fresh dish. They just dipped it in hotwater and brought it back.\nAlso when i ask the waitress why too salty and too sweet and she said it is personal preference!\n\nOwner seems like do mot care about people's health! Who know whatelse in their menu."
        }, 
        {
            "index": 270, 
            "rating": 1, 
            "review": "Horrible service! If your picking up you have to harass them or they forget your order. And they do nothing to compensate. Waited 30 minutes for a small soup before I cancelled my order. They hadn't even made it yet they forgot it."
        }, 
        {
            "index": 271, 
            "rating": 5, 
            "review": "I really really really love having relatives that live in Las Vegas.  Yes there are amazing restaurants on strip, but their price-tag is usually due to hype.  \n\nThis place is off-off strip, delicious, and amazing.  So very worthy of 5 stars.  Their service is warm and friendly.  Their food is delicious!  I've had a plethora of things off the menu, but I adore their Pad Thai, Seafood Green Curry, and Papaya Salad.  Be careful to order things on the spicy side here, because they deliver, you're entire mouth will be en fuego.  You can always ask for the spiciness on the side, as I often do.\n\nI really do believe the test of a good Thai restaurant is if the food tastes good the next day, and Archi's definitely passes."
        }, 
        {
            "index": 272, 
            "rating": 5, 
            "review": "I love this place. Very authentic Thai food! I love how their angel wings ( stuff chicken wings) are baked instead of fried!!! Almost all the other Thai restaurants prepare this dish fried. So far, only Archi's is baked and they are really good!! They always prepare the pa wen San as how I like it. The soup is not loaded with sugar, so it is perfect And authentic. Some places add lots of sugar to everything, which effectively ruined the dish for me. \n\nReally attentive staff. I don't go anywhere for Thai food except this place and the one on Sahara."
        }, 
        {
            "index": 273, 
            "rating": 5, 
            "review": "Amazing food, made to order. I went with a friend and we are both pretty fussy and both very pleased!  We are both vegans with food allergies. Yum!"
        }, 
        {
            "index": 274, 
            "rating": 5, 
            "review": "This is probably my favorite restaurant. The food is amazing and the setting is very pleasant. Whenever I come here, I always order the Pad Thai, Kung Pow, Red Curry, and Tom Yum soup. All of them are delicious. Sometimes the food takes a bit long to arrive, but is absolutely worthwhile."
        }, 
        {
            "index": 275, 
            "rating": 3, 
            "review": "This place was OK, but I think Krung of Siam had a better panang beef.  The thai spice rice was ok, but overall I think it might be a little pricy for the amount of food you get."
        }, 
        {
            "index": 276, 
            "rating": 3, 
            "review": "Coming from LA, Thai capital of the US, my level of Thai food snobbery is high. Unlike the scores of pad thai fans, I prefer to judge Thai restaurants on green papaya salad. It's hard to fake freshness with this dish and corner cutting on the prep is obvious.  In addition to my standard test dish we also ordered fish cakes, chicken larb and sticky rice. We went for #4 in spiciness.\n\nThe food came out promptly. The papaya salad was quite fresh, peppered with dried shrimp and green beans. The taste was akin to that of the Bangkok street stalls. The fish cakes were also quite good and contained bits of either onion or leek. You could tell the slightly gritty ground rice in the larb was homemade instead of rice powder out of a jar.  The heat scale was the real deal and 4 was perfect.  It's good to know I now have yet another great Asian food option in the City of Sin."
        }, 
        {
            "index": 277, 
            "rating": 4, 
            "review": "Every time I come here the food is delicious.  Chicken Pati and red curry are pretty good."
        }, 
        {
            "index": 278, 
            "rating": 5, 
            "review": "OMG this must be the best Thai place that I've been too. \nEverything we tried was delicious. The food could be very spicy if you don't know the ranking. I eat spicy but #4/10 was way too spicy for me. Go with 1 or 2 to be safe. I did not like the soup since it was serve in a bowl, not one of the hot pot thing. The lard was my favorite dish. Thai tea is highly recommended since they did not make it very sweet and it was a huge glass. Most of people at our table togo half of the glass. \nI did not like how the waitress kept forgetting how many people at our table and we always missed something. \nThis place is tiny so I would not recommend it for big group on Sat or Sunday."
        }, 
        {
            "index": 279, 
            "rating": 4, 
            "review": "My sister and I go to Archie's about 3 times a month. We split the Tom kha soup and ground mint chicken or panang chicken . Love this place, I guess the only thing I can say bad is that the levels of spicy ness. We get a 6 every time and sometimes it's a 6 and sometimes it's a 8 or not spicy at all. But the flavor and the blend of spices is always delicious . I would definitely recommend."
        }, 
        {
            "index": 280, 
            "rating": 3, 
            "review": "After talking about different places to eat for Thai food from people residing in Las Vegas, I have often heard I must try Archi's!  \"It's the best there is!\"  Well I like to rephrase that, \"It's the best there is if your not familiar with Authentic Thai food and enjoy Americanized Thai Food.\"  Brutal comment, but it's the truth.  When I arrived to pick up my food, not a single Asian in sight in the restaurant, except for the workers there of course!  I was a bit worried about that, but as I took my first bite of the Thai Beef Salad, I was pretty impressed with the flavors!  It was sweet, savory, and a hint of spice.  Pretty much the type of flavor expected in a Thai style salad.  What I was disappointed in was their Phad Thai!  Now EVERYONE has said their Phad Thai was the best, well I must say, i have had better!  The rice noodles were cooked well, but the type of ingredients used wasn't as tasteful, kind of reminded me of Chinese Sa Tay sauce on rice noodles, which was not what I was expecting.  \n\nI asked my friend who's family is from Thailand about her experience there and she basically said, \"It's good, if you like Americanized Thai Food.\"  I responded, well sometimes I do crave it but I prefer the traditional Authentic That food I can get closer to home.  \n\nI mean come on, what kind of Authentic Thai food serves an egg roll and crispy won ton skin with their Phad Thai?  How unoriginal and American is that!?  \n\nAlthough I did rate this place a 3-Star, I'd still come back here for their yummy Thai Beef Salad!  Yum!"
        }, 
        {
            "index": 281, 
            "rating": 5, 
            "review": "This place never fails. I've checked out many Thai places around Vegas and I aways seem to come back to this place. I always get the papaya salad, chicken satay, panang curry, and most importantly, their GARLIC PEPPER CHICKEN! This dish is life changing!!!"
        }, 
        {
            "index": 282, 
            "rating": 4, 
            "review": "Like the other Archi's Thai restaurants in Vegas, this one does me right. \n\nNow let me say this: the only Thai food I've ever had is Panang Curry, because I'm new to Thai food and that's what I had first, and it was delicious. I now use it as my bar to compare Thai food.\n\nThe Panang Curry is my favorite here of all the other places I've tried.\n\nPro-tip: they'll ask you if you want spicy level 1-10. If you're a fan of spicy food, it actually goes to 30 (in increments of 5 after 10). I get the 30. It's good."
        }, 
        {
            "index": 283, 
            "rating": 4, 
            "review": "So it gets 4 stars just for the drive through.  Perfect when the flu bug hit and ya need soup to take home as it pairs so well with trash tv."
        }, 
        {
            "index": 284, 
            "rating": 1, 
            "review": "Food is good\nBut services is shit\nOnwer is changed? employees very unkindly and something is different then before. . (About atmospheres not interiors)"
        }, 
        {
            "index": 285, 
            "rating": 4, 
            "review": "DO NOT TELL MY MOM!!\n\nThe pad thai served here is *sometimes* better than hers.. The only thing that this place is lacking in when I come is service. Asian mothers ruin dining for their children- I always need extra lime for my pad thai, but after waiting 15 minutes for the lime I asked for I started eating my almost lukewarm noodles, sans lime. \n\nI like that their lunch options come with sides. I remember the soup being pretty good, and the spring rolls being pretty generic. Nothing to write home about. \n\nHas anyone tried the '10' level spiciness on their entree? I'm always scared to get it, thinking that once they see the ticket in the kitchen they're going to think I'm some sort of badass and scoop 2 more spoonfuls of chili into my pad thai, so I get the 9 and it's pleasantly spicy for me."
        }, 
        {
            "index": 286, 
            "rating": 4, 
            "review": "An enjoyable casual dining experience. My Wife and I enjoy the YenTaFo."
        }, 
        {
            "index": 287, 
            "rating": 5, 
            "review": "Bet Thai Iced Tea and Coffee anywhere! Great food, too! We always stop in whenever we are in Vegas. Service is excellent, prices are good."
        }, 
        {
            "index": 288, 
            "rating": 4, 
            "review": "Archi's is my go-to place for Thai. Their 6.95 lunch specials can't be beat. Love that when you ask for it hot, it's actually spicy. Great soups, pad thai, curry and other dishes. I haven't had anything I didn't enjoy."
        }, 
        {
            "index": 289, 
            "rating": 5, 
            "review": "RE-DONK-U-LOUS-NESS!! Archi's rocks my Thai pallet. \n\nThere are two locations, I use the one on Flamingo for to-go orders & the one of Rainbow for dine-in.\n\nYellow curry chicken (you can specify how hot you like it), thai tea, delish!!!!!!!!"
        }, 
        {
            "index": 290, 
            "rating": 4, 
            "review": "Arguably the best Thai food in Vegas. The Archi's restaurants have the best consistently good food hands down. Archi's Thai Kitchen is my favorite because it feels more like a home kitchen.\n\nLocated near Torrey Pines and Flamingo intersection, it stands alone as the only worthwhile eatery in the shopping center it is located in. But due to its slightly nondescript location, it doesn't have the same traffic as the Bistro and Cafe. I've never had to wait for a table and service has always been good.\n\nThe drive through is a little hit or miss. Having a \"go-to take out\" location very close to where you live is such a rockin' thing, but the drive through doesn't always work like you'd want it to. Most of the time you pull up and have to wait until somebody on the waitstaff notices you at the window, which during busy times may be 5 or so minutes. But that's pretty much it in the way of criticism...\n\nThe food quality is consistent and good. The spice level, 1-10, has good range.One thing to note is that the spice intensity seems to vary with the cook. Also, test any takeout before you dive in, especially if you're getting multiple orders of the same thing with different spice levels. \n\nI've eaten at almost every thai place in town and this is my first suggestion for anyone who asks."
        }, 
        {
            "index": 291, 
            "rating": 4, 
            "review": "The food was pretty good, but decor needs help.\nThe tablecloths looks as though they haven't been changed since the restaurant opened."
        }, 
        {
            "index": 292, 
            "rating": 3, 
            "review": "When I first moved here, several people told me this was THE place to go for thai food. I tried Weera first, and loved their food. Coming here, I wasn't particularly impressed by either the food or service.\n\nOrdered takeout, taking advantage of their drive-up window and their lunch menu available til 3PM- opted for the pad thai and red curry, ordered by phone on my way out the door from my office. Arrived on time and pulled up as instructed, only to sit there for five minutes without being acknowledged by the woman standing just inside at the register. At first I thought maybe she didn't see me, but several people walked up and talked to her, and made eye contact with me and a comment to her. Generally I expect to be acknowledged when I'm waiting, even if it's just to say sorry it'll be a couple of minutes- I prefer that over being ignored by far.\n\nGot home with my dishes, good portions for lunch pricing- $8/per person.\nPad thai was a large portion of noodles, chicken was a little on the dry side, dish was a little spicier than expected for a 3 but reasonable. Curry was a 4, which was quite spicy and BF did not care for the spice level but the veggies were fresh and the beef was a good portion. Appreciated that the rice was fresh and fluffy, offset the spiciness of the curry. Both dishes served with a wonton and spring roll- tasty and not overly crispy.\n\nWould swing by to take advantage of lunch pricing again, but after all the hype I simply felt the product wasn't amazing but rather just average."
        }, 
        {
            "index": 293, 
            "rating": 4, 
            "review": "Quick update:   Still keeping this a 4, and still loving my Thai Basil with Chicken lunch special and Brown rice.  I've also mixed in some Ginger Chicken lunch specials at times and really enjoyed that as well.\n\nThe main reason for the update?  I swear their spice levels have gone up a notch.  The last two times I've gotten my usual 7, my mouth has been burning more than I was used to before.   Not in a bad way, but I wouldn't mind a little consistency.    They've also updated their take out containers lately to this fancy schmancy plastic numbers instead of the styrofaom standard.  I'm into it.\n\nIf Thai Food drivethrus ever spread like wildfire across all countries, the goal of world peace would become more viable."
        }, 
        {
            "index": 294, 
            "rating": 4, 
            "review": "We were desperate for affordable, tasty food in LA.  Archi's got the job done.  This place has solid, vegetarian-friendly Thai fare in a city that doesn't necessarily pride itself on good cheap eats.  And the Thai iced teas are mammoth..."
        }, 
        {
            "index": 295, 
            "rating": 4, 
            "review": "Wifee says ' I want Thai '. Ever obedient, I grab the iPad, load the Yelp app and search for Thai. Archi's rates highly, but there's three Archi's I note. Eeny,Meeny,Miny,Mo. Archi's Thai Kitchen it is. Jump in the car with wifee, teen daughter & fussy eating 10 year old. \nIt's easy to find and great parking. Two cop cars outside, I park right by them thinking they were watching the neighborhood and the car will be safe. No cops in the car! Hum? \nGo into Archi's and law enforcement were chilling at a table and seemed to be enjoying a plate of Thai food. The restaurant is bright, not large and reminds me of where you would eat your breakfast in a Hoilday Inn Express. I don't think that's a bad thing but it was very bright. Friendly server sits us immediately and gives us iced water. I order beer & Chardonnay as is my tradition. WHAT? NO BEER OR WINE? I sob..... It's clearly marked on the Yelp review but I didn't notice. Dumb. Anyway the food; we order Sesame Toast and egg rolls to start. The toast is deep fried and too greasy, egg rolls were fine. 10 year old McDonalds aficionado wants plain chicken , they fry him up plain chicken and it was great. Teen wants chicken fried rice and a Mongolian beef dish, ordered 3/10 on the heat/spice scale she thoroughly enjoyed it. Wifee ordered the same, but being a spicy food bigshot, she went for 7/10. Good choice, wifee happy. I take a chicken cashew dish , 5/10 (pathetic , I know ) and was equally happy. There were many Thai clientele eating and the place was charming.\nGreat food, $70 before tip and we will be back to Archi's but I believe the other locations will give me a beer to quench my thirst and alleviate the heat should I go crazy and order my food 6/10 on the spice meter."
        }, 
        {
            "index": 296, 
            "rating": 5, 
            "review": "Cute restaurant. Thanks to Wondering Steve on you tube. Pad Thai was delicious. Pannage curry was off the chart. Great rich creamy flavor. Great chose. Great restaurant, clean, classy, great waiter.  Good menu choose."
        }, 
        {
            "index": 297, 
            "rating": 5, 
            "review": "We are looking to try something new near our vacation home. We just recently started using Yelp so we decided to give Yelp a shot at picking our dinner spot. We ended up at Archi's and we were so glad we did. The take-out service was fast, the food was AWESOME, and the choice of spiciness between 1-10 makes it easy to get a good, spicy dish. We would certainly recommend this place!"
        }, 
        {
            "index": 298, 
            "rating": 4, 
            "review": "Food was great.  My husband and I stopped in after a long day at the DMV. The Laarb salad was delicious and it was my first time trying Thai Basil Chicken. Yummmm! Only complaint was the service was kinda bad. We each were given a fork with napkin. When I asked for knives, she only then brought out 1 knife for us to cut our stuffed chicken wings. My husband and I had to share a knife. Made it a little difficult to eat without a spoon to scoop and sharing a knife. I gave up trying to get their attention for silverware or drink refill. As every time a server or busser walked by they walked so fast and no eye contact. Food was excellent, but I'll stick to my usual fav Thai restaurants."
        }, 
        {
            "index": 299, 
            "rating": 4, 
            "review": "Archi's is the best Thai joint in town!! All my local friends have told me so and I believe them! Their lunch special is from 11am-3pm (3pm, i think?) and it comes with salad, soup, and an eggroll + your chosen dish for about $7.00.\n\nWhatever you order, from the curry to pad thai to papaya salad, the server  will ask you \"How spicy?\" The scale is from #1-10. I like medium spicy, so i usually ask for spicy level # 6. If I feel like I want medium spicy that leans towards hot, I'll ask for level #7. \n\nSince this place has 3 chains all located in different parts of the town, it makes it very convenient to get your Thai food fix wherever you are. The ambiance of this place is very soft, clean, and inviting. I love dinning here. I always feel like I am at a resort. You know what i mean when you check this place out.\n\nSide note--\nIf you have a big party, I suggest you go to Archi's Thai Cafe (located on W Sahara Ave). Its a bit more open and spacious. Archi's Thai Kitchen is a bit small and on the cozier side."
        }, 
        {
            "index": 300, 
            "rating": 5, 
            "review": "What cool little spot.\n\nI don't usually leave the casino much when im out here because i only come to Vegas for work, but I had some friends in town so we went out to eat.\n\nThe building is nothing fancy, actually pretty plain inside, but it was a nice spot to enjoy catching up with old friends.  It was very quiet inside event though there were a handful of tables with people eating (maybe thats a sign of good food??)\n\nthe service was amazing.  I was pretty thirsty so i was downing the water in the smaller sized cup they give you and it never was empty.  The servers were there constantly to take care of any needs, but they werent overly attentive and only seemed to show up when we needed something.\n\nI didn't get anything crazy and just had the garlic chicken tonight, but it was great.  I have heard of levels of heat, but she only asked us none, med, or hot.  I chose medium thinking of what people have told me of \"thai hot\" but the medium was actually very mild.\n\nnice place, decent prices, awesome service.  very good experience."
        }, 
        {
            "index": 301, 
            "rating": 4, 
            "review": "One of our last visits, we came here with a recommendation of a friend.  It was right before the gwen stefani sweet escape tour! Anyway, we had a satisfying dinner here. Had nice big glasses of thair tea, yummm. We had coconut hot and sour soup and some pad thai and chicken satay. All were pretty tasty. If I had another thai craving while in Vegas, I will be sure to hit up archi's thai kitchen. Oh, don't let their small space to dine in fool you, good things come in small packages!"
        }, 
        {
            "index": 302, 
            "rating": 5, 
            "review": "We went to this place during our vacation last week and were very impressed. We eat a decent amount of thai food, and this place stood up with the better ones. It's off-strip and is very casual (which we prefer). We had:\n\n- some curry / red bell pepper / catfish thing. fantastic. #12 or #13, i forget.\n- green chicken curry - very good\n- wonton soup - very good. nice mild broth flavor, and the meat/wontons were good.\n\nService was good not great.\n\nI'll be coming back here when i come back to vegas."
        }, 
        {
            "index": 303, 
            "rating": 5, 
            "review": "This place's food should be the standard for all Thai restaurants.  The food's great.  The satay is delicious, the chinese food is also great here.  You just have to learn how spicy of food you can take since they give a range of 1-10 when ordering.  A 7 is pretty hot for me, but my Thai friends seem to order 10's.  The pad thai is a must."
        }, 
        {
            "index": 304, 
            "rating": 4, 
            "review": "First time to try this location. Service was a little slower them the other location, but the food tasted great and the spice level was perfect at a number 7. I had the spicy basil with pork. This dish is so filling and probably should be split between 2 for lunch but hey, I'm a big boy!! \nThis place was pretty packed for lunch but still worth the wait if you have some extra time on your lunch hour."
        }, 
        {
            "index": 305, 
            "rating": 4, 
            "review": "Good little Thai spot. Fresh Coconuts, Pad Thai, Tom Yum... they got it all and its all pretty good."
        }, 
        {
            "index": 306, 
            "rating": 5, 
            "review": "A MUST, and i mean A MUST when i go to back to vegas.\n\nhow often does one find an authentic restaurant? NEVER\n\nmy dad and i stumbled upon this place and its very very very dear to my heart.\nthough my dad isnt a fan of coconut i make sure we get the Tom Ka, along with the Padprick King Beef and the Red Curry.  my little sister adores the coconut ice cream and will stop by just to get it sometimes.\n\nthey level their spicy-nes from 1-10 and though my dad can handle a ten i cant even take a 4.5 \n\nthe waitress's are nice and though the place is small ive never had to wait more than 5 minutes to eat.\n\ni really do love this place. i really do.\n\ni have yet to try the  one 215 and rainbow but im sure its good.\n \ndont be in the mood for thai on a monday because they are closed."
        }, 
        {
            "index": 307, 
            "rating": 4, 
            "review": "It was a cold and rainy night. I headed to Vegas for the cure. The cure was Tom Yum soup with chicken from Archi's. The soup was hot and delicious and hot. Why 2 hots? Because I ordered spice level 5 from the option of 1 to 10. As I get older, I find the spice level I'm able to tolerate keeps getting lower. That's a shame...my 18 year old self would laugh at me now. Back to my review. The quality of the food, friendly service and reasonable prices make this a solid 4 stars in my book."
        }, 
        {
            "index": 308, 
            "rating": 4, 
            "review": "Good food, crowded, service somewhat spotty, cheap prices. I would totally go again."
        }, 
        {
            "index": 309, 
            "rating": 4, 
            "review": "Best Thai in Vegas, by far.  It really is as good of Thai as I've ever had.  But they really do need to kick up their AC."
        }, 
        {
            "index": 310, 
            "rating": 4, 
            "review": "i love this thai kitchen. i had the red curry with beef here with the spice at 7. it made my nose run, but i could probably go a spice higher.\ni introduced my parents to this place who never ate a lot of thai and they loved it. my mom (picky eater!) is a big fan of the cashew chicken and gets it on the regular now. i found it to be very tasteful.\nmy dad tries different things all the time and loves the spice factor. it lingers on your tongue so weak stomachs beware.\nthe thai ice tea is really sweet and a treat all in itself. i had to share it otherwise it would have filled me up completely.\nthe service was nice and attentive. we went on a weekday afternoon and there was only 2 other tables filled.\ni cannot wait to go back for lunch soon and try my favorite thai dish, the pad see ew with beef.\ndefinitely a thai place to eat at!"
        }, 
        {
            "index": 311, 
            "rating": 1, 
            "review": "Mom and I are big fans of GOOD thai food.. This was NOT good. The Tom Kha (coconut milk / lime soup) was average but the shrimp was undercooked. The chicken satay was terrible.. Fatty and lacking that Thai spunk .. The Red Curry was flavorless.. Their prices were on the high end compared to .. Say .. Panna.. In SW Vegas... Except Panns is so tasty you'll be dreaming of your next visit back before your meal is fully digested. Definitely disappointing trip based on other reviews.."
        }, 
        {
            "index": 312, 
            "rating": 4, 
            "review": "Give it a 4 star solid stuff, second or third best in town.  Best in sw.\nMmmmmm.  Mmmmm good."
        }, 
        {
            "index": 313, 
            "rating": 5, 
            "review": "Nothing compares to this place.\nI've tried Thai from some areas in Long Beach/LA and i just don't really like how the food taste, I keep on thinking of Archi's and how great their food is. I just can't come to Vegas all the time to get Thai I guess...\nBut when i am in town this is the one place I keep coming back to(been coming since Summer 2011). Def recommend, haven't tried all dishes but the ones i get are delicious (especially the Pad prik king)."
        }, 
        {
            "index": 314, 
            "rating": 5, 
            "review": "Awesome Thai food. Most of the items are typical of what's available at other thai restaurants. The only difference is the portion size. The nam tok and Tom ka gai are usually fail proof. The beef is tender and not overly salty. Chicken in the Tom ka gai is not over cooked in the soup like in some restaurants. This place gets pretty crowded on the weekends and sometimes the service can be a little slow, but the food is worth the wait! Check them out!"
        }, 
        {
            "index": 315, 
            "rating": 5, 
            "review": "Definitely my favorite Thai food place.  Reasonable price, convenient locations (for me), decent service and the food is always good.  I like pretty much everything they have.  My usual dishes are eggplant with chicken, Tom yum soup,  and beef salad.  Their iced tea has a smokey flavor to it which I really like."
        }, 
        {
            "index": 316, 
            "rating": 4, 
            "review": "Everyone who is anyone who loves Thai Cuisine will have to make a pit stop at Archie's on Flamingo and Jones! ( it's just a little more West of Jones) - \nThey have a very easy and goto Menu, it's not full of items you wouldn't know about! \nTom Yum Tom Kha all the BoMb Diggity! ^__^ So I love eggplant, and Archi's hits it on the money everytime. I get it all Vegitarianed Out even though I am a Meat lover as well... \nI also, love the Satay ( Chicken ) with peanut sauce and Cucumbers that I would love to mimic but cant... *__*..\nI will always go back for More.. The snow ice is bomb..."
        }, 
        {
            "index": 317, 
            "rating": 4, 
            "review": "Im not that familiar with Thai food...but.....\nYummy~! Good lunch specials~! i had the chicken basil... and the beef salad! I was even craving it the day after!!!"
        }, 
        {
            "index": 318, 
            "rating": 3, 
            "review": "The Skinny: solid Thai food in a comfortable atmosphere (3.5) service - they'll get your food on the table but bring your own beverage 'cause refills are slow in coming (2) value - come here for lunch, not for dinner (3).\n\nWhen I have a hankering for pad thai or green papaya salad, I head here. I do it because a)it's close, b) it's not divey like Lotus of Siam (which is close to the infamous Green Door... dive!), c) their prices are reasonable during lunch time.\n\nThe pad thai is a little too spartan on the protein, a little on the sweet side, and a little on the wetter side than I like. Sometimes it does lack \"wok-hey\" depending who's cooking (what we Asians call \"wok air\" - meaning the heat of the wok required for that slight char on stirfried dishes), it's flavourful enough to warrant subsequent visits.\n\nThe pad see-ew tastes good but occasionally suffers from use of poor parts of chinese broccoli (gailan). The resturant does not strip the outer fibrous, bitter stem to the more tender middle parts which would definitely improve the dish.\n\nThe spicy eggplant with thai basil again has nice flavours but the overall greasiness of the dish is off-putting (but then again eggplant is really hard to stirfry, period). The green papaya salad is fresh and goes well with the oppressive Vegas heat.\n\nThe real value is at lunch time. You can get various offerings for only $6.95 which is good for a thai restaurant. Also at this location, they have unlimited refills of certain sodas which they don't have at the Summerlin/W. Sahara branch.\n\nAs for service, expect to be served with efficiency so that the tables can be filled by other patrons. Don't expect that your beverage glass will be looked after quickly either. Lunch time is hectic at this location so get here a little earlier than noon or after 1pm to avoid waiting."
        }, 
        {
            "index": 319, 
            "rating": 3, 
            "review": "The food is really good but the wait time is way too long for lunch. We ordered ahead and came in at the appropriate time they said it would be done. We waited for over an hour to get our food to go.  The place was full but I will not be coming back here for lunch."
        }, 
        {
            "index": 320, 
            "rating": 4, 
            "review": "Authentic! People rate this place 3 & below don't know nothing about Asian Food! Lol ;D"
        }, 
        {
            "index": 321, 
            "rating": 3, 
            "review": "One of my favorite Thai combinations is tom kha soup paired with pineapple fried rice. From the rich flavors of the rice along with the sourness of the soup, nothing hits close to home than this dish. \n\nWhile tom kha is very flavorful, only a few restaurants actually use the type of mushroom I enjoy. Button mushrooms never go along with tom kha as it doesn't absorb the flavors very well. But Archi's has got this food down to the science as it highlights salty and sour perfectly. I prefer no spice to this soup as I don't handle it well. Still, other people who enjoy spice wouldn't get a kick from it. \n\nThe other day, I visited this restaurant for a team meeting with a client. I ordered spicy level 5 while others in my party opted for something of the like. To our surprise, spice was lacking from such a dish. Nonetheless, it was delicious but I think there should be a system incorporated to adding the spice. I'm not disappointed on this behalf but I think other guests would appreciate the effort. \n\nAmongst my favorite dishes here is the pineapple fried rice which included a good amount of vegetables, your choice of meat and spices! Along with tom kha, it's the best combination to eat for winter. It's definitely my go-to! \n\nPad Thai here is a hit and miss. I was cheering for it to be delicious but sometimes the noodles are dry. The other times I've ordered them was flavorful but it wasn't anything out of the ordinary! After countless of visits, I'm not particularly fond of this dish. Definitely a skip for me! \n\nPad see ew is delicious but it's the same situation as pad Thai. Sometimes it's dry and other times it's perfectly made. Different chefs, maybe? \n\nThe service is also a hit and miss. Most of the time, you're really waited on but other times you're neglected. For a restaurant that is pretty well established, I'm not sure service or food should be inconsistent. How they get away with such a thing is beyond my words. \n\nStill, I respect this restaurant as its deserving of a solid 3 stars for me. I've had my fair share of disappointing Thai restaurants in Las Vegas but Archi's, never comes close to dissatisfaction."
        }, 
        {
            "index": 322, 
            "rating": 5, 
            "review": "Great place to eat great food at a great price. This is one of my favorite places to eat in Vegas."
        }, 
        {
            "index": 323, 
            "rating": 5, 
            "review": "Hill'z yeah!\n\nVERY excellent Thai for great prices. I spent a month in Bangkok and ate at some fantastic hole in the wall places there and Archi's comes close. It's not as good as the amazing Lotus of Siam but it comes close enough.\n\nCheap prices, great service, excellent food!\n\nHey, I want Archi's to do well, but I'm pretty happy with the lack of wait at the Rainbow location. On second thought, plenty of room, so you should all come!\n\nTom Yum Goong, Chicken Pad Kapow (ORDER THIS!!!), Pad See Ew (OMG GET IT!)...\n\nGo with a big group... order it all! It's great and great quality."
        }, 
        {
            "index": 324, 
            "rating": 5, 
            "review": "Best Thai ever-all three locations. Moved out of state almost a year ago and go back to Vegas for it."
        }, 
        {
            "index": 325, 
            "rating": 5, 
            "review": "Very good food and service!  I was ordering the pad thai, until I tasted the yellow curry. OMG!  I wasn't even into curry, but yum yum yum! You really need to try this dish! I can see why they have multiple stores!"
        }, 
        {
            "index": 326, 
            "rating": 1, 
            "review": "Get a waitress that understands English. We order pineapple fried rice for my wife cos she can't take spicy food. And I ordered beef panang for myself. When she asked how hot, I said medium. Soon, the pineapple fried rice came, and my wife was shocked at cos it's too spicy for her. We thought Pineapple fried rice is spicy. We waited for my Panang and after 20 minutes, no panang . When we asked, the waitress said, you folks only ordered pineapple fried rice, medium hot. WTF! No wonder we were spiced with chili in the pineapple fried rice and my wife wasn't happy at all. I m writing this from the restaurant. It's alright ..... Mai pen rai attitude...gave us the bill.. And send us packing. This place sucks even before they can serve the food. If they can't take the correct orders, I wonder how can they serve..... I give it thumbs down. Wont be back...for sure."
        }, 
        {
            "index": 327, 
            "rating": 2, 
            "review": "Honestly, I do not understand why this place is getting such rave reviews. If you have eaten good Thai food before then you will understand that this place is not that great. My friend and I found all of our dishes (2 starters, 2 mains) to be over-cooked, tough, greasy but cheap. If you are visiting Vegas and staying somewhere on the strip, this is really not worth the taxi journey off it. Invest the cash for somewhere that might be a bit more pricey but worth it."
        }, 
        {
            "index": 328, 
            "rating": 3, 
            "review": "I have had food from one of their other location and figured this one would be just the same. Sike\n\n1. They have a pretty cool to-go/pick up window\n2. The workers seem younger and less patient then their older counterparts at the fancier locations\n3. They dont take directions\n4. Rude\n\nWhen I place an order over the phone im usually looking directly at the menu. Now the menu they have online looks like some fuzzy picture of a picture. I ordered 2 orders of pad thai, one chicken one house(with all meats). NO NUTS. Which I reiterated twice no nuts. Ok 25 min, k great.\n\nAs I arrive to pick up my order Im met with a heafty $27. Yikes. The menu says 6.95 ea. Im quickly told that was the lunch price and the dinner price was 9.95 and 12.95 for the house pad thai. Wowzers i said, I didnt see any dinner prices on the menu. Well dinner started at 3pm. Hm interesting. As i pay him he hands me the food, shuts the window then walks away.. Um wtf how did you know i didn't want my change back?  Rude.\n\nOnce i made it home i opened the containers hoping the tasty food would calm my nerves and what do i see.. Nuts.. Nuts.. Why me. I'm not allergic or anything but i did state twice I didn't want any on either order. After that initial let down my boyfriend and I check the menu again.. Im right, no dinner prices and it looks like a picture of a picture.\n\nThe food was okay but for the hassle I'm sure I can find a place with a friendlier staff and less grease.\n\nAlso know for lunch specials you will get cheated out of soup if you do take out. You will still have to pay the same price, but no soup. I even tried to negotiate an extra wonton or egg roll since there was no price difference but no deal.\n\nAs if 11/28/15 looks like the menu is up to date visually and the prices more accurate."
        }, 
        {
            "index": 329, 
            "rating": 3, 
            "review": "My husband and I finally decided to get take-out from this place after hearing great reviews.  Plus the actual drive-thru is very convenient.\n\nI had the yellow curry, my usual Thai order. My husband had red curry (whatever it's called at Archie's). We were kinda disappointed! My yellow curry was very bland. It didn't taste like anything. I tasted the actual flavor of the chicken, which without seasoning, doesn't taste that great, let me tell you. I added salt to it at home, which did not help. My husband didn't like his curry either.\n\nWe really wanted to like Archie's, since it's cheaper than our usual go-to take out place (Jasmine Thai on Buffalo Rd). But we decided we'd rather pay a little more for better curry at Jasmine Thai. Maybe we just ordered on an off night, but it wasn't great."
        }, 
        {
            "index": 330, 
            "rating": 5, 
            "review": "Amazing! I think the soup cured my horrifying hangover... Seriously it was so yummy that I wanted to barf repeatedly just to eat more. Also, the delivery guy knew English!"
        }, 
        {
            "index": 331, 
            "rating": 5, 
            "review": "Always come here for thai, I trust their food's freshness and flavor. Service is good and I never have a problem ordering food on the phone  I always get their beef green curry, shrimp Tom yum or their shrimp fried rice. Next time I come in I'm going to try something different  till next time...."
        }, 
        {
            "index": 332, 
            "rating": 5, 
            "review": "Wow!  This place deserves the best rating you can give it!  The food was delicious, plentiful, and authentic!  And as detailed by so many other diners, it is SPICY!  We ordered everything at a hot level of \"5\" and could have probably ordered a \"3\" or \"4.\"  We asked if anyone ordered it hotter, and our waitress told us that some order it at a \"25\" or \"30.\"  I'm not sure I believe that, because it has to be impossible to survive even a \"10\" at this place.  Anyway, the service was great, the place was clean, the food was awesome, and I'll go back if I find myself in Las Vegas again."
        }
    ]
}