{
    "category": "Las-Vegas", 
    "entity": "Kung-Fu-Thai-&-Chinese-Restaurant", 
    "avg_rating_stars": 3.511568123393316, 
    "review_count": 389, 
    "reviews": [
        {
            "index": 1, 
            "rating": 2, 
            "review": "I've eaten here twice, and the first time I thought that I really liked it, but that must have been because I was still intoxicated...It is Vegas after all! On my second time back here, I had the duck noodle soup and tom yum soup again, and DAMN were they OILY. I felt like I was just drinking luke warm oil. The pad thai and the curry I had we're just okay. I don't think I'll be coming back here, I didn't feel so good after eating here... Look elsewhere and don't let other drunken people convince you it's good."
        }, 
        {
            "index": 2, 
            "rating": 1, 
            "review": "worst customer service experience ever. \nwanted green curry chicken $10.25 but it only came with 3 types of veggies, two which i wanted to replace with two other types. with his strange logic, waiter said $2 extra to replace the veggies??? i was already like uhhhhh\n\nso i took another minute to overlook the menu and saw veggie green curry for $8.50. i asked how much to add chicken to that, he said $1-$2. so i did that instead. \n\nmenus need to be updated! my friend ordered panang and menu said it had 4 types of veggies so she got it. dish came out and it only had zuchinni! really? she told the waiter to take it back. \n\nwill not be coming back! krung siam across the street is way better!"
        }, 
        {
            "index": 3, 
            "rating": 4, 
            "review": "I love coming here! Been here many times. This is where I come for my Thai/Chinese fix!\n\nThe restaurant is on the corner of Spring Mountain and Valley View Blvd. You'll find parking in the strip plaza. It does get busy though!\n\nIt's very nicely decorated inside. There is plenty of seating, the booths are pretty big but if you need something for a larger party then there are plenty of tables to go around.\n\nRestrooms are typically ok.\n\nThere is a full bar but I have never really seen too many people sit there.\n\nFREE Wi-Fi.\n\nCustomer service is usually fast and efficient. The waiters are very friendly and knowledgable when you ask a question about the menu or a dish.\n\nThe food is to die for! Always fresh and hot when it comes out. My favorite dish is the Mongolian Beef/ Chicken. It's topped with some fried noodles that totally make the dish! My husband likes many of the dishes so he does not have one is particular. We usually get an order of potstickers but they are deep fried and are too crunchy for my tastes.\n\nGive this place a try! You will get hooked!"
        }, 
        {
            "index": 4, 
            "rating": 5, 
            "review": "I love this place. The food is amazing. I think this is my third review in two years and I only put one up if a place really impresses or is horrible. I live literally all the way across town nd would drive the 30 to 40 min to eat at this place anyday"
        }, 
        {
            "index": 5, 
            "rating": 1, 
            "review": "Service effing SUCKS!!! My husband and I were seated, given water, menus and plates then ignored for 20 MINUTES!!! We walked out and went somewhere else. We were very excited to try this place due to all the good reviews, but I will make sure to never recommend this place to anyone."
        }, 
        {
            "index": 6, 
            "rating": 1, 
            "review": "I wish yelp had option of zero stars...or negative score.This is literally the worst Chinese restaurant we have ever been in. We ordered 2 plates of fried rice, 1 plate of kung pao chicken, 1 plate of spicy cat fish. We then added an order of shrimp. After waiting for close to 45 minutes!!!!!, and watching other people getting served who came way after us, and multiple enquiries, we got only the shrimp dish. Again after multiple queries, we got the full order, but only one serving of rice. The catfish was burnt beyond imagination. The shrimp tasted like a reheated plate...very leathery and burnt crispy. An old lady (may be owner or management ) asked us \"how was it\"...we said we are really disappointed.  Her response..\" you still finished your food, didn't you\"...!!!!!!"
        }, 
        {
            "index": 7, 
            "rating": 4, 
            "review": "I would love to give 5 stars, and if it was based off strictly food and price it would be. Very affordable and very good food. Some of my favorite fried rice in Vegas and hard to put down once you start eating. I haven't sat down to eat here yet but ordered take out a few times.\n\nIf they are not busy, take out is fairly easy as someone usually sees you walk in and comes to help you. However on busy nights such as this past Monday, I went in to pick up my food and waited about 10 minutes before someone acknowledged me being there. I then waited close to 10 minutes for them to ring me up in the back along with another guy who was there before me while our food sat there bagged up on the table. Food was still very hot when i got home so no issues there, just think they should have a dedicated \"host/ess\" when you walk in. If you walk in now, it's like whoever is available will come over and seat you or take your order.\n\nSeemed like many of the people sitting at the restaurant were frustrated with wait times for food or service as well. Saw one guy get up and go grab the water jug from the server stand since nobody was coming to his table to refill and one table had to grab a server so that they would take the order for the table.\n\nMinus the obvious service issues on busy nights, I highly recommend this place for the food! We have enjoyed all dishes we have had and I absolutely love the fried rice."
        }, 
        {
            "index": 8, 
            "rating": 4, 
            "review": "The food here is excellent.  Both dine-in and delivery.  We always go with the Mongolian beef, cashew chicken, jumbo shrimp fried rice, and tom ka soup.\n\nI've had a couple issues with online orders getting lost (so make sure to call and confirm after placing an online order).  The small Asian knick knacks in the interior of the restaurant could use a good dusting/cleaning.  Once you notice, it gets really distracting."
        }, 
        {
            "index": 9, 
            "rating": 2, 
            "review": "Note: This is a review on my take-out only experiences with this restaurant. (4 in total)\n\nKung Fu Plaza brands itself as a Chinese-Thai eatery, but my experience has been that its Chinese dishes do not taste authentic at all. \n\nThe chicken noodle soup is extremely oily, to the point of being inedible. I had ordered this for a sick friend, and was quite unhappy about its quality. The wonton soup is much better, but nothing above the ordinary. The hot and sour soup is nowhere near the regular Szechuan version that you would expect - this one is orangey-yellow. The chow mein is passable, but your best bet is probably the thai curries, which are quite tasty, and as a plus, taste good as leftovers.\n\nWhat I do like about them is their cheerful and quick service."
        }, 
        {
            "index": 10, 
            "rating": 1, 
            "review": "Wor won ton soup + Chicken and mixed vegetables. ==23.60?\n\nI ordered around 8pm, and i recieved my food at 9:30.\n\ni received two small containers that did not have enough food for two people.\n\nWor won ton soup = flavorless, and two won tons.\nChicken with mixed veggies = a whole lot of veggies, no chicken?!!!\n\nSo to sum it all up, slow service, flavorless food, and no chicken!!!!"
        }, 
        {
            "index": 11, 
            "rating": 5, 
            "review": "The Food is really good...lots and lots of choices on the menu.\nParking sucks though.  Wait staff....they work hard and hussle. Just be patient with them. Been here a few times but this last time during Christmas....it was a mad house everywhere.  So, Kung Fu was packed but they took care of everyone the best they could. \n\nGreat job...great food."
        }, 
        {
            "index": 12, 
            "rating": 2, 
            "review": "we tried their chicken pad thai to-go for 8.60.\n\n- fast service. we order right when we got there and it took about 10m for us to get the food.\n- good to-go portion. nice to-go plates and utensils. \n- taste like \"fast-food\" pad-thai. i'm not thai, but the noodles are wrong. ruins the essence of pad thai. thin, short, viet style noodle in pho? horrible."
        }, 
        {
            "index": 13, 
            "rating": 5, 
            "review": "I'm very picky with Thai food and this is the only place I've found that makes good Tom Kha soup. I usually will stop in and have it for lunch if I'm in the are, which is sadly not often. I haven't had the chance to try other dishes since I'm so in love with the one, but the staff is more than enough to keep me coming back. Very friendly and quick. I wish they could expand their space since it's almost always packed."
        }, 
        {
            "index": 14, 
            "rating": 4, 
            "review": "Best spicy catfish in town, pud prig king is a bomb and the best part is ice water is soo good,  (waiter said 4 filters filtration)"
        }, 
        {
            "index": 15, 
            "rating": 4, 
            "review": "I work at the SLS Hotel & Casino and my co-worker and I ordered food from here for delivery. Between the two of us, we ordered the chicken fried rice, chicken pad siew-ew, and the pad woon sen. I would have added pictures to this review, but I was so hungry when the food got here I completely forgot to take pictures, ha!\n\nThe process to order online was seamless and, for an Asian food restuarant, in my opinion, ahead of the game in comparison to other restaurants (http://www.kungfuplaza.com/). Their website is very clean and well laid out. It lists out all of their food items, descriptions of the foods, as well as pictures. When you go to check-out you fill in all of your information and it offers places to add comments should there be any special requests, option to add tip, as well as an option to pick when you want your food delivered (in case you were ordering for later and would not have time to put an order in or for future deliveries).\n\nI was sent an emailed receipt detailing all of the tidbits I added on to my order including my instructions on where to drop off and which number to call upon arrival and a breakdown of the receipt. I don't usually get impressed by a site or receipt so it says a lot when I say I was very impressed by this.\n\nUpon arrival, the driver called to let me know he was five minutes away and where he would be. The food was fresh and was still piping hot when I took it back to the office. It was very flavorful and they gave us so much for the price!\n\nThanks, Kung Fu! We will be ordering again."
        }, 
        {
            "index": 16, 
            "rating": 3, 
            "review": "You gotta love the Asian place that has a duel menu, Thai and Chinese. We're here today for Chinese.  The place isn't very busy, almost a bit concerning, perhaps a warning?  We came in anyway.\n\nAfter looking over the menu, we picked out a soup, a noodle dish and a few more Chinese dishes.  The food took some time, which was kinda weird since they weren't very busy!  When the food started coming out, it was one at a time, we generally enjoy family style, with a little bit of each on our plates, but the food was so slow, we had time to eat one at a time. \n\nThe food as good, very good flavor and we weren't disappointed, but the service wasn't what we're used too!"
        }, 
        {
            "index": 17, 
            "rating": 4, 
            "review": "3rd time to Kung Fu Thai & Chinese Restaurant it's in Vegas Chinatown on the side of Spring Mtn Road.\n\nWe went after hiking one day so we got an early dinner and was starving.\n\nGot:\nTom Ka Chicken soup - huge and pretty tasty\nOn Choy - salty, but we need veggies\nPork fried rice - B. picked it, tasted ok.\nGreen Curry pork dish - tasted ok, I think maybe came with side of steamed white rice.  Wish we'd known wouldn't have gotten fried rice.\n\nTasty and pretty cheap."
        }, 
        {
            "index": 18, 
            "rating": 4, 
            "review": "Met a co-worker here for dinner one night to grab some grub. My first time coming here to this place even though its been here for years (20+?). I don't know why they have like over 500+ items on the menu but if it works for them. We stuck with some basic Thai items and avoided the Chinese side of the menu. For starters we got a chicken larrb salad, then Beef pad sieew (Beef Chow Fun) and chili mint beef. Everything was very flavorful and delicious. I also happen to see a guy I went to high school with who is now a drummer in a famous band, but that's another story.\nAnother tasty place for Thai food."
        }, 
        {
            "index": 19, 
            "rating": 5, 
            "review": "I am a regular here their seafood soup is great. they are open 24 seven that's the best I strongly recommend the food and customer service."
        }, 
        {
            "index": 20, 
            "rating": 2, 
            "review": "Don't ever try their wonton noodles , it tasted exactly like the instant wonton noodles except that it was worse."
        }, 
        {
            "index": 21, 
            "rating": 1, 
            "review": "Never got the food.   Ordered it, waited, and then got a phone call, the driver went to Westin and not the Westgate hotel.  According to the driver,  Westgate doesn't allow deliveries.  I explained I was in for the night and did not want to go down to lobby. 10 minutes later an Asian woman called upset an accused me of saying goes Westin and I needed to go downstairs and get my food.  I repeated my explanation...I'm in for the night.  She hung up on me.  This hotel is open, no one checking for a room key like at the Venetian.   I think they just did not want to deliver up to the room..."
        }, 
        {
            "index": 22, 
            "rating": 1, 
            "review": "This was the worst Thai food I've ever eaten.  Not to mention the worst service.  The only reason I tried this place was because the Thai restaurant across the street was close that day.  Wish I would have mcdonalds instead of this crap.  Priced way to high too.  Just a really bad choice if you eat here.."
        }, 
        {
            "index": 23, 
            "rating": 5, 
            "review": "Love love love this place!! I have been coming here for over 20 years. Always satisfied, great authentic Thai food, great customer service. Just the decor is dark and dated."
        }, 
        {
            "index": 24, 
            "rating": 5, 
            "review": "This is a Thai and Chinese Restaurant, but I never order Chinese food here because I'm Chinese and well, I just don't want to be disappointed.  Their Thai food is excellent though!  I always order the same three dishes:  the fried chicken wings, the pork salad, and the mint chicken.  So if you want really really good food, order these three items!\n\nThe fried chicken wings have almost never failed me, except maybe once or twice in 5 years.  I love how crunchy it is on the outside and how moist it is in the inside.  They don't seem to put much spices or salt on it, and it's just delicious the way it is.  The pork salad is also really good, and it's kind of sour, sweet, and savory.  The mint chicken is also to die for.  There's just something about it that is better than any other versions of mint/basil chicken I have ever had at Thai restaurants.  Give me some of that with the jasmine rice and I'm good to go.\n\nTheir service is not always the best, but servers are always polite and fast.  I've never had a problem with a long wait.  Of all Thai places I've tried, this is still my favorite!  Maybe because I LOVE me some good crunchy and crispy chicken wings and this is as good as it gets!"
        }, 
        {
            "index": 25, 
            "rating": 3, 
            "review": "Ok so me n boss lady needs some dinner! We're sharing the crab Rangoon & i also ordered for myself some seafood egg foo young & a piña colada. The place is quaintly small but quite pleasant. The staff was okay but not as personable as I expected but maybe because it was the dinner rush. But all in all it was just ok"
        }, 
        {
            "index": 26, 
            "rating": 5, 
            "review": "This is the best tasting thai food in town hands down!!!! I always order the chopped chicken chili and mints so goood with a jumbo thai ice tea. Place is usually busy and at times the service is slow but well worth it to grub in some bomb thai food."
        }, 
        {
            "index": 27, 
            "rating": 5, 
            "review": "Kung Fu is my go-to Thai place in Vegas whenever I feel a craving for some Thai food. I feel like whenever I take a bite of their food, this is what Thai food should taste like. Their Chinese food is pretty good too, although it may not be as authentic as a normal Chinese place, they serve some good Chinese food here as well.\n\nI've been coming to this place with my family for a number of years now. I always love coming to this place for the food and I enjoy chatting with some of the waiters. It's friendly for family, and large parties if necessary. \n\nMy favorite things to eat from here are the pad thai, pad se ew, and general Tso's chicken. Kung Fu gets pad thai correctly and cooks their pad se ew well and both have flavor. Their general Tso's chicken is sweet and has a slightly spicy flavor to it and this is best eaten at the restaurant so it is still crispy when you eat it! I have ordered their curry, vegetable dishes, tom kha soup, and I enjoy them all!\n\nDon't be scared to try this place, it will not disappoint. A lot of people enjoy coming here and you will soon find out why."
        }, 
        {
            "index": 28, 
            "rating": 2, 
            "review": "Atmosphere is ok, Tom yum gong is ok, everything else is so so. Food came really fast which is great, but it's a pity that the food was too salty. Most likely won't return."
        }, 
        {
            "index": 29, 
            "rating": 4, 
            "review": "Love all the different spots in China Town!  Cesar Q and I have been craving some authentic Thai food and decided to stop by.\n\nFirst off they have an awesome lunch menu with multiple options for under $7 and it includes soup of the day and some killer little appetizers.  \n\nOf course we can't be as simple as their lunch menu we opt for the bigger is better option and order directly off the menu.  I ordered the chicken pad Thai and my man had the combination pad Thai.  We split a bbq pork fried rice.  Needless to say we had a ton of left overs as we could have split one meal and been full.  Everything we ordered was great!  Loved the delicate sauce on the pad Thai.  \n\nCan't beat the location as it's just off spring mountain and valley view.  Just west of I-15 on the Spring Mountain exit.\n\nThe service was great.  The guys who assisted us were happy and friendly.  Great Thai find in Vegas!"
        }, 
        {
            "index": 30, 
            "rating": 5, 
            "review": "being that i am thai and have had thai food from many places in america and in thailand let me be the first one to say that this place could have possibly the best THAI FOOD in america that i have had...when i say best i mean authentic not that natalee thai crap or any of that stuff that is watered down and served to people who dont know anything about thai food...this place has a thai and chinese menu.....stick with the thai food here....\n\nevery time i set foot in las vegas eating here is a must...the food is made here the way it is supposed to be made...SIMPLY AMAZING!"
        }, 
        {
            "index": 31, 
            "rating": 2, 
            "review": "Came here for lunch because of all the great reviews.... Had the lunch special sweet and sour chicken.  This is something that's pretty easy and I figured it would be a safe bet my first time here. The sweet and sour sauce is orange not pink or red and tasted terrible. It was like honey. The breading on the chicken was super thick and hard crunchy.  The only thing that was good was the spring roll but even then it was mired by the gross sauce... So was ok no  veggies at all in it but it was OK.  I wanted to ask them to bring something else but had a feeling it would have been like pulling teeth so i sucked it up and worked on my plate as i was really hungry... Not a great first experience."
        }, 
        {
            "index": 32, 
            "rating": 5, 
            "review": "This place is amazing! The food is great snd reasonably priced and the portions are hefty. They have great thai tea here which is a must have. The Basil fried rice is fantastic if you are a fan of that dish. The beef dishes are also tasty. A must visit if your in the vegas area. The service is also great!"
        }, 
        {
            "index": 33, 
            "rating": 5, 
            "review": "The garlic chicken is awesome. And the pad Thai is about the best ever.  We checked out the reviews and was do happy we did."
        }, 
        {
            "index": 34, 
            "rating": 4, 
            "review": "Had a Tom type of soup with coconut milk that was really fantastic. \n\nTried #31 which was very good glass noodle dish with a dressing and meat shrimp and scallops. The chinese dish we tried was more bland but very good. The help was nice and service was pretty quick for our late lunch. I'd go back and recommend to a friend."
        }, 
        {
            "index": 35, 
            "rating": 3, 
            "review": "I'm Thai & I have no idea what Kung Fu has to do with Thai. Kung Fu is clearly Chinese so as for the name of the restaurant it should be Thai & Kung Fu Chinese Restaurant. \n\nThai Food: 3/5 It was okay not much to rage about. I ordered a yellow chicken curry. Usually curry comes in a semi-thick sauce but they was plan soupy. The rice we ordered for our curry ended up being over cooked and dry. Even though the curry sauce wasn't as thick as I'm used to it was still delicious. Not as spicy as I wanted it but It was an \"Americanized 10\" not Thai 10 on the scale of spicy. \n\nChinese Food: 2/5  I'm not much of a Chinese food eater because I've noticed a lot of Chinese dishes are super oil and greasy. BUT We ordered some kind of stir fried Mongolian Beef dish. It was definitely a Chinese dish because the sauce was oily you could see the oil bubbles. \n\nService: 3/5 The service was good even during busy hours. The place was a bit of mess though. There was rice and pea's ever where, but I just brushed it off because there were children running around. This place seems family ordinate but it was also loud."
        }, 
        {
            "index": 36, 
            "rating": 3, 
            "review": "After hearing lots of chatter, I finally made it to Kung Fu to give it a try.  I discovered a large menu and quite the assortment of Chinese and Thai dishes.\n\nLocated at Valley View and Spring Mountain, you're close to one end of Chinatown.  For those who haven't ventured down Spring Mountain Road to see and sample the amazing assortment of Asian shops and restaurants, this may be a good place to start?  Three of us went in for lunch.  The restaurant was dark inside, almost under-lit, giving me the impression that they don't want folks looking around too closely.  It wasn't obvious, but it made me wonder if the place was dirty or not in good repair.  I couldn't tell.  Even thought there were only a few other customers at tables, it took a minute for someone from the staff to realize we had walked in the door.  Even so, the greeting was friendly and once noticed, we were quickly seated, drinks were put on the table and our orders were quickly placed.\n\nI ordered Beef and Green Beans off the Thai menu.  The food came out hot and tasted fine, and by fine I mean it was okay.  My honest impression was that the menu is large enough that many of what could be unique flavors for specific dishes may be blending together or lost for the cooks.  There were no unique Thai flavors in the dish I ordered and actually had to go back and look to be sure I ordered a Thai dish and not a Chinese dish.  Drinks were refilled regularly, there were no issues paying, and we were on our way after lunch without any unnecessary delay.\n\nWas it great?  No.  Was it bad?  No.  Would I go back?  Sure, if someone I was with wanted to eat there.  If you're in this part of town, I think this is probably a safe place to grab a sit-down meal that's going to be consistently good, but with all the other options very near by, I'm sure you can find restaurants with a more tailored approach to the specific dish or dishes you're after.\n\nOne final note:  the shopping center where Kung Fu is located can be busy.  It's not a problem, but depending on your luck with parking spots, be prepared to park down the storefront quite a ways if you're there at lunchtime."
        }, 
        {
            "index": 37, 
            "rating": 4, 
            "review": "Hungry, fresh from the pool party, CRAAAAAVING?..It time for some Kung Fuuuuuuuuuuu Thai baby!\n\nThe Tom Yum soup...Yes indeed, its the bomb! The Beef soup is...Yes, thats the bomb too...Hold on...The Pad Thai...THE BOMB!\n\nThe food is awesome at this place. The service is even better because not only do they make sure your taken care of, they make surrrre your taken care of. Friendly is one of the best ways to describe these guys. Since it was the four of us, we all tried different dishes, and yes, each on was good, from the garlic chicken to the Pad Thai, to the Beef soup to the Tom Yum soup. \n\nIt was sooo filling, that there was no room for dessert.\n\nOf course, you have to wash it down with some old fashion Thai Tea!"
        }, 
        {
            "index": 38, 
            "rating": 2, 
            "review": "Not sure what those who gave this place more stars ate but their food was way below mediocre. I tried the Pad Thai and Garlic Chicken with rice and didnt like either. Both lacked flavor and tasted like Rubber. Not sure what the environment in there is like as i ordered in. Definitely not ordering/going there again."
        }, 
        {
            "index": 39, 
            "rating": 1, 
            "review": "My husband and I were really were looking forward to a good meal in Chinatown.  We came upon Kung Fu Thai & Chinese and checked it's rating in Yelp.  We entered the establishment, 2 of us, and there was a party of 3 behind us.  The waiter said to us, \"Take that table there.\"  He pointed to a table by the wall, and I asked if that was the table he meant.  Yes!  He proceeded to seat the party of 3 while we seated ourselves, and he then brought us menus and took our drink order.\n\nThe menu is quite extensive, but we decided on appetizers of crab rangoon, bbq pork egg foo young, and Thai beef w/vegetables.  The table had been previously set with lunch size plates.  The waiter brought the appetizer, set it down and left.  We mixed the sweet & sour sauce with the mustard sauce on our plates and ate the crab rangoon.  It was just ok, but my husband removed half of the filling because it really was way too much in the won ton.  This extra filling he put on his plate.  We now have lunch plates with sauce and filling sitting in front of us.\n\nThe waiter returned with our food and just sat it on the table and left.  Not a word, no eye contact.  We looked at each other and said, OK, and proceeded to place our food and rice on the dirty plates.  Every wait staff in the place refused to give us any type of eye contact or acknowledge us.  My husband finally said, \"Do you get the feeling we are not wanted here?\"  \"OMG, Yes!\" I said.  It was so uncomfortable in there.  No one ever came over to see if we needed anything or to refill our tea.\n\nTo say the least, this was the worst Chinese and Thai food we have EVER had!  The egg foo young was so bland and almost had a water taste to it.  The brown gravy on was in was tasteless.  I actually added table salt to my beef and veggies in order to try and liven it up a bit.  We wanted some soy sauce, but do you think any person would even look at us?  NO!\n\nBUT, when it came time for us to leave all of a sudden we had all the smiles and help we needed.  Someone actually refilled our tea!  And, everybody was trying to wish a good evening, etc.  Guess the thought of a tip was overpowering to them.  Surprise!  The tip was $3, which was way too much!\n\nMy thoughts?  Stay away from this place as I am sure there are some fabulous places in Las Vegas for Thai and Chinese food!"
        }, 
        {
            "index": 40, 
            "rating": 1, 
            "review": "ok...this is my second time trying this place because i had to give it the benefit of the doubt....I only proved my point the second time around....the food is overcooked and extremely dry.Both times I had the mongolian beef lunch special....now i'm no master chef but believe me i had to drink about a gallon and a half of water just to swallow this food....very very dry meat that obviously was overcooked.even my co workers said the same about their dishes...definitely will not eat from there again....i know we live in the desert here but at least make the food moist."
        }, 
        {
            "index": 41, 
            "rating": 3, 
            "review": "I love asian food especially Thai. I work so much, never have time to eat out, quick delivery is important to me. Great food, friendly service and they understand english when I call to order food. Well as along as you take your time when you talk.\n\nI also like the fact that they have a good vegetarian menu. \n\nLOVE IT LOVE IT LOVE IT LOVE IT!"
        }, 
        {
            "index": 42, 
            "rating": 4, 
            "review": "Been here many times, and its always a good meal. Place does get busy, its usually 3/4 full at least everytime I've gone here. My Thai friend loves the food here so it gets high marks for the Thai food.\n\nI usually get Pad See Ew and crab rangoon.....I'm such a lame thai food person. I've also had cashew chicken. They do it really well here though. Service has always been spot on, never had any issues. Just a good solid place to eat, and prices are moderate. \n\nThe only issue would be how busy it is, and with the center tables it can get loud, so its not a place for a romantic quiet meal."
        }, 
        {
            "index": 43, 
            "rating": 3, 
            "review": "Met some friends for dinner. By the time I had got there, they had already ordered dinner. It was no more than maybe five minutes and the first dish was already coming out. We started with the Seafood Tom Yum Soup. The light tangy soup was not a hit with everyone. The broth was filled with mussels, shrimp, squid, fish filet, and mushrooms. From that point on, the food came out in rapid secession. The Combination Pad Thai was lacking flavor compared to the Pork Pad See Ew. Now that we have eaten every animal on land and sea we got an order of Sauteed Chinese Broccoli. \n\nThe service is quick and attentive, Our water glasses were always full and dirty dishes were taken away quickly. The food is a safe bet. Another reason why we are always back here."
        }, 
        {
            "index": 44, 
            "rating": 4, 
            "review": "It's surprisingly difficult to find places that deliver in Vegas. Everyone in the office is completely sick of Jason's Deli 3 days in a row, so we tried something different and so glad we did. I've only had the Thai food from Kung Fu, but it's one of the few places in Chinatown that delivers, and figured we'd give their food a try.\n\nWe did the order by phone since it was catering, but I was really surprised that their website allows you to do the order online for delivery or pick up. Helps a lot with the language barrier - I don't speak Chinese or Thai, but my coworker made me order (in English!) because she had trouble understanding them. \n\nWe were able to feed 12-14 people for about $160 which is really good. Delivery was on time and there was no minimum or delivery fee. I wasn't blown away by the Chinese food, but it was above average with generous servings at a really reasonable price. I think each half pan was around $40. \n\nIt's not my personal go-to for Chinese or Thai, but the fact that they're cheap, so close to the strip and have delivery makes this place 5-star if you're visiting. Beats paying $25 for sweet & sour chicken from a casino restaurant."
        }, 
        {
            "index": 45, 
            "rating": 4, 
            "review": "We live in California, so we don't get to eat at this restaurant often. When ever we in Las Vegas, we make sure we stop by at least once before we come home.  We loved the Boat Noodle, Beef salad they the best"
        }, 
        {
            "index": 46, 
            "rating": 1, 
            "review": "The food itself is good (or at least what I ate, the pad see eaw), but I've got to say that the service here is one of the most terrible out of everywhere I've ever been...and that's saying something! The food would get a four star, service would get one star..and I'm ALL about service. Anyway the attitude of the waitstaff is \"I don't care\"..they're the type that are only attentive if they feel like it, and if they're not they don't care about apologizing. Kinda like when you're in the checkout line at a store and you tell the cashier you've been waiting for a long time and she ignores your statement completely, rings you up, and sends you on your way. Thats the attitude here. Maybe its because they know they're in a good location, so business will come regardless of a few unhappy people. If you tell them they have horrible service they'll literally respond \"I don't care, we don't want you back anyway\"...then when YOU start to have an attitude one of them will follow you out the restaurant and scream \"Don't come back okay!!\"......thats right, I definitely won't!"
        }, 
        {
            "index": 47, 
            "rating": 3, 
            "review": "Staying at the LV Hilton Grand, there isn't much here...albeit a Deli with \"Deli Prices\".  You get the idea....\n\nAfter having Italian delivered for the past 2 nights, I was ready for a change.  Kung Fu offers Chinese and Thai.  Their menu is very  substantial.  Their service is quick and efficient (including delivery / driver and phone).  I ordered Penang Beef and Spring Rolls.  Penang Beef comes with Jasmine steamed rice, lovely.  \n\nI was really surprised to see so much Zucchini in my Penang Beef though.  My first serving, I had 2 small strips of beef, and the rest Zucchini.  Second serving yielded more beef, but not much.  I think the dish SHOULD have been called, \"Zucchini Penang with Beef\".  I very much enjoyed the dish, and the Spring Rolls though.\n\nI do love Thai and have enjoyed many Penang dishes in the Bay Area.  The spices were perfect (although I was questioned when I said I wanted a \"7\" on a scale of 1-10 for spice).  It is spicy, but not too spicy.  \n\nKudos to Kung Fu for their service.  I would rather have excellent customer service than amazing, knock-me-down food with crappy service.  Their food was good...and service excellent.  In this city, that's great!"
        }, 
        {
            "index": 48, 
            "rating": 5, 
            "review": "We found our favorite Thai restaurant in Las Vegas! Just the right amount of spice (heat) at #5."
        }, 
        {
            "index": 49, 
            "rating": 4, 
            "review": "Totally reminded me of east coast style chinese food.  Very glad to find this.\n   Service was ok, not the best."
        }, 
        {
            "index": 50, 
            "rating": 1, 
            "review": "One day, my wife and I were out, and she told me we should go to this place. She said she had been there seven years ago, and it was very good. \n\nI told her that \" a lot can change in seven years\", and I was right. \n\nWe both agreed that this was one of the worst Chinese meals we ever had.\n\nThe staff did try to please, but they just could not over come the bad food that came out of the kitchen. We ordered a curry dish, kung pao chicken, and a shrimp dish.\n\nMy wife took one look at the curry dish and said, \"When I saw it, I knew we were in trouble.\"  She was right. Poor quality ingredients, and no taste to it.\n\nThe Kung Pao Chicken, a standard which I use to compare Chinese places, was awful. My dogs turned down the left over chicken; The peanuts were few, and tasted like they were purchased from a ball park, six months after the season ended, and the dish tasted liked it was cooked in Motor oil.\n\nRemember those terrible shrimp that are in those 99 cent cocktails in Downtown Casinos? Ever wonder where the ones they reject go? This is the place!!\n\nTop off the food with booths where the fabric is torn apart and needs replacement, and you risk sitting with a spring up your butt, and you have a perfect picture of \nKung Fu Thai and Chinese. \n\nGo across the Street to Krung Thai. Better food, nicer place, better prices, and much easier to park.\n\nTrust me, I wanted to give this a Zero, but I am required to give one star. Generous."
        }, 
        {
            "index": 51, 
            "rating": 5, 
            "review": "BEWARE BEWARE BEWARE......Ok so this place is my favorite place to go for good Chinese food fix. Whenever I'm craving tum yum chicken soup spicy number 5 and chili mint chicken spicy number 10 with a side of half order of egg rolls. Absolutely delicious atleast until the day I picked up my food as a to go order. I live near red rock and I had to drive all the way across town for my Chinese food so you know it must be good. Anyway I picked up my order got back home, I went to taste my tum yum soup and it had a roach floating at the top of my soup. I could have died. I drive back across town and returned it to the restaurant, they told me that the cook must've thought it was garlic and accidentally put it in my soup.... Wow I wonder if this happens often??????  CHECK YOUR FOOD!!!!"
        }, 
        {
            "index": 52, 
            "rating": 4, 
            "review": "Always quick to serve good, tasting affordable lunches !"
        }, 
        {
            "index": 53, 
            "rating": 4, 
            "review": "Today we tried the tom kha gai (chicken), the panang with beef, and the Rad Na with pork.  I have to say that the consistently good Thai dishes are enough for me to say that this is now my second favorite Thai restaurant!  Oh, and the Thai iced tea here is really, really good.  Perhaps the best I have had!  Very original taste, and just the right level of sweetness.\n\nThe tom kha chicken was excellent.  I think it beats even the versions at Komol and Prommares, and gets close to Thai Grill.  Thai Grill's broth is fuller and more sour, but what is great about the tom kha gai at Kung Fu is the super tender chicken chunks.  They must slow cook the chicken somehow, because it simply melts in your mouth.  It was amazing.  If only I could have this chicken in the Thai Grill broth!  \n\nThe panang with beef was good too.  There was a definite peanut flavor in the first bite or two, but that flavor quickly blended away as I kept eating.  I added chili powder to the curry to balance the slight sweetness.  The pairing of the chili powder taste and the curry was simply perfection.  I wouldn't say that the panang is especially unique in style, but for the style that it is, it is nearly as good as the panang at Komol (which is the best dish I have had at Komol).  The beef was also very well prepared and tender.  As you read on you will see that meat is one of the things that Kung Fu does exceptionally well.\n\nOn to the Rad Na! The Rad Na here was one of the few versions that I actually would order alone, and when you can order Rad Na by itself, it must be damn good!  Prommares still makes the best Rad Na in town, but this is a close tie for me with Thai Grill for second.  The noodles were fresh, and the sauce was lightly sweet, and flavorful.  There was lots of bright green, thick Chinese broccoli stems and leaves.  Very fresh and very good.  The pork, again, was incredibly tender.  Very high quality meats here at Kung Fu. \n\nKung Fu's Thai food is very strong, and authentic.  Every time I come here, there are large families/groups of Thai people eating.  People who don't know Thai food might not realize what they are eating, and I believe that the negative reviews here are a reflection of this.  I can tell you though, if you are a Thai food lover like I am, this place makes some fine Thai food.  \n\nOn the other hand, the food here is a bit heavier than the food at Thai Grill (and probably TSNH), and not as original as the recipes at my favorite Thai restaurant.  I think Thai Grill is uniquely healthy compared to Kung Fu (and most other Thai restaurants).  Between these two restaurants though, I can thoroughly satisfy my craving for Thai food.  I can't wait to try more Thai dishes at Kung Fu Thai and Chinese, especially the desserts.  \n\nUpdate: Losing a star for a couple of reasons.  I like the curry here, however it still doesn't have the unique flavor that I am looking for.  It is well done, but a little bit generic in style.  Secondly, the Thai menu is dwarfed by the Chinese menu.  I understand that this is where Kung Fu probably gets most of its business, but this means that Kung Fu can't offer as many Thai dishes as it should.  I find myself not wanting to go back because there is nothing new to try.  \n\nDisclaimer: this review and the prior one are for the Thai food only."
        }, 
        {
            "index": 54, 
            "rating": 4, 
            "review": "Wanted to try a restaurant in Chinatown while we were in Vegas.  This was our favorite - we love Thai food and this place is great.  The dishes are authentic. The Tom Ga Ghi Chicken/coconut soup was the best I have ever had.  The Garlic pork is fantastic.  The Panag Beef was so good we had to order a second plate.  Everything can be shared family style and everyone loved the dishes.  Will definitely come back when we are in Vegas again."
        }, 
        {
            "index": 55, 
            "rating": 4, 
            "review": "Definitly enjoy the pad-thai, very delicious food."
        }, 
        {
            "index": 56, 
            "rating": 4, 
            "review": "yummm... we initially discovered this place randomly because we were sick of filling our tummies with buffet food - and what a wonderful surprise! cute LA-style asian food... spicy food (they have the usual 1-5? 1-10? scale and they don't mess around at the higher numbers!), decent portions (especially for thai restaurants) and extensive menu (can please just about everyone - including vegetarians!). \n\nservice is not that great, especially when they're busy (think 7pm on) and be wary of to go orders. we placed a to go order (albeit for 12 hungry girls), were told to stop by in half an hour, and we waited and waited... seemed like they don't cook it until you get there to pay. \n\nour favorite dish - fried spicy cat fish... this is now part of our usual las vegas to-go spot (and my parents' too)!"
        }, 
        {
            "index": 57, 
            "rating": 5, 
            "review": "By far the best Thai food I have EVER had. \n\nMy girlfriend and I came in one day wanting to try something different. We love Thai food and either dine at Archi's restaurants or order in from Weera Thai, but ever since we came here last month, I prefer this place over anywhere else. \n\nWe ordered the chicken larb, which I can only describe as a Mexican shrimp ceviche except with chicken and a bit more spice. Granted, you can order your food based on a \"hot\" scale and we got the 7. Needless to say I absolutely love ceviche and am now in love with the chicken larb.\n\nIn addition to the larb, we also ordered chicken pad thai noodles. We ordered the noodles without any spice and the dish actually had a hint of sweet to it but in the most amazing, warm way. It was the perfect balance between spicy and sweet. All of this comes with a side of white steamed rice but we also ordered two side orders of sticky rice. I've recently discovered sticky rice when Weera Thai mistakenly placed some in my take-out bag and I haven't gone back to anything else since. Im Hispanic so I eat a lot of my foods with tortillas and that's what sticky rice reminds me of. Roll it in a ball, flatten it and grab! I also like to soak it in the larb juice. So amazing!! Also, the best Thai Tea ever and I am not a huge fan of Thai tea.\n\nThis is literally the first time I have ever had to tell someone to take a plate away from me or I was going to make myself sick from eating so much. \n\nAnd, finally, the most important part: the staff. \n\nThe staff was so nice! So, so nice! I am a firm believer that you can have the most amazing food but if your staff sucks, the entire experience sucks. I will admit that I don't know much about other cultures or what they believe so I am hesitant when going into restaurants like these because we are lesbians and I've had a bad experience before. But the waitress could not have been nicer. She was so sweet! So, so sweet! Admittedly, I loved this place so much that we went back the next night and brought along my mom and younger brother and hoped we had the same waitress.\n\nDo try this place. Seriously. I have no complaints."
        }, 
        {
            "index": 58, 
            "rating": 1, 
            "review": "Called ahead and placed a to-go order. Omg! I'm still sitting her 45 minutes in, they have you pay as soon as you walk in to hold you here. The food is okay but not worth spending all day waiting for something I could've ordered next door. They ignore the large parties who want to pack food up. Never again!"
        }, 
        {
            "index": 59, 
            "rating": 1, 
            "review": "If I could give this place zero stars I would. I rarely ever write reviews for any businesses but this restaurant stole my money and the money of two of my co-workers as well.\n\nWe decided to order three lunch specials online on their website and paid for it no problem via Paypal. We receive a phone call shortly after from a woman who refused to name herself and she stated that \"Oh sorry we don't serve lunch specials on the weekends.\" We ask if she can make an exception and deliver our food because we already paid for it. \n\n\"No, we can't make food for you. We don't serve lunch specials on the weekends.\"  \n\nThen why is it available on your website? Why were we able to pay for it? Granted, we did not see the disclaimer on their website that said \"Lunch Specials are only available M-F 11:00-3:00PM\" --but then why is it available as an option to purchase on the website at all times? \n\nI also ask if there is any way we can just go pick up the food or if they can refund us our money. The woman says \"No we can't make food for you.\" She then says \"You'll get your money back when the manager comes back...but I don't know when he'll be back.\" Um? Excuse me?  I ask her when the manager will be back and she says that she doesn't know. I then ask her if there's anyone else we can speak to. She says no and that she is the only one in the restaurant. \n\nHow is this poor disgrace of customer service the only one at this restaurant? There are no chefs to cook our food? Seriously? Maybe that's why we can't get our food.\n\nWe even offered to pay extra to get the regular entrée portions of the food but she again repeats: \"No food for you.\" She then states \"Don't worry, don't worry! You'll get your refund. I'll let my manager know. Not sure how long refund take.\" How very reassuring. \n\nShortly after speaking with me she hangs up after stating that \"There is nothing I can do for you.\"  \n\nWell, if there's nothing you can do, there's definitely things that I can do. The business is being reported to the Better Business Bureau and a dispute was also opened on Paypal for our refund. All we wanted was some damn food."
        }, 
        {
            "index": 60, 
            "rating": 3, 
            "review": "I call myself an expert in Thai food.  I grew up with rice and fish sauce.  This place is authentic.  We come here for lunch quick dish, not entrée style.  Pad See Ewe was good, Rad na was the delicious.  \n\nThe décor is a bit outdated.  The restaurant is a clutter of tables.  Half of the restaurant is dark and dingy.  \n\nAside from lack pleasant ambience, the food is great."
        }, 
        {
            "index": 61, 
            "rating": 4, 
            "review": "I've seen a lot of reviews here... Complaining about the service... I think most of you need to chill a bit... Could the service be a tad better... Yeah it could... But the food totally makes up for it... English is a slight problem for some of the Workers... But it's a Chinese restaurant... Duh... Please don't listen to these negative reviews... You Only will be missing a great dining experience.... Huge menu even better preparation... My only complaint is I ate too much.... I usually bring food home... But the flavors were unique and wonderful.... Can't wait to go back.... It will be a while since I live in Los Angeles.... This place would do great there..."
        }, 
        {
            "index": 62, 
            "rating": 3, 
            "review": "I'm from Fresno so majority of my reviews are compared to the food in my hometown. I would have to say the food was good but it's not great. The quantity was pretty small for the price. I felt like the place is a bit small? Since my neighbor's back is only about half a foot away from mine. Maybe a little rearranging of tables might help with rooms. Our server was nice but from my experience I don't recall him checking up on us. I think we waved and called him to us. Cups of water were small and we never had a refill. My gf had to drink my grandma's cup of ice water since they never refilled our cups for us. I would honestly give it a 2.5 stars but I can't so I'll round up that half star. Little improvement with service, you'll get there."
        }, 
        {
            "index": 63, 
            "rating": 4, 
            "review": "Awesome $6.00 lunch specials. I was a little disappointed when I found there was no garlic and papper chicken but was quickly amazed at how delicious the chopped chicken was. They give you a lot of food so you won't leave hungry!!"
        }, 
        {
            "index": 64, 
            "rating": 1, 
            "review": "Horrible service. Mismanaged, unapologetic and unprofessional. Do not expect a nice time."
        }, 
        {
            "index": 65, 
            "rating": 4, 
            "review": "I went to Kung Fu because I, and two friends, were in the mood for Thai Food around 10 pm, and that was the first restaurant we saw when we arrived in Chinatown.   We shared chicken satay and fried won ton as appetizers, and shared three entrees:  chicken with spicy garlic, sweet and sour pork and seafood pad thai.  \n\nOur waiter was new to the job and had to be urged to check with someone to give us information about the drinks at the bar (rather than just saying \"I don't know\" and leaving us with that) but he redeemed himself by returning with the owner, who explained the ingredients of the pina colada, and told us that the pina coladas and mai tais are the most popular bar drinks requested.\n\nAs far as cleanliness, the nasty-looking carpeting was a problem. I believe the furnishings were rather worn-looking as well, but the space is brightly lit and relatively spacious.  The decor was nothing to write home about; the place is basically a white box with decorative Thai art and dusty-looking travel posters on the walls.\n\nBut we came for the food, and I must say that everything was delicious.   For all of the above orders, a beer and a Pepsi, the bill came only to about $50, which isn't bad.  We all said we'd come back."
        }, 
        {
            "index": 66, 
            "rating": 3, 
            "review": "Pretty good Thai food here.  I love Tofu but probably not order the tofu satay again, very little flavor.  The other things that we ordered were pretty good.  It felt pretty authentic.  The wait staff was not very friendly but the food arrived hot and fresh and that is good enough for me."
        }, 
        {
            "index": 67, 
            "rating": 2, 
            "review": "Edit:  I don't like this place anymore!  Last experience- the shrimp pad thai was really blah, had no shrimp in it so I had to ask for some, and came with fried rice which I didn't even want (and so less pad thai).  Also service was really slow for lunch.  It's such a huge room too, you just don't get the kind of personal service that you can get somewhere else, like Prommares."
        }, 
        {
            "index": 68, 
            "rating": 5, 
            "review": "Went to Kung Fu yesterday with my mom and it was our first time to eat there was recommended by a friend to try it out, food was awesome and delicious! Been to a few Thai restaurant in Vegas but Kung Fu is hands down is the best tasting Thai food!!! Service is excellent....this is now my fav Thai restaurant. I ordered the Panang Curry Beef, Pork Garlic Pepper Sauce, Egg Fried Rice and of course to push it down with a nice glass of Thai Iced Tea!"
        }, 
        {
            "index": 69, 
            "rating": 4, 
            "review": "Been here a few times while in town.  Usually get the typical Thai dishes when I come here w friends.  The papya salad, lad nah seafood, half an order of duck and chinese broccoli.  Looking forward to trying other things on their menu, but so far...so yummy!"
        }, 
        {
            "index": 70, 
            "rating": 5, 
            "review": "After a crazy night of drinking and partying my girlfriends and I were craving noodle soup.  Luckily, my friend has been here before so we all decided to have lunch.  I was craving tom yum soup and while going through their extensive detailed menu, I noticed they had tom yum NOODLE soup......never had it before so I decided to give it a try.  \n\nWe started off with papaya salad (medium spicy) with salted crabs.  I kept thinking the sliced green veggie was peas and wondered why the hell the salad was so damn spicy, turns out they were chilli peppers and NOT peas. ....oops.  the salad overall was tasty, fresh, and delicious.\n\nMoving on to the best noodle soup I've ever had in my whole entire life: TOM YUM NOODLE SOUP.  Words cannot express just how amazed I was.  It was extremely flavorful with the right amount of spices and the noodles were perfectly cooked.  I'm constantly looking for cheap flights so I can fly out there just for this.  \n\nService - You're average asian restaurant.   Poor guy had to go back and forth with our orders since we kept asking him for extra stuff.   But my experience here was pleasant.  I will definitely be back next time I'm in town."
        }, 
        {
            "index": 71, 
            "rating": 1, 
            "review": "What happened? I loved this place, but Monday I walked in and there was like 3 ppl in the whole place eating so not busy right, well me and my sister get seated and the guy throws the menus down, didn't even say hi and walks away. Well we usually know what we want so we sit there... And sit there and he never came back after 15 mins. Didn't ask if we wanted a drink or anything. So I gave it a few more mins and nothing. After 20 mins of sitting there I was pissed. So we walked out. The server was terrible. I loved Kung Fu but I won't go back. So disappointed, this place has great food but the server was not that good."
        }, 
        {
            "index": 72, 
            "rating": 5, 
            "review": "Pork jerky, papaya salad, chicken larb were all authentic and excellent. The kids got Asian style fries egg and rice and loved it. I came here with 18 of my Lao relatives last minute and they really liked the food here as well.  Big props to the kitchen and staff for taking us in at 6pm on a sat with no reservations. It's definitely on my hit list for the future."
        }, 
        {
            "index": 73, 
            "rating": 5, 
            "review": "Love it\n.awesome. .hre ay good & service"
        }, 
        {
            "index": 74, 
            "rating": 5, 
            "review": "Visiting Vegas and decided to try this spot ...service is great and their food was delicious!!! Came back 2nd night in a row for dinner. Had the War Wonton soup and chicken fried rice. ....Loved it!!!!"
        }, 
        {
            "index": 75, 
            "rating": 5, 
            "review": "This place is a hit or miss, I have to admit, because it's a 50-50 chance of liking a dish if I order blindly off the vegetarian menu. But when I visit Chinatown, I know I'm having lunch here. Why, you ask? For the veggie pad thai, of course! It's the best! The service is good. I dream about you, veggie pad thai... in the night, and during the day. mmm. And for about 6.99 for a plate of pad thai, it doesn't break my bank! The tom yum soup is also to die for. oh, be still, my hungry heart. :)"
        }, 
        {
            "index": 76, 
            "rating": 4, 
            "review": "Good food, waiter not that attentive.\n\nIt's more Thai restaurant than Chinese......"
        }, 
        {
            "index": 77, 
            "rating": 5, 
            "review": "I love this place! My dad and I used to eat here every week when we lived on that side of town. We'd get the Kung Pao Shrimp and pork pot stickers, they are absolutely delicious. The wait staff is very knowledgeable and friendly as well. I also recommend their soups. Whenever I get a bad cold in the winter I always go here and get a big bowl of their soup, it always hits the spot. If you love Chinese food in a friendly environment, come here!"
        }, 
        {
            "index": 78, 
            "rating": 4, 
            "review": "One of my favorite places for Thai food. Prices are reasonable, and the food is great! The restaurant is medium sized, and I haven't had to wait to be seated for a table yet. The servers have always been very helpful and attentive when I've come. \n\nThey have my favorite panang curry (10/10 spicy oh yes!) and pad see ew (beef or tofu). My friends say that they have the best Thai Iced Tea here, too."
        }, 
        {
            "index": 79, 
            "rating": 5, 
            "review": "I love the pad thai it's so yummy and their thai iced tea is too bomb  the best thai food I ever tasted"
        }, 
        {
            "index": 80, 
            "rating": 5, 
            "review": "Great place. Thai/Chinese cuisine. We stopped going to buffets in Vegas. We do Kung Fu everytime we visit. Fried calamari, Chinese broccoli in oyster sauce, pad thai, fried chicken wings are a must. Still haven't gone through the whole menu."
        }, 
        {
            "index": 81, 
            "rating": 1, 
            "review": "We just arrived in Las Vegas and wanted to get some Asian food away from the a strip and found this place. We came in and waited to be seated per posted sign - it was not busy at all - maybe two or three other tables. No one was in the front..we waited...no one came out...we still waited...saw a waiter eating lunch. We waited some more...the waiter finished eating and went to the back let people in the back know we were waiting...but still no one came...we left. What kind of an establishment doesn't have a host in the front to seat their patrons????? Why did we wait so long?? Horrible....horrible...horrible service....!"
        }, 
        {
            "index": 82, 
            "rating": 5, 
            "review": "We love Thai Food and are just in town from Phoenix for a few days and decided to stop in China Town. The food was great and the service was happy. My companions meals came out way after mine but they apologized and made amends . Definitely excellent Curry dishes and my Laad Na was great. We  have found our place to eat in Vegas."
        }, 
        {
            "index": 83, 
            "rating": 2, 
            "review": "KUNG FU KICKED TO 2 STARS\n\n   Kung Fu Restaurant broke an important rule. That rule is to NEVER EVER force your customers to leave a minute after giving them the check. Breaking this rule has consequences such as A ONE STAR REDUCTION IN A REVIEW RATING. As a result of their unprofessional action a 3.4 rating is dropped to 2.4 stars that is rounded off to 2 stars. Yikes! kind of how my brother and I also felt. In all honesty this a gentle response considering that many talented Yelper's would reward this experience with a one star rating. \n\n  Kung Fu Restaurant is located in the Las Vegas Chinatown District at the southwest corner of Valley View and Spring Mountain Boulevard. After a day in Springs Preserve suffering with a hurt left foot my brother and I decided to drive a few traffic lights South on Valley View Boulevard to Chinatown. This would be a convenient choice. Actually not really. Regardless that Kung Fu is at a major crossroads, the parking situation is atrocious. The diminutive parking spaces are more ideal for a golf cart than today's modern vehicles. I'd sacrifice my car if I left it there. So, we parked across Valley View Boulevard near Starbuck's with the intention of a post dinner coffee after. So I'd sacrifice my legs and limbs crossing a busy Valley View Boulevard.\n\n  The service started out allright. Immediately after walking inside there was a booth available (I wonder why). The waiter presented my brother and I with glasses of cold water and the menus. \n\n  Regardless that there was a large assortment of dishes to choose from, only the entree page dishes included jasmine rice. Nothing about brown or fried rice. I ordered the shrimp chop suey which was around $9.50. My taste buds say that the shrimp chop suey is 3.4 stars. In comparison to the Chinese restaurants that I have reviewed (my Chinese Restaurants list is the home of these reviews) the size of the shrimps trailed in comparison. Generally speaking, or tasting the quality from the vegetables to the sauce tasted fine. The soy sauce gave some taste to the jasmine rice.  With the shrimp chop suey and jasmine rice, I ordered hot tea. In my opinion it is nearly impossible to mess up the delicious hot tea that Chinese restaurants serve. After a few cups of the delicious green tea, I stand by my opinion. Thanks to the Yelp checkin offer, the tea was complimentary. I would of enjoyed a bowl of my beloved wonton soup,  one of my favorite foods in the world going back to my toddlerhood. But Kung Fu doesn't give any breaks with the soup. The war won ton soup is around $9. they ought to include personal portions of soup on the menu. Then again, they ought to include chopsticks on the table. \n\n  The food was good. I ate everything down to the plate including the sauce. My brother and I were talking at the time the waiter presented us with the check. Around a minute later the waiter tells us to pay because people were waiting for the booth. He wasn't giving us the stink eye and handed us our fortune cookies. Without a nasty demeanor he just rushing us out of the booth barely giving my brother and I time to split the bill. \n\n  I didn't read the fortune cookie. An appropriate fortune cookie would say something like, \"The average person tells nine other people when they are unhappy with a business where the average Yelper tells a couple thousand people when they are unhappy with a business.\" Or the fortune cookie might of said, \"You have a World of restaurants to choose from in your city.\" Or the fortune cookie could of said, \"There is nothing like competition.\" To close off this review, what I am saying is that Kung Fu rushed us out the door of their restaurant and it is a door I don't intend to open in a long time."
        }, 
        {
            "index": 84, 
            "rating": 4, 
            "review": "Always a good bet to come here if you're in the mood for reasonably priced Thai or Chinese food. Everything in the menu is delicious. I really recommend the 'beef jerky'. The place is consistently busy, which is always good sign."
        }, 
        {
            "index": 85, 
            "rating": 1, 
            "review": "We ordered at this place to try it out since we don't really know much Chinese places here that deliver and with us being new to the area, we wanted to give things a shot. We ordered our food about 9 and got the receipt confirming and wanted to call when we haven't gotten our food. It's been an hour and a half and we started getting worried. I had to call 3 times for someone to even answer and when someone did, the lady over the phone said \"it hasn't been an hour. It's on its way. Bye\" and she hung up the phone. So never again. I wouldn't recommend to  anyone. Terrible customer service."
        }, 
        {
            "index": 86, 
            "rating": 3, 
            "review": "I have been here 2x in the last year. When I come to Vegas, I ALWAYS need to eat noodle soup a few times. You will find me in China town once a day during my visits. MY favorite is the beef ball noodle soup. I got this both times visiting here, and i'm always shocked to see the tiny bowl of soup that comes out. This little bowl is nothing like what you see in the Bay area in California. But for Las Vegas, I suppose this will do.\n\nThe first time I was still hungry when we left, but this time, We all ordered the crab papaya salad as well. With this and my noodle soup, I left happy and content. The soup was a little on the sweet side which I am not accustomed to or favor.\n\nI ordered my soup without bean sprouts, and it came with bean sprouts , I also asked for extra cilantro and they didn't give me any..\n\nIf you are not sure what you are craving.. you will definitely get lost in this menu. This thing is like 10 pages long, ranging from Thai curries, to soups to Chinese fried rices and more dishes!\n\nCome prepared with an idea of what you want..\n\nI'll probably try some more Thai places in the area next time I'm in town before coming back."
        }, 
        {
            "index": 87, 
            "rating": 1, 
            "review": "Terrible service! When we complained to the owner he apologized but that was not sufficient as we thought our service would improve....NOPE"
        }, 
        {
            "index": 88, 
            "rating": 3, 
            "review": "Food was really good as always. But we realized this place decrease the portions of food and it's now changing fine dining prices. Well... I don't think the atmosphere and service deserves the price increase. Let me know if you ever come up with a 50% off offer and we might consider."
        }, 
        {
            "index": 89, 
            "rating": 4, 
            "review": "Been to Kung Fu a few times. LOVE IT. Its always pretty full when we go so it makes it a better experience to people watch. I always the Tom Yum soup with shrimp. Love the spyciness. I also recommend the walnut shrimp if you like sweet food. Place seems clean and waitress is always sweet."
        }, 
        {
            "index": 90, 
            "rating": 1, 
            "review": "don't go here, go to Pin Kow. \n\nparking is terrible. \nservice is even worse. the guy who seated us, also took our order and cleared the table. they are understaffed and very un-accommodating. (no, you can't substitute shrimp for chicken) it took us forever to get our food, and even longer to get the check. not to mention the food came out staggered, my husband got his entree, then they brought out the appetizers, then another entree...\nfood quality was not good; very bland and not fresh. no condiments on the table, and not even enough for each table. they also didn't have enough menus for everybody. \nover all appearance and quality of the restaurant was poor."
        }, 
        {
            "index": 91, 
            "rating": 5, 
            "review": "I love Kung Fu, great food served promptly, great service, calming atmosphere, and a huge menu to choose from...it works for me every time."
        }, 
        {
            "index": 92, 
            "rating": 5, 
            "review": "Had the lunch special orange chicken. It was really good. Came with one chicken wing, fried rice, egg drop soup and a veggie roll. The portion was just right for lunch."
        }, 
        {
            "index": 93, 
            "rating": 4, 
            "review": "Being new to Las Vegas, the search is on for certain restaurants that are \"musts\" while I'm here. \nA good Chinese joint is crtical, and the mission has been accomplished.\nThey've got a very good lunch special for $5.55 (described above). \nI recommend the BBQ Pork Appetizer. It's a little different than I've had before, coming covered with a honey sauce, but it's very good.\nSweet & Sour Chicken is good, fried rice is solid. It's going to be a weekly stop for me."
        }, 
        {
            "index": 94, 
            "rating": 4, 
            "review": "Stopped for a light lunch while picking up my truck from the shop.  Had tom kha kai and eggrolls.  Really nice to have a place where you can get good fresh-made eggrolls. I ordered the soup with \"medium\" heat, and the heat level was fine.  Good amount of chicken meat, and the herbs and vegetables were all fresh."
        }, 
        {
            "index": 95, 
            "rating": 5, 
            "review": "Some of the best Thai food in town. Service is friendly, however; does not qualify for speedy. Worth the trip to Chinatown-great Tom Yum!"
        }, 
        {
            "index": 96, 
            "rating": 2, 
            "review": "Ordered 3 dishes:  Chicken pad Thai, sweet sour shrimp and Angus beef egg fu young.  We thought only the chicken pad Thai was delicious.  Fu young was too loaded with cabbage!  Sweet sour shrimp barely had shrimp.  The rock hard pieces were over fried.\n\nWe were forgotten most of the time.  I had to keep standing up and waving to the servers for drink refills.\n\nWe will not go back again."
        }, 
        {
            "index": 97, 
            "rating": 4, 
            "review": "I am a fan of Pad Thai so every Thai restaurant that I go to, I get this. While I wasn't impressed with the tom yum soup, Kung Fu has a delicious Pad Thai that can beat Lotus of Siam's Pad Thai any day of the week. Get this item here if you love pad thai!!!"
        }, 
        {
            "index": 98, 
            "rating": 4, 
            "review": "After a busy week in Vegas, and simply not feeling great, I decided to order for delivery, and I am glad I did. I ordered the Chicken Satae and the Chicken, Garlic and Pepper, and both were very good. \nI had lunch in China Town yesterday and was very disappointed. It turns out I just went to the wrong place. I will definitely come back to this place the very next time I'm in Vegas. \nDelivery time was prompt too."
        }, 
        {
            "index": 99, 
            "rating": 1, 
            "review": "With all the great reviews on here I was really excited to try it. I was so disappointed. We walked in and it was if we were non existent. No hello.. No eye contact. We stood there and wondered do we seat ourselves? Finally someone seats us.. I think it took 10 minutes for a server to get to our table. He was indifferent and kind of ignored is the rest of the night.\n\nNow the food.. Ugh. I ordered egg flower soup .. It was so thick I couldn't stomach it. Mongolian beef was okay .. Very small portion and I don't eat that much. Egg foo young looked gross on the plate. It tasted okay.. I mean it's only eggs. It just wasn't that great like I thought it would be."
        }, 
        {
            "index": 100, 
            "rating": 4, 
            "review": "Kung Fu Thai & Chinese is a Thai and Chinese restaurant located on Spring Mountain Rd. I went with my party of four to this restaurant on Sunday, January 3 around 11am. The style of service here is family style, but there are entrees for one serving available as well.\n\nAtmosphere: Vibrant, Organized\nThe decor of the restaurant seems to be based around Thai decor. Upon entering the restaurant, the decor is vermillion-colored. Nothing too flashy, but there are pictures and statues that seem to be Thai-themed. Nothing too obnoxious or flashy, but there is just enough decor around the restaurant to catch your eye.\n\nService: Good! \nUpon entering the restaurant, we were seated immediately at a booth. When were seated, however, instead of the waiter asking us for what we wanted to drink, he just gave us all ice water. We were able to ask for hot tea (which one of us wanted) later upon request. The table where we were seated had plenty of space for us to sit. We took our time finishing our dishes, and when they needed to be cleared, they were cleared with efficiency. The only thing I did not enjoy would be the busser stacking dishes at the table. He should have brought a cart or a tray in case something might have splashed on us.\n\nFood: Well prepared, delicious, and memorable\nWe ordered the crab ragoons as our only appetizer. They were crispy on the outside with a creamy filling. Six were served to us on a bed of shredded cabbage with a side of horseradish sauce and sweet and sour sauce, both of which complimented the ragoons very well. What I liked about the service when we ordered the ragoons would be when the waiter told us that if we order wontons they would be plain and if we order the ragoons they would have filling. This was very considerate of him.\n\nThe two soups we order were the wonton soup and the tom yom with \"big\" rice noodles. The wonton soup came with shrimp, pork, carrots, baby bok choy, scallions, and pork wontons. The wonton soup was decent, but needed some salt and pepper. The tom yum we order was medium spiciness and came with fish balls, imitation crab, some ground pork, bean sprouts, scallions, and a fried wonton on top for garnish. The tom yum was incredible: full of flavor, a little savory with a complimentary kick of spiciness.\n\nThe dishes that we order were the chicken pad thai, Hon Sui Tofu, and beef and broccoli in oyster sauce. Chicken pad thai came with purple cabbage and parsley on the side. The pad thai had a good amount of chicken and seasoning. The Hon Sui had great juiciness in the tofu and great flavor in the meat: totally delicious and savory. The Beef and Broccoli was probably my favorite dish; the beef's smokiness and seasoning was absoutely amazing. The Beef and Broccoli in oyster sauce is a must try!\n\nOverall: Good experience, would go again!\nAlthough the service was not great, the food we were served was some great Asian cuisine. The food was probably some of the best I've had in a while. Visit this place for some great Thai and Chinese food!"
        }, 
        {
            "index": 101, 
            "rating": 4, 
            "review": "At my little hotel on the Strip (no longer Cosmopolitan, btw) we have an Employee Dining Room. It's... well... it would get zero stars on Yelp. So sometimes we just can't hack it, and call in for some more-edible options. One of those places is Kung Fu. It had some good reviews and a full menu online, so we gave it a try.\n\nIt's exceptionally pleasing! Of course, I had to go with Pineapple Fried Rice (my favorite!) and theirs comes in huge portions with chicken, pork, shrimp, and crab! What a catch! (You see what I did there?) My coworker went with the pad thai and she liked it.\n\nThe best part is that delivery is in pretty reasonable time, and they deliver anywhere to the strip. It's a pretty good option, especially if you just want to chill in your hotel room before going out."
        }, 
        {
            "index": 102, 
            "rating": 5, 
            "review": "Am giving it 5 star because the food is truly authentic thai cuisine and the service is quiet fast and the bathroom is very clean."
        }, 
        {
            "index": 103, 
            "rating": 3, 
            "review": "Loved the chicken wings and vegetables with crispy pork. The General Tso's was a bit more sweet than spicy for my taste. Unlike other reviewers, our service was pretty decent. Definitely coming back to try something else."
        }, 
        {
            "index": 104, 
            "rating": 4, 
            "review": "Good flavors, decent portions, shrimp was rubbery though.  Great place for large parties, very accommodating."
        }, 
        {
            "index": 105, 
            "rating": 4, 
            "review": "I have been here a few times with my family and love their food! The cashew chicken and Mongolian beef are a must try."
        }, 
        {
            "index": 106, 
            "rating": 4, 
            "review": "Great food! But go early in the day they get really busy. Their menu is packed with a variety of different foods and they offer great service I have a sesame chicken rice and it was bomb with a really good portion size I will definitely be back again."
        }, 
        {
            "index": 107, 
            "rating": 2, 
            "review": "Ate here on my second night in Vegas.  I was going to eat at the plaza next to this one, the one with the Monkey King statue, but felt we have the best Chinese food in L.A., so it'll be a waste eating Chinese food in LV....  I should have stuck with my same reasoning for this place. \n\nThe soup was decent, the Pa Nang curry was no good, they added peanut butter to the sauce, and the meat/veggies looked so plain.  \n\nNext time when you visit Vegas, stick with what they're known for, buffets and oyster bars."
        }, 
        {
            "index": 108, 
            "rating": 4, 
            "review": "I love this place! Food is always amazing, staff is always super attentive.  Great price! One of my favorite Thai restaurant! Only reason why I gave 4 stars is because it has been open for awhile remodeling is a must!"
        }, 
        {
            "index": 109, 
            "rating": 5, 
            "review": "I've been going to this place for 16 years. The food is amazing, hasn't change over the years! The staff used to be better but still decent customer service(when it's not super busy, otherwise it's not great) The orange chicken is the best around. Prices are decent for the portion sizes. I bring friends and family(which are mainly from out of town) to this place and they love this place as well and come every time they are in town"
        }, 
        {
            "index": 110, 
            "rating": 1, 
            "review": "This restaurant is from the 70's and you can tell. There's an odd smell that hits you as soon as you walk in it's a smell that is obviously rising from the old carpet that needs to be replaced! I ordered the Tom Kai Gai with chicken and when I received my food I noticed the chicken was undercooked. I let my server know and he   told me the food is fine. I told him I wouldn't eat uncooked chicken so he let me know I didn't have to but I couldn't order anything else off the menu because he wasn't going to pay for my meal. I was very disappointed in how I was treated and I'll never go back to this place. If they have a no return policy for nasty undercooked food then they should post that somewhere!"
        }, 
        {
            "index": 111, 
            "rating": 4, 
            "review": "SO and i hit for late lunch - we've eaten here ...at least 5 times - we focus on the thai food - they also have a nice lunch plate $5.55 - includes egg flower soup ( a little too thick ) a chicken wing, an egg roll ( ehhhh ) white or fried rice ...ok...and about 6 or so main entrees - i had the minced chicken w/ mint...tasty - overall a great deal at $5. \n\nSO had a spicy noodle soup ( rice noodles ) - it had some bite !!  spicy bbq pork salad....we always get this dish - decent chunks of pork, a lime/cilantro dressing, red onions, greens - a little spice but very refreshing !!\n\nwe like this place"
        }, 
        {
            "index": 112, 
            "rating": 1, 
            "review": "Went here because Krung Siam across street was closed. Should have kept driving... bad bad bad."
        }, 
        {
            "index": 113, 
            "rating": 3, 
            "review": "Great price on the lunch special $6.95. I got the chopped chicken with chilies and mint. It was really yummy! And I love that the lunch special came with an egg roll. I didn't care for the soup. It smelled fishy and was too thick. The service was fast and the space was very clean. All in all good experience, but won't be a regular."
        }, 
        {
            "index": 114, 
            "rating": 2, 
            "review": "Very disappointing.  This restaurant's Thai food was excellent four years ago, but has been going down steadily since then.  Now much of their Thai food tastes like bad Chinese food.  (I've traveled extensively in both countries, and I know the difference.)\n\nToday their Thai seafood mint combo was barely edible, and their Thai mixed vegetables was hardly better.  Noodle salad was only average.  My wife, who is Chinese, said the Thai food tasted like bad Americanized Chinese food - so salty she had to eat it with a lot of rice and three glasses of water (which saltiness is not typical of true authentic Thai).\n\nIt's a shame this formerly excellent restaurant has careened downhill."
        }, 
        {
            "index": 115, 
            "rating": 5, 
            "review": "We wanted something different so we went for Oriental food and we found this restaurant on Vegas.com for best restaurants in Vegas. This restaurant is family owned and run for many years it does take a while to get your food because they are very busy but the wait was well worth it."
        }, 
        {
            "index": 116, 
            "rating": 4, 
            "review": "Kung Fu Thai was a little hard for me to find because it's tucked on the side of a shopping center. I thought there would be parking on the side . It is best to just park in the front of the shopping center and walk to the restaurant. We were seated right away which was nice. \n\nI ordered Drunken Noodles it's called something else here. I just can't remember what they called it! I'm glad the waiter knew what I was talking about! It was delicious!   My brother had the Sweet and Sour Pork ($8.75). You could tell that this was made fresh because it wasn't Chewy and soft. It was crispy on the outside and tender on the inside. We also ordered a side of egg rolls for ($6.95) . I liked that the rolls had clear noodles in it because I don't see that often. \n\nThe service was also prompt and friendly. We didn't have to look for anyone because they constantly checked on us. This was an awesome eating experience!"
        }, 
        {
            "index": 117, 
            "rating": 4, 
            "review": "Well I am not from Thailand or China to tell you if its authentic or not ,but I can sure tell you the food is good and flavorful.\nThe Veg fried rice took me back to Mumbai in a flash for its resemblance to the street food.\n\nA respite from the bland and overpriced food of The Strip\n\n4 stars because I have been there just once"
        }, 
        {
            "index": 118, 
            "rating": 4, 
            "review": "My Fav Thai/Chinese restaurant in Vegas! Such a variety of food to choose from. There's even a vegetarian menu. Tofu Satae is my favorite appetizer. It comes with toast & a cucumber salad."
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "Been going to this little hole in the wall for years. Ongchoi with crispy pork a must try. Stuffed chicken wing iv not had better in town. Feels like a mom and pop joint. In this case looks can be deceiving dont judge this book by its cover. Thai food the right way."
        }, 
        {
            "index": 120, 
            "rating": 4, 
            "review": "This was my first time here, we went to china town to celebrate Chinese New Year. \nI ordered the fried calamari which was lightly fried , was just perfect.\nMy main course was chicken panang with white rice, the spice level 2, not too spicy. The papaya salad is my favourite dish , it was fresh and a must to compliment any dish.\nTo complete I had the Thai ice tea. The portion size was enough for 2 people.\nThe food overall was delicious but the waiters made us wait like 20 minutes for our bill."
        }, 
        {
            "index": 121, 
            "rating": 5, 
            "review": "Excellent Thai and Chinese food. I've gone here with friends, family, and business associates. Great for all three. Try the beef pepper steak or the chicken fried rice: It's bomb!!!!!"
        }, 
        {
            "index": 122, 
            "rating": 4, 
            "review": "chicken pad thai was delicious \n\ncombination fried rice was yummy but a little oily\n\nfried chicken wings was really crunchy but there was too much batter and it didn't really have a taste...you're supposed to use the dip but I didn't like it because it was too sweet\n\nsquid salad was so good, but a little spicy for a 7/10 spicy rating\n\ntofu vegetarian curry was not good, it wasn't very flavorful\n\nmango sticky rice was the best I've ever had\n\nstir fry lo mein noodles with seafood was yummy \n\n--\n\noverall, if you're in the mood for greasy Thai food, this is awesome for $10-$15 a plate"
        }, 
        {
            "index": 123, 
            "rating": 3, 
            "review": "The food is good. Lunch specials at 6.95 each are well priced. You need to arrive early or they ran out of certain items.  Today they ran out of the lunch egg rolls and the coconut rice with mango. The food comes out fast. The service was quick and friendly."
        }, 
        {
            "index": 124, 
            "rating": 4, 
            "review": "Fast service and food. Decent prices. \n\nOrdered the crispy pork and chinese broccoli, fried catfish, beef dish, and tom yum soup. They were all good, standard food."
        }, 
        {
            "index": 125, 
            "rating": 1, 
            "review": "Good food, terrible service. The food was good and in reasonable portions but I hardly ever saw my waiter. It wasn't that they were busy; there were two large tables that were all Asian that got seen constantly without any trouble. After they took my plate away I waited 15min for my check, in that time both tables entered, got seated and ordered their food by the same waiter. It was the first time I've ever not left a tip because I was genuinely offended at their service. Quality wise I'd order take out next time but on principle I'll never give them business again."
        }, 
        {
            "index": 126, 
            "rating": 5, 
            "review": "A great place for lunch if you have a couple of hours to spare. This restaurant offers the best lunch specials for $5.99 which includes soup, a chicken wing and egg roll, rice and your entree...what else can you ask for? The staff is very friendly and are always keeping an eye on your table to make sure your glass is always full and your table is cleared of dirty dishes.\n\nYou can also try this place for dinner as they have quite an extensive Chinese and Thai food menu. However, if want to order off the regular menu, please make sure you bring someone with you because all the dishes are big enough to share."
        }, 
        {
            "index": 127, 
            "rating": 5, 
            "review": "You can't go wrong with their wanton soup, pork  fried rice, seafood chow mein, and Thai BBQ chicken! Well at least, that's according to my friends and I. :)\n\nWent here late Friday night after having gone to First Friday at the Arts District. Been craving for some Chinese food so we originally planned of going to this Golden Flower in Henderson, but unfortunately it's closed when we arrived there. Since that was already past 930p, most of the Chinese buffets we know were already closed. So we had this genius idea of going back downtown until we brought ourselves to Chinatown. That was quite a drive I'll say so talk about starving. Lol\n\nWe basically just acted on impulse and eat wherever our eyes set on first. And this was it! We absolutely liked the food, the restau's ambiance, and its all-cool-and-smiling staff. :)\n\nIf you're around the area, you must try this dining place out sometime!"
        }, 
        {
            "index": 128, 
            "rating": 5, 
            "review": "I have been here since 2004 like every year when I go to Vegas. It become family tradition to eat lunch next day when we got to Vegas. \nIf you like Asian spices foo, my recommendation is\n\n502\nBeef jerky\nTomyang kon \nEgg fried rice\nPapaya salad\nStair fried snow pea\n550\n579\nKung pao duck. \nMongolian beef stair fry\n590 cat fish"
        }, 
        {
            "index": 129, 
            "rating": 2, 
            "review": "The service is very slow. I had to wave a waitress down after waiting 10 minutes. We ordered fried catfish, orange chicken, poah taek soup. I give it 4 stars for no flavor. The staff is very inattentive and they ran out of most of the appetizers like the fish cakes and sate and jerky at only 630pm. I'm used to flavorful food in SoCal but this place just had no flavor. Such a disappointment!"
        }, 
        {
            "index": 130, 
            "rating": 5, 
            "review": "Awesome authentic Thai food!!  We tried several dishes and every single dish was excellent!!  Every time I'm in Vegas and craving some Chinese or Thai food this place really is able to satisfy my craving. We also ordered for delivery one of the times and they delivered to our hotel on the strip for only $5 delivery charge.  They even deliver it to the door step of your hotel room!  Sooo worth it especially when the cab ride back and forth to our hotel is like $20."
        }, 
        {
            "index": 131, 
            "rating": 3, 
            "review": "Great prices. Pad thai so-so pineapple fried rice amazing"
        }, 
        {
            "index": 132, 
            "rating": 5, 
            "review": "Yes, this place is as good as it gets. All our friends come in from out of state and always want to come back to Kung Fu's for their wonderful food. Always a great food experience. The staff is exceptionally attentive. A must try!"
        }, 
        {
            "index": 133, 
            "rating": 4, 
            "review": "Having a craving for Thai food in Vegas once again, my friend recommended yet another she was familiar with. So far, I think you can't really go wrong as pretty much all the Asian restaurants I've been brought to has yet to disappoint me. This place was no different.\n\nIt's one of the typical informal Asian restaurants you'll find in Chinatown....dated decor and nothing 5 star about it. That's fine as these places are frequented for the food and not the decor. Not to say there isn't any atmosphere as there's hodge podge of Thai and Chinese antiques and motifs.\n\nLike most Asian restaurants, it's probably best to go in larger groups as there are so many dishes to try and the portions are quite generous. Since it was just my friend and I, we just ordered the fish cakes, Pad See Ew (fried flat rice noodles) and the Pad Wan Sen (fried clear noodles). The flat rice noodles was pretty good, but just a bit sweet for my taste. I had actually ordered the fried clear noodles which were quite delicious. However, I had just had this this dish at another Thai restaurant a few days ago, and the other restaurant's taste edges out this one a bit in terms of taste quality. Still good though, and a good sized plate of noodles. The fish cakes were not too bad either, but for some reason parts of it were dry or hard to the chew. \n\nFor a good Thai and Chinese restaurant both in one, and not too far from the strip, then this is definitely a place I'd come to again. Service was good (likely because it wasn't a busy time of day), good sized portions, and the food was worth the money. The other Thai restaurant I really enjoyed was a good 4-5 miles from the strip in a suburban strip mall, and probably a bit too far from the strip to venture out to, unless you have a car and GPS. This place is convenient."
        }, 
        {
            "index": 134, 
            "rating": 4, 
            "review": "I used to work close to here and their lunch specials are amazing. So is their chicken pad Thai. I never would have gone here if a coworker hadn't told me about it."
        }, 
        {
            "index": 135, 
            "rating": 4, 
            "review": "Ive been eating at Kung Fu for years. Anyone Ive ever taken there or ordered with loves it. They deliver! I have not found crab rangoon anywhere that compares to theirs. You order the spice of a dish on a hotness level 1-10. They could be a little more consistent with that but I think it depends on the cook. I dont like too hot so I order a 1 or 2 which sometimes can feel more like a 4 or 5.. but overall, the best Chinese & Thai cuisine."
        }, 
        {
            "index": 136, 
            "rating": 5, 
            "review": "Since I discovered the restaurant (2 years now)  I ate there or ordered to-go at least once a week. Most of the guys basically know me by my name already. \n\nIf you like soups, you should try the Tom-Yum Soup, though I never go higher than number 3-4, I guess at 8 it should be really spicy!\n\nFor delivery, our whole office loves the Mongolian Beef or Chicken, and also the Chopped Chicken Ya Kee Mao is one of my fav's.\n\nThe prices are really good, their lunch special comes for $6.50 with one egg roll and one chicken piece.\n\nI would recommend it to most of Thai lovers..."
        }, 
        {
            "index": 137, 
            "rating": 4, 
            "review": "Good menu. Fair service. Fair prices Casual  full bar   Something for everyone   can't complain"
        }, 
        {
            "index": 138, 
            "rating": 1, 
            "review": "horrible experience. We ordered our food online 2 hours ago and still NO FOOD. we just called and they clearly have no idea that we even ordered, we've talked to 3 different people in the past hour about our food. The last time we called she offered to retake our order and start from scratch. Meanwhile, the credit card was charged for food we never received. The lady took our number and said the \"computer is broken\" and the boss will call me back later for a refund. Worst experience i've had with lunch. My lunch hour is now :("
        }, 
        {
            "index": 139, 
            "rating": 4, 
            "review": "Best thai food in town. Almost as good as moms cooking! Food is fast but sometimes appetizers come after main course, that's why only 4 stars.excuse the half eaten plates..."
        }, 
        {
            "index": 140, 
            "rating": 2, 
            "review": "The food here is mediocre, but it is pretty cheap. \n\nI've gone here about three times and from what I can remember I've had pad thai, tom yum soup, chow mein, a chicken dish, a duck dish, and a beef dish. All of the dishes were satisfactory, nothing more. \n\nThe staff isn't very friendly. I have never being greeted here, or given a nice goodbye. \n\nIt's a nice place to go if you want a lot of food for a low price and aren't too concerned about service.\n\n*You can also view the comment that was left on this review to get a further understanding of the people that work there:\n\n-Only I would know how many times I've gone to this restaurant, so for this person to say, \" I'm sure you've been here more, you just forgot a few other times we were together,\" is just a little absurd. And after asking my boyfriend, it turns out I've only gone here TWO times.   \n\n-\"You'll probably have to get use to having great tasting Thai and Chinese food.\" Excuse me? I'll probably have to GET USE TO having this stuff? As if I haven't gone to other Thai and Chinese restaurants before. I didn't even mention the fact that it was Chinese and Thai in my review, so i don't see what that has to do with anything. \n\n-\"see for yourself. The Tourism Authority of Thailand delegates to the DEMA show dined with us three out of the four days they were here in Vegas.\" Umm, is that suppose to mean something to me? Showing me some link isn't going to change my taste buds. \n\n\nI gave this restaurant two stars for a reason. The food is mediocre and the service is lacking, but that doesn't mean I hated it.  I've left far worse reviews at other places."
        }, 
        {
            "index": 141, 
            "rating": 5, 
            "review": "Fast delivery and great food!   If you try nothing else get the crispy pork,  beef jerky and the fried shrimp!   Delish!"
        }, 
        {
            "index": 142, 
            "rating": 4, 
            "review": "I have been here since I was a kid. The thai food is F A B U L O U S! The only problem is that they really should waive the extra rice fee of $2.50 if you have four or more people. But other than that, this is the BEST thai food in Las Vegas and I would recommend this restaurant to anyone that wants to try something new or any good thai restaurant."
        }, 
        {
            "index": 143, 
            "rating": 5, 
            "review": "This review is long overdue, but I really need to give this restaurant a superb rating, because it without a doubt was delicious.\n\nI went to Las Vegas for the summer and ate at a restaurant every day for a week, but Kung Fu Thai and Chinese Restaurant was definitely my favorite. My uncle kept saying that Thai food is good, but I've never tried it and pushed to eat at other restaurants.\n\nOn our last night there, we tried this place. I was just FLOORED by how scrumptious each and everyone one of my bites of food were. The waiters provided EXCELLENT service and they were so kind! We went at night, so it was just our huge family of around 30 and another small family at a table near us.\n\nFoods I ate:\n-Tom Yum soup\n-Seasoned fish (forgot what it was called, but I hate fish and this was one of the only times I enjoyed eating it!)\n-MONGOLIAN BEEF *YES YES YES*\n\nI forgot all of the other dishes, but I'm sure that they all had just the right seasoning, texture, and taste.\n\nDefinitely give this place a try if you're ever in the area!"
        }, 
        {
            "index": 144, 
            "rating": 1, 
            "review": "TREATED SO BADLY AFTER BEING A LOYAL CUSTOMER FOR 5 YEARS!!!! I have been ordering delivery from this place for 5 years, I called tonight to place an order and the lady on the phone rudely told me we don't deliver to you anymore! I tried to explain to her that they have delivered to me 2-3 a month for the last 5 years, she now starting yelling at me and said I told you 20 times we do not deliver there and hung up on me. I work In a casino/hotel on the strip and have always recommended them to guests and also ordered huge orders for my department! They charge for delivery but have always tipped 20-25 percent. I am so disappointed in this establishment of how they treated me and I will pass it on to everyone I know! TERRIBLE CUSTOMER SERVICE! You lost a great customer! Zero stars for you Kung Fu, you should be ashamed of your behavior!!!!!!!!!"
        }, 
        {
            "index": 145, 
            "rating": 4, 
            "review": "Must have passed this place a million and one times over the last ten years since I came to town and never stopped in. Heard good things about it and fellow colleagues always go, so today me and Ellen F. decide to check it out. \n\nLocated on the southwest corner in the strip mall on Valley View and Spring Mountain, can't miss it with a name like Kung Fu on the outside. We were seated right away, place wasn't too busy so a waiter took our drink orders promptly. \n\nThe place looks old school but don't care about that, has a lot of Thai decor with elephants and pictures of the motherland. I get the feeling this place is geared more toward Thai than Chinese but who knows. If you want pad Thai don't fall for the trap and order it from the menu as they offer it as a lunch special for $6.95 Mon-Fri 11am-3pm. I fell for this and ordered the combo pad Thai with an order of rice, it was huge!! Enough for two people. \n\nI doubt the lunch portion is as big but still much cheaper and comes with soup or an egg roll. The pad Thai was very good, along with the rice, the quantity was more than enough and the bill was reasonable. We will be returning during lunch hours to take full advantage of the specials. If your looking for a cheap meal in Chinatown with no frills it's worth a stop."
        }, 
        {
            "index": 146, 
            "rating": 4, 
            "review": "Ok so I went with a Thai girl and had no idea what I was eating. She was kind and ordered a creamy chicken soup that was excellent. A ground beef thing over rice that was spicy but really good, Also had something that looked like beef jerky that was soft in the middle and very good. A full Chinese menu is also offered, \n\nThai tea is recommended."
        }, 
        {
            "index": 147, 
            "rating": 2, 
            "review": "Delicious and timely but I ended up sick the next day! Watch out on the seafood options."
        }, 
        {
            "index": 148, 
            "rating": 5, 
            "review": "The food are very good / and service is the best how many times I come to vegus I never forget to visit them here \n\n\n\nThe best restaurant in vegus should come try it \n\n\n\n\nCome back today again so good !!!! Lv"
        }, 
        {
            "index": 149, 
            "rating": 4, 
            "review": "This place is the best Thai/Chinese food place on Valley View Rd! We went here with a group and could not believe how extensive the menu was. We each ordered a plate and shared it. There was even plenty enough to share with even more people. The service was great and attentive. They even have a bar inside. This place is open until 1am."
        }, 
        {
            "index": 150, 
            "rating": 5, 
            "review": "I have to say this is my favorite Chinese food spot in Vegas. I always order the sweet and sour shrimp with my meal and it is always fantastic. The last time I went, I went with my son. He ordered the whole fried catfish and you should of seen when the waiter sat it down in front of him. He almost jumped out his skin. \n\nBut kids aside, ordering whole catfish when they don't know what to expect and aren't listening to the adults tell them it is a whole catfish the food is always great and the service matches it. Oh, the catfish was fantastic with the chili sauce being delightfully unique."
        }, 
        {
            "index": 151, 
            "rating": 5, 
            "review": "I love this place. You know why? The BEST service and the most friendly and attentive staff- period.  Genuine, kind individuals working here and I adore them all. Food always comes out quick, so you're never waiting a year for your food to come and never will you have an empty glass. Just doesn't happen here.\n\nI will admit that I generically order the same 4 things (with other new dishes) every time I come to Kung Fu:\n\n1. Mongolian Beef - NOTHING...and I mean NOTHING- tops their MB.\n2. Tom Yum Soup with Tofu - I cry because San Francisco doesn't know how to make it like Vegas does. I have tried numerous Thai restaurants in SF and gave up because they all use some kind of tomato tasting broth that totally turns my taste buds off. It was heartbreaking when I moved away from LV. Kung Fu knows exactly how to make my spicy and sour broth!! (Try Komals if you want the very best Tom Yum in LV)\n3. Orange Chicken - Very strong flavored orange glaze over crispy chicken. YUM!!!\n4. Thai Vegetable Fried Rice with egg - love it!\n\nWhile visually its not the greatest looking restaurant, don't mind that because what's looks got to do with it?!?\n\nService always weighs heavily on my mind when forming opinions about restaurants, business etc. that I go to, and I can't emphasize enough that the staff here just gets is right- 100% of the time...for me anyways, but maybe the just like me ;)"
        }, 
        {
            "index": 152, 
            "rating": 4, 
            "review": "I have eaten here twice when I have been visiting Vegas.  Both times I've had the panang curry.  It was very good both times.  My service has always been good and I would recommend this place to anyone visiting Vegas and looking for Thai."
        }, 
        {
            "index": 153, 
            "rating": 1, 
            "review": "The worst service ever. Waiter started arguing with me after he brought the wrong soup and told me that I got what I ordered. Then he just walked away. Then he came back telling me again that this I what I ordered, this time he took the soup and walked away telling me of in Chinese. Another waiter came to our table and recognized me from his prior restaurant and says hi and that he wanted to apologize for for his behavior. The new waiter even remembered what I use to ordered at his restaurant. He brought me my favorite soup and told me about Thor curries and that next time we come in to order the green curry, because it is the same as the one I use to order at his old restaurant. Food is mediocre and the service is horrible. Don't know if I will be back ever."
        }, 
        {
            "index": 154, 
            "rating": 4, 
            "review": "This place was recommended to me by a great friend. I am not one to choose Asian food for a meal.  I've tried different Chinese & Thai food restaurants, but I leave un satisfied and not very impressed!\n\nKung Ku has yet to disappointment me! The food is very flavorful and I have yet to not like something I've ordered.  \n\nThe food is served family style and the prices are reasonable!  You won't find yourself waiting long either because the food comes out fast!    If you're in the area, give it try!"
        }, 
        {
            "index": 155, 
            "rating": 4, 
            "review": "Great food and good service.  The dinning room could use a little TLC. It seems cluttered and disorganized.  If your looking for good food  please give hem a chance. You will not be disappointed at the quality and quantity of food serviced here."
        }, 
        {
            "index": 156, 
            "rating": 5, 
            "review": "Amazing resturant!! Have been going here since I moved to Vegas! I love the friendly service and the amazing food. I believe that this place has the best pad see ew (pardon my spelling). I do agree that the atmosphere of the resturant is not too appealing but I really concentrate more on the delicious cuisine. Go here for authentic thai food (:"
        }, 
        {
            "index": 157, 
            "rating": 5, 
            "review": "Love Kung Fu!  Such good food. I've only ordered for delivery but this is my go to spot when I didn't get around to cooking dinner. Open late for delivery.  Also big portions and fast delivery. Yum!"
        }, 
        {
            "index": 158, 
            "rating": 4, 
            "review": "Saayywhaaa???!!!  I have been in Vegas all my life and am so MAD I didn't discover this one sooner.  GREAT food GREAT service."
        }, 
        {
            "index": 159, 
            "rating": 3, 
            "review": "Kung Fu Plaza Restaurant is one of the first restaurants you see as you enter Las Vegas Chinatown from the strip. I can't stand the name of the restaurant, but the food is not too shabby. A few years ago, I thought this place was the bomb, but I think because of the combination of food we ordered, I left feeling underwhelmed. It wasn't bad, but it wasn't so spectacular either. This restaurant offers both Thai and Chinese cuisine.\n\nGotta have Tom Yum. We ordered the seafood. For 13 bucks, they didn't give us much soup, and the seafood was sparse, but it tasted alright. \n\nThe Pad Thai was decent. Kind of hard to mess up pad thai.\n\nMy sister ordered the Cashew Chicken. This was just an average dish. \n\nThe Pan-fried Catfish was everyone's favorite. The fish wasn't perfectly fried by a long shot, but the sauce was very good. I'm not sure why it says that the sauce is \"curry like\" on the menu, but it was a bit spicy, and the basil added fragrance. I love spicy! \n\nOk, let me tell you about this dish that hubby ordered. He has a history of ordering bad dishes. This was the Pa Nang Curry with Beef. It was like scooping a spoonful of peanut butter into my mouth. My mom said it was \"so weird\" in Vietnamese. It was.\n\nLots of photos and full review on my blog."
        }, 
        {
            "index": 160, 
            "rating": 3, 
            "review": "I don't live in proximity to Kung Fu but I had an appointment in the area and it was recommended to me. I was told I have to try the duck. Since I'm always game to try things that people seem to be so passionate about, I thought why not?\n\nFirst I will say that the parking was a bit confusing. Kung Fu is located in a strip mall on Spring Mountain but the actual restaurant faces Decatur. You can't actually see it from the parking so you really have to know that it's there or you would totally miss it.\n\nAfter looking through the pretty extensive menu we decided on the Crab Rangoon for an appetizer, the half duck and the chicken Pad Thai. Well one of my pet peeves is when the appetizer arrives the same time as the entree which is what happened here. I still can't figure out why anyone would rave about the duck. It was super rubbery and none of the fat was rendered. The Pad Thai was solid however but not enough of a reason to come back. And lastly, the service was not very attentive. We even had to wave someone down to get our check.\n\nChina Town has so many great restaurants in the area but this one is not going to be on my radar in the future unfortunately."
        }, 
        {
            "index": 161, 
            "rating": 3, 
            "review": "Not my fave.  My thing is rare beef soup and spicy, but everything  was sweet.  My moms dish, my sons dish, all things ypu would not expect.  Attentive staff and  relatively  clean.  There was a security  guard watching over the alley so parking was convenient."
        }, 
        {
            "index": 162, 
            "rating": 5, 
            "review": "One of my favorite restaurants in Las Vegas.  Been coming here for more than 15 years.  Love the duck noodles!!\nBest long island ice tea in Vegas!"
        }, 
        {
            "index": 163, 
            "rating": 4, 
            "review": "Very good. We had the lunch specials and a friend had the combo fried rice. Also an order of crab Rangoon for the table. My lunch special was sweet and sour chicken,  soup, fried rice and an egg roll. It was all very tasty. Nice place!"
        }, 
        {
            "index": 164, 
            "rating": 3, 
            "review": "I don't really have a clear recollection of the good, but I'm guessing it was pretty good, 'cuz I didn't end up throwing any away. The service was decent enough for take-out. As Ashley said, parking is a bitch, but, hey, it's not like Kung Fu built the parking lot."
        }, 
        {
            "index": 165, 
            "rating": 1, 
            "review": "Me and my husband ate here today for their lunch specials.\nTheir chopped chicken with mint wasn't good and the texture was overcooked, so I called and talked to the server and asked if my husband can change it.she was gone for a minute and came back saying \" we cannot change it coz he already touched the food\"\nWe were like thats the point because the food was garbage!\nThis restaurant has bad service, bad food and the restaurant smelled bad too.\nWe are never ever coming back here"
        }, 
        {
            "index": 166, 
            "rating": 4, 
            "review": "We came here after the Thai restaurant we were planning to go to didn't open for a half hour beyond their published time.  That's what's so good about living in a city where there are hundreds of choices.\n\nI ordered the Green curry with pork--spice level 7 out of 10--and my wife got the Garlic pepper chicken.  We have to remember to tell Asian and Mexican restaurants to leave off the cilantro.  She's one of those strange creatures who doesn't like cilantro.\n\nBoth dishes were very good and the spice level of 7 was great!  Perhaps I could have pushed it higher, but this had a good zing and only a few small tears showed themselves.\n\nWe ended the meal each having a scoop of ice cream.  I had the mango and Andrea had the coconut.  Mine was very creamy and tasty and hers was, too--I finished hers.  Win- win!\n\nService was just wonderful.  A couple of people took our order, delivered food, brought iced tea refills.  It was a team effort.  That earned them the 4th star."
        }, 
        {
            "index": 167, 
            "rating": 2, 
            "review": "Where do i begin with this place.....i usually critique the food and the food only, despite the bad service im rating this place completely on the food alone. I ordered the orange chicken lunch special with fried rice for $6.75 And an appetizer sampler. First of all the \"chicken\" was heavily battered. upon further investigation ( me taking apart the breading ) i realized that the chicken is not breaded in house. Its the cheapest mechanically separated frozen garbage ive ever seen. This meal was worse then the chinese food station at the palace station buffet. With an overly sweet sauce dedicated to hiding the \"flavor\" of this so called version of meat. I was truly disappointed. I envision an owner that cares more about food cost percentages then he does about the quality of the food. Batter your own chicken! Chicken is cheap. Very disappointed! Will never visit this establishment again"
        }, 
        {
            "index": 168, 
            "rating": 5, 
            "review": "I'm really picky with a place that mixes Chinese with Thai. Their pad thai doesn't cut it for me, but their Pad See Ew is as legit as the best Thai places. Therefore I like this place. You might have to do some hit or miss tests before you find what suits you."
        }, 
        {
            "index": 169, 
            "rating": 2, 
            "review": "Not impressed. I had the wor won ton soup and shrimp fried rice. Both had way too many onions.  Besides the taste of onion, the fried rice didn't really have much flavor. This was my first time here. I heard a lot of good things. And, most of the comments on Yelp were positive. The place was crowded with both people sitting and eating as well as people getting takeout. Service was good.  I'll try it again and see what happens."
        }, 
        {
            "index": 170, 
            "rating": 4, 
            "review": "We needed a fast dinner so we got delivery from this place.  I got the Laad Naa Seafood Combo (pan fried wide noodles with Chinese broccoli in brown gravy with seafood) for $13.\n\nThe entree was rather large (bigger portion than I expected) and came in one of those black microwavable dish.  \n\nNice rich gravy, nice load of seafood, great taste. Definitely would order form here again the next time I'm in Vegas although some of my friends didn't like their entrees."
        }, 
        {
            "index": 171, 
            "rating": 4, 
            "review": "I wasn't feelin' Thai food but after a weekend in Vegas, the one dollar sign was what attracted me most.\n\nWe had a group of 11 and the restaurant was able to seat all of us at one huge, round table.  We decided to order separately (instead of family style) and I shared with two others.  Between us three, we ordered:\n\n-Tom Yum Soup (with Chicken): I specifically ordered \"spicy\", on a scale of 1-10....10!  It turned out, this Thai joint ain't no joke.  They really hit you with the hotness!  The spiciness I was fine with...but it was too overpowering and left the soup flavorless.  Next time, I'd probably order a 7.  I definitely recommend the Tom Yum Soup here because they give you an abundance of meat and mushrooms!\n-Pad See Ew (with Shrimp):  was decent, but they give you so much shrimp and it's such a good price that you can't not order this.\n\nOur leftovers hopped on the car ride back to San Diego with us and we had it for a delicious dinner.  Two meals for the price of one?  I like.  Great tasting leftovers?  I love!"
        }, 
        {
            "index": 172, 
            "rating": 1, 
            "review": "If you order papaya salad, watch out - it's VERY spicy hot, and they'd only tell you that there are 2 choices - mild and spicy.  We ordered \"mild\" which was sooooooo spicy hot that it brought tears to my eyes (plse note I can take spicy very well). I talked to the server, who then said \"oh, you should have ordered a non-spicy one\". And refused to take it back.\n\nSo they expect the customers to do their job???? What the heck are the customers supposed to know that they offer a non-spicy, in addition to \"mild\", and \"spicy\"???\nThe POOREST customer service we have ever seen!\n\nEat here at your own risk!"
        }, 
        {
            "index": 173, 
            "rating": 5, 
            "review": "When you want that authentic Chinese & Thai food, there's no place in Vegas (well maybe a few) that can top this one. Excellent food, large selection on their menu and the service is excellent, see my pictures, that speaks louder than words!"
        }, 
        {
            "index": 174, 
            "rating": 1, 
            "review": "Terrible service. You will wait forever. Half of staff will avoid eye contact. Some of them quite rude and need good training from someone who really know \"customer service\" badly."
        }, 
        {
            "index": 175, 
            "rating": 4, 
            "review": "Besides the fact they take awhile to bring your food, I love this place. Me and friends come here all the time when we're craving Chinese food. Delicious !!"
        }, 
        {
            "index": 176, 
            "rating": 5, 
            "review": "The best Pa Nang Chicken Curry ive ever had!!! Off the strip, cheap, and amazing food."
        }, 
        {
            "index": 177, 
            "rating": 5, 
            "review": "This place is great! My boyfriend had just recently come back from a trip to Asia, so he was craving some thai food one night. We decided we would order from here, after reading some reviews. We ordered the pad thai, fried rice, and the BBQ pork soup. We were initially impressed because we live about 20-30 minutes from this place (depending on the traffic) and they delivered with no problem! When the food came, we were even more impressed. The rice, soup, and pad thai were delicious and came in very generous portions. The BBQ pork soup was available at any spiciness you desired, on a scale of 1-10. We love spicy food, but we were nervous to go too spicy, so we ordered a 4. Well.... a 4 is HOT, very very HOT... but delicious! the flavor was great, but I would definitely recommend not going too high with the spiciness!"
        }, 
        {
            "index": 178, 
            "rating": 5, 
            "review": "You know that place youre looking for in Vegas that reminds you of home? This is it! Ive never had anything bad, they deliver almost anywhere in Vegas it seems, and pricing is pretty reasonable for the amount of food you get. The chicken fried rice is my favorite!  I recommend this to everyone who asks."
        }, 
        {
            "index": 179, 
            "rating": 5, 
            "review": "Favourite Thai place in Vegas!"
        }, 
        {
            "index": 180, 
            "rating": 1, 
            "review": "Food is inconsistent. Staff is rude on the phone. Food comes cold so we called to speak with the manager and the lady talks back to us. And we get put on hold for another 20 min. Then the manager actually asks if we want another one. Really?? Um, yes that would help. Then we wait another 30 min. Rediculous!!"
        }, 
        {
            "index": 181, 
            "rating": 4, 
            "review": "It was a long evening and a few of us were starving! We were very glad that this place has late hours and there were SO MANY items to choose from on the menu. The best part was that the tom ka soup came flaming so it was kept warm while we were eating. Service was fast, portions were huge - the deliciousness went on for another meal!"
        }, 
        {
            "index": 182, 
            "rating": 4, 
            "review": "My Fiance and I were looking for a Christmas Story style Chinese Restaurant for our Christmas dinner. Kung Fu delivered with truely authentic Asian delicacies and personnel.  If we had asked them to sing a Christmas Carol or chop the head off of a duck at our table I bet they would have. \n\nWe knew we were at a great Asian restaurant when we looked around and noticed we were the only two non Asian people in the place. A few others came in later but knowing their own culture embraces the restaurant got us excited.\n\nWe weren't disappointed. All four dishes had wonderful flavors and aromas. They tasted very fresh and flavorful. The portion sizes were considerable so trust me you will be taking some home.\n\nParking did stink but if you can find a spot you won't be disappointed having to park down the block and walking a block or two."
        }, 
        {
            "index": 183, 
            "rating": 3, 
            "review": "They weren't very good 1-1/2yrs ago when I visited Vegas and ate there but maybe better now."
        }, 
        {
            "index": 184, 
            "rating": 4, 
            "review": "Needed delivered food due to a knee injury and was looking for a soup high in collagen so my first thought was something Asian. A cab driver had just recommended this place 3 days before. They have Beef Tendon Soup so I knew that would be perfect (I'd never had it). When I saw online ordering- whoohoo! No language/accent barriers with ordering . I also got Jumbo Shrimp Curry and Tom Yum Mixed Seafood Soup, and my daughter got Orange chicken and egg roll. What a great meal and the delivery time was fast. It exceeded  my expectations and I absolutely loved the curry, and the soup was also very good. We'll definitely be repeat customers."
        }, 
        {
            "index": 185, 
            "rating": 3, 
            "review": "Located in Chinatown in Las Vegas in a little strip mall. My family always makes a stop here on our annual Christmas Vegas trip before we feast on buffets after buffets. The food is okay.. they have a lot of options for family style. We always order well over 10 dishes since we come in a big group, which gives us a lot of variety. Some items worth trying are the beef salad, chicken larb, spicy cat fish, and minced chicken."
        }, 
        {
            "index": 186, 
            "rating": 4, 
            "review": "We went to our favorite restaurant in China town in honor of the Chinese New Year celebrations going on downtown over the weekend. I have to admit, I was disappointed that there wasn't a special offered or some type of unique meal for the occasion. But none the less, we all decided to try something different than our \"norm\" on this trip and it was Tom Yum Soup with Shrimp - we've always seen and admired it at other people's tables, so decided to give it a try. On the scale of spice, we asked for medium. I'm not much of a spicy person - medium turned out to be way too much for both my mother and I. In fact, my sister, who loves spice, tried it and it was way too much for her. It ended up ruining our dinner this night. My lips were numb from my small sampling of it and I couldn't taste anything more the rest of the night.\n\nWe were surprised that it wasn't crowded when we arrived, however, by the time we left almost every table was filled. Although I've given the restaurant four stars, this night didn't really deserve a one star. It took 30 minutes for someone to take our order. Others arrived after us, received their food before us and were on their way out the door as we were finally being served our main course. For me - this is an automatic negative review for me unless circumstances occurred causing the delay. But this was before the place got really busy. It took another 30 minutes after we were done to have our table cleared and ask for the bill. And another 15-20 minutes after receiving the bill to flag someone down to take our payment. I think we only saw our waiter once the entire night. The rest of the servers were people we had to flag down for one reason or another. \n\nAlthough the soup ended up ruining the rest of the meal, I can tell you the food there has always been wonderful! Appetizers of Crab Rangoon, Calamari, Wings (really good), Satay and combo platters have always been tasty. We make it a must to have at least one appetizer each time we go. The Pad Thai is really good - they even give you a choice of the type of noodles to have with it. Mongolian Beef is awesome! So is the Ginger and Pepper Pork/Chicken or Beef (we've had one of each). Egg Fu Young (whichever type you have) is moist, delicious and so flavorful. Overall - we really love the restaurant. Just wasn't at its best this past Saturday evening."
        }, 
        {
            "index": 187, 
            "rating": 1, 
            "review": "If I could give them -10 stars I would.\nWe arrived at 2:35pm order from the happy hour(it's until 3pm) menu on 2:40, at 3:05 the server came back says that he can't serve lunch spacial anymore-AFTER 30 min that we are waiting!!!!!!thats their new trick!\n\nSo we order from the regular menu,the food came dry and I found 2 hairs in my Mongolian beef+it was so chewy like a rubber.\nI used to come here a lot and that was my first time after 9 months. This place change and become with tricky services,low quality of food and not clean at all. \nBetter for the health dep to test this place soon as they can!!"
        }, 
        {
            "index": 188, 
            "rating": 5, 
            "review": "Best thai food ever!!! OMG....ive been craving this place ever since I left!  Pad Thai, Pad See-Ew, Garlic Pepper Pork, Fried Rice, everything is amazing!!!  Service is not so great, but that disappears when you taste their food!  I will definitely return here every time i come back to vegas!!! :D"
        }, 
        {
            "index": 189, 
            "rating": 4, 
            "review": "This is a great place to have your quick fix of Thai and Chinese food! It's in Chinatown off of Valley View facing the 4 way stoplights. I went with my good gf and we had a quick lunch break to chat and enjoy good cheap eats! This was the lunch time and considering it being the peak time where people from office or casinos have their lunch break most restaurants were not open? It was odd so we knew that Kung Fu had never let us down and was great to eat. We had the lunch specials where you can have a soup, egg roll and chicken wing with steam or fried rice and an entree of your choice. The entree was either Chinese or Thai to choose from. And the order was quick and fast. There were several patrons there on their lunch break too and looked like they were having the lunch special too?! It's only $7.25 and anything other than the lunch special depending on the entree should be around $7 and up. They also deliver! That's an added Plus when you can't get out of the office and or job. Super recommend!"
        }, 
        {
            "index": 190, 
            "rating": 5, 
            "review": "This place has THE best Thai food in Nevada and California!  Everything here is done just to my liking.  The chefs just must be trained well.  My favorites:  pad thai with prawns; ong choy; minced chicken with garlic and basil (it's called mint, I think, but it's basil); Tom Yum soup; green papaya salad (though I like to order it with less sauce and salt, sometimes it's too saucy and salty).  This family-owned restaurant is run by a nice family and Mrs. Wang always says hi to me when she sees me.  I sure am missing this place because I haven't found a Thai place I like in the Bay Area yet."
        }, 
        {
            "index": 191, 
            "rating": 3, 
            "review": "I guess if you have a Thai craving in LV, this would be the place to go. \n\nThey're actually a mixture of Thai, Chinese and Laos.\n\nI dined here back in January and I can't really remember anything exceptional about this place except I enjoyed the papaya salad.\n\nIts your typical Chinese/Thai food restaurant. It's better as family style rather than individual meals, so sharing is caring folks!\n\nI'm sure we will be back whenever we hit Vegas up and we're not at the buffet. LOL."
        }, 
        {
            "index": 192, 
            "rating": 4, 
            "review": "Cant deny food is amazing service is horrible!  Always a wait even when slow n called in they'll say 15 when really 30 for to go takes forever for someone to acknowledge but price is good and food I'd great when correct"
        }, 
        {
            "index": 193, 
            "rating": 4, 
            "review": "There was a little mom and pop Thai restaurant in my hometown of Houston that had the absolute best Pad Thai Chicken. They closed a couple of years ago and I have been on the hunt ever since for that same experience. I have found it here! And when I ask for extra spicy they never disappoint. A good compliment is the Hot and Sour Tofu soup. I have tried a couple of other dishes as has my wife and they are all good. A must if you love Thai food."
        }, 
        {
            "index": 194, 
            "rating": 3, 
            "review": "Food looks nothing like the pictures online. My zucchini was watery, and the breading was terrible. I asked for marinara with it. I didn't get that. The general tso chicken is not saucy and tastes like plain chicken. Again, these two dishes look absolutely nothing like the website photos. See my photos for comparison. The white rice and lo mien were good. Delivery was on time. Overall, I didn't get my marinara sauce, extra soy, or extra duck sauce that I asked for. The duck sauce is very very sweet and dark in color. I wouldn't order again."
        }, 
        {
            "index": 195, 
            "rating": 1, 
            "review": "After the high  reviews, we decided to eat at this restaurant. We were seated pretty quickly and the atmosphere seemed nice, which led us up to high expectations. After waiting for ten minutes to get our drink order taken, we were greeted by the rudest server ever. He kept getting our order wrong and had to repeat several times. Two of our plates  came out in a timely fashion, but we waited for all plates to come out so we could all eat together. Not an unreasonable request. 30 minutes of waiting for the rest of our order and our waiter hadnt even come to check on us. There had been 3 parties seated and served in the time that we were waiting. After 45 minutes of waiting for the other 4 plates, we asked the  waiter if we could just pay for our drinks because we weren't  going to pay for food we hadnt receieved. Somehow they magically had two more of our plates ready as we were standing up to walk out.  The waiter first tried to ignore our request, then hid in the kitchen. We were very calm in out request and just kept getting blown off. A lady came out of the kitchen and shook her hand at us as to dismiss us. Thats when our waiter came out with our checks for our drinks. \n\nWe paid for our drinks and left. \n\nAs you can imagine, we wont be returning. What a disappointment!"
        }, 
        {
            "index": 196, 
            "rating": 4, 
            "review": "This is a staple lunch place. They have Thai and Chinese on the menus, though I've never had the Thai. The lunch specials are good, quick, and very price worthy."
        }, 
        {
            "index": 197, 
            "rating": 5, 
            "review": "Great food, growing up around Chinese food, I can say this is so much like home flavors. Love it."
        }, 
        {
            "index": 198, 
            "rating": 4, 
            "review": "I am definitely a fan!!! And they deliver! I'm a huge fan of places that serve white meat. The orange chicken is amazing! Pad Thai, amazing! Thank you! Can't wait to have it again this week!\n\nUpdate: Just had this again, yup! Still great!  Mongolian beef was soooo good! I love places that have good quality meat. That's hard to find around this area."
        }, 
        {
            "index": 199, 
            "rating": 2, 
            "review": "I ordered a meal to be delivered at 7:00pm.\nAt 8:00 I called to check on the status of my meal. They said a driver was heading out with it. At 9:00 I called to check on the status of my meal, they said a driver was out with it. At 9:45 I called to check on the status of my meal, they said a driver was out with my food. \n\nOn pressing them, they asked the driver (Who was actually at the restaurant), and then insisted several times I had signed for the food. When I sternly pressed that I had not received the meal, they had put the driver on the phone. The driver immediately described the wrong house and gave me my neighbors' address (The store owner had the right address, which was not my neighbor.)  The driver then suggested, an hour after he had delivered it, that I should go to my neighbor's house and ask for my food.  \n\n  After having ordered here for at least five years, I would have at least hoped for a discount or a free appetizer. They charged me full price for the meal and offered to remake it and redeliver.  I think most people would have declined the charge outright.  \n\nI hope they manage to sort out their drivers. Almost four hours for a meal is insane. Furthermore, they did not deliver the correct drink. Whatever they brought was orange and sincerely undrinkable, at least to me.\n\nThe food itself is excellent, Garlic Pepper Beef is an absolute favorite of mine and the Crab Rangoon is delicious."
        }, 
        {
            "index": 200, 
            "rating": 1, 
            "review": "Parking is a complete nightmare... \n\nWe walked into an almost empty place, and were ignored.\n\nAfter waiting for a human being to acknowledge us,\nWe were then seated at a filthy table. \nThe top was sticky, and there was food all over the seat cushions... \nWe flagged someone down, and they wiped it down.... Half @$$ed, that is. \nI say this because half of the booth still had food on it,\nI love my husband, but we were sitting uncomfortably close to avoid sitting in someone else's dinner.\n\nTheir menu has 600 items...Ridiculous. \nit looked more like a Harry Potter novel then something that should have food items. \n\nWaited forever for a server to get us glasses of water, \nhe dropped them off and then walked away, \ndidn't even ask us if we wanted anything else to drink.\n\nTasted the water and walked out.\n\nWon't be back."
        }, 
        {
            "index": 201, 
            "rating": 4, 
            "review": "I always order the beef with brown sauce. Very yummy! And their combination fried rice is also very yummy!!!"
        }, 
        {
            "index": 202, 
            "rating": 1, 
            "review": "I hate being lied to.\n\nThe food there is good; not any better than any Thai place in town and a little worse than Komol and Lotus of Siam, but OK.\n\nThe service is sub-standard, but not glaringly so.\n\nThe wait times for food is unusually long; perhaps because they are trying to get you to drink more.\n\nBut they lie.\n\nFirst off, never ever ever order order for pick up.  They will wait for you to show up to begin making it so you do not cheat them by a no show.  They will lie to you when you get there and say it \"almost done\" and immediately run you card, and then you will wait between 30-40 minutes for the food.\n\nIf you call and get them to promise they will make it and it will be waiting hot, they will still lie, and say they will.  And they will not.\n\nThis happened to me 4 times before I gave up on them, as they are the closest Thai place to my home and therefor a logical choice if we want a quick dinner.\n\nThen we went to do deliveries at our home from them, as they we the only Thai place that we could find that delivered.  A guy came for several times, we paid a good tip and there were no issues, and then, out of the blue, the person answered the phone told us they they could not deliver to our area, it was \"too far.\"  When we pointed out to them that they had delivered several times before, the person on the phone informed us categorically that they had never delivered to that area and accused us of lying.  We shrugged, figured we had someone new or crazy or what not, ordered someplace else and moved on.  A few weeks later we tried to order again, a different person answered the phone and again categorically informed us they had never delivered to the area where our home was located.\n\nA change in policy because we were too far away . . . fine.  But it doesn't sit with me well how easy and enthusiastically they lie.\n\nTheir food ain't bad, but it is not worth putting up with their service or their lying."
        }, 
        {
            "index": 203, 
            "rating": 4, 
            "review": "Have some late night in Las Vegas yesterday.  Just a wonderful staff and excellent tasty dishes.  I ordered Beef fried rice, chow fun, tom yum, and other side dishes.  Would definitely come back here."
        }, 
        {
            "index": 204, 
            "rating": 2, 
            "review": "Delivery was fast thats the only reason for the 2 stars, food was about a 1.\n\nPad thai seemed like the noodles were cooked yesterday, the veggies seemed like most came from a can and what was fresh was brown and wilting, the soup seemed way to sour, like it was about to turn. What a waste of 30$$"
        }, 
        {
            "index": 205, 
            "rating": 5, 
            "review": "Delicious food, great service and would definitely recommend the Mongolian Beef and Egg Fu Beef! Got pick-up and everything was project!!"
        }, 
        {
            "index": 206, 
            "rating": 5, 
            "review": "They have pretty long vegetarian menu.\nI lie them, very good service and food :)\nAmi is very nice server.\nThe restaurant look expensive but is very good prices.\nThank you..."
        }, 
        {
            "index": 207, 
            "rating": 4, 
            "review": "The wait to get in wasn't too bad. Once we were seated, we were quickly given water and ignored for the next twenty minutes. He waiter finally came and apologized for the wait. The drinks and food were really good. The pad Thai was great. I tried the mekhong, a Thai liquor, and liked it a lot. Their wine is vastly overpriced,  but it usually is when you go out anywhere. They let you add your own spice level at the table, which is much better than having to guess which number you would want. Overall, I would recommend this place."
        }, 
        {
            "index": 208, 
            "rating": 5, 
            "review": "After being dissatisfied with buffet asia we decided to finally try this place, best decision ! Very clean and attentive and also very quick. The food was amazing definitely going back !"
        }, 
        {
            "index": 209, 
            "rating": 2, 
            "review": "1. service was quite slow for an asian place\n\n2. flavors were dense (pad thai and pad see ew were okay. Tom Kha Coconut soup, ive had better. Combination FR and BBQ Chow Mein, i rather eat my parents)\n\n3. water was refilled quite fast \n\n4. the name of the restaurant? kinda silly\n\n5. thai dishes were better than their chinese dishes\n\n6. menu was large enough to feed a whole country\n\n7. lastly, a couple sitting to the right of us were singing to each other.. my group of 9 were disturbed"
        }, 
        {
            "index": 210, 
            "rating": 1, 
            "review": "I write this review having only ever had their food delivered...maybe the experience is far different should you dine in.\n\nWe had delivery for the third time the other evening and it will be my last. It took three different pieces of sweet and sour chicken to find the chicken! Sesame chicken was not trimmed correctly so small bones/tissue completely ruined it. Thai soup only so-so and the fried rice barley passable. Other dishes in the past have also fallen short.\n\nThai food for delivery not worth it with so many other options in town and Chinese food consistently below par. Really wanted to like this place as the are reasonably priced and delivery is always quick but alas I cannot.\n\nSorry Kung Fu Plaza."
        }, 
        {
            "index": 211, 
            "rating": 4, 
            "review": "QUICK : INEXPENSIVE : GOOD PORTIONS\n\ni've eaten at kung fu's on several occasions, usually with the bf's family cuz they enjoy the asian style restaurants more so than the vegas buffets. \nkung fu's offers a vegetarian menu which is convenient for those non meat eaters. and for those who like it spicy, there's a range of spiciness from nothing to flaming hot. i like kick to my food and mild was good. if you like it hella spicy then go for it, but they aren't jokin' around. \nthe waiters are really friendly, helpful when ordering and give feed back about dishes/portions if you ask. \ntheres a lunch time menu... seems like a good bargain, but the individual plates are good too, especially if you wanna go family style. there's not a lot of people on a normal basis, but there is a good crowd.\n\nsuggestions:\ntom yum soup (vegetarian and non-vegetarian) - both great\nduck soup - good size for a 1 person meal\npapaya salad (vegetarian/mild) - good kick, they do give more cabbage than i would like (i HATE cabbage)\nvegetarian egg rolls - ok, comes with rice and i didnt really enjoy their version of sweet and sour sauce (kinda oily texture to it)\npad see ewe - nothing special, same as any other place\n\ni can't recall the other things that was ordered cuz everyone pretty much picks like 5 dishes each and we all share... yes we are pigs... \n\nfor 2 people we spent $40, BUT we had left overs for another meal\nfor 20 people we spent well over several hundered $$$$$ but like i said, we are OINKERS...."
        }, 
        {
            "index": 212, 
            "rating": 5, 
            "review": "Enjoyed the Mongolian Beef based on a friends recommendation and was not disappointed.  Service was so outstanding the water in our glasses appeared full the whole meal.  Business has been around for 42 years and now I know why.  The owner greeted us halfway thru the meal and couldn't believe it was my first time to visit her establishment.  She informed me all dishes are made to order with an option on every dish of 1 to 10 on how spicy you like it.  You can definitely taste the difference in the pride and quality of the food and service.  Will be back again!!"
        }, 
        {
            "index": 213, 
            "rating": 1, 
            "review": "Bad service ...I placed a order they gave it to a bigger party ....the manager said sorry ....I order once more from them so it happen again ....."
        }, 
        {
            "index": 214, 
            "rating": 4, 
            "review": "This was me and my boyfriends first time eating here! I tried Thai food and he stuck to Chinese. I ordered Pork Thai and broccoli (not the actually name) and it was great. The house's sauce was a bit sweet, and it kind of over powered the dish; that's why I give this review a 4/5. There was just too much sauce!\n\nOverall, the food was delicious and we'll probably be back! Thank you!"
        }, 
        {
            "index": 215, 
            "rating": 5, 
            "review": "The food is absolutely amazing ! The service is just as great. Attentive and friendly staff ."
        }, 
        {
            "index": 216, 
            "rating": 4, 
            "review": "Kung Fu has one of the best lunch specials in Vegas. For $5.95 you get soup, an entree with steamed or fried rice, an egg roll and a fried chicken wing from 11-3pm.\n\nThe rest of the menu is very exhaustive including Thai and Chinese dishes. The hot pots of soup are intense and delicious, better for parties of 3 or more.\n\nThe food is rich and flavorful and none of the staff speaks much English*, which means the cook are Thai and know what they're doing.\n\n*In an effort to not sound offensive, if you want people to speak perfect English get some generic food from Panda Express."
        }, 
        {
            "index": 217, 
            "rating": 5, 
            "review": "I was surprised to see all the negative reviews here! My husband and I dined here after we discovered Lotus of Siam was closed between 2:30 and 5:30pm. We ordered Crab Rangoon/Wontons, Mongolian Beef and Shrimp Pad Thai between the two of us. They also serve a small selection of alcoholic beverages.\n\nOur food was amazing! And the service was fast. I did have to point out to our waiter which white wine I wanted on the menu so maybe communicating your food order over the phone could be tricky. But the fact that they offer online ordering should resolve this problem. AND, do you want authentic or not?! The hostess and our waiter were very pleasant and professional. \n\nLastly, we saved a lot of money getting off the strip. We will definitely return!"
        }, 
        {
            "index": 218, 
            "rating": 1, 
            "review": "First time and last experience here. We ordered Thai fried rice and Pad Thai. The fried rice was oily and lacking flavor. Pad Thai was nothing but peppers and bland. I've had better Thai food on my side of town, I.e. Pin Kaow and Thai House. Even Panda fried rice than this place. Sorry Panda. \nPoor customer service as well. \nJust because it's a great location with guaranteed traffic doesn't give you the right to produce mediocre food."
        }, 
        {
            "index": 219, 
            "rating": 4, 
            "review": "Been going here for years. Great authentic Thai food! My favorite dish to order here is Pad Thai, they use slightly thinner noodles....what a difference!  If you like Thai food then go here! Only downside to this place is sometimes you receive less than stellar service, but that doesn't stop me from going."
        }, 
        {
            "index": 220, 
            "rating": 1, 
            "review": "Our very asian looking dealer at the Rio Casino told us to come here for good thai food. I thought, GREAT! A local recommending a good thai restaurant - it MUST be good. she also recommended the stuffed fried chicken wings which also sounded bomb.\n\nGPSed this place and went with 4 other people. I first looked for the chicken wings under appetizer and found it: Stuffed fried chicken wings (2). WHAT THE HELL. 8.95 for 2 wings? Whatever, we ordered it anyway since the dealer recommended it. I ordered the laad na with beef (flat noodles topped with gravy sauce with beef), my bf ordered the pad thai with chicken, my other 2 friends ordered pad see ew with chicken, and the other ordered roast duck over fried rice.\n\nFirst of all, let me just say, it took almost half an hr just for the waitress to come to our table to get our order. Second, it took another 45 min for the food to come. The thai ice tea came out pretty quick though and was pretty tasty.\n\nThe stuffed fried chicken wings came out first. Man, that was a small portion. We all took 1/5 of the wing and it was mediocre.\n\n30 min later,  My laad na was finally came and was DISGUSTING. I dont think ive ever had nastier laad na than this place. It was bland, the noodles were not pan fried at all, and the beef was dry and overcooked. My bf's pad thai was soso. The pad see ews came with 90% noodles, 5% veg, and 5% chicken. The duck fried rice looked disgusting also. I think the only tasty item in this restaurant is their thai ice tea.\n\n-2 for food, - 2 for service, and +1 for thai ice tea."
        }, 
        {
            "index": 221, 
            "rating": 2, 
            "review": "Came here around 9 and it was sorta empty on a Saturday night or maybe people were celebrating chinese new year?\n\nAnyways, service was slow when there was only 4 tables that were being served. \n\nOrdered the medium tom yum soup with big flat noodles ( loved it!!!!)\n\nBeef fried rice- the beef taste burnt but the fried rice was good.\n\nLast- tofu with basil.  Soggy and was drenched in too much garlic sauce!  (not that great!)\n\nI've been here 3x and the more I come here, the worst the food gets!\n\nIt's better to come here for the soup only!"
        }, 
        {
            "index": 222, 
            "rating": 5, 
            "review": "I have to come here every time I visit Vegas. It's off the strip, so if you're feeling lazy, they deliver right to your hotel! (with a $5 charge which is so worth it if you're hungover/tired/etc). They take about 45 minutes to an hour.\n\nI always get the Tom Yum Shrimp. NO MATTER WHAT. and you can get the level of spice. I am a huge spicy food fan so I always get 7/10. \n\nThe restaurant has many different dishes to choose from- thai and chinese. So you will get your fix if you're craving something savory. \n\nAnd of course you can't forget the fortune cookies they generously pack :)"
        }, 
        {
            "index": 223, 
            "rating": 5, 
            "review": "If you're in Vegas for any length of time and you're looking to order in!  I would highly recommend this venue to anyone!  The food is ome of the most consistent that I've ever had and the service is second to none!\n\nI've never dined in, but each time that I've ordered takeout it's been nothing less than outstanding\n\nenjoy!"
        }, 
        {
            "index": 224, 
            "rating": 1, 
            "review": "Awful service, poor hospitality, poor managment, extremely  poor quality of food. Portions sizes of meat not even enough to satisfy a rat. Communication skills were horrible. Do not go to this place definitely do not recommend."
        }, 
        {
            "index": 225, 
            "rating": 5, 
            "review": "This is one the best restaurants ever!!! No only is the food good but the service is great! Staff is very polite and restaurant is very nice and clean! My favorite dish is the orange chicken! I definitely recommend this place to everyone!!!!"
        }, 
        {
            "index": 226, 
            "rating": 1, 
            "review": "After driving around in search of a Chinese restaurant, we decided on this place. This place is hood!! It's extra ghetto inside with the worst service ever. I really can't complain though when the dishes are soo cheap. The food just wasn't good. In fact, I would say it's pretty disgusting. I ordered a broccoli and chicken dish, and the chicken wasn't fresh at all. I was actually scared to eat the meat!! Everything inside was sticky, dusty and dirty. They definitely need a makeover with the decor, food and service."
        }, 
        {
            "index": 227, 
            "rating": 4, 
            "review": "Food is yummy. Coconut soup is my go to. Great portions. Decent prices. I LOVE their Thai tea. Cool place to eat with friends or a date :)"
        }, 
        {
            "index": 228, 
            "rating": 5, 
            "review": "Huge menu selection of Thai and Chinese food. This place was busy for 9p and continued to be busy until we left around 10:15p. The staff was extremely friendly and polite! I had their Chicken Satay. This was very filling and came with a small cucumber  salad. They had vegetation options for my friends. These dishes were excellent! I wanted dessert but it was getting late for the kids in our party! This place is super easy to find: on the corner of Spring Mountain and Valley View!"
        }, 
        {
            "index": 229, 
            "rating": 2, 
            "review": "I dunno, maybe I didn't order the right thing. The vegetarian selection had the standard dishes but the dish that caught my eye was the Mongolian tofu. We also ordered the fried spring rolls, papaya salad and a glass noodle soup.\n\nThe Mongolian tofu dish was deep friend tofu cubes which I normally LOVE, but it was soggy and oily. The 'mixed veggies'  with it were very sparse. The sauce was so-so.\n\nThe spring rolls and papaya salad were decent... no better than other places.\n\nThe veggie glass noddle soup was a load of noodles in a tasteless broth with lacking veggies.\n\nP.S. I thought about a return visit to try other dishes but I would much rather go to Komols, Ping Pong, Hue Thai or Veggie Delight. Always good."
        }, 
        {
            "index": 230, 
            "rating": 4, 
            "review": "Adequate service, they could have tried to be at least more attentive. I even asked for those 4 chili sauces from one of the waiters and I still didn't even get it when my table and I finished our food. And we had to seat ourselves in because they weren't even paying attention to is near the entrance. But I must say, I've tried Thai restaurants from both California and Nevada and this place has good food, the dishes here are so perfectly seasoned, there is no too sweet, too plain, or too salty or not enough saltiness. Probably coming back again when I visit Las Vegas."
        }, 
        {
            "index": 231, 
            "rating": 5, 
            "review": "We just moved away from Las Vegas and if there was one restaurant we could take with us it would have been Kung Fu, no doubt. We're having at the moment Kung Fu relapses! This place was the best and I mean THE VERY BEST!! When it came to Thai food, there was one other place we enjoyed but we always went to Kung Fu though instead. As for Chinese and you could say Thai food  as well that when we left Kung Fu we would never have the aftermath horror of like that horrible feeling in our stomachs when the food is laced, injected, bathed or drowned in MSG and it's as if you ate something good but when it hits your stomach it metamorphisizes into a few bricks. We were NEVER, NOT ONCE disappointed with the food as well the great service we received here, the food always seemed fresh, no MSG aftermath horrors and the waiters were always polite and kind. Such an impeccable place that we will definitely miss. No wonder they've been open for so long, it shows and you can tell by how delicious the food is, we will not forget this place."
        }, 
        {
            "index": 232, 
            "rating": 5, 
            "review": "The name doesn't sound like a good/authentic Thai place. But I have to admit this place served the best Thai I had ever had. I had tried Thai in many places such as Toronto, London (UK), Malaysia, Hong Kong, Singapore - this is by far the best Thai!! We ordered Mango salad, Tom Yum Soup and Pineapple Fried Rice. We ended up finishing everything on the table! I will go back to Vegas one day just for this restaurant!"
        }, 
        {
            "index": 233, 
            "rating": 4, 
            "review": "We ordered carryout for a party of 6. After waiting 45 minutes for delivery it still hadn't arrived and after 30 more minutes and numerous calls to the restaurant and driver our food finally arrived. The food was phenomenal but it would've been nice to be compensated for the wait time or at least them called us to say sorry driver was lost instead of us having to find out what the hold up was. If our food was delivered timely we would've given 5 stars. It was that good!"
        }, 
        {
            "index": 234, 
            "rating": 4, 
            "review": "Food a solid 4 stars, leaning higher.  Excellent tom yum seafood, fried chicken wings, and a plethora of vegetarian entrees with great variety.  Service a bit slack, and DANGER! the bar is *terrible* (we were served a watery margarita and an undrinkable bloody mary) so stick to bottled beer!"
        }, 
        {
            "index": 235, 
            "rating": 3, 
            "review": "Family style ordering and a vast menu of Chinese, Thai, and vegetarian dishes - great for families/bigger groups!  Though I did notice that the restaurant was packed with a diverse crowd of non-Asians.  Therefore, I have mixed feelings about this place because food is good, but being in the heart of Chinatown; I'm certain there are better options/hidden gems around the same price range. \n\nWe didn't love the broth of the vegetarian Tom Yum Kha soup bc it lacked coconut milk. From the reviews, it seems like the non-vegetarian version is the way to go.  Our main dishes were much better, getting usuals like Pad Thai, Chinese Cabbage, and Beef & Broccoli.  Spice levels range from 1-10.\n\nPs. bathroom lines can get as bad as a theme park wait because there is only one bathroom per gender."
        }, 
        {
            "index": 236, 
            "rating": 4, 
            "review": "My husband isn't the type who likes to try new places, but he has been a lot more open to the idea lately. I have been coming to Kung Fu Thai & Chinese Restaurant for years and love it, so I convinced my husband to try it out. He is a fan now!! Their Mongolian Beef is the best in town and their service is great. The prices are affordable and the food gets to the table within minutes of ordering."
        }, 
        {
            "index": 237, 
            "rating": 4, 
            "review": "I used to live within walking distance to this place, so it was one of my go to places! For Chinese though, not so much Thai with one of my favorite Thai places across the street. Awesome prices, especially for lunch, and decent food. It's not at the Joyful level in terms of quality but Kung Fu with definitely 'get er done!'"
        }, 
        {
            "index": 238, 
            "rating": 1, 
            "review": "This absolute &@\"-&!?&@ of a restaurant decided it would be smart to close the restrooms for over 20minutes while patrons waited to use the restroom during their evening dining hours. I insisted after 20 minutes to use it. They finally let me use it and what's funny is that nothing was unclean and also after making a slight scene one of their workers suddenly decided to roll a mop bucket toward the restrooms at that time.  Unsure what all that was about it but I suggest any and all of Vegas and visitors to never patronize this place."
        }, 
        {
            "index": 239, 
            "rating": 3, 
            "review": "First timer. It was good compared to China a go go. Fresh food but pricey for the portions. Loved the Chicken Laarb, Tom yum soup and definitely recommend the sweet n sour pork!"
        }, 
        {
            "index": 240, 
            "rating": 3, 
            "review": "The fam & I just checked in to our condo on the strip tired from the very hot drive from L.A.  This was the only place I could find on the book that deliver Chinese food where we are so I took my chances.  I ordered satay chicken, shrimp pad thai, mongolian beef, shrimp Thai fried rice, whole deep fried catfish, chicken panang, papaya salad and steamed rice ( I know it sounds a lot, but I also have the parents w/us), bill came up to $72.  The satay had a good flavor and not dry like some places.  Their menu said the shrimp pad thai and shrimp fried rice comes with plump shrimp ...what we got in these dishes looked very small and not as advertised---very disappointing.  The flavors were good though but they shouldn't have underlined \"plump shrimp\".  The cat fish was very good and almost made up for the shrimp.  The papaya salad had a good flavor but I would have liked the papaya shredded thinner.  Everything else was so-so, I've had better.  My dad liked it for the spiciness."
        }, 
        {
            "index": 241, 
            "rating": 4, 
            "review": "This is a nice restaurant. My family always come here for Thai food whenever we are in vegas. \n\nFrom all the times we have came here, this place is amazing. Its Thai food is very similar to actual Thai food. I can't comment on chinese food though.\n\nMy only complaint is that they put one dish down at a time instead of putting down all the dishes at the same time."
        }, 
        {
            "index": 242, 
            "rating": 4, 
            "review": "Ordered from this place based on recommendation from the front desk at the Hilton Grand Vacations Club. Delivery charge was only $4.00 which beats taking a cab ride to and from the hotel.  We looked at the website and ordered most of the favorites.  We liked the Tom Kha soup, Fried Chicken WIngs and the Chicken Chowmein.  They all tasted good and authentic. We didn't care for the Wonton soup, Mongolian Beef, Eggrolls or Pad Thai.  The Pad Thai was very average and noodles were clumped up together. The Steamed Vegatables with dipping sauce was ok and there was about 8 different vegetables in it.  I would definitely order from here again picking the right dishes."
        }, 
        {
            "index": 243, 
            "rating": 4, 
            "review": "This restaurant was recommended by a Vietnamese gal who worked in a nail salon...we wanted Chinese food so we tried it.  The food was great, service very good and a very ethnic feel to it...many Asians eating there so we felt that was a good recommendation too.  It was great and we'll go back."
        }, 
        {
            "index": 244, 
            "rating": 5, 
            "review": "I go here around three times a year and the service and food are always good and at a decent price.\nI always have the curry, the tofu with it is chewy and soft, and the rice is quite nice and the vegetables that go along with it are very complimentary.\nAll around the restaurant are tiny sculptures and some paintings, which are a bit ornate for a place like this, and are fun to look at."
        }, 
        {
            "index": 245, 
            "rating": 4, 
            "review": "Very accommodating! Our daughter made reservations for her friends for Homecoming and they had no problems with all 20 kids(plus all the driving parents!)  being at the restaurant. The food was good. We got steamed potstickers (will do fried next time) Mongolian beef (oh my gosh the sauce is awesome!) and cashew chicken (just sweet enough to be perfect!). Service was great for a Saturday night with an almost full house! Our waitress was quite attentive and we didn't ever have to worry about refills. Prices were reasonable for the area. We will be back!"
        }, 
        {
            "index": 246, 
            "rating": 5, 
            "review": "One of our favorite places to eat in Las Vegas, hands down. It's bit of a drive from where we live, but worth the trip every time. I haven't ordered a dish here that I didn't like. \n\nThe menu is massive and little overwhelming if you don't know what you want to eat. They offer both Chinese and Thai dishes. My husband and I always have a dilemma when ordering because we want to try new things but also want to order the dishes we love. Hubby always orders way too much food to insure he gets a great lunch the next day.\n\nRecommended dishes: \nPa-nang Chicken- thick curry with coconut milk\nTom Kha Chicken - Lemongrass soup with coconut milk\nPad See Ew - Wide rice noodles in a garlic sauce\nMongolian Beef- you all know what this is..."
        }, 
        {
            "index": 247, 
            "rating": 5, 
            "review": "Love it! my fav is the Thai beef salad.......yum. Anything you order is delish."
        }, 
        {
            "index": 248, 
            "rating": 3, 
            "review": "Please note this review is only for delivery - I've never eaten at the actual restaurant.\n\nTough to review this place on just a * rating, so let me explain:\n\n1) Chinese dishes are Thai-style, so extremely sweet.\n2) Thai food is decent enough to satisfy my fix, but not a lot of variety.\n3) Ingredients (esp. vegetables) seem fresh / good quality. Seafood combo dishes mostly imitation, however.\n4) Portion size varies anywhere from meh to very good; meat ratios vary even more wildly.\n5) Online ordering system is fantastic for convenience.\n6) They deliver fast and have never gotten the order wrong, and reliable delivery is a rarity in Vegas.\n\nYa, probably averages out somewhere a bit above a 3*, but I think rounding up to 4* is a bit too generous especially since I avoid the Chinese food. Despite any negatives, the Thai food is flavored right and that's what counts. With the convenient ordering and reliable delivery, still good enough to make the rotation for our office's lunch delivery."
        }, 
        {
            "index": 249, 
            "rating": 4, 
            "review": "Second time here, food came out very fast on a Saturday afternoon lunch time, pretty dang tasty overall, had a Pa-nang curry, pineapple fried rice, Mongolian beef, chicken pad Thai. We ordered everything spicy, yet still wanted more heat! If you like your Thai dishes spicy, order it at an 11 (out of 10). Maybe you'll get lucky and get that heat we missed out on."
        }, 
        {
            "index": 250, 
            "rating": 5, 
            "review": "I will start saying the restaurant is clean. We were seated right away and our server was prompt to come to our table.. Order was right on point delicious& fresh. The owner even step out from the kitchen and came to our table to greet us. While we waited for our food she share how long her restaurant had been in business. Interesting lady. Overall I highly recommend this place whenever your in town. Hubby and I like to expire the local restaurant whenever we are in town.  \n\nPlace got super busy right before we finish our food"
        }, 
        {
            "index": 251, 
            "rating": 5, 
            "review": "First timer here and I have to say I am pleasantly surprised! We ordered chicken pad see ew and the sweet green curry with chicken. \n\nThe pad see ew was so good, I really liked how some of the noodles had a crunch to them because they were stir fried and not over cooked. And the curry was pretty amazing. Don't order if you can't take spice because the order comes precooked with spices so I ordered little to no spice and it had a kick to it but I didn't mind, still tasted awesome. \n\nAt first the dishes looked so plain and unattractive, not like other Thai restaurants but once I tried the food I was blown away! \n\nI guess that's how you know a restaurants Chefs and ingredients are amazing, when the dishes look so plain but have amazing flavor! Not drenched in typical sauce packets like Thai house or lucky Thai. I'm really happy I tried this place out."
        }, 
        {
            "index": 252, 
            "rating": 4, 
            "review": "Their food was absolutely delicious. The only reason i didn't give the 5th star was that it TOOK OVER AN HOUR TO DELIVER and we are about 10 minutes away. I ordered the Bean Sprouts and Jumbo Shrimp with jasmine rice and my coworker ordered the lunch special Orange Chicken and Fried rice. No complaints here and i will order again."
        }, 
        {
            "index": 253, 
            "rating": 4, 
            "review": "One of the best Thai restaurants I've ever been to.  Every time we're in town, we make sure to eat here at least once.  We've even ordered to go on our ride back to Cali a couple of times.\nThis is what we usually order and have never been disappointed:\n\nPapaya salad w/ salted crab - THE BEST\nTom Yum Goong\nPad Se Ew seafood\nBeef noodle soup\nHouse fried rice\n\nCan't wait to go back in April!"
        }, 
        {
            "index": 254, 
            "rating": 5, 
            "review": "This is our second trip to Las Vegas in the last two weeks, and our second trip to to the restaurant. We were actually looking forward to coming back here this week when we found out we had to make a return trip up here so soon. The Thai food here is absolutely wonderful! The staff is kind and the food is served pretty quickly and is just so satisfying. I'm sure this will be a regular stop for us every time we are in town."
        }, 
        {
            "index": 255, 
            "rating": 5, 
            "review": "I'm visiting Vegas for a convention. Unfortunately, my hotel is off the strip and with 104 degree temperatures the last thing I wanted to do was go back out in the heat for food. Did an Internet search for places that deliver. A million pizza joints, but I wanted something different. Came across some good reviews for Kung Fu so I placed an online order.\n\nAbout two minutes after the order was placed, a gentleman called from Kung Fu to verify some of the things on my order. Whhaaaaat? A restaurant that doesn't just guess but actually follows up with the customer? Amazing! He told me the food would be delivered in an hour but it was more like 30-45 minutes.\n\nAnd it was sooooo good. I was craving egg drop soup and theirs didn't disappoint. I had also ordered the chicken with chili and mint over rice and received a HUGE portion for the price. Got a large drink too. Cost for everything plus delivery and tip was only about $22, making it more than worth it. Not to mention the awesomeness of having it delivered to my hotel.\n\nDefinitely will be keeping this one on my list for future trips to the area. It's easy to understand why they've been open so long!"
        }, 
        {
            "index": 256, 
            "rating": 3, 
            "review": "Pretty good food at decent prices and relatively large portions. Been to Kung Fu several times and would definitely go back. Go give this place a try it isn't the best but it is pretty good and cheap."
        }, 
        {
            "index": 257, 
            "rating": 1, 
            "review": "Just had the lunch special good price, nice portion but zero flavor,  the moo goo just tastes like nothing really.  Fried rice zero flavor , everything was cooked but seems like the salt was forgotten.  Not sure why this is a go to spot for a lot of people. Will give it another try but right now food has like blah."
        }, 
        {
            "index": 258, 
            "rating": 1, 
            "review": "Usually get good service, but not all the time. I sat there 15 minutes today at lunch with my wife and watched 3 tables come in after us, and all order. Meanwhile we sat there with water and no menu's, and no orders taken from us (drinks or food). We had enough after table 4 came in and ordered. We just left, having only tried the water (and still no one noticed us)! There was only 5-7 tables in the whole place at the time!"
        }, 
        {
            "index": 259, 
            "rating": 5, 
            "review": "The best Thai and Chinese food in las vegas. I recommend to all ages and good pricing."
        }, 
        {
            "index": 260, 
            "rating": 4, 
            "review": "Tom Yum was amazing, everything else seemed to be a little too sweet. Other then it's a really quite place to go eat."
        }, 
        {
            "index": 261, 
            "rating": 1, 
            "review": "Worst shrimp egg fu young ever. No egg just chopped celery with miniature shrimp. Fried noodle were sweet and oily never again"
        }, 
        {
            "index": 262, 
            "rating": 5, 
            "review": "We had the Shrimp Egg Foo Young, Shrimp Pad Thai and Laarb Chicken.  All were excellent."
        }, 
        {
            "index": 263, 
            "rating": 3, 
            "review": "We were a party of 6 and having just been to Chinatown in SF, I was disappointed.  The service was just about as bad as it gets - with items coming out and varied times and some of the dishes were downright skimpy.  It wasn't bad or great - was just okay."
        }, 
        {
            "index": 264, 
            "rating": 4, 
            "review": "I have gone to this Thai restaurant on almost everyone of my Vegas trips, which have been plenty. You have not had Thai pho until you've had it here. Very authentic. They never disappoint me on any of the dishes I've ordered. This last time I was there I didnt see my normal waiter, I'm not sure whether it's changed hands or not. I ordered to go and the food was a little different, still good tough, plus I didnt see the usual waiter in there that remembers me the 2-3 trips a year that I'm there. Regardless still one of my fav Thai restaurants."
        }, 
        {
            "index": 265, 
            "rating": 2, 
            "review": "40mins later and still waiting for my order! My first time here and I'm never coming back.."
        }, 
        {
            "index": 266, 
            "rating": 5, 
            "review": "This place is awesome ! The servers get to you quickly, they're always so friendly and helpful. If you've never been here for sure try the Tom Yum soup with shrimp, it has me hooked ! I've tried several different items on the menu and it's all been so tasty. The portioning is very good for the price. One item can easily be split between 2 people. Definitely recommend it"
        }, 
        {
            "index": 267, 
            "rating": 4, 
            "review": "We wanted to get rid of all the late night alcohol taste now so we can start fresh and drink some more later =). What can cleanse your palate better than a steamy bowl of spicy tom yum soup? Our Thai friend told us about this place and we were surprised how good the food was. My second time eating here and the business name still throws me off. Pretty authentic Thai dishes, which reminds me of a few spots in Thai Town, Krung Tedd and Hollywood Thai. \n\nThe waiter let us know up front that it's easier for them to add additional spicy than to remove it. We understand dude, haha, we can handle it.\n\nFavorite:\nTom Yum Soup - chicken or shrimp\nCrispy Pork with Basil and Chili\nPapaya Salad\n\nFood - 4.5 stars\nService - 4 stars: we had to flag someone down for more rice then later for our check.\nParking - the parking lot stretches along Spring Mtn\nRestroom - 3 stars\nWait - came during lunch time and were seated right away"
        }, 
        {
            "index": 268, 
            "rating": 4, 
            "review": "The food is sooooooo good, however their service isn't. Be prepared to wait... For a long time for any help. Lunch specials are only on weekdays. The chop chicken chili is my favorite, spicy level 8... Anything below isn't very spicy. The Mongolian beef spicy level 8 is also really good, as well as their Thai Teas. For quality of food though and variety this place is one of the best."
        }, 
        {
            "index": 269, 
            "rating": 4, 
            "review": "As any other Thai or Chinese restaurant , the food is flavorful and aromatic with exotic spices.i have to admit some of the prices are high but definitely worth it. I love the seafood fried rice has spectacular quality seafood( scallops, fishball,squid, etc) I ordered the Tom yum with jumbo shrimp which was very good!"
        }, 
        {
            "index": 270, 
            "rating": 5, 
            "review": "Excellent food and service! No wait, popular spot! Great atmosphere. Thoroughly enjoyed myself and my husband loved the combination fried rice with crab."
        }, 
        {
            "index": 271, 
            "rating": 5, 
            "review": "Place wasn't really busy when we arrived on Christmas day in late afternoon so we didn't have to wait long. Food was good as ever and our server was nice and helpful as we wanted to try something we haven't had before. Was hectic when we were going to leave so took a bit to get our check and to go boxes.  Overall as good as it's always been"
        }, 
        {
            "index": 272, 
            "rating": 1, 
            "review": "Horrible service, worse then a fast food joint that is slammed as f* and has a 16 year old working the window. Tell me why all they did was take our order 20 minutes after being seated, drop off the food and never come back to check on us. Don't waste your time. There's better places on spring mountain that will satisfy your Chinese or Thai food cravings"
        }, 
        {
            "index": 273, 
            "rating": 5, 
            "review": "Very good lunch, service, and atmosphere. Thai food is one of my faves and this place was outstanding. Took my vegas buddy here while in town  and he was very happy with the quality and service. I'll make this a stop any time I'm in town ."
        }, 
        {
            "index": 274, 
            "rating": 2, 
            "review": "I work at a casino on the strip and this is the only place my co-workers and I could find that would deliver. The food is pretty good, there's no complaint there. The only complaint that I have is when we place an order over the phone. There are two people that we've noticed who take the orders, one is male the other is female. Every time we order from the male, the orders are always correct. When we order from the female, every time, the order is incorrect. Everytime. When we've called back to have them correct the mistake, she will sit there and argue with us. We've decided not to order from them again. Too bad. They've just lost steady business."
        }, 
        {
            "index": 275, 
            "rating": 1, 
            "review": "we are giving them 1 start because that's the only option, this place is terrible, we order Kung pao shrim and they give us 5 shrimps with tons of ginger it did not taste like Kung pao at all.\nmy husband order pad Thai shrimp and the noodle was like anger air pasta w mini tiny shrimps. the prices are crazy we pay $50 for a really bad dinner!! don't ever order in this place"
        }, 
        {
            "index": 276, 
            "rating": 5, 
            "review": "I noticed that a lot of negative reviews are about service, but I have never had that issue here. They refill our waters quite frequently, a lot better than most other restaurants. Everything that I have ever had at this restaurant has been really good. My top picks are the pad thai, pad si ew, tom yum, and the panang. I have also recently tried the Mongolian beef and that was also delicious! Kung Fu will always be one of my favorite thai and chinese go to. Most people are wary of restaurants that have three stars, but I highly recommend trying this place out. They have been open for decades, they are still here for a reason."
        }, 
        {
            "index": 277, 
            "rating": 4, 
            "review": "I was here a few days ago and I shared five dishes, and only one of the dishes disappointed me.  It was the \"orange chicken\".  The orange chicken was heavily battered and there was very little orange glaze on it.  So if I were you, I would avoid the orange chicken at all costs!"
        }, 
        {
            "index": 278, 
            "rating": 2, 
            "review": "I live in NLV and was in the area. I figured Chinese food in Chinatown had to be good.  There was a lot of people waiting outside but when we went in to ask how long the wait was we were told a few minutes.  We got lucky because everyone else who came in after us were ignored.  We were seated about 15 minutes later then ignored.  Someone came up with menus after we were seated for about 5 minutes then no one came back.  The people around us who had been seated after us had water and their orders taken.  I finally grabbed a busboy and asked him to get me a waiter.  The waiter finally showed up and we ordered appetizers as well as dinner.  My daughter ordered soup for dinner which even though it was obvious that's all she was getting,  they brought it with the drinks then the appetizers came after about 30 minutes then our dinner almost immediately.  I had the Mongolian beef which was small but the meat was good.  I think the food would have been better if I didn't have such a bad taste in my mouth from the service - or lack thereof."
        }, 
        {
            "index": 279, 
            "rating": 4, 
            "review": "I was tired of the pages and pages of pizzeria and sub fliers when a talk with the front desk lead me to carouse the menu of Kung Fu Thai & Chinese. Relieved to get something that's a little closer to home, we ordered extra to keep in the fridge for leftovers in our hotel room.\n\nCombo pad thai was good, on the average side, medium or so portion. I would've liked to have the option of making it spicy when ordering over the phone.\n\nCombo chop suey: The sauce and amount was great. If the ingredients marinated in the sauce a bit more, it would've been better, but with a little hot sauce it was awesome.\n\nMongolian beef was also good with a darker sauce and fried wonton chips sauteed with bell peppers and onions.\n\nWor Wonton Soup: Probably one of the best won ton soups I've had that wasn't home made. Light, and chock full of veggies and pork and mushrooms. Yum!\n\nOne other thing...\n\nJumbo Thai Iced Tea: Picture a Big Gulp sized Iced Tea. @_@\n\nOverall, good quality food at awesome quantity for an amazing price."
        }, 
        {
            "index": 280, 
            "rating": 5, 
            "review": "Been coming here since I was 5 and I am now 24 my whole family is hooked and now even my boyfriend ;) lol this place is my favorite Thai restaurant. Full of flavors and spices. Chopped chicken mint leaf spicy all the way and the chicken chow mein are my gotta haves all the time. Love love love this place!!"
        }, 
        {
            "index": 281, 
            "rating": 1, 
            "review": "Service was bad, and one of the dishes, Pineapple Fried Rice, was horrible.  Their Thai BBQ chicken was on the dry side.  The flat noodles, that they use for Pad See Ew, were on the thick thick side.  \n\nThe Pineapple Fried Rice was just soggy.  It didn't even seem that it was fried because of all the water or stock they added.  It was almost to the verge of porridge territory.\n\nI was surprised at the prices too, about $10 a dish, for the quality and quantity they serve (meaning small portion).\n\nTheir menu is extensive. They specialize in Thai, and Chinese food.\n\nI would rather go to the strip and pay and eat Americanized Chinese food."
        }, 
        {
            "index": 282, 
            "rating": 4, 
            "review": "With a previous night of drunken debauchery in Sin City - Vegas we leave our beautiful suite at Palazzo and look for some good sober-up yet cold-weather warming food. Votes in - and THAI food it is! But where? So I remember heading out to Chinatown in a prior visit to Vegas a couple months back at Kung Fu! CHEAP, GOOD, and did I mention...GOOD!\nSo 15 minutes later we're there and were seated promptly. Luckily, it was already after lunchtime  so we didn't encounter any wait time. \nWe all chose to order dishes and share the portions. Tom Yum (HOT - of course), Pad Thai, some beef salad, and shrimp fried rice! \nThe guys were digging the food but like myself, they agreed the service was aiiiiight! Could have been better (hence the 4 stars). SO - if you're in vegas and have a hankerin' for some Thai/Chinese (good decent and reminiscent of SGV style) hit Kung Fu up! It'll make you say....\"HAAAAY YA!\" LOL!"
        }, 
        {
            "index": 283, 
            "rating": 5, 
            "review": "Authentic Thai food. Delicious and great customer service. The place is large but get very crowded during normal lunch and dinner hour. Prepare to wait for a table but it's worth the wait."
        }, 
        {
            "index": 284, 
            "rating": 5, 
            "review": "Not enough superlatives - Best Thai food outside of Thailand.\n\nSince our two weeks in Thailand several years ago we have constantly been sampling Thai food both at home and during our travels. This is unquestionably the best Thai food we have had in the USA. \n\nIt was recommended by a staff member at our hotel. This plus reading TA reviews convinced me that this should be the place for our first evening's meal in Las Vegas. We ate there three of the four nights of our stay. \n\nI enjoyed the sweet and sour Thai style chicken so much I ordered it 3 times. We also shared beef with mixed vegetables and Pad Thai chicken.\n\nWe'll most certainly return on our next trip. It will be hard to choose an alternative restaurant as this place has set the bar so high. Our local Thai restaurant (which is fairly good) will have to suffice until next year."
        }, 
        {
            "index": 285, 
            "rating": 1, 
            "review": "Can't put zero star, too bad.. Almost 2 hours wait for our food to be delivered and we live 2 blocks away.. The food was really disgusting, wonton soup was pink (because the pork inside was pink!), rice was disgusting (how you mess you rice up!?), bbq pork was allright... So overall, i guess i won't order from them ever again... :/"
        }, 
        {
            "index": 286, 
            "rating": 5, 
            "review": "Best of Vegas hands down. Service is top\nOf the top and the food is even better. I found this place one time my car was broke down I was taking the bus.\nI was on the corner dying of heat in the middle of July at mid day. Guy comes out with with a cup of water after noticing me sitting there rotting in the sun. I took my family over there as a result of their kindness and believe me when I tell you the food is insane ! The fried rice !!! The general  tsao chicken !!!!!!!!!!!! Everything is off the hook and straight up your just nuts if you haven't been there !!!"
        }, 
        {
            "index": 287, 
            "rating": 4, 
            "review": "This place is pretty freaking good.\nTotally took me by surprise.\nI came for dinner and I will usually order pad see ew but since I was with a large group we decided to eat family style.\nLucky me!\n\nWe ordered:\nBeef sate'\nTom yum goong\nTom kaa chicken\nMint chicken\nPork plik king\nCurry catfish of some sort\nRed beef curry\nI was very impressed with all the above dishes.\nIn fact I came back the next day just to try the pad see ew, and that was also very good.\nWell balanced flavors with just enough kick for this westerner to get a good idea of what they are working with.\n\nThe Thai iced tea was also prepared very well and had way too much milk just the way I like it.\n\nThe only thing that was lacking was the interior was a bit dated.\nBut im not here to eat the painting on the wall.\nAlso the service was not as attentive as I would have liked.\nWe had to wave down the waiter numerous times.\nAnd lastly the food is a bit more expensive than I expected. \n\nBut the food is very good.\nKung fu may not sound like an authentic Thai food restaurant but damn the food is pretty good.\nSo ignore the name and concentrate on the food.\nPositive note for next time: Looks like they have a full bar.\n\nFood: A\nService: C\nPrice: B\nOverall: Solid B+\n\nNow go eat and be merry!!!"
        }, 
        {
            "index": 288, 
            "rating": 4, 
            "review": "My friends and i always come here on our trips to vegas. It's almost a tradition. You can get great food at decent prices.  We don't like to eat all our meals by the strip.  It gets way too pricey.  We usually order the chop chicken with basil and the crispy pork. It's very similar to stuff i can find in LA if i want a taste of home, but different enough that i still find it special."
        }, 
        {
            "index": 289, 
            "rating": 1, 
            "review": "I didn't feel well today and was craving Chinese food. I just moved to Las Vegas and I'm not the most familiar with where things are so I ordered delivery from the first place that came up on Google, Kung fu. After ordering my food with the delivery fee and automatic 15% tip to the driver, a woman called to confirm my order. She asked what my cross streets were and realized I'm on the other side of town but she said it was okay. An hour later, our food arrived and I was greeted by my deliver driver. He was an older Asian man who proceeded to complain and moan about my delivery to no end. I pretty much closed the door on him. I felt like I was being scolded by my father or something. He complained about things I couldn't control like the fact that my complex is too dark for him to see the building and he complained about how he had to drive SO far (not even 20 minutes). When I apologized for the inconvenience I had caused him he just repeated how far I made him drive. I will never give this restaurant my business again because of that driver. The food also was not worth the price or the frustration."
        }, 
        {
            "index": 290, 
            "rating": 4, 
            "review": "Have been going to this place since I was a kid!  The food is consistent and very flavorful with mostly Thai dishes and some Chinese dishes mixed into the menu.  Staples include the pad Thai, curries and salads that are great family style.  They've recently renovated the restaurant so it doesn't look as run down as it used to be which shows how long this place has been around.  Tom yum soup is served in a nice flaming pot to keep the soup hot and is very flavorful.  Only issue with the food is sometimes they use too much grease and oil in their dishes so I recommend saying light oil!"
        }, 
        {
            "index": 291, 
            "rating": 2, 
            "review": "Food is good, portions are little, word of advice if you are going in a party of 4 or more ordering entrees each be direct and tell them you want your own rice in its own bowl. They will charge for extras and give you less rice altogether in a bigger bowl. Each entrée comes with 1 cup of rice and charges for more if asked. Rice isn't that much more but $1.50 per extra cup but if you were to get your 1 cup in the first place you most likely wouldn't need a second cup. Overall food is ok."
        }, 
        {
            "index": 292, 
            "rating": 5, 
            "review": "Spent Christmas Evening here :-) food was awesome!! The wait was pretty long but we expected it since it was Christmas. Anyway it was defiantly worth the wait. The staff was great, they were all running around trying to accommodate everyone as best as they could. The food came out fairly quick and I was really pleased with what we ordered. The Angus beef salad was my favorite :-) so yes we will definitely be back soon to try all the other items on the menu."
        }, 
        {
            "index": 293, 
            "rating": 5, 
            "review": "OMG.... awesome food and cheap prices. Worth the trip from the Strip. We ate there three times in a row for dinner, yup, three on our honeymoon. We had different food every night, and everything that we had was delicious. The tofu appetizer was the only thing that we ordered twice. The people there were friendly and the service was fast even when they were busy, and it has a really homey feel to it that makes you comfortable. If I were a local, I would eat there again and again."
        }, 
        {
            "index": 294, 
            "rating": 3, 
            "review": "I was in search of Shrimp Pad Thai and found this via google. Ordered placed for pick-up, ready in 15 mins...Great! \n\nParking was down a dimly lit drive thru/alley way. Got startled by what appeared to be a worker smoking in the corner; may I suggest you park on Spring Mt and walk around to Valley. \n\nUpon entering the restaurant, the staff was very friendly and the atmosphere was inviting. I must say the dish was very tasty with a spicy level of 4. \n\nThe only complaint were the noodles were thinner than what I was used to, almost like angel hair pasta, and the shrimp were the tiny ones; I was a little disappointed, but yet it was still very tasty. You can order up for larger shrimp, but since it was my first time I wanted to experience the regular dish. If I had to eat here again, I would definitely order the larger shrimp next time."
        }, 
        {
            "index": 295, 
            "rating": 1, 
            "review": "Holy shit. I would rate this a 0 star if i had an option. Brought my family of 5 here, and holy cow, theres honestly NO FLAVOR in their food. Not to mention their short of staff, which occurred bad service. They also forced us to tip them. What kind of restaurant force us to tip them? So my mom gave in and did so. Smh. This place needs to be shut down, my sister got a stomach ache from eatting raw chicken of theirs"
        }, 
        {
            "index": 296, 
            "rating": 5, 
            "review": "Excellent service. Best Chinese/Thai restaurant in town. Highly recommended."
        }, 
        {
            "index": 297, 
            "rating": 4, 
            "review": "Was looking for some good chinese to feed a hungry crew after a convention in Vegas.  The hotel recommended Kung Fu so we figured ok we'll give them a try.  WOW!  They were so friendly on the phone, very helpful with directions.  The food was great and everyone was really satisfied at the end of the meal.  They were very accomodating with plates, forks, napkins, and even provided serving spoons which was really nice.\n\nWhy not 5 stars?  I had called about 45 minutes ahead.  When we arrived to pick up the food at the agreed upon time, it quickly became apparant that they hadn't even started preparing it yet.  I think they didn't believe we wer going to actually show up.  So we had to wait about 30 minutes, which was kind of a drag.  Other than that, great experience and I would definitely recommend this place, and go back if the opportunity presents itself on a future trip to Vegas."
        }, 
        {
            "index": 298, 
            "rating": 1, 
            "review": "They delivered the wrong food and when I called to tell them, they insisted it was what I ordered and hung up on me, repeatedly. I had to take a cab there to get my money back. Don't waste your money or time. They never refunded my money. Avoid this place at all cost!!!!!!"
        }, 
        {
            "index": 299, 
            "rating": 1, 
            "review": "Food isn't bad but service was awful! Orders came out individually and waiters aren't as attentive. They require a 15% tip for a party of 6 or more and I honestly don't think they deserve it. They treat their own people with more attention than others...discriminates and slow in service, not coming back for sure."
        }, 
        {
            "index": 300, 
            "rating": 4, 
            "review": "Just tried their food, it was amazing! Very tasty. I loved the beef and garlic sauce, and the chicken chowmein. It's kind of pricey, but overall it was good."
        }, 
        {
            "index": 301, 
            "rating": 4, 
            "review": "This place has great food. The Mongolian beef, orange chicken, and pot stickers are all great choices.\nThe service is decent. I've been to worse. \nOver all it's a good choice"
        }, 
        {
            "index": 302, 
            "rating": 4, 
            "review": "Kung Fu on Spring Mountain China Town Vegas has consistently offered excellent Thai and Chinese food ... Fresh and savory and served with courtesy and professionalism each and every time. Thumbs way up!!"
        }, 
        {
            "index": 303, 
            "rating": 1, 
            "review": "Called to order delivery.  Took twice as long to deliver as they said it would.  Food was not even lukewarm.  Food was unrecognizable as traditional Chinese food.  Noodles were oily and had no flavor, nor did any of the food for that matter.   The food was not edible at all, very disappointing."
        }, 
        {
            "index": 304, 
            "rating": 4, 
            "review": "Thai and Chinese. . . had the minced beef soup, fish cakes, pad see ew and pineapple fried rice.  Huge portions and a nice break from the buffetts or the super pricey casino restaurants.  The decor can use some improvement however the food satisifed my craving for Thai in Vegas."
        }, 
        {
            "index": 305, 
            "rating": 5, 
            "review": "A great treat to find such fantastic Chinese AND Thai cuisine in Las Vegas. We stayed at The Hard Rock and they have Chinese food there but its expensive and nowhere as good as Kung Fu Thai & Chinese Restaurant !! We had both Thai and Chinese. The fried rice was light and not heavy with oils as many seem to make.It was so flavorful. When we first walked in the smells wafted in the air and we knew right away that we found the best! Worth the drive from the overpriced strip and an Uber ride is cheap and with the money you save by not paying over inflated LV strip prices the Uber ride ends up almost free. We will always stop here each trip we make. This was our Thanksgiving mealand one I will always remember. Thank you to the cooks and all the nice people we met there!!"
        }, 
        {
            "index": 306, 
            "rating": 4, 
            "review": "Haven't been here much since they remodeled which is quite awhile ago but will probably try again soon. Was a great place to get both Thai and Chinese food."
        }, 
        {
            "index": 307, 
            "rating": 5, 
            "review": "So glad that our first choice of places to try was busy that we came across this place last minute.  The name and outside appearance is not very appealing, but my gosh, the service, friendliness, and delicious food over compensated the exterior, which was immediately forgotten.  This place will be placed on my regular go to list."
        }, 
        {
            "index": 308, 
            "rating": 4, 
            "review": "Food is always good but service was poor at best today. 23 muni yes to take our lunch order..... On another visit service was back to normal. I revised my review and will keep you posted."
        }, 
        {
            "index": 309, 
            "rating": 2, 
            "review": "Service was horrible. No one took our drink orders, the waitress took our food order, but didn't ask about drinks until we had to ask someone about it. \n\n5 people at our table and they brought out each dish one at a time with several minutes in between. Who does that? \n\nWaitress disappeared when it was time for the check, the manager finally brought it over and finished for her. While we were eating we saw another party waiting at the door for their check. \n\nFood was great if you don't mind bad service."
        }, 
        {
            "index": 310, 
            "rating": 4, 
            "review": "This is one of my favorite places to eat. The food is so good. Everything you order is great. The menu is huge. I like to order the Thai fried chicken wings that come with a sweet chili sauce. The pad Thai is always a winner. Tom yum goong, chicken chili mints and fresh egg foo young are sure to make you happy. I also love their Thai tea, it's the bomb. Service is good also, they pack up your leftovers for you to. It's a pretty popular place. Try it out and you will not be disappointed."
        }, 
        {
            "index": 311, 
            "rating": 1, 
            "review": "Gave this place a second try, and it still failed. The server was unfriendly, and the service was both slow and ingenuine. The red curry was watery and lacked any taste, and the Ton Yum soup was beyond miserable. As for management presence? None. Will NEVER return...."
        }, 
        {
            "index": 312, 
            "rating": 1, 
            "review": "I have a biased opinion because I'm from Cali and I've had some amazing Thai/Chinese food in LA's China Town. That being said... I had no idea if I was supposed to seat myself or wait to be seated b/c there's no signs and none of the staff  ever acknowledged my party and me. \n\nFood was supremely mediocre... over cooked chicken, the saddest seafood soup I've ever seen, boring chow mein with the added flavor of hair! Yuck! Not to mention, in my opinion, this place is over priced for what u get. \n\nAt least the Sake was good! Will not be returning."
        }, 
        {
            "index": 313, 
            "rating": 4, 
            "review": "Finding parking is a freaken pain in the ass in this plaza, but its worth it cause the food here is great! Kung fu has been around in vegas for decades and decades LITERALLY. The service here is great, they alwayse take the time to see if your enjoying your food and filling your glass of water without being ask. The seating is actually pretty quick depending on the time of the day you show up. \n\n     We alwayse order yum moo yang( grill pork sald) it is sooooo delicious :) a good blend of sweet and heat. There soy sauce duck is also yummy, especially over hot steamy rice. Every thing that we order here has been delicious so far the only downside I have is parking but what do you expect its CHINATOWN haha."
        }, 
        {
            "index": 314, 
            "rating": 4, 
            "review": "The food was extremely decent for the price.   We ordered numerous dishes and everyone seemed to enjoy them."
        }, 
        {
            "index": 315, 
            "rating": 4, 
            "review": "I've finally had the chance to dine in here, and I'm really pleased with my experience. \n\nWe came in yesterday, Christmas Day, for brunch. \n\nThe place was packed, but they found a small table for the two of us towards the back.\nThey offer a free soft drink with a Yelp check in, and I was able to \"upgrade\" to a Thai iced tea for $1 instead of the normal $2.85.  Deal!\n\nToday we ordered a cup of egg flower soup, egg rolls, shrimp Pad Thai, and Mongolian beef.  \n\nI thought the egg flower soup was gross, but I'm not a fan of that style of soup anyway.  My fella LOVED it.  He said it was some of the best egg flower soup he's had in town. \n\nThe egg rolls were amazing, and let me tell you about the hot mustard sauce...wowza, THAT cleared my sinuses after one bite.  It was absolutely amazing, and I usually don't care too much for hot/spicy things.  \n\nThe Mongolian beef was delicious:  tender beef with great flavor and a little kick to it, with peppers and onions and carrots.  \n\nThe Shrimp Pad Thai was good too...the noodles were perfect.  My only complaint and the reason for the docked star was that the shrimp were REALLY over cooked.  \n\nService was extremely polite, and quick.  \n\nI absolutely plan to continue to order in from here, and I would definitely dine in again."
        }, 
        {
            "index": 316, 
            "rating": 5, 
            "review": "This place is great! We always take out-of-towners here, and we get nothing but rave reviews from them as well. It is often requested that we return the next time they are in town. The service is friendly and usually prompt. The food comes out as it is prepared, so sometimes it's a little weird to get a dish every few minutes. But it always comes out fresh, hot and delicious. We haven't delved into the Thai side of the menu, but we can vouch for a number of dishes on the Chinese portion of the menu. The General Tso's Chicken is our favorite, as well as the Sesame Chicken, Mongolian Beef and the Combo Chow Mein. Parking is a pain, but worth the hassle!"
        }, 
        {
            "index": 317, 
            "rating": 1, 
            "review": "I ordered a papaya salad delivered the menu reads fresh papaya diced into our fresh coconut sauce with grounded peanuts grounded dried shrimp served along lettuce or cabbage\n THERE WAS NO PAPAYA AND IT WAS SO SPICY I COULDNT EAT IT !!!"
        }, 
        {
            "index": 318, 
            "rating": 4, 
            "review": "Because from the outside this place says Thai and Chinese I automatically assumed it wasn't going to be good. To my surprise all the flavor were there. Just to show you can't judge a book by its cover. The service was pleasant and quick. I went there for lunch with a party of 17, ordered a whole bunch of dishes and everything was great and in a timely matter. \nThe decor is not my style but I would be going back for the food not the decor."
        }, 
        {
            "index": 319, 
            "rating": 4, 
            "review": "Pad see ew was good. Pad thai was not that good, but the mango sticky rice was good, but small. Price is decent. Probbaly woild not come back"
        }, 
        {
            "index": 320, 
            "rating": 5, 
            "review": "Stopped for a quick bite and discovered a great place. Clean, nice atmosphere. Prices are great and the food was excellent . The service was very attentive.  The Mongolian chicken is great !"
        }, 
        {
            "index": 321, 
            "rating": 2, 
            "review": "Ordered take out/delivery to our accounting office -- ordered 5 lunch specials @ $6.25 each.  Although cheap we were all disappointed with flavor and portion serving.  Most on plate was rice...3\nof 5 plates were pad Thai and the serving was so small and not much of flavor.  Came with a small egg roll and chicken wing.  Deliv charge was $3...def not worth it and we won't be ordering anytime soon...very disappointed."
        }, 
        {
            "index": 322, 
            "rating": 4, 
            "review": "I love this place, when I use to live in Vegas... every visitors I had, I would take them here to eat.  It's nothing fancy and since I use to be such a regular here, always good service.  The food is very delicous and I always leave this place satisfied.  \n\nAway from the strip and into china-town, this place is a little gem hidden at the corner of the street...... the portion size is great, and a family dining oriented restuarant that's able to seat large parties.  In general, the food is GOOD."
        }, 
        {
            "index": 323, 
            "rating": 3, 
            "review": "The Thai dishes are good but the Chinese dishes are average."
        }, 
        {
            "index": 324, 
            "rating": 4, 
            "review": "Me and my boyfriend order from here all the time.  We love there food.  Hate the different prices base on who taking your order.  We even taking inlaws there when they are in town.  Love,  love,  love the egf flower soup.  But we always order from them. The food hands down is great.  The prices changes is the only reason they dont get a 5 because we order there so much and mostly the same things the different always very with atleast a $10 different.  Dont like that.  Thats it i hope you do try the food they are good i  would say give it them a chance to change your mind."
        }, 
        {
            "index": 325, 
            "rating": 2, 
            "review": "It took awhile for the server to show up. Ordered the tom yum jumbo shrimp soup which was not bad. The Mongolian beef was not that good. It lacked flavor and just simply wasn't tasty. The orange chicken was fairly decent. Will likely not return to this place, given the dozens of better options around town for this type of food."
        }, 
        {
            "index": 326, 
            "rating": 3, 
            "review": "This place is located right in the heart of Chinatown.  They offer both eat in and delivery.  I don't live in their delivery area anymore, and I'll still drive down to get their food about once every other month.  I would have rated them higher than a 3 b/c the food is great, but I only like to order a few things off of their menu...and they have a lot of options.  B/c of some of the meals I've had and not enjoyed, I marked them only a 3 star place.  Also, the restaurant isn't the cleanest and the decor is old.\n\nI will say though that their Beef and Broccoli is very good, as well as their Chopped Chix Soup and their Hot N Sour Soup.  They offer a Thai and Chinese menu there, and we always tend to order from the Chinese side of the menu.  They have a really good hot sauce there so make sure to ask for that.  It's fantastic in the Chopped Chicken Soup!"
        }, 
        {
            "index": 327, 
            "rating": 5, 
            "review": "My family loves the Tom Yum soup ( hot )...."
        }, 
        {
            "index": 328, 
            "rating": 1, 
            "review": "Worst service I wouldn't even give it one star it used to be the best place but I won't be a regular customer anymore"
        }, 
        {
            "index": 329, 
            "rating": 2, 
            "review": "The service was incredibly slow. 3 tables around us had to ask for someone to take their order. The soup was lukewarm and not much in it the food was tasteless. Had to repeatedly ask for things to be brought to our table not worth the money we will never go there again"
        }, 
        {
            "index": 330, 
            "rating": 4, 
            "review": "play it safe and stick with some tom yum soup and pad see ew. \n\ntom yum soup was delicious, i like that they bring the hot pot thing out to your table so you can help yourself.\n\nmy friend had the pad see ew w/shrimp and i ate more of her food than my own. they give you a generous amount of large shrimp and it goes well with the thick flat noodles, egg, and garlic-y sauce. \n\ni had this rice dish...rice with spicy deep fried cat fish fillets . it was a mess of unidentifiable pieces of fish smothered in brown sauce on top of rice. NO BUENO. and they mean BUSINESs when they ask you how spicy you want your food on a scale from 1-10. i LOVE spicy, so i asked for an 8 and it was borderline that i-cant-enjoy-my-food stage for me. \n\nservice was great, my friend ordered this garlic chili beef dish and asked for it to be spicy level 8. she was dying, and i must admit, though delicious, i don't think i can enjoy eating an entire meal like that. she told the server it was way too spicy and couldn't eat it, and they happily made her another order, less spicy. i thought that was super nice of them because i'd probably tell the person \"too bad,\" since they should know to order at their own risk! \n\nMoral of the story: even if you love some kick to your food and (think) you can handle really spicy food, order a lower level...you can always add them to add more spice if it's not suitable!"
        }, 
        {
            "index": 331, 
            "rating": 5, 
            "review": "Delicious chinese and thai dishes at Kung Fu! And cheap! \n\nCame here for dinner with my girlfriend's and ordered pad-see-ew with beef, kung pao chicken, chicken curry, and combination fried rice. Everything was oh so yummay!!! Portion servings was just enough for us 6. Customer service was top-notch! And wait time for our food was not long at all! I didn't even get a chance to take pictures of the food because the girls were starving and dove in right away lol! Very impressed with the overall experience, definitely recommend! (:"
        }, 
        {
            "index": 332, 
            "rating": 5, 
            "review": "Had the pad see ew and chicken panang. Everything came out fast, great service and very tasty. Highly recommend! The chicken panang was more peanut-y than I'm used to and I liked it!"
        }, 
        {
            "index": 333, 
            "rating": 4, 
            "review": "Easy to find and clean. It's prob 5 min off the Strip. I ordered Chicken Satay and Pad See Ew which is a staple. It wasn't very busy when I arrived but by time I left had a line. Definitely a place I would visit again. I gave them 4 Chicken Satays..."
        }, 
        {
            "index": 334, 
            "rating": 3, 
            "review": "A cornerstone of Chinatown in Las #Vegas Kung Fu Plaza ofers a chinese/thai menu with delivery offered in the nearby vicinity.\n\nNOT a big fan of asian cuisine since its all rice,noodles and strange meats I tend to stay away but I played it safe with an appetizer combo,BBQ Pork fried rice and wor wonton  soup. Delivered to my door in 25 minutes for under $30!!\n\nThe fried rice was good but nothing special-very little pork and the rice was just ok. NO crunchy noodles for the Wor WonTon Soup when I requested them was a big downer:( The soup was really good however.\n\nThe appetizers were ok I could have ordered a dozen of the wings and been better off however!! The other stuff was forgettable even looking at the photo I cant rememeber what it was:(\n\nAlot better places to try in Chinatown but you live you learn."
        }, 
        {
            "index": 335, 
            "rating": 5, 
            "review": "No romantic dinner or lunch.Great place for Pad Thai,chicken fried rice,sweet&sour soup,curry dishes.TOM YUM soup is perfect.I spent about 5 years around Thailand...This is good food.Place looks old,but very clean.You can tell by the cleanliness of the restroom."
        }, 
        {
            "index": 336, 
            "rating": 3, 
            "review": "This place was packed on a Monday night.  Service was mediocre.  They didn't come and check on us very often.  My sprite (which I got with a Yelp check in) was pure carbonation and with very little to no \"sprite\" syrup.  You can order most items with our without \"spicy\"\n\nChicken Wings:  Very good crispy but tender.  The sweet chili sauce had no heat to it but it was delightful.\n\nPad Sew Ew:  Pretty solid as far as this traditional Thai dish goes.  Nice flavor, not too much overpowering sauce.\n\nShrimp Salad:  Refreshing and light.  Shrimp with a light sauce on a bed of lettuce.  The salad was crisp and the shrimp were cooked well.\n\nShrimp Fried Rice:  Really no flavor at all.  I give them item a 1 star at best.  I've had fried rice at a lot of Thai restaurants and this dish had no flavor whatsoever.\n\nChicken with Basil:  A little greasy but very flavorful.  The basil flavor really pops out.  Just sop up some of the grease with your steam rice to balance it out."
        }, 
        {
            "index": 337, 
            "rating": 4, 
            "review": "Very good menu selection with many many items that will please anyone's appetite. I always get the Thai tea and it's not too much tea and not too much cream so it's perfect. The egg foo young is great with lots of toppings and the Tom yum shrimp soup is flavorful and filled with a good amount of shrimp. Definitely visiting again. Docked one star because when they're busy service is slow."
        }, 
        {
            "index": 338, 
            "rating": 5, 
            "review": "simply the best chinese food we have found in las vegas area"
        }, 
        {
            "index": 339, 
            "rating": 2, 
            "review": "Ordered $60 in food online for delivery and was called 15 minutes later and told it was too far.  They said they only deliver 3 miles out and I'm 5.  The website says it will not allow the order if they won't service your zip code and it had no problem accepting the order.  I'm a little disappointed that I didn't get the opportunity to try this place, the food looked good but got bit by their broken website and/or unwritten policy."
        }, 
        {
            "index": 340, 
            "rating": 3, 
            "review": "I like this place. Service is fast and the food is good. They have a great variety of Asian styles. I like their lunch specials which are really cheap and you get a lot for what you pay for. I come here twice a month."
        }, 
        {
            "index": 341, 
            "rating": 3, 
            "review": "This is a review of their take-out service; I'm sure the experience is different in the restaurant itself. Also, I'm not entirely sure if the take-out menu has all the items that are in the in-house menu. I have never been to the restaurant itself. Decided to try the take-out menu because one of us was feeling sick and was not up to going to the casinos for a meal. We were staying at a timeshare near the strip that did not have room service.\n\nFirst, I tried ordering online because they have a convenient online ordering system through their website at kungfuplaza.com. The ordering system was very well organized, with pictures of the food you're ordering. However, after putting in my order, the final page indicated that the delivery address was my credit card's billing address which is in another state and not the hotel that I was staying in. I cancelled the order and called in the order instead. The woman who took the order had a strong accent, but she got my order right. The woman asked for spiciness level on a scale of 1 to 10, with one being really spicy. I was quite tickled by this method. Food arrived exactly an hour later as promised. There is a charge for delivery; I think it was six dollars or thereabouts. If paying by credit card over the phone, the delivery person will ask to see the credit card that you paid with along with a picture id. \n\nThe dishes were good; nothing spectacular, but sufficient for a take-out. The seafood tom yum had very little seafood but quite tasty. The roast pork noodle was okay. Pad Thai was quite good, and so was the beef larb. Portions were good, neither too little nor too much.  Thai iced-tea was delicious. The restaurant included Styrofoam bowls and plates, and plastic forks, knives, and spoons. They also did not skimp on the paper napkins, fortune cookies, and hot pepper sauce.  All in all, a good take-out experience and I would definitely order take out from them again. For the four dishes, drinks, a side-order of  steamed rice, and delivery charge, dinner was about fifty dollars."
        }, 
        {
            "index": 342, 
            "rating": 3, 
            "review": "Food was good but not happy with their service.  20%  Service charge for table of 5? Feel it was dishonest on their part because it was all written in their native language.  We almost give them tips until we asked them to about the extra charge.  Always read over the orders and don't be in a hurry to get out."
        }, 
        {
            "index": 343, 
            "rating": 2, 
            "review": "Omg...Thai being one of my utmost FAVE cuisines, I talked myself into letting my travel friends pick this place.  I knew what the outcome was going to be when I looked up the Yelp reviews for them. I wasn't going to have a great lunch is what I predicted.\n\nOur Lunch Order as follows:\n01.  Tom Yum Soup w/ Soup - 2 Stars\n- Probably the worst Tom Yum soup I've ever had. Watery in taste and only had mushrooms. I think we ordered the Shrimp one but do you see any floating or drowned shrimps. Neither did we. No heat, no flavor, the flattest soup ever\n\n02.  Water Spinach - 2.5 Stars\n- One of my FAVE Asian Veggies if not my FAVE Thai veggie dish. It was limp and watery. No flavor that seemed to come to our taste but just bland. It tasted like steamed Water Spinach. \n\n03.  Pad See Ew (Beef) - 3 Stars\n- Probably the best dish of our lunch. At least it tasted more like what Pad See Ew should taste like but theirs was more on the sweet side.\n\n04.  Beef Salad - 2 Stars\n- CHEWY Beef and not even spicy. It kinda like a non-Thai dish to me. Just horrible in taste. We didn't finish it.\n\n05. Chicken Basil - 3 Stars\n- 2nd best of our meal. It was really sweet and not spicy as most Chicken Basil is. The hint of Basil wasn't enough to give it a fragrant smell. Was hoping this dish was better than the rest. \n\n06.  Sweet & Sour Chicken - 2 Stars\n- This took 30 minutes to come out and when it finally did, it was such a disappointment. SOGGY, SWEET, and STICKY. 3 \"S\" is not ever good. The kids didn't even like it. Another one we tossed away.\n\n07.  Some SWEET Fish they recommended - 1 Star\n- Couldn't even tell it was fish, it had some weird sweet sticky sauce that was just too hard to eat through. The fish had a lot of bones. This was the 2nd WORST dish of our lunch. \n\n08.  Thai Ice Tea - 3 Stars\n- The only thing that tasted authentic today. \n\nCUSTOMER SERVICE - HORRIBLE and they were so slow.\n\nFOOD - Nothing there was authentic. I get it, it's a touristy area and loads of buses come through here. Anywhere that is a combo of 2 countries, usually isn't good. In this case, it was absolutely true...NOT GOOD.\n\nVERDICT - Never coming back and Never listening to my friends that recommended this place to us. I cut them some slack, they are not Yelpers so failures like this could happen. Won't happen again, though. Thanks but NO thanks!"
        }, 
        {
            "index": 344, 
            "rating": 5, 
            "review": "Best general tsos chicken ive ever had. Service was good. My drink was refilled when i needed it to be. Couldnt ask for much more. Definitely visit this place if you want great chinese food"
        }, 
        {
            "index": 345, 
            "rating": 5, 
            "review": "This restaurant is a very good choice if your wanting both Chinese and Thai food. Very authentic and the food is delish! Pad Thai noodles are a must try. \nThe decor is old and dated and could use a dusting, but other than that its a great place to eat."
        }, 
        {
            "index": 346, 
            "rating": 5, 
            "review": "My favorite place in town! Thai Chinese Vietnamese all in one place. I love it. I've been ordering from here for years and they never disappoint. Portion sizes are great. Always have some for later."
        }, 
        {
            "index": 347, 
            "rating": 2, 
            "review": "Tried this place for the first time tonight based on the other yelp reviews. I am so disappointed because I was expecting their menu to have basic chinese dishes like crispy house noodles, crispy duck, honey walnut shrimp, and bbq pork. Everything I wanted was not available or was altered from what I was used to. We ended up ordering chicken chow mein, kung fu duck and orange chicken. The chow mein was oily and reminded me of the chow mein you get at the fast food mall food court. The duck was good, wished that it was crispy. The orange chicken was overcooked and somewhat burnt. It contained mostly batter. A problem we had was that we ordered the duck quarter size because it was just my husband and I and they ended up giving us the half size. We thought it was big but we were hungry and no one came to check on us for us to let them know. We never realized it was half until we got the check and we already ate half so we just paid for it without complaining because it took them almost ten minutes to grab our payment. This is definitely a place I will not be coming back fo chinese again."
        }, 
        {
            "index": 348, 
            "rating": 5, 
            "review": "What a great find on Las Vegas! The Pad See Ew with Angus beef was divine. Can't wait to come back and try every single dish!"
        }, 
        {
            "index": 349, 
            "rating": 4, 
            "review": "When I first saw the location I didn't think I'd like it, or the service would be that great, but everyone was friendly, fast, attentive to our beverages.\n\nThe food was pretty good, we asked for a mild on the coconut curry, it was slightly spicier than mild, but still yummy.\n\nThe area was clean, service fairly quick, good food."
        }, 
        {
            "index": 350, 
            "rating": 3, 
            "review": "This place has great food, and decent service.  But it was deaaaaaaad, at 9pm on a Friday.  It is a medium sized restaurant (maybe 20-30 tables?), and about 60% of the tables were unoccupied.  \n\nI'm sorry, but when the restaurant is so empty, you can't help but wonder whether you made a good choice, even if the food tastes wonderful.\n\nMaybe we just picked an off day."
        }, 
        {
            "index": 351, 
            "rating": 5, 
            "review": "First time eating here and will definitely order again. Fast delivery and the sweet and sour jumbo shrimp was very delicious! 5 stars!"
        }, 
        {
            "index": 352, 
            "rating": 4, 
            "review": "This is an Asian restaurant that offers a Thai and Chinese menu. The restaurant looks old and outdated, however, the food is very good. I was also surprised with the portion sizes as they were pretty generous at a reasonable price point. \n\nWe ordered the Tom Yum Kha which had a very traditional Thai flavor. We also ordered beef and broccoli, pat see ew and the Thai beef salad which were all good choices. The best dish was the combination fried rice which was very tasty. We also had the sweet green chicken curry which was somewhat of a disappointment and I would not recommend it. I guess the part that I did not enjoy was the fact that they used cucumbers for this dish. \n\nOther than the curry, the flavors were great with mainly all of their dishes. So whenever you cannot decide between Chinese or Thai food, you can come to this restaurant and have the best of both worlds! Again, not a fancy place but this is a good and reasonable priced restaurant."
        }, 
        {
            "index": 353, 
            "rating": 2, 
            "review": "Girlfriend and I decided to dine in since the Vietnamese place within the plaza was sporting an hour long wait, we might as well have just waited. \n\nWe enter and it's pretty busy, but no line at the door so it seemed like we were going to get decent service.\n\nDamn man. We got seated and we were promptly brought water however we waited about fifteen minutes for someone to come by to take our drink and food order. After about twenty, a server finally came over and took everything at once. \n\nAfter another fifteen minutes, still no drinks so I got up and asked where they were, and as soon as she brought the food is when we got our drinks. The food was decent, however we had to get up, travel to a dirty table, and get our own soy sauce. Also the portions were pretty small. I ordered the general tso chicken and she had the bbq pork wonton soup.\n\nThe food like I said, was decent. It's just the service was so awful I couldn't take it, I honestly considered just walking out. There were only about 4 servers on the floor and obviously they were very overwhelmed. The bussers were amazing though, they really hustled their asses off. \n\nNext time hopefully the management staffs up for higher volume because I know this place has been in business for a long time and has great potential. Perhaps on a slower day we will check them out again if we are in the area."
        }, 
        {
            "index": 354, 
            "rating": 5, 
            "review": "On a budget [lost all of your money or planning on losing it?] but still want to eat good?  This place is freaking AWESOME.  A DEFINITE must-have in your Vegas trip's arsenal of contingency plans for when you are too hung over to leave the hotel for food, too broke or sick of the room service food, and you want variety.  They have an extensive menu, and they DELIVER?!?  \n\nI expected the Mr. Chau/Panda Express equivalent of Chinese fast food, so I was not excited whatsoever.  When the boyfriend read off the menu options and said they had an extensive Thai menu as well, I already knew what I wanted: Their green coconut curry w/ chicken.  I don't remember what the hell else everyone ordered, but it was all in my belly quick, and the coconut curry was the BEST I've had, hands down.  The chicken was tender and moist, the veggies were crisp, and the curry itself was a sweet and spicy blend of perfection.  Not too salty, and not too bland.\n\nI was surprised the price we paid, and bitter we wasted almost double that on 3/4 less food from room service the night prior.  We also waited JUST AS LONG for our food, too!  \n\nDefinitely put this place on your speed-dial when you're there.  It was nice to have a break from the traditional American food fare at all the buffets, and even better: it saved us $$$ when feeding a grip of hungry and broke people chillin' in our hotel room.  \n\nConvenience, price, speed, service, good Asian food = 5 stars."
        }, 
        {
            "index": 355, 
            "rating": 5, 
            "review": "Love this restaurant.  Their Mongolian (beef or chicken) dish is their specialty and you shouldn't miss it.  I have been here between five and ten times and the food never disappoints.  The waiter frequently doesn't speak English perfectly but we have never had a problem.  Our orders come out right, very hot and cooked perfectly."
        }, 
        {
            "index": 356, 
            "rating": 4, 
            "review": "There were plenty of seating, nice decorations, and service was fast.\n\nThe reason why I took off a star is the portion size are a little on the small side. Between the 7 of us, we ordered about 5 different dishes with extra rice and usually at most places, it's enough but not here.\n\nThe pad thai, green curry, and papaya salad were delicious. I was satisfied with the taste of the food. My taste buds were giving me high fives. I believe this is primarily a Thai restaurant so get Thai dishes and NOT the Chinese. One of the stir-fry dishes we ordered was meh."
        }, 
        {
            "index": 357, 
            "rating": 4, 
            "review": "Love their chopped chicken with mint and pineapple fried rice.  I used to live fairly close and this was the go to Thai restaurant for my roommate and me.  Delivery was always super quick, orders were always correct and everything we ever orderd was delicious!"
        }, 
        {
            "index": 358, 
            "rating": 5, 
            "review": "I have been coming here for years and it is hands down my favorite Chinese and Thai restaurant in town. Hundreds of items to choose from and anything I've ever ordered has been delicious. Also, quite affordable."
        }, 
        {
            "index": 359, 
            "rating": 5, 
            "review": "Sooo good. I ordered delivery and they were at my room within 35mins. I ordered orange chicken and vegetable fried rice. Both were excellent. I will eat here every time I am in Vegas!"
        }, 
        {
            "index": 360, 
            "rating": 1, 
            "review": "Ended up in this disaster after one of our usual places was full of a tour group. It took around 10 minutes for anyone to come to the table to take our order after being sat. Little did we know this was the beginning of a pattern.My coworkers and I ordered off of the lunch menu (which for the price looks pretty good, I guess that is what gains them the one mandatory star above). Then the waiting game it took a very long time to get the food. The lunch special comes with egg and flour soup which we received first. It was bland and not very good, had to add soy sauce to it to make it even palatable. About 30 plus minutes later we received our entrees. The food was underwhelming at best. I had the Kung Pao chicken with fried rice, egg roll and Thai fried chicken wing. The chicken wing and egg roll were not too bad, but the rest was sub par and not very good. I believe I could have gotten a better meal at an Asian fast food restaurant. Then it took close to 15 minutes to get our check, followed by another long wait to get it back. It caused one of my coworkers to miss a meeting. Not sure how this place has made it as long as it has."
        }, 
        {
            "index": 361, 
            "rating": 3, 
            "review": "I am going straight neutral on Kung Fu, but I have to erase from my memory the unswept, noodle-laden floor. When we arrived on a Sunday evening, the floor was a disaster. My husband said, \"Don't look down.\" Good advice.\n\nMoving beyond the floor, which I am sure at times is immaculate, we came in to try some Thai. When I go for Thai, I go for curry. I ordered the panang tofu, as that was the curry listed under their vegetarian selections. I forgot to ask if they were able to do soft tofu instead of fried, and the dish came with fried. I thought the tofu was perhaps over-fried, as the texture was a bit chewy, and the flavor a little greasy. As for the curry itself, it had a very heavy peanut flavor. Based on what I know, the inclusion of peanuts in curry is sometimes a personal preference of the chef, and some people may enjoy the flavor. However, for me, it was overly sweet and the curry was incredibly thick. I kept telling my husband that it tasted like peanut butter and tofu, which wasn't pleasing to my taste buds. This is not a dish I would order again.\n\nThe service was efficient.\n\nOne bad dish and some lackluster floors creates a less than ideal first impression. Still, there is a whole menu of potential, so as I said in the beginning, I'll stay neutral."
        }, 
        {
            "index": 362, 
            "rating": 5, 
            "review": "Unbelievably fantastic thai food at a very reasonable price! I had the Mongollian Beef at the heat level of five (they ask you what heat level you want your food from 1-10) and it was simply PERFECT! Great service too. \nSuggestion on how to get there if you're staying on the strip: Take the free shuttle from either Harrahs or Ballys to Rio and then walk about a quarter of a mile up valley view rd. to Kung Fu. Believe me, its worth the walk. Delish!"
        }, 
        {
            "index": 363, 
            "rating": 3, 
            "review": "Omg!! Pad see ew with deep fried pork belly(moo grob)....a must order\nNot on the menu but ask for it\n5 stars!! everything else is ok"
        }, 
        {
            "index": 364, 
            "rating": 4, 
            "review": "I've lived in the Bay Area for 10 years before I moved here in 1999. While living there I worked for a small Chinese Restuarant  called Jade Palace of Newark. They have great food! Living here nearly 15 years, I have been trying to find good Chinese food. It became a mission. Then one day I walk into this establishment because my business is in the same plaza, I tried with the beef salad. Yes, I know that is Thai but, I loved that they gave more meat, and it was delicious. Then the BBQ pork won ton soup. Yum! Then the egg foo young! A must try. I just wished they would serve POTSTICKERS the Jade Palace served them. I'm still on the hunt for them. Good job Kung Fu Thai  but, that is my to go from here on out."
        }, 
        {
            "index": 365, 
            "rating": 2, 
            "review": "First off I'd like to preface this review by saying that I've being going here for at least the past 6 years. Service has always been just alright, but you would think since I come I'm in quite a bit, that'd would have at least changed. Nope. I also want to say that by far, they have my FAVORITE Tom Yum and Yum Woonsen. Order it every time. No other restaurant makes it as good as they do. But to the docking of stars. My husband no longer wants to dine here after basically being ignored one visit. We were barely acknowledged, just enough so that we finally got to place an order after being seated for 20 minutes ( again, we know what we want and just wasn't approached prior to this.) When we got our food, I was willing to dismiss the lack of service in the beginning, because the food is just so dang good and  I had an ok history with them. Buuuut, we weren't even on their radar during the meal. Our waters were not once refilled (or offered), no one asked how our meal was, or even if we would like anything else. Nothing. My husband was furious. We talked to them about how we felt neglected from the awful service, and their decision? Give us 10% off. Um. Ok. We are very reasonable people and are pretty polite, even if it comes down to complaining. Had we had a large bill, 10% would have been sufficient. But for two meals, they basically covered tax. Poor customer service recovery, in my opinion, especially for someone that has frequented there often. \nReally disappointed."
        }, 
        {
            "index": 366, 
            "rating": 5, 
            "review": "This place is like our Thai Food home. We have a party of 5 at least, and we visit them about once a month or more. Have always liked their food. Service depends on who you get as your server. But it's not like they are really bad. We once wanted one of our dishes kinda customized and the server helped us do it, and we had a great deep fried Calamari in butter sauce. Amazing!!!\nThe food is always great, nothing to complain there. If you love Thai food and want a good authentic taste, this is a sure hot point!!!!"
        }, 
        {
            "index": 367, 
            "rating": 5, 
            "review": "This place is awesome!! The food is amazing and the wait was very short!\nI highly recommend the Combination Appetizer and the Egg Flower Soup:)"
        }, 
        {
            "index": 368, 
            "rating": 2, 
            "review": "Last day of vegas behind heading to the airport. We have 5 different dish. Panang curry, combination fried rice, garlic chicken, wanton soup and Pai Thai. First this is the first Thai restaurant that don't serve yellow curry. We heard from the other group said the same thing as well. All the food was below average in my opinion. The panang curry doesn't have any curry favor​, it was made by the peanut butter. The combination fried rice has too much moisture in it. Garlic chicken little too favorful, but if eat it with rice. It will be fine. Pai Thai was kinda disappointing. It lacks favor and it doesn't taste like Pai Thai. It tastes like Chow mein instead. Let's talk about good points for this restaurant. The service from the staff is good and the food come out quickly. The price and food portion is average. Overall, due to the below average of food I probably won't come back."
        }, 
        {
            "index": 369, 
            "rating": 4, 
            "review": "The food was great! I ordered the papaya duck salad in which the duck was strong and very flavorful.  Then I ordered the Tum Tum seafood soup,  I got a number 5 in which was very spicy.  Had to drink lots of water.  I would recommend that you get a 3 if you lie medium spicy foods lol"
        }, 
        {
            "index": 370, 
            "rating": 1, 
            "review": "Nasty made me sick, go somewhere else plenty of good choices here in Las Vegas....BEWARE"
        }, 
        {
            "index": 371, 
            "rating": 5, 
            "review": "I really like this place.\nWhen we first moved here, we looked for a Thai place, and we couldn't believe how many were here!\nAnd most of them were within a city block of one another.\nSo, naturally, we had to try each one.\nAnd, they were all pretty good.\nBut this place was better.\nThe Tom Yum Gai (chicken lemongrass soup) was the best by far.\nIf you get the two-person portion, it's enough for three or four.\nAfter the soup, my wife is done, but I get a plate of Thai Bok Choy (Chinese cabbage cooked Thai style).\nVery fresh and the flavor really shines.\nThe fact that they combine Thai and Chinese foods on their menu, is really smart.\nI've gone there for lunch, early dinner, late dinner, Christmas Eve, and Christmas day, and they're always almost full, but I've never had to wait for a table.\nIt's a pretty sizable place.\nI don't drink, but you can't miss the huge bar on the right side of the dining room.\nService is good, prices are reasonable.\nI'm getting hungry just thinking about it!"
        }, 
        {
            "index": 372, 
            "rating": 4, 
            "review": "Great service.  Food was excellent.  The price was very reasonable for a soup, three plates, steam rice and a couple of beer.  Did I say there were only two of us.  The bill came out a out $50.  Awesome.  We will be back."
        }, 
        {
            "index": 373, 
            "rating": 4, 
            "review": "Been there 3 times. Each time was really good. (Got it to go each time). First time I got pork chow mein. Really enjoyed it. Other two times I got Mongolian beef. You get to choose how spicy you want it from 1-10. First time I got a 5, then I got an 8 the second time. Going back to 5! Planning on going back!"
        }, 
        {
            "index": 374, 
            "rating": 4, 
            "review": "The stucco walls are really smooth. I mean brilliantly done. Whichever Kung Fu Master learned to lay stucco must have been a 7th degree in construction. I mean . . . keeeyyy-yyyahhhh, they chopped the hell out of these smooth walls.\n\nI bow to the stucco master and his smooth kicking style. The walls were kicked into submission. Arigotu Mr. wall-botu!"
        }, 
        {
            "index": 375, 
            "rating": 4, 
            "review": "Unmistakably Kung Fu Thai is a hidden gem amidst the easily overpriced Asian cuisine in Las Vegas. Step one to finding delicious and affordable food in Vegas is to get off the strip. So, that's what my family and I did by coming to this restaurant, located in Vegas' \"chinatown\" or along Spring Mountain Road. \n\nCome here a little before the usual dinner rush on weekends about 6 o clock to avoid waiting. Right after we arrived, multiple parties came and had to wait for a table because the whole place filled up so quickly. \n\nYou must try the garlic beef, pad thai, and papaya salad. Each dish was executed well and the food was brought out fairly quickly. \n\nMy family ordered 5 dishes for 5 of us and there was still some left over. The total came out to be under $60 which is really not bad at all. \n\nThis place is now on my list for some good Thai home cooking if I'm ever sick of the buffets and sky high prices on the strip. \n\nP.S. Check in for a free drink, +$1 if the drink is Thai iced tea!"
        }, 
        {
            "index": 376, 
            "rating": 2, 
            "review": "After reading the good reviews I decided to give it a try.  Nice ornament and decoration... that is the only thing I like about this place.  I ordered from the Thai side of the menu, but very very plain, so plain that I don't even remember what I ordered."
        }, 
        {
            "index": 377, 
            "rating": 1, 
            "review": "The worst restaurant I've ever been to! The food was disgusting and the waitresses were rude af! Might I add we had about 10 ppls at our table & they kept giving us ONLY a few napkins at a time knowing we have a lot of people's at our table including Childrens  Never again !"
        }, 
        {
            "index": 378, 
            "rating": 3, 
            "review": "Me and my husband were staying at stratosphere, and i was craving chinese food and unfortunately, stratosphere did not serve chinese food .  I was looking thru the las vegas phone book and found them, I was skeptic but tried it anyways because they delivered. The food was good. My husband and I liked the shrimp fried rice and their pad se-ew was yummy."
        }, 
        {
            "index": 379, 
            "rating": 1, 
            "review": "After waiting more than TWO HOURS for a delivery, I was shocked to see such a small amount of food for the $60 spent.  STONE COLD food I should mention.  The Thai wings and fried shrimp were just huge blots of fried  cold batter.... lots of dried out boiled rice and two very small containers of tasteless, limp cold food.  THEN they hit me up for a $4 delivery charge............\n\nGO TO WEERA - HEARD EXCELLENT THINGS AND WILL TRY IT NEXT TIME.  KUNG FU THAI - YOU SUCK!!!"
        }, 
        {
            "index": 380, 
            "rating": 3, 
            "review": "Very decent Chinese buffet.\n\nKung Fu gets praise as a decent and affordable Chinese food buffet offering.\n\nThere really isn't anything that was truly amazing here but in this place's defense, everything was consistently good.  Not amazing, just good.\n\nA lot of solid expected sightings like lo mein noodles, sweet and sour pork, kung pao chicken, & eggrolls.\n\nAgain, nothing that I had was amazing but I was very pleased with the more than acceptable quality of the items available.  Nothing seemed to be sitting for long periods of time and all of the foods were being served at the appropriate temperature.\n\nOverall: Decent offering of Chinese buffet food at affordable prices.  Great place to stuff your face full of okay food.  Thumbs up for not making me feel like puking afterwards as most low end Chinese buffets do."
        }, 
        {
            "index": 381, 
            "rating": 4, 
            "review": "Ive gone here multiple times on Vegas and it hits the spot every time! I went a few weeks ago though and found the waitress a leetle on the rude side, but everything else was fine.\n\nThis place has a large menu and has thai dishes, but also some chinese ones as well! I guess that makes sense since the place is called kung fu? Lol.\n\nIve tried multiple items and liked everything. I am boring and almost always get a pad thai though. Found the noodles to be a little sog this last visit, but flavor was good."
        }, 
        {
            "index": 382, 
            "rating": 5, 
            "review": "Me and my friends call this our last stop before leaving Vegas. The orange chicken and Mongolian beef is my absolute favorites. Best hangover food other than stake and eggs."
        }, 
        {
            "index": 383, 
            "rating": 5, 
            "review": "First time dining here yesterday and our experience was pretty off the charts. Service was quick and friendly. I recommend getting the Combination Pad Thai, Orange Chicken, & Garlic Sauce Chinese Broccoli! Tasty food for a reasonable price."
        }, 
        {
            "index": 384, 
            "rating": 4, 
            "review": "Always get the Mongolian beef spicy #7. You tend to get better service if you have someone asian in your group."
        }, 
        {
            "index": 385, 
            "rating": 3, 
            "review": "Yum! I had the pleasure of trying this place out when a couple of my coworkers decided to order some take out! The shrimp and pad Thai was my option of entree! I also ordered the fried wontons which I wish I would've got more clarification that they weren't the ones with the cream cheese because i was slightly disappointed once they arrived. For future reference I was told to order the crab ragoons if I wanted the cream cheese. I dinged them for a few stars because the delivery driver took over 2hrs for the order to arrive and then the customer service I received over the phone was horrible. The food is what would get me to return if I ever do!"
        }, 
        {
            "index": 386, 
            "rating": 4, 
            "review": "I like the food here is very tasty we always try to come here when we visit Vegas. They have Chinese and Thai and everything I've tried is delicious and good quality, service can be better though. The place is very outdated carpet looks dirty and overall needs a good remodel to make it more appealing to come back. They can accommodate large groups."
        }, 
        {
            "index": 387, 
            "rating": 1, 
            "review": "Here now.. very very bad service. Don't come! Food ok.. bad service! Slow... I had to give it star other wise I wouldn't have!"
        }, 
        {
            "index": 388, 
            "rating": 3, 
            "review": "I can only rate the Thai part of the menu, which was good. Nothing that stood out as spectacular, but good. Be warned that their idea of \"medium\" spice is pretty spicy! We heard others at the table next to us saying the same thing."
        }, 
        {
            "index": 389, 
            "rating": 4, 
            "review": "This place is a little bit of a dive and you are definitely left in the front area for a while before being seated.  When we were waited on, the food came out quickly and was really good.  My office is close by so normally, I have it delivered.  It's a little pricey that way but the portions are much bigger.  I wind up having tons of leftovers.  \n\nMongolian beef is my favorite.  The Tom Kha is really good too.  Totally worth trying."
        }
    ]
}