{
    "category": "Las-Vegas", 
    "entity": "808-Sushi", 
    "avg_rating_stars": 3.642156862745098, 
    "review_count": 408, 
    "reviews": [
        {
            "index": 1, 
            "rating": 2, 
            "review": "This was a back up to our #1 choice AYCE sushi we wanted. We end up here due to the wait time at the other restaurant. \n\nI gots to say the rolls were meh, nigiris were even worse, sushi was far from fresh, and just everything they had was not too impressionable. I was quite disappointed with my meal here and the best thing about this place is probably the great service. Waiters and staff were all super friendly and nice. \n\nI'm giving some stars cuz of service but I could do without this place for sushi. :/"
        }, 
        {
            "index": 2, 
            "rating": 4, 
            "review": "Great food, great prices, great service!!!  Will write more later and upload some pics!\n\nLet's just say I live across the LV Hilton, but it's worth the drive SW!"
        }, 
        {
            "index": 3, 
            "rating": 4, 
            "review": "The 808 special is awesome. Wish that they had shrimp tempura roll and more options for ahi poke!"
        }, 
        {
            "index": 4, 
            "rating": 4, 
            "review": "I used to go here a lot because it's close and my friend used to work there. I have to admit that I haven't been back since. would rather make the drive to goyemon. anyway, if u go here you won't leave disappointed. garlic chicken is a must as with the mochiko chicken. the rolls and fish are ok. try the appetizers as they offer some delicious choices. staff is friendly. decent ayce sushi. try it out!"
        }, 
        {
            "index": 5, 
            "rating": 5, 
            "review": "Great happy hour, tasty rolls and friendly service.  Our go-to place for affordable and delicious sushi in Vegas."
        }, 
        {
            "index": 6, 
            "rating": 5, 
            "review": "Hey! Wanted to say Great Job to the staff! We were a party of 13, and they handled everything well for us. Service was fast and accomodating with smiles! Food was DELICIOUS :D i ate till my buttons were about to pop! Lol.. Thank You guys!"
        }, 
        {
            "index": 7, 
            "rating": 5, 
            "review": "This was an amazing first experience. I loved the sushi along with the great service, came here with my favorite person in the world Arissa and we ate a couple of plates of sushi. This was amazing in my experience. I loved this place so much that I will recommend it to anyone. I am definitely coming here again."
        }, 
        {
            "index": 8, 
            "rating": 4, 
            "review": "First time here, we always pass this place so finally decided to stop in. The restaurant itself is a small, quaint place not a ton of seating but when we arrived we got sat right away. It did fill up quickly however so I'm going to chalk it up to good timing. \n\nWe intended to just go in for a few rolls but then we realized they had AYCE so why not. The AYCE menu is a smaller than some other AYCE menus offered at some near by sushi restaurants but pretty comparable to the type of sushis. The sushi was pretty fresh and came out fairly quick, which is a plus because nobody likes to wait too long in between orders.\n\nService was definitely one of the best I have had in any restaurant. I think the server was the owner or maybe manager, either way he was on top of it in every way! He made my son laugh a lot so that was another plus!"
        }, 
        {
            "index": 9, 
            "rating": 4, 
            "review": "Awesome happy hour. Probably best sushi for your money, but not the best sushi in Vegas. Customer service is great, staff and sushi chefs have always been very friendly. Once we even received a free roll that had been made by mistake. The beer on the happy hour menu is cheap and a big bonus if you enjoy a drink with your food. Little out of the way for most but definately worth a try if you love nearby."
        }, 
        {
            "index": 10, 
            "rating": 3, 
            "review": "Nothing stood out to me during my dining experience compared to other sushi restaurants. That being said, we did enjoy all the rolls and appetizers (especially since I'm from Hawaii) we ordered. I like the fact they offer AYCE as that gives you the opportunity to try everything. Also, the price is comparable to other AYCE Sushi restaurants ($26.95 for dinner). It's a good spot, but just not my favorite. Definitely give it a whirl if you're in the area and in the mood for sushi!"
        }, 
        {
            "index": 11, 
            "rating": 4, 
            "review": "All you can eat sushi!!!  \nThis is a review from someone who does not eat raw fish but loves sushi :)\nThey had a good selection of choices, and they weren't acting like they were afraid that you would order too much.\nThe service was good and we were happy."
        }, 
        {
            "index": 12, 
            "rating": 4, 
            "review": "Lalalahve this place. I only trusted one sushi place here in the LV till I got introduced to 808 sushi. \n\nThey got the Hawaiian faves, poke, mochiko ckn, garlic chicken, and a dessert with apple filled rolls with ice cream. \n\nI gave them a four star only because they don't do half rolls and the service could be quicker. \n\nOverall great food/sushi."
        }, 
        {
            "index": 13, 
            "rating": 1, 
            "review": "Not a fan.  Went on a Sunday night around 6:30 and the service was already backed up.  We did all you can eat and sat at the sushi bar.  Waited a good 15 mins To order sushi however the sushi chef was busy and looked like he didn't want to be interrupted.  We had to literally demand him to take our order, he didn't even acknowledge us. The nigri orders are extremely small and for the price I expected a lot more.  Yellowtail didn't even seem sushi grade.  We were so fed up with waiting that just got the tab and left."
        }, 
        {
            "index": 14, 
            "rating": 3, 
            "review": "We came on a Friday night and they told us that it was going to be an 1.5hr wait so we left and came back at 12pm on Saturday to find out they don't open until 4. LOL. Our fault. Later that day, we came back and again had to wait 1.5 hours so we just decided to order to-go. haha. We used the Groupon (20 for 40) to order the widow roll, 2 salmon skin hand rolls, a cali hand roll, seafood yakisoba, and beef don for 3.50 extra\n\n- Long to-go order wait. 1.5hr \n- Widow roll: soft shell crab with avocado. lots of avocado. more soft than crispy shell. I'd get the 808 special instead\n- Salmon skin: Stuffed with salmon skin. More skin than salmon! Tasty! More! :)\n- Cali hand roll: more imitation crab than the roll. less rice\n- beef don: Almost tastes like yoshinoya. lol \n- UFO Instant Yakisoba with seafood pieces from the sushi\n- I suggest coming here during their happy hour only for a deal. 7-9pm fri and sat even drinks! Perfect :)\n- Go to 808 tapas"
        }, 
        {
            "index": 15, 
            "rating": 5, 
            "review": "Can't go wrong here great sushi at a cheap price! \n\nThe staff is always friendly and are on top of their game when it comes to service. Now as far as the food it's good quality and always fresh! I only come during happy hour and I always get the garlic chicken which is full of flavor and very tender plus it's only $2.95 I believe which is craziness! I also order the crunch roll which is like 3 bucks and I order the deep fried Cali roll which is delicious and also costs like 2.95. So I end up getting 3 different items for the price of 1 roll at every other sushi place. \n\nGood sushi\nGood service \nGood prices \n\nCan't go wrong here!"
        }, 
        {
            "index": 16, 
            "rating": 3, 
            "review": "I purchased a groupon to try this place out. Small building limited seating so go during the week day. Happy hour its always busy and they open at 4:00pm their will be a line waiting to get in. Food is good their 808 signature roll is the best. Prices are reasonable and you can also choose all you can eat just not with the groupon the happy hour and all you can eat do not apply with coupons. My daughter age 11 even ate sushi their and she normally hates fish so when I say its good its good. Only thing I would change is the music for an hour and 1/2 I had to listen to rap music as a business owner myself I would choose something that is more suitable felt like I was in a night club not a sushi restaurant."
        }, 
        {
            "index": 17, 
            "rating": 4, 
            "review": "My favorite sushi bar in the SW.  \n\nAYCE must haves:\n*MISO BLACK COD!  This is incredible!  Do not miss this\n*808 Special!  I'm a pretty generic sushi lover, meaning I'm not huge on sashimi and I like the sweet, tempura and fried rolls that appeal to most everyone; so with that said, this roll appeals to my taste.  It is just a damn good roll, that's has a a little kick to it as well!\n\nHappy Hour must have:\n*Ahi Poke Salad:  (Last time I got this, it was served on lettuce instead of seaweed, but I got it togo...i like the seaweed better).  It's big and plentiful of tender, marinated ahi tuna!  It's great!\n\nThe food is great and the service is awesome!  Definitely give 808 a shot!"
        }, 
        {
            "index": 18, 
            "rating": 1, 
            "review": "Worst sushi experience.  We are not sure why this restaurant has any positive reviews.  Save your money and/or go to another sushi restaurant.  Do not order the teriyaki chicken or anything else for that matter.  You'll know you should probably leave as soon as you walk in.  This sushi restaurant is probably featured weekly on dirty dining."
        }, 
        {
            "index": 19, 
            "rating": 4, 
            "review": "Pretty dam good sushi spot! All you can eat for $25.00. They offer a seared salmon sashimi, kalbi ribs and this delicious garlic chicken as some of the many sides included in the all you can eat menu yummmmmmmmmmmmmmm!! The quality of the sushi is great! The spider roll and the 808 special roll is awesome and my fav! The service is great and super speedy gonzales style!!"
        }, 
        {
            "index": 20, 
            "rating": 5, 
            "review": "For me 808 sushi has the best AYCE in town. Now I know there are so many AYCE and gosh knows everyone has their favorites. Personally the things that makes it stands out above the rest is the appetizers or pupu selection for one. They have things that cater too the 808 style like kalbi action, tonkatsu style pupu, and way they cook it all local style. The quality of the fish is top notch for me everything tastes fresh and looks awesome. The speciality rolls have nice diversity too them. I enjoy the spicy pele, dragon roll for me automatic, and LOTS LOTS of nigiri ones. \n\nThe wait staff is very friendly and on top of it. I must admit that they forgot about one round (I went with roommate dinner bday celebration) but going four five rounds lot too write down. Lol! The only true thing pick at is if the place is busy (its hit or miss but sure weekends they do well) don't expect the sushi too come flying at like other AYCE sushi. They only have two sushi chef at most so full house been too might take time. Still think worth it plus you can relax more enjoy the pupus!\n\nThe place has bunch of tvs. Monday night football not ask for more sushi on and watch MNF. The owner is from Hawaii so all about support another local boy! Roots."
        }, 
        {
            "index": 21, 
            "rating": 4, 
            "review": "Looking for a new sushi place, 808 sushi had a few reviews, so my husband and I decided to try it.  We had good timing, no wait, and they were having a \"happy hour\" with selected items including sushi for great prices.  I love anything with spicy tuna and I immediately picked out a few rolls.\n\nEverything came fresh, made as we waited, the initial order, I believe included about six items, came rapidly.  We loved the garlic chicken, shrimp tempura, Ahi Poke, and the mochiko chicken.  I loved \"da kamikazi\" roll, the dragon roll, Haleakela and Hawaiian style roll.  \n\nWe had those things eaten quickly and eagerly picked another round.  The whole time, the place was filling up with more customers.  But we still continued to get fast service.  \n\nWe enjoyed everything and certainly would make this a regular sushi favorite."
        }, 
        {
            "index": 22, 
            "rating": 3, 
            "review": "Bought a Groupon for this place and time was running out to use it. It was crowded when we arrived but only waited 10 mins for a table. \nFood- sushi was average, nothing that great. I had some noodles with shrimp, scallops and squid. Not bad, like an average LoMein dish.\nService- service was excellent! Every waitress and the hostess walked around making sure every table was taken care of. It is too far for me to go back for a second trip.i also enjoyed the Reggae playing the whole time!"
        }, 
        {
            "index": 23, 
            "rating": 5, 
            "review": "Very clean, fantastic service, delicious food... and $1 sake during happy hour! Awesome sushi, and the blackened cod is to die for."
        }, 
        {
            "index": 24, 
            "rating": 4, 
            "review": "Love this place and it's a new favorite! Great happy hour specials, service, and the Garlic Chicken is the biz naz"
        }, 
        {
            "index": 25, 
            "rating": 2, 
            "review": "It's the day before NYE 2011 and I'm here with my family visiting from Hawaii for an end of the year night out.  It's not the first time we've been here as the food here is quite good and is quite evident by the fact that there is a half hour line waiting to be seated.\n\nUnfortunately, while the food on the appetizer menu is quite tasty and their sushi is average, the service tonight was below average.  Our server was busy and as attentive as she could be, but the issues were rather with the items on the menu which were out of stock / not available.  While she informed us of both the hamachi kama and salmon kama being out, she failed to let us know that the uni (quite possibly one of the best items on the menu) was also unavailable as their vendor didn't have any in stock to deliver.  We found out about the lack of uni when she came by to ask what we would like for dessert as all of us were anticipating another plate of sushi to be delivered to the table.\n\nNow let me explain...  I could have totally understood this if there was some mention made of this before or while we were putting in our initial order.  I could have even been okay with this (although disappointed) if this was mentioned in the middle of dinner.  Instead, my family waited in anticipation for a plate of uni nigiri and was instead greeted with the information at the near end of our meal.  Uni itself is sea urchin and is definitely not for everyone.  No matter where you order it, you will either love or hate it.  For some I think it's a consistency issue.  In the case of my family, we love it!  We have actually walked out of other sushi bars here in Las Vegas because they didn't have any.  Las Vegas has many sushi bars and almost limitless choices of great food.  \n\nOver the past few years, we have actually followed the owner of this establishment from other places he has co-owned or worked at as the food has always been good.  Tonight when my father approached him about the lack of uni, he seemed dismissive and quite unapologetic to the point where my father was going to leave an 8 cent tip on the check to get his message across that perhaps in this economy that service and humility toward your customer can only get you ahead while the adverse will get you the opposite.  I left an additional $20 with the check (and my father's 8 cents).\n\nThe sushi here is okay.  I actually drive a cab and have been recommending this establishment whenever I'm asked in person or on the dispatch radio about a sushi bar.  The items on the appetizer list are awesome and I definitely recommend the Garlic Chicken and Tako Karaage.  Tonight was just an unfortunate experience and I definitely feel that the situation could have been handled differently.\n\nI'll be back again in the new year and hope that things are better."
        }, 
        {
            "index": 26, 
            "rating": 5, 
            "review": "Every time I come here the food is perfect !!!!! One of my favorite sushi spots in vegas! They make it right every time always happy to come here"
        }, 
        {
            "index": 27, 
            "rating": 1, 
            "review": "This is not sushi it is rice with one or two pieces of fish, not the way I think of sushi at all.  Also the service is awful beyone belief.  They purposedly forget everything so that you wind up not benefitting from AYCE."
        }, 
        {
            "index": 28, 
            "rating": 3, 
            "review": "Been here a few times and nothing bad but also nothing that makes you go Wow!  They could do better with seating or decor? The food is good and we like to come here for happy hour.  It would be nice to give it a little more personality to have a better atmosphere. Our server was Ok, not as attentive. A few raised hands and she seemed to miss me each time but we got her attention. Its been a couple months since we came here, but that's what I can recall. So nothing ooooh, but nothing ahhhh...\nJust in the middle. \nLike if you didn't want to wear makeup and dress up, this is a place to go."
        }, 
        {
            "index": 29, 
            "rating": 4, 
            "review": "We love this place. Granted as other reviewers have said it change since it first opened. But it still a great place to get mochiko chicken.. Teri beef and some sushi too."
        }, 
        {
            "index": 30, 
            "rating": 5, 
            "review": "Absolutley love this place! My husband and I have been coming here since we were dating and now were on baby #2! \nMy son loves it here and they treat us like family!\n\nThere are other sushi places that are good too but their prices you just cant beat! We always leave so  full without ever breaking our pockets!"
        }, 
        {
            "index": 31, 
            "rating": 1, 
            "review": "WORST experience here last night. \nFISH IS NOT FRESH!  \n\nPlace was not crowded, but service was real slow and disorganized for some reason. They kept bringing others' orders to our table. Waitresses were not very knowledgeable about their sauces or dishes. I found the servers to be sub-par in their menu knowledge and friendly attitude.  \n\nOrdered sushi, nothing special. Our miso salmon kama tasted FISHY AND OLD, which ended up making me nausious so when we told our server about the taste, she shrugged us off. Later when we asked again, she said there should be nothing wrong with the taste because they got them in 'yesterday'. That was it. I couldn't bring myself to eat anymore. \n\nWILL NOT BE BACK!!!!  I'm not happy at all with the way we were treated tonight.  Save your money and eat at a sushi bar that gives good service.\n\nSAVE YOUR MONEY! GO TO SUSHI FREAK OR GOYEMON INSTEAD!!!!!"
        }, 
        {
            "index": 32, 
            "rating": 2, 
            "review": "The sushi is not worth the amount you pay.  Probably won't be going back again. Should have listened to the posts below but I thought I'd give it a fair chance."
        }, 
        {
            "index": 33, 
            "rating": 4, 
            "review": "This place is really good. Usually busy but never packed. They have a good HH if you dine in but I usually get food to go. I love the ahi poke and the garlic chicken. My bf doesn't go for seafood but he also loves the garlic chicken (we usually get three orders between us!) and the beef tempura."
        }, 
        {
            "index": 34, 
            "rating": 5, 
            "review": "Awesome restaurant, love their Mochico chicken and their sushi is always fresh.  Go during their happy hour and the prices are the best in town :) Very reasonable for the amount of food you get!!!!"
        }, 
        {
            "index": 35, 
            "rating": 4, 
            "review": "Great place for lunch or early dinner!! Happy hour specials are amazing: 4-6:30 pm, almost every day!\n\nThe small dining area seems a lot bigger than what it really is due to the surrounding glass window walls. Get a nice view of the shopping plaza while being seated, while enjoying the typical sunny vegas weather inside.\n\nPricing, convienance, all you can eat specials, and service are among the reasons I chose to rate this one, 4 stars!"
        }, 
        {
            "index": 36, 
            "rating": 3, 
            "review": "Got 15% OFF entire bill with my iDcard which is pretty Awesome.\nService was fast and workers are pretty cool.\nFood is Good but it sucks that the desserts are limited to 1 per person.\nRestaurant is pretty plan inside but it's OK. I'm not there for the interior design.\nI would come back and hopefully give it a 4 stars when the dessert limit changes =)"
        }, 
        {
            "index": 37, 
            "rating": 4, 
            "review": "Enjoy coming here for their Happy Hour. Although it's Happy Hour, they maintain a good quality and the seafood is fresh. The service is great, even during the busy happy hour, a server always come around to take our empty dishes and see if we would like to add anything."
        }, 
        {
            "index": 38, 
            "rating": 4, 
            "review": "I'm a fan!! I did the AYCE with the BF and ordered a bunch of appetizers and sushi... The service was great, they made sure to keep checking on us, our orders and if we needed anything. \n\nI must say, I enjoyed the appetizers more than the sushi. However, this doesn't mean that I did not enjoy the sushi.... But those appetizers.. DROOL.\n\nTRY THE \n*Mochiko Chicken: Sweet, fried chicken with a hint of heaven!\n*Poke (both ahi & tako): POKE, what more can I say but bomb.com!\n*Garlic chicken: The garlic cousin of the mochiko cousin.\n*Tempura shrimp: Simple but oh delicious.\n\nThere's more but those were my faves.\n\nIf you're low on cash, go during lunch. It's 20.95, a hit for AYCE lovers such as I!"
        }, 
        {
            "index": 39, 
            "rating": 5, 
            "review": "Absolutely amazing food. Best sushi I've ever had. 10/10 Customer service was great too. Will definitely be coming back."
        }, 
        {
            "index": 40, 
            "rating": 5, 
            "review": "It's odd to read the bad reviews for this place. I always get good service and the people are always super friendly and polite. I've been coming here for a couple years now. It's convenient on my way to or from work. I usually sit at the sushi bar because it's a little quicker and I love asking the sushi chefs questions about interesting looking things they're making (and they never seem annoyed by my questions which is cool). I love this place. Try it if you're in the neighborhood, especially for lunch."
        }, 
        {
            "index": 41, 
            "rating": 5, 
            "review": "THIS PLACE IS BOMB!  Happy hour is super legit.  AYCE is also a good choice if your down to grub.  Me and my GF hit this spot about once a week.  We crave their 808 special roll and with 50% off for happy hour, it's definitely a treat.  Their Miso Black Cod and Kalbi is also very good if your doing AYCE @ dinner time.  The staff is nice and they are all 808 fsho.  I'd recommend this place for anyone looking for top notch sushi."
        }, 
        {
            "index": 42, 
            "rating": 4, 
            "review": "Located in Summerlin (west of the 15, off the 215).  I used to hate AYCE places - until I came to 808.  I stopped by here on my latest trip to the Ninth Island (Vegas), based upon my yf Lisa S' review (from Vegas).  I also wanted to support my Hawaiian bruddahs.  Lisa S' review was spot on with 4 Stars.\n\nAs opposed to the food laying out like most AYCE places, they make the food to order.  At $26.95 and $3 for a large Japanese beer or $1 sake during HH, its a good deal.  My friend and I ordered the following from the app menu:  Ahi and he'e (tako) poke; garlic chicken; salmon kama (no hamachi kama that night); tako karaage; fried smelt and miso black cod.  From the sushi menu we ordered kani; salmon skin handroll; unagi handroll; soft shell crab handroll and two futomaki rolls (Maui and Da Hawaiian - she ordered these not me - lol). \n\nOverall, the appetizers were very good.  The ahi poke was fresh and flavorful.  The only thing I would change was adding more limu.  The he'e (tako) version was, eh, so-so.  It needed more shoyu and limu.  The garlic chicken was as advertised - nice and garlicky and not greasy.  The salmon kama was fresh and silky as this part of the fish should be.  The he'e karaage melted in your mouth!  The he'e was so fresh.  The fried smelt were nice and crunchy - Kind of like anchovies, but bigger.  But the best of all was the miso black cod.  OMFG - Broke Da Mouth!  It was buttery smooth and oh so fresh!  I wanted to order more, but I abstained because I didn't want to ruin my tastebuds.\n\nThe sushi was pretty good too w/ the exception of the rolls.  The kani was ok for what it was.  I should have known it was fake crab.  The rolls were for primarily for my friend so, I only had a bite.  They were not to my liking - I guess I am old school and I have not fallen for the sushi roll craze.  The hand rolls were fresh, huge and creative.  The salmon skin was nice and crunchy.  The unagi came w/ avocado (I have never had it this way). The avocado gave it a creamy finish.  The soft shell crab came w/ a salad made from the crab meat - How creative!  It was very good.\n\nSince I ate most of the apps, hand rolls and drank most of the beer, I didn't have dessert.   My friend didn't have as much, so she ordered the banzai bowl - vanilla ice cream w/ a small apple turnover and chocolate topping.  The other options are vanilla and green tea ice cream or 3 flavors of frozen mochi.  She really liked the dessert.  \n\nShaka to my bruddahs for good food, that is made to order and AYCE.  It was Da Kine!"
        }, 
        {
            "index": 43, 
            "rating": 4, 
            "review": "Been coming here since it was new. I must say, the service has gone downhill, but the food and prices are still great. Chef's are nice and staff greets right away upon walking in. Still one of my go to, quick, favorite sushi spots. Service doesn't bother me since I've been coming here for a long time, but to the first timers, they might not be in favor. Nonetheless, we keep coming back!"
        }, 
        {
            "index": 44, 
            "rating": 4, 
            "review": "Good: service, ahi poke, garlic chicken, mochi ice cream, miscellaneous sushi.\n\nOK: mochico chicken (bland), curry (instant mix from a box), hamachi (dry and tasteless), gyozo (pork not so flavorful).  \n\nBad: Sometimes they don't come around as often, when its busy."
        }, 
        {
            "index": 45, 
            "rating": 3, 
            "review": "Went back at an off time, avoided the sushi completely, and it was a completely different (good) experience. We used a groupon on a couple 2 item combos and soft shell crab appetizer. The combos included a ton of food, I think their garlic chicken is even better than island sushi's since its spicier. \n\nFood was quick and service attentive, but don't bother with the soft shell crab if you're doing ala carte. It's not worth $9 for 2 teeny crabs. Writing this, I actually just realized that when we did ayce last time they said they were out of soft shell crab for appetizers, but we got spider rolls. So they're liars too. Nice... \n\nI will still never be back for their sushi, or attempt the frustration of going there for dinner, but I'd probably go back for the garlic or mochiko chicken entrees."
        }, 
        {
            "index": 46, 
            "rating": 5, 
            "review": "Other than the limit on ordering some of the appetizer, WE LOVE this place, servers are always, always very helpful and nice.  Plus our 3 year old is free!  How awesome is that!"
        }, 
        {
            "index": 47, 
            "rating": 2, 
            "review": "Oh 808 I used to really like you but after my last visit I  can't even give you 3 stars. This used to be my go-to sushi place close to the house but no more.\n\nThe kid and I both had the AYCE and I don't think it was worth it. He loves rolls and I'm more soups, salads and apps. All the rolls were fair; I would give it 3 stars. But the sides, ooooh the sides were so dissapointing. Up first, kalbi ribs. An order consisted of ONE rib sliced into 5 pieces. That part didn't bother me and flavor was fine but it was so incredibly chewy Mr. Ed couldn't even break it down. There was no way to even swallow it after a minute of chewing so I just spit it out. Yea that bad. The potstickers had no flavor. I don't know if it was prepackaged and cooked on sight but I can't possibly believe some company made this to sell and people actually buy it. Last but not least was the salmon kama. I love any kind of kama with hamachi being a favorite. But this wasn't even edible! It went beyond just a \"fishy\" taste. I believe it was actually spoiled. It just had that spoiled fish smell and flavor. I think the waitress knew what was up because she was so quick to apologize. \nI've had bad food but don't believe I've ever had spoiled seafood :-(\n\nSadly won't be returning to this neighborhood joint unless it seriously turns a new leaf."
        }, 
        {
            "index": 48, 
            "rating": 4, 
            "review": "Dined here the other day for lunch.  I did all you can eat which probably wasn't worth it as it was happy hour and everything is so cheap.  The atmosphere isn't great and the quality is just ok but the service and the price are great."
        }, 
        {
            "index": 49, 
            "rating": 3, 
            "review": "Another Hawaiian style sushi place.  This time up in SW area.  Sushi (Nigiri) here are pretty small for AYCE; fish AND rice.  I think i order almost as twice as much as other place. \n\nMy Hawaiian buddy introduce me to this place, as well as Salmon Skin Hand Roll and like \"Whoa!!\"  Salmon skin deep fried and rolled with cucumber, yamagobo (kind of like a carrot), and eel sauce.  I've been here twice and could not find a better sushi place that does their Salmon Skin Hand Roll as well as 808 Sushi.  They also offer Hamachi Kama, Salmon Kama and Miso Glazed Black Cod for AYCE so that's another bonus.  \n\nService can be overly attentive, but i guess that's better than no service.  Could be bad timing too because every other bite i took they were asking if i needed anything, and there's a whole lotta chewing going on.  Eating is no joke.\n\nWould def come back here if my buddy invited me to eat or vice versa. \n\n3.5"
        }, 
        {
            "index": 50, 
            "rating": 4, 
            "review": "Out of all the sushi joints that I have been to, I am surprised that I did not yelp about this place. \n\nAfter what seemed like an eternity of my friend raving about 808, I made her go try it out with me. We went for lunch, because I am a beast and was sure I would regret eating so heavily at night. Instead I would gorge myself and pretend that my body would burn off all the calories during the rest of the day. Although we did not get the full menu, the lunch list was more than adequate.\n\nWhen we entered the restaurant, it did not look like anything special. There is nothing that stands out in comparison to any other place. \n\nWhat it lacks in appearance, it makes up for in taste. For appetizers, the tako karaage, agedashi tofu, seaweed salad, and ahi poke are amazing. In fact, I am sure my friend and I could eat our money worth in the last two items. \n\nThe main reason why I like this place is because they do not overload a roll with rice. The sushi comes out a little smaller than most places, but that is a good thing. It has been so long since I have been here that I forget the names of the rolls. When I go back, I will write out an in depth list. My biggest issue is with the use of soft shell crab. I prefer that it be whole, but at 808 they mix the meat with another fish and sauce. Half the pleasure of soft shell crab is to eat the exterior of the creature. On a positive note, the fish is fresh and you can taste it in the nigiri. I love hirame( fluke, sometimes called halibut), unagi (eel), ahi (tuna), tako (octopus), and sake (salmon). They are all basic, but essential sushi. \n\nThe staff is friendly and quick, but as our meal was wrapping up the service took a turn. In my mind, it was because they wanted to keep us there and not let us leave. It was the weirdest experience. Usually people give you the bill and just as quickly take it to rush you out. Instead we were left sitting there being asked by the chefs if we wanted more.\n\nIf you are not an AYCE type then go during happy hour for half off all cut rolls and beer. Monday through Friday from 3pm-6:30pm."
        }, 
        {
            "index": 51, 
            "rating": 4, 
            "review": "We love sushi and are always looking for sushi restaurants during the week.  This is actually our second time here and we went during their summer happy hour - a menu of 1/2 off of rolls and pupus or hors dourves.  \nI love poke, a Hawaiian dish of usually ahi tuna with spices, onion, and sometime macadamia nuts.  Now if you go to Hawaiian grocery stores, (Daiei), they will have 10-15 varieties of poke.  I usually love salmon poke.\nSo 808 Sushi gets 2 stars for going out of their way to make salmon poke for me!  (Hubby had the ahi tuna poke)\nThe other star goes to how big a bowl of that salmon poke that was for only $5.00!  I could not finish it.  (Maybe because I ate it with a half a bowl of rice).\nWe also had the spicey scallop roll which was very good.\nThe last star I gave was to their long john pastry and mini Hawaiian cakes or cupcakes of dobash, haupia and guava.  Yummers!  Bakery goods come at 11:30 a.m. every day...\nI am sure we will be here again...!"
        }, 
        {
            "index": 52, 
            "rating": 5, 
            "review": "Had an all you can eat no complaints very good food and great team. I will gladly be back in the future."
        }, 
        {
            "index": 53, 
            "rating": 4, 
            "review": "We go here weekly! Only for happy hour. I think it's probably the best happy hour in this area. Food is good. I recommend sitting at the bar. The sushi chefs are very friendly.  My only issue and why I didn't give five stars is there service.  The trick to 808 is to just ask for what you want.  The waitresses go off in the corner and chat so if you need something, you will need to call them to you. So we order like 2 of the dollar sakes because we don't know how long it will take to get the next one. I think becoming regulars they know us now so they are more attentive. But you can't beat dollar sakes and 2.75  dollar rolls."
        }, 
        {
            "index": 54, 
            "rating": 4, 
            "review": "I let Yelp do the picking for all you can eat sushi in Summerlin and 808 is what popped up. We decided to give it a try and are pleased we did :)\n\nThe restaurant is pretty small so when we arrived at 7pm on a Saturday night all the tables and sushi bar were full. We were behind a few people in line and had to wait about 15 minutes for a table.\n\nAfter being seated service was very quick and efficient. Their AYCE menu has a nice selection and variety of hot food and sushi. There seems to be more hot food on 808's AYCE menu than other places.\n\nSome of my favorites:\n\n-black miso cod\n-udon\n-speciality roll that had salmon, avocado and jalepeno\n\nThe food came out quickly and everything tasted really fresh. \n\nMinus one star for their scallop item not being baked and for it not being specified as such on the menu. There's no designation as to whether this menu item is raw or baked so I assumed that it would be similar to other scallop/mayo sushi items at other sushi restaurants in that it would be baked. Not so here. It didn't taste very good (texture of the raw scallop with mayo mixed in....blech). \n\nOther than that small mishap everything else was awesome. Will definitely be back :)"
        }, 
        {
            "index": 55, 
            "rating": 4, 
            "review": "HAPPY HOUR!  Ends at 6:30 I THINK.  \n\nThe prices were better like a couple months ago, but we've gone recently and the prices have changed.  \n\nEven so... I love the 808 Roll:  Spicy soft shell crab or spicy tuna, spicy mayo, eel sauce.  My favorite roll.  I also LOVE LOVE LOVE the Spicy Yellowtail Sashimi.  \n\nSome other favorites:  \nHamachi Kama \nPork Gyoza\nSpicy Pele\n\nThe chefs and servers are young and vibrant... seem to always be having a good time and making conversation with the guests which is always good.  \n\nThe fish is fresh, the service is fast.. and the prices are great!  It's a give or take with this place... sometimes it's busy, sometimes it's not.  We usually try to beat the rush and head over at around 5:30...once we're done ppl are usually coming in.  \n\nWhat's even more perfect??? Coldstone right next door.  Thumbs up."
        }, 
        {
            "index": 56, 
            "rating": 5, 
            "review": "Whether it's dine-in or take out, the service here is impeccable.  There's hardly ever a wait time.  The people are super friendly and very helpful. I've been here on several occasions and they recognize me every time.  I'm practically family at this point.  The prices aren't bad at all, especially if you go during happy hour.  Three special cut rolls and an appetizer are more than enough if you've got a healthy appetite; the portions are very well sized.  You've gotta try this place. You won't regret it!"
        }, 
        {
            "index": 57, 
            "rating": 5, 
            "review": "Great place. We've been there once or twice a week all summer long . Low prices for good quality. We love the Happy hour!!!"
        }, 
        {
            "index": 58, 
            "rating": 4, 
            "review": "The happy hour...is off the chain!! M-F from 11:30am to 6:30pm, I think. I like to hit this spot up for lunch A LOT. Such a good deal, and the raw sushi options are yummy and fresh. The special rolls are nomtastic, but my favorite thing to order there is just the plain ole' spicy tuna; level 5. It's not like the standard spicy tuna roll you get at regular sushi restaurants...that weird ground mushy tuna stuff. They use chunks of fresh tuna in their spicy tuna rolls and special rolls...super ONO! Try the 808 roll, that's the other favorite.\n\nGood sushi, great prices, and in my neighborhood; hits all the important criteria for me ;)"
        }, 
        {
            "index": 59, 
            "rating": 5, 
            "review": "Love their 808 sushi roll so in love! Awesome place for happy hour as well for the price! Nice customer service. Definitely my go to spot for sushi from now on!"
        }, 
        {
            "index": 60, 
            "rating": 4, 
            "review": "Pretty tasty sushi with a good variety. Hubs and I come here every once in a while if we don't want to risk having bad sushi somewhere we've never been. Service is always nice and quick. AYCE lunch pricing is reasonable and worth the trip to check it out."
        }, 
        {
            "index": 61, 
            "rating": 1, 
            "review": "What's going on here!?!?!?!?!?! Business must really be bad to have Happy Hour all day.\n\nSo, it's been a while since I've been here. But some out of town guest wanted to go last weekend. I was shocked!!! What happened to 808 Sushi? I walked in to (KoMex)Korea Town Sushi. Where did the local staff go? There are a bunch of expressionless Koreans that draw their eyebrows on serving us. If that's what you want to call it. \n\nBy far the worst service I have ever received here. No one stops to refill drinks, ask how everything is going, or if they can get us anything else. You have to flag them down and ask for more food and drinks. Also is it that hard to smile? We're not in North Korea. Even though it looks like it.\n\nThis place has really let itself go. The quality of food has gone downhill dramatically. The girl that seems to be running this place is definitely under qualified and too worried about what's on her phone then what's going on in the restaurant. \n\nYou need to get your local staff back. Because what you got going on now is a definite let down to the local community. You were one of a handful of 808 eateries that represented well. You had the name, the food, and majority of your staff was actually local. Just cause you lived in Hawaii doesn't make you local either. It's in the heart and there's no heart there."
        }, 
        {
            "index": 62, 
            "rating": 1, 
            "review": "What is all the hype about 808?  This place honestly is a joke.  \nI go in to order to go food at 5pm.  There are 8 people in the restaurant dining, so not many people mind you.  I place my order with a girl who was really put out by my wanting to order to go food.  She places my order and tells me it will be 15 minutes.  Ok, that seems reasonable.  42 minutes later, still NO food.  2 people who ordered after me had their food come up.  When I inquired, the same girl seemed even more put out.  No apology, no offer to give me a soda or water while I wait for a lousey 3 sushi rolls.  Boy, obviously customer service is not a requirement at this place.  I get no answer except \"They said it will be up soon\".  Again, no apogy for the ridiculous delay and time needed to prepare it.  It finally comes up and she sends me on my way.  \nI was agitated to say the least but I was hoping that the story might take a slight turn for the better when getting the food home and having my sick wife who I got it for to cheer her up be so amazing it would quench the sour taste of the 45 minute wait.  Well, not to be.  The sushi was average at best.  For all of you who have reviewed 808 as having amazing sushi, you need to get out more.  I have been to so many places with better food quality and certainly more friendly people.  \n808, you need work.  A lot of work.  I am sorry I wont be back nor will I be sending anyone your way.  You had a shot to secure a life long sushi eater and lost it.  First impressions are critical in the fickle world of the restuarant business and well, yours just plain sucks."
        }, 
        {
            "index": 63, 
            "rating": 3, 
            "review": "This place is close to our house so we decided to give it a whirl. The Hawaiian flare is interesting, but the sushi was just OK. DIdn't taste super fresh. We will probably just drive the extra 5 minutes to Oyshi next time."
        }, 
        {
            "index": 64, 
            "rating": 4, 
            "review": "I like this place. I've heard others describe the \"freshness\" as not so good, I suppose I'm not as much of a sushi snob. I thought it all tasted very good and they have a lot of different choices for dishes, not just sushi. The black cod was great and they have a lot of different rolls. I go here once a month or so."
        }, 
        {
            "index": 65, 
            "rating": 4, 
            "review": "This place is fast becoming my favorite AYCE spot here in Vegas - it has been more reliably good than any other.\n\nTasty appetizers (especially the garlic chicken), good quality fish and quick service make me want to keep coming back here."
        }, 
        {
            "index": 66, 
            "rating": 2, 
            "review": "Wasn't overly impressed by lunch here. Sushi was ok but service was ok at best and they kept the place freezing cold. I've had better... Won't likely return to this restaurant."
        }, 
        {
            "index": 67, 
            "rating": 5, 
            "review": "If you're craving sushi, this is the place to be especially during happy hour. They have variety of delicious appetizers at a very inexpensive price plus their tasty sushi. You can order to go and pay happy hour price, no one can beat that. The owner Dean is always nice and provides great customer service."
        }, 
        {
            "index": 68, 
            "rating": 3, 
            "review": "Went for dinner (all you can eat) last night. Wasn't super impressed with the variety of rolls. We ended up getting a couple that were nearly identical. Oops! \n\nBut - the poke was delicious and the 808 Special was my favorite. And all of the nigiri we ordered was pretty standard. \n\nI wouldn't bend over backwards to come here, but it's a reasonable option if you're in the area!"
        }, 
        {
            "index": 69, 
            "rating": 5, 
            "review": "So in love with this place! Everything we had was good! 808 roll, tempura roll, crunch roll, triple crown, Hawaiian roll, and garlic chicken. Plum sake was good and great beer. Literally every single thing we ate was delicious! Very relaxed atmosphere and nice staff, really can't say enough great things about this place. I'm so glad it's close to our house :) We ate WAY too much!"
        }, 
        {
            "index": 70, 
            "rating": 5, 
            "review": "Love 808, happy hour pricing is great. My girl and I try to make it here monthly for our date nights."
        }, 
        {
            "index": 71, 
            "rating": 4, 
            "review": "We come here at least twice a month, be it dine in or take out. Service is outstanding every time, very fast and efficient. Staff is really friendly and prompt. They constantly refill drinks without being asked. The happy hour deals alone are worth going. Make sure you try the garlic chicken and extra crispy salmon skin roll (my fave! Yummmm!!!) We've brought friends and family from out of town and experience is always pleasant. My only qualm about this place is the dessert, selection could be better. Green tea ice cream is great but the fried apple fritter thingamajig is lackluster. A Chantilly, dobash or guava cake perhaps?"
        }, 
        {
            "index": 72, 
            "rating": 4, 
            "review": "I've eaten here twice before but I just got finished with their happy hour. I rated 4 stars because I've had some pretty amazing sushi, but their happy hour prices are pretty great compared to other places!\n\nWe had the following :\n-Hot Sake (Only $1!!)\n-Garlic Chicken $2.95\n-Alaskan Roll $3.25\n-808 Special $6.00\n-Maui Special $5.50\n-Philadelphia (2) $4.25\n-Green Tea Ice Cream - $2.95 \n\nWithout tip we spent about $30. That's not bad for sushi!"
        }, 
        {
            "index": 73, 
            "rating": 2, 
            "review": "Overpriced crap. Save yourself from bad sushi and go to Oyshi instead. They have more choices and  better tatsing food. I'm only giving them 2 stars because their 808 sushi roll was delicious. the rest were simply nothing special."
        }, 
        {
            "index": 74, 
            "rating": 4, 
            "review": "Came to this Hawaiian japanese sushi restaurant during lunch happy hour on a Thursday. It wasn't too busy so food came out at a reasonable time.  Ate at the bar and I opted to do ala carte because I usually don't eat much. Chef Lee made my rolls and he was a great guy! Very friendly and nice. Ordered an Alaskan roll and Kilauea roll. Finished both and left full and satisfied. Bill was only $11 for two rolls; can't beat this price! Knocked off a star cause the dynamite mix on top of the Kilauea seemed a little off to me.. loved that the Alaskan had ikura on top,  yum."
        }, 
        {
            "index": 75, 
            "rating": 5, 
            "review": "I come here sadly like once a week for happy hour I love the tempura and crunch roll. Don't understand why they only have 3 stars I personally love this place"
        }, 
        {
            "index": 76, 
            "rating": 5, 
            "review": "I love 808 sushi ... the fish is incredibly fresh and service is outstanding. The Ahi Poke is amazing - and they do not skimp on the portions, happy hour or not.  Oh, another plus is that they actually let you place take-out orders (for pick-up) during happy hour at the discounted prices.  Most places don't give you the discount unless you dine-in.  Love!"
        }, 
        {
            "index": 77, 
            "rating": 2, 
            "review": "I recently brought a Groupon for $20 for $40 worth of food (1Groupon per table, sucks). Overall all i can say was what a bad experience. \n\n    From the start i called to make a reservation as stated on the  Groupon but was told no reservation needed. As my friend and i walk in 808 sushi the only available seating was the sushi bar and a table next to the door, we took the table next to the door even though we were already cold. ( the table wasn't cleaned off). As we waited for them to clean off the table i look around and it seemed cold and dark, not a welcoming place.\n    The server asked if we were doing happy hour or groupon, we told her groupon and she handed us the menu for the Groupon. :(. I was very dissapointed about the menu, i expected more variety of Rolls and appetizers. After ordering we over heard a table talking about still being hungry and complaining about waiting over 15min for their check. \n      When it was our time to get our check we waited less than 10 min. We order 2 California rolls, 808 Roll, 6 piece Screaming orgasm , miso soup, shrimp tempura. total was$ 48.75 with Groupon discount it came to $8.75. I gave them $20.75 after waiting another 10min for my change back i got back only $9.75 :/ ya i was confused for a moment myself (i guess they wanted to take some of their own tip out of my money first). honest mistake maybe !!! . But we were cold and to disappointed to stay any longer. Wont be returning !!!!!"
        }, 
        {
            "index": 78, 
            "rating": 1, 
            "review": "I was contemplating on giving them two stars, but I really had to reach here and think of something else nice to say and basically came up with nothing, so here goes.\n\nThis is our first visit. The place was packed so I thought, \"Must be a good sign, right.\" There was one empty table, but the hostess didn't even move and just pointed it out to us and said, \"You can just sit over there.\" \n\nFood here gets no love from me. We ordered 2 orders of negitoro and salmon hand rolls, combination plate w/ 2 entrees (garlic chicken & miso black cod) which is supposed to come with miso soup, salad, rice, and dessert. We also got a spider roll. Let's start with what I liked, which was the miso black cod. I thought it was delicious and cooked just right. I would order this again. Unfortunately, I can't say the same with the rest of our orders. The garlic chicken was so greasy and just didn't look right. I had garlic chicken before from 808 Hawaii Mixed Plate which I loved, so I was expecting it to resemble that but I was let down. The salmon hand roll is ok. I had better at a Korean/Sushi/Chinese place we dined at yesterday. The negitoro was worse. It was basically just tuna sliced in cubes with scallions hurriedly put on top. The spider roll was the worst thing I've ever eaten in a long time: completely drenched in sauce that it completely fell apart when I barely picked it up with my chopsticks. I had a small bite and quickly put it back to the plate. The dessert never came to our table so I cannot comment on it. \n\nAt this point I just want to leave and move on so we asked for the bill. Our combo plate was supposed to be $14.95 but we were charged $29. They could have thought we ordered 2 combo plates but our bill specifically stated: 1 Combo B: $29.99. I pointed it out and the lady apologized and fixed the mistake right away. I'm just glad I caught it while we were still there. Needless to say I am not coming back."
        }, 
        {
            "index": 79, 
            "rating": 4, 
            "review": "Love this place!! Small, cute place with a lovely staff. The only thing is and maybe it's just because I'm picky is that the chefs were young and only one of them was Asian. Nonetheless the sushi was wonderful it's just it takes years of experience to make sushi."
        }, 
        {
            "index": 80, 
            "rating": 5, 
            "review": "These guys are amazing!!  \n\nWe celebrated my cousin's 21st and my Mom's 60th birthdays there and they delivered!  There were 30 of us in our party and the majority of us had AYCE, but a there were a few that did not and also a couple of children in the party as well.  The food did not take forever as you would expect, but it actually flowed quite well. They were kind enough to sit us in the back of restaurant at 3 longish tables as I'm sure we look like we could make some really good noise! Haha!  We brought in our own cakes which wasn't a problem either!\n\nI think we had everything on the menu (or very close to it!) at least once.  My cousin even ordered two bowls of curry and rice . . . but it was his birthday so I didn't give him too hard a time! We did a little bit of sharing and tasting amongst each other, but here's my favorites:\n\nmiso black cod - AMAZING!!\nahi poke (wonderful, even if frozen - we asked, they were honest!)\ngarlic chicken\nhamachi kama - Uncle said this was the best ever!\n808 roll\nda kamikaze roll\nnatto nigiri - MMMMMM!!!  \n\nOne missing thing though was the baked green mussels and fresh oysters, neither was on the menu.  But there were so many other delicious options, we didn't miss it at all.\n\nLots and lots of mochi ice cream for all -- mango, strawberry, chocolate and coffee.  And generous scoops of green tea ice cream, plus cake!!  We were rolling out the door with full bellies and happy memories!!"
        }, 
        {
            "index": 81, 
            "rating": 4, 
            "review": "Service was great..mochiko chicken and garlic chicken is really good..20 $ all u can eat lunch can't go wrong."
        }, 
        {
            "index": 82, 
            "rating": 3, 
            "review": "I go here all the time and would give five stars if not for service.  The happy hour is the best in town. The sushi chefs are great!  All super friendly.  I have only experienced ONE good waitress.  I feel like asking them if they would like me to teach these girls how to multitask.  They will leave your water empty and walk right by you a few times. If you need more wine, water, a drink, I have had to ask multiple times.  They will stand in the corner chatting away.  Dont expect your check, you will have to ask for that too. It sucks, because I live in the neighborhood next door and my friends drive a few streets over to another place because they don't the service in 808. If they could get great servers this would be a five star deal to me. You cant get a better deal on sushi anywhere when it comes to their happy hour."
        }, 
        {
            "index": 83, 
            "rating": 4, 
            "review": "Happy hour here is awesome got a decent selection of Japanese favorites and dollar hot sake.  The AYCE is competitive with other sushi joints"
        }, 
        {
            "index": 84, 
            "rating": 4, 
            "review": "This place has incredible happy hour! Cheap sake and cheap quality rolls when hubby and I are starving, thank god for this place! Their service is a hit or miss.... they are either really attentive, or forget you in the back of the corner while you helplessly wait for your server to come by.\n\nTheir rolls are fantastic. I've never gotten sick or had any issues with their sashimi or raw foods. They are perfectly made, and made with really cool artistic decorations and great combinations. (Not your nooby typical spicy mayo, crab, and avocado rolls)\n\nI love the location of this place because it's very close to my house so it is very ideal. The restaurant is very clean, and designed quite well. Very Japanese feel to it and the tables are really cute. The staff are always really nice and welcoming. Definitely a good sushi spot!"
        }, 
        {
            "index": 85, 
            "rating": 5, 
            "review": "ONO food! and I don\"t even eat sushi:)......GREAT PLACE TO GO FOR HAPPY HOUR. Garlic chicken is sooooooo good!"
        }, 
        {
            "index": 86, 
            "rating": 5, 
            "review": "The Spicy Tuna Don bowl is my crack. I cannot get enough of it. We also love the Island Fever and the Spicy Scallop rolls. Great service, close to home, great prices and HAPPY HOUR!"
        }, 
        {
            "index": 87, 
            "rating": 4, 
            "review": "Happy hour is from 4-6pm and the prices just cannot be beat! Just make sure to ask for the HH menu and you can't go wrong.\n\nYou don't have to worry about guessing whats in a roll since their menu's are very descriptive and the food does come out exactly as described, which is definitely a plus! \n\nWe started off with the Ahi Poke and Garlic Chicken. Both very flavorful and delicious! For our main entrees, we ordered the 808 special, Dragon roll, Tiger roll and Tempura roll. The sauce of the rolls is pretty good as its a combination of sweet with just a tiny kick! \n\nIt's also great coz aside from the HH, they have AYCE sushi! Lunch is $20.95 while dinner is $24.95. I would strongly suggest you go for the HH though, since for a party of 5 hungry people, our bill was only $55."
        }, 
        {
            "index": 88, 
            "rating": 1, 
            "review": "We go this restaurant for years, food is excellent and the lady manager was nice to us. It's March 31, 2016 4pm we were seated on the very 1st table for 5 by the door. I didn't get our waitress name but she was terrible, unfriendly and rude especially in front of my wife and 3 little kids. I asked for spoons and forks and you could see the smirk on her face right away, we ask for a box to go and literally she just put it on the table without looking at us .. The same thing happens when she gave us the bill. very unfriendly !!!! she never stop by to check on us if we're doing ok or was there anything else I could do for u guys?\nAbsolutely none, not even once ... I wrote a short note and gave it to the manager just a little wake up call for her waitress to be friendly and accommodating ...."
        }, 
        {
            "index": 89, 
            "rating": 3, 
            "review": "I have been here several times for the AYCE. On these few occasions I tend to steer myself towards the hot dishes. I don't really enjoy their sushi. I much prefer the other options. \n\nI wish they would allow more more orders of the kalbi, they limit it to one per guest unfortunately. I think this is probably my favorite dish here. I don't really think I get my money's worth to be honest on the AYCE. Some of the rolls are pretty good, but nothing really stands out about this place. \n\nI would much prefer getting a la carte here, plus they have a Happy Hour here which would probably be better. All in all, this place is just okay. If given the choice, I usually don't recommend 808.\n\nIt's not the worst and it's not the best in town. Pretty much just average in my book."
        }, 
        {
            "index": 90, 
            "rating": 5, 
            "review": "Great all you can eat sushi restaurant with a pretty extensive menu of noodles, donburi or regular entree combos as well! The staff was attentive and friendly, always checking to see how we were doing and refilling our hot tea and water glasses.\nThe all you can eat is $26.95 and well worth it!(From 3pm until closing) Kids (ages 4-10) are only $13.95! \nI ate until I rolled out and I'll definitely be back!!\nALOHA!"
        }, 
        {
            "index": 91, 
            "rating": 3, 
            "review": "Great prices and decent sushi.  The service was fast and with a smile which I always appreciate.  I had the caterpillar roll and the 808 roll.  Both were good.  I also had the house salad, miso soup, the kobe ribs, and the mango mochi.  All were okay.  If you are looking to not spend a lot on sushi and you want to fill your tummy, this may just be your place."
        }, 
        {
            "index": 92, 
            "rating": 5, 
            "review": "I have been coming here for years. The green tea is great. One of the coolest things is their happy hour. With so many sushi places in town, 808 sushi will always be one of my favorites."
        }, 
        {
            "index": 93, 
            "rating": 5, 
            "review": "I am always a bit skeptical of ayce sushi, but I was super impressed with the quality of the fish.  Not only was all of food fresh, but the service was fantastic.  The servers were all friendly and quick to refill our drinks.  They even accommodated my girlfriend by making numerous vegetarian recommendations and veggie rolls that were not on the menu.  The dudes behind the sushi bar crank the rolls out quickly.  Also, they had big bottles of Sapporo which made me a happy camper."
        }, 
        {
            "index": 94, 
            "rating": 5, 
            "review": "One of the best happy hours in town!  Nick and the guys on the line are great.  So well priced and tasty.  The menu isn't limited for HH.  It's a great selection and much more than other places.  \n\nGreat atmosphere and free wi-fi (score!) :D\n\nNow if they ever open one up more central in town they'd kill it.  Now I'm wanting sushi and it's almost 2:30am haha.  \n\nSee you guys soon."
        }, 
        {
            "index": 95, 
            "rating": 5, 
            "review": "I love 808 sushi, staff is awesome, food is great, bring your family or your friend or even your girlfriend or boyfriend, you won't be disappointed, 10 stars..."
        }, 
        {
            "index": 96, 
            "rating": 5, 
            "review": "Sushi with a Hawaiian twist. Garlic Chicken is a must!  Happy Hour specials satisfy without hurting your wallet. Great buys on Beer too. Aloha!"
        }, 
        {
            "index": 97, 
            "rating": 5, 
            "review": "Fresh Ocean.  Dry Desert.  How can we find something from the fresh, ocean (fish) in this god-forsaken desert (heat)?  These aren't 2 things you can put together quite right.  Well, they most certainly can at 808 Sushi!\n\nWe're from Hawaii, so trying to find fresh fish here has been very tasking!  It took us 2 1/2 years to finally discover this place, which is on the far west-side of the Strip, Mountain's Edge.  I mean, we've done Sushi Mon several times before, but I can't help but get the feeling of it being so \"tourist-y\" over there.  Here at 808 Sushi, the feeling is a little more \"local\" in style, and you don't get that hurried, stuffy feel from the staff either.  Despite the bar-ambience at 808 Sushi, I still find this place to be very family-friendly as well.\n\nThe AYCE is fantastic!  We had to at least dine here for both the lunch and dinner AYCE before we could review for the place with a clear assessment.  Lucky us!  Lunch AYCE is $20.95, my daughter eats free, she's 4.  The dinner AYCE is $24.95, again daughter eats free, while my elementary-school son eats for $12.95.  He could have eaten a la carte off the menu, but we know his growing appetite by now.  Next, we need to try their Happy Hours, Monday thru Friday 3pm-630pm, Friday and Saturday 9pm-11pm.  I hear it's half off certain menu items and their beer, plus $1 hot sake.\n\nAll their nigiris are ono!  I don't need to list all of them, so just know that they ALL are delicious!  Yes, they are smaller in cut, but it's all you can eat.  So, therefore:  Eat All You Can.  Hah!  I've tried their special rolls too, which, although tasty, I've never been a huge fan of these \"mainland-style\" rolls anyhow.  Despite my particular sushi style preferences, I did enjoy their Da Kamikazi roll, tempura, soft shell crab, eel, and salmon.  But, in the end, all I want is nigiri sushi!\n\nTheir hot menu is great too!  Their lunch is a modified, limited version of the dinner one.  I have to mention their Mochiko Chicken!  Soooo crunchy and tasty!  The kids had 3 orders!!!  Also worth mentioning, their Ahi Poke is quite flavorful for such a small portion, but it packs just the right punch (keep ordering, if you like it that much!).  Other notable items are the Agedashi Tofu, Garlic Chicken, Miso Black Cod (Butterfish), and Tako Karaage, just to name a few.\n\nAnd lastly, I have to say that the staff here is super friendly and warm-welcoming.  This is THE definite contrast to the staff at Sushi Mon.  Again, Sushi Mon seems to hurry you through, yet take their time w/your orders.  They unfortunately don't do a terrific job at explaining their \"limits\" and \"restrictions\" on their AYCE menu.  But, at 808 Sushi, with just a few \"restrictions\" to your order, they explain it well enough here and are much more friendlier about it too.  This is probably due to their laid-back approach on their service and their customers, which by all means does not mean their service is lackluster.  It just means their friendly Aloha attitude makes your experience here that much better!"
        }, 
        {
            "index": 98, 
            "rating": 5, 
            "review": "Favorite sushi place with awesome happy hour..  And less than a mile away from home, can't beat that!"
        }, 
        {
            "index": 99, 
            "rating": 5, 
            "review": "Delicious food!! I am a regular here for the very reason that every time I go the food is on point, fresh, absolutly amazing and creative. The chefs know me so sometimes they make something not on the menu and its incredibly good. The owner Dean is very nice and always around so you know he cares about what is being served. I love this place."
        }, 
        {
            "index": 100, 
            "rating": 4, 
            "review": "AYCE sushi that is pretty good quality and at a decent price. I've been here a few times now and with most AYCE places, you always end up eating too much. You can get just about any roll and nigiri for as much as you can eat (although they do limit you on the uni and sweet shrimp). You can also get all the appetizers you can eat, many of which are really good - ahi poke, garlic chicken, etc. If you don't do AYCE, they do have happy hour and you can get $1 sake and half price rolls. Overall a good sushi place for the price that you pay and the staff are all really nice and laid back - must be the hawaiian style."
        }, 
        {
            "index": 101, 
            "rating": 1, 
            "review": "After hearing such great things about this and reading the awesome reviews I twisted my girlfriends arm last night and convinced her we should check this place out instead of our normal sushi spots... well it ended up giving her a reason to say she told me so.  Either everyone writing awesome reviews about this place has never had sushi before, or they are getting paid to tell everyone how awesome and amazing this place it.  The food was very bland and didn't look as though it was the best quality.  I even tried out the Garlic Chicken per all the reviews, while that was pretty decent it was nothing to rave about.\nEven though this place is right around the corner and really quick to get to, I dont think I will ever be going back to it."
        }, 
        {
            "index": 102, 
            "rating": 5, 
            "review": "First time coming here and let me tell you. they have good service/food. their bento plate with garlic chicken is the bomb.\nthey give you good portion for a good price.\nhighly recommended."
        }, 
        {
            "index": 103, 
            "rating": 4, 
            "review": "Great sushi, great pricing. Always consistent quality. Pure Aloha spirit. Wish they were open later, but besides that,  one of my wife's and I favorite spots!"
        }, 
        {
            "index": 104, 
            "rating": 3, 
            "review": "Great happy hour. $1 for hot sake. $2.50 for large beers.\n\nCheap rolls and apps. \n\nIt's not the best sushi around by any means but it'll fill your craving at a good price."
        }, 
        {
            "index": 105, 
            "rating": 2, 
            "review": "The sushi is average, at best.  Rolls are super-small and unoriginal.  Didn't taste very fresh.\n\nService was horrible.  We placed our 1st order then 20 mins later we received  one item, 20 mins later another item.  This went on about several times until I insisted that the rest of my orders be served all together.\n\nTo sum it up, if you like slightly below average sushi and have about 2 hours to kill for dinner, 808 is your place.  If not, don't bother.\n\nP.S. -- if you decide to eat there, make sure you go during Happy Hour, otherwise you will drastically overpay."
        }, 
        {
            "index": 106, 
            "rating": 1, 
            "review": "I have been going here for awhile now.  The service and quality of the food has gone down hill.  I have waited on people for over 26 years, and I will not be going back to this place from the way we were treated last night.  Food tasted weird like it was spoiled, sent it back and it was still on the bill, along with 18% gratuity. Servers are rude and always mess up our order and each time act like it is our fault.  Have to ask multiple times for refills and items we asked for.  This place needs to hire better, friendlier and more competent servers."
        }, 
        {
            "index": 107, 
            "rating": 4, 
            "review": "My sisters and family love this place. When you want a taste of the island make you feel like your in Hawaii. Customer Service well they all make you feel like long time no see family very welcoming. Great island grub!! Kalbi ribs my favorite!!!"
        }, 
        {
            "index": 108, 
            "rating": 5, 
            "review": "Owner is friendly and remembers regulars. Great place to go during non-peak hours.\n\nThe best value is clearly all you can eat. If you only want 1-2 things you can only go during Happy Hour which saves you some money.\n\nThe appetizers are all pretty good.\n\nAll the sushi is good, I like the 808 Special (which is their most popular), but most everything is fine.\n\nWith all you can eat you also get a dessert, and while there is only 3 options, they are all fine."
        }, 
        {
            "index": 109, 
            "rating": 5, 
            "review": "I LOVED this place sooo much! This was my go-to sushi joint\nand it was in my area too so it was perfect. The rolls are amazing and so are the appetizers! \nThen....I went in a couple days ago and I noticed they limited many, many\nrolls in AYCE. & When I say limit, I mean one roll order per. A very sad day that was. :/\n\n\nEDIT: I was mistaken about my assumption about the limited AYCE rolls. I'm so sorry for the misunderstanding. It's just marked to show which dishes are made with raw fish. They should really label that soon... Now because this is all cleared up, this is now my absolute FAVORITE sushi joint to go to again!! I love this place. :D"
        }, 
        {
            "index": 110, 
            "rating": 4, 
            "review": "808 has solid sushi & a great HH.  They also have the usual AYCE lunch and dinner, but your best bet is that happy hour... half off all sushi and $1 hot sake (M-F 3-6:30pm and Fri/Sat nights from 9-11).  Atmosphere is decent, basically just a bunch of tables in a large room with some flat screens (definitely wish they had booths).  Service is great, and they do takeout.  Favs include the 808 special (soft shell crab topped with spicy tuna) and the 007 roll (cali roll topped with shrimp, avocado, and eel sauce).  Easily one of the best happy hours in town, especially if you live in the Rhodes Ranch area."
        }, 
        {
            "index": 111, 
            "rating": 1, 
            "review": "Service slow and terrible. Small potions, not to tasty Overall, not good."
        }, 
        {
            "index": 112, 
            "rating": 5, 
            "review": "was a die hard fan of sushi mon until their rolls started getting sloppy and they started packing on the rice... stumbled upon 808sushi instead and LOVED it!!! \n\ngood quality AYCE sushi restaurant w/ friendly staff & island music playing in background. \n\n\nGO HERE! highly recommended :)"
        }, 
        {
            "index": 113, 
            "rating": 5, 
            "review": "143, 808!!!! 823 24/7!! \n\nall you can eat at 24.95-- worth E V E R Y penny, maybe even more. \n\nthere were about 20+ items on the menu and i was SO overwhelmed. from adedashi tofu to pan-fried yellowtail and salmon. then there's the chicken katsu, salmon katsu, and the garlic chicken.\n\nno.. that's not all. \n\nbecause there was also the ahi poke, shrimp tempura, curry over rice!!!, etc etc!!! \n\nevery single item was yummy, fresh, and full of flavor. also, it's really nice how they portion the dishes like a Spanish tapa so that you don't get as full and waste food.\n\n i was flabbergasted when i realized i was only on the appetizer menu. on the BACK was a list of the 30+ handrolls, sushi rolls, nigiris.. wowowwwowowoww.w...\n\nand guess what we had for dessert? deep fried apples with vanilla ice cream =D\n\nthis is a MUST in vegas. extremely off the strip, extremely worth it. they dont play around here!! btw they have stamp cards. isn't that fun? haha"
        }, 
        {
            "index": 114, 
            "rating": 3, 
            "review": "I've only tried the happy hour rolls and they were super tiny and falling apart with barely any fish in it. They workers were super nice and had great service so I see why it was busy in there. All the customers and staff were happy so I'll try it again one day."
        }, 
        {
            "index": 115, 
            "rating": 5, 
            "review": "Love this place! Great happy hour! Their ahi poke is delicious, makes me feel like I am back in Hawaii. Friendly servers and tasty quality food. Mmmmmmmmm."
        }, 
        {
            "index": 116, 
            "rating": 2, 
            "review": "I would only come here again if it were my last option. Their sushi is not very good at all. My boyfriend and I went for happy hour yesterday where the rolls were 50% off. They have a pretty decently sized selection of full rolls from $3-$8. We ordered two unagi rolls, a Philadelphia roll, and a Maui special. (I used to go here before and the Maui special was one of my favorites. Yesterday, the Maui special was the best tasting out of all of them but it still just didn't deliver.) The Philadelphia roll was okay and we were actually only given one unagi roll even though we ordered two so we shared the roll and I actually felt bored eating it. There was no flavor at all. It tasted like I was just eating rice. \n\nAt the end, we were still charged for two unagi rolls and we almost didn't catch the extra charge. One of the servers (there were three different people helping us the entire time) apologized for the extra charge but didn't offer a refund, just offered that we took it to go. So we did. Out of all three people there was only one girl who I actually thought was genuine and nice. The other two were just there to get their job done. \n\nOverall, for $20 for a couple of flavorless rolls and choppy service? I guess if you're looking to not spend or eat too much... Or if you don't care about the service then you could check it out. I'd rather go somewhere else."
        }, 
        {
            "index": 117, 
            "rating": 1, 
            "review": "Worst customer service!!!! We use to go here from when they first opened...now the service is so bad, I wouldn't even consider going here.  The owner is an ass!!! You wouldn't even know he was from Hawaii.  Food is not as good since they keep turning over sushi chefs, foods not the same. Go somewhere else but here. Not even worth the star but they make you check one to post."
        }, 
        {
            "index": 118, 
            "rating": 5, 
            "review": "Honestly everytime I eat here it's delicious, fresh,  fun and the service is great.  My friends and I go once a month and have never had a bad experience yet.  Way to go team.  The Mexican Roll is delicious"
        }, 
        {
            "index": 119, 
            "rating": 3, 
            "review": "Decent place to go, only reason I give it five stars is because of the prices.  During happy hour, rolls as low as 2.75, I had three and found myself full.\n\nTaste, like any other sushi place.\n\nI subtracted a star for the attitude I received from the servers.  One however was extremely nice and made sure my cups were always full.\n\nWe walk in, I wanted to sit in the back, and the woman who seated us had us sit where an employee was eating and kicked her out of the seat...right in front of us.  I felt extremely uncomfortable and felt bad.  Then as we sit down, a man came out and said something to the waitress and looked at us and said, \"You took my table.\"  I almost wanted to walk right then and there and say, \"Oh okay, here is your table, we'll go where they welcome their fucking customers.\"  ...but didn't.  I told the woman, that we could sit at the table next to us and not have anyone moved or their table \"taken\".  Her response? \"We need that for the bigger parties.\"  That table remained unoccupied the entire time we were there.\n\nIf their prices weren't cheep and the sushi wasn't decent I wouldn't have been back. :/"
        }, 
        {
            "index": 120, 
            "rating": 5, 
            "review": "Everything is fresh n awesome. I've been looking for any sushi place that sells shishamo and they're the only ones that do. Plus the service is great n the rolls are soo ono. End it with the banzai special n I'm satisfied."
        }, 
        {
            "index": 121, 
            "rating": 5, 
            "review": "808 Sushi is one of my favorite sushi restaurants in town. 2 things that I look for in a sushi restaurant are quality and variety and 808 fulfills both. They have the freshest fish and lots of it. The AYCE menu offers many different choices. The sushi is great,  the specialty rolls are delicious, and the appetizers are to die for. \n\nHere's a couple of dishes that stood out: Miso black cod, miso salmon kama, hamachi kama, fried octopus, and poke. And don't forget to order banzai special for dessert."
        }, 
        {
            "index": 122, 
            "rating": 4, 
            "review": "decently priced, this is just around the corner from me, so it is a nice little neighborhood place to swing into.  My only visit was great, I have friends that are frequent patrons, and they were the ones that keyed me in.  One thing I can say is that all you can eat sushi is more for groups and is a social thing more than an epicurean thing."
        }, 
        {
            "index": 123, 
            "rating": 1, 
            "review": "This use to be my favorite Sushi place .... good food and close to home. Happy Hour is from 9pm to 11pm on Friday and Saturday but as of late there is no guarantee the they will be open .... went there last night with a late craving for sushi and they were closed up early ... I guess I am going to have to find a more reliable sushi place that have happy hour on Friday and Saturday nights."
        }, 
        {
            "index": 124, 
            "rating": 5, 
            "review": "Only been here once and I wish I knew about this place before .. I wasn't feelin very good this particular visit but prior to leaving I felt much better ., go figure that sushi cured a stomach ache right!"
        }, 
        {
            "index": 125, 
            "rating": 1, 
            "review": "This place is TERRIBLE! Service sucks and food sucks more. What really upset me was the ahi. We were served flavorless and hard spicy tuna! Spicy tuna don was mostly rice and a very thin layer of poke. Also, the spicy tuna handroll is a JOKE. $5.50 for a small, flavorless handroll? It seriously tasted like cucumber and rice! So disappointed, I rather drive farther than go to this place. Don't waste your time and money here!"
        }, 
        {
            "index": 126, 
            "rating": 4, 
            "review": "Great place for a quick lunch. The happy hour deals are great! LOVE the ahi poke bowls. They give you a lot, you really get your moneys worth. They also have all you can eat!"
        }, 
        {
            "index": 127, 
            "rating": 5, 
            "review": "Nice, laid back staff.  If you want white glove service, you are in the wrong place.  It is more like going to dinner at your favorite Aunt's house.  Hawaiian style, not formal, but super nice people.  Food is excellent, especially if you consider how affordable it is... And even better when you catch their happy hour... I have been here five times (a couple of times for lunch and the rest for dinner) and every time was delicious and food came out very quickly.  The white wine I had was great, too."
        }, 
        {
            "index": 128, 
            "rating": 5, 
            "review": "My boyfriend happened to notice the \"808\" on the sign as we were driving by one day. He used to live in a Hawaii, so he was hoping that they'd have some poke (which they did).  Not only did they have what he wanted, but they had so many other tasty items to choose from and they had AYCE for just $24.95.  Since that day, we've been here more times than we can count and it has become our favorite sushi spot.\n\nWhenever we go, we order some ahi poke, Da Kamikaze Roll (tempura, eel, spicy soft shell crab, and salmon with eel sauce), 808 Roll (spicy soft shell crab and tuna with spicy mayo and eel sauce), and Rainbow Roll.  He gets the Mango mochi for dessert and I always get their Bonzai Special (deep fried apple spring roll with vanilla ice cream and chocolate sauce).  Those are our favorites, but we've also tried the shrimp tempura, tako poke, hamachi kama, mochiko chicken, miso salmon kama, and a few of their other rolls.  We've yet to be disappointed.  My boyfriend's sister did try their teriyaki chicken and enjoyed it, as well. \n \nThe place is really laid back, the staff is always friendly, the service is always prompt, the seafood is always fresh, and the food is always yummy!"
        }, 
        {
            "index": 129, 
            "rating": 1, 
            "review": "I thought I would give this place a try since it's near my house. Worse sushi rolls ever! Dry, quality was terrible, no flavor, they only redeemed themselves by taking one role off our tab without me asking. Go to Oyshi so much better!"
        }, 
        {
            "index": 130, 
            "rating": 5, 
            "review": "Been here a few times, but they really deserve this 5 stars.  Went on a holiday for happy hour. They were very gracious accommodating our large party of 7. We ordered just about everything on happy hour menu x2 and can't beat the $1 sake x??!!  808 roll is my favorite. I was hesitant because I normally don't like soft shell crab. But they prepare so well, it's not hard just a little crunch. Cucumber salad and seaweed salad awesome!!  Please get the dessert with the apples and ice cream!  Please!  I don't care how full you are, you WILL NOT regret it. Service was amazing!  Everyone was genuinely friendly. I love how every single employee works as a team. You can ask anyone walking by for anything and it just gets done."
        }, 
        {
            "index": 131, 
            "rating": 2, 
            "review": "I regularly eat at Sushi Mon in Silverado Ranch and wanted to try a new place. No comparison. Service here was bad. Young female waitress was lost.\n Sushi was so-so but maguro was not  the freshest I have eaten. Hamachi okay. Hamachi kama and sauce can't beat Sushi Mon.\nI will stick to eating sushi at Sushi Mon from now on."
        }, 
        {
            "index": 132, 
            "rating": 5, 
            "review": "Woah! Newest favorite sushi spot for Happy Hour! The most incredible prices in combination with high-quality sushi. \n\nYou know when you order from sushi happy hours, they always present you with the skimpiest, lack-luster rolls? The whole \"get what you paid for\" kinda thing? 808 Sushi ACTUALLY gives you a full serving - the same they would at regular price. HALLELUJAH."
        }, 
        {
            "index": 133, 
            "rating": 1, 
            "review": "Bad service and bad food. This is the first restaurant my husband and I complained and they didn't do anything about so we just had to leave. It was that awful."
        }, 
        {
            "index": 134, 
            "rating": 5, 
            "review": "My review pertains to 808 Sushi's happy hour special (Fri and Sat 9pm-11pm. 50% off all cut rolls and appetizers and all beer! $1 hot sake!!)\n\nThis place makes it COMPLETELY possible to pop in for a correct sized portion of food that is so good it leaves you craving it long after you KNOW you have no more room in your tummy!\n\nWe always start off with the Poke appetizer $6.95 (or maybe it's $5.95)..EVERYTIME it has been to die for!  Granted I've never killed a fish and eaten it onsite, but this is as close as it will probably get for me!!\n\nNext one of us will pick a roll at random-there is a great selection..most range from $4-7..pair that up with a couple $1 sakes and a beer and our night is perfect!  We usually get outta there for under $20-stuffed, happy and tipsy..hehe\n\nMost recently we had the Maui Special roll..which is tempura shrimp, unagi, cream cheese, and cucumber drizzled with eel sauce.  I can't even express how delicious it was!!\n\nThe service is ALWAYS friendly and if you go often enough, they remember you!\n\n\nEr, in the past, we've done the All you can eat and that was delicious as well, but one doesn't always have the time/stomach space/cash for AYCE-so this happy hour special hits the spot!"
        }, 
        {
            "index": 135, 
            "rating": 4, 
            "review": "We really love this place. The staff is nice, sushi is delicious, and it's close to my everyday travel route."
        }, 
        {
            "index": 136, 
            "rating": 5, 
            "review": "A plus sushi and service. They will even surprise you every now and then with a treat like BLUEFIN tuna !!!!!"
        }, 
        {
            "index": 137, 
            "rating": 5, 
            "review": "The service is great, the sushi is delicious, and the prices are excellent (especially during happy hour). This place is one of my favorites."
        }, 
        {
            "index": 138, 
            "rating": 1, 
            "review": "I did not appreciate the hair in my salmon nigiri. After making the waitress aware of the hair, she just said \"oh goodness\". No apology was given right away nor was the situation taken highly. Another waitress brought back another order and apologized. It wasn't until later on that the original waitress even explained they were taking 15% off the bill. \n\nShe only checked on us once without us looking around for her multiple times. We had to ask her to refill out waters. The service could have been better but a tad bit slow. I enjoyed coming here for the kamakazii and candy cane roll but unfortunately will not be coming back.\n\nManager should train their waitresses to up their service quality, especially when the customer finds hair in their food!"
        }, 
        {
            "index": 139, 
            "rating": 5, 
            "review": "Love, love, love this place!!! The curry is really good, but the all-you-can-eat special is the best! Try the Haleakala roll - so good even for the sushi squeamish like me.  If you go for the all-you-can-eat, be sure to get your punch card!  We didn't know about it until we had eaten here several times, and our card would almost be full by now!"
        }, 
        {
            "index": 140, 
            "rating": 1, 
            "review": "I've ate here for the 2nd time, with my family: 4 adults, one child, one baby (free).\n\nOur male waiter, sucked. Our female waiter, was good. The guy made us feel like he was rushing us on our orders. He would roam by time to time and quickly say, I mean quickly, \"everything okay? Ok..\" Then walks away not even giving us one second to answer. The food/sushi was good, overall I guess. A little heavy on the sauces and the fish cut too thin compared to other competitors. All my niece who is 6yrs old wanted was a miso soup and he would not for the life of him, let it come from any of our all you can eat menu. (Every other sushi place let it slide)\nTheir appetizer portion of the AYCE menu isn't that great compared to other sushi joints. If the price was cheaper it would make more sense. \n\nIf you're going to spend the same amount on AYCE sushi, DONT GO HERE! They are very uptight about every little thing. Sumo Sushi is literally a minute away and they're AYCE is the same price for much better quality food and way more choices.\n\nFor the dessert round, you only can have one item per person and every other sushi place you can get ice cream along with one more item. \n\nThe menus are sticky and dirty. Not much to choose from either. Why make the AYCE the same price as other places when they don't even match up to other competitors levels? \n\nI'm from Hawaii and this place, like many others say, has NO ALOHA what so ever. I never write reviews so this is a first. It was so disappointing. \n\nIt wasn't even busy. The man is not nice at all, so rude, so all-over-the-place. It's a disgrace to even add \"808\" in the name of the place."
        }, 
        {
            "index": 141, 
            "rating": 4, 
            "review": "I love the Philadelphia Deep Fried roll. The sushi makers are nice, the hot tea is good, and the place is good to hit up for the happy hour special."
        }, 
        {
            "index": 142, 
            "rating": 4, 
            "review": "Love this place! Good ACYE! Always had great service!!! No matter what I order I can expect good sushi."
        }, 
        {
            "index": 143, 
            "rating": 5, 
            "review": "Ammmmmmazing ! The absolute best ever ! Great service , great food and great happy hour !  Love this sushi place ! My fave !"
        }, 
        {
            "index": 144, 
            "rating": 1, 
            "review": "So Ive been coming here for over 4 years and tonight I have to say was the worse EVER!!!!  The food wasnt made right. The korean server was a bitch!!!  Rolled her eyes at us when we had a request.  Bitch we where the only table in there!!!!  She just lost her tip!!!  I will be calling the owner Dean!!!!"
        }, 
        {
            "index": 145, 
            "rating": 3, 
            "review": "3 stars due to service.\n\nThis was a lunch date and our 1st time here.  Food was amazing and comes out quite quickly.  We shared a 3 item combo that comes with soup, salad, edamame, and rice with miso black cod, kalbi, and seared poke.   Dessert also comes with plate.  We also had a deep fried california roll, joes special roll, and garlic chicken.  Everything tasted really good.  The food deserves 4 1/2 stars.  \n\nNow for the thing that bought their rating down.  SERVICE!  Server never came back to table until we had literally a few bites left!  Our drinks got filled at the end too.  Not very personable or friendly.  It wasn't even busy!  Hate to go on a busy day/night."
        }, 
        {
            "index": 146, 
            "rating": 2, 
            "review": "My husband and I have been here a few times. Each time the floor has been littered with trash. The fact that 808 uses a 3rd party to deliver is super annoying, either deliver or don't deliver because the delivery service is not worth the money and it takes sometimes hours to get it delivered. Portions are tiny and I am a very light eater, so imagine my husbands feelings about this matter - I think he's just insulted.  I've heard mixed reviews about the quality of food, I'll just say if you're doing AYCE then it's eh-okay for a strip mall kind of food joint, I've had okay and not so fresh tasting fish here. After being insulted by sub-par food, it's doubly annoying to get stuck in a flood of tiny people in karate uniforms practicing their karate moves...somehow this always happens to me and I have to awkwardly maneuver my way to my car."
        }, 
        {
            "index": 147, 
            "rating": 3, 
            "review": "Average. Wasn't horrible.  Wasn't great. There are definitely better AYCE sushi places in town. I probably wont be back. Left me underwhelmed but filled my tummy."
        }, 
        {
            "index": 148, 
            "rating": 3, 
            "review": "My first time experience and I did the all you can eat. I ordered and almost after the second roll they all tasted the same, just different colors. I was recommended the garlic chicken to start with and I was expecting salty. It was more on the sweeter side like something from panda express. Their bonzai special was different and good. If you have to use the restroom good luck I tried three times just to wash my hands, they only have 1 person restrooms."
        }, 
        {
            "index": 149, 
            "rating": 5, 
            "review": "always the best sushi around.. just wish they used sustainable fishing suppliers"
        }, 
        {
            "index": 150, 
            "rating": 5, 
            "review": "The sushi here was AWESOME! They have a great happy hour deal and you can pretty much eat until you feel like your going to explode! My husband and I shared like eight different rolls for around $40!!! I've eaten a lot of sushi in my lifetime, and this place was top notch. I definitely recommend!"
        }, 
        {
            "index": 151, 
            "rating": 4, 
            "review": "I really recommend doing happy hour here. It is definitely worth it! 1/2 off sushi rolls?!? Uh YES!! \n\nRolls:\n\nThere was one thing I'd like to point out here--I usually love eel when it comes to sushi but they really make it odd tasting/ fishy here. Maybe it was the day I went or just me...but just an FYI."
        }, 
        {
            "index": 152, 
            "rating": 5, 
            "review": "HANDS DOWN, THIS IS THE SPOT!!!\n\nI FINALLY went after hearing SO MANY GREAT things about this place and I couldn't AGREE MORE!!!\n\nFlavor packed, BIG cuts of fish, and an EXTREMELY  WARM, WELCOMING, FRIENDLY STAFF took my experience to HIGHEST LEVEL POSSIBLE!\n\nYou can't beat the AYCE or the HAPPY HOUR Half Price Rolls, Half Off Beer and $1.00 Hot Sake!!"
        }, 
        {
            "index": 153, 
            "rating": 4, 
            "review": "Excellent service, great tasting food. Their rolls are small compared to other sushi places that create hearty rolls. However, their happy hour specials compensate for the size. I will return, and I recommend this place if you are near Rhodes Ranch."
        }, 
        {
            "index": 154, 
            "rating": 1, 
            "review": "Never had a worse experience at any restaurant. The main thing that rattled my nerves was the service. I had recently moved into the neighborhood and had a late-night sushi craving, so I thought I would try this place out. When I walked in, I noticed right away that it looked like this place was being ran by a bunch of kids. Granted, the hostess/server didn't do anything wrong, they certainly weren't inviting. I sat myself at the sushi bar. \n\nAfter looking over the all you can eat menu, i told the waitress that i had decided to do that. They informed me that it was just a little passed 10pm and that last call was 10:30. I have been to a few all you can eat sushi places in Vegas around closing and understood the last call rule, but the way the said it to me made me feel like I was inconveniencing them. Let me first start by saying, the menu was very limited compared to other sushi establishments around the city! I was sitting (literally) right in front of the two sushi 'cooks.' Neither of them acknowledged me, but instead were speaking about some of the tables in the restaurant, making fun of them, and bad-talkng the hispanic cooks in the kitchen line behind them.\n\nAfter about 5 minutes of just sitting there, the server came by and took my order. I was craving a baked roll--like a lasagna. They had one similar, so i ordered that, along with a couple others. Right when one of the cooks (bigger guy that seems to have been in charge) saw my order, he told me he couldnt make that roll because he was out of scallops. I know, for a fact, they didn't run out of scallops because I saw one of the prep cooks with them. For whatever reason, they just didn't want to deal with it. \n\nAnyhow, I ordered something in place of that roll. While waiting and observing these guys go back and forth about how they cant wait to get out and huffing and puffing every time someone ordered something else, I couldn't help but to think \"why am i spending money in this place?!\" I sat there for seriously just about 10min for two rolls. When I was finished with those, I was expecting my other to come up...waited for another 10 minutes before the 'cook' realized he forgot to start making it.\n\nTo shorten up this review a bit, I am gonna leave it at that. The service was awful and the food was crap. Please people, drive a little further and spend your money at Goyemon (or even Oyshi)! At least you know they appreciate your business, you'll get good service and the food is great (speaking of Goymeon)."
        }, 
        {
            "index": 155, 
            "rating": 2, 
            "review": "This place was highly recommended by close friends and we finally headed there as a group a few nights ago. I am a nigiri fan, so I always order albacore and yellowtail to see how different sushi places taste. I wasn't impressed, and it didn't seem \"fresh\". I also ordered the Candy Cane roll, and it was good, but over priced for a roll. Aside from that, the service was great and the restaurant was very busy, but it just wasn't my favorite."
        }, 
        {
            "index": 156, 
            "rating": 4, 
            "review": "Love their happy hour specials!! Great price for sushi!  Staff is great. We go here regularly because the food is fresh and the service is great! Even my 5 year old loves it. They give him little trainer chopsticks that he loves. I wish they had a little more variety in their rolls, but otherwise we love it! They will also customize your rolls for you too. Fyi."
        }, 
        {
            "index": 157, 
            "rating": 4, 
            "review": "Been coming here for awhile with my girlfriend. Definitely one of my favorite spots for a quick sushi fix. Happy hour menu is cheap and rolls are good. The staff is very friendly and chefs are always nice. One of my favorite dishes after a workout is the spicy tuna don. Good portion and great meal! As long as they don't change expect me to remain a regular."
        }, 
        {
            "index": 158, 
            "rating": 2, 
            "review": "The food  here is great! Especially the 808 Roll.\n\nHowever, every time I have been the service has been horrid. \n\nIf you are going to do the 'all-you-can-eat' be sure to order a roll as soon as another is brought to you. The waitresses do not come around often. For example,  I was brought a roll, finished it in about 5 minutes. Then had to wait 20 mins to get my next roll.\n\nIt has been like this multiple times. Probably best if you just order food to go."
        }, 
        {
            "index": 159, 
            "rating": 1, 
            "review": "Myself, my husband and my son came in for happy hour on a Thursday afternoon. It was a quiet day in the 808 so we were told to just grab a seat wherever. We sat at a table for 4. We ordered our food and my brothers' food who was to join us. Not too long after the food arrived my brother showed up along with our friend (unbeknownst to us). Naturally we all want to sit together, so, my husband grabs a chair from an empty table behind us for our friend. As soon as that happened the waitress rushes over to us and says that we can't do that so I told her ok than can we move to the table next to us that was a table for 6. And she tells us we can't do that either, she says in order to be sat together we would have to arrive together..WTH!!..mind you it just us and couple that was dining at the time. So, explain to me what the issue is here? My brother left along with our friend. Of course I'm confused of what just happened and wanted an explanation. To make a long story short she said it's Dean's policy (the owner) cuz there's been numerous complaints blah blah blah and that they are trying to figure out blah blah blah...really right now, save it, if you're still trying to figure $#!+ out on how to run things in the dining area than use your better judgment or your own discretion on on certain issues...like I said it was a slow day in the 808... \n\nbtw...get your knives sharpened or somethin cuz there's gotta be something wrong when you pick up one sushi and the whole roll is still connected....sushi gone wrong! \n\nYeah, such a shame to call such a place 808 when there's no ALOHA spirit or service! \n\n1 1/2 ago I raved about this place and would rate it 5stars...NOW if You ask me today I would rate this place ZERO stars but I have to rate at least 1 star to post my review.\n\nJust so you know we were here 2 weeks prior to this incident with disservice and today we decided to give it another chance...and it has gotten to this point. Done with the 808."
        }, 
        {
            "index": 160, 
            "rating": 4, 
            "review": "I give this place four stars for the simple fact they have a happy hour that is affordable!  Seems that not a lot of sushi places have a good solid happy hour.  As for the rolls they are ok, not the best you will ever have but for the happy hour price it's worth it.  They are a bit small so out of happy hour I wouldn't eat here."
        }, 
        {
            "index": 161, 
            "rating": 2, 
            "review": "I used to visit at least once a week for about a year.  I actually used to love the sushi but the quality of fish has gone straight down.  I kept trying to give it another chance and it just isn't where I want to spend my money anymore for Sushi.  AYCE and Happy Hour Pricing has ruined the quality of the fish.  It's like they kept buying cheaper and cheaper ingredients.  I had a friend in town that wanted to go so we did and that's when I made up my mind that I wouldn't be coming back for sushi.  Since I gave up on the fish and sushi improving I would still visit occasionally just for the Teri-Beef. (they even changed the Beef Supplier for this)  Not even close to what you used to be 808.\n\nThe Teri Beef is a 10/10 if you are looking for a non fish item."
        }, 
        {
            "index": 162, 
            "rating": 4, 
            "review": "Great place for sushi rolls! They also have happy hour from 3-6pm and all rolls and some appetizers are half off! You can't go wrong with that. The fish is fresh and all of the rolls and special rolls are tasty. The ahi tuna poke is my favorite. They use very fresh tuna and the portion is large! The staff is also very nice... I love this place!"
        }, 
        {
            "index": 163, 
            "rating": 5, 
            "review": "Love the happy hour!!! The garlic chicken and Gyoza are fantastic! I love my sashimi and the 9 piece always makes me happy. The people there are always friendly and inviting-glad this place is around the corner!"
        }, 
        {
            "index": 164, 
            "rating": 4, 
            "review": "Went there tonight, pretty busy on a Friday evening for dinner. We had to wait about 5 minutes to get a table for 8 of us but it was worth it. The food came out right away since 3 of us did all you can eat and the rest just had the combination plates. We ordered the 808 special roll and we liked it the best. Tried a little bit of everything on the appetizer menu and they were all tasty. Considering it was our first time there; we will definitely go back for more!"
        }, 
        {
            "index": 165, 
            "rating": 5, 
            "review": "I've been in Vegas since 2005 and this is my favorite local sushi joint that does all you can eat.  The service is always awesome, the staff friendly, and the 808 roll is to die for. Some of the best all you can eat in town."
        }, 
        {
            "index": 166, 
            "rating": 3, 
            "review": "First two times were great, got different rolls each time along with screaming orgasm sashimi. The third time I ordered two screaming orgasms and the cuts were wayyyy different.. One was very tough, almost like lines of cartilage through the tuna, I had to vigorously chew it to get it down. The other was sloppy, like the cook seared a big chunk of tuna and then snipped it with scissors. The ends were way overcooked and 30% of the middle pieces. If I wanted plain tuna I'd just buy a can. Reason for the 3 stars is the first two times eating here it was pretty good. Just a different chef that night I guess. Hit or miss."
        }, 
        {
            "index": 167, 
            "rating": 4, 
            "review": "Try the garlic chicken and the Yokohama sushi roll!"
        }, 
        {
            "index": 168, 
            "rating": 5, 
            "review": "siiiigh* my stomache is still full from eating here! I came in around 4:30pm for the all you can eat dinner & there were two female servers; one was Crystal but I didn't catch the other gals name. Super friendly & cute girls :) I sat at a table with my love & we ordred the Alii roll, Joe's Special, Spicy Yellowtail, Tiger roll, Da Kamikazi roll & Crunch roll. For dessert we got the ice cream with apple pie & chocolate sauce :9 The sushi is awesome & different from any other place I've been to in Vegas, you have to try it out! Crystal recommended us coming in next time & trying the appetizers (we were boring & got edamame & seaweed salad) with the star by them. The items with the stars next to them are one order per person. I'll post a picture of the menu soon!"
        }, 
        {
            "index": 169, 
            "rating": 4, 
            "review": "Not bad sushi! Not the best I've ever had but it's worth going to. My kids love this place. The happy hour is cool too. Cheap drinks."
        }, 
        {
            "index": 170, 
            "rating": 1, 
            "review": "We'd actually eaten here before & had great experiences however this time we shared our sushi with a cockroach. It took 5 minutes of the staff & me trying to catch him when he was finally caught by a sushi chef. And we were still presented a bill.  Ewww"
        }, 
        {
            "index": 171, 
            "rating": 1, 
            "review": "quite possibly the worst sushi I have ever had. I ordered spicy tuna don.   The tuna was spoiled, and the sauce was straight mayonnaise with no spice or flavor. This allowed me to really appreciate just how bad the fish was.  \n\nAt least it was a good portion size.  If you give bad food, at least give a lot of it so your customers really get sick.\n\nAddition from later same day, I was nauseous beginning 1 hour afterwards, lasting for several hours."
        }, 
        {
            "index": 172, 
            "rating": 5, 
            "review": "Great happy hour , very nice staff , this will be our new sushi bar , love the garlic chicken"
        }, 
        {
            "index": 173, 
            "rating": 5, 
            "review": "Always great sushi and service!   I love the 808 special and gator roll!!!! Amazing!!!"
        }, 
        {
            "index": 174, 
            "rating": 5, 
            "review": "The sushi is above par I am five staring this place because of the garlic chicken. I can't get enough when I'm there. On top of that it's part of the happy hour menu. Trust me on this and try the garlic chicken at least once it's unbelivabe good and the marinate juice is still in the chicken and almost explodes in the your mouth and taste amazing."
        }, 
        {
            "index": 175, 
            "rating": 3, 
            "review": "Great happy hour but sub par service. They kept forgetting things that we asked for! They couldn't even remember something as simple as a glass of water for my wife. But, it's good happy hour prices, especially if your with a big group and you guys just share. Saves you money in the long run. But if you're not doing happy hour don't go."
        }, 
        {
            "index": 176, 
            "rating": 4, 
            "review": "My workplace is by 808 Sushi and I make sure i spend  my lunch break ordering my usual here-- Deep Fried Philadelphia Roll and Garlic Chicken. My lunch is during happy hour so price is totally awesome. Around $8 or $9! I just wish they were consistent with portion size and flavor but I love this place nonetheless."
        }, 
        {
            "index": 177, 
            "rating": 5, 
            "review": "They have the mochicko Chicken. I like everything on the menu except for squid items. I'm not into calimari. But everything else is worth the visit."
        }, 
        {
            "index": 178, 
            "rating": 1, 
            "review": "We have been 'Regulars' at this place for over 2+ years, after our favorite sushi joint-Brian's Beach closed. We use to come about once a week or so, until all our waitresses were replaced with some new ones. Our once a week trips became more like once a month. Don't get me wrong,but if you're going to name your restaurant 808-please have some sense to have people with some aloha or people that can pronounce the Hawaiian terms that's on the menu. \nNevertheless, we walk in tonight, excited to use our gift certificate that we got for Christmas, bring in some out of town family, and have the worst experience ever! What a shame 808 Sushi!!! Too our surprise, after a horrible customer service experience-waiting to get our orders about 3 times, hot tea not hot, and not even warm, waitresses clearing plates while we're in the process of eating off of them, water not refilled timely, reminding waitresses what we ordered, and then the most unbelievable experience ever.... Now we're ready to pay with our $200 gift certificate . Quickly, the waitress says, we can't do cash value and that the $200 will be forfeited. I'm appalled and state, \"We don't want cash back, we just want the remainder of our balance perhaps in another gift certificate?!\" She rushes to her manager on duty who took about 30 minutes to call the general manager 'Agnes' to tell us the same thing. Now, you have not only lost loyal customers, but this loyal customer has no problem sharing the stupidity of this restaurant. \nWhy sell someone a $200 gift certificate when you have to use it all at once or loose it?!!!! No one has time for that $h*+!!! It's $26.95 per person  for AYCE. I don't have a family of 8 to use it all at once, or specify somewhere on that big card all the rules you just made up. This isn't a group on special, my Mother-in-law paid you $200 so we can enjoy this restaurant a few times!!! FYI, sell smaller increments, or warn the buyer of this rule-(waitress heard of 2 days ago), unless your intention was to rip someone off! Who does that???!!! Or do people a favor don't sell them at all, so no one else gets ripped off. Never stepping foot in this place again and in all honesty, I would rather drive the 30 minutes to Island Sushi where they have the EXACT menu with competent people that have 'ALOHA!'"
        }, 
        {
            "index": 179, 
            "rating": 4, 
            "review": "Slow Service possibly you can get from any service. Sushi taste is goo, place is larger than average sushi place. will go back again,.."
        }, 
        {
            "index": 180, 
            "rating": 5, 
            "review": "LOVE this place!!! Just discovered it's minutes away from home and it will be a regular hang out spot for sure!! My husband and I don't normally do all you can eat sushi because it's generally hard to find a spot that doesn't over do it on the rice and underwhelm you with the fish, but this place was great!!\n\nFantastic all you can eat selections (and I tend to be picky when it comes to sushi!). The garlic fried chicken is a MUST TRY! I suggest dipping it in sriracha if you like spicy!  Also the super white tuna was excellent!! We sat at the bar and received awesome service from everyone!! Seemed like all the employees were on top of it throughout the restaurant!!! \n\nWe can't wait to return and try some more items off the menu, next time I need to come hungry because there are definitely more things I'd like to have!!!! \n\nIf you live in the area and enjoy an all you can eat sushi spot, I'd highly recommend 808 Sushi!!"
        }, 
        {
            "index": 181, 
            "rating": 5, 
            "review": "Great sushi place that also serves poke and other local foods!! Food was DELISH and the staff (Chase) was very friendly!! We'll be back!!"
        }, 
        {
            "index": 182, 
            "rating": 1, 
            "review": "Ok worse dining exp so far ordered threw menunu a grub hub like site.. Total was $60 ! so for that price I am expecting good stuff right, wrong very disappointed I was thinking quality like Raku or something however really shocked. \n\nCucumber salad -While thinking to myself well hoping it would of been more like a traditional kim chee style cucumber salad it wasn't very bland more like southern cucumber salad had about two bites thats about it tossed it out witch was sad it had some type of crab like thing on top witch made it hard to eat. \n\nGyoza - What I was looking forward to was cold had to re heat kinda disappointing having to re heat the food that should of been hot. \n\nMeat dish- I apologize for not remembering the name but it was HORRIBLE. !! The meat was super grisly, hard to eat, and smelled of flat top or cooking device.  \n\n\nI had deep fried roll - witch to me just had panko on top lightly crusted the bottom of the roll was not breaded. The rice was good thankfully not hard. \n\nThe dessert was the biggest disappointment - While the idea of a apple filled egg roll  like dessert intrigued my mind it fell threw on execution the ice cream was mixed into the dish and melted I MEAN COMPLETELY MELTED INTO THE DISH, Thus voiding the crispy texture of the actual dish. I was looking forward to this dish. I think since we live in dessert area I am from Phoenix too that the best way to carry ice cream is individually to avoid this process either in a smaller container and let the person place it on its own.  \n\nI really wanted to like this place I really did. However I just left a complaint with menunu and will follow threw hopefully to work out a refund. I would expect quality like this at a denny's rather the sushi joint. \n\nMeh sadly disappointing."
        }, 
        {
            "index": 183, 
            "rating": 2, 
            "review": "The food they serve isn't consistent. As far as freshness, some days their sushi tastes delicious and other days I question it. That is what has stopped me from coming here. I will admit that the seaweed salad is very addictive, however that may be the only reason it'd come back in. \n\n808 Sushi's service, particularly at night, is one of the worst I've ever experienced. Most waiters don't bother to check up on you after they've delivered your food. I had to constantly call a different waiter to request a refill or collect our dishes. Not to mention, their demeanor absolutely ruins your appetite. Reminder: this experience primarily happens during the evening times. I don't know why."
        }, 
        {
            "index": 184, 
            "rating": 1, 
            "review": "Go to SUMO SUSHI on the same complex...\n\nAt here after a long drive with husband, niece and nephew. We were all craving sushi and this was the closest sushi joint near the house. We were so happy that there was no wait time or place was empty which means, faster service. \n\nService was awful!!! We never got our water after 3 attempts, my husband's soda never arrived (we just had to tell them forget it because we were almost done) and the waitress looked over us while we were waving at her to ask for a fork for the kids to use but she never came...I ended up just walking up to the utensils and grabbing them myself. The only thing that came fast was the check. \n\nSushi portions were small, didnt look fresh, tempura shrimp was like baby shrimps. Im a huge sushi eater and I would def not eat here again even if it was the last sushi place in Las Vegas. GO TO SUMO SUSHI on the same complex, better sushi and tempura shrimp...SUMO was also very accommodating to our needs and served us with excellent service even when we were the only 3 customers in the restaurant."
        }, 
        {
            "index": 185, 
            "rating": 5, 
            "review": "went to 808 sushi for the first time yesterday and was very amazed! i LOVE the happy hour.  I believe the best thing on there is the garlic chicken and the poke, YUM!! the staff is very friendly, feels like im back home in hawaii! Just writing this review makes me wanna go back for the happy hour.  i HIGHLY recommend this place :)"
        }, 
        {
            "index": 186, 
            "rating": 5, 
            "review": "Garlic chicken, kalbi, & the 808 special are probably my top 3 choices. Everything else was good too. I'm definitely coming back."
        }, 
        {
            "index": 187, 
            "rating": 5, 
            "review": "Best sushi with the best happy hour price.  I seriously get disappointed at least once during a sushi meal... not tonight,  not here.  Every roll and app not only came out lightening fast,  but tasted THE BEST!!!  And for the price... it was an amazing meal and we will be back."
        }, 
        {
            "index": 188, 
            "rating": 3, 
            "review": "This place is a hit or miss. My husband and I come here quite often because we live really close by and sometimes my co workers and I come here to get some lunch too. \n\nThere service is mediocre when the right guys are not working. It seems that the guys do a better job than the ladies. Every time I've come and have had a lady help me I'm always waiting at least 30 to 45 minutes for a to go order even if they say give it 20 minutes or so. If I'm dining in the ladies are not as attentive. Also, when it says happy hour, I expect to get happy hour prices, but if the ladies are present they will not honor it for take out. \n\nThe foods great, but overall I try to only come here when it is happy hour since it's hard to get good service. The service brings their stars for me."
        }, 
        {
            "index": 189, 
            "rating": 5, 
            "review": "Did some AYCE Sushi here last week and have to say I was impressed. I actually did lunch on Wednesday and went back on Saturday with my family for dinner. Both times everything went great. \n\nFast Service? Check! \nGood Food? Check! \nWide Selection? Check! \nFresh? Check! \n\nBoth times I started the meals with Miso Soup and Edamame. Their miso is par for the course. Also had the Agedashi Tofu which was very good. They offer a deep fried Philly roll. Which is one of my faves. The crunch on the outside, slightly melty cream cheese mixed with the salmon. Um mm Good! Spicy Scallop roll was Yum. Then had some Nigiri pieces. All were fresh, and a good size. Especially liked the Garlic Tuna. \n\nAnd then $2.50 for Hot Sake to wash it all down. I dunno how it gets any better."
        }, 
        {
            "index": 190, 
            "rating": 5, 
            "review": "Love 808 Sushi. Good food and friendly owner and staff. I frequent the restaurant a few times per week. You can't beat the happy hour price. Fun to go there."
        }, 
        {
            "index": 191, 
            "rating": 5, 
            "review": "No comment. come and taste it ^^\nLove the sushi and the employes are fun to talk with"
        }, 
        {
            "index": 192, 
            "rating": 4, 
            "review": "I really enjoy sushi. But they also offer tempura shrimp and countless amounts of other delectable and great food! I loved the teriyaki beef on a bed of cabbage. Price is great and the place is very nice."
        }, 
        {
            "index": 193, 
            "rating": 5, 
            "review": "One of the best AYCE sushi places around.  I've had others before but this place ROCKS!  Not only because they are from my home state, but the service, staff, and food items are great!  My faves to order are the Spider roll, Kilauea, Joe's Special, and 808 Special.  We are here at least three times a month, and we always get all you can eat.  Dean and his staff make sure you are treated with the Aloha spirit.  :)"
        }, 
        {
            "index": 194, 
            "rating": 2, 
            "review": "I used to order take out from this place quite frequently, but the last 3 times experiences haven't been very good. I ordered spicy tuna every time and it used to be great! But now it seems like the fish is going bad. There is an overpowering fishy taste which causes me to feel like they are either serving bad fish or serving the older fish to take-out customers. Which is unacceptable. I won't be ordering from here again. :/"
        }, 
        {
            "index": 195, 
            "rating": 5, 
            "review": "If food can hit a gspot, 808 sushi hits it for sure.  Great food, amazing staff (make you feel like family foreal), decent prices, and simple decor.  Donburis are delicious, Sushi's always fresh and tasty, & the curry was good too. Its a must for us to drop by whenever were in town, or visit.  You neverr go wrong with 808 sushi, Tip them well they deserve it! :)"
        }, 
        {
            "index": 196, 
            "rating": 5, 
            "review": "absolutely LOVE there baked lasagna roll, so good!!! The fried tempura roll was good too! I will def be back soon!! :)"
        }, 
        {
            "index": 197, 
            "rating": 3, 
            "review": "I am fortunate to a number of great sushi places around where I live and 808 is definately one of them.  Not to say it's the best or worst but it is definately solid.  I actually like their apps, all their fried offerings are really good, and if you stop by you should give them a try.  The service is usually good as well, since it is a small place you have to expect that though.  There isn't really anything that jumps out at me though and that's why I have to give it 3 stars.  If there was I would bump it up a star but it is a very solid 3 stars for this place"
        }, 
        {
            "index": 198, 
            "rating": 4, 
            "review": "While staying in Vegas with my family, we came down here as it's a good spot for happy hour.\n\nYou can order exclusively off the happy hour menu and be stuffed for cheap. This place is no joke as they have really high quality rolls for cheap. The rolls were a little smaller than what I was expecting, however I'm not complaining!\n\nService was pretty good too. I had to flag my server down a couple times to refill the $1 happy hour sake, but other than that I would definitely come back here again!"
        }, 
        {
            "index": 199, 
            "rating": 5, 
            "review": "My husband and I both got the AYCE, and it is well worth it! Great food, excellent service! Food came out within 5 minutes of ordering pretty quickly, then slowed down to 1 roll at a time, but was perfect timing. \n\nAnother plus, they included our 3 year old daughter in the AYCE! And encouraged us to let her try the different rolls, and also were very friendly to point out the different apps you could order for a young one. \n\nStaff were very friendly and highly attentive to your needs. Someone was always there to fill your cup or to clear your plates if you were done with a roll.\n\nOne of the staff asked how everything was going for us, and I honestly replied - this is a great experience! I would highly recommend this place!!!"
        }, 
        {
            "index": 200, 
            "rating": 5, 
            "review": "Let me start off by saying I love sushi. I'm not sure how many places on here that I have Yelped about, but I feel like I have been to so many, and I've finally found my favorite here at 808. I even debated writing a review to I could try and keep it to myself :) \n\nSo, I always do the AYCE. I just think it's the best deal, and that way you can order as much as you want! The appetizers are included, and the best is the Miso Black Cod. OMG, it's buttery, soft, melt in your mouth amazing. Too bad with AYCE you can only order one. I also love the poke, and the gyoza. Yummm I'm drooling just thinking about it! \n\nOnto the sushi! The best roll here is the 808 hands down. You can't get better than this. It's spicy and sweet, and everything nice. And the fish here is SOOOOO fresh! The salmon nigiri, the albacore white tuna. Mmmmm. You really just can't even compare anywhere else to this place. \n\nAnd don't forget to ask for a stamp card, cause once you come here, you will DEFINITELY be coming back!!"
        }, 
        {
            "index": 201, 
            "rating": 5, 
            "review": "I can eat a lot..I mean a lot! And my friend can eat more than me. I've only heard hood things about 808, so I thought we'd give it a try. The best it on the menu is the 808 Special, and our waitress seemed especially passionate about this roll also. There are 11 nigiri items. And we has 2 of each. Ok, so that's 22. Then we also each had some udon and ordered our rolls. Nine of them. Our waitress was very friendly and nice, but did question our order amounts. After all, she was on her 4th sheet of paper for our order. She did ask us if she got it all correct, and she did. We would Judy order the second round later. And we did. We heard later from the manager, that the sushi chefs were questioning if the order was for both of us. It was. Everything there was terrific and definitely a place we would go to again and bring friends. What more could you ask for? Great food, great price, great atmosphere. We're all in!!!!"
        }, 
        {
            "index": 202, 
            "rating": 5, 
            "review": "Date night with 3 other couples. This place was packed good thing we made reservations. Their service was by far some of the best and fastest especially since we had 8 ppl ordering. Everything was super excellent. Nothing more to say."
        }, 
        {
            "index": 203, 
            "rating": 5, 
            "review": "My favorite Sushi restaurant by far! I love them and their exceptional customer service! Wait time is not too long. Great service, great owner, great waiters & great sushi! Aloha!"
        }, 
        {
            "index": 204, 
            "rating": 5, 
            "review": "I'm very surprised that this place has bad reviews. I go here with my boyfriend and our daughter all the time. At least once a week every Friday. Customer service for me is always great!!! I mean always. They give us everything we ask for and we never got a smirk from any of the employees. I love this place. And every time I go here, everyone is always having a good time... It's always busy for happy hour!!!!"
        }, 
        {
            "index": 205, 
            "rating": 4, 
            "review": "Thanks to yelp, I found this little gem.\n\nHappy Hour? I'm there!!! And it stops at 6:30pm??? even better!!! Now I don't have to speed down the 215 and risk getting a ticket before happy hour is over. \n\nFresh food and very nice employees. Can't wait to try the AYCE menu! \n\nNow I want sushi :("
        }, 
        {
            "index": 206, 
            "rating": 5, 
            "review": "Best sushi I have had in Vegas. Love the salmon katsu and ahi poke!  I had to ask for the Aloha Shoyu though....they actually had Kikkoman on the table (shame), but redeemed themselves with the real stuff!"
        }, 
        {
            "index": 207, 
            "rating": 5, 
            "review": "Amazing Place come here too often and great friendly people very personal place and great lunch!!! Love this place and will come here whenever i can. One of my Favs. Absolutely the best place for sushi wide selection fresh fish my favorite is the Yellow tail and the Mexican and 808 rolls are to die for I dream of this place and when sushi is brought up i always say 808. My family and i drive almost 20miles to come here every month thats how good it is."
        }, 
        {
            "index": 208, 
            "rating": 2, 
            "review": "My friend and I came here Saturday night after being told the wait at Goyemon would be an hour and a half. The bar seats were all taken but 1 and there were 2 other tables taken. We were both a little concerned that they weren't busier on a Sat. night. We took a table anyway and hoped for the best. As we rattled off our first set of orders were told they were out of Hamachi Kama ( both our fav)   Damn what a bummer.. We almost walked out but the hunger pangs in my belly told me to stay. Standouts on hot apps were the garlic chicken (very juicy) salmon collar and miso cod ( buttery and delicate) Unagi was very good but the tamago(egg custard) was terrible! The worst I ever had. The color was very off putting and I shouldn't have even tasted it. It was ice cold almost frozen! Eww.  My friend ordered a couple of fried rolls that were ok\nNothing special. The big problem was the service. Our waitress was completely unavailable to us! In 2 hours never once came to check on us. The night might've been a complete flop if not for the guy expediting the food. Super personable and funny. He even found one last hamachi and brought it to us to share. :) we ended the evening with dessert( u can only have 1 ) forgot the name but it's like a apple pie filled spring roll with vanilla ice cream whipped cream and chocolate sauce drizzle. Pretty good but the spring roll was a little greasy. As we were waiting to pay I filled out a comment card. Our waitress was the cashier and reads it right in front of us and very rudely says \" sorry my service was so bad\" !! We were both a little shocked. We left the restaurant and stood outside talking about what just happened when the manager came out and explained how she was new there and they were short a waitress tonight. He apologized and wanted to know what he could do to make us happy. He started to offer us a meal for next time but we said that is unnecessary. He was the best part of our night but there are way too many other sushi bars for me to try before I would even think about revisiting this one."
        }, 
        {
            "index": 209, 
            "rating": 3, 
            "review": "Love this place....this our family dinner gathering. But lately I was very disappointed because their all you can eat always out of uni. They should have an alternative selections or remove it from the menu. Not fair to those people craving for this."
        }, 
        {
            "index": 210, 
            "rating": 4, 
            "review": "OMG. the garlic chicken is the best thing ever. I love the AYCE (all you can eat) as well as the happy hour. They probably have the best happy hour prices and menu that I've ever seen. All of their simple rolls, fancy rolls, fish, etc are AMAZING.  I especially love the black cod, garlic chicken (as stated before), and specially rolls. The crazy thing is that its in vegas, and you don't get good Asian (let alone sushi/Japanese food) at many places. It is moderately priced, and I think anything under 30bucks for AYCE, made-to-order sushi is great. I don't like that Todai-way of eating when the sushi has been laying out. The only reason why I wouldn't rate this place a 5 is that one time I went and they ran out of rice...HUH??! like forreals?? haha but, giving grace, it was Thanksgiving week and Black Friday was probably crazy busy...But still, who runs out of rice at a sushi place? I think the workers could of at least said something else while we waited for them to cook more...because being \"out of rice\" just made them look silly. it was almost humorous cause they ran out of 2 kinds of sodas too. The nighttime workers are a little slower and a little less approachable. BUT, I absolutely loved the daytime worker's hospitality.  I think their Hawaiian accents just make me happy too. (: A few times a couple of our groups' orders didn't come out, but it was kind of okay because our eyes were bigger than our stomach. ANYWAY, overall I LOVE THIS PLACE. I live in California, but will come to 808 Sushi every time I visit Vegas. Overall, the food is forsure a 5+ quality place! (:"
        }, 
        {
            "index": 211, 
            "rating": 4, 
            "review": "Chirashi Bowl is the best deal in town for mixed sashimi on a bed of rice.  Comes with soup and salad.\n\nTheir happy hour menu offers a great variety.\n\nKid friendly and the chefs are very quick.  Never have to wait long for food.\n\nWish they served lunch on the weekends though.  I've stopped by at 1130/12 so many times only to see they're closed."
        }, 
        {
            "index": 212, 
            "rating": 1, 
            "review": "While the Sushi was decent I would give it 3 stars for AYCE sushi.  The service was HORRIBLE!!!\n\nFrom the minute I walked in they were giving me the cold shoulder.  When I finally got a hold of a host they said my whole party needs to be there, fair enough.  I said we don't want a table just to sit at the bar.   The host just walked away with no response.\n\nMy friends finally all arrive and I tell the host we are all here.  She told us to hold on and then what I can only assume is the manager came over and said he couldn't sit us because a big table had just arrived.  He didn't want to stress out the chefs.\n\nFinally, one of the most awesome sushi chefs yells from over the counter and asks us how many and invited us to sit in his zone at the bar.  The service from him was exceptional.  But service outside of that was non exsistant.  We couldn't even get a beer without a sigh from the server or the manager.\n\nI do not recommend this place!!"
        }, 
        {
            "index": 213, 
            "rating": 5, 
            "review": "LOVE happy hour here, hot sake for only $1? Yes please! \n\nI think out of all the sushi places around town, they have the best specials.\n\nRolls start off at $1.75, you can't beat that. Note that the happy hour rolls are a bit smaller but still filling. Their cucumber salad is addicting, it's so refreshing to me.\n\nI've only had the black widow, tempura, and california rolls here, but they are all amazing, specially the black widow. I always order the same thing. \n\nGive them a try, you have nothing to lose."
        }, 
        {
            "index": 214, 
            "rating": 5, 
            "review": "Most favorite Sushi spot in Vegas! Awesome $1 Saki during happy hour, fresh Philadelphia Roll Deep Fried, and perfectly sea salted edamame. We stop thru every.single.time"
        }, 
        {
            "index": 215, 
            "rating": 4, 
            "review": "I have never had the AYCE here.. only Happy Hour.. and it's been awesome so far!\nIt's really close to my boyfriend's house and I think my boyfriend feels at home with all the servers since he's from Hawaii as well.. They often start to speak in pigeon with each other haha.. \n\nAnyways 808 Sushi's HH hours are: Mon - Thr 11:30am - 6:30pm,\nFri 3pm - 6:30pm & 9pm - 11pm, Sat 4pm - 6pm & 9pm - 11pm, Sun  4pm - 6pm!!!\nAnd they even let you take out HH on some of those days..\n\nYou can't beat $1 sake and $1.50 Sapporo/Kirin Light... My must haves for food are the garlic chicken & the ahi poke.. SO SO SO good! Especially for the price. \n\nMahalo~ haha"
        }, 
        {
            "index": 216, 
            "rating": 3, 
            "review": "ordered to go tempura dinnerS it's alright.. the tempura is dry, edamame taste and looks old as well as the salad. they gave me a lot of rice and good sauce but it's not shrimp itself is not that good so I'm not even happy with it. just trying it for now.. I'm not sure if they have other good stuffs... the place is ok. small.. reception area is not nice and not inviting. overall it's just an ok resto.. ok for a quick grab and if ur really really hungry.."
        }, 
        {
            "index": 217, 
            "rating": 4, 
            "review": "We may have found our new place for happy hour sushi! \n\nI used to be the \"all-you-can-eat\" type but i just ended up over stuffing my face and left too bloated each time, so I've gone back to ala carte. \n\nOur go to place for happy hour used to be Kobe sushi, but we grew tired of their rolls  and ventured off to somewhere new & we are glad we did. \n\nWe tried the 808, da kamikaze, black widow, and miso soup. All were delish! \nAll 3 were quite tasty & we left full and satisfied. \n\nAtmosphere is your typical sushi joint - they have a sitting area near the bar or the dining area.  Not spacious, but not too tight either.  Service was attentive and I liked how they let us know when it was last call for happy hour orders.\n\nWe will be back for sure! =)"
        }, 
        {
            "index": 218, 
            "rating": 5, 
            "review": "One of my favorite sushi spots for the price! They have a happy \"hour\" daily with half priced rolls and other items. My favorites are the triple crown and the 808 special."
        }, 
        {
            "index": 219, 
            "rating": 2, 
            "review": "Very bad experience here. No Aloha to be had here so steer clear! Waitress' were very rude.Had the \"All You Can Eat\" for $25.00 and had literally 4 small pieces left and they wouldn't let us take it home-But we could purchase it! How Pake! It's not like we over-ordered a bunch of food and tried that! Then the bill was $59.00 and we paid with a Hundred dollar bill and the waitress brought me 2-20's and a  one! What a punk move! Looking for a 30% percent tip! My wife is Native Hawaiian born and raised on Oahu and we'll never go back Very disappointed. Auwe!"
        }, 
        {
            "index": 220, 
            "rating": 1, 
            "review": "I would rate this place no stars if I could...\n\nI had purchased the $20 for $40 groupon and was extremely excited to try this place... As a frequent user of groupon I understand that many groupons cannot be applied towards happy hour prices. However, never I have gone into a restaurant and have been told that since I have a groupon that no one else in my 'party' could receive happy hour pricing.. So separate people can't have separate checks???\n\nAnd they wanted us to pay $2.50 for hot sake (normal price) when happy hour sake was $1.. That's more of a discount than my groupon!\n\nAnd as to the food, it was OK. The rolls were small and flavorless. It is was not worth any more than groupon or happy hour pricing. The poke salad had good tuna but that's about it. Their rainbow roll and tiger roll were blah. \n\nThe service itself was OK but the waitress SHOULD have given us separate checks... That's just stupid on her part. Doesn't she want a tip? Repeat customers???\n\nOverall I was very disappointed. I am always looking for new happy hours.. And 808 sushi will not be on my list..."
        }, 
        {
            "index": 221, 
            "rating": 4, 
            "review": "This is my sister's and I favorite place for happy hour sushi. We love the 808 special!"
        }, 
        {
            "index": 222, 
            "rating": 5, 
            "review": "This is our go-to happy hour spot during the week!  All of their sushi rolls are half price, and they have specials on their appetizers as well.  We always get the 808 Special (spicy soft shell crab/spicy tuna with spicy mayo and eel sauce).  It's pretty amazing.  Other favorites: Gator Roll (spicy soft shell crab, avocado/deep fried unagi, eel sauce), Dragon Roll (tempura, crab, avocado/unagi, eel sauce), and the Mexican Roll (if you like it spicy!)  The salmon katsu, cucumber salad, ahi poke, and garlic chicken are great starters. \n\nThey have a great kids menu too!  For around $5, my daughter got a plate with teri beef, spam musubi, rice, and oreo cookies.  \n\nThe prices are very reasonable for happy hour, service is great, food is delicious...we just love this place!"
        }, 
        {
            "index": 223, 
            "rating": 4, 
            "review": "Make good use of the happy hour prices.  Very well made sushi.  My sons and I love this place.  Try the 808 signature sushi and teriyaki beef and the garlic chicken will me you smack your momma and grand momma and anyone else's momma.  So dam good"
        }, 
        {
            "index": 224, 
            "rating": 4, 
            "review": "Aloha... Konichiwa... Vegas Yelpers!!! :D\n\nSo... I've been meaning to try this spot for the last couple of months...\nfinally came here last month... during happy hour with my friend who comes here every week!\n\nI ordered a couple of standard rolls... decent and yummy!\n\nIt's a casual indoor seating japanese spot with a Hawaii twist. \n\nI say... if you're in the area... stop by here for Happy Hour only!\n\nHappy Hour = cheap eats!\n\nGotta love Hawaii people :D\n\nEnjoy."
        }, 
        {
            "index": 225, 
            "rating": 5, 
            "review": "Hands down my FAVORITE place to go! Of course there's other awesome places like Sushi Mon but this one is closer to my house. I LOVE their all you can eat menu, plus they don't have negative signs posted everyone about Rules & Time limits! Great Happy Hours specials too.They make you feel important and remember you if you go often. My favorite is the Muai Special and the Nigiri Hamachi(ask for yuzu sauce). Shrimp Tempura is light and big pieces. Thei bonzai desert is delish! LOVE LOVE LOVE this place!"
        }, 
        {
            "index": 226, 
            "rating": 1, 
            "review": "Horrible service and horrible food !!!!\nWent to have lunch and they told us to pick a table and after we did they told us that we have to move because that table was for 4 of more . The place was dead !!!! Really ??????"
        }, 
        {
            "index": 227, 
            "rating": 3, 
            "review": "This is another AYCE place with interesting food.  Their teriyaki katsu has the teriyaki in the batter and then fried.  It was freaky, but it was strangely yummy.  Personally, I like this place.  Want to know why?  Besides the good sushi, they sell squishy octopus toys.  \n\nEver see a scion with one on the dash? Yep.  Me.  CUTENESS OVERLOAD."
        }, 
        {
            "index": 228, 
            "rating": 5, 
            "review": "My fiancé always comes here for their garlic chicken, which is really yummy! We come here for their all you can eat dinner (around $27) and it includes an array of appetizers and handrolls/rolls. I love their super white tuna and yellowtail nigiri! Always leaving full and satisfied. Service is good and the owner is very nice!"
        }, 
        {
            "index": 229, 
            "rating": 4, 
            "review": "Seared poke, spider hand roll, nigiri hirame, tako poke, apple sake..... I can't remember what we all ordered but I think it was almost everything on the menu!! Great options and very flavorful. Sake bombs were a great hit with the guys."
        }, 
        {
            "index": 230, 
            "rating": 5, 
            "review": "I, along with six family members at 808 Sushi on Saturday 9/1/12. We were there for their Happy Hour.  Their Happy Hour is Monday - Thursday 11:30am - 6:30pm, Friday 3 - 6:30pm and 9 - 11pm, Saturday 4 - 6pm and 9 - 11pm, and Sunday 4 - 6pm.\n\nWe ordered:\nAhi Poke ($7.95) - Hawaiian style tuna over a bed of seaweed salad. This tasted amazing!\nGarlic Chicken ($2.95) - Deep fried chicken dipped in garlic soy sauce. This was so moist on the inside and delicious!\nPork Gyoza ($2.95) - potstickers with ponzu sauce. This was okay.\nSalmon Katsu ($4.25) - panko-crusted salmon with tonkatsu sauce. This was good.\nTeriyaki Beef ($4.25) - grilled beef marinated in teriyaki sauce. This was delicious!  Gotta have this with rice!\nCrunch Roll ($5.00) - shrimp tempura, avocado, cram/crunchies, eel sauce\nHawaiian Style Roll ($6.00) - spicy tuna, cucumber/albacore, poke sauce\nKilauea Roll ($7.00) - California roll/baked dynamite mix - this was awesome!\nThe Mexican Roll ($6.00) - shrimp tempura, spicy yellowtail, jalapeno, srichacha sauce\n\nFor dessert, we got the Banzai Special (5.95) - deep fried apple spring roll with vanilla ice cream, whipped cream with chocolate drizzle.\n\nThe fish was fresh, the food tasted awesome! We ate everything so fast. With tip, we paid about $17 per person, which isn't bad. We had all the food we needed to eat, so this was a better deal than the all you can eat price.  We'll definitely be back!"
        }, 
        {
            "index": 231, 
            "rating": 5, 
            "review": "Best sushi I've had in vegas, very fresh and delicious rolls. Wish so badly that I still lived there so I can have this again!"
        }, 
        {
            "index": 232, 
            "rating": 4, 
            "review": "Happy hour is where it's at at 808 Sushi. All prices slashed in half. My husband and I eat here at least once a week and the service and sushi has always been consistent. The AYCE menu is excellent as is the childrens menu. \n\nThe sushi is as good if not better than most other places in town. The Poke is good, not as good as getting it fresh back home but still good none the less. Try the Hawaiian style, Maui, 808 Special or Haleakala rolls, you can't go wrong. \n\nI saw the owners in the Sahara and Ft. Apache shopping center. They seem to be looking for a new place to lease. They weren't there for a movie or coldstone.  Maybe a new 808 Sushi going up soon in this shopping center? Guess we just have to wait and see."
        }, 
        {
            "index": 233, 
            "rating": 3, 
            "review": "Not horrible for a quick bite, but far from quality. Missing special touch or freshness"
        }, 
        {
            "index": 234, 
            "rating": 4, 
            "review": "I go here at least once every two wks!! I LOVE the 808 and Mexican roll!! Happy hour price is awesome and very reasonably priced! Has definitely become one of my favorite sushi places"
        }, 
        {
            "index": 235, 
            "rating": 4, 
            "review": "Rolls aren't that great, but the extensive appetizer list is really good.  They offer a lot of stuff on the AYCE appetizer list that other sushi places don't, like the cod, yellowtail collar, smelt fish, kalbi, etc.  If you want rolls, there are better places to go."
        }, 
        {
            "index": 236, 
            "rating": 3, 
            "review": "The hot item selection here is great.  Seared Salmon Carpaccio, Miso Black Cod, Hamachi Kama, Garlic CHicken, and many others.  \n\nThere's a 1 per limit on the Kalbi, Miso Black Cod, and Hamachi Kama, but order away on the other items.  We got like 4 orderso of the seared salmon.\n\nThe service at the bar is way too friendly for an asian place.  This place has a \"Cheers\" like atmosphere -- by the time i left I knew half of the staff's names and we were even talking to our neighboring sushi pals.\n\nMy only knock is the sushi is sliced really thin.  Probably the thinnest I've ever seen.  It maybe even be a 1/3 of what you get at other AYCE's.  If they could cut the sushi a little thicker........Until then, I will still be back for the service, great hot food selection, and decent to good sushi."
        }, 
        {
            "index": 237, 
            "rating": 5, 
            "review": "Been here a few times now and have been Soo impressed each time. The food, service, and atmosphere are excellent. And the half off special is definately worth the long drive from henderson! You must try the garlic chicken bc it is to die for!!! It looks dry and crispy on the outside but inside it is soo juicy! It's amazing! Much much  better than island sushi which has very similar food and taste. \n\nThis is definately a place to take family for dinner and the bill doesn't hurt your pocket at all!!"
        }, 
        {
            "index": 238, 
            "rating": 2, 
            "review": "I used to come here often because of the happy hour deals. On my last visit there (this was several months ago), we finished eating and we asked the cashier to split our bill which we had done dozens of times before. He told us that the owner said they aren't allowed to split bills anymore. Very inconvenient and they should probably say something about this on their menus or before we order. It seems obvious to me that when a group of four 18 year old friends come in, they're probably gonna need the bill split. \n\nAdditionally, the food is average. There are much better places to get sushi in Vegas. I've gotten sick before right after I ate here. Not sure if the two are related but I'm not going to go back and risk it."
        }, 
        {
            "index": 239, 
            "rating": 2, 
            "review": "Eh it's okay, not bad but probably won't go back, but was good to try a new place.  Did the all you can eat for about $26.  The sushi rolls were too small like mini size and nothing too special about them where after a while they all taste the same.\n\nThe CA roll with baked dynamite had a weird carrot cole slaw mix. The Lahaina was okay. I also got the curry and rice but didn't like it. I was expecting yellow curry.  It was a brown curry that was more like a beef stew. Again not horrible just not special in comparison to other nearby sushi spots in the southwest."
        }, 
        {
            "index": 240, 
            "rating": 1, 
            "review": "I tried this place because a co-worker recommended it. Everything started okay, good service really nice waitress and then we got our food and the fish was stale the only thing I really enjoyed was the salad with cucumber and the sauce was tasty. As soon as it started getting packed I think the waitresses panicked because each of them just ran to a cash register and did not moved from there. We waited like 20 min for somebody to come to our table because we wanted to order some poke which was like 3 table spoons of poke and the rest was SEAWEED SALAD!!!!! I did not order seaweed salad I order poke and I got so little! Not coming back there's some other great places to go to where for 87 dollars I can get great quality food."
        }, 
        {
            "index": 241, 
            "rating": 3, 
            "review": "Overall my experience here was okay! The service was great, the sushi was yummy, it just didn't wow me. I guess I expected a lot since my friends all said it's a must try, of course I had to try it. What can I say I LOVE Sushi! \n\nMy bf and I went here on a Friday night (7ish), it wasn't busy at all so I was glad since I hate waiting when I'm really really hungry. We did the AYCE for 24.95 per person. Did I mention I LOVE AYCE? Totally worth it if you want to order a lot. \n\nOrdered: \nTako poke (one word DELICIOUS) \nTako Sushi (my favorite) \nCandy Cane Roll (ehh okay) \n808 Special (total must try) \nAhi Poke (GOOD) \nYellowtail sushi \nBanzai Special for dessert \n\nSorry 808 Sushi, not my favorite place for sushi!"
        }, 
        {
            "index": 242, 
            "rating": 4, 
            "review": "One of my favorite shopping plaza, near hole-in-the-wall sushi spots. This place score big points on customer service first and foremost. But even further I love their AYCE menu. Not so much just for the sushi but for the items on the other side of the menu.  The poke is tender and delicious. The tuna and salmon collar is... is... sooooo good. If you've never had fish collar, you've been missing out. And unlike some other places that do AYCE, they don't try to fill you up with rice. I hate when you order a roll and the roll is so huge that you need a knife and fork to eat because there's a whole bag of uncle Ben's rice in the roll. 808 get's it with quality food and excellent customer service."
        }, 
        {
            "index": 243, 
            "rating": 3, 
            "review": "So if you know your area codes then you'll know that 808 is Hawaii. Now don't expect a \"irasshaimase\" when you come in because this is not a sushi spot that tries to pretend to be Japanese. Instead they're they give off a chilled islander feeling which is cool. \n\n808 Sushi are one of the few remaining sushi spots that still charge 24.95 for their dinner AYCE, sweet (I believe its 20.95 for lunch). I posted pictures of their AYCE menu and you'll notice they have a fairly decent hot menu item, some key items are the hamachi kama (yellowtail collar) and unlimited salmon collar. Most places limit you to only one salmon kama per person, but 808 lets you have all your can eat, but limit one for the yellowtail. The yellowtail kama smelled great, so I'm assuming some freshness from it, although the salmon kama did not give off such an impression.\n\nI feel that the hot menu items are a better choice than the sushi because the quality of the sushi items were nothing special. I know that its AYCE so you can't expect high quality fish and craftmenship, but.. its weird the rice and cuts of the fish are all different sizes. I noticed the chef was relatively young, maybe less than 30? So I'm sure over time the execution will improve. The rolls were decent, but didn't really have much to distinguish one from another, and most of the rolls contain eel sauce. The fish wasn't the most fresh, but didn't taste like they've been in the freezer for too long. My green tea ice cream was in the freezer for too long though because the smoothness of the ice cream was attacked by ice.\n\nThe service was nice and prompt, there was not too much wait time in between each set of order, drinks were refilled promptly, and request were done in a timely fashion. \n\nBy the way they have these cool fish paintings on the wall."
        }, 
        {
            "index": 244, 
            "rating": 5, 
            "review": "One of my favorite places to eat in Vegas. The sushi is made perfectly. BIG menu and BIG portions. You gotta try the mochiko chicken and the garlic chicken, you won't be disappointed. You will leave happy, satisfied and full."
        }, 
        {
            "index": 245, 
            "rating": 4, 
            "review": "All you can eat menu for just $26! If you are planning to buy two rolls, you might as well go all out and do the buffet. \n\nThey have many special rolls on their buffet menu and many appetizer items. My personal favorite is the Haleakala roll, baked to perfection. \n\nTheir green tea ice cream does not taste like green tea very much so I recommend sticking to the store bought mochi or the other apple sundae they have.\n\nI love that their theme is of the great 808 state!"
        }, 
        {
            "index": 246, 
            "rating": 4, 
            "review": "Funny, we went to 808 Sushi but had no sushi... actually, Poot had a few pieces of sashimi, so I guess that counts.  \n\nImagine stepping out of your car on a cold night and inhaling the delicious smell of Asian food.  In the same parking lot and actually the same corner there are Thai, Hawaiian, Japanese-Hawaiian, and Chinese restaurants. And it smells like... well damn, it smells like freakin' heaven.\n\nI got the combo plate (11.95) with Kalbi Beef.  It comes with rice, miso soup, salad and edamame.  Miso soup seemed like it was missing something and I longed for tha Hanaoka miso soup.  The edamame also seemed a little flat and over cooked.\n\nBut wait, there's more.  The kalbi was tender, smoky, and delicious.  It was a good portion size and there was enough for me to be \"busog\" and take some home with me (which I'll enjoy as I write and watch football tomorrow).  It tasted like party food.  If I closed my eyes I could imagine my family there being loud and kids running around.  Comfort food is definitely the key word when I think of this place.\n\nBF had a B combo plate (13.95?) of chicken teriyaki and sashimi.  Not a fan of sashimi so I passed on that.  But once again, the charbroiled teriyaki did not disappoint.  \n\nI can't wait to go to sleep and wake up so I can eat my leftovers."
        }, 
        {
            "index": 247, 
            "rating": 5, 
            "review": "Best sushi I have had since HI!  I love the happy hour at this place.  Def. best in town!!!"
        }, 
        {
            "index": 248, 
            "rating": 2, 
            "review": "In terms of sushi, it's ok. I got a groupon deal is the only reason why we tried it. The service was friendly, however it was also slow and chaotic. There were 3 different waitresses and all 3 came over to our table not knowing who took our order. We were not sure who was our waitress or who we should order with. The quality of the food was good but too slow. We received the last thing we ordered first and the first thing we ordered last. Looking at the menu was confusing some rolls just said \"tempura\" which (after tracking down one of the 3 waitresses) I found out meant \"shrimp tempura\". We ordered a couple shrimp tempura rolls, generally these come out warm however ours must have been sitting before it reached our table because it was stone cold. With all the sushi options on this town, this doesn't make the cut."
        }, 
        {
            "index": 249, 
            "rating": 4, 
            "review": "I've been here multiple times, always during happy hour, and I am always satisfied with the food that I eat and how much I pay for it! I believe happy hour is 50% off most of the cut rolls and drinks as well.\n\nService has never been too terrible for me. I always seem to come when it is busy and there were certain times where I was able to get the happy hour deal even though I was seated after the times due to a long wait. \n\nSome rolls I would recommend the Kilauea Roll and the Haleakala. They're my two favorite and both very delicious! The hawaiian-influenced sushi rolls are unique and, in my opinion, most definitely worth the happy hour prices."
        }, 
        {
            "index": 250, 
            "rating": 4, 
            "review": "my aunt and i were sitting around at home listening to our stomachs argue with each other while we were trying to figure out where to eat. we knew we wanted sushi but we didn't want to go to our usuals (kona grill, naked fish, momoyama). I remembered this place because one of my friends had suggested it. it's further from our house than the usuals but we were so hungry we decided to go.\n\nwhen we got there (around 8pm), we were seated immediately as the dinner rush was already dying down. we were waiting on my mom to arrive but they were quick to get our drink order and ask if we wanted any soup, salad or edemame. my aunt didn't waste time and immediately ordered HAMACHI SASHIMI (9 pieces for $12!! that's the cheapest i've ever seen for that amount).\n\nI had read a Yelp! review on the way to this restaurant and thought I'd try their famous 808 ROLL, but i saw they had HAMACHI KAMA (YELLOWTAIL COLLAR) which is one of my favorite Japanese dishes of all time and decided to try that first. As an appetizer for $6.75, I got BOTH collars.. aaaaaaamazing!! it was enough for my mom, aunt & i to share!! after we killed that, my mom decided to order some grilled white fish (i wish i could remember.. darn it!) and it was GOOOOOD! with that, i had no more room for the 808 roll (just dessert!)\n\nOff to one corner of the restaurant is a little refrigerated pastry case. I walked over to see what they offered and the owner must have seen how big my eyes got at the sight of these WHITE CHANTILLY CHIFFON CUPCAKES and just handed it to me for me and my family to try. *heavennnnn* they were DELICIOUS! afterwards, my mom & aunt walked over to the case to see for themselves and the owner handed us ANOTHER pastry to try. this time, the little container it was in had a question mark. i asked what it was about and he said that the girl who bakes these pastries still hadn't come up with a name for them. from that he explained that the customers are the ones that come up with the names. there's a box on the counter for you to drop a slip into with what you think the pastry should be named. if your name wins, you win TWO AYCE dinners!! oh, i've never grabbed a pen and paper faster. the \"question mark\" pastry was another slice of heaven.. i won't share what name i gave but i think it's a winner ;]\n\nthis place if 4 STARS just because i haven't had a chance to try too many things on the menu yet (so far so GREAT!) and because the \"hot\" tea was just lukewarm and he offered us more lukewarm water to make it hotter hahah!\n\nthis place is going to be dangerous for me.. it's on the 215 (my commute to school) so i can see myself calling in take out orders every so often ;D with one visit.. i can already say i will be a regular ;D\n\n& i'm looking forward to attending HAPPY HOUR!!"
        }, 
        {
            "index": 251, 
            "rating": 4, 
            "review": "My husband and kids brought me here last night for my Birthday. They all know that my favorite food is good sushi. I had the 808 Special Roll and the Black widow roll. Both were delicious. My husband had 2 orders of the Haleakala Roll since he loved the first one so much. We came during happy hr so we paid happy hr prices for our 8 yr old son and our daughter who is 4 was free to eat off of our all you can eat. We had 3 orders of poke since our daughter wanted one bowl to herself. We also ordered the edamame for her which keeps her busy and she loves it. Our son had 2 bowls of miso soup and a California roll. Oh also our daughter ate 2 servings of the shrimp tempura. She loves shrimp. All in all our experience was great. Our server was very sweet and came by frequently to check on us. Definitely a place we will be coming more often."
        }, 
        {
            "index": 252, 
            "rating": 5, 
            "review": "This is THE BEST sushi place on the southwest side of Vegas. They just opened about a month ago and I am hooked. I used to frequent Sumo Sushi II but they don't offer AYCE. The owner/manager of 808 is very friendly and gave us the happy hour special even though we were 30 minutes early for the 9pm happy hour. \n\nThe prices are very reasonable, the hot house sake is very cheap and tasty, and the fish is very fresh. Give it a try - you won't regret it."
        }, 
        {
            "index": 253, 
            "rating": 5, 
            "review": "The sushi is very good here but the selection of rolls is small for the All You Can Eat.  The thing I like about their All You Can Eat is the selection of hot items.  For example, I was able to get seared ahi tuna, curry with rice, and garlic chicken.  That kind of sets a niche-y feel of the place.  The owners of the joint are very friendly and the staff is very accomodating.  I've always felt very welcome in their restaurant.  I think their 808 specialty roll is definitely something to go for and I like how they properly serve the heads with the amaebi sushi.  I'm a frequent customer and will continue to be."
        }, 
        {
            "index": 254, 
            "rating": 1, 
            "review": "I have been to 808 a couple of times before. I thought they had ok sushi. I went last Thursday and my boyfriend and I got food poisoning! Forget this place, do not go! I have been non-stop throwing up for 2 days. I had the garlic chicken, crunch roll, Cali roll, and tempora roll. Do not go there unless u want to get sick!!!"
        }, 
        {
            "index": 255, 
            "rating": 5, 
            "review": "This is my current favorite sushi spot. I discovered this place with my brother who loves sushi too, we decided to try it out based on the fact that they have a happy hour special. Dude this place is ridiculously cheap and their quality is superb. I've saved so much money eating here and I always walk out satisfied with my meal. I must have shown over 10 ppl this place and they like it as well. Try the garlic chicken as an appetizer it's so delicious. I drive all the way from Henderson just to eat here because I know I can do no wrong eating here. Service can be a little more hospitable but what I like is how fast the rolls get out to you, other sushi spots take forever to get the food done. Two thumbs waaaaaaay up!"
        }, 
        {
            "index": 256, 
            "rating": 4, 
            "review": "Worth the 20$ lunch AYCE. They have a lot of options, which makes the price stellar. The special rolls are delicious and satisfying. The appetizers that come with AYCE are proportioned just right. I could still enjoy the two rolls that I ordered, which is saying a lot. The tempura batter is slightly sweet, but still good. And their green tea ice cream is probably better than any other place I've had it. Not too sweet, and much lighter on the matcha flavor. The service is attentive and we didn't wait 163726272 years for one roll. (That's a huge pet peeve for me) I'm definitely coming back for lunch again."
        }, 
        {
            "index": 257, 
            "rating": 1, 
            "review": "My family and I have been going to this place for years. Tonight will be our LAST. We came for my son's birthday dinner, and we had 6 people with us, all separate checks. This place had the audacity to charge us 18% gratuity on all 3 checks. Mind you, we all ate the all you can eat. We tried to bring it to the cashiers attention and all they kept saying was 18% gratuity for 6 or more people. That was not ALOHA! That's taking advantage of your customers. It's a shame this place is called 808 Sushi. NO ALOHA! ALL GREED!"
        }, 
        {
            "index": 258, 
            "rating": 3, 
            "review": "Decent sushi, happy hour specials are good, wait staff is very attentive. Had spicy tuna, spicy salmon, and tempura roll. Not a bad spot for lunch, will be back."
        }, 
        {
            "index": 259, 
            "rating": 4, 
            "review": "Sushi is good but It  be better. The staff is super nice and the happy hour is awesome. Good place for day drinking And some fresh nigiri!"
        }, 
        {
            "index": 260, 
            "rating": 2, 
            "review": "Had the all you can eat buffet back in August . 2013 . Things were not fresh and it is more of like local Hawaiian sushi. I'm from hawaii btw. I guess I expected a lot more for the price and they only had one hamachi Kama left . We had a group of 20 mind u. For the price and quality I would not come back and other places such as goyeman , u Would get a lot more and more authentic Japanese sushi style."
        }, 
        {
            "index": 261, 
            "rating": 1, 
            "review": "Review on their menu food items only...\n\nI am not reviewing their AYCE sushi's because I've never had it there. \n\nHere's what we ordered:\n\nCrunch roll\nKake Udon\nKatsu Curry Don\n\nI was craving some cooked sushi rolls and we wanted to go some place close to home. The crunch roll was just your typical cooked roll with shrimp tempura, nothing spectacular about it.\nI also shared the kake udon with my son, since he only eats noodles. This had to be one of the worst udon noodles/broth I've ever tasted. I think the udon packets you buy from a grocery store taste much better than what we had.\nMy husband had the katsu curry don, he said it was \"meh\". I guess my homemade katsu curry don is much better. The portions of this dish was pretty big. \n\nOverall, we had a wonderful service from them (I give them 4 1/2 to 5 stars for their service and attentiveness but their food is only worth 1 star). I don't think we plan on coming here again."
        }, 
        {
            "index": 262, 
            "rating": 3, 
            "review": "There was hair in our chicken! EWWW well not really. That kinda stuff doesnt bother me. I told the waitress that there was hair and she said OH LOL Was expecting that there were going to replace it or not charge us for it, but they did.\n\nI dont think their sushi is as fresh as other places I've been to. I usually do happy hour and the deals are great. So if you are looking for a deal this is the place to go to. , but keep in mind that you get what you pay for."
        }, 
        {
            "index": 263, 
            "rating": 4, 
            "review": "My favorite place to get AYCE sushi.\n\nIt's inside an old Italian restaurant that, when it was an Italian restaurant, looked really nice. 808 Sushi is not going to win any ambiance awards any time soon. Not the best looking place, but where it lacks in decor, it more than makes up for in rolls. \n\nThis place has a VERY generous AYCE menu (and frequent AYCE cards so you can earn free ones). The rolls are always tasty, quick, fresh, and wrapped tight. It's hard finding a TERRIBLE sushi place in Vegas (but they exist, I'm talking to you Nagoya on Ft Apache) but if you live in the southwest this is the one of the only places I'd go."
        }, 
        {
            "index": 264, 
            "rating": 5, 
            "review": "it's 8pm Sunday of Thanksgiving weekend and there's major traffic back to LA. I wanted to take out the bday boy (Kurt F.) and the 4 bedroom party house provider (Dan Y). Might as well eat before we go...sushi craving, iPhone, yelp, filter for open now = 808 Sushi, 4 stars, sure why not?\n\nThis place was pretty easy to find, in a little strip mall in the southwest part of Las Vegas, far from the strip. Wasn't too busy and the 3 of us were able to get a table for 6, and trust me, we needed it. Sat around wondering if we should do the AYCE for $24.95, it's hard to get full on sushi for less than $50/person so the choice was easy. You can order a la carte but you'll end up spending way more (i'll get to that).\n\nOur waitress Val was the sweet, innocent type that still has her Hawaiian accent. She was very attentive as were the rest of the servers with refills as well as additional orders. Tip: the * on the menu means you can only one per person, so it stands to reason these are the more expensive items. Didn't realize that til the end and by then we missed out ordering a few things.\n\nOrdering is simple, the front page has mini portions of appetizers/entrees and the 2nd page has rolls, nigiri, and dessert\n\nHere's what we had:\n\n(#) is the number of orders\n\nI took photos of almost everything we ordered, I'll do my best to upload them\n\nAhi Poke-excellent, not much other than a little sauce/ponzu/sesame seeds\n\n(2) Agedashi Tofu-pretty standard\n\nCold Tofu-it's just tofu, good palate cleanser\n\nEdamame-standard\n\n(4) Garlic Chicken-this was good but I didn't like the sweet sauce it was cooked in and also drizzled, I ordered one with sauce on the side but it wasn't the same, Kurt F loved the sauce and drenched his chicken in it, to each his own...\n\nMiso Black Cod-this was excellent, wasn't planning on ordering it but we did during last call and I was sad when it was so good and I couldn't get more. Had a very buttery flavor but the chef said that taste was from the miso glaze and sake\n\n(2) Pork Gyoza-standard\n\nSeared Poke-not a fan, I like seared tuna but for some reason the raw poke was better\n\nRolls: I think rolls in general have too many dif flavors so I shy away from them\n\nPhiladelphia-standard\n\nPhiladelphia Deep Fried-standard\n\nSalmon Skin-mediocre/standard\n\nSpider-didn't try but heard it was good, a little heavy on the rice but it's AYCE, just order another!\n\nAlii-I was intrigued by the wasabi lime mayo but it overpowered the sushi, which might have been the point seeing as how it was deep fried white fish (mediocre\n\nHaleakala-Kurt F liked the scallops, he stabbed my hand as I was trying to take a picture\n\nHawaiian Style-this one was really good, would definitely order this again\n\nNigiri: in addition to the appetizers, this is mainly what i ate\n\n(4) Albacore-excellent\n(4) Garlic Tuna-excellent\n(2) Hamachi (Yellowtail)-wasn't fresh enough for my tastes\n(4) Hirame (Halibut)-has always been one of my faves, didn't disappoint\n\nDessert: (you can only order one per person)\n\nBanzai Special-excellent, best of all the dif choices\nScoop of Green Tea Ice Cream-Dan Y thought it was too cold. but hey, it's ice cream!\nScoop of Vanilla Ice Cream\n\nKurt F. is Jewish and i'm Chinese so on our way home we calculated how much we would have spent. The bill including tax/tip was $103, if we had ordered a la carte, $287. We win! It would have been more but Dan Y didn't hold up his end of the bargain to stuff himself. \n\nI'm fairly certain that Val was tired of running back and forth getting us all this food but she was awesome. Good experience, next time we're staying off strip I'll be going here for AYCE and this time, I'll order the Miso Black Cod first!"
        }, 
        {
            "index": 265, 
            "rating": 5, 
            "review": "Bomb! Thank you Troy for excellent service! Nothing more real than Aloha Spirit!"
        }, 
        {
            "index": 266, 
            "rating": 3, 
            "review": "I would definitely come back here in order to fill my sushi crave and hunger since it is real close by the boyfriends house in the Vegas Southwest.  Mind you, I have been a huge Sushi Mon fanatic since I discovered all you can eat sushi, so if you are going to open up an all you can eat joint, you gotta know your competition. \n\nThis place actually bodes well for competition.   I give this place 3 stars.  \n\n(1) For the price.  Good deal for all you can eat sushi for dinner.  Complete w/ sides, nigiri, and rolls.  \n(2) For the friendly service. The waiters were nice, and the first round of orders came out pretty fast.  My boyfriend and I can scarf down the first order in less than a minute though, and the second round came 15 minutes later, which is way too long to wait.\n(3) Variety.\n\nIt lacks the 4th star, because there should be a little bit more on the area of variety even though I did give it one star for this.  There are no baked rolls, or special sauces, or \"to die for\" type specialty rolls.  Everything tasted OK, but nothing came out at me to order a repeat time.  I'm from the Bay, and specialty rolls are all over the place here, and their super flavorful.   I think this place needs to add some spice to their flavorness.  It lacks the 5th star because the hamachi freshness was not as fresh as I'd want it to be.  I eat lots of raw sushi, and mercury comes a long with it, so it is VERY important to ensure you store your raw fish correctly and keep it fresh for customer's health reasons.  \n\nOh and one more thing, I would love to see a seaweed salad, or side salad available on the \"sides\" menu for the all you can eat folks.  More sides is just always great.\n\nI know this place just opened, and I will come back for a revisit! Thumbs up so far.  I will revisit my review once this place gets crackin!"
        }, 
        {
            "index": 267, 
            "rating": 1, 
            "review": "I was introduced to 808 Sushi by using a Groupon and i have to say they should probably not participate in that program any longer. They treated us like we were 3rd class citizens, service was bad, I had to ask for my food twice and it took over an hour. They wouldn't allow me to enjoy happy hour drink specials because i was using a Groupon. I explained i didn't want to use the Groupon for drinks and that i would pay separately!  I asked if you had to order food to receive happy hour pricing on drinks, she said no and still refused. Food was average. I will never go back."
        }, 
        {
            "index": 268, 
            "rating": 5, 
            "review": "Super white tuna and Cajun albacore is my fave! So fresh and super tasty! Garlic chicken appetizer is a must!"
        }, 
        {
            "index": 269, 
            "rating": 4, 
            "review": "Come hungry and get the all you can eat for $25. It's so worth it. You usually pay up to $10 or so per roll but here, the rolls are smaller than the average roll but it's better because you get to try a variety and it's all you can eat so if you want more, just ask. They have so much to choose from. Poke, rolls, nigiri, hamachi collar and much more. My personal favorites were the miso black cod and tako karaage. The staff was friendly and turns out a couple of the waitresses went to school with my friend in Hawaii . Small world! This place is a must next I come to visit LV."
        }, 
        {
            "index": 270, 
            "rating": 3, 
            "review": "We love coming here for AYCE. I wish they had more options on the AYCE menu though. You get more for the same price else where, but we still come because we like the food haha.\n\n2 points not granted because the service sometimes (always) suck!"
        }, 
        {
            "index": 271, 
            "rating": 4, 
            "review": "I am a regular costumer ordering the usual 808 special, garlic chicken and ahi poke. But today I tried the seared poke and it was so oooooohhhhh sooooo gooood! I will always order that from now on."
        }, 
        {
            "index": 272, 
            "rating": 1, 
            "review": "I have been coming here since this place opened. And sadly the service goes more and more downhill. I was here last week with my mother and grandmother for lunch and our waitress was awful. I don't know her name but she has jacked up teeth (no offense) so you can tell which one she is. I had to repeatedly ask for refills for my tea and waters and each time I got an eye roll. The last time I asked she literally went over and talked about our table with a coworker as they were staring  right at us giving dirty looks. The food is mediocre for the prices since Sumo sushi is right around the corner. \nAwful customer service and waste of money. I'm not one to not leave a tip, but I would rather burn my money than satisfy my servers with a tip. Also, I sent an email to the owner but have received no response. \nSad, but hopefully this place will go out of business soon so a new and better restaurant can be placed here."
        }, 
        {
            "index": 273, 
            "rating": 3, 
            "review": "The food is pretty good but I felt that the service was a little too rushed. I felt that they tried to clear my plates a little too quickly, even when I was still eating from it. We tried some tasty rolls and loved with their garlic chicken. I\"d be back for that alone."
        }, 
        {
            "index": 274, 
            "rating": 5, 
            "review": "I really feel like this is one of the best places for sushi in the SW. I don't come here for the their fresh fish/sashimi, but more for their classic and speciality rolls. I have been coming here for years and this place never disappoints me. The great thing is that they have happy hour every single day and these islander employees are just always nice, never rude.\n\nTheir garlic chicken is amazing, as is their poke dish. Their rolls are just super tasty. I've tried places like sumo sushi down the way and ew! 808 has seriously set the bar for me for tasty rolls. I love this place. Take your partner here or your whole entire family. This place is great, affordable, TASTY"
        }, 
        {
            "index": 275, 
            "rating": 3, 
            "review": "Small inside and hard to get a seat sometimes, but good sushi. Try the Candy Cane."
        }, 
        {
            "index": 276, 
            "rating": 4, 
            "review": "I have been coming here for 4 years now. I always get my quick sushi fix here. You cannot beat their happy hour. Waiters for the most part are really friendly, there's one waitress that rushes me a little when they get busy, but all the other awesome ladies balance it out so it's ok."
        }, 
        {
            "index": 277, 
            "rating": 3, 
            "review": "Poor service,not friendly staff ,not gred when u walk in,the second time I went there was no sushi master or guy he was fixing something on the back, no body offer me a glass of water, incredible the manager was there n the place was complit empty n nobody serve me and I left, that was bad,never ever went back."
        }, 
        {
            "index": 278, 
            "rating": 2, 
            "review": "My husband liked it. I didn't. Everything was was blah. And they wouldn't alter any rolls which I think is weird considering it is all you can eat. Not good if you have dietary restrictions"
        }, 
        {
            "index": 279, 
            "rating": 4, 
            "review": "My new favorite all you can eat joint in vegas for $25. We ordered the Hamachi Kama, Spicy Tuna, Spider Roll, Spicy Pele, and Ebi nigiri. And for dessert we had the Banzai special and green tea ice cream. Would have liked to try more but had no room for it."
        }, 
        {
            "index": 280, 
            "rating": 5, 
            "review": "Great deals, amazing food, love the place! Cant get better than their happy hour but if not the AYCE is just as amazing!"
        }, 
        {
            "index": 281, 
            "rating": 4, 
            "review": "I love this place! Excellent service, excellent food, and nice, casual but very clean interior. It was maybe a little bright in there, but since this is '808' Sushi, I'll tolerate the Hawaiian dose of sunshine through the large glass windows. \n\nThere's a really good energy in here, with lots of families and friends and happy people who seem to really love sushi. The servers reflect that as well - they're very friendly and highly interactive, and it's awesome when a wait staff allows their personalities to shine through. \n\nHappy Hour is fantastic! I'd really rather not gorge myself on all you can eat sushi if I can avoid it, so 808 Sushi's affordable, delicious food during Happy Hour really makes me... Happy.\n\nI preferred the rolls over the nigiri. Really good unagi-based and tempura-based modern-style rolls, they're flavorful and have great texture without being overdone. \n\nThis all makes 808 feel more like a cozy, neighborhood sushi shop to visit with familiar friends for lunch, without having to deal with the long lines, large menus, and all-you-can-eat pressure and rush of more mainstream restaurants. \n\n(For some reason we caught the happy hour from 11AM-3PM on a weekday, which doesn't seem to be listed anywhere on their website or menus, but is common knowledge among the regulars. I'm not sure about the details, since this was \"my friend's sushi place, not mine\", if you know what I mean. \n\n...but I think I'll be adding 808 to my personal rotation now, haha!)"
        }, 
        {
            "index": 282, 
            "rating": 4, 
            "review": "The food here is great.  Be sure to do All-You-Can-Eat so that you can enjoy the broad spectrum off all the deliciousness they offer."
        }, 
        {
            "index": 283, 
            "rating": 1, 
            "review": "Worst sushi I have ever had. Don't waste your time and go to yummy grill and sushi in summerlin ranging from $7-$13 on their specialty rolls... Or sasa sushi for ayce ($21 at lunch $25 at dinner). This quality fish is so bad and they only have a few rolls. I am a big sushi lover and was seriously disappointed in this place after trying nearly every roll... The only good one was the crunch roll.... Which they make at yummy sushi and tastes so much better. I think the waiters/chefs don't know the menu items... I ordered the Mexican roll and it came out with spicy mayo on top which wasn't on the menu and ruined the whole roll. I also ordered another roll which I forgot the name maybe volcano I don't know but the roll sounded good and had in the detail of the roll dynamite mix and I asked the waiter what that meant and she said spicy. I got the order and a bunch of mushrooms and other weird stuff was the \"dynamite mix\" as soon as I saw the mushrooms I had her take it back. They need to specify what's in the roll. Also the rolls they give you literally have more rice then anything and when you look inside the roll you can tell the quality is bad... TAKE THE DRIVE TO SUMMERLIN. I promise it is so much better."
        }, 
        {
            "index": 284, 
            "rating": 5, 
            "review": "I met the owner of this place bout 3yrs ago through a mutual friend he ask if I like sushi & I was like heck yeah,where is your spot @? \n\nLet me tell you the sushi is always fresh & the service is on point..the garlic chicken is straight bomb even the desserts are off the hook!!! \n\nAYCE sushi for a good price..JUST GO GET YOU'RE GRUB ON!!"
        }, 
        {
            "index": 285, 
            "rating": 4, 
            "review": "I definitely drop by 808 Sushi from time to time. They've got a good selection of both sushi as well as entrees/appetizers. \n\nRegarding AYCE: The AYCE option is only around $21 at lunch, which is a great deal. Their menu includes both rolls/nigiri as well as things like their mochiko chicken, poke, gyoza, etc., so even if you're not in the mood for sushi and would basically like to eat ALL THE APPETIZERS/hot items you've got yourself an excellent deal. \n\nLunch Specials: They've started offering lunch specials for awhile now, and their most expensive offering is $8.50, which includes a mound of rice w/ furikake, a full portion of mochiko or garlic chicken, 8pc spicy tuna roll, 3 nigiri (salmon, yellowtail, tuna), and salted warm edamame. The rest of the lunch bentos are cheaper and have a ton of stuff too. \n\nIn short, great portion sizes, good prices, and consistently good food. They don't put a ton of rice on their sushi as well which I appreciate. It doesn't blow my mind but I don't hesitate to come here for AYCE or take out. They are also the only place I know of that offers *reasonable* donburi like katsudon and oyakodon. (I know a place that serves katsudon in a box that barely fits 1.5 cups of food... for $8-9...)\n\nOne minor criticism from my point of view is that their spicy tuna filling is more like the texture of spicy poke. Instead of finely chopping/mincing the tuna and mixing it with the spicy sauce it is large chunks of tuna coated in the sauce. This makes the spicy tuna less spicy which makes me sad. Prepared this way it isn't much different from putting a bunch of wasabi on my tuna. Then again, I am the type of person who grew up eating spicy food and there are people on this planet that find bell peppers spicy... /shrug"
        }, 
        {
            "index": 286, 
            "rating": 4, 
            "review": "We recently started going here when they offered take out happy hour prices. Their sushi is fresh and delicious and hostesses are really friendly. I recommend it to anyone who likes sushi and doesn't have a big bank to spend on it."
        }, 
        {
            "index": 287, 
            "rating": 1, 
            "review": "The food was ok but it was not worth the two days I had to call out of work because of how sick I got from it. Eat at your own risk."
        }, 
        {
            "index": 288, 
            "rating": 5, 
            "review": "Amazing sushi. Definitely a nice clean and quiet sushi spot. I am a loyal customer and won't go anywhere else in SW!! Check their happy hour schedule for 50% off sushi and drinks!!"
        }, 
        {
            "index": 289, 
            "rating": 5, 
            "review": "We love the all-you-can-eat menu at 808 Sushi. They offer every kind of sushi you want, as well as terrific izakaya-small plates of Japanese & Hawaiian dishes... all for $27. Even dessert is included! We loved the age-dashi tofu, the ahi poke, the miso butterfish, the hamachi kama, the salmon kama, blackened ahi, shrimp tempura, chicken karate, the list goes on and on! And any fancy or simple sushi your heart desires will be served. Those who don't want to eat-all-you-want can order ala carte from the vast menu. This owner used to own Island Sushi, so come to the real deal!"
        }, 
        {
            "index": 290, 
            "rating": 4, 
            "review": "We love their happy hour daily from 4-6 when we want to take our young kids out with us for sushi. They are very reasonably priced and the staff is friendly and attentive. It is a relaxed atmosphere so kids are welcome. The sushi is Hawaiian sushi and average in flavor. They also have an all-you-can eat option. Average food, cheap drinks, great place to bring the kids."
        }, 
        {
            "index": 291, 
            "rating": 5, 
            "review": "The wait wasn't long at all. Amazing food and great service! I'd recommend this restaurant to anyone :) #goodeats"
        }, 
        {
            "index": 292, 
            "rating": 2, 
            "review": "Well... where to start... \n\nMiso black cod.. as recommended per a previous reviewer, had no flavor at all... it was very bland.\n\nThe 808 Roll was good, however it was nothing special.. the sauces they used on it didn't have any flavor. \n\nI was expecting a lot more out of this place... they limit you on a lot of things (1 per person) and those (1 per person) portions are so miniscule it makes you wish there was more then the measly ounce that you get... \n\nThe Ahi Poke was served in literally what looked like a Sake shot cup. it had a strange flavor to it and looked greyish pink, not sure how fresh it was but I only had a bite and I was done with it.\n\nThe soft shell crab they use in the spider roll was definitely cold and cooked a long time before they served it. \n\nI was hoping for more, I really was. from all the positive reviews of this place it seems that they were either having an off day or stopped caring so much about how they prepared their products. \n\nThe most disturbing part was listening to the two NSP Troopers talk about putting bullets in people's heads. not sure what was going on during that conversation however that part was duly noted loudly however I would expect someone dressed professionally in a uniform to act a certain way if they chose to take their lunch break at a sit down restaurant. I'm not removing stars for that but I'm making a notation of it because that's simply how I feel. \n\nI subtracted a star for the very small portions and limit as such,\n\nsubtracted a star for really no flavor in anything I had.\n\nSubtracted another star because I thought that they were really being lazy that day and didn't seem to care what they were putting out.\n\n1 star for the service my cup was never empty.\n1 star for how clean the restaurant looked.\n\nvery disappointing. however I may return in the future to see if things are different, if that's the case I'll write a new review, if not. then this will remain as my only saving grace to this place."
        }, 
        {
            "index": 293, 
            "rating": 5, 
            "review": "Absolutely Awesome!  Love the All you can eat!  Sushi is fresh and bountiful as are the appetizers.  Staff is friendly and eager to please.\n\nMy personal favorite is the Garlic Chicken and my wife LOVES the Ahi Poke."
        }, 
        {
            "index": 294, 
            "rating": 5, 
            "review": "This place is great. I've been a regular customer here for a couple years now and don't plan on changing that. The service here is always great. The staff is very friendly as well as the owner. They've greatly extended their happy hour and the happy hour prices are too good to pass up. They have a good selection of rolls and appetizers on the menu. And $1 hot sake! Needless to day sake bombs are always a must for me when I'm in. I'm always satisfied with everything when I leave here and recommend it to anyone thinking of trying it."
        }, 
        {
            "index": 295, 
            "rating": 5, 
            "review": "Place is Great, the staff is down to earth & friendly. Thee BEST sushi....prices great too. This is my go-to place. Definitively a must try."
        }, 
        {
            "index": 296, 
            "rating": 5, 
            "review": "I have lived in Sin City for 14yrs .. TRIED ALL SUSHI PLACE ... this ONE is the G SPOT .. eversince we been here 4yrs ago and we DO NOT want to try any other Sushi place anymore .. try SALMON KATSU and the Octupos ! ahi poke is the best ALL THE SUSHI are good ! Love this place I HIGHLY RECOMMEND it - just make sure you know what your ordering ..."
        }, 
        {
            "index": 297, 
            "rating": 4, 
            "review": "Sushi is good. Prices are decent. Service is a bit slow, super slow if you order take out. Expect to wait about 40 minutes for your take-out order. Happy hour is a great deal."
        }, 
        {
            "index": 298, 
            "rating": 2, 
            "review": "This place has GREAT sushi but TERRIBLE customer service. I actually come here all the time. But only because I love sushi and it is very close to my home. There is one particular asian girl who works here whom is about 5'7\" always has her hair up and absolutely has the worst customer service skills I have ever experienced. I come in there ALL the time yet she NEVER makes eye contact, always sounds like she hates her life and her job and she NEVER remembers me or calls me by name or even remembers what I order. She literally acts as if she has never seen me and it's the first time, every time I go in. It bothered me so much that the last time I went in to order my \"usual\", that when she asked my name, I slightly laughed, looked her dead in her eyes and said, \"I ALWAYS come in here and you never remember my name or act like u even recognize me.\" And I shook my head annoyed as hell, paid, left zero tip and walked out. Her response? A nervous laugh and \"We get so many people\". -_-\n\nI also was annoyed when I came in to pick up an order another time and two of the employees were talking about two adults with 2 kids who were currently dining. The couple and children looked like they were not well put together or maybe were poor and the employees started discussing them (right in front of me), making jokes about them being cheap and not tiping and much more. News flash! TIPING is an EARNED effort! It is not an obligation. Quit acting like entitled employees and earn your tips! (This is coming from someone in the tip industry). Not only that but how rude of them to talk about patrons in front of other customers. I seriously worry that they would do something to your food if you don't tip based on their immature and under developed work ethic. Great food. Very bad service. EDIT: These employees have either been fired or quit because I no longer see them. Also, their customer service has improved so I changed my rating from a 2 star to a 4."
        }, 
        {
            "index": 299, 
            "rating": 5, 
            "review": "LOVE LOVE LOVE this place!! The Poke, 808 Special and Salmon Katsu are my absolute faves. The sushi here always taste so fresh and the consistency between chefs never disappoints. They have an awesome happy hour from 4pm-6pm daily plus the afternoon all you can eat is priced great at $21.96 with lots of delicious items to choose from. \n\nNot to mention, the owner is really nice too, and the island jams that play in the background makes the experience that much better. All in all one of my fave spots in town and the only place I go to for ono kine sushi."
        }, 
        {
            "index": 300, 
            "rating": 4, 
            "review": "Decided to try this place based on another website & the fact that it was close to my work & I would definitely go back here again. We arrived around 12pm. There was only 1-2 other tables in the place but I think the fact that it's so new (open for 1 month) that no one yet knows about them. They do have an AYCE menu but since we were on a time constraint we opted to just get a couple of items of the menu. I do want to try their AYCE. Unfortunately they don't do 1/2 orders of AYCE like some places but I guess I will just have to take a few hungry friends so we can try many things & really get a feel for the menu. \n\nMy guest ordered the Haleakala Roll which is a California Roll, Spicy Scallop, baked with eel sauce. He stated that it was very good. \n\nI ordered Unagi (which I was leery to do since I've had bad  experiences in the past at other locations but opted to go for it.) It was quite delicious. Cooled very well. Soft & not hard & rubbery. I also ordered the Spider Roll which is one of my favorite rolls. I figure that if a sushi place can make a good spider roll that I like then they are worth going to. Um - bad mistake. It was over cooked so it tasted burnt & flavored the whole roll wrong. I informed them of this right away (we were seated @ the bar) & they immediately made me a new one which was much better. I told them how the bad one tasted & they said that they purposely over cook it since people want their food over done. I don't think that's the real case - I think someone just got carried away @ the fryer. But due to the fact that they took immediate care of it & were concerned about our satisfaction - I would definitely go back again. I also ordered a Rainbow Roll as my dining mate wasn't that fond (or familiar) of nigiri based on a previous experience. I think we've all had that bad experience that causes us not to want to try something again. So I opted for the Rainbow Roll since it wasn't straight up Nigiri. He decided after the 5th & final piece that \"bait\" wasn't all that bad. I think (hope) that he will try it in the future.  \n\nAmbiance was nice for a lunch crowd. A little chilly but I was sitting directly under the AC vent. The owner Dean (and rest of staff) was super nice, chatty & helpful. Dean even gave me a 20% off card for my next meal there. I inquired about lunch & happy hour specials & he said that they would be implemented soon. They will have happy hour every day of the week with 50% off some of their rolls, $1 sake, beer specials, etc. I will defiantly be going back for lunch (even with my so-so spider roll experience) as well as well as maybe even stopping off for a happy hour sometime & they didn't even have to throw in the complimentary Banzai Special.  \n\nMenu: \nhttp://808sushimenu.info/Menu_Page_1.html \nhttp://808sushimenu.info/Menu_Page_2.html"
        }, 
        {
            "index": 301, 
            "rating": 2, 
            "review": "It is with some regret that I write this review.  This is my 5th visit to 808 Sushi.  In my previous trips, I had good experiences.  If this was my first time here, it would be my last.  \n\nFirst, they were out of hamachi kama, which was forgivable, but still disappointing.  For the first half of this visit, the sushi chef seemed to ignore us.  After that he was more attentive.  Unfortunately, his skills, if you call them that, were not up to par.  The rolls were cut inconsistently with some pieces so small they would fall apart.  Other pieces were so large, they could not be eaten in one bite.  I ordered one baked roll.  He forgot it in the oven.  Mistakes happen, just don't serve your mistakes to me.  It was burnt to the point of being not edible.  Even the server commented on it being burnt.  One of the guys was pushing oyster shooters because they made too many.  Fine, I decided to have a couple.  Not too bad, except for the piece of styrofoam I got with it.  \n\nThis visit wasn't a total flop.  The miso black cod is great.  The bonsai special is always a good was to end the meal.  \n\nI will return only because everyone is entitled to a bad day and I have had good meals here in the past."
        }, 
        {
            "index": 302, 
            "rating": 4, 
            "review": "Have gone here more than a few times.  The sushi selection is good and on the most part I've never had a problem with freshness.  I've gone with smaller groups (3-4 people) most times and we've fared much better with service.  One time we did end up having a company function with at least 12 people and setting up tables, bill splitting and service became an issue even after calling in and letting them know a large group was coming.  That's really been my only negative experience.  Like I said though the other handful of times we've had no problems.  Oh and they got the best desert of an AYCE sushi place too lol.  This place is momona-boy approved :)"
        }, 
        {
            "index": 303, 
            "rating": 5, 
            "review": "All of the sushi rolls are delish!  The wait staff is excellent, and all of them share tables and tips!  Pretty cool. You cannot beat the happy hour, we had three rolls, two hot sakes and two large Sapporo beers...all for around $25!!  Can't beat it!!"
        }, 
        {
            "index": 304, 
            "rating": 5, 
            "review": "Service was so friendly and informative especially since my nephew is allergic to peanuts and eggs! Waitress told us what he can/cannot eat in addition to an added bonus...since he was 5 years old, he could eat for free!!! We got AYCE which I am so glad the last 4 places we drove to were busy because this place was bomb! It wasn't busy and rolls/sushi came out as ordered (with the exception of 2). The waitress didn't really come too often to refill out drinks but she did as soon as we called to her, no biggie. I would definitely go again top rolls for us was spicy pele and 808 special roll"
        }, 
        {
            "index": 305, 
            "rating": 5, 
            "review": "I have been here twice for AYCE dinner. Both times were a great experience. The first time I came with a large group and the second was just the BF and I. The service was excellent both times and the quality of food was spot on. This is my new go to spot for AYCE. \n\nThe menu for AYCE is huge. A lot more choices than most AYCE Sushi restaurants. It was $26.95 per person. I didn't get any pictures because we ate the food so fast. They have a couple items that you can only order once (Miso Black Cod). But it doesn't matter because the menu is huge. Oh and that Miso Cod is so good, literally melts in the mouth.\n\nWe are totally those people that pig out on AYCE sushi. Here is what we ordered:\n\nPhiladelphia Roll (2), Candy Cane. 007, Hawaiian Style, Triple Crown, Rainbow Roll, Miso Cod (2), Nigiri-- Albacore (2), Hamachi (2), Tuna (2), Amaebi (2). I know pigs!!\n\nThey also have really good prices on alcohol. We ordered to Kirin Lights for $4.00 each. Most places are $7.00.\n\nThey have Happy Hour everyday (I think) and pretty much everything is half off including Sake. This is a great deal if you are not going to totally pork out like us. The restaurant is actually a good size and they get the food out fast.  If you are looking for a great AYCE I would def. give this place a try."
        }, 
        {
            "index": 306, 
            "rating": 1, 
            "review": "Yea, you are all liars. Terrible sushi, terrible quality of fish. The only thing that is decent is the cheap sake prices."
        }, 
        {
            "index": 307, 
            "rating": 3, 
            "review": "Sorry to say this place has gone down hill I don't know if there are new owners or what the heck happened but the portions are getting smaller and the quality has gotten worse. The last time we came here the fish tasted bad.  The only upside is we always have gotten great service. Bring back the original servers and owner the sushi was so much better then. :(  sorry to say we will be looking for another ayce sushi place unless the quality gets back to par"
        }, 
        {
            "index": 308, 
            "rating": 5, 
            "review": "Best sushi bar in the SW! My husband and I love the AYCE special! \nWe highly recommend coming during off hours as this place can get busy. Everything is always fresh! We have been to 808 so many times and have always been treated well! \n\nHighly recommend:\n\n808 Special - We always start and end with one of these tasty rolls!\nBanzai Special - Get it with Green Tea ice cream instead of vanilla! YUM!\nGarlic Chicken - Delish!\nCucumber Salad - Love the crab on top!"
        }, 
        {
            "index": 309, 
            "rating": 3, 
            "review": "They have an awesome happy hour and one of the best things I've ever eaten. \nThat damn garlic chicken is un- real!"
        }, 
        {
            "index": 310, 
            "rating": 4, 
            "review": "After reading & hearing such great reviews, I finally got to try this sushi joint. \n\nI'd have to agree with many yelpers that the GARLIC CHICKEN was deelish!! \n\nThe rolls were yummy especially the  KILAUEA ROLL !  And I'm spoiled with a list of special rolls from yama sushi but its nice that this place keeps it SIMPLE. \n\nI may not be back due to the fact that its across from town from my place but I would definitely like to try their new spot in summerlin 808 TAPAS."
        }, 
        {
            "index": 311, 
            "rating": 5, 
            "review": "wow!  i ate here 4 hours ago, and i'm still completely stuffed.  i love all-you-can-eat sushi, but this place is no todai.  amazingly fresh fish (especially my favorite - saba, aka mackeral), creative rolls, and friendly but not overbearing service.\n\nmy family and i had the following:\n- poke tuna \n- sake (salmon)\n- hamachi kama (yellowtail collar)\n- shrimp and veggie tempura (their veggie tempura includes purple yam!)\n- garlic tuna nigiri\n- 808 roll\n- tiger roll\n- triple crown roll\n- gator roll\n- agedashi tofu\n\nand there are actually a few others but i can't even recall what they all are.  again, everything was absolutely fresh and tasty.  plenty of parking as it's off-strip and in a strip mall.  the price is $24.95 per person, but for all that we had (and for the quality) it was worth it."
        }, 
        {
            "index": 312, 
            "rating": 4, 
            "review": "Ordered off the menu. Was given excellent service. Perhaps ordering off the menu as opposed to AYCE sushi results in quicker service."
        }, 
        {
            "index": 313, 
            "rating": 4, 
            "review": "This place is so convenient, literally 5 minutes away from my house. I haven't really taken advantage of the close proximity to sushi until recently. Their happy hour is awesome! Most of the the stuff on happy hour that Ive tried I really like. The garlic chicken is soooo good! Its so crispy and juicy mmmm I'm getting hungry now... I also like their poke tuna and all their Hawaiian style sushi rolls. Haven't tried a wide variety of the rolls yet but from the descriptions on the menu they all sound delicious. They also do offer AYCE but I usually can get full off a few things from happy hour so for me that's the way to go. All the servers are friendly and they usually seem to have just the right amount of staff to accommodate all the customers."
        }, 
        {
            "index": 314, 
            "rating": 5, 
            "review": "I loved the staff!  Hawaii representing on the 9th island- lol. ( Las Vegas) fun staff/ great food!  Today was the first time I had ever tried nigiri ( super white ) escolar.. Clean texture and lightly sweet from its natural oils not found in any other fish.  Don't eat too much!  \nIt's a treat- that I've never seen before.\nThe chefs were knowledgeable and fast! Wow-\nCan't wait to go back."
        }, 
        {
            "index": 315, 
            "rating": 4, 
            "review": "We ate here one night on our stay on the strip in Vegas.  It was a little drive but well worth it.  There was a little wait for a table when we got there -- it was packed.  Probably because of their happy hour specials which were pretty good.  After happy hour it wasn't as packed.  Service was mostly good but we had a wait before they took our order (kind of strange too since another waitress wasn't busy, refilling things which should be done on their down time).\n\nWe were able to order a couple of items on the happy hour specials and they made a \"last call\" for orders.  We ordered some combinations and there was a *lot* of food, that we had plenty to take back (luckily we had a full kitchen at our resort so that worked out).  There was another patron there that was also visiting from Hawaii and he blew up balloon art for the kids.\n\nThe Hawaiian twist on the food was very good and made for some delicious combinations.  The sushi and sashimi was fresh.  We would probably return next time (though the pricing is a little on the high side, especially if you don't order off the happy hour menu)."
        }, 
        {
            "index": 316, 
            "rating": 3, 
            "review": "Used to be my go-to sushi joint for happy hour... That is, until I discovered Soho. There's nothing wrong with 808. It's just that, compared to Soho, there's no reason to go back to 808.."
        }, 
        {
            "index": 317, 
            "rating": 5, 
            "review": "I love his place and their happy hour is bomb!! The place is always clean and the service is fast and friendly. The atmosphere is usually cool, but my one complaint would be the babies crying, there always seems to be one loud crying baby when I go."
        }, 
        {
            "index": 318, 
            "rating": 5, 
            "review": "I love 808 sushi! My husband I are went there for the first time because I bought a groupon. The service was a bit slow (not as bad as some places), but the food was and always is excellent! I usually like to go during happy hour--I love my Haleakala roll! Mmmm...I think the chefs are pretty funny and they seem to be in good moods. Right now, this is my to-go-to sushi place! Don't ever close!! :)"
        }, 
        {
            "index": 319, 
            "rating": 5, 
            "review": "Great sushi spot and the happy hour prices make picking up sushi on the way home from work an inexpensive treat. They're always busy and have an attentive waitstaff when dining there."
        }, 
        {
            "index": 320, 
            "rating": 5, 
            "review": "I didn't come for a few years I might have had just a bad chef at a bad time but the last few times I've been there they have been beyond amazing. 808 is great"
        }, 
        {
            "index": 321, 
            "rating": 4, 
            "review": "Good food, cheap happy hours, close to my house =P\none of the place u have to try.. nothing more to say\nbut dont EVER order their 9pcs of sashimi....which was really\nridiculous cuz it was literally a milimeter sashimi...yes that means it was\nvery very thin pieceS...was more like sashimilimeter lol....other then that its a good place"
        }, 
        {
            "index": 322, 
            "rating": 5, 
            "review": "Love this place. The sushi is so fresh and all of the rolls are delicious! My favorite roll is the 808 special roll. Highly recommend it!\n\nThe service is fast, even when the place is packed. All of the people that work here are nice and courteous."
        }, 
        {
            "index": 323, 
            "rating": 4, 
            "review": "Spicy tuna is not spicy at all ... and I've tried it a number of times but the Island Fever is one of my favorites. Great place for pick up and not over priced!"
        }, 
        {
            "index": 324, 
            "rating": 1, 
            "review": "Smh at them for turning the music off, mopping, and putting the chairs up 30 minutes before closing. How uncomfortable! And they even stopped doing TO GO orders 20 minutes BEFORE they closed. Change the hours on the door then. disappointing and so shame cause we always come here.. but not this late."
        }, 
        {
            "index": 325, 
            "rating": 5, 
            "review": "The service was great; everybody was very friendly and quick. The food was awesome. I highly recommend the garlic chicken. What makes this place even better is their happy hour...all the rolls are 50% off!"
        }, 
        {
            "index": 326, 
            "rating": 4, 
            "review": "Happy Hour is the best deal!  We had 2 orders garlic chicken, Teri beef, gyoza, 2 deep fried rolls (Cali and Philly) and a green tea ice cream all for $26!  We only\ngo during happy hour...better service than Island Flavors (friendlier staff)."
        }, 
        {
            "index": 327, 
            "rating": 2, 
            "review": "Went to this place with an open mind. I love sushi and everything about it (minus mackerel), and left feeling disappointed. The food was about 3 stars, and the service was 0-1 stars. On a good night, their salmon sushi was very fresh tasting. But the rolls were tiny."
        }, 
        {
            "index": 328, 
            "rating": 4, 
            "review": "This place was a pleasant surprise.  Very good sushi with a Hawaiian influence.  They have a great happy hour special as well.  I still put Yama Sushi and Oyshi Sushi above this...but definitely good if you live in the neighborhood."
        }, 
        {
            "index": 329, 
            "rating": 1, 
            "review": "Horrible food, horrible service. Can't believe this place is still in business! With all of the amazing sushi places in town, why would anyone come here more than once? Do yourself a favor and drive five more minutes to Ohjah on Decatur. Don't waste your money."
        }, 
        {
            "index": 330, 
            "rating": 4, 
            "review": "Foods really good! \n\nService is awesome. All around good place to have AYCE sushi!\n\n**note they do not split the check\n**party of 6 or more they add 18% gratuity"
        }, 
        {
            "index": 331, 
            "rating": 1, 
            "review": "Save your time, money and stomachs for something else. Such a waste. The service was mediocre, the sushi was small. Not terrible, but not exactly good.  I got the AYCE sushi and let my son try a small piece of tofu and the staff flipped out. From that point on they all watched us like we were criminals and tried to charge me extra. I will never go back to that restaurant again. The dining experience was terrible and the atmosphere sucked."
        }, 
        {
            "index": 332, 
            "rating": 4, 
            "review": "first time here while visiting my son in Las Vegas.. all you can eat sushi was awesome.. good price.. will definitely return again on next visit"
        }, 
        {
            "index": 333, 
            "rating": 3, 
            "review": "The all-you-can-eat sushi at this place is quite good.  They have a decent variety of rolls and the standard selection of sushi.  The fish seemed to be fresh.  The rolls are made a little smaller (thinner) than most sushi places, which is fine by me.  In an AYCE setting, that just means being able to enjoy more variety.  My group had the six different rolls.  We felt the Lahaina, Hawaiian Style, and Pele were all very good.  The appetizer selection is not quite as extensive as some other AYCE places, but they were all quite good.  I appreciated the three raw fish choices they had -- Ahi Poke, Seared Ahi Poke, and Seared Salmon Sashimi.  They were all prepared well.  Most places have more fried appetizers than anything, so this was a pleasant surprise.  A positive note is that the Ahi Poke is simply a bowl of fresh fish and is not layered with \"filler\" items, such as seaweed, cucumber, onions, etc.  Our server was efficient and friendly, although her knowledge of the menu items could definitely use some help.  Overall, I enjoyed the meal and would come back.  Oyshi Sushi, about a mile away, has a larger menu and the sushi and rolls are slightly better.  The only problem is that you will have to wait a while during peak hours and the last couple of times I went, the service was REALLY slow."
        }, 
        {
            "index": 334, 
            "rating": 1, 
            "review": "Since i didn't eat here, this is for the ambiance and service. First as you walk in all you see is picinic table style tables and very little in the traditional decor. Which is fine per se but what put the nail 8n the proverbial coffin was the fishy smell and the detached servuce from the greeter. She just waved us to sit without so much as a hello. So. Good luck."
        }, 
        {
            "index": 335, 
            "rating": 4, 
            "review": "Definately worth trying. The service was great and the food was really good. All you can eat and the menu is HUGE. they even offer tons of non-sushi dishes and desserts. It is a bargin"
        }, 
        {
            "index": 336, 
            "rating": 5, 
            "review": "Great experience here!  My partner & I had one of those mornings where you're so busy you don't get time to eat, by 1:30pm I was starving & decided sushi was needed.  We're currently visiting with the in-laws, this place is right around the corner from their house and had good reviews.  We ordered the AYCE lunch special, sat at the sushi bar & proceeded to get some of the fastest and most personable service imaginable.  The staff was fantastic, the food was delicious and I'm pretty sure we got more than our money's worth on the AYCE special!  We even grabbed one of their stamp cards (after you get 10 ACYE, the 11th is free) and I'm sure we'll be eating there every time we visit."
        }, 
        {
            "index": 337, 
            "rating": 4, 
            "review": "I went to 808 Sushi with some friends. They picked this restaurant because of the All You Can Eat sushi. I already ate before going to 808, so I didn't eat all I could.\n\nI ordered the salmon teriyaki entree and it was very good. The portion was not huge, but not small either.\n\nMy friends ordered and ate a lot of sushi! The service was good and there was plenty of parking."
        }, 
        {
            "index": 338, 
            "rating": 1, 
            "review": "This place is not worth your time, the fish was ok, service was ok. I ordered all you can eat, I started with Ahi Poke which was ice cold, Tempura Veggies and Shrimp (How could that get messed up), Da Kamikazi roll (Good flavor), 808 Special (great Taste), Haleakala (It was ok), and a half Kilauea which I was told that would have to be my last. When I asked why they could not answer me, the place was picking up I had been there for about 35 minutes so I looked on the menu to see if there was a time limit nothing on the menu. the staff had a ok attitude. But overall It cost me $29.14 for a small bowl of frozen Ahi, 2 tempura shrimp, 5 pieces of tempura veggies, and 3 1/2 rolls which I could have had off their happy hour menu for about $23. There are quite a few sushi places in Vegas my recommendation is go somewhere else, if you have a time policy or any other policy have it up in writing so customers know what they are"
        }, 
        {
            "index": 339, 
            "rating": 3, 
            "review": "I was the only one doing AYCE and the rest of my girlfriends ordered ala carte. They were hawking the table to ensure that I don't share.  I am a respectful eater and I expect the same treatment as a customer. Don't hawk at me, I understand the rules and I will not share. Or perhaps they were staring because they could not believe the amount of food that I could eat all on my own?  Regardless, please don't stare and just serve my food.\n\nIt's better than bad.  The service was slow. I enjoyed that they have hamachi kama on the AYCE appetizers, which I love. The poke tuna was ok, it lacked flavor. Shrimp tempura was a little soggy and warm.  I did like the agadeshi tofu.  I liked the tako karaoge (deep fried octopus).\n\nNigiri sushi.....It was hard to decipher if the fish was fresh. They kept on putting sauce over the nigiri when I asked them not to. In order to taste the fish if it's fresh or rancid, eating in its rawest form is the best way to determine. I ordered the following twice...Yellowtail, white tuna, snapper, which all had sauce added to it. Masago and Ikura was a little salty but I kind of like it. The amaebi sweet shrimp was really good, but the deep fried shrimp head was hard and chewy. They never served my hokkigai (surf clam) and said they ran out of the Uni after waiting for 30 minutes....\n\nThe salmon skin hand roll was really good.  I wanted to order some special rolls because it looked really great from others. However, they don't let you order half orders rolls unless it is your last order.  These rules are weird to me and especially when they forget some of my items. \n\nOne great thing about 808 Sushi is that it is right around the corner of my house and the convenience is fantastic. \n\nWould I come back here again? Yes, because I really want to push them to DO NOT add sauce to my Nigiri unless requested. I must review by the quality of the fish and next time...I want to try the special rolls and dine with other AYCE eaters!"
        }, 
        {
            "index": 340, 
            "rating": 4, 
            "review": "Very good AYCE sushi.\nThe owner owned a sushi franchise in Hawaii, so he understand the standards of good food.\n\nHighlights:\n- Spicy tuna roll, the REAL version, with Japanese mayo chili pepper mix. If you never tried this real authentic version of spicy tuna (the fake looks bright red from schiracha sauce) then you won't know WHAT you should be craving!\n-Hamachi collar. Ask any chef, she/he knows the best part of a fish is the collar (except for toro). The fatty flavorful meat seared crispy on the outside but soft and wonderful on the inside, just like me!\n-Miso Cod, soft buttery with mild miso sauce. I like this much better than the traditional miso butterfish which has more shoyu in it. This version is much more delicate.\n-Salmon collar, which has an intense amount of fat in the meat. Was pure inddulgence.\n-The nigiri - uni, unagi, hamachi, and halibut were all of quality standards.\n\nDuring the ending though I felt I was overloaded with msg, I think due to the natural fattiness and saltiness of the Hamachi collar, Miso, and salmon collar. Bad move eating all three in one sitting but had to try since it was my first time here. Next time I'll limit myself from indulging in all three.\n\nIf they had baked clams with the crusty mayo sauce on top, it would be perfection!\n\nWent on a Wednesday, 2 large groups came in, luckily, when we were nearing the end of our dining experience. This place gets crowded, and for a good reason!"
        }, 
        {
            "index": 341, 
            "rating": 5, 
            "review": "By far best sushi I have ever had! My husband and I have since moved out of vegas and miss 808 sushi like crazy. We've since tried about five or more sushi restaurants in our current city and nothing compares. The staff was always great and sushi delicious! Also appreciate the cleanliness of the restaurant...condiment bottles were never sticky!"
        }, 
        {
            "index": 342, 
            "rating": 3, 
            "review": "We had the AYCE sushi.  Their sushi selection is ok, but not as good as the other similar restaurants in the area like Oyshi, Xtreme and Kobe.  The sushi is small, and I mean both the fish and the rice.  So I guess it is good for people who want to try more varieties.  The garlic chicken is so juicy and tasty.  The appearance or arrangement of the restaurant is more like a fast food place than a restaurant.  For the service, I can't tell whether it is good or not.  They are all friendly servers, but they kept asking us if we wanted more every two to three minutes."
        }, 
        {
            "index": 343, 
            "rating": 4, 
            "review": "I wouldn't put 808 sushi in my top 3 in Vegas, but it's decent. The employees always greet you once you come in. It's not a very big place so there's limited seating. \n\nI've had AYCE here a couple of times. Their fish to rice ratio is hit or miss, not always the same. They don't have as many choices for their appetizers but the ones they do have are pretty good. I usually order their combination dinner (teriyaki salmon and shrimp tempura) because you get a good amount and it keeps me full. Their teriyaki salmon is my favorite thing on their menu. They used to douse it with sauce but now it's much better! \n\nTheir service is pretty good. Sometimes when they get busy, you have to wait a little longer for your drink but they're always very nice and polite."
        }, 
        {
            "index": 344, 
            "rating": 1, 
            "review": "Great Japanese food, great restaurant, but customer service SUCKS big time. They dont give you a itemized receipt and basically you dont know what you have ordered.. The excuse was \"well we dont keep those\".. Weird.. What about if your customers want to see the items individually with price for each? Well not here :) you will be surprised when you get home. Come on guys get into the 21st century - POS system with a little \"printer\" that prints out receipts with the items.. We used to hand write them back in the 70s :))\nGood luck! And please contact a PoS company you need it!!!"
        }, 
        {
            "index": 345, 
            "rating": 5, 
            "review": "This is a must stop if you love sushi and you are a local or a tourist that loves good sushi. You can't beat the price for the all you can eat. The quality is top notch and the service is fast. Even at its busiest you are never waiting long for another roll or appetizer. \n\nCome on an empty stomach as you will want to try anything and everything that sounds delicious!!"
        }, 
        {
            "index": 346, 
            "rating": 4, 
            "review": "This review goes towards 808 Sushi's SUMMER SPECIAL right now.\nStarts Mon-Fri 1p-6:30p & Fri-Sat 9p-11p.\n\n808 Sushi was another \"top rated\" AYCE sushi joints I've read about so my girlfriends and I decided to have dinner here after the gym and fyi as much as we wanted to do AYCE, we didn't go through with it since we worked out so hard haha. \n\nWhile looking through the menu, the server hands us the summer special menus which is pretty much their way of saying happy hour! happy!! yippeee! Man O man! There Garlic Chicken was the BOMB!!! Deep fried chicken dipped in garlic shoyu sauce. Every bite I took had so much flavor and juice. It was amazing. I've never tasted garlic chicken like that before. I would come to 808 sushi all the time and order just the Garlic Chicken and be satisfied. That goooood. The Ahi Poke and Cucumber salad was delightful. So glad it did not taste fishy. Yuck. I like how they add seaweed salad with the Ahi Poke on the bottom, not a bad pair. Now with the sushi, I've only tried the Kilauea roll, Hawaiian style roll, and salmon skin roll. It wasn't bad. Quality of the sushi and presentation was mediocre. Customer service was a little unorganized, but still attentive. \n\nOverall, I would definitely come back for the GARLIC CHICKEN!"
        }, 
        {
            "index": 347, 
            "rating": 1, 
            "review": "My son and I stood at the front for 6 mins. We didn't get greeted or a seat. One of the waitresses looked from the order she was putting in with that \" oh sh*t another customer when Im so busy\" face. We ended up walking out. Unfortunate because its so close to our house. I understand when people are busy. However a smile or \"please wait a little, Im very busy\" goes a long way."
        }, 
        {
            "index": 348, 
            "rating": 4, 
            "review": "happy hour is awesome 4-6pm...I could eat there everyday if i had to."
        }, 
        {
            "index": 349, 
            "rating": 3, 
            "review": "Happy hour and service is usually very good. I wanted to come on an actual observed holiday last year and called first to make sure that happy hour was still available and was told yes. Went here Valentine's Day, because I know the menu fairly well I just started ordering when we sat down, afterwards was told that happy hour wasn't available on that date and was charged full price for everything. That was a little irritating."
        }, 
        {
            "index": 350, 
            "rating": 4, 
            "review": "Amazing food and amazing service if you are on this side of town i def recommend this place!!"
        }, 
        {
            "index": 351, 
            "rating": 5, 
            "review": "This place never disappoints... Awesome food and hospitality . My favs remain the same with a new favorite: tako karage, garlic chicken, poke, spicy pele."
        }, 
        {
            "index": 352, 
            "rating": 2, 
            "review": "This place has really gone down hill. The area has become more competitive and 808 has not kept up. I guess the only thing going for them is the happy hour which is pretty reasonable."
        }, 
        {
            "index": 353, 
            "rating": 2, 
            "review": "808 Sushi, but where is the Hawaiian Pride? We all had the All you can eat and our order took a looong time to arrive, simple items came later and a few times our order was left on a table behind us and their orders were left on our table. I actually had to turn around and serve a table behind us! There is nothing special here and in fact there is alot of standard items not available for All you can eat. Treat the guest poorly and we won't return, go skimpy on the product and we will not return, the place makes no sense. Tough kalbi meat with fat all over it, average preparation, slow service even when the place was 1/3 full, talk about laid back Hawaiian style? I won't make the long drive to come up here again."
        }, 
        {
            "index": 354, 
            "rating": 4, 
            "review": "Second time coming here within a month thanks to Groupon. $20 for $40 worth of sushi.. cant beat that.\nGood quality sushi and quick service. Took off a star because the atmosphere of the restaurant has a very dark and old look. Also, I didn't like the fact the server asked us if we were using a Groupon the second we sat down.. makes me wonder if the portions are smaller or something compared to non-groupon users.."
        }, 
        {
            "index": 355, 
            "rating": 5, 
            "review": "Well the main thing i have to say about this place was it had amazing service. Havent felt that happy abot service in a long time. Very attentive and didnt have to wait for anything. Those girls were on top of their game. I will be going back for some happy hour sushi again really soon. Their menu is different then the 808 happy hour menu for the one on fort apache but the service was amazing at this durango location. Their happy hour menu blows all the other sushi places out if the water."
        }, 
        {
            "index": 356, 
            "rating": 5, 
            "review": "This place deserve 6 stars. Omg,the price is the best for the quality and taste of this sushi. Rolls are under $8 bucks. The garlic chicken is amazing just as the rolls are. I will come every time in in Vegas. I'll be back before I depart"
        }, 
        {
            "index": 357, 
            "rating": 1, 
            "review": "Well, this was my go to place for sushi but not anymore. We came in tonight and had a server I have never seen before was there. She was very unfriendly. She took our drink and appetizer order. She delivered that quickly but then didn't see her for 27 mins till I asked the host what was taking so long. She asked the kitchen and then walked away. Never reported back to me what was going on. After 7 more minutes I asked the host if she had an answer for me. She replied \"they are working on it\". Then I asked for the manager and another server dressed lady said she was the manager. She said she was sorry. We told her we didn't want to wait anymore and left. She kept saying she was sorry. It could have been handled different by the host and the server. There was my wife and I and 2 other couples in there only.  We will go somewhere else for Sushi."
        }, 
        {
            "index": 358, 
            "rating": 4, 
            "review": "Had lunch there other day, the food tasted great, our waitress was nice, and the place seemed clean, prices are reasonable.  Only complaint was my Tempura roll had way too much rice and had a freckle of unagi.  A sushi pet peeve of mine.  Other than that, enjoyed our lunch."
        }, 
        {
            "index": 359, 
            "rating": 5, 
            "review": "I love this place! It has to be my favorite sushi place in town! The service is great and the food is amazing. The salmon nigiri is always fresh and the garlic tuna is also great. They have a great selection of specialty rolls along with traditional ones, which are all absolutely amazing. Highly recommend this sushi place to everyone."
        }, 
        {
            "index": 360, 
            "rating": 1, 
            "review": "Went here for the first time and luckily it was happy hour. Each roll was only $5 and it was okay. The service was bad and slow. I had to always get up and ask for water and other food. Probably will not come back."
        }, 
        {
            "index": 361, 
            "rating": 5, 
            "review": "Yummy sushi, & great prices. Who can complain about a fresh $6 sushi roll? I love stopping in here post workout for a quick bite. I enjoy the Hawaiian style rolls and poke. The Island roll and Hawaiian style are my favorites!"
        }, 
        {
            "index": 362, 
            "rating": 2, 
            "review": "I have tried a few times and I'm honestly not that impressed. I feel it's overpriced and the sushi isn't that great. #stepupyourgame"
        }, 
        {
            "index": 363, 
            "rating": 5, 
            "review": "We just went here today with Groupon deal.  All the sauce on entree was little salty, but it's ok.  The fish was so fresh and I loved all the nigiri.  Usually, they make the rice part so big so that you feel like you are eating lots of rice, but they make the rice part so small (suppose to be like this), and you can actually enjoy the fish on it.  We haven't eaten something this fresh for a long time in Vegas.  We'll be back for sure.\n\nWe tried Garlic Chicken as everyone mention on their comment.  Yes, it was very good."
        }, 
        {
            "index": 364, 
            "rating": 1, 
            "review": "Horrible. My boyfriend and I went here yesterday and we're still nauseous. Quite possibly THE worst sushi place ever. Their  portion for the edamame was big (the only positive thing about this place). Their cheap happy hour was not worth the throw up this morning. I would not recommend this place to anyone."
        }, 
        {
            "index": 365, 
            "rating": 3, 
            "review": "is Good but bad service they have a very unprofetional Hawallan guy not to frendly,very smal sushi bar i think seven chair,n everytime they have only one guy working in the bar,very unprofetional i wont go there egain bad bad service i hate to said that,but is real poor poor service"
        }, 
        {
            "index": 366, 
            "rating": 2, 
            "review": "The food is nothing special and the serving sizes are very small, although you can always order more at no additional cost, for the most part, on the AYCE menu. On the other hand, the service is fairly decent."
        }, 
        {
            "index": 367, 
            "rating": 5, 
            "review": "The lunch special.... Omg. I had the Hawaiian themed one with spam, teri beef, furikake-sprinkled rice, and edamame and for $8.50 it's an awesome deal. Great flavor, portion, and quality for under $10!!"
        }, 
        {
            "index": 368, 
            "rating": 3, 
            "review": "808 Sushi is a skilled fisherman with a Hawiian Dad and Japanese Mom, but seems to be confused about who he really is. \n\nThis fisherman clearly has some Japanese blood in him because he offers one of the freshest fish in Vegas, comparable to Naked Fish. While he may have one of the best eel sauce, he is still an apprentice. Offering a very limited selection of apps and rolls that fail to impress me. \n\nTheir house roll, 808 special was just okay. If they're own house special roll fails to impress me I don't think the other rolls will impress me. I also took half a dragon roll since it was my last order, no complaints here, but nothing special either. Maybe I'm just being a sushi elitist.\n\nI was given the shrimp heads from my sweet shrimp that was lightly fried. It could have been much better if it was fried more throughly through so I can actually eat the entire head in 1 bite, instead of just sucking the inside. Places like Lotus of Siam and even Brian's Beach Sushi get this, but not Ichiza or this 808 Sushi. \n\nThe ahi poke, I just couldn't bare myself to finish it. Just something about the flavors made me not want to finish it and I hate wasting seafood.\n\nThe hamachi kama, yellowtail collar, was grilled to a crisp. It just wasn't grilled right because all I could taste is burnt flavor. To be fair, grilling seafood properly is really difficult to get it just right, sadly they fail to do this properly. Hikari got this right.\n\nThe seared salmon sashimi was good, but I found it unnecessary to add the hot peppers on it. Salmon already is very flavorful on its own, no need to add additional spices that mask its natural flavor. \n\nThe gyoza came out hot, crispy, and tasty, but request it as pan fried instead. This will help preserve more of the flavor that get lost when you fry food.\n\nThe uni had the good creamy texture, but the dark yellow color tells you the grade of uni isn't that great. But hey, it tastes great and thats all that matter.\n\nThe banzai desert is apple pie filling wrapped up in a dough to form what resembles an egg roll. Its deep fried and then cut in half, served with vanilla ice cream, chocolate sauce, and whipped cream. Good, but a small problem with this. Combining something that is relatively hot like the apple pie filling and taking a bite of an ice cream is not a good combination. This may hurt your teeth a little because of the coldness of the ice cream and the hard and hotness of the apple roll. Its similar to filling a plastic bottle with hot water, pouring it out, then immediately pouring cold water over it. Try it for yourself and see what happens. This  temperature differential is not good for you. Letting the apple roll cool down will fix this problem.\n\nThe fisherman also has a Hawiian dad that takes over part of the menu. The dad's influence is great for those who don't like sushi, but those wanting more of the Japanese influence will be disappointed because there is no dynamite, screaming orgasm, soft shell crab, oysters, or toro on the all you can eat menu.\n\nThe sushi bar has an open kitchen, but there are also someissues with this. First, if you sit right next to the grill, you'll get some of the smoke from it. You also see the owner ordering his staff to make sure the order gets out. While I really admire his push to get out food, it just kind of kills the good vibe of eating at a sushi bar. I just got a bad vibe from the owner at the end of my meal, despite having a very good vibe of him at the beginning of the meal. How quickly things change. Otherwise, the front of the house are really attentive and really friendly.\n\n808 Sushi is another sushi restaurant, but I'm not really seeing the hype about this place. With some small improvements and additions, I can see this place being really special. Otherwise, its just the place you go for all you can eat sushi with a limited selection, and happen to have friends who don't like sushi. Spend a couple of more bucks and stick with Hikari or Sushimon for your all you can eat sushi needs."
        }, 
        {
            "index": 369, 
            "rating": 3, 
            "review": "Recently have been on a Sushi Scavenger Hunt and decided to try a new place with my husband. We have driven by this place numerous times over the past 2 years and not once set foot in here so we decided to go there for our date night. It has a very positive upbeat ambience. A bit small. Definitely have that family feel to it. The manager on duty was extremely attentive and checked in with all guests to ensure beverages were being refilled, etc. Best sushi we had that night was Candy Cane. It was delicious. Prices here are average for AYCE. Checkout is a bit inconvenient as it is directly in front of the entrance and hard to tell if people are coming or going. Again small location. They have multiple TV screens up for sports and such. Overall good."
        }, 
        {
            "index": 370, 
            "rating": 1, 
            "review": "My husband and I have been regulars here and up until recently our experience was positive. \n\nRecently they have had new policies I feel are un necessary, especially if the place is not busy. Once we were told we could not be seated until the whole party had arrived, meanwhile the restaurant had one other table. I could understand that if it was busy and we would be holding up a table for a big party. We were only a party of 4. \n\nThey also made an issue when we had asked for separate checks. Our server said it was fine but when we received the check it was not separated and they had added taxes as well as 18% gratuity with NO breakdown. When we had asked to at least explain to us the taxes and tip the server then passed us off to another server who was extremely rude despite us being polite about the matter. She then passed us off to the manager and made it very evident she was upset. \n\nThe manager explained again it was their new policy but could do us a favor since they were not busy. We then asked if they expect each party over 5 to have one person take care of the check? Should we have to split our parties to different tables just so we could each pay our own check? It is one thing to not split our check however to make an issue of the way we are paying is just ridiculous. \n\nLastly, as we left no one even said good bye as they normally do. \n\nOur family frequented this place at least once a week and I can say we will NEVER go here again."
        }, 
        {
            "index": 371, 
            "rating": 5, 
            "review": "My last review was correct. I have become a regular here. I grab sushi from 808 about twice a week. Of all the times I have gone here I have never had a complaint. The food is consistently good and the staff is great."
        }, 
        {
            "index": 372, 
            "rating": 3, 
            "review": "I was very excited to finally try this place since I hear about it all the time. Had all you can eat sushi & was told they \"don't do\" half orders like how it usually is in all the all you can eat sushi places I have been to. The food was alright and not really the price you pay for, so I was very disappointed. AND the service was terrible... Probably not coming back for a while."
        }, 
        {
            "index": 373, 
            "rating": 5, 
            "review": "808 Sushi is by far one of the best sushi restaurants I've had. I learned about this from a few locals, and they're regulars. For its price, the quality was amazing and it tasted much better than other high-end sushi restaurants. I would've like to have tried more, but my stomach couldn't handle everything. I wish was I was fatter for this place.\n\nIf you're even a little hungry, you should get the all-you-can eat menu for 24.95.  It is definitely worth it. They have a large kitchen, sushi, and roll menu.\n\nRecommendations: \nKitchen menu -  Ahi poke, Garlic Chicken (juicy), Mochiko chicken, pork gyoza, teriyaki chicken\n\nRoll menu - 808 special, triple crown, baked scallop, haleakala, kilaeuea, unagi.\n\nDessert: (comes w/ the all-u-can eat menu)\nBanzai Special (AMAZING)\n\nI don't ever order teriyaki chicken because it's on a typical teriyaki sauce, but this place has its own unique recipe and it doesn't taste like any teriyaki chicken I've had. It was delicious.\n\nA+++ on all categories"
        }, 
        {
            "index": 374, 
            "rating": 4, 
            "review": "Gotta love the Sushi!\nWe went there for the first time tonight and was pleasantly surprised to see all the tables filled.  The last Sushi place we have been going to, we were always the only ones in there and it always concerned me (both as to why? and how fresh could the fish be if there was no turnover) - so seeing full tables bodes well to me.  We had to wait 10 minutes for a table since it is so small in there, but I was ok with it.\nWe are AYCE fans, but their AYCE menu is sort of limited IMO...but we still found lots of things we enjoyed!\nWe started with the Garlic Chicken per the Yelp recommendation and it was super good!  We only got 4 small pieces, and I saw another table get a much larger portion which made me sad as I could have eaten more.\nWe tried lots of different rolls and didn't get over stuffed super fast like at other places. The fish tasted fresh, but we get the Special rolls that aren't really fish fish.\nThe spicy tuna, spicy crab and spicy mayo - none were all that spicy.  I could have used some more heat. However, I still loved the taste and there was no burning in my mouth!\nMy only complaint is how they run the waiting on tables.  We had 3 different people take our orders, and they wouldn't always know if someone else had recently taken a order. They would see us not eating and someone would stop to check on us and want us to order another roll - while I totally appreciated the attentiveness, it made for some confusion about what rolls we were on and what we were waiting for. \n\nThey offer a punch card - 10 AYCEs get 1 free.\n\nAlso, very kid friendly apparently.  There were TONS of kids in there."
        }, 
        {
            "index": 375, 
            "rating": 4, 
            "review": "Had a nice AYCE sushi lunch with my hubby here.  The ahi poke and garlic chicken were really tasty.  Definitely glad to have found this place!"
        }, 
        {
            "index": 376, 
            "rating": 2, 
            "review": "I wish I could give more stars but I can't and 2 stars is generous.  The food isn't bad but it's not a place where you tell yourself \"I have to have it.\"\nThere's people lined up waiting to be seated with plenty of empty tables.  The seats aren't being filled because the waitress is the greeter, the waitress and the bus boy.  Speaking of the \"bus boy,\" She's cleaning the tables with her bare hands then going straight to handle food/drinks etc... It's so disgusting to watch.  I won't be returning. Smh"
        }, 
        {
            "index": 377, 
            "rating": 3, 
            "review": "This is for to go....with a baby it's a bit hard to dine In. I'm sure the atmosphere probably makes it a lil better.  I ordered the tempura udon and caterpillar roll. My husband ordered the charashi bowl and a roll. Tempura udon was your average udon with crab cake and broccoli (a lil weird with the broccoli). The tempura came with two shrimps and what seemed like a tempura pancake of onions, carrots and I think that's it. Rolls were good but I wished they put the sauce on the side so that it didn't get all soggy. From what I could tell the charashi bowl was good...the fish didn't look all what fresh but it looked decent enough.  We had tried to order take out over the weekend and there was a hour wait and the next day they didn't even answer their phone! Overall I thought it was ok and with our groupon it was worth it."
        }, 
        {
            "index": 378, 
            "rating": 2, 
            "review": "I recently visited this restaurant for the first time. I love sushi but it has to be good quality seafood. I found this place lacking in quality. The seafood was of low grade. The salmon katsu didn't even taste like salmon. The Ahi poke was very poor quality fish. It was ropey, fibrous and chewy. I guess if you have low prices and all you can eat then they probably compromise on the quality of seafood that they use."
        }, 
        {
            "index": 379, 
            "rating": 3, 
            "review": "We gave 808 a 1-star from our first visit (bad fish, bad service, bad cleanliness) but we've been seeing all the great reviews which made us think maybe we should give it another shot - now about a year later.  Although it was a much improved experience from the first time it still missed the mark for anything more than 3-stars.\n\nThe sushi was just average (small portions and so-so quality) with very little menu variation (everything is a derivative of spicy-*insert fish name here*). \n\nThe service was notably improved over a year ago but still mediocre even with regular check-ups from the assistant manager.  Misses included: having to ask for set ups and soy ramekins, being served luke warm hot green tea (both rounds) and a waitress that keep disappearing for longer periods than comfortable.\n\nGiven the large number of places in Las Vegas to dine sushi with both better service and better fish - we'll be keeping 808 Sushi on the shelf."
        }, 
        {
            "index": 380, 
            "rating": 5, 
            "review": "I visited 808 Sushi for lunch last week becuase of the recommendation from my students. I was teaching Excel at the client site just down the street from 808 Sushi. My experience was excellent. The service was prompt and friendly. The environment is clean and nice decor. I ordered the sushi buffet. Every item I ordered was very good. I plan to revisit 808 Sushi in the near future."
        }, 
        {
            "index": 381, 
            "rating": 4, 
            "review": "I am still new to the Vegas area and have yet to find that \"Sushi to Die for\" yet 808 Sushi comes pretty close. Let me explain why?\n\nThey offer happy hour even on Saturdays that gives you half price rolls. My friend brought me here because for the price this place is awesome. Its small yet roomy enough to not feel all congested.\n\nThe Service we received was AMAZING . I think my friend and I were there at least two hours but not once were we rushed or bothered by any of the girls working. We also got good recommendations on dessert and I was able to try EVERYTHING I wanted.\n\nI got the Garlic chicken Appetizer to try thanks to Yelp Recommendations and I must admit even for me it is SALTY and I love Love salt but for 2.50$ I would probably give it another chance. Full price I would stay away from it though.\n\nWe got lots of different appetizers from cucumber salad to a Salmon Katsu.\n\nThen come the rolls. My favorite was the Mexican Roll and my friend loved the Candy Cane Roll. We both really enjoyed the 808 special roll and the 007 roll. \n\nthe Like Poke roll was a complete Fail and we were super happy it was 50% off lol...\n\nIs it the best sushi I've ever had.. NOWAY but we were able to get so many rolls and appetizers and dessert for less then $50 on top of having great service so that made me a very very Happy girl!\n\nBONZAI SPECIAL is delicious def give it a try even if you don't have a huge sweet tooth its quite tasty! I can't wait to go back again"
        }, 
        {
            "index": 382, 
            "rating": 4, 
            "review": "The garlic chicken is very tasty , the ahi poke is good too, the rolls are average.\nThey are having a summer happy hour menu which the prices are not bad.\nI would recommend if your around."
        }, 
        {
            "index": 383, 
            "rating": 3, 
            "review": "Great selection, freshess of fish-good, but I've had better, prices are average, happy hour is great, as far as their service...slow and weak so they get 3 stars"
        }, 
        {
            "index": 384, 
            "rating": 3, 
            "review": "Two notes:\n1. This is a review of a non-sushi item, so while my personal experience was 2-stars, I am giving a one star bump for the possibility that they offer a better sushi experience.\n2. I only recently learned that 808 is a Hawaii area code. Previous to this discovery I had been thinking \"boom like an 808.\"\n\nNow, for the review:\n\nWhile I do occasionally go for AYCE sushi, I am not a sushi fanatic. I wasn't raised on seafood, so I have to be in a special mood to order AYCE sushi. When I went to 808, I was not in that mood, so I ordered chicken yakisoba and a house salad instead. \n\nThe server forgot my house salad, so no information there. However, I was not a fan of the noodles. There were slim pickins when it came to vegetables, and the chicken was not my favorite. It had a flavor that I refer to as \"chickeny chicken,\" which I understand really makes no sense, but it is an artificial, perhaps frozen, chicken taste. I ended up piling all of my chicken in a corner of the plate and simply eating the noodles. \n\nI guess the lesson learned is skip the noodles at a place known for AYCE sushi."
        }, 
        {
            "index": 385, 
            "rating": 5, 
            "review": "What more can you say?  The best AYCE sushi in Vegas?\n\nIt's the FAQS.\n\nFriendly, Affordable, Quality and Selection.\n\nI haven't found a place with better Local Hawaiian style appetizers from Vegas to LA.  Make it a point to try the Mochiko and Garlic chicken before you dive into the sushi and rolls.\n\nPlus a dessert at the end?  A perfect ending."
        }, 
        {
            "index": 386, 
            "rating": 1, 
            "review": "Been going off and on to this place for the past 4 years..  Tonight was my last! The quality has totally went down the drain.. fish has no taste at all!! even the serving size is tiny. I wish I took a picture of the tiny pieces of sushi the chef was handing me. I will not be going back here anymore. SAD! Atleast the wait staff was very attentive but the sushi chef I had was the worst ever!!"
        }, 
        {
            "index": 387, 
            "rating": 4, 
            "review": "Just moved to Vegas and was in the area found this place and loved it! Awesome happy hour tons of selection and prices were very reasonable. The venue itself isn't anything to write home about very simple wouldn't recommend it for more than a quick lunch but defiantly worth a try."
        }, 
        {
            "index": 388, 
            "rating": 4, 
            "review": "WHERE: Durango & Warm Springs (in the Vons center right next to Cold Stone Creamery)\n\nWHAT: I came here to eat once with my friend. We were both first-timers so ofcourse we had to do AYCE!! The only things worth remembering was the service was great!! (Made me bump one up on my star rating)\n\nThe food, on another note, was good. The mochiko chicken appetizer was bombness!! I tried a couple of their specialty rolls, and I don't know if it was me, but they all started tasting the same!!\n\nI may have to go back and eat there again to actually remember my likes and dislikes, but the only thing I can remember was that it was one of the okay sushi places I've tasted!\n\nOh!! One of the best things there was the Ahi Poke!!! If you love Ahi Poke as much as I do, then that definitely is a MUST! =D"
        }, 
        {
            "index": 389, 
            "rating": 2, 
            "review": "Great prices, especially during happy hour. But customer service needs A LOT of work! Either my order is skipped, i have to beg for a water refill because they never check on you, I get the wrong item, or I ask them for something and they just completely forget."
        }, 
        {
            "index": 390, 
            "rating": 5, 
            "review": "Good food, Great Service. This place is near my work and a great lunch spot."
        }, 
        {
            "index": 391, 
            "rating": 1, 
            "review": "Blehhhh :/ this place shouldn't even be in business with how many decent sushi restaurants there are around town. Just don't even bother.\n\nFood is definitely subpar. Tiny tiny tiny pieces of fish on their nigiri, sushi rolls falling apart, hardly any roll options that weren't filled with \"freshened up\" not so good fish drenched in spicy sauce. I really didn't have a single item that tasted fresh or at all interesting. Bad food quality and boring options.  How did I even get talked into going here???\n\nAwful service - no water refills, not enough chopsticks, no soy sauce bowls, one plate of wasabi and ginger for 6 people (gross if people want seconds), forgetting orders left and right, no napkins, crazy long waits for things that required no prep (like ice cream), and on top of all that an auto gratuity for seriously horrible service. Auto gratuity for a party of six is really pushing it in my opinion. That's a relatively normal sized group. Not to mention our server was rude and silently glared if we asked for anything at all, and wouldn't even look in our direction for most of the night, probably because he knew he wouldn't have to actually give decent service to make his tip. Seriously annoyed I had to autotip that guy so much (and I live on tips myself, so it's definitely bad if even I don't want to give him my money.) \n\nObviously never ever going back."
        }, 
        {
            "index": 392, 
            "rating": 5, 
            "review": "Definitely one of the most underrated AYCE sushi restaurant in Las Vegas, There's no need to lie, but I am here once a week since I always crave their nigiri. Their uni is ALWAYS fresh, and unlike Kaya Sushi, their Sweet Shrimp Nigiri is huge and definitely fresh - they also offer the head to be deep fried! The service improved and waiters are now more attentive. I love going to this place for not only the food, but also for the sushi chefs. They are all so genuinely nice and accommodating that I don't feel uncomfortable asking questions. If you're in town, definitely try this place out."
        }, 
        {
            "index": 393, 
            "rating": 1, 
            "review": "Food is good. Come here a lot. Thought if try their happy hour to go since we couldn't sit in. Apparently happy hour also means half the size. Maybe because it was busy that day... I didn't mind that it took n hour ... Just wanted the same amount we would have got in a sit in.  Even gave a $10 tip  suffice for a to go order, and  got home opened boxes disappointedly. :( was sad about that."
        }, 
        {
            "index": 394, 
            "rating": 5, 
            "review": "My favorite sushi place. Everything is always delicious. Staff and cooks are great. Always friendly . All you can eat is the best !"
        }, 
        {
            "index": 395, 
            "rating": 4, 
            "review": "I was wondering if 808 Sushi was the same establishment formerly known as 808 Tapas (located in Village Square) that closed...so I decided to try it after I found it on my Yelp app. 808 Tapas was one of my favs!\n\nI came here for an earlier dinner, so I was still in time for the Happy Hour menu. The Yelpers were right on the \"money\" about the inexpensive Happy Hour menu prices....so my wife and I decided to go HH menu selection instead of AYCE menu. We were not disappointed, good selection, we had a variety of items that were all very tasty. Our food came out quick and service was friendly (it was still early & not packed yet). We were allowed to continue to order off the HH menu until about 6:20-6:30 when one of the servers advised us \"last call\" for HH orders.\n\nOur final bill for the two of us was just under 40! I definitely felt it was a great value for what we had... our waitress confirmed this restaurant is the same owners as the former 808 Tapas & she also used to work @ 808 Tapas (which I recognized her from) nice & spacious dining area too..."
        }, 
        {
            "index": 396, 
            "rating": 1, 
            "review": "Am I in the twilight zone?!? This is the WORST sushi I have ever had. Yes the prices are amazing but that's just a reflection of there shitty sushi. I even gave it the benefit of the doubt trying it twice and bringing friends and it was just as terrible as the time before. The color of the spicy tuna roll was literally grey. I don't understand all the great reviews... are we all taking about the same place?! Goeymon and Kabuto are hands down THE best sushi in town."
        }, 
        {
            "index": 397, 
            "rating": 4, 
            "review": "I love their Happy Hour special. Their garlic chicken and hamachi kama keeps me coming back! Staff are also friendly and attentive."
        }, 
        {
            "index": 398, 
            "rating": 3, 
            "review": "After almost a year of living in the neighborhood and not giving 808 a shot at satisfying our sushi cravings, my wife and I stopped in for happy hour.  \n\nYou can't really go wrong with cold beer, and a table full of sushi rolls, both of which are half price every Saturday afternoon apparently. I'm not sure how I ignored this deal in my own backyard for so long, but I'm sure I'll be taking advantage of it pretty regularly from now on.\n\nWe enjoyed the food. Nothing too complex or fancy, just tasty rolls prepared fresh. Because the price was so good, we order many different rolls. Too many, in fact, to remember the names of my favorites, but all were worthy of my time.\n\nThe decor seems to be a peculiar cross between a modern sushi bar and a slightly upscale fast food dining room, but the atmosphere is comfortable. The staff is welcoming and seemed genuinely excited when we walked in.  \n\nIf you're in the area and craving sushi, this is a great place for a quick bite"
        }, 
        {
            "index": 399, 
            "rating": 3, 
            "review": "The food was good and the chefs were awesome. The service was why this place got a 3 star, they could do a lot better."
        }, 
        {
            "index": 400, 
            "rating": 3, 
            "review": "Came here with a Groupon, but went with Happy Hour instead. The food is relatively cheap during Happy Hour and worth it when you get it to go. Sadly,\nI dined in and ended up with experience worse than Hussein did when he got caught.\n\nBasically, we were ignored, waters not filled, and unbelievably pissed.\n\nI highly suggest coming to get food to go for Happy Hour! The sushi is more Americanized and the quality and taste is a little above other Hawaiian-sushi joints"
        }, 
        {
            "index": 401, 
            "rating": 4, 
            "review": "Luv it!  The ahi poke is the bomb. Too bad it's only one order per AYCE. Good island vibe.  Definitely will return for more."
        }, 
        {
            "index": 402, 
            "rating": 3, 
            "review": "haven't tried the AYCE sushi yet but i've heard a lot of good things about this place.  I had the mochiko chicken plate and kalbi plate to go and it was pretty puny for a plate lunch, maybe a sampler.  the mochiko chicken was all dry and tasted too much like uncooked flour.  the kalbi pieces were cut too thin and all burnt. the salad that came with the food was small and tasted ok. they do have a pretty good menu selection which is a plus so i'll probably give them another shot. they also have the kauai special sushi combination so i have to try it."
        }, 
        {
            "index": 403, 
            "rating": 3, 
            "review": "\"...808 bump, make you put yo hands up, make you put yo hands up ... (you can't touch this) .... Poppin' bottles in the ice, like a blizzard ...\"\n\nNo seriously, this hawaiian sushi joint is okay.  The half-price happy hour makes it worthwhile.  However, they really need to take it easy on the sweet-teryiaki sauce on their rolls.  The specialty rolls were drenched in this sauce.  Way too sweet.  If you go, ask them to not add any of this sauce on your rolls.  \n\nMoreover, this restaurant is on the AA dining awards program.  Six miles for each dollar spent.  $30 tab means 180 miles.  Shazaam."
        }, 
        {
            "index": 404, 
            "rating": 4, 
            "review": "This place is awesome! I really had my reservations about trying them out because these past reviews were extremely scary! So my good girlfriend and I love to try out different places for happy hour and we are some sushi lovers! So.. what do we do hop on yelp and look at some local places not far from where we live to go eat! 808 sushi pops up and we set our taste buds on it. The pictures didn't do justice! Everything we ordered was extremely tasty! I love the fact that they have the happy hour as a to-go option! AND the happy hour doesn't require for you to sit at the bar tops like most places which is another plus. Customer service was above par because EVERYONE speaks to you when you first walk in and when you leave. Sitting at the bar top watching the sushi chef prepare our food was actually pretty cool. He was very friendly and kept a good conversation going! We tried so much and I'd have to vote the 808 Rolla and the Tempura roll as my favorite! I will return for sure, especially because it's not even a mile from my house."
        }, 
        {
            "index": 405, 
            "rating": 3, 
            "review": "I like that the happy hour on weekdays last long so I didn't feel rushed to make it there. However, the selection seems limited even for the ayce. It's not the best sushi place in Vegas but happy hour is pretty decent. \n\nNote to bigger parties --they don't let you split the check which kind of sucks. So make sure to bring cash. I didn't know that beforehand but luckily, I had some on me."
        }, 
        {
            "index": 406, 
            "rating": 4, 
            "review": "We ended up here because my bf refuses to go back to Goyemon... and I wanted sushi.... but I didn't want AYCE (Oyshi and Kobe were the other options, but it was getting late and we had our 3-year old with us...didn't want to  deal with loud people and alcohol)\n\nYelp'd it on my BlackBerry (the app for the curve is terrible by the way) and decided to try it.\n\nThe server was friendly and quick and attentive. plus plus and plus.\n\nWe ordered the Tako Karaage, Garlic Chicken, and Deep Fried philly.... to start ;)\n\nThe fried philly was pretty standard... one of our go - to rolls at all sushi places.  I was pretty disappointed with the Tako.  I understand that octopus is a bit rubbery... but I just had to try it. Maybe they had found a way to  fry it with our overcooking it....nope.\n\nGarlic Chicken was super yummy.  My new favorite.  We love karaage.  The sauce that they dip this one is is delish.  Even our picky daughter ate it....and LIKED it!\n\n\nMy bf ordered a 2-item combo (Kal-bi and Chicken Katsu) that came with rice, miso soup and a salad....And dessert! mochi ice cream.... yum.\n\nI ordered a small Chirashi...and I tried to order my daughter a side of Chicken Katsu but the nice server lady said, \"thats a LOT of food...the portions are pretty big\".  I took her word for it.... even though we're pretty big eaters ;) haha\n\nShe wasn't kidding.  We ended up with a ton of food... we finished it all.... but there was a lot of it. And it was all delicious. \n\nDownside: they close at 10. Which sucks. because It's 9:56 and now I'm in the mood for the monster Chirashi...."
        }, 
        {
            "index": 407, 
            "rating": 5, 
            "review": "If you want to try authentic Hawaiian style sushi please come here.  I'm a regular here.  I love the staff very much because they are very kind.  The food here is so good. Make sure you take the Garlic Chicken and tiger roll."
        }, 
        {
            "index": 408, 
            "rating": 3, 
            "review": "Happy hour deals are pretty decent.  The happy hour rolls are smaller then normal, but still pack a lot of flavor.  Hot sake for a buck, and the staff is awesome.  Everyone is very helpful and kind.  The rolls like I said taste great.  Non happy hour the rolls are larger and still packed with great flavor.  Not the best sushi place around but tasty!"
        }
    ]
}