{
    "category": "Las-Vegas", 
    "entity": "La-Creperie", 
    "avg_rating_stars": 3.6557377049180326, 
    "review_count": 427, 
    "reviews": [
        {
            "index": 1, 
            "rating": 3, 
            "review": "Had breakfast here today.  The crepes are all around $10, give or take a couple bucks.  Three of us all had something different and there were no complaints.  Pretty decent coffee too.  Overall, I guess not a bad breakfast in Vegas for the money."
        }, 
        {
            "index": 2, 
            "rating": 5, 
            "review": "Came here almost every day while I stayed at the Paris. All the crepes were delicious!"
        }, 
        {
            "index": 3, 
            "rating": 4, 
            "review": "Wanting to get a quick breakfast in our hotel before hitting the pool, my friend and I decided to make our way downstairs to the crepe place. When we arrived, there was a line but not too unbearably long. The line however, took a deceptively long time. Once we finally got our crepes they were pretty good. My friend ordered the bananas foster crepe and I got the tomato and cheese crepe. Both of these crepes were very good."
        }, 
        {
            "index": 4, 
            "rating": 4, 
            "review": "Crepes... Nutella crepes! Situated in cute little Paris casino. \n\nI like how it's grab-n-go style... So you can sit and eat it in the neighboring sit down area, or walk and eat. \n\nThe crepes are all made fresh to order. This particular crepe was slathered in Nutella, dolloped with a generous amount of crème fraîche, and made me a happy girl. \n\nThere's no room for disappointment here!"
        }, 
        {
            "index": 5, 
            "rating": 1, 
            "review": "The cashier was very rude.  Keep asking to repeat my name then she shove the receipt & a pen toward me so I could write my name.  I just use Sofie as it was as easy name to use.  The person making the crepe was even worst.  She seem to throw thing every where & the crepe look very sloppy but it look nice once she add the wipe cream & chocolate syrup (I think that was the only good thing that came out of it).  When I eat it, it was not good at all.  It did not taste sweet at all & the strawberry was ver sour. I don't think I would come here again. Just hope that they would train service better."
        }, 
        {
            "index": 6, 
            "rating": 4, 
            "review": "Great selection, VERY tasty crepes and great location. There's plenty of seating and a bathroom close by.  We had a roasted chicken crepe with pesto and sun dried tomatoes. Great price, prepared quickly and it was affordable."
        }, 
        {
            "index": 7, 
            "rating": 2, 
            "review": "We were disappointed with our crepes. The crepes came out like super soft pancakes. They did not have the texture of a crepe at all. The service was super slow. Tables we dirty."
        }, 
        {
            "index": 8, 
            "rating": 3, 
            "review": "It's a fun snake when you're on the strip.  I often go here with friends to have the seafood one.  That's my favorite.  It is expensive, but one crepe is enough to fill you up.  I never buy the drinks though, I just have my bottle of water in my bag.  :oP"
        }, 
        {
            "index": 9, 
            "rating": 4, 
            "review": "4 stars for the food, 2-3 stars for the wait time.\n\nI arrived around 8:25am yesterday, and ordered a roasted chicken crepe for breakfast. (I REALLY wanted one of those delicious-looking dessert ones, but I had a busy day and didn't want to be in the bathroom all day later)\n\nI think I paid around 8:40 (and there were only like 5 people ahead of me in line, too) and FINALLY got my crepe around 9am. \n\nThat being said, the reason that it takes so long is that they make them fresh, so they are delicious. I will say I asked for no asparagus, though, and was told they couldn't do that, because they use a mix or something strange like that ... but it tasted fresh.\n\nThe roasted chicken one had chicken, asparagus, sundried tomatoes, I think onions, and a pesto sauce, and was pretty good. Price range from $9-11 or $12. \n\nI will say that my parents have been to Paris's \"Le Village Buffet\" before, though, and you can have made-to-order crepes there, so if you think you'll want more than just a crepe, you should check that out - they have both crepes and omelettes.\n\nI'll come back here next time I'm in Vegas, I want to try either the caprese crepe (savory) or one of the dessert ones, which looked amazing."
        }, 
        {
            "index": 10, 
            "rating": 2, 
            "review": "I'm a huge breakfast lover. I can have French toast, crepes, or omelets at all hours of the day or night. When I was told that the Paris had an amazing crepe place I practically started running toward it. But when I finally saw the restaurant I got kind of bummed. I was expecting an actual restaurant and not a walk-up stand. But after realizing that it's supposed to resemble the walk-up creperies in Paris, France I was okay with the idea.\n\nThe line didn't take too long (maybe fifteen minutes or so) but when we're all about to eat our left hands out of hunger, fifteen minutes feels like an eternity. Finally we got to the front of the line. The menu has several savory crepes with meats and cheese as well as dessert crepes with berries, whipped cream, and other sugary additions.\n\nI pretty much only like dessert crepes so my eyes lit up when I saw their abundance of fruits and sauces. I went with the Favorite crepe (with fresh berries, whipped cream, and topped with raspberry coulis). It was served to me at the pick-up counter on a cafeteria trey and a plastic plate. Lame. I then had to turn the corner and grab a plastic knife and plastic fork. Lame. Then came the really fun part; watching over people like hawks until a table opens up. The small seating area is just next door to La Creperie but it's open to anybody that wishes to sit there (surrounding snack stands, or people just giving their bunions a break).\n\nAfter a couple minutes, we snagged a table and began digging in to our lovely crepes. They were almost impossible to cut into. The plastic utensils, plastic plates, and plastic treys made the crepes slide about relentlessly. After finally wrangling the thing down and cutting it up I got to taste it. Sheesh. I now understand why people were telling us to go here. The crepes were fantastic. However, I was somewhat distracted while we were eating. Several Miss America pageant girls came in and sat at the table next to us, fully equipped with tiaras and sashes. Awesome.\n\nA tip after eating at La Creperie, go just across the walkway and pick up one of the humongous Eiffel Tower margaritas. You won't be disappointed!"
        }, 
        {
            "index": 11, 
            "rating": 2, 
            "review": "Paris. French Crepes. Good? \n\nJust ok.  Crepevine, a chain in San Francisco, makes better crepes.\n\nI will say the crepe itself, the pancake like dough part is awesome.  But either it had too much sauce or it was too salty.  One tasted like lasagna, the other was just salty with ham or something.\n\nNot eating here again."
        }, 
        {
            "index": 12, 
            "rating": 5, 
            "review": "Nutella crepe! A must have for the hubby and I when we visit vegas. Love the ham and cheese crepe for a savory salty fix."
        }, 
        {
            "index": 13, 
            "rating": 5, 
            "review": "Hands down the best crepe I've ever had! On my visit to Vegas so far I've been here twice and both times I've been extremely satisfied. They serve dessert crepes as well as savory crepes. I've tried a dessert crepe (Nutella) and a savory one (Ham and Cheese) both very yummy."
        }, 
        {
            "index": 14, 
            "rating": 4, 
            "review": "the crepes are HUGE! they aren't that cheap, but crepes everywhere aren't that cheap anyways. we got a spinach and mozzerella one (i forgot the name) and then for dessert, we got a strawberry one (again, i forgot the name). two crepes between 3 girls. we were super stuffed afterwards. halfway through, we were already full, but it was so good that we had to keep going! i would definitely some back here the next time we're in vegas!"
        }, 
        {
            "index": 15, 
            "rating": 5, 
            "review": "Best crepe's I have ever had.  I know that's not saying much to you because you don't know me but to me that's saying enough :P\n\nWe almost always stay in Paris or Ballys because of free rooms, and this always leads us to spend our hangover down in Paris.  Walla.  Crepes.  The line is always long but you can get some red beer or a bloody mary across the way to help you with your hangover.  They have breakfast crepes that have like eggs and bacon etc. in them (numerous varieties) or they have sweet crepes that are filled with fruit concoctions.  I hate deciding because I love sweet things more but know that the other stuff is better for me. They have scallop crepes and vegetarian crepes, you name it.\n\nThe crepes are huge, filled well and I've never been with anyone in our party who was disappointed.  Good stuff."
        }, 
        {
            "index": 16, 
            "rating": 4, 
            "review": "I LOVE this place. The dinner crepes are loaded with meat and cheese and quite tastey. The dessert crepes are amazing. Lots of good stuff insde and out. I would give it 5 stars, but it is a bit pricey at $10 per crepe."
        }, 
        {
            "index": 17, 
            "rating": 4, 
            "review": "My friend and I wanted to do a quick brunch before leaving Vegas and came across this creperie. A little tucked away but so cute and fits well into the Paris theme. \n\nSo this place serves some of the best crepes I have ever tried! I had the roasted chicken crepe (ask for extra pesto ) and my friend got the breakfast crepe. Mine was cooked perfectly! There were so many different flavor a going on and the pesto added the perfect touch to this already rich crepe. My friends crepe was OK (why she kept stealing mine hehe) \n\nI would've given this place five stars except service was not good. The lady at the register seemed irritated and was not polite. I think maybe eating one of these delicious sweet crepes may help her."
        }, 
        {
            "index": 18, 
            "rating": 2, 
            "review": "Almost goes without saying, but way overpriced (like most of the rest of the hotel restaurants).  Lemon curd crepe was skunky; tartness not well balanced. Pleasant staff."
        }, 
        {
            "index": 19, 
            "rating": 1, 
            "review": "As a person who is always on the lookout for new crepe spots, this one was a true disappointment. I actually yelped a crepe restaurant while we were on the strip and we purposely went to Paris only to go to La Creperie. You would think a crepe shop inside Paris hotel would be really pressured to perform up to a certain standard. All I can say was it was DEFINITELY not worth the price. \n\nThe crepes itself didn't stand out. Mine looked like it was literally thrown together. The whipped cream was sliding off the crepe and pretty much off the crepe and on the side by the time we sat down. The nutella was plopped on the crepe like as a splatter. The presentation was simply just ugly. \n\nAs for the service, I was appalled by how rude the lady was. I had asked if they had a crepe with strawberries and bananas, she said they could do the fresh berries with bananas. She then proceeded to tell me they charge for extra banana, which I was ok with. After getting my order however there were no banana. I asked her and she replied with \"oh you didn't order banana, you asked for nutella.\" I replied with an assuredness that I DID ask for banana and she continued to be rude saying I didn't. I couldn't believe it. So I walked away an unsatisfied customer. \n\nOverall, never going back there."
        }, 
        {
            "index": 20, 
            "rating": 5, 
            "review": "We got 3 different types of crepes to try out. The roasted chicken, the breakfast, and Nutella. All 3 were super delicious and highly recommend this crepe place!"
        }, 
        {
            "index": 21, 
            "rating": 2, 
            "review": "Crepes.... What's not to like / love about em?? \n\nThe GOOD : The Nutella crepe was yummy & worthy of 4-4.5 stars. Only reason why this review is getting 2 stars overall.\n\nThe BAD : The Ham n Cheese & Roasted Chicken crepe were nothing great & simply in the edible category. \n\nThe UGLY : They want $1 for 2 empty water glasses. WTF ? I didn't ask for bottled water. Just a couple of glasses to drink your tap water. Sorry sir - glass you pay for but water is free.\n\nThe END : I was carrying an empty tall glass which was once filled with Margarita. I went to the soda machine - stuffed my glass in there & drank a tall glass of FREE WATER.\n\nIf you own this place & are reading my review - STOP being cheapskates. You are virtually violating us with the prices - atleast give us a glass for water."
        }, 
        {
            "index": 22, 
            "rating": 2, 
            "review": "This used to be one of my go-to places when I came to Vegas. I had been eating crepes here as far back as 2003.\n\nI would have definitely given 5 Stars. Unfortunately they changed their menu within the last year or two. (Last time I was here was 05/2013) They no longer have the Fruits de Mer (savoury seafood,mozzarella/ mushroom crepe w/ bechamel sauce). It has been replaced with a subpar shrimp scampi crepe. They also replaced their pear/walnut/almond/Chantilly cream crepe with a pear/hazlenut/maple syrup/golden raisin crepe. Also subpar....the flavors just don't go together as well as the former. The raisins are very overpowering. Not to mention the size of the crepes has shrank significantly as well, while the price has increased. :( I guess the consolation is that it is still entertaining to watch the crepe being made. :/\n\nThere used to always be a super long line, no matter what time of day. Last couple times I came during lunch (11-2ish), and there was only me and one or two other people. I sadly will probably never come back....unless they bring back the Fruits de Mer! That was the best crepe I have ever eaten! ^__^\n\nAlways the optimist, I will pass by next time and glance at the menu, fingers crossed hoping that they bring back the old menu..."
        }, 
        {
            "index": 23, 
            "rating": 5, 
            "review": "The blueberry lemon crepe is divine if you love lemon curd. My son had the ham and cheese and it was equally as good. The seating is a bit hectic but it's worth it."
        }, 
        {
            "index": 24, 
            "rating": 5, 
            "review": "Berry crepe was sweet goodness.  I ate the whole thing all by myself.\n\nNeed I say more?"
        }, 
        {
            "index": 25, 
            "rating": 4, 
            "review": "I ate here Sunday Nov. 8th. I ordered the berry crepe and it was very tasty. I liked the fact that they put the berries and cream on top of the crepe instead of inside it. There was a little bit of wait and from what I could see there was one chef and one cashier/runner. But my food was still hot by the time I finally got it. The drink selection is limited."
        }, 
        {
            "index": 26, 
            "rating": 4, 
            "review": "C-R-E-P-E-S!! \n\nOne of my favorite places to go eat in Vegas is here!  I love crepes and this place satisfies my cravings. \n\nWhen in need for good food quick, come here (only during the non rush hours and non-holidays week).  They don't have an actual restaurant.  La Creperie is a food stand that has a large kitchen.   It is located in Paris.  You order the food at the cashier and just wait for your number to be called.  \n\nMy favorite crepes:  St. Louis ( prosciutto, cheese, basil with bechamel sauce) and the Napoleon (Lemon Custard with Raspberries, Blueberries, and Strawberries).  We also ordered one that had salsa on top, but I can't remember the name.  It was also really good.\n\nGood crepe:  Toulouse.  It taste like a Calazone. \n\nAll the crepes cost about $8-10.  The portions are HUGE.  My 3 sisters and I shared 3 crepes.  It was very very filling! \n\nCons:  When you go during a holiday week, expect the wait to be LONG.  We went during Christmas week and it literally took us about 40 mins just to order and get the food.   However, when I ate here during a non-holiday week, I got the food instantly (10 mins).  Also, there is a seating area right next to the stand, but finding a table and chairs is INSANE!! Honestly, it's like a whole new world... you see the ugliest side of a person.  There's so much tension and hostility when people are looking for a table and chair.  My family was lucky enough to find a table but just trying to get one more chair took 20 minutes.  Also, while you're eating, you can feel and see people lurking at your table and ready to grab your table once you are done.  It's like a jungle.  *Survival of the Fittest!*  However, please remember that I went here during Christmas week.\n\nOverall, I totally recommend this place!"
        }, 
        {
            "index": 27, 
            "rating": 5, 
            "review": "We stayed at Paris and ate here for breakfast, twice! These were pretty amazing. We had both sweet and savory crepes. The service was extremely helpful and thanked us for stopping by."
        }, 
        {
            "index": 28, 
            "rating": 5, 
            "review": "Ahhh finally a place that makes the best crepes!!\nWe had the banana nutella crepe and the apple crisp crepe. .. Every bite of that crepe was worth gaining that few extra pounds. \n I cant even describe how delicious these crepes were, you just gotta go and try it, but beware because they're addicting!!!\nDamn it, my mouth is watering, I need my crepes!!!"
        }, 
        {
            "index": 29, 
            "rating": 4, 
            "review": "Yay!  I walked from the Mandalay Bay (aka BFE) to Paris, just to eat the crepes New Years morning...the Nutella one had my name written all over it...\n\nA few weekends ago, my cousin who lives in Vegas took me here.. i had a savory crepe then with spinach/mushrooms.. YUMMY!\n\nIt's a quick bite... a crepe is around 9 bucks with coffee comes out to 12 bucks...\n\nI'm not into buffets and stuffing my gut until my intestines explode.  No siree, i'd rather not have to be on a goddamn treadmill for 3534343 more hours of my life.\n\n:)"
        }, 
        {
            "index": 30, 
            "rating": 1, 
            "review": "They changed the fricken recipes! the crepes used to be much better until the menu change after October 2012.\n\nMy favorite crepe used to be the apple crepe and they used to caramelize the apples and it would be warm. Now they have raw, sour, cold granny smith apples with the skins still on smothered in some cold caramel sauce. i guess they changed it because its quicker and cheaper.I actually returned the crepe and told them the new menu change sucks. Why do places always have to mess with a good thing?"
        }, 
        {
            "index": 31, 
            "rating": 4, 
            "review": "Precious little eatery. My mom and I shared the breakfast crepe and the bananas foster crepe. FYI... Little window across hall from la creperie they have $5 mimosas and bloody Mary's."
        }, 
        {
            "index": 32, 
            "rating": 4, 
            "review": "I've done it savory. I've done it sweet. Crepes are delicious, and I brought my friends back here on my last trip, and it was well worth it. This time I got the Monte Cristo crepe, which was both savory and sweet and so worth the ridiculous wait."
        }, 
        {
            "index": 33, 
            "rating": 3, 
            "review": "We just had a late breakfast  and wanted a little  something  around 1.00pm. . We tried  their banana  foster  crepe. Their were 5 people  in line but they were all waiting  for their  order  . The counter  person never asked me to step up. I thought  they were just slow . I finally  asked  the person  in front of me . Once I ordered. I waited  for my order  but  I had to go check  on the order three times. The crepes were good with plenty  of bananas not much flavor .again service was not good"
        }, 
        {
            "index": 34, 
            "rating": 5, 
            "review": "Discovered this place a few trips ago. Just want to say the crepes are amazing, fast and reasonably priced. Great for breakfast or lunch, heck even supper! Often times I don't eat much in Vegas, between the snacking and the drinking finding a convenient good meal is often tough. This place is a great go to place to have in your back pocket. Assuming I remember where it as after a good number of Bloody Mary's. Try it, enjoy it. I highly recommend this little gem!"
        }, 
        {
            "index": 35, 
            "rating": 5, 
            "review": "How have I not reviewed this place yet?\n\nThis is arguably my favorite stop in Vegas.  It's a special place for me, because on our first trip to Vegas very early on in our dating times, my now-fiancé and I must have eaten like 6 crepes from here.  I think I've tried nearly everything on the menu that isn't meat-y.\n\nThe crepes are $9.99 and come in sweet and savory varieties -- we mostly go with the sweet -- my favorite is the peanut one, but strangely I don't order it much due to its richness.  My second favorite is the D'anjou pear one with walnuts.  The apple one is the most basic, and they all come with this yummy whipped cream on top that melts into the crepe -- we get it on the side to save my stomach from lactose issues.\n\nThe one savory one I've tried is the one with ratatoulle and egg... very tasty and fresh.  I love that all the crepes are made-to-order and generous.\n\nThe only downside is the seating.  Except for the one time we showed up shortly before it closed,  we literally have to circle the eating area to the left of this place to be able to sit our butts down the second someone leaves.  Otherwise, you'll have nowhere to sit and enjoy your yummy crepe.  Overall, a cheap snack or meal."
        }, 
        {
            "index": 36, 
            "rating": 5, 
            "review": "Great selection of savory and sweet crepes. Place your order and wait for them to call your name. Good portions. Had the Nutella banana one with toasted hazelnuts....Amazing!"
        }, 
        {
            "index": 37, 
            "rating": 5, 
            "review": "I preferred this place over Le Cafe 200 feet away because of higher Yelp rating. It is inside the classy appearing Paris hotel. There was a line of people ordered crepes with all kind of filling. I ordered mozzarella tomato and it was very good. I also ordered grilled chicken with sun dried tomatoes to eat on the plane. Everyone was patiently waiting which was a good omen as any foody knows. The prices ranged between $8.95 and $11.95. The creperie is a tiny operation with a front person taking orders and two cooks. It is attached to much bigger bakery, the Boulangery. They  make fresh French bread , croissants, and tons of hot croissant-based sandwiches. Getting a table wasn't easy, but well worth total wait of about 20 minutes. Bon appetite!"
        }, 
        {
            "index": 38, 
            "rating": 4, 
            "review": "Expertly cooked crepes, reasonably priced (for the Vegas strip) and a good way to start your day. Coffee is adequate, service is counter-style, so you have to linger while they cook. Note that the creperie is a sideline of the larger Le Provençal restaurant and not shown on Paris Casino map displays and shares a seating area with La Boulangerie."
        }, 
        {
            "index": 39, 
            "rating": 4, 
            "review": "5 stars for food. 3 stars for the service and preparation. Great breakfast option if you have less that 30 minutes and your already staying at the Paris hotel where is located. We tried the 3 cheese and the Nutella, the Nutella was so amazing I could have ordered 3 more if there was room in my stomach. Good prices for Vegas and they offer a Total Rewards card discount. Would also make a great late night snack, think they were open till midnight."
        }, 
        {
            "index": 40, 
            "rating": 5, 
            "review": "This is an absolute must try for those who like crepes. I stop by here each time I go to Vegas. They have several sweet and savory crepes. So far I have tried the nutella, berry, shrimp scampi and ham and cheese crepes and like them all."
        }, 
        {
            "index": 41, 
            "rating": 4, 
            "review": "Yum, I love crepes and yes sometimes the line can be long. We got the special crepe (filled with strawberries, and blueberries). It was very good and we came when they weren't too busy. The seating was nice too, crepe in paris! It's pretty hard to mess up a crepe."
        }, 
        {
            "index": 42, 
            "rating": 2, 
            "review": "Ew. I am just judging one crepe (the vegetarian mushroom one with béchamel) but it was really, really bad. Not worth the line!"
        }, 
        {
            "index": 43, 
            "rating": 3, 
            "review": "Located inside the Paris Hotel & Casino this little crepe house offers a limited amount of items on their menu.  Nevertheless they offer good quality for the food they make.  La Creperie offers both savory crepes and dessert crepes.  Although the savory crepes are nice once in awhile for me, I mainly like to order the dessert crepes from here.  The Nutella Crepe is my favorite at La Creperie, I wouldn't want to get any other crepe but if I had to choose another, I would order the Banana Foster's Crepe.  Lines get long during peak periods.  I like to come between lunch and dinner times when the lines move faster and the lines are not long at all.  Whatever you do, try the NUTELLA!!!...if you visit La Creperie."
        }, 
        {
            "index": 44, 
            "rating": 1, 
            "review": "I asked them to make me a simple Nutella, Strawberry and Banana crepe, but they refused and said they can only make wants written on the menu! Like really??? Is it that hard to spread some Nutella, slap on some banana and strawberries?! Ridiculous!! Management needs to accommodate their guests more over here."
        }, 
        {
            "index": 45, 
            "rating": 3, 
            "review": "La Creperie is located at the Paris Hotel & Casino.  It's always tempting to stop here when we are passing through.  I've only given into the temptation one time though.  Actually, we stopped that time cause our niece and nephew wanted crepes, and there were no lines on that occasion.\n\nThey've got the usual crepe choices.  Both savory crepes and dessert crepes.  I always prefer the dessert crepes cause I am such a sweet tooth.  The prices are expensive compared to most crepes that I've had elsewhere.  Although, if you are a Total Rewards member, then you get a discounted price of 50 cents off.  Still expensive though.\n\nOur niece and nephew both enjoyed their choices while my wife and I thought our orders were just average.  Both my niece and I ordered the Nutella crepe which contained nutella, bananas, candied hazelnuts, cream, and caramel sauce.   She said she would give it 8 out of 10.  I thought that for the price, it was just average.  It tasted fine, but it should be priced 2 to 3 dollars lower.  Same for the other crepes that we ordered which were the mixed berries crepe and the ham & cheese crepe.  \n\nOverall, just 3 stars because the crepes are overpriced.  I know that we're on the Las Vegas Strip, but come on!  Well, obviously the prices do not hurt business cause they usually have people waiting to order at the window when we walk by.  Good for them."
        }, 
        {
            "index": 46, 
            "rating": 5, 
            "review": "I don't know anyone who doesn't like crepes, and La Creperie in Paris does them perfectly.  Sometimes you need a lighter side to vegas than the heffer status buffets or the man size steaks in every hotel.  What I like about La Creperie is the simplicity of it all.  You order, they make, they serve on a paper plate.  Nothing fancy about it.\n\nMy boyfriend and I shared the fruits de mer and favorite crepe.  The fruits de mer has succulunt shrimp and bay scallops covered in a \"lightish\" bechamel sauce (as light as bechamel can be).  The favorite crepe comes with a variety of berries along with a massive dollop of fresh whipped cream and powdered sugar.  It seriously comfort food done well.  We always come here on our trips to Vegas usually the day we're leaving, trying to minimize anymore gluttony we've experienced throughout our trip."
        }, 
        {
            "index": 47, 
            "rating": 5, 
            "review": "I've tried about half the menu and everything has been just wonderful.\nIt can get REALLY busy here at times, but anyone who has come from out of town to see me has agreed that it was well worth both the wait and the casino pricing.\nGood variety of sweet and savory, and their fresh berries have always been amazing. I have never seen such massive, juicy blueberries in my life as I got from here the last trip through."
        }, 
        {
            "index": 48, 
            "rating": 4, 
            "review": "Great crepes. The price is steep but it is Vegas! I rally do like the Ham and Cheese crepes. They are freshly made and done right. Very filling to start your day. They can only produce 4 crepes at a time so the wait can be long. I never waited more than 15 minutes for my food. The line can get a bit long but good food is worth waiting for! They can only produce 4 crepes at a time so the wait can be long."
        }, 
        {
            "index": 49, 
            "rating": 5, 
            "review": "Worth every penny! As soon as you walk up to this place you can smell the sweet aroma of the crapes in the air. Your nose sends an instant message to the brain that you cannot live without a taste of that sweet melt-in-your-mouth deliciousness! This is a place worth the walk and the time. Go here!"
        }, 
        {
            "index": 50, 
            "rating": 4, 
            "review": "#61/2016\n\nThe line of customers didn't move that quickly and while the cooks hustled, I wondered why it looked like they were busy assembling a meal at a 1-star Michelin restaurant. \n\nSo much activity for crepes? Crepes are simple & fast to prepare.\n\n(I wonder if someone didn't show up and do the prep work?)\n\nAt any rate, the crepes were good. I had the breakfast crepe with roasted turkey, red onion, béchamel and avocado, hit the spot.\n\nMy little boy had one that was all sweet and whipped cream, etc. I tried to redirect him to something with a protein but he was on vacation, why not. \n\nSeating, while plentiful, was in a drab, dark room. I wondered if they could lighten it up, add some \"Parisian street charm\" if you will, so you didn't feel they were saying,\n\n\"Finish your food and get...out.\"\n\nHa ha ha.\n\nBottom line: The Creperie has food that's alright."
        }, 
        {
            "index": 51, 
            "rating": 4, 
            "review": "Savory and sweet yummies....\n\nLocated towards the back of the Paris Hotel, past the casino.  It's kind of like a little stand tucked in between other little shops, kind of across from the buffet.  I wouldn't say these are the best crepes in the world, but for being right on the strip (and maybe the only one?) these crepes do the job for me.  I always try to stop by for lunch whenever I\"m in town.  They have a communal area to sit next to La Creperie window.\n\nYah theses medium sized crepes are almost 10 bucks, but it's Vegas and at least they will fill you up.\n\nThey have a decent selection of savory and sweet crepes.  I always go for the Bayonne:  prosciutto and mozzarella topped with  bechamel and basil for the savory, and the nutella and banana for the sweet :-) Deeelish!"
        }, 
        {
            "index": 52, 
            "rating": 3, 
            "review": "Really an oasis among the chaos. It wasn't too busy at all, and tucked into a quiet little alcove. Good crepes, loaded with ingredients. I got the chicken and I was pleased. Quick service, no line. But really, the best part was being away from the crowds. Would come back if I were in the area and nothing else looks appealing."
        }, 
        {
            "index": 53, 
            "rating": 4, 
            "review": "The crepes are good. The kids shared the nutella and bananas while the wife and I shared the bayonne.   I'd get the bechemel on the side next time; very creamy with very little flavor."
        }, 
        {
            "index": 54, 
            "rating": 1, 
            "review": "Getting a quick breakfast on \"The Strip\" can be a bit challenging if you aren't looking for a full-service restaurant. That's why I was excited to learn about La Creperie.\n\nI ordered the Bayonne with \"imported prosciutto, mozzarella, fresh basil, top with bechamel.\" After a surprisingly long wait, out came a folded crepe with HUGE chunks of incredibly, overpoweringly salty prosciutto inside, a small amount of melted cheese, and a few sprinkles of shredded basil on top.\n\nI love salty food, but I could barely handle the massive amount of salty prosciutto in the crepe, especially compared with the mere token amount of barely basil. And the bechamel was just an added layer of gross.\n\nEpic fail."
        }, 
        {
            "index": 55, 
            "rating": 3, 
            "review": "3.5 stars for this place. Nothing fancy here, almost like fast food as it shares seating with a pizza place and something else. I had a ham and cheese crepe and it was pretty tasty. Quality ham and quality cheese. The usual casino price about $2-3 higher than it should be.  Hit the spot though as I was hungry.\n\nVery nice and friendly lady working the cash register."
        }, 
        {
            "index": 56, 
            "rating": 4, 
            "review": "AWESOME! Im not even a crepe person.... which may be a good thing for this review or bad... but I usually feel crepes are just ok, nothing special. \n\nBut these crepes! \n\nMuuuwwwaaaaaahhh! Delicioso! (oops thats Spanish) Well, whatever the word is in French for an Effffff AMAZING taste ... that's the Napoleon Crepe here inside the Paris Hotel and Casino. \n\nYUMMM YUM!"
        }, 
        {
            "index": 57, 
            "rating": 4, 
            "review": "I wasn't sure what to expect from La Creperie, but was pleasantly surprised.  I don't normally likes crepes, but my wife and her sister were insisting we try this place.  We ordered the Forestiere  (Sauteed spinach, Mushrooms, cheese and topped with Bechamel) and Fruits De Mer (Seafood crepe) along with 2 savory crepes (don't recall the names, but it was one with berries and such in it).\n\nWe enjoyed this meal quite a bit and the price was nice for the location it's at and the quality of the food.  We were stuffed, and payed a fraction of the cost and had a fraction of the wait than those who were waiting for the buffet just across the way."
        }, 
        {
            "index": 58, 
            "rating": 4, 
            "review": "The crepes sweet and savory are pricey but so good.  $7-10.  Two favorites, Berry and the Mont Blanc.   Mont Blanc had pears, nuts and whip cream and caramel."
        }, 
        {
            "index": 59, 
            "rating": 4, 
            "review": "have a crepe in paris :) You can get full off of one crepe! with strip prices I feel like the prices here are reasonable. Go to paris and have the france experience yay! Good, fast and affordable!"
        }, 
        {
            "index": 60, 
            "rating": 3, 
            "review": "Crepes made fresh to order.  My hubby and I ordered two crepes, \"The Favorite\" which had fresh strawberries, blueberries and raspberries and the \"Rum Banana\" which had sliced bananas that were cooked in rum.  The Rum banana was awesome! It was like having bananas fosters inside a fresh, hot crepe.  Very delicious and highly recommended.  \"The Favorite\" was not really my favorite, ironically as it was way too tart.  Presentation wise, \"The Favorite,\" was beautiful and looked delicious to eat, but like I mentioned, it was too tart and the crepe was overdone (as in crispy).  Totally disappointing.  \n\nThis place is pretty pricey in my book, the cost for both crepes came out to $21.60!  OUCH!!!  If we ever come back, which I doubt we will, I think we will stick to ordering the \"Rum Banana.\""
        }, 
        {
            "index": 61, 
            "rating": 5, 
            "review": "Yums~ I love this place! Despite there being countless restaurants in Vegas, I came back here for a 2nd time before returning home. Both the savory and dessert crepes are delish."
        }, 
        {
            "index": 62, 
            "rating": 4, 
            "review": "They have unique menu for crepes. One of those is the spinach artichoke crepe that is absolutely fantastic. Their banana nutella crepe is too sweet though with not enough bananas. We have also tried their pastrami reuben which is $14,not as good as the one in Gandolfos. But overall i will definitely return for the spinach artichoke crepe."
        }, 
        {
            "index": 63, 
            "rating": 5, 
            "review": "Everytime I am in Vegas, this is my must have food either for breakfast, lunch, or dinner.  Depending on the time of the day, sometimes I get the savory with cheese and spinach or fresh berries.  Which ever are so good.  It's pricey, over $10 for French crepe, but then again you are in Vegas.  The portion is rather huge, be hungry when you order one or get one to share."
        }, 
        {
            "index": 64, 
            "rating": 3, 
            "review": "I needed a last-minute place to grab breakfast, and this place offered a quick bite. I had the ham and gruyere cheese crepe (with bechamel sauce on top) and a bottle of water -- and it came out to more than $16. \n\nDefinitely do not order a bottle of water for $3.50 when you can get it cheaper at the other places inside Paris -- even saw it for $1. If I had gotten coffee instead, it would've been $6 cheaper? I don't get that.\n\nThe whole French cafe vibe is crushed when you're served cafeteria style. If it's a cheap place, fine, but this isn't cheap. The crepes did come out super quick, but the cafe was slow around 8 a.m. Saturday.\n\nThe crepe itself, yes I got the savory, was way too salty. Can they do half savory and half sweet? Because they should."
        }, 
        {
            "index": 65, 
            "rating": 5, 
            "review": "The Nutella crepe is a must have whenever I come to Vegas. If you are eating with someone else try one person get a savory crepe and the other get a dessert crepe."
        }, 
        {
            "index": 66, 
            "rating": 4, 
            "review": "Not too bad crepe place in the Paris hotel & casino. I'm not a big fan of the food type crepes but the dessert crepes were pretty good."
        }, 
        {
            "index": 67, 
            "rating": 3, 
            "review": "Wow some of these people must have gone during the weekday when Vegas is not so crowded. B/c our visit here consisted of waiting in a HUGE line to order, waiting till eternity with a crowd of people keeping an ear out for our order numbers and take turns to hunt some seats down while the other person continues to listen out for your order number. I dont' know if one of the cooks called in sick that day but our food took REALLY long.\nThe food...The fiance and I ordered a savory for each of us a shared a sweet crepe. The berry sweet one was waay too sour. It needed something sweeter (other than the whipped cream) to balance it out. \nOverall, the crepes were eh...I've had better. I'd say if the line is more than 7 people, skip it."
        }, 
        {
            "index": 68, 
            "rating": 3, 
            "review": "solid 3.5 stars, good to have sweet or savoury crepes as it's compatible any time of day if u think about it but i digress.\n\nordered the Banana Fosters, without any Nutella for once, instead a rum whipped cream, yummy.  same for the ham and cheese, and for almost $11, well worth the quantity of meat.  plus a cream sauce, sprinkled with some sprouts.\n\nbut the texture of crepe made nice too.\n\nif u r in a rush, wasnt worth the 15min wait 11:30am lol"
        }, 
        {
            "index": 69, 
            "rating": 1, 
            "review": "La Craperie is the moniker that this place truly deserves.\n\nYou'd think that the Paris Hotel would have a great place to get a nice dish of crepe, but like some of the fake shit on the Strip this wasn't the case.  \n\nThe line was miles long and that got me excited.  I was thinking, \"Fuck.  All of these people can't be wrong.  They are waiting for a crepe in the Paris Hotel of all places.\"  Seating in this area is a bit of a reach because in the same vicinity lies a confectionery serving chocolate, the omnipresent buffet, and several high end restaurants.  \n\nThe Toulouse was my crepe of choice.  I had to wait another 20 minutes or so because there was only 2 crepe makers (Some advice for the legion of owners of the Paris Hotel who might be reading this review. Make the place bigger, or move it to a different part of the resort).\n\nMerde***.  This crap, um crepe was horrible.  The pancake part resembled a tortilla.  If I wanted Mexican, I could have gone elsewhere on the Strip.  The pizza like filing was like what a former co-worker described....gahbitch!!\n\nOne last note.....when one of the crap makers was making our crepes, some of the filing from the various crepes landed on her fingers.  Instead of wiping it off with a towel, she audibly and overtly slurped it away and proceeded to finish our crepes.........  \n\nI didn't know that culinary arts degrees were awarded from gumball machines.\n\n***Note:  Merde means 'shit' in French."
        }, 
        {
            "index": 70, 
            "rating": 2, 
            "review": "When you dine at a crepe place in a hotel that puts \"Le\" in front of everything in order to seem more Parisian, you don't expect much for a reason. (if you can't tell, I'm not a huge fan of the Paris Hotel. In a city full of cheesy theme-park hotels and casinos, this is probably one of the cheesiest)\n\nNeedless to say, Le Creperie met my expectations: overpriced food for sub-par quality."
        }, 
        {
            "index": 71, 
            "rating": 2, 
            "review": "scenario:\n\n-walk up to the counter\n-select from either 8 sweet or 8 savory $9.99 crepes\n-wait for your number to be called\n-walk your crepe over to a table and enjoy, or not...\n\njust like arwen, i LOVE crepes. my friend and i used to take late night trips to Q-Cup in Milpitas for a delectable crepe and boba. \n\nmy most favorite crepe is a strawberry and banana crepe. i LOVE fruit and i LOVE it in a nice flat pancake! at La Creperie the fruit is either frozen or canned. whatever it is, it's not fresh and overly sweetened, you can taste the preservative...\n\ni will say they give a generous serving of fruit, but i ended up throwing half of it away. it is not worth $10 and i have enjoyed yummier crepes at chain tapioca places?!?! come on paris hotel! i will not be going back..."
        }, 
        {
            "index": 72, 
            "rating": 4, 
            "review": "This place is great for something quick. The crepes are $10, and if you want to maintain your buzz, you can get Bailey's for your coffee. I had the Bayonne, and woowhee! I was stuffed after about half the crepe. There's proscuitto in there that gives just enough of a salty taste, and enough cheese to coat the whole damn crepe. \n\nI want one. Right now."
        }, 
        {
            "index": 73, 
            "rating": 4, 
            "review": "I don't know why this place gets a bad review, I think they have ginormous crepes (for a Vegas price, of course), and the crepes are delicious and have tons of filling in them. Although I've only had the sweet kind, I can't say that I've found a crepe place that tastes bad enough for 2 or even 3 stars.\n\nLocation is a little questionable next to the bathrooms and finding a seat sometimes can be difficult, but the service has always been prompt and relatively friendly (as friendly as Vegas gets).\n\nMy favorite crepes are the banana ones :)"
        }, 
        {
            "index": 74, 
            "rating": 1, 
            "review": "Very bad first impression. Like several other \"stores\" inside Paris Las Vegas, the counter is facing the \"street\". You walk up to window, order, and are served. Would work great is not for the incredible slowness the staff today displayed. From the time I entered the line to order until I received my crepe, 30 minutes. When I did get it, they didn't have trays which isn't terrible except I still had all of my luggage since I was 20 minutes before 2 and I had a cup to fill my drink. So, 30 minutes for an overpriced crepe, poor service when they could obviously see I had a handful, and poor overall demeanor. Definitely a single star visit...."
        }, 
        {
            "index": 75, 
            "rating": 1, 
            "review": "Had the breakfast crepe and it made me sick. The bechemel was good and creamy but I think the egg just got me. Stayed in the bathroom for a good hour. Service sucked. They first gave me my Buddy's crepe. And they gave me some one else's plate when they realized they made a mistake. Tables weren't as clean as I hoped. Overall worst experience of my Vegas trip."
        }, 
        {
            "index": 76, 
            "rating": 4, 
            "review": "From my first bite on my very first trip to the Paris Hotel, I have been a fan.  The crepes are yummy. Sweet ones, savory ones, they are all delicious.  They are pretty big too, I like to split one with someone.  \n\nThe service is not the best. This last time I was there, the woman taking my order hardly looked at me.  I could barely hear her, and since she wasn't looking at me, I couldn't tell if she was talking to me or the woman behind her making the crepe.  Whatever frustration I was feeling from the service, all went away when I took my crepe to a little table to enjoy (with my $4 bottle of water).  \n\nThe good part is since you order your crepe from the little window, you are only dealing with the mediocre service for just a few minutes.  Then, you are left to enjoy the mouth-watering crepe.  YUM!"
        }, 
        {
            "index": 77, 
            "rating": 1, 
            "review": "Worse Crepe I ever had. The man doing the crepes was very sloppy and careless. I ordered a Nutella crepe and it looked as if he had to scrape the Nutella out of the bottle. The whole top half of the crepe didn't have Nutella. On top of that its expensive. Never again."
        }, 
        {
            "index": 78, 
            "rating": 3, 
            "review": "Tried the shrimp scampi and it was pretty good. Saw him making a butter and sugar one topped with berries and chantilly cream that loooked good. Minus one star for register girl and cook chatting half the time and taking over twenty minutes to get the food out even though there were only a few orders before me."
        }, 
        {
            "index": 79, 
            "rating": 3, 
            "review": "Crepe again?  What is wrong with me?\n\nI went to Paris hotel to try its crepe.  I remember getting the crepe many moons ago but it was just okay.\n\nGot crepe toulouse.  It's crepe with marinara sauce with sausage and some other meats.  It was good.  \n\n3 stars!!\n\nLa Creperie is kinda yummylicious!!"
        }, 
        {
            "index": 80, 
            "rating": 5, 
            "review": "crepes made with care and precision. Quick turnaround, too.\nThis isn't a waitered place -- you place your order and wait for them to call you name. \n\nSweet and savory, they're all delicious. I had the apple caramel crepe. My friend had the ham and cheese. They accidentally gave him a tomato and onion at first, which they let him keep once they quickly realized their mistake, so we both were able to sample 3 crepes total. They were all delicious.\n\nBig servings, perfectly executed, and delivered quickly. This place is a gold mine!"
        }, 
        {
            "index": 81, 
            "rating": 4, 
            "review": "Quick and delicious. I had the three cheese crepe which was savory and flavorful. Decent prices by Vegas standards."
        }, 
        {
            "index": 82, 
            "rating": 2, 
            "review": "Maybe I'm spoiled with having tried crepes in France but this place brought me down a little.\n\nMy girls and I were very excited to have breakfast at this place on our first morning in Las Vegas. Sadly, we were met by a long line which did not seem to shorten at all, thanks to only one working cook and two crepe grills. Assuming that every customer orders 1-2 crepes each, it is not surprising that the service was very slow. I ended up waiting for 15 minutes to get one crepe. \n\nThe portion is pretty general, though. One crepe is definitely split-able between 2 people. \n\nMoreover, I think they lack some serious variety of crepes. There are only about 6 kinds for each of the sweet and savory crepe categories. And none of them specifically sounded appetizing to me. I ended up ordering one sweet and one savory crepes.\n\nGranted that it is very hard to screw things up with chocolate, this place has miraculously produced crepes that were too sweet and creamy for my taste. I felt a bit queasy afterwards. \n\nNothing was absolutely terrible, but the service could have definitely been faster. But would I pay $10 to eat at this place again? Probably not."
        }, 
        {
            "index": 83, 
            "rating": 5, 
            "review": "Long wait but worth it. We had an Italian crepe and a mix berry and they were both great! Good prices for vegas strip too."
        }, 
        {
            "index": 84, 
            "rating": 3, 
            "review": "We were recommended to try the Crepe's out here by my hun's parents who raved about it. \n\nWe ordered their Seafood Crepe and the Berries Crepe. Both were nice but not anything to \"die for\" IMHO. I think I've had better or at least \"just as good\". The line is long but then again, it seems everywhere you go in Vegas has long lines and so it's worth trying."
        }, 
        {
            "index": 85, 
            "rating": 3, 
            "review": "We haven't done crepes in a while so when we happen to pass this spot we were excited.  The line was really long so we were hoping it would be really good.  The prices were on the higher end so we were also hoping the taste would justify the cost.  \n\nMy boyfriend ordered the St Louis and it was ok.  Just simple ham and mozzarella cheese in a crepe smothered in some type of white sauce.  I ordered the Fruits de la Mer and it was a little more tastier.  It consisted of shrimp, scallops, cheese and also smothered in a white sauce.  \n\nFinishing it off we ordered the Nutella savory crepe.  Now that was hella good!  It had nutella, whip cream, and drizzled in chocolate sauce.  If we weren't so full I would have ordered another one.\n\nFor the price that you pay, it's ok.  I would suggest to stick to the savory crepes.  I don't see going wrong with them as you may be disappointed with the others."
        }, 
        {
            "index": 86, 
            "rating": 3, 
            "review": "Face it, do you really go to Vegas to get a crepe? I didn't think so. You're probably like me and Jamie. You're probably staying at the Paris Las Vegas on a weekend discount package. You just saw Cher at Caesar's Palace and was wondering how a 63-year-old woman can have the body fat of a ten-year-old on a weight-gain program. As you come to realize you should go to bed with that question weighing heavily on your mind, you respond to a moment of weakness and come here. \n\nIt's open late, well late for me, not for Vegas. 11PM. It's fairly quiet at this hour with the faux-Paris hallway with only a smattering of drunken tourists. The main dining room is closed, so you just walk up to the kiosk and order. Jamie and I split a $8.99 \"Favorite\" which was all sort of berries hidden under a large folded crepe. Lot of whipped cream, powdered sugar and berry puree oozing all over it (see my photo). In other words, it hit the spot. We sat in the dining area adjacent to the place and were perfectly content to discuss whether Cher has ever ordered one of these. \n\nCREPE - 3.5 stars...no great culinary art but it does satisfy a late-night sweet tooth \nAMBIANCE - 3 stars...well, it's Paris...sorta \nSERVICE - 3 stars...they're pretty much on autopilot at this hour so don't expect frills \nTOTAL - 3 stars...so I was hungry at 11PM...so what?"
        }, 
        {
            "index": 87, 
            "rating": 5, 
            "review": "They have the best Nutella crape I EVER had ;)\nIn a long time , found inside Paris Paris Casino\n\nUpdate \n7-17-15\n\nOk, since I came back to Vegas, I had to hit this crape joint again. I decided to try something new: \nThe blueberry crape.\nIf the Nutella crape I tried last time was the best I ever had, this is even better. I think the fruits are organic, and the mix of warm crape, cold cream on top and the very tasty blueberry, mulberries and strawberries mixed all together will leave you impressed for sure. Try it out, it's not a common crape place that tries to impress you. I let you, the reader be the judge. If you know of something better message me ;)\n\n11-9-15\n\nStill the best grapes I had so far and they are expanding the menu.\nThank you Liliana."
        }, 
        {
            "index": 88, 
            "rating": 4, 
            "review": "Yeah, those crepes are delicious. I don't even really like crepes, but damn was this a good choice for a late breakfast/early lunch. It didn't hurt that I got to hang out with a bunch of fans in town for the Iron Maiden concert while eating."
        }, 
        {
            "index": 89, 
            "rating": 3, 
            "review": "This was my third visit and while the Crepes were as good as I remembered, the service was terrible. There were three women working and they appeared to not really care  how long the line was or if they gave you the wrong food. One of the cooks roiled her eyes at the customer who said the crepe was not the one he ordered and he wanted what he ordered. \n\n$25 for two Crepes, ham and cheese and chicken. Chicken one was a surprise to be as good as it was.   We could easily have shared one and i was pretty hungry.  \n\nI would definitely order again and only giving three stars due to the service."
        }, 
        {
            "index": 90, 
            "rating": 3, 
            "review": "Located inside the Paris Hotel, I was here yesterday with my girlfriend from out of town and wanted to grab a little nibble, so we shared the St. Louis Crepe which was ham and cheese with the Bechemel sauce. It hit the spot it was tasty but the ham was deli-like and the sauce was too thin -we ordered it on the side. \n\nI think what bugged me the most was paying $4 for a tiny bottle of water-what a rip-off! \n\nFood was done quickly but not sure I would go back. The last time I was there was like 8 yrs ago and I think quality has gone down for sure."
        }, 
        {
            "index": 91, 
            "rating": 4, 
            "review": "I had the Napoleon crepe...I can totally say that I love the berries and the sweetness was just right."
        }, 
        {
            "index": 92, 
            "rating": 4, 
            "review": "Great crepes! They have a very small menu with different types of crepes. My fave is the one with the pears! YUM! Even the spinach one! The Bayonne one (proscuitto, cheese, basil) is one of the most popular ones there. They make it fresh before you. Some lunches can be busy."
        }, 
        {
            "index": 93, 
            "rating": 3, 
            "review": "My friend, Deb N., recommended this walk-up window eatery to me while I was sojourning at Bally's. Bally's, for the uninitiated, is linked to the Paris hotel and casino by a charming \"pavilion\" of shops and eateries.\n\nFor the thousands of you who don't know me, my mother is Swedish. From Sweden. This means Swedish pancakes! Swedish pancakes are exactly the same thing as French crepes, but not as \"frenchified.\" So, I'm used to simple presentation and simple fillings.\n\nI was eager to check it out, though. And I couldn't help but branch out (they didn't have a listing for a jelly-filled crepe...) so I ordered the Nutella Crepe. This was the hazelnut paste with a chocolatey goodness layered inside the crepes, while the whole thing was topped off by chocolate sauce, powdered sugar and a dollop of whipped cream.\n\nBackground: I had been congested and dreary, sans appetit, for 36 hours. Well, this plate of goodness cheered me right up! Zut alors!!! Sacre bleu!\n\nIt was yummy, potentially messy and I ate the whole thing."
        }, 
        {
            "index": 94, 
            "rating": 4, 
            "review": "Delish! But new friend Lisa couldn't finish her sweet one!\n\nI stopped in here with my (then) boyfriend when we visited Vegas back in ought-six. The crepes were so memorable that I knew I'd be back the next time I was in town. It took me six years, but I made it, the crepes were still wonderful and the prices were still reasonable. (In my opinion. If you are looking to stuff yourself silly for a few dollars more, there is a buffet across the hallway.)\n\nThis little place is in the mall portion of the Paris LasVegas Hotel & Casino. Walk up to order, and grab a table in the seating area off to the side. The ingredients are simple, delicious and filling. I was alone this time, and made friends/shared a table with another solo diner in the seating area."
        }, 
        {
            "index": 95, 
            "rating": 3, 
            "review": "Good savoury crepes, okay desert crepes. Bananas tasted old/soft. Presentation could be improved."
        }, 
        {
            "index": 96, 
            "rating": 5, 
            "review": "I love their crepes.  For a tourist, this is a great stop for a fast breakfast and lunch.  Dinner is also possible but I wouldn't recommend it.  It's not filling enough.  This is also a great spot for a snack.  You can never go wrong with a crepe.  \n\nIt's inside the Paris Hotel and Casino.  They have some chairs and tables.  If you have a big group and want to put all the chairs and tables together, be prepared to be using your muscles, if any.  The crepes range from dessert to a gourmet kind.  I've had the Nutella flavored crepe, Berries crepe, and also the omellete.\n\nIt's so much better than fast food, even though you get it fast."
        }, 
        {
            "index": 97, 
            "rating": 2, 
            "review": "I'm a fan of crepes, so my husband and I tried La Creperie in the Paris hotel. We arrived mid-morning on a weekday, so the line was short and sufficient seating was available. However, I can see how the seating area would fill up quickly on a weekend.\n\nLa Creperie has both sweet and savory crepes, though not a large selection of either type. All crepes are $9.99 each plus tax. We ordered the \"Favorite Crepe\", which has blueberries, strawberries and raspberries in a raspberry coulis, and the \"Bananas Foster Crepe\", which has bananas sauteed in dark rum. \n\nThe crepes were served on a fairly flimsy plate, which was okay, but the plastic knife and forks were ridiculously small (the cheapest you can find, you know the ones I'm talking about). I'm okay with disposable utensils, but the ones at almost any fast food restaurant are better. Each crepe came with a generous scoop of whipped cream. I tasted both flavors, and they were both okay, but not great. Also, the crepes got cold rather quickly.\n\nI might try this place again if someone recommended a better flavor and I brought my own fork."
        }, 
        {
            "index": 98, 
            "rating": 5, 
            "review": "I always come here when I come to Vegas! Instead of getting a dessert crepe I got a savory one today! The ham and cheese, but I wanted breakfast so they added eggs for a $1.29! So yummy!!!"
        }, 
        {
            "index": 99, 
            "rating": 2, 
            "review": "The only positive thing I can say is that this place is one of the less expensive options for breakfast. I ordered the Napoleon and I could have made a better crepe myself - and I'm not even a good cook! It was made with frozen berries that tasted like rubber. Will not be coming back here. Le Village Buffet right across from La Creperie must have a long line for a reason."
        }, 
        {
            "index": 100, 
            "rating": 3, 
            "review": "Crepes in the Paris. NAWWWWWW!!! SHOCKER!\n\nMe and 7 of my girlfriends stopped by La Creperie on the recommendation of one of our group. Usually I like as little fuss as possible with my crepes, so I was a little disappointed not to see a plain old butter and sugar on there, though I also didn't ask if they would make one to try it out. Not even a crepe suzette! I had the D'Anjou - a pear, almond paste, caramel, whipped cream and walnut concoction\n\nThe pears were so-so and mixed with the paste, produced a not super flavorful milky juice that kinda grossed me out and the whipped cream was a bit \"cool whip\" tasting. I did manage to make it almost all the way through, however because the crepe itself was delicious.\n\nMy friend had the seafood crepe, which I got to when it was a little cold. It was buttery and I imagine very good warm, but the bechamel sauce on the top was a little floury. \n\nI'd go again, but I'd order butter and sugar or strawberries."
        }, 
        {
            "index": 101, 
            "rating": 4, 
            "review": "I am a chocolate freak & LOVE CREPES!\nUsually, I try to avoid LV strip because of the traffics on the road (especially during the holiday weekends-.-;;;).  But I've been craving for good crepes for a while, this time I had to go & eat it no matter what. I was driving to Paris HTL &  it was on July 4th wknd, haha!\n There I was ordering \"Nutella\".. Soooo Tasty!!!  A great amount of warm chocolate hazelnut melted down on the plate, finished with whipping cream & powder sugar, Amazing Amazing!,  \nI was very satisfied."
        }, 
        {
            "index": 102, 
            "rating": 3, 
            "review": "I'll start this review by saying, you come for the crepes, not for the service. That being said. I like this spot for a quick crepe while walking around. I think it is one of those must hit places when we come to Vegas. I have to thank my wife for that, she is the crepe connoisseur. They don't skimp out on the toppings, that is to say that even though we've been here several times, we only get the fresh berry crepe. I can't speak on any of the savory crepes, they have quite the menu, but for us it's fresh berries, or I believe we got Nutella and banana once, also very good. We like to walk over here and grab a crepe for dessert and walk around. If you like crepes, this isn't a bad choice!\n(Yelp LA Challenge #25 of 100)"
        }, 
        {
            "index": 103, 
            "rating": 5, 
            "review": "Without the Creperie we would have died. The line for the buffet was so long at one point we actually got in it, I went to get coffee and then we said \"screw escalation of commitment..we are out of it\" then we found the Creperie. I only ate one the entire weekend, but then again I wasn't in Vegas to eat. My girlfriends however.. spent more on crepes than gambling. Good times, good food. I loved the one with the ham and the Bechamel sauce. They have sweet and savory depending on what time of day it is.. ha ha. It doesn't matter what time of day it is, 'cause it is Vegas, and even if you are a stay-at-home mommy with two kids.. you can go to Vegas for a weekend and stay up all night long two nights in a row, partyin' like a RockStar and sustaining yourself on crepes and champagne. Thanks for getting married Nancy!"
        }, 
        {
            "index": 104, 
            "rating": 5, 
            "review": "My husband and I love this place they make the most amazing crepes every time we come to Vegas we have to come here.\"\nToday we ate the breakfast one it has ham, cheese\nRoasted chicken."
        }, 
        {
            "index": 105, 
            "rating": 2, 
            "review": "The food quality was pretty poor. Prime rib was under-cooked, pork was hard as a rock, all potatoes except the mashed kind were not enjoyable. Service was good, that's the only bright spot. Won't be coming here again. There are better options for $33 per person."
        }, 
        {
            "index": 106, 
            "rating": 3, 
            "review": "huge fan of crepes and we had to try this place when we stayed at the paris.  it's a lil window that you go to and order your crepes...their made fresh in front of you.\n\nwe ordered the bananas foster and the strawberry and added a little nutella.  \n\nthe crepes were good, loaded with fruit and very indulgent, but one would have been good enough for us to share, we ordered one for each of us and we wasted so much of it.\n\ni would have gave it  4 stars but we waited FOREVER to have our crepes made...  good thing we had a room to bring it up."
        }, 
        {
            "index": 107, 
            "rating": 5, 
            "review": "EveryTIME we go to Vegas we make sure to eat here. They make the best crepes. It is perfectly cooked and you will not go wrong on whatever you choose. We usually get Nutella with banana and another savory with tomato and margarita. Extremely good, we've been coming here for 5 years and never changed how good it is, best crepe with reason all price."
        }, 
        {
            "index": 108, 
            "rating": 2, 
            "review": "I've never been a huge fan of crepes, but we stopped by because we wanted to avoid eating at another buffet disaster. My wife ordered the one with spinach and I had the one with sausage, marinara sauce, and a ton of cheese. Like someone else had mentioned, too much cheesy goodness for my taste. I felt like I had eaten enough cheese from an entire large pizza. The stomach can only handle so much coagulated cow's milk.\n\nIf it's busy with a line, be prepared for a wait until you receive your food since they are individually made fresh. It felt like I waited close to over half an hour waiting for my food. And at $9 a pop, they aren't exactly the best bargains, but pretty decent to hit the spot if you're craving it. Next time I'll have to try their dessert versions."
        }, 
        {
            "index": 109, 
            "rating": 5, 
            "review": "This is a great place to hit if you are hungry.  They have a wide selection of different types of crepes.  If you are in the area i recommend stopping in and getti g yourself a bit of deliciousness."
        }, 
        {
            "index": 110, 
            "rating": 4, 
            "review": "I loved the Nutella crepe here for being the perfect thickness, being perfectly delicious with just the right amount of Nutella, and being absolutely fresh and quick and tasty! \n\nAgreed, $10 seems steep for a crepe, but trust me, these crepes are more than a full meal! I couldn't even finish just a dessert crepe on my own and it was my first meal of the day at 5pm!"
        }, 
        {
            "index": 111, 
            "rating": 3, 
            "review": "Guess we must have found this place right before it closed since it was about 11 pm. It really hit the spot, though, and there was no problem finding a table since it was late. I got La Forestiere, which had spinach, mushrooms, boursin and mozzarella, though I was tempted to get the crepe with ratatouille so I could have been reminded about cartoon cooking mice....\n\nIt looked like they covered all the savory crepes in bechamel sauce, which was congealy but tasted kind of good -- it was late, I was hungry.  Sure, it was almost ten bucks, but I probably would have spent just as much on something at one of the cafes, and for those with girly appetites, there was plenty for two people to share.  \n\nAfter all, you don't want to be too full in Vegas...it could slow down your alcohol consumption."
        }, 
        {
            "index": 112, 
            "rating": 2, 
            "review": "This place used to be good a few years ago. Their prices have gone up, used to be around $8 and now its more than $10. Their portions USED to be generous, I couldn't finish one crepe because it was stuffed so much, would have to take half of it home. So thats why I kept returning even though their coffee and hot chocolate is crap and their bottled drinks are, of course, ridiculously overpriced.\n\nIt changed for the worse. The other day I came here again, ordered the mixed berry crepe (used to be called a Favorite crepe, thats another thing - they got rid of the French names for the crepes and are now naming them by their toppings). What a huge disappointment - the crepe was folded into a triangle with only a pitiful serving of berries and sauce on top. They used to stuff the crepe with berries and fold it only in half. So I was mostly eating pancake rather than fruit. For $10.50, it's definitely not worth it. Not coming here again no matter how much of a dessert craving I have."
        }, 
        {
            "index": 113, 
            "rating": 1, 
            "review": "This place was pretty bad. We got the nutella, fruits du mer, peanut butter & bananas, and the mixed berry crepes. The only one that was good was the peanut butter. I think a lot had to do the poor quality of the ingredients. Would not go back."
        }, 
        {
            "index": 114, 
            "rating": 5, 
            "review": "Tried the banana crepes and strawberries... yum!! This has to be a regular when we visit Vegas!"
        }, 
        {
            "index": 115, 
            "rating": 3, 
            "review": "I'm not a fan of the savory crepes here, but the pear one is to die for.  Yum!  If I wasn't already on the verge of morbid obesity, I'd eat one every hour every time I was in Vegas!"
        }, 
        {
            "index": 116, 
            "rating": 5, 
            "review": "We were visiting friends staying at Paris and wanted a quick take out brunch to eat in the nearby sport's bar while watching the football game.  I'm not sure if that was allowed, so I don't want to recommend this,  but no one said anything to us.  Maybe because we were ordering large quantities of alcohol.  I walked around the various shops and saw that this place not only made dessert crepes, but lunch ones also.  I had the ham and cheese crepe, while my husband had the roasted chicken crepe.  We shared our orders and both were delicious.  I really wanted to try the Nutella crepes for dessert, but they were so huge, I couldn't have another bite.  I will save that for our next visit to Vegas, that's for sure."
        }, 
        {
            "index": 117, 
            "rating": 5, 
            "review": "why oh why doesn't Phoenix offer a crepe place? if it did, i would make special trips just to stuff my face with a crepe. \n\nalthough i'm no novice to crepes, i still, still, still love the nutella crepe. with it's hot, gooey, hazelnut chocolate dripping outta the sides and the warm fluffy crepe, it's heaven i declare....HEAVEN! \n\ni wasn't even hungry but when we were walking through the Paris casino, i knew it would be ages before i'd get to have another crepe. long live Paris for your delicious crepes at La Creperie!"
        }, 
        {
            "index": 118, 
            "rating": 4, 
            "review": "Pretty good crepes; was at the Paris for a conference II'm a local so I try to stay off the strip as much as possible unless I have to go:) and I adore crepes (still have to make to Paris, France to actually have the crepe experience there:) and I thought I try it.  I got the Butter & Sugar w/ Vermont cultured butter & raw sugar and it was delicious.  A bit pricey but hey what do I expect from a casino.:)"
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "This place is absolutely amazing. There was a big line the first time we came but it was well worth it. Came back a second time before the flight back home and there was no line. We tried the Nutella banana, the cinnamon sugar, and the tomato mozzarella. They were all delicious! I would eat here every day if I could."
        }, 
        {
            "index": 120, 
            "rating": 3, 
            "review": "Cheap? No. MASSIVE? Yes. Worth the moderately annoying line? For sure.\n\nBut stick to the dessert crepes. My 'savory' crepe was less than thrilling. That Napoleon (lemon custard, berries, cream) was outta this world. \n\nAlso, an iced coffee with Baileys is an EXCELLENT jumpstart to a day of gambling, in my professional opinion."
        }, 
        {
            "index": 121, 
            "rating": 5, 
            "review": "It was my first time trying this place and I liked it very much. Service was really nice and fast. Before this place, I thought that crepes only consisted of the basics, banana, strawberries, etc. But after seeing their menu, I was definitely impressed. It was a hard decision between the wild mushroom and the shrimp scampi but I ended up choosing the shrimp scampi. It was amazing! The portion is reasonable but could've been bigger. I recommend trying this place if you're looking for something light to eat. I am going to come back to this place and try the other styles."
        }, 
        {
            "index": 122, 
            "rating": 5, 
            "review": "I love this place. The crepes are huge and really good. I've only tried the caramel apple and the fresh berry but they were both good."
        }, 
        {
            "index": 123, 
            "rating": 3, 
            "review": "We had heard about the crepes at this place from many of our friends.  We didn't know where it was, so we asked the gentleman working behind the Players Club Desk \"where are the crepes?\"  Not only did he give us directions to the location, he gave us an \"Insider Tip\" card - personal handwritten coupon for us (buy a crepe, get a free coffee or drink).  Sure you think, free drink, no big deal.  Well, at $2.99 a drink, we were appreciative of the insider tip card!\n\nI have had crepes before - the best being in Vancouver, BC.  But here, in the end, the crepes were ok.  We got one of the salty ones -  the size was enough for 2 people.  I think they were unable to keep up with the volume of orders b/c the veggie filling inside was cold.  Don't expect mindblowing crepes, but do go for the ambiance of \"Paris\" or as a buffet alternative."
        }, 
        {
            "index": 124, 
            "rating": 4, 
            "review": "The location is a bit busy and maybe a bit of a mess at times, and they definitely need some better seating, so that's the missing star.\n\nThe food, however, just wow. I had the butter and sugar crepe and it was beyond delicious. Everyone in our group ordered something different and we shared some bites. My husband had the scampi and my mother had the monte cristo. Both excellent. \n\nWe have been meaning to stop here for several trips and we are glad we finally did, and bummed we didn't do it sooner."
        }, 
        {
            "index": 125, 
            "rating": 5, 
            "review": "Fast. Conveinent. Made to order. Lots of seating.\n\nLocated in paris hotel on a little imitation cobblestone road. Is the small takeout area la creperie. Right beside the bakery. And just outside the hotel elevators from your room. It is attached to the bakery and theres plenty of self serve seating.\n\nCrepes are made to order after lining up like any fast food joint. Except this place uses fresh ingredients and makes the crepes right after ordering. And you wait for crepe when your name is called.\n\nI had the monte cristo crepe. Its the priciest one but it caught our eye bc it was both savoury and sweet. It sounded odd at first but it actually was pretty good. The portions of ham and turkey were generous and the strawberry sauce was not overwhelming. It was actually pretty tasty and my son quite enjoyed it despite not being a fan of crepes. The toppings were generous and enough to satisfy you and not overly destroy the crepe. It was easy to eat and did not fall apart because it was stuffed full. The ingredients were all fresh and tasty.\n\nThe line moves quick and its very conveinent to have a fast food type option in this hotel. You can take your food to the little sitting area beside it or in the bakery.\n\nPrices are decent for the strip and I found the crepes large enough to feed 2. But Im not a huge overeater. Quality is much better than quantity. Made to order is the best part of this place. Made to order for less than $20 and it takes less than 15 minutes for your food. That is just right in my books and It will keep me coming back when Im in a rush or need a cheap bite in the paris hotel"
        }, 
        {
            "index": 126, 
            "rating": 3, 
            "review": "The crepes are average in taste and big in portions. \n\nI usually come here if I happen to be in Paris and hungry but I wouldn't make it a point to check this place out.\n\nI like the dessert crepes the best especially with nutella."
        }, 
        {
            "index": 127, 
            "rating": 3, 
            "review": "I like the crepes here better than phillipe. However the wait is bad and I was disappointed that they sold out of the Cinnabon but didn't tell anyone. My wife was waiting at a table. I got to front of line after 50min and had to find a replacement for wife. Also no fancy coffee drinks. I mean diet Pepsi and crepe?!"
        }, 
        {
            "index": 128, 
            "rating": 4, 
            "review": "We always have to eat here. Whether you crave something sweet or savory, you can't beat these crepes after some typical Vegas drinking!"
        }, 
        {
            "index": 129, 
            "rating": 5, 
            "review": "A great quick breakfast place. If you don't want to stand in a long line and don't want to pay a ton of money for breakfast, stop by this yummy place. I only tried the Cinnamon Bun and Nutella varieties, but they were both delicious."
        }, 
        {
            "index": 130, 
            "rating": 3, 
            "review": "This crepe was delicious! Decided to get \"The Favorite\" and get some fruits in. The crepe was served with a delicious cream on top that put everything together. I had no shame and smothered this stuff all over instead of daintily putting it into the side.\n\nThe fruits inside were kind of the downer, it didn't really taste all that fresh and the blackberries were pretty sour. I ended up putting a lot of the fruits aside because it took away from the sweetness of the crepe. But, I did appreciate that they filled this baby up well. \n\nIf you're craving some dessert after dinner, this is a nice choice inside Paris, but beware of the sour fruits!"
        }, 
        {
            "index": 131, 
            "rating": 3, 
            "review": "The best crepes in Vegas? Not saying much perhaps. But our group was starving and hungover so why not.\n\nThe crepes are heavy and filling. Overall, I enjoyed mine but the prosciutto was a bit much and salty for my liking. The bechamel sauce is creamy. Perhaps sharing is the best route.\n\nLove that they have Orangina."
        }, 
        {
            "index": 132, 
            "rating": 4, 
            "review": "One night after dinner we stopped by here for dessert. We were staying at the Paris hotel and it is down one of the little wings of the hotel. I ordered the Nutella crepe and split it with my boyfriend. It came out pretty quickly (a couple of minutes). It was very rich and sweet (which is something I enjoy), but if this isn't your style I would go for a savory one, or perhaps one of the sweet ones with berries (I saw someone with a blueberry one that looked delicious!). It wasn't the best crepe I have ever had, but it wasn't too expensive and it was good! I would go again!"
        }, 
        {
            "index": 133, 
            "rating": 3, 
            "review": "A nice little treat tucked away in Paris.  It is kind of a food court style place - you order at the window and then wait for your number to be called.  Best to go with two people so that one can scout out seating in the shared dining area.   If you're headed from casino to casino to check everything out, this is a good place to stave off the hunger without going totally overboard.  Both sweet and savory crepes.  They are not cheap, but nothing is cheap in Vegas.  If you're ok with a quick (but yummy) snack at a sticky table eaten on plastic plates with a plastic knife and fork - then check it out!"
        }, 
        {
            "index": 134, 
            "rating": 4, 
            "review": "I can't believe I haven't reviewed this place yet! This is my Vegas tradition ever since my first trip to Vegas as an adult, every trip, usually on the last day, I get a savory crepe for breakfast/brunch. This is not the best creperie ever, but for a grab-n-go place, it's very good. I like that the crepes are not smothered in sauce, but with a decent amount of filling."
        }, 
        {
            "index": 135, 
            "rating": 4, 
            "review": "OMG. This was so yummy. I t was really cool to actually watch them make the crepes. It was 9.99 for all crepes and they are large and filling. I only had the sweet crepe but I will try a savory the next time i'm in vegas."
        }, 
        {
            "index": 136, 
            "rating": 5, 
            "review": "I've eaten here a couple times since they've opened, probably been a decade now. I try to go maybe once every other year and each time it's awesome and tasty!!! The crepes are fresh (made right there in front of you) and the staff is usually pretty nice. The choices for savory and sweet are great and if you can't find one you don't think you'd like, then you probably just don't like crepes haha! Totally a must if walking in Paris LV!"
        }, 
        {
            "index": 137, 
            "rating": 4, 
            "review": "My first encounter with some of La Creperie's crapes was unfortunate! \n\nUnfortunate that I had chosen to get a sandwich next door, and was only tasting deliciousness off others plates! No one was able to  finish so consider sharing (with me)."
        }, 
        {
            "index": 138, 
            "rating": 3, 
            "review": "So good.  Especially after a busy night beforehand - wedding celebrations can be exhausting!  The only thing I would have liked is more seating options but alas our group made it work so all is well :)"
        }, 
        {
            "index": 139, 
            "rating": 4, 
            "review": "A friend recommended this little crepe place in the heart of the Paris food court, and now I just have to recommend it to you!  If you're lucky, you won't have to wait in line too long, but it's totally worth it.  Have a friend grab a table at the nearby open cafe.  Freshly made crepes, both savory and sweet, are just what a girl needs to keep up her gambling strength.  My favorite is the Fruits de Mer crepe (seafood crepe).  Chunks and chunks of shrimp and scallops wrapped in an air light crepe, with a drizzle of cream sauce on top.  Heavenly."
        }, 
        {
            "index": 140, 
            "rating": 4, 
            "review": "The Monte Cristo sounds like a bizarre combo-ham, turkey & swiss cheese with strawberry jam, basil & powdered sugar on top. The sweet and salty duo is definitely worth trying. Would come back here again."
        }, 
        {
            "index": 141, 
            "rating": 1, 
            "review": "I don't know where to start. we went xmas week and was very busy. \nAt first order came up wrong ordered no whipped cream but came with it. Order was nutella crepe but there was no nutella in it:)\nAnd then there was no place to seat. They have more table but less chair. ( I thought they calculate these things when they build the places)"
        }, 
        {
            "index": 142, 
            "rating": 4, 
            "review": "I LOVE this place!!!\n\nThis will be my 3rd or fourth time to this yummy creperie place.\n\n What makes it special is the quality and yumminess of the crepe itself and the creme they put on top. Its addicting! Seriously! Plus the fact that they do NOT use canned ingredients for the fruits and veggies. \n\nThe best selections are the dessert crepes - they use real fruits which is beneficial because they do not soak through the fluffy crepe batter.\nI had the \"Favorite\" which consists of fresh berries and cream...so good! \n\nThe nutella with strawberries and bananas is also yummy, \n\nThe Toulous is good for marinara lovers, while the Spinach Cheese Mushroom is also really good. \n\nTheir crepes are quite sizeable as well! \n\nFor coffee lovers, this place is quality.  They offer smooth and well-flavored quality coffee.\n\nThe only bummer is the slow service - it's a walk up window and there's almost always a line, whether weekday or weekend. I've tried both and stood in a line no matter what. (mind you this is around the holidays)."
        }, 
        {
            "index": 143, 
            "rating": 3, 
            "review": "I'm only giving it 3 stars because I've never tried anything but dessert crepes before. So the \"savory\" dish on the menu caught my attention. Well, caught my gf's attention since she's the dessert freak.\n\nTried out the Toulouse which tastes just like a pizza with sausage and mushrooms but it's crepe. A little too much cheese for me. For $8.99, I'd rather just get a real pizza.\n\nIf there's a long line then I'd skip it. If you're bored and want to give it a shot then by all means. Just don't expect this thing to fill you up.\n\nI wouldn't come back."
        }, 
        {
            "index": 144, 
            "rating": 4, 
            "review": "Always tasty and a great value for the strip. Simple but good ingredients. Super casual and good people watching from the patio."
        }, 
        {
            "index": 145, 
            "rating": 4, 
            "review": "I've been meaning to visit this place.  The smell of fresh crepes wafting through the air is quite alluring.  Finally, we made it before noon and ordered dessert crepes for breakfast.  We both ordered the nutella crepe, which includes chocolate sauce and chantilly (a.k.a. whipped cream).  It was too much for either of us to finish for breakfast, so I think a crepe for breakfast could easily be shared.  They also offered several bottled beverages and hot, fresh beverages.  I enjoyed a Starbucks frappucino (coffee flavored) with my crepe, and it was a nice touch.  But then I needed water, after all that sweetness!  Anyway, I'm definitely coming back here to try a savoury crepe on my next trip to Las Vegas!"
        }, 
        {
            "index": 146, 
            "rating": 5, 
            "review": "I have been to the creperie countless times because of the Delicious Crepes! I typically get the St Louis crepe, but I'll change it up and get the chocolate crepe too! They give you a lot for a tiny price!"
        }, 
        {
            "index": 147, 
            "rating": 1, 
            "review": "The review goes for the wait time and not for food. I went to the place for take out dinner on two consecutive days. The first time: delicious food prepared in 10 mins. Next time wait time was about an hour without any prior information. If it is going to take so long you need to inform customers beforehand so that they can make a decision to eat at your place or not. Making people wait for 1 hr for a takeout is not professional at all."
        }, 
        {
            "index": 148, 
            "rating": 5, 
            "review": "Delicious crepes! I always get the ones with berries and am never disappointed. Way better than the crepe I had last night at Jean Phillipe's Pattiserie at Aria."
        }, 
        {
            "index": 149, 
            "rating": 3, 
            "review": "Let me keep it simple. It's a little overpriced and pretty mediocre. It's faster than other food options at Paris though."
        }, 
        {
            "index": 150, 
            "rating": 4, 
            "review": "I'm a huge fan of crepes, and after the Blue Man group, my girlfriend and I were very hungry. Since we were staying at Bally's we wanted something close and decided why not try a crepe?\n\nIt was interesting as this place doesn't stand out at all. It's like a little stand actually. If you don't look closely, you might miss it. It's located on the way to the Paris Casino. They have 3 savory and 3 sweet crepes from which to choose and they were all under 10 bucks. I think that's pretty good nowadays in Vegas.\n\nWe went with the Seafood Crepe which included Bechamel sauce, shrimp, scallops and spinach. It took about 10 minutes (they are all made fresh) and you can watch yours being made. \n\nThis was one of the best crepes I ever ate. Thick enough that it wasn't falling apart, fresh ingredients, and the Bechamel sauce was outstanding. We both felt this was the hidden gem of the trip. \n\nTip: There is seating between JJ's Boulangerie and Le Creperie so you don't have to stand to eat this wonderful creation.\n\nIf you like crepes and don't like spending a ton for them, this is the place."
        }, 
        {
            "index": 151, 
            "rating": 5, 
            "review": "Great crepes. I could eat these crepes all day every day. Done just right and a nice variety of flavors"
        }, 
        {
            "index": 152, 
            "rating": 3, 
            "review": "I came here with my friends to grab a late breakfast/lunch.  I ate here maybe five years ago, and I remembered it was pretty good.  You place your order at the window, and you can go grab a table while you wait for your crepe to be made.  It usually takes about five minutes or so, depending on how busy they are.\n\nI went with the Fruits de Mer( http://static.px.yelp.com/bphoto/z1163PZ9voGYg4HawDXrkw/l ) which had shrimp, scallops, mushrooms, Swiss cheese and Bechamel sauce.  It tasted like the seafood was frozen, and the Bechamel sauce didn't have much flavor.  I had a bite of my friend's Toulouse, which had a marinara sauce, and that was much tastier.  \n\nI also got a cup of coffee here, and after a while, I noticed my cup was slowly leaking from the bottom.  They were nice enough to give me a fresh cup of coffee, which I then burned my tongue on.  =P\n\nIf you come here, go for the dessert crepes or the Toulouse.  I'm not a fan of their Bechamel sauce, but the other stuff is good!"
        }, 
        {
            "index": 153, 
            "rating": 4, 
            "review": "Fast, friendly service and a little crepe stand inside the Paris hotel. Good amount of sweet and savory options. Cute chalkboard menu to peruse. Reasonably priced, for the portion you're getting. And when plated, it looks beautiful and decadent. Can get a small discount if you're a Total Rewards member.  Everything fresh and made to order. And a large and very filling crepe! \n\nHazelnut/banana - I thoroughly enjoyed this hearty crepe and by the time I finished, I was stuffed! Full of banana chunks and generous layer of Nutella. Every bite was oozing with it, and the light, airy cream complimented the crepe perfectly. Comes with candied hazelnuts but I nixed that. $11\n\nBlueberry lemon - giant blueberries on top of the crepe! Looked so fresh and delicious. No mushy blueberries here. But my husband was not a fan of this crepe, because of the lemon curd filling. There was no texture, and to him it seemed a bit gooey. He said the crepe itself was tasty and was not overly sweet. $11.25\n\nWe took ours to-go. The girl taking our order was very pleasant. The girl forgot this, but easily popped a lid onto our plate. Utensils and napkins to the side! \n\nIf there was a small line, it often moved very quickly."
        }, 
        {
            "index": 154, 
            "rating": 1, 
            "review": "This crepe is positively creepy. Burnt, hard around the edges, veggies in middle were cold.  They are so busy they don't care. Concept is good but they definitely new quality control based upon the other positive reviews."
        }, 
        {
            "index": 155, 
            "rating": 4, 
            "review": "Every once in a while you can still find a bargain on the strip. I often dread walking into the strip casinos as many of the restaurants have gone the route of expensive, hip, trendy but low quality or overpriced food choices.  So Wife, Child and I were wandering through Paris, I forget why, maybe to check out Sweet Factory.  We were walking through the mall towards the casino and we saw Le Creperie.  Ok, we were hooked.  My wife loves crepes and most things french and my daughter needed to experience them.  We got a savory seafood crepe and a sweet nutella crepe.  Both were delicious.  The price may be a dollar higher than I would like but for the size of the crepes I think it is worth it. Plus you get free refill your own sodas at the pizza place next door.  \n\nThere are not as many selections as I would hope and the line sometimes gets long.  The seating is first come first serve for both Pizza and Crepes and there is not very much of it so send someone from your group to vulture a table while you wait in line.\n\nI am certain there are better crepes out there and that they are probably cheaper but for a strip shop this place is the bomb.com"
        }, 
        {
            "index": 156, 
            "rating": 4, 
            "review": "Had their turkey crepe: pretty good food.\n\nAtmosphere is just ok; since its sitting area is open to the hotel's common street and it is self-service. \n\nIt is very easy to find better places to eat crepes among many other options. I prefer the restaurants on the strip side of the very Paris hotel this place is located in; much better crepes there with perfect service and upscale atmosphere."
        }, 
        {
            "index": 157, 
            "rating": 1, 
            "review": "This was the worst crepe place I've been to. The crepe was overpriced. The crepe itself was really rubbery. They used frozen fruits instead of canned fruits and the whipped cream they supposedly made themselves were awful. In addition to the crappy crepe, the cashier was rude and didn't tell me my crepe was ready and had left it just sitting at the counter when it was made."
        }, 
        {
            "index": 158, 
            "rating": 5, 
            "review": "This place makes the best crepes that I have ever eaten outside of the Paris Hotel."
        }, 
        {
            "index": 159, 
            "rating": 3, 
            "review": "Solid crepes, but not much selection on the menu. Definitely overpriced.\n\nNutella crepe is the best (without the bananas). Yum!"
        }, 
        {
            "index": 160, 
            "rating": 3, 
            "review": "Had the late night munchies and needed some fuel before going out to par-tay. Thank goodness we walked into Paris Hotel because there was \"fast food\" other then McD's or Panda Express(I can't believe there's one in Vegas). It was quick and easy. Just go up to the window, order, grab food and find seat. Then proceed to eat.Got the Fruits de Mare and it had a generous portion of scallops, shrimps and mushrooms for $8. I've had my share of crepes and this was pretty good for the take-out-late-night-snack field."
        }, 
        {
            "index": 161, 
            "rating": 4, 
            "review": "Solid savory crepes (sorry, I typically find sweet crepes, err, too sweet), with good flavor, great choices, and good portion size, too.\n\nPrice is just ok, but at least they take credit card. Negatives are pretty minor - seating is limited, and preparation doesn't seem to be very efficient, so be prepared to wait a while for your food."
        }, 
        {
            "index": 162, 
            "rating": 3, 
            "review": "Fresh berry crape, $10.75. I liked it but i didnt like the guy at the casher.  Very unfriendly.  almost everyone here in LV had a good customer service so maybe he was noticeable... so 3 stars."
        }, 
        {
            "index": 163, 
            "rating": 2, 
            "review": "The crepes are served luke warm at best. They make the crepes \"fresh\" but they are not hot cooked to order. Instead they batch cook the crepes...stack them so they are cooling off. You order your special crepe and they assemble it. All ingredants are cold or precooked. They throw them in the premade cold crepe and kinda warm it on the griddle but not reallllly."
        }, 
        {
            "index": 164, 
            "rating": 4, 
            "review": "If your looking for quick eats this is a nice place to try. You can get the crepe Togo or go around the corner where there is self seating. \n\nFirst time going there I tried the spinach and artichoke and for something sweet I got the butter and sugar crepe. \n\nThe spinach artichoke crepe was ok. Let's just say I wouldn't go for that again. But on the other hand the butter sugar crepe was to die for! I will be coming back again and again for this. I suggest if you want to go get dessert after a nice dinner that you should go here! \n\nI would give this place a 4.5 and this is due to the service of the cashier. I went there twice within 24hrs and both were not attentive. But otherwise, try it!"
        }, 
        {
            "index": 165, 
            "rating": 4, 
            "review": "We stopped here to get a Crepe to-go and take it up to our room. The Crepe we chose was the Tomato, Basil and Mozzarella w/ Balsamic drizzle... it was seriously great!\n\nThe ingredients were very fresh and it totally hit the spot for us. The Balsamic drizzle over the top was the ultimate topper! So good!"
        }, 
        {
            "index": 166, 
            "rating": 4, 
            "review": "Bananas Foster will satisfy your sweet tooth without the soggy mess of mixed berry 'Favorite'.  Large portion sizes make this a great dessert for 2-3 friends."
        }, 
        {
            "index": 167, 
            "rating": 2, 
            "review": "My second worst crepe experience ever!\n\nI ordered a cheese and prosciutto crepe. The crepe was almost thick as a pancake and really doughy. I like doughy crepes but they should be much thinner. It was also not very hot. The prosciutto was too thick and it was kind of too strong in flavor. Worst of all are the flimsy forks they give you. I had a hell of a time trying to cut the prosciutto.\n\nMy BF ordered a decent veggie crepe. Mushroom and spinach I think. This crepe was also doughy and thick. If it were not for this decent crepe I would give this place one star.\n\nThe coffee here is awful. I will never return.\n\nParking is a breeze usually and it's free. It's in the Paris parking structure.\n\nWhen we got here it was not too busy but when we passed by later on it was really packed. I really wonder why....The only cool thing here is checking out the stereotypical Parisian outfits the employees have to wear haha!"
        }, 
        {
            "index": 168, 
            "rating": 4, 
            "review": "So I have been wanting to try this place since last year. Paris is my favorite city so what better place to eat than at Paris Las Vegas.  Even though it's early Sunday morning it's crazy here.  It's not a big surprise that the lines a pretty long although here they are not to crazy.  They have a good selection of savory and sweet crepes along with coffe and hot chocolate.  Since it's morning I decided to have a ham and cheese because who doesn't like ham and cheese. Along with water it's a pretty healthy meal.  The size of my Crepe was not huge but it was fairly big and full of ham.   \nAs we waited for our crepes I will admit it was a fairly long wait but hey its Vegas what do you expect.  After finally getting our crepes we looked for a place to sit.  About the only downfall to this place is the fact that that there are definitely  not enough places to sit.  We walked all around the area without a seat to be found. So we saw a tall table and decided what the heck let's just stand and eat.  I will say standing and eating can actually be good because I didn't feel as stuffed.\nAll in all this place for me was worth the wait. The Crepe was perfectly cooked with the right amount of food to get you going. I will be coming back\nAnd word of advice nothing in Vegas is quick so be prepared to encounter long lines and wait times. Also if you can have someone in party secure seating for you because not everyone likes to stand and eat.p"
        }, 
        {
            "index": 169, 
            "rating": 4, 
            "review": "after waiting a legit freakin hour i get my crepe. The Napoleon: crepe filled with lemon curd?, blackberries, raspberries and perhaps blueberries topped with some whipped cream= holy shit that is good. An hour wait is an hour wait but those crepes are good. I would come here when it is not peak hours (I came around 11- was there till about 12:30) My peep got the Favorite and he said that was bomb as well. Maybe next time i will share and get a savory as well as a sweet crepe. Also Crepes are all $10, but they are huge and well worth it.. What is not worth it is their small coffee which is priced at $3. Buy your Crepe here and your coffee at the cafe next door. Iced Mochas are only $4 next door. Way better price."
        }, 
        {
            "index": 170, 
            "rating": 5, 
            "review": "We stopped by here at the recommendation of the elevator operator at the Eiffel Tower...and glad we did (despite being a little full from an earlier breakfast.) We shared a massive cinnamon bun crepe and loved every bite! Ours didn't seem to have too much filling as an earlier post mentioned... it was just enough! They are huge, so definitely get one to share! Plenty of seating and quickly made. If we ever find our way back - will absolutely stop by again!"
        }, 
        {
            "index": 171, 
            "rating": 3, 
            "review": "Tired, hungry, and hungover, I came here to grab a quick bite before heading to the airport. While this is not the best food to eat if you are trying to recover from a previous evening, but it is still satisfying and delicious. \n\nI had an odd combination on my crepe which included ratatouille, cheese, and bechamel sauce. Extremely unique, the ratatouille tasted a little bit more like salsa in some bites than it did like ratatouille but it was still good nonetheless.\n\nWe had tried to come here the previous day but the line was absurd. It looked like it would be about a 45 minute wait. FOR A CREPE! I don't think it's worth it to wait THAT long, but if you need a quick snack or a meal on the go, it's a good place to stop. \n\nIt was about $10 for the crepe - a little pricey for what it was since most that I get in Seattle are $6 or $7, but for the Vegas strip, I suppose it's fairly reasonable. It's all relative."
        }, 
        {
            "index": 172, 
            "rating": 4, 
            "review": "I f-ing love this place.  It's where we had breakfast , well, three of the three mornings we were in Vegas.   I prefer savory to sweet crepes, unless they're just buttered and sugared....  I'm a less is more kind of a gal.   This place is truly top notch in my book!  They're huge and well, maybe it's 'cause I'm from downtown Chicago... but I don't find $9.99 for a crepe than can feed two to be at all over priced."
        }, 
        {
            "index": 173, 
            "rating": 5, 
            "review": "Get the Toulouse. C'est tresssssss bon! Then head over to the drink stand across the fake cobblestone street and buy the pina colada in the cheesy Eiffel Tower yard-long bottle and stroll down Le Boulevard. It's so authentic, non?"
        }, 
        {
            "index": 174, 
            "rating": 5, 
            "review": "My boyfriend and I had our fourth year anniversary trip in Vegas this November and stayed at Paris for a couple of nights.  We were so hungry we stopped by the restaurants near the entrances and front desks just to get a quick bite.  \n\nNow, the two of us met at a creperie that we worked at five years ago, and we know our French and Japanese crepes pretty damn well - these quick crepes were flavorful and seemed to never be enough.  With total rewards card for Caesar Casinos, including Paris, you could save a dollar or so each crepe!  Never got to try a sweet one, but the savory pesto roasted chicken crepe is highly recommended.  The shrimp scampi crepe is super buttery and feels like it's coating my throat, but I wouldn't say it was a true ode to shrimp scampi pasta if it didn't!"
        }, 
        {
            "index": 175, 
            "rating": 2, 
            "review": "Was not super impressed. My favorite thing in the whole world is a delicious crêpe. I just love them. My husband and I made it a point to stop in and have a delicious crêpe while visiting in Las Vegas. I don't know if that was this particular day or what it was but they were very expensive and definitely not worth the trouble we had to go through to have a HARD yet enormously chewy gummy unsatisfying crêpe with berries and whipped cream. I have to say the berries were better than the crêpe for sure. So if you want a handful of delicious berries you can find them here just exclude the crêpe :("
        }, 
        {
            "index": 176, 
            "rating": 4, 
            "review": "Being in San Diego, I don't really get that many opportunities to get good crepes so I always make an effort to stop by this place whenever I go to Las Vegas.  Crepes in Paris?  Seems idealistic, right?  The crepes here are a bit pricey but are well worth the money.\n\nI usually come here after getting some sort of alcoholic drink served in a big plastic Eiffel Tower.  I've tried the Nutella crepe and the peanut butter crepe.  Both of which I consider are EXCELLENT.  The Nutella has a nice flavor to it.  The Nutella compliments the warm crepe will.  Top it off with whipped cream and this one is a winner.  \n\nThe peanut butter crepe is probably my favorite of them all.  It's filled with peanut butter and banana.  The creaminess of the peanut butter coupled with the warm crepe makes for an excellent dessert.  It's definitely one of my favorite guilty pleasures when coming to Vegas."
        }, 
        {
            "index": 177, 
            "rating": 1, 
            "review": "Ana was rude as we were checking out. This place could be much better if they were pleasant. However the food was good if you can deal with marginal service at best."
        }, 
        {
            "index": 178, 
            "rating": 5, 
            "review": "Located in the Paris Hotel, these are the best crapes I have ever tasted.  It's amazing to watch these made to order.  They are huge, so plan to share or eat them as a meal.  Am most fond of the dessert crapes."
        }, 
        {
            "index": 179, 
            "rating": 3, 
            "review": "Food: 3 stars\nService: 4 stars (for the cashier)\nPrice: 3.5 stars\n\nWe ordered a Napolean crepe which has lemon custard, raspberries, blueberries, and strawberries inside for $8.99. It tasted just ok, not a great crepe place or may be it is just not the type of crepes I like."
        }, 
        {
            "index": 180, 
            "rating": 5, 
            "review": "In recent years La Creperie at The Paris Hotel & Casino in Las Vegas has become one of my Las Vegas eating staples. I can not complete a trip to Vegas without a delicious crepe (sometimes two).\n\nMy last trip to Las Vegas, I had a delicious \"Seafood Crepe\" featuring scallops and shrimp smothered in a sauce that I still think of to this day.\n\nLater in my trip i stopped in for dessert and had my usual \"The Nutella\", Peanut butter & Banana's smothered in chocolate syrup and whipped cream. This has got to be the greatest dessert on earth...\n\nLocation wise it's easy to miss La Creperie. As you walk through the Paris \"food court\" (more of a hallway) it is stuffed between two large restaurants. There is VERY limited seating and sometimes you have to battle it out for a table but people seem to come and go fast enough that you shouldn't have a problem.\n\nPrice-wise it's extremely reasonable when you consider the quality and quantity you are getting. Let me speak from experience. I had crepes in Paris, France and they weren't as good as the one's I've had at Paris, Las Vegas. These are filling, tasty and leave such a lasting impression that I guarantee you will be back for more every time you visit Vegas!"
        }, 
        {
            "index": 181, 
            "rating": 3, 
            "review": "Paris hotel's eatery specializing in made to order crepes. For $6.95 you can get a huge dessert or savory crepe...and you can watch it being made. The savory filings weren't that good though....too much egg in mine and too much prosciutto made for over saltiness in the other. Drinks are limited to bottled water, sodas and SoBe. Seating is right nextdoor."
        }, 
        {
            "index": 182, 
            "rating": 5, 
            "review": "Expensive, but the crepes are enormous and have the freshest and finest ingredients. I could eat this every morning."
        }, 
        {
            "index": 183, 
            "rating": 4, 
            "review": "My husband and I really enjoyed the crepes we ate at the La Creperie. Located in the Paris Hotel, it's just a little walk up window with a small menu.  There's always a decent line at this place, but they are very fast with getting the food out. Right next to it, there are plenty of tables and chairs to sit at and people watch. All the crepes were $9.99. They were a very decent size and filling for breakfast. First time we went, I had the crepe with spinach, mushroom, and cheese, topped with a bechamel sauce. It was awesome! My husband got a crepe Suzette, which he enjoyed.  Second time we went, we got the nutella crepe.  It was good, but it was almost too rich.  It was only nutella on the inside and topped with whipped cream.  Could have used maybe some fruit inside like strawberries or bananas to cut the sweetness.  We would definitely eat here again. It's also great for people that want to eat and run because you have a busy day ahead of you and don't want to wait forever to be served."
        }, 
        {
            "index": 184, 
            "rating": 5, 
            "review": "Damn it all to hell! If Richard Z or Dallas G beat me to one more review I am going to hurl myself from atop the Luxor obelisk, which by the way, Richard can't tell if it is here nor there. But I digress. \n\nI was introduced to this little crepe place oh so many years ago by either Dallas or Richard and have been in love ever since. My staple was the Normandy, warm apples, caramel, and the ton of whipped cream everyone talks about. I was happy with this, content you could say. I have strayed in the past, trying a savory as opposed to sweet crepe, but it just wasn't the same. \n\nThis most recent trip to Sin City I was messaged by Mr Z and told about a new delectable crepe being offered: The Peanut Butter and Banana crepe. Anyone who knows me, knows my love affair with peanut butter is a long and satisfying one. Bananas are a new love and I recently discovered that the two combined are an unstoppable force.  Throw in a thin, chewy crepe, and some of the whipped cream and you have yourself... well just look at the picture.\n\nThe line for this place can seem like an eternity, but the people watching is entertaining.  Any trip to Vegas seems incomplete when we are just unable to fit Le Creperie into the mix."
        }, 
        {
            "index": 185, 
            "rating": 5, 
            "review": "Do you like crepes? If so look no further...these are sumptuous! We tried the Suzette which is orange segments, cointreau, brown sugar, butter and lemon juice...mmmm.......and the Napoleon which is lemon custard with raspberries, blueberries and strawberries....wow! Accompany that with the Irish Coffee and it is an almost spiritual experience. They make the crepes right in front of you and you are given them to go. You can take them back to your room or you can enjoy them right there. Highly recommend!"
        }, 
        {
            "index": 186, 
            "rating": 3, 
            "review": "Really...\nToo doughy.. \nAnd seriously the crepes there are made really authentic, \nU can not beat em.\nThis place was just stop by somewhere to fill our stomachs.\nI would not come back.\nThere was nothing special wut so ever about this place. \nNope. \nDoughy and pricy for wut we ate."
        }, 
        {
            "index": 187, 
            "rating": 5, 
            "review": "A crepe window in the Paris Casino Hotel. How authentic eh. Sounds cheesy right? Well I will be damned if this is not some of the best crepes I have ever had. Cheap (for vegas), huge and damn delicious. This is like a fluffy little nirvana. I usually love the sweet crepes but here I also love the savory. There are just too many choices. I think that I need to stay at the Paris next time so that I can eat here every day and try everything on the menu. Amazing. Do it. Or Else. Understand?"
        }, 
        {
            "index": 188, 
            "rating": 4, 
            "review": "La Creperie is located in Paris Las Vegas, looks like sidewalk Creperie in the street of Paris. Whenever I go to Vegas, I always drop by this place for breakfast or late evening snack. I like their crepe even though selections are very limited.   7 kinds of Dessert crepes and 5 kinds of savory crepes which can replace breakfast or light lunch.  \nMy favorite is Shrimp scampi(Shrimp, mushroom, spinach with garlic herb) $11.75 and Nutella crepe($11)! It bit pricey but I cannot resist this place."
        }, 
        {
            "index": 189, 
            "rating": 4, 
            "review": "Its a great option for a snack or breakfast at the Paris.  Like everything in Vegas, it is overpriced for what it is but for me it was worth it.\n\n The crepes are very good, both the savory and the sweet ones.  They are well made and the ingredients are very fresh.  The creperie does not have its own seating area but shares one with a couple of other places in the Paris and the options for hot drinks was pretty limited."
        }, 
        {
            "index": 190, 
            "rating": 4, 
            "review": "Maybe I'm a crepe snob, but crepes should be delicate creations of sweet and/or savory components. Some more finesse would have been enjoyable, however I'm still going to give this place 4 stars since it really doesn't get much better in the states. I had the berry crepe which was very good. Wife had the pear crepe. She love it but I hated it (maple syrup, raisins, sugar, and minuscule bits of sweet pear) - way too sweet for me. Nonetheless, a great breakfast to nurse a slight hangover on a Wednesday morning and would definitely come back!"
        }, 
        {
            "index": 191, 
            "rating": 3, 
            "review": "I'm always teetering between good and bad here.  Some trips I get perfectly done crepes, other trips I get some funky ones that make you wonder what you're eating.  It's come to the point that I have to watch them make the crepe and observe each step to ensure I get what i want.\n\nThere are times when the crepes get too thick, sometimes too thin.  A lot of the workers there like many in the restaurant industry, believe that more is always better.  that rule does not hold true for savory crepes.  I don't need an overload of sodium to my diet, so you can keep the extra sauce off, and no need for extra seasoning either.  The same goes for sweet tooth's.  Piling on a mountain of whipped cream or berry sauce isn't going to make my taste buds jump w/ joy and I really don't want to frequent my orthodontist often.\n\nWhen I do happen to get a good crepe, it's heavenly.  I'm not too big on savory crepes, but I'll grab a bite here and there off someone else's if they get it.  Call me a sweet guy, cuz it's always about the berries, or chocolate when it comes to these wonderful desserts."
        }, 
        {
            "index": 192, 
            "rating": 4, 
            "review": "At least one AM breakfast in Vegas involves a crepe and a baguette.  The crepes are very tasty and not too overpriced.  The location along the \"(cobblestone) streets of Paris\" is very cool.  Ive gone sweet and ive gone savory and both are very tasty."
        }, 
        {
            "index": 193, 
            "rating": 4, 
            "review": "what a long wait...was it worth it? is anything ever worth the wait? heeeheee..i saved our seat for so long that i actually got up and gave it to the couple standing around with their crepes in tray. i felt so bad that they were just standing and couldn't eat. \nget the proscuitto with the cheese and basil! soo delicious!! that's it."
        }, 
        {
            "index": 194, 
            "rating": 5, 
            "review": "Well- if you want to ingest 9000 calories, and let it be worth it, stop at the Creperie inside Paris. You will not be dissapointed, and I would reccomend you share. We got the Bananas with brandy and nutella and chocolate. Piled with whipped cream, can you say FATTENING?! But they are delightful, and it could be a really romantic little dessert date."
        }, 
        {
            "index": 195, 
            "rating": 4, 
            "review": "The dessert crepes are pretty good.  The Napoleon crepe that I had had plenty of fruit inside.  The filling however wasn't spread entirely evenly.  One side had most of the lemon sauce and the other side had a ton of fruit.\n\nThe Crepe Forestiere was very good.  The mushrooms in there are great."
        }, 
        {
            "index": 196, 
            "rating": 4, 
            "review": "Good treat but I think for the money I should have got more food then what was giving to me"
        }, 
        {
            "index": 197, 
            "rating": 4, 
            "review": "Crepes are awesome here. You just order at a window then they'll call your number so there's not really any interaction with the employees. Grab a table while someone else waits for the crepes or you'll be standing and eating."
        }, 
        {
            "index": 198, 
            "rating": 4, 
            "review": "It is so nice in the hustle and bustle of Vegas to be able to walk up to a counter, pay a relatively inexpensive price (for Vegas standards) for some grub and receive the food within five minutes.  On top of that, these crepes are delish!    \n\nWhat my hubby and I have done is order one salty and one sweet crepe and split them.  I believe they refer to them as meal or dessert crepes...just get one of each.  They are huge but you need to try more than one of these fairly inventive recipes.  I have not made it here on my last two trips to Vegas but Yelp just reminded me to go back and grub."
        }, 
        {
            "index": 199, 
            "rating": 1, 
            "review": "I'm not going to go into long detail about how I'll never go back here again, but I will never go back here again!\n\nThe line was about 10 people long when I got on line and it took me 30 minutes to get to the counter and place my order. If that wasn't bad enough, I ordered 1 breakfast crepe and after standing waiting for my food for another 10 minutes, I saw that there were people who ordered after me getting their food before me, so I went up to the counter and asked what was going on. I was told that they lost my receipt so they couldn't make my food, they need me to show them the receipt so they can start to make it. WHAT?!?! I'm standing there for another 10 minutes less than 5 feet from the counter and you don't bother to tell me that you lost the receipt? Do you think I was just standing there for fun??\n\nEither way, after that, the food was completely cold in the middle and overpriced on top of it. Don't go here, it's a joke."
        }, 
        {
            "index": 200, 
            "rating": 5, 
            "review": "When in a rush and just wnat good food at a cheap (for Vegas) price, this is the place. It is behind the Casino in the Paris and has many different crepe options. Whether in the mood for sweet or savory, this place has you covered.\n\nI got the savory crepe with prosciutto and it was delicious. The prosciutto was salty, but htat's the way I like it. It was ready in about 10 minutes and we were back at the tables within 25 minutes of ordering.\n\nThere is a cafeteria style area to eat right next door and is a good area for people watching."
        }, 
        {
            "index": 201, 
            "rating": 5, 
            "review": "By far THE BEST crepé's I have ever had.\nI remember, before leaving Las Vegas, a girlfriend of mine insisted we make a stop over at the Paris for brunch and I'm forever grateful for her introducing La Creperié to me. \nI had the D'Anjou - a pear,  with caramel, almond paste, whipped cream and walnus. Pretty much a heaven treat in your mouth, chased by some refreshing, Organina. \n\nThey have plethora of choices to choose from though to lure anyones taste buds in. Shrimp and hollandaise sauce, Nutella and almonds, etc. You won't be disappointed."
        }, 
        {
            "index": 202, 
            "rating": 4, 
            "review": "Long lines but definitely worth the wait. Tried the Berry Crepe and it was delicious!"
        }, 
        {
            "index": 203, 
            "rating": 4, 
            "review": "I stopped here because I was hungry and a burger sounded good.  Well the burger was good and the petite fries were awesome. Plus they have a good happy hour.  Kristie my waitress in the bar section was knowledgeable about the beer selections. She gave great recommendations. It is a bit loud but it is a sports bar."
        }, 
        {
            "index": 204, 
            "rating": 3, 
            "review": "Located in Paris, along the walk area.  This place always has a line, which is a good sign.  The crepe was good.  The service was very bad.  The lady didn't tell us that she was going to call our name and other people were called by numbers?  Confusing.   They do both?  I don't know why?  But the lady had poor customer service, unusual for Vegas.\n\nThe crepe was tasty, but kind of disappointing that they don't make them to order.  Some of the ingredients are pre made.  Ewww.  I wanted to order a crepe, but without the meat since I'm a vegetarian.  Nope sorry we can't do that.  Items are already mixed together.  So I just stuck with their veggie crepe off the savory list."
        }, 
        {
            "index": 205, 
            "rating": 4, 
            "review": "Order the cinammon bun cepre. Was pretty good but just at the end it had too much cinnamon and creme. I mean way, way too much. Couldn't eat it no more."
        }, 
        {
            "index": 206, 
            "rating": 4, 
            "review": "Excellent crepes, the bakery next store is fantastic !  Love the chicken and sun dried tomatoes."
        }, 
        {
            "index": 207, 
            "rating": 3, 
            "review": "Short version: $10 a crepe, fairly large, decent deal considering the size, quality, and the fact that you're in a vegas resort on the strip.\n\nI've been lucky enough to have had a crepe from a street vendor in Paris; no one's going to confuse one from la creperie for the real thing, but it's good enough to satisfy a crepe urge (and spark some nostalgia)."
        }, 
        {
            "index": 208, 
            "rating": 3, 
            "review": "Sorry but you will only get 3 stars from my sis, cousins and I. \n\nThis creperie is at the Paris Hotel in Las Vegas.  Took uber to get here because we were just seriously craving for some good crepe!  We were so excited to finally have crepes.\n\nThank goodness there was no line, but we encountered a very unhappy guy, that was the manager at the time ... yikes!  I mean, no customer service skills at all.  No, Smiles, No, Hello, we asked about the different crepes and he told us to read the menu... uhmm really!? Idk, maybe he is having a bad day.. who knows!  I hope he will learn how to smile more next time.\n\nAs far as the food, it was just ok, nothing special.  We had the Banana Nutella with candied hazelnuts and caramel sauce, and a Nutella with fruits on top. Can't really say, \"Ooh lala\" hopefully next time when I visit they won't let us down."
        }, 
        {
            "index": 209, 
            "rating": 3, 
            "review": "This place is soooooo expensive. Their only saving grace is the taste. The line is slow and long. It's just a window you walk up to and they can only make 3 crepes at a time so don't expect to get out quickly."
        }, 
        {
            "index": 210, 
            "rating": 3, 
            "review": "Crepes are ok, little over priced but it's Vegas. But the cashier Dennis, super unfriendly. I asked him for suggestions and he wasn't having it.  Last time I come here."
        }, 
        {
            "index": 211, 
            "rating": 1, 
            "review": "this place IS NOT GOOD for crepes.. too doughy and thick. The sweeter ones were better. But they should just make pancakes, not crepes... It is expensive also.. we got 2 crepes for 32.91 with tax. I make better crepes myself."
        }, 
        {
            "index": 212, 
            "rating": 4, 
            "review": "La Creperie can be found within the majestic walls of the Paris Hotel. After a stellar night out on the town, my 7 girlfriends and I decided to go here since we were starving and our early morning bloody marys were beginning to take effect. \n\nI decided to try the Seafood crepe - scallops and shrimp and drizzled with bechemal sauce. Delicious!!! It's pretty inexpensive for being Vegas and the best part: you get your choice of dessert or savory. Plus there's the bar across the way :) Go big or go home in Vegas, right?\n\nCheers!"
        }, 
        {
            "index": 213, 
            "rating": 5, 
            "review": "Winner. I just ordered the Monte Cristo and I love it! Next time I'm going to get more of the sauce, but it's great. Keep in mind that it is loud on the side of the counter where you order but quiet where they take your order. You may need them to repeat the questions they ask you. This happened to me but also to people before me. Think of the effect of having headphones one; only the person effected by the sound notices how loud it is. (This may be a note more to the employees)."
        }, 
        {
            "index": 214, 
            "rating": 4, 
            "review": "We have to get crepes from La Creperie every time we're in Vegas. Ahhh, how delicious they are. It seems the price goes up annually, but 1 crepe is enough for a meal. The most difficult thing is to choose what kind to have. The savory crepes are just as delicious as the sweet ones. This is a fairly inexpensive way to eat in Vegas, and since it's a casual seat-yourself setting, good for kids and a quick meal without having to pay tips or wait to be served. Did I mention these crepes are absurdly delicious?! My favorite - the Napoleon; lemon custard with berries. Now I'm hungry..."
        }, 
        {
            "index": 215, 
            "rating": 3, 
            "review": "I recently discovered I'm having a serious issue in Vegas with some of these old dumpy hotels. We came into Paris to grab a crepe before we were headed home and not only are they just not that fantastic, you have to endure these run down hotels to access these places. \n\nThere are a handful of hotels in Vegas that you can have a really nice experience in and there are others I just don't need to step foot in.\n\nThat being said, I can probably find a crepe at one I can stand to be in but we did stop off at La Creperie. I've been here plenty of times in the past. YEARS ago, many, many years ago when Paris was actually a fairy decent/average acceptable hotel and a couple times in the last few years.\n\nI ordered the Fresh Berry - it was less than satisfactory but my boyfriend ordered the Ham and Cheese which was actually pretty tasty. \n\nDefinitely go Savory over Sweet here and that's something you'll very rarely catch me suggesting as I'm a total sweets girl! Love em'. Team Dessert forever! but you will be disappointed in the Sweet options, I have been the past couple of times I've had a crepe from here. The ingredients don't taste fresh or of good quality, this is strictly filler food. If you've had one two many drinks and don't care about how many calories you're puttin' away - order one."
        }, 
        {
            "index": 216, 
            "rating": 3, 
            "review": "I love this little creperie in the Paris hotel. They have a full menu of both sweet and 'savory' (e.g, chicken) Crepes for whatever mood you're in. The Nutella Crepe is my favorite here and it comes with bananas, hazelnuts and chantilly cream on top. C'est bon!  There is a little dining area next to it where you can sit down and enjoy your crepe. Be prepared for long waits here at breakfast and noon."
        }, 
        {
            "index": 217, 
            "rating": 4, 
            "review": "Super yummy. I've had the Nutella, rhubarb, and fresh berry crepes. If you're in vegas, you NEED to come here and get a crepe. Seriously.  Do it."
        }, 
        {
            "index": 218, 
            "rating": 5, 
            "review": "I love this place. We are staying at Paris and have gotten crepes for breakfast every day. My favorite is the Bananas Foster. So incredibly delicious! Some other reviewers have mentioned flimsy utensils and paper plates, but who cares, really? The crepes are the best!"
        }, 
        {
            "index": 219, 
            "rating": 1, 
            "review": "Waiting too much,\n10$ for a shitty crêpe. Only sugar and cream. And even the fruits are terrible.\nDon't buy a dessert here"
        }, 
        {
            "index": 220, 
            "rating": 2, 
            "review": "Mmm 2.5 to 3 stars.\n\nHad rhubarb mascarpone crepe - nothing was terribly wrong but nothing was better than average either."
        }, 
        {
            "index": 221, 
            "rating": 4, 
            "review": "This is always a must visit on vegas trips.  I've had the St. Louis crepe (ham and cheese) and Nutella (peanut butter and banana). Yumm this place is consistently delicious every time.  The 20 minute wait is worth it for these crepes, just try and find a table early on since the seating is shared with the café next door. Seems a little pricey at about $10 but what isn't pricey in Vegas?"
        }, 
        {
            "index": 222, 
            "rating": 3, 
            "review": "The crepes are pretty good, but I've got nothing to compare to. I've never had a crepe before now! lol\nLe Creperie offers 7 savory and 8 dessert crepes, all made in front of you. Takes about seven minutes from order to plating.\nThey'll pack it to-go if you want. \nSome of these are crazy rich--my husband's cinnamon bun crepe was so sweet I just couldn't take a second bite.\n\nFour stars and not five because:  \nA-the checkout staff were not very friendly; I dunno..I guess I just wanted them to be smiling and interact with us, but maybe after doing this day in and out, they get jaded..? Especially the cook wearing the huge poofy white chef's hat--he looked like a character you'd want to get a hello from. \nB-there just isn't a large selection of crepes. I thought we'd go and see double the options...or maybe just a mix and match option..? I just now saw that their website suggests you add ice cream or other add-ins/mix-ups, but these items/options are not listed anywhere around the venue.  \nC-they used processed meats in some of these...my ham and cheese crepe had sliced lunch meat in it--for their prices, and for a place that calls itself \"French inspired\" I feel that actual ham should be used. \nD-they really use brand name Nutella. There was a massive jar of it behind the counter. That disappoints me. Nutella is \"just ok\" to me..it is pure sugar. Why not try something like Justin's brand of hazelnut spread? It's different because of the lower sugar content. My grandma would say it's because we Americans are used to a crap ton of sugar."
        }, 
        {
            "index": 223, 
            "rating": 3, 
            "review": "The line for La Creperie wasn't too long when I got there; maybe 5 people ahead of me. But it seemed like the line took soooo long to move. There's only one person taking orders as well as handing out the crepes once they are done. I actually noticed that my crepe order was ready for a while before the cashier/order taker/food giver noticed. Operations would be much more efficient if they had another person handing out the crepes. \n\nIf you're a Total Rewards member, you can get a discount on the crepes, but they also offer a crepe special where you can get a crepe and a drink for less than what the price of a crepe costs. I'm not sure how they make money off of that, but whatever, my mom and I both ordered the special. I got the ham and cheese crepe and my mom got the fresh berry crepe. Both were good, but I thought my ham and cheese was a little dry and could have used more cheese. The fresh berry one could use more berries. For the price we paid, I was expecting a little more. \n\nSeating is pretty easy to find as there's an open sitting area next to La Creperie. If the restaurant next door is closed, you can also sit there. \n\nI probably would try a crepe again, but only if there wasn't a line!"
        }, 
        {
            "index": 224, 
            "rating": 5, 
            "review": "We didn't think these crepes will fill our stomach. \nWe ordered one crepe per person and it was enough to fill each of us!\nCheese and ham was very good, so is Suger and butter. So simple but tasty."
        }, 
        {
            "index": 225, 
            "rating": 4, 
            "review": "Mmmm giant, enormous, bundles of crepes! I'm sad because the price of one individual crepe sky rocketed to $9.99 each compared to back then, they were like $7.99 :( I know, not a big difference, but two dollars can change a life you know.. ANYWAYS I can't believe that this place is hidden inside none other than Paris. It's right across from that long ass line for the buffet, but why wait when you could conveniently get it to go right? There are some ups and downs to the crepes though. I haven't tried all of it, but if you like something that tastes like potpourri, then get \"The Favorite\" which is I think #1 on the menu. It's a combination of random fruits which over powers the crepe itself. I honestly don't like it :( If you want something as a dessert, I suggest you get either the Nutella, Chocolate or Suzette. I know for sure that those are yummy, but I have yet to try the others, so if you want to be adventurous and try something else, then hell, go for it! :) My last comment for the evening is.. the Fruits De Mer, also shortly and casually known as \"Seafood Crepe\" -___-. It's awesome for seafood lovers though! It has scallops, mushrooms, shrimp, and mozarella. Doesn't sound good but it is! Nom nom nom"
        }, 
        {
            "index": 226, 
            "rating": 1, 
            "review": "EWWWWWWWWWWWWWWWWWWWWWWWW!!!!!!!!!\n\nworst crepe ever!! i got the standard nutella with berries/cream....it was disgusting!"
        }, 
        {
            "index": 227, 
            "rating": 4, 
            "review": "We ordered the Nutella crepe. The flavors were spot on. The misses preferred that the hazelnuts were just toasted instead of candied and the banana was less ripe, but otherwise hit the mark. Everything in Vegas is expensive, so no surprises on costs. The actual crepe itself had a great flavor and there was plenty of Nutella and filling."
        }, 
        {
            "index": 228, 
            "rating": 5, 
            "review": "This is a family favorite. We try to eat here whenever we are in Las Vegas. Lines can be long around breakfast and lunch times so try to arrive at off hours. \n\nBoth the savory and the sweet crepes are fantastic so we typically order one of each and share. The Nutella banana is my son's favorite while my husband usually goes for the ham and cheese. \n\nWe have not found one yet that we did not like so you really cannot go wrong with anything on the menu."
        }, 
        {
            "index": 229, 
            "rating": 4, 
            "review": "What does an early-bird bahelorette do when she's been up since 7am and is patiently waitng for the girls to get ready? Food run. We were stayin at Paris, and having only had a few hours off my feet after strutting around Vegas in 4.5 inchers til 4 - I wanted close and quick.\n\nI ordered the Forestiere and added meat - it was good. The bechamel was better the other day than this morning. I also ordered the Du Soliel and the Berry one. I advise you to go when no one is in line - our crepes came out crisp and were filling and delicious."
        }, 
        {
            "index": 230, 
            "rating": 2, 
            "review": "I ordered the St. Louis (ham, cheese, and basil) savory crepe.  Unfortunately, I wasn't impressed.  My crepe was too thick and the ham was all where the fold of the crepe was.  There wasn't a lot of ham either, and it tasted like supermarket deli ham.  Maybe their sweet crepes are better."
        }, 
        {
            "index": 231, 
            "rating": 5, 
            "review": "Yummy! I got the lemon blueberry crepe and it was delicious! \nIt was supposed to $11.75ish since I don't have a rewards card, but they had a special and you could get any crepe and a drink for only $10.99! What a steal! \nAlso, we only had to wait a couple of minutes, so that was a huge plus!"
        }, 
        {
            "index": 232, 
            "rating": 3, 
            "review": "I reallyyyy really wanted dessert after eating not the best dinner...and since we were back in the hotel at Paris I decided to stop by here.\n\nThe cashier lady was very nice and kind, but seemed to have a bit of trouble at the register.  I think maybe something was broken so it took a while for us just to get to order.\n\nI ordered the Napoleon crepe, lemon custard, berries, chantilly cream, nom nom nom! It was REALLY good, the tartness of the custard and lightly sweet thick chantilly cream worked well together.\n\nUnfortunately they don't fill all the way to the edge so the front tip of the triangle is filled while the back end is just crepe.  Is that how it's done in Paris?  I also feel like they were a bit too thick and eggy to be considered \"good\" crepes, but it was tasty nonetheless. I think the filling just sold me...\n\n$9.99 does seem expensive to me for a crepe since they are kind of cheap to make...but it is Vegas so got to expect everything to be expensive :P\n\nI MIGHT come back here again just for the Napoleon...if I'm ever in Vegas again..."
        }, 
        {
            "index": 233, 
            "rating": 4, 
            "review": "Delicious desert crepes. If you're staying in Paris hotel, this is a no brainer. Very berry crepe is probably the best of all. The two issues are big lines and hard to find a place to sit and eat."
        }, 
        {
            "index": 234, 
            "rating": 4, 
            "review": "Yummy warm savory crepes for breakfast. Pricy but delicious, vegas price after all.  Always a long line to order but food came relatively fast."
        }, 
        {
            "index": 235, 
            "rating": 5, 
            "review": "They can be a bit busy but it's awesome place to stop for a breakfast savory crepe or a sweet one. Their prices are reasonable for their location (in vegas) but I'm still bitter about paying 7 for a bottle of water LOL"
        }, 
        {
            "index": 236, 
            "rating": 4, 
            "review": "Great quick food for Paris or Bally's.  Desert or savory crepes filling enough for a quick breakfast or a light lunch.  My favorite is the St Louis which is ham, creamy cheese, and a touch of fresh basil.\n\nMy GF loves the chocolate crepe if you have a sweet tooth.  Seating can be tough to find if it's a weekend, but they give you free re-fills on the coffee, and the service is about as fast as you can get for a quick bite in Vegas."
        }, 
        {
            "index": 237, 
            "rating": 4, 
            "review": "good food prices a little high other than that it's good. i dont think I'll go back unless i am really craving crepes"
        }, 
        {
            "index": 238, 
            "rating": 3, 
            "review": "Shared the \"cinnamon bun\" crepe.  It was a proper crepe thickness, but I felt it was overfilled.  They definitely added a massive amount of frosting to it!  Thankfully the accompanying whipped cream wasn't overly sweet.\n\nIt was great at first bite, but less so as it was consumed.  The sugar really catches up to you!  I regretted not getting a water.\n\nProbably somewhat overpriced, but service was fast, and they didn't put too much ice in my dining companion's Pepsi."
        }, 
        {
            "index": 239, 
            "rating": 1, 
            "review": "Wasn't like it used to be. I had the nutella crepe. It was crispy instead of soft and pillowy. I'm surprised to say that there was too much nutella to crepe ratio. Banana was fresh. Whipped cream was awesome as before. It's not the same as it used to be."
        }, 
        {
            "index": 240, 
            "rating": 5, 
            "review": "Crepes her are amazing!!!!  There is a 20 minute wait to get your crepe during the peak times, but it is well worth the wait!\nI go with the St. Louis.  The ham/basil/bechamel combo is amazing.  The dessert crepes are great too.  \nI usually stop at the bar across the hall for a white russian or screwdriver. Definitely one of my favorite places for breakfast in Vegas."
        }, 
        {
            "index": 241, 
            "rating": 4, 
            "review": "So the crepes at this place was good and the price wasn't over the top. I got the Toulous crepe with pepperoni, sausage, cheese, mushrooms, with tomato sauce. It was a hearty meal for the price I paid for it. The service was quick.\n\nEvery time I'd walk pass this place, I would always see a mass amount of people huddling over this little place. Now I can see why. \n\nIf you're on a budget in Vegas, I suggest coming here for your meals, but if you're not, then there's plenty of things to indulge on the Strip."
        }, 
        {
            "index": 242, 
            "rating": 3, 
            "review": "I wish I can give you a honest review on this place, but because I was still feeling a bit \"hungover\" from the night, I don't think we made the right decision to eat here.\n\nI did like the prices and the size of the crepes. However, the variety is lacking. \n\nI think I had the one with the shrimp and mushroom. I had more mushroom than shrimp, but I'm a mushroom kind of gal so I wasn't complaining. I wish they put more basil on it, cause I was excited about that, but if you're looking at the pictures, it's a little CLUMP of basil.\n\nDamnit, why couldn't you put it in the crepe! IT'D MAKE IT TEN TIMES BETTER!"
        }, 
        {
            "index": 243, 
            "rating": 3, 
            "review": "I've always seemed to pass by here as a pit stop at least once every time i go to vegas with family or friends.\n\nThe crepes here are very good. I mainly order the dessert ones though.. last time was warm apples with whipped cream.. and the other time with strawberries... I''ve eaten here for lunch before.. and their selections are very few but very healthy and for a good price.  service is very good.. the typical french lunch food.. salads/light pastas/sandwiches..\n\nbut I would mainly go here for their crepes.. express window! and hop across the crepery to get an eiffel tower drink :) to walk around with around the strip!"
        }, 
        {
            "index": 244, 
            "rating": 3, 
            "review": "The crepe that I had was alright tbh.\n\nI got the Nutella one and shared it with 2 of my friends. Portion size was pretty good as it was filling for the 3 of us.\n\nThey gave a generous amount of Nutella & bananas (which was awesome!). However, there was no consistency on how they were spread out in the crepe. Half the crepe had a lot of Nutella and half didn't. I also thought the taste of the crepe itself was nothing special (it's something that I could make by myself at home). They also add these caramelized clusters of nuts, which was weird and hard to chew on. There's typically a lot of people so the wait can be a little long.\n\nI say if you're really craving crepes in Vegas then this place could be worth it but there are definitely better crepes out there."
        }, 
        {
            "index": 245, 
            "rating": 2, 
            "review": "Not impressed.  My out-of-town friend and I were strolling in the Paris hotel when we got an urge for crêpes....saw La Creperie and decided to check it out.  First, we were the only ones ordering crêpes.  No excuses for poor or slow service, right?  Second, le monsieur at the window must have been having an off day because he didn't smile at all.  I have heard from reputable sources that French ppl are not the most gregarious of folk, but sheesh.  Would it kill ya to smile?  Third, our Napolean (lemon curd/berry) crêpes needed more curd.  There was only a teaspoon or so of the curd which translates to too many naked, dry crépe bites.  Perhaps I should try the savoury crêpes to compare? \n\nOur crêpes took longer than I thought to make, given the fact that there was no one else ordering anything.  Will I return?  Probably not.  Hélas.  Le sigh."
        }, 
        {
            "index": 246, 
            "rating": 5, 
            "review": "Had the breakfast crepe with their coffee.  Both were very good.  Loved the freshly made crepe with eggs and other breakfast goodies.  Will definitely repeat next time we're in Vegas."
        }, 
        {
            "index": 247, 
            "rating": 5, 
            "review": "I won't wait in a line, anywhere. Waiting in line is not a good look. I make an exception for this place. One of the most reasonably priced places to eat in all of Vegas. They are consistently good. When in Vegas I have a crepe for breakfast, and another for a midnight snack.\n\nTips from a regular.....\n\n - They stop taking orders about 15 minutes before they close. So if when they close at 11 pm, you need to be in line by 10:45 pm.\n\n -  Order the combo. No matter the crepe's price, if you order a combo, you get the crepe and drink for 10.99. Depending on the time of year, the combo might be 9.99. The combo is a better deal than the rewards price. \n\n - If you get a soft drink or coffee, just ask for your drink cup, then go next door to JJ's Boulangerie, for your drink. The crepe window is part of JJ's, and inside JJ's they have a larger selection of soft drinks and teas."
        }, 
        {
            "index": 248, 
            "rating": 4, 
            "review": "This was my first crepe ever, so I dont have much crepe experience. But i can pick out some faults...\n\nThe boyfriend and I came here this past weekend, and were delightfully satisfied.\n\nI ordered the D'Anjou. Which is a sweet crepe, with Almond Paste, Pears, and walnuts, topped with caramel sauce. Now, when they say \"topped with a caramel sauce\" they actually mean: \"3 skinny lines of caramel, carelessly scattered across your plate and crepe\"\n\nIt was delicious though. The pears were canned, which at first, i was against, but then as i was eating it, i came the the conclusion that they were perfect because fresh pears would've been too hard. these still had a nice bite to them though, they weren't soggy. The almond paste gave a sweet, smooth, nutty blanket in the background.. it wasn't over powering with almond flavor.\n\nThe boyfriend ordered The Favorite. which was also a sweet crepe, stuffed with all types of berries (blueberries and strawberries come to mind, but i know there were more) topped with a berry sauce. It was very tangy, which complimented the sweet crepe perfectly.\n\nThe down side to this place, is the line. You order, and then spend 15-20 mins (depending on how big the line is.. more or less.) standing off to the side, waiting for your number to be called. Oh, and bottled water is $4 (for the small bottle) and $5 (for the bigger bottle.) \n\nThe crepes are about $9... so for both our crepes, and 2 waters, the total came to $30. Was it worth $30? No. Not at all. But that's Vegas... you're mostly paying for where you're eating, secondary is WHAT you're eating."
        }, 
        {
            "index": 249, 
            "rating": 5, 
            "review": "Amazing crepe, and yes it was expensive, but it was big enough for two so it was not like it wasn't worth it. And considering it is inside a strip hotel, it could definitely be worse..."
        }, 
        {
            "index": 250, 
            "rating": 4, 
            "review": "A hidden little gem that's cheap (for Vegas) and where the crepes are great. If you're looking for a light meal and an inexpensive at that, look no further."
        }, 
        {
            "index": 251, 
            "rating": 3, 
            "review": "Ate a roasted chicken with pesto crepe. Didn't feel like dessert for the first meal of the day and I wanted something that wasn't too cheesy. This crepe was mediocre. Couldn't finish it cause it started tasting weird in my mouth. Friends got ham & cheese and nutella. They seemed to enjoy theirs. I didn't try it.\n\nThey have a meal deal of crepe + soda/coffee for $10.99 which is pretty good considering most of the crepes are more than this by themselves. They also charge 50 cents for a cup of water, which you get next door at the pizza place.\n\nWouldn't go out of my way to eat here."
        }, 
        {
            "index": 252, 
            "rating": 5, 
            "review": "FYI:  I am not reviewing the coffee, the price tag, or anything else on this review.  I consider them all worthy of being considered as criteria on the five star scale, but some food items are so tasty as to render all flaws meaningless.\n\nEnter the peanut butter crepe.\n\nOrdinarily when I go to Le Creperie I order the nutella crepe.  Chocolate hazelnut goo inside a thin, chewy, magical crepe and buried under a mountain of whipped cream.  But this day I saw on the menu a different crepe.  My wandering eyes betrayed the nutella and settled on \"banana\" and \"peanut butter\" and saw no alternative.\n\nThank you, wandering eyes.  If you could distill Beethoven's fifth symphony into a dessert, this crepe is what you'd get.  Ripe bananas bursting with sugar.  Peanutty, not-sweet peanut butter for contrast, and then a pound of whipped cream and carmel sauce all accompanied by a crepe make for one of the best desserts I've ever had.\n\nYes, you need to take your keys to your car, put them in the ignition, and drive straight to LV to get this crepe."
        }, 
        {
            "index": 253, 
            "rating": 2, 
            "review": "Crepes are delicious, but a little pricey - what you would expect on the Strip.\n\nHowever, the dining room is poorly maintained.  It is usually not clean, and most of the chairs are broken - many are mismatched extra banquet chairs.\n\nBoth times I have dined here recently, they have gotten my order wrong.  One time, they forgot one of the crepes, and were rather rude when we brought this to their attention.  The next time, they tried to charge us for two crepes even though we only ordered one.  Not sure why the staff here has such a difficult time taking orders properly.\n\nMy biggest complaint is that they charge for water.  I find it to be unacceptable service when I pay for food and tap water is not available free of charge.  Furthermore, if you are going to charge me for a cup, it would have been nice to give me a full size cup, rather than a very small one, which I had to refill multiple times.  I asked if I could have the larger cup instead, and the answer was a firm no.  I understand that they want it to be plastic, so that it is see-through, and more difficult to steal a drink other than water, but make it a bigger size.  This kind of nickel and diming is no way to treat paying customers and says a lot about why Caesars, which owns the Paris, is $25B in debt and nearing bankruptcy."
        }, 
        {
            "index": 254, 
            "rating": 5, 
            "review": "Delicious!!\n\nYes. I had a sweet crepe for dinner on my last night in Vegas. I lived it up, yo. Bananas Foster Crepe to be specific. Total diabetes on a plate....but worth the insulin shock for sure. My companion had a savory crepe - mediterranean - and loved it.\n\nUpon licking my plate clean, I was stuffed and completely shaky from the sugar rush. Had a lovely cup of decaf coffee to accompany the sugary, caramel-y, banana-y (yea...making up words now) fabulousness.\n\nThere wasn't a line and the crepes were prepared to order very quickly. The woman behind the counter was lovely - full of smiles and pleasantries."
        }, 
        {
            "index": 255, 
            "rating": 4, 
            "review": "This place is a \"must-have\" if you're in the mood for great, classy dessert on the Vegas strip. Its right in the heart of he \"streets\" of Paris hotel, which makes it authentic and fun. The Dessert crepes were delicious (I had the apple one).\n\nThe only reason I have it four stars instead of five was because it was takeout instead of sit down. They have seats available but you have to order and wait for food, then sit down. It could have been really classy if they served it and had more formal seating. Still MUST have this. So good!"
        }, 
        {
            "index": 256, 
            "rating": 4, 
            "review": "Not bad. A bit overpriced. Coffee subpar."
        }, 
        {
            "index": 257, 
            "rating": 4, 
            "review": "$10 is a reasonable price for a crepe especially in Vegas. What I did not expect was how big of a crepe I would get. It more than justified the price and left me utterly too full in a I should not have finished it but it was really good kind of way. The Foresterie was filled with spinach and mushrooms. Gigantic! I tell you. Le Creperie a great place for a good no frills bite to eat."
        }, 
        {
            "index": 258, 
            "rating": 5, 
            "review": "Perfect place for a quick morning breakfast! I wish they had a larger selection for coffee."
        }, 
        {
            "index": 259, 
            "rating": 4, 
            "review": "This is my second time eating here and it's very good.  Both times I got the seafood crepe...YUMMY!"
        }, 
        {
            "index": 260, 
            "rating": 4, 
            "review": "This review is only for the crepe I had...it definitely satisfied my crepe-craving and sweet tooth! It had nutella, whipped cream, caramel, chocolate sauce, bananas, and candied hazelnuts. There is no possible way to have a bad day in Vegas when you start off breakfast like this ;)"
        }, 
        {
            "index": 261, 
            "rating": 4, 
            "review": "After reading all reviews about this place, decided to go for breakfast couple of days ago. We ordered a shrimp scampi crepe and a fresh berry crepe. There was a long line and we waited and got our order. The crepe itself was so soft and fluffy and just melted in my mouth. I loved the fresh berry crepe and my son loved the shrimp scampi crepe. Overall we loved it."
        }, 
        {
            "index": 262, 
            "rating": 4, 
            "review": "The pear dessert crepe was super delicious!  The pears were diced up small and lightly sweetened, and the crepe was made to order, meaning fresh and soft!  Also I had a cup of grande-sized coffee with a small bottle of Bailey's Mint-flavored Irish Cream added, for an extra $2.50.  One dessert crepe (huge portion) and a cup of coffee for $18-ish was such a steal in Vegas!!  \n\nSeriously, this place is good!  Every time I go to Vegas, I have to stop by La Creperie to get my crepe fix!  Both sweet and savory crepes here are delish!"
        }, 
        {
            "index": 263, 
            "rating": 5, 
            "review": "Super yummy!!!!  I haven't had a nutella crepe since we were in Paris, France!  mmmm mmmm mmmm.  My husband and I shared both the sausage/mushroom crepe and the nutella crepe.  They were both really good.  Sure, the savory one was just like pizza, but it was really good!  You seriously cannot go wrong with nutella, so I have no complaints at all!  yummy yummy yummy!"
        }, 
        {
            "index": 264, 
            "rating": 2, 
            "review": "Note to self: NEVER order the seafood here. EVER. (One more time for effect.) EVER. \n\nIt's not fresh, smells fishy, and is gross.\n\nThe boy ordered your regular dessert-style crepe, and he said it was alright............... Maybe the next time I find myself in the Paris, I'll give it another shot."
        }, 
        {
            "index": 265, 
            "rating": 4, 
            "review": "I was walking back to my room in the Paris mall this past weekend while I was in vegas and ended up passing by this place. Even though I was super tired at 6:15 A.M. and wanted my bed at that point I decided to stop at this place. at that point they were getting ready and stated that they would open at 7. So I decided to go back and gamble until 7 A.M. since I was really hungry. (I do not recommend you continuing gambling once you have decided to stop haha). Once I get back at 7 they stated that still needed another 10 minutes to open. So I waited. Even though I was the second person in line it took 20 minutes for them to make two crepes which I though was more then it should've taken. I got the Nutella banana fosters crepe which was absolutely amazing! I would defenitly get it again next time if I stay at Paris. The reason for the 4 stars is due to the amount of time it took to make two crepes and them not opening when they promised it would be open."
        }, 
        {
            "index": 266, 
            "rating": 3, 
            "review": "I would probably give this place a 3 1/2 star rating. What's nice is that you have a variety of choices from sweet crepes to savory crepes. What I really didn't like about the place was the prices for the crepes. Expect to spend over $10 for each crepe, even if it's just the Nutella one!\n\nI ended up getting the breakfast crepe and the crepes themselves tasted like a regular crepe with really nothing special added to them to make them stand out. To me spending over $10 isn't worth it at all. Now if the crepes were around $6-$7 then this place would probably be a 4-5 star review, but again you're paying for that premium price since the place is inside of the Paris hotel and would be more convenient for those staying at the hotel."
        }, 
        {
            "index": 267, 
            "rating": 3, 
            "review": "Doesn't compare to the real deal but close enough for Vegas. I got the St. Louis for lunch. The line was long and so was the wait time. The portions are generous and fairly cheap (around $10 per crepe) but there is no overall pizzazz to the food. More quantity over quality."
        }, 
        {
            "index": 268, 
            "rating": 2, 
            "review": "La Creperie only reinforces why I never try crepes at touristy attractions. Although they have both dessert crepes and savory ones, I always try the dessert. We ordered the Favorite, which was filled with raspberries, blueberries, and strawberries topped with raspberry coulis (another fancy name for raspberry sauce). The crepe was a little soggy and too thick for my liking. The raspberry sauce was too tangy I had to counteract it with whipped cream. I've had good raspberry sauce and a little tang is good, but this was too much. But maybe you'll have a better experience with a different crepe and maybe I would have given you a better review La Creperie if you had a better raspberry sauce and I didn't have to wait 40 minutes to be disappointed."
        }, 
        {
            "index": 269, 
            "rating": 4, 
            "review": "I ate here a few Monday's ago for breakfast with my girlfriend.  I had looked at the menu the night before and knew that I had to decide between a savory ham & cheese crepe and a more sweet blueberry lemon crepe.  That morning I was feeling savory and so I went over to find a seat in the seating area while my girlfriend did the ordering.  Due to that I don't really have much to say about the place itself since I did not see much of it.  My ham and cheese crepe came out to me looking nice and covered in a béchamel sauce which I mistook as cheese.  The crepe was pretty tasty as ham was good and salty which paired nicely with the Gruyere and it quickly disappeared from my plate.  Whenever my girlfriend had also finished her crepe we started talking about ordering a sweeter crepe for a dessert of sorts.  My girlfriend decided to spoil me and let me have both of the crepes that I had thought looked good the night before by deciding to split the blueberry lemon crepe with me.  She once again went over and ordered and came back with an amazing looking plate.  The crepe was in the center covered in a berry sauce, blueberries and powdered sugar with a Chantilly cream on the side.  In the middle of the crepe was some lemon curd which gave the dish some sourness that worked really well with everything else that was sweet on the plate to keep it from being too sweet.  In the end there was nothing left as we both had enjoyed our meal.\n\nThe bottom line for me is that I would stop by here again in the future.  While I believe that it is a bit overpriced to enjoy on a regular basis, the food is great and it could easily be a nice little treat every now and again."
        }, 
        {
            "index": 270, 
            "rating": 2, 
            "review": "I guess that this being Vegas, this is pretty good food for $10,but it was really under-whelming. It got cold before we could even sit down, and the flavors were kinda boring. \n\nWe got one with prosciutto which had too much meat (too salty), and one with berries that just weren't ripe. The crepe itself was good, but the fillings were just bland..."
        }, 
        {
            "index": 271, 
            "rating": 4, 
            "review": "Convenient location for a quick meal between conference sessions. I actually visited La Creperie twice during the week I was in Vegas, and got to try 3 different crepes by sharing with friends. I tried the fresh berry, caramel apple, and roasted chicken crepes. I highly recommend all three, but my favorite was the caramel apple. Oh my goodness... tart green apples with tons of gooey caramel... soooo yummy :) All crepes were about $10-12 dollars, and one of the days I visited they were running a special so I got a crepe and a fountain soda for $10- cheaper than the crepe alone! \n\nSide note: This is one of the few locations in the shops that you will find a bathroom and open seating... take advantage."
        }, 
        {
            "index": 272, 
            "rating": 3, 
            "review": "Pretty decent crepe with chicken, cheese, asparagus and pesto sauce. Was a little greasy though.  Would prefer the crepes to be cooked a little more than they do.  And what's with the raw uncooked yellow onion?  Yuck!  Overall it's decent but not great.  One other gripe...what's with the two different prices on the same item? One price for gambling addicts...another for everyone else? That's bogus, set the price and be done with it."
        }, 
        {
            "index": 273, 
            "rating": 4, 
            "review": "Sweet and savory! We ordered Nutella crepe and tomato with cheese. It was really good i just wish they diced the tomatoes rather than being big chunks ."
        }, 
        {
            "index": 274, 
            "rating": 5, 
            "review": "I love crepes! And this place was my first good luck in Vegas! \n\nI ordered a roasted chicken crepe, but there was a bit a line and my order was delayed. So the sweet chief made me an apology dessert crepe. Awesome!!!! \n\nThen wow! Both were delicious! \nYou are going to enjoy it if you pass this place next time you are in Paris, Vegas."
        }, 
        {
            "index": 275, 
            "rating": 4, 
            "review": "Unless it's a celebrity chef restaurant in Vegas, I typically turn my nose up at these pretentious places like the Le Burger Brasserie (see earlier review) and La Creperie. It's akin to getting Chinese at those Panda Express strip malls. \n\nFor $9 apiece,  the crepes are really passable. They do stuff it chockful of fresh ingredients. \n\nThree of us shared the Napolean. The crepe is stuffed with berries and a generous amount of lemon curd and whipped cream are ladled on top of it. A perfect blend of sweet and sour.\n\nWe also had the St. Louis, which is ham and fresh basil with bechamel sauce. Not disappointing either.\n\nYes, if you go when the lines are long, you won't find many places to sit as it's not a restaurant. \n\nDefinitely a good snack if you want to save room for dinner. Beats eating junk or McDonald's.\n\n* Photos shot."
        }, 
        {
            "index": 276, 
            "rating": 2, 
            "review": "Expensive crepes, waited close to 30 minutes in line for 1 crepe. I've definitely had better for cheaper. Not worth."
        }, 
        {
            "index": 277, 
            "rating": 3, 
            "review": "OK... The crepes are good.  But the wait time for said crepe is ridiculous.  If you're in a hurry... as many people are who stop by a walk-up breakfast place so they can get on with their day (gambling, convention activities, airport, whatever)... why must they wait 20 minutes for crepe preparation?  And that's 20 minutes AFTER placing the order!\n\nI'm not an impatient person, but there must be a more efficient way to manage crepe preparation.\n\nBTW... the blueberry-lemon crepe was very good."
        }, 
        {
            "index": 278, 
            "rating": 5, 
            "review": "I always make an effort to stop by La Creperie when I am in Vegas because they have hands down the most delightful crepes on the strip. \n\nThe cobblestone road and cute French ambiance drew me to this crepe stand the moment I spotted it. Not only is the location lovely (and convenient if you are staying at the Paris Hotel & Casino), but the service is quick and the crepes are prepared within a couple of minutes. The portions are also very generous and can easily feed two.\n\nThis place is an absolute gem, and I have never had a bad experience eating here!"
        }, 
        {
            "index": 279, 
            "rating": 5, 
            "review": "My god.... the first time I had the 3 cheese crepe from this place this is a must for all locals and tourists\n\nOrder the 3 cheese crepe \n\nIt's fantastic \n\nI've had these in Paris, France and they are better in this hotel\n\nThere is always a line, crepes are about $10\nThere's a small sit down area \n\nI get crazy cravings for the 3 cheese crepe\n\nJust thinking about this place I go crazy"
        }, 
        {
            "index": 280, 
            "rating": 4, 
            "review": "Last day in Vegas and had to stop here for crepes.   Ordered a breakfast crepe and a bananas foster crepe.  Both were excellent!\n\nOrdered from the walk up window and was easily able to find a table facing the busy casino/walkway area.  The only drawback and reason I give 4 stars instead of 5, is the coffee.  I really enjoy good coffee and the coffee here is barely average. \n\nStop in here morning, noon, or night for the crepes.   You will be happy you did!"
        }, 
        {
            "index": 281, 
            "rating": 3, 
            "review": "3.5 Stars \n\nPleasant surprise... crepe was better than we thought it would be. We decided to stroll down for breakfast, and decided to try this place out. $10 crepes are huge! Good for 2 people. We got a savory crepe. Can't remember the name exactly, but it had prosciutto, cheese, beshamel sauce, and basil. It was pretty good. Next time we'll have to try the sweet crepes."
        }, 
        {
            "index": 282, 
            "rating": 3, 
            "review": "The crepes were okay.  I've had better savory crepes.  They do give large crepes and I couldn't even finish all of my dessert crepe because it was so filling and rich.  I don't think I'll come again, but it is a fun place to stop by though and there is plenty of seating to the side of the order counter."
        }, 
        {
            "index": 283, 
            "rating": 4, 
            "review": "For the lunch crepe it was 4 stars, I don't know how the dessert ones are, they look really good. \nI got the chicken crepe, it was okay, had a few pieces of chicken I couldn't eat in it. But I liked the convenience and easy seating. \nI probably won't be back for the lunch crepes but maybe for the dessert ones!"
        }, 
        {
            "index": 284, 
            "rating": 4, 
            "review": "The ham and cheese crepe was awesome. We went around dinner time and we had to wait like 15 or so minutes for our food and it was really hard to find a place to sit at since it was all open seating shared with other eateries. Maybe come earlier or later to have more space."
        }, 
        {
            "index": 285, 
            "rating": 4, 
            "review": "We always get the French riviera and salmon crepes and they are delicious! We have also had the chicken cordon blue, but the chicken was a little overdone. This was still very good and it came w/sautéd spinach and fries and a delicious cream based mushroom sauce.\n\nI think they also have 1/2 off bottles of wine on Mon & Tues. This place has adorable decor and I can't wait to go check out the new downtown long beach location."
        }, 
        {
            "index": 286, 
            "rating": 2, 
            "review": "When we came the first time we were told we would have to wait 30 min so we left. However, when we passed by 10 min later the place seemed to be working again.\n\nWe ordered 2 crepes. One was barely warm, the other was cold inside so we had to ask to make it again. To make things worse, the supposedly vegetarian tomato mozzarella crepe had pieces of ham in it!\n\nIf you want a crepe, do yourself a favor and go to Jean Philippe Patisserie in Bellagio just across the road - it's INFINITELY better!"
        }, 
        {
            "index": 287, 
            "rating": 3, 
            "review": "This is good.. sort of a Vegas tradition for us now to eat here once per visit.\n\nIt's basically just a window, but crepes are not a normal sight, so stop by once, for breakfast, or for dessert."
        }, 
        {
            "index": 288, 
            "rating": 5, 
            "review": "Omg! It was like heaven. So yumi. So large...have an appetite because it is so very much food. The staff was friendly and helpful. I can't wait to go back!"
        }, 
        {
            "index": 289, 
            "rating": 4, 
            "review": "It's surprisingly hard to find a place on the Strip that still serves breakfast after 11 a.m.  Come on, we're in VEGAS!  No one goes to bed before 3 a.m. here!  Do we really have to be up and out of the hotel room by 10 a.m. for a decent breakfast meal?\n\nThat's how we ended up at La Creperie.  They actually had a crepe (the \"Du Soleil\") with veggies, scrambled egg, cheese and bechamel sauce on top.  Not the best crepe I've ever had, but fulfilled the egg requirement and was pretty tasty overall.  There was a fruity one that would have sufficed for breakfast as well, but I needed the protein.\n\nService was fast and friendly, and prices are better here than most places we found."
        }, 
        {
            "index": 290, 
            "rating": 4, 
            "review": "The #4 Nutella and a Starbucks latte solved my wife's hang over blues every morning -patience required since its popular"
        }, 
        {
            "index": 291, 
            "rating": 4, 
            "review": "Food was amazing. Tried the Tomato Mozzarella, Nutella, and Cinnamon Bun-all delicious. Service was a tad slow, but didn't wait longer than 6-7 minutes for 4 very fresh crepes. All in all, would try again!"
        }, 
        {
            "index": 292, 
            "rating": 4, 
            "review": "I love the Paris! Every time I come visit the Silver State I love to stop here for a quick delicious crepe and a role of the dice lol!  My favorite crepe is the Spinach Artichoke Crepe.The crepe is large and is made with three different types of cheeses, fresh spinach and artichokes topped with a pesto sauce. Yum!!"
        }, 
        {
            "index": 293, 
            "rating": 1, 
            "review": "$10.75 for a fresh berry crepe... \n\novercooked.. how do I know, uh because it was hard to cut then made a crunch when I bit it. There was also a crunch from the granulated sugar filling ... interesting yet not what I expected. The hair mixed in with the berries grossed me out. yuck."
        }, 
        {
            "index": 294, 
            "rating": 5, 
            "review": "The bananas foster was delicious! not overly sweet but just perfect. It was very big. Definitely splitable between 2 people.\n\navoid paying $4 for bottled water and get free water next door!\n\nOnly down side was the wait time but there was only one chef. Also, hard to find a spot to sit sometimes."
        }, 
        {
            "index": 295, 
            "rating": 4, 
            "review": "One of my favorite places to go for breakfast in vegas. Its open all day so you can go anytime of the day to get crepes and I like that it has both dessert and savory crepe options. Each is about $10 and they are very generous with the crepe filling and toppings. I usually get their savory crepes and they never disappoint. The ingredients are very fresh and I like that they don't make the crepe until you order so you know the crepe is also made fresh. The service is very fast and it is a very large crepe. They also have juices and coffee, everything you need for a quick brunch or bite to start off your day. Its not a formal restaurant so the only tricky thing is that it doesn't have formal seating. It shares the seating area with other eating places around the area so once in awhile it might be hard to find a seat but the few times I've been there I've never had a problem. I've gotten the mozzarella and prosciutto crepe, the shrimp and scallop crepe as well as the banana foster's crepe (the only dessert one I've tried) and they've all been good. I highly recommend this place!"
        }, 
        {
            "index": 296, 
            "rating": 4, 
            "review": "This place is TOTALLY worth the $10.  You get a decent list of sweet and savory crepes, all for the same price.  I got the Favorite, which is the trio of berries drizzled in raspberry sauce, with whip cream.  They give a GENEROUS serving of berries inside the crepe.  I thought the syrup was a bit on the sour side, so I had to eat a lot of the whipped cream with it to balance out the sourness.  I would totally come here again and try all the different dessert ones!!!!"
        }, 
        {
            "index": 297, 
            "rating": 5, 
            "review": "This places is awesome. My sister, My grandma and I were waiting for our guest to arrive here, and while waiting we enjoyed the garlic fries, crepe vendome(?) (which was AMAZING, who knew apples and chicken tasted so good) we had a fruit plate and croissants, sipped on hot chocolate while my grandma and sister drank mimosas. Once our guest arrived we placed our orders with our fabulous waitress and shortly after our food came. Don't remember what my grandma ordered but it was a delicious looking crepe. My sister had the healthy start crepe which she greatly enjoyed, It was a sweet crepe with yogurt, strawberries, bananas, toasted almonds and topped with honey(:  David our guest, had the croissant breakfast sandwich. I had the Belgium waffles with strawberries and cream, maple syrup, and nutella. It was phenomenal. I definitely recommend this place(: food was totally worth the wait, but some items on the menu were a wee pricey,  for example the fruit and cheese sampler was 10 bucks. Yikes!!  But nonetheless this place was amazing and I would highly recommend La Creperie to everyone(:"
        }, 
        {
            "index": 298, 
            "rating": 4, 
            "review": "Ordered the roasted chicken with sun- dried tomatoes and asparagus crepe and pesto sauce because there was no wait and wanted something quick. It was very good and was bigger than I expected. There's no sweetness to it like a dessert crepe. The chicken was flavorful but would like it to be more creamy. Other than that I thought it was quite filling."
        }, 
        {
            "index": 299, 
            "rating": 2, 
            "review": "I used to LOVE this place a couple years ago. My friend wanted to try it & I was down, considering I really enjoyed their crepes. \n\nOrdered the Nutella crepe w/ banana (extra $2.00). It was good, but not as good as I remembered. Maybe not worth my $10 anymore, which totally sucks. It didn't seem like there was a whole banana in there either, ugh. \n\nNot sure if I'll be back here again. It kinda lost its edge in my book. I'd rather use my $10 somewhere else."
        }, 
        {
            "index": 300, 
            "rating": 5, 
            "review": "This place is a MUST every time we visit Vegas. No matter what time of the day, this hits the spot.  \n\nI usually get the \"Favorite\" and the hubs gets the ham and hollandaise.  Of course, then we share.  We have tried others and not been disappointed once.  \n\nConsider you are in Vegas when you pay.  Everything in Vegas costs a little bit more than average.  The seating is my least favorite part of the experience, but we always end up finding a place to enjoy our treat."
        }, 
        {
            "index": 301, 
            "rating": 1, 
            "review": "Ok so I have eaten many crepes in my life being born in Paris and all. So I wasn't expecting much from this place. But my oh my how much below par this place was. I ordered the St. Louise and the bf got the Fruits de la mer. Both of our crepes took over 10 mins to make, and when we got it they were both semi cold...mildly warm in the middle. My crepe was drenched in the bechamel sauce which had like no taste. The actual crepe itself was very flour-ie tasting. The deli ham and cheese helped the food go down. My bf did not enjoy his crepe one bit...what a dissapointment. Also savory crepe should never be the same price as dessert crepes (8.99). Stay away."
        }, 
        {
            "index": 302, 
            "rating": 5, 
            "review": "These may be the best crepes I've ever had. I use the crepes here to compare to other crepe places.   They are worth the price!\n\nThe sauce is excellent, and high quality..and so is the fruit.  Whipped cream is good.. The crepe itself is nice..Thick and good.\n\nThe crepes at the buffet aren't as big, but they're all you can eat... awesome!"
        }, 
        {
            "index": 303, 
            "rating": 4, 
            "review": "I love this place!\n\nI always get the Bananas Foster crepe and it's huge and delicious...it makes a good (albeit unhealthy) breakfast.  I haven't really tried any of their other crepes so I can't comment on those.\n\nThis place is just a little crepe stand across the walkway from the buffet, it's next to a breakfast place that is always super busy in the mornings."
        }, 
        {
            "index": 304, 
            "rating": 3, 
            "review": "The dessert crepes are waaay better to order than the savory crepes. Simple. Short."
        }, 
        {
            "index": 305, 
            "rating": 2, 
            "review": "Not great. Long lines, slow service and crêpes that essentially all have the same lemon filling (unless they got our orders completely wrong). Cheap by Vegas standards, but you get what you pay for."
        }, 
        {
            "index": 306, 
            "rating": 4, 
            "review": "The last few times I've been to Vegas, I did not get to eat a crepe from Vegas. So I just had to stop here to fulfill my craving instead of any other crepe place. \n\nThe lines can be a bit long, but moves at a fast pace. The cooks are amazing, at the time I went there was only one person working it and he was whipping up crepes at a blur. The quality of these crepes are amazing, with the actually crepe a light egg flavor, and always flavorful, fresh ingredients you can see. Sweet or Savory it is hard to make up my mind. \n\nI went with the savory crepe Toulouse, which has sausage, mushroom and pepperoni in it, topped with marinara sauce. Delicious, and just hit the spot."
        }, 
        {
            "index": 307, 
            "rating": 4, 
            "review": "It's a little kiosk almost, in the Paris Hotel. Small, but they churned out some delicious crepes. Sweet and savory crepes are both $9.99. I had the fruits de mer for breakfast. Yes, shrimp, mushrooms, and scallops with mozzarella (light) and some sauce for breakfast. It was delicious and they were generous with their seafood. I ate half and was sufficiently full. I wished I could have come for dessert though their generosity made the sweet crepes look too intense even for my sweet tooth."
        }, 
        {
            "index": 308, 
            "rating": 4, 
            "review": "the section connecting paris and bally's is always really awesome looking [though the miniature/ scaled down reproductions of the villages almost makes me feel like an oompaloompa is going to jump out somewhere...] but this little kiosk happens to have some delicious offerings.\n\ni generally would have opted for a sweet crepe, but since i hadn't had lunch yet, i decided to go with the toulouse crepe [italian sausage, mushrooms, cheese, marinara, etc.] and it was fabulous.  boyfriend felt like the crepe shell was too 'eggy' but i liked mine.  it was priced a little bit above the average, but hey, what's not overpriced in vegas??!!"
        }, 
        {
            "index": 309, 
            "rating": 4, 
            "review": "For unique eateries, you can't go wrong with anything in the Paris hotel. Surprisingly, the wait was fairly short.  I ordered the crepes suzette(oranges aplenty) and my gf ordred the favorite(strawberry and raspberry). Both were very tasty, should satisfy those with a sweet tooth. Keep in mind, if you order something with fruit, use the napkins as you might get hard-to-clean berries on your shirt or skirt, as my gf found out.\n\nThey didn't serve full coffee, which I think they should(lattes, mochas, etc.) to complete the crepes experience. My only real complaint is that the seating is limited and shared with the bakery next door. For the value, though, a great meal at roughly 20 bucks for two. A great place for a late breakfast, snack, or dessert!"
        }, 
        {
            "index": 310, 
            "rating": 5, 
            "review": "When four women (that just happen to be nymphomaniacs) sit around a table and agree that the peanut crepe is better than sex, you are doing something right."
        }, 
        {
            "index": 311, 
            "rating": 3, 
            "review": "The French theme here was adorbs. The average crepe will be around $9 to $10, not bad at all. You can choose from the dessert options or savory ones filled with turkey, chicken, shrimp, etc. The crepe I ordered had turkey and ham in it. It was okay. It wasn't great nor bad. A quick bit that wasn't heavy. \n\nThe staff here was friendly. There was only one cashier and cook so there was a slight wait to order and to get the food. And they do charge you $0.50 if you ask for a cup of water. :/"
        }, 
        {
            "index": 312, 
            "rating": 5, 
            "review": "The crepes here are amazing! It's a must go to spot in the Paris hotel whenever visiting Las Vegas. If you're looking for a sweet savory dessert brunch order the Nutella crepe. It's loaded with Nutella, bananas, a caramel sauce, and the most delicious whipped cream on the strip! The service is very nice and fast too. They whip out the crepes quickly! I always make sure to go here once during Las Vegas trips and recommend it to all of my friends! Stop by and grab a crepe!"
        }, 
        {
            "index": 313, 
            "rating": 5, 
            "review": "Our crepe was awesomely delicious. And that's coming from someone who generally avoids junk food altogether. After the first bite my husband and I agreed we need to come back to La Creperie the next time we're in Vegas."
        }, 
        {
            "index": 314, 
            "rating": 2, 
            "review": "Mom had the tolouse (sausage, pepperoni  and red sauce) good but crepe was heavy. I had the ratatouille and egg crepe with a bechemel sauce, very good. The desert crepe was good but whipped creame was processes and bad. Three crepes and a diet coke over 35$. What can I say, that's Vegas!!  Not really worth it, sorry"
        }, 
        {
            "index": 315, 
            "rating": 3, 
            "review": "I used to love coming here when the prices were cheaper. I remember I was in Las Vegas one weekend and they were one price then came back the next the prices went up 2 dollars!!! That is ridiculous. I haven't been since. \n\nMy favorite savory crepe was one with seafood in a creamy white sauce. My favorite dessert one came with Nutella and I always added bananas. I don't think people know that you could customize your order.\n\nI would of suggested this place when it was cheaper. Not sure if it's worth the two dollar raise in prices. Also, since it is just a window front, you have to look for your own table. That area is by the bathroom and it's always pack. So I don't think it's worth the effort paying the price you do and then having to stand around waiting for a table and most likely having to bus it yourself. The way they serve the crepes is on a plate and you definitely need a fork and knife. You can't just pick it up and go and eat it like an ice cream. Someone needs to open up a crepe place just like it, fix all the problems and I know they would make a killing."
        }, 
        {
            "index": 316, 
            "rating": 1, 
            "review": "50 min wait for food. They don't even tell you while ordering. Very bad management. The creeps are ok. Not worth 50 min wait."
        }, 
        {
            "index": 317, 
            "rating": 3, 
            "review": "Let me start with the good...\n\nThe crepes are absolutely amazing. Except for a hole-in-the-wall shop in Ireland, these are the best crepes I've ever had. Even after I give you the bad, I definitely urge you to stop by for a crepe. \n\nNow the reason for three stars...\n\nThe customer service is HORRIBLE. You can clearly tell Liliana despises her job. We planned on walking the strip for a bit so asked what time they would be closing. She ignored us, did a couple tasks, then sharply responded with \"midnight.\" No smile, no other words, not even eye contact. Then, when we went back, it didn't get any better. She didn't say anything upon approaching the counter; just waited for us to order. We wanted a couple ingredients taken off of a crepe and she snapped back with it being the same price. We stated that we were aware of this and she instantly cut us off mid-sentence. I'm not expecting Disney World-esque customer service, but at least pretend you enjoy your job. I would say maybe she's had a bad day, but this is not the first negative encounter we've had with her and upon reading other reviews, other people have had negative customer service experiences as well. \n\nThe only other negative would be price. I'm not too concerned with this as we expect nothing less being on the Las Vegas strip, in a tourist trap. They running at about a 21% food cost which is equitable to a bar, not a cafe. Elsewhere, the exact same product would be closer to $7, we spent $10.50 per crepe. \n\nAgain, I would recommend trying their crepes. Just go into it expecting to spend a pretty penny and expecting a rude encounter."
        }, 
        {
            "index": 318, 
            "rating": 4, 
            "review": "These were quite possibly the best crepes I've ever had. Honestly, I can't say I've ever been a crepe lover, but I'd eat them every day if they came from here. I got the Soliel and asked them to add ham. Yes, it was $9, but it was too much for one person to eat in one sitting (in my opinion). So, given that you can get two meals for the price of one, I think it's totally worth it."
        }, 
        {
            "index": 319, 
            "rating": 3, 
            "review": "This place is definitely more nostalgia than quality. It was beautiful environment in the Hotel and the ambiance is great. Really feels like a Paris side street. But they were out of Bailey's for coffee and they have a berry mix. Pretty sure all creperies have just strawberries. For the price, it wasn't worth it. But to say you had a crepe in Paris...why not."
        }, 
        {
            "index": 320, 
            "rating": 4, 
            "review": "If you're looking for a cheap, quick bite on the strip, this is a place you would hit up. \n\nMy friends and I were looking to have a snack during our 1.5+ hour wait for Bacchanal Buffet and La Creperie was perfect: simple and easy to share. We ordered two Roasted Chicken ($11.00) which consisted of rotisserie chicken, sun dried tomatoes, asparagus, basil pesto & shaved grana padano. \n\nOverall verdict: pretty good. \n\nThe crepe batter itself was a little sweeter than I would've liked it, the tomatoes had a weird texture to them and the basil pesto could have used a little more \"umph\", but overall, not bad for a snack. \n\nIt was a definite plus that there were plenty of seating arrangements around and that water cups were free of charge. Yay! \n\nKeep quality expectations low, price expectations high, and you'll be fine in the City of Sin."
        }, 
        {
            "index": 321, 
            "rating": 3, 
            "review": "I'm a local and I went here twice for just butter and sugar crepes, despite that it's overpriced especially for such a simple one.  The first one I got was great and the line moved quickly.  They had put creme on it which was delicious, even though at first I thought I wouldn't want it.  When I came back the next day they were understaffed and the guy making the crepes was moving ridiculously slowly, almost everyone was whining about it.  When I finally got my crepe I figured who cares about the 15 minute standing wait because it's worth it... It came out without the creme and I asked the cashier if they could put it on because they did earlier and she said no because it wasn't on the menu, which it wasn't.  So I don't know.  The first crepe was much better, the second one just had all the raw sugar and butter in one spot and it was too crispy in that area, honestly I didn't even enjoy eating that section but I was hungry."
        }, 
        {
            "index": 322, 
            "rating": 5, 
            "review": "My love affair with crepes was rekindled last year during a visit to Paris, France.  Since then, I have tried, with varying degrees of success, to find excellent creperies.  La Creperie definitely meets the grade - in fact, these are the best crepes I've tasted since France.\n\nThe pancake part of the crepe has a wonderful thickness, it's substantial, not thin and skinny.  All the crepes I had: ham and cheese, three cheese, and the pear crepe - were fantastic.  My only regret is that I didn't have more opportunity to try some of their other crepes, before coming home to a comparatively crepe-challenged area!"
        }, 
        {
            "index": 323, 
            "rating": 4, 
            "review": "I don't know why this place doesn't have a higher rating. It's delicious and the staff is very friendly. It's not a sit down restaurant so be prepared for that. It's a walk up window and you pick up your food when it's ready. They don't have a huge selection but what they do have is tasty. I was actually surprised at how yummy my crepe was. It's a good low key place."
        }, 
        {
            "index": 324, 
            "rating": 5, 
            "review": "Wow!!!!! Worth the wait! I ordered Nutella crepes! Heaven!!\n\nSuggest to go to this restaurant! Yummy!"
        }, 
        {
            "index": 325, 
            "rating": 4, 
            "review": "I had the berry crepe here and loved it!  The crepe was nicely made with think layers and some cripsness to it, the berries were awesome as was the creme fraiche.  Delicious combination.  Would definitely be back for more, if not for the price ($12!)."
        }, 
        {
            "index": 326, 
            "rating": 4, 
            "review": "I *heart* crepes. La Creperie is a MUST for me in Vegas. Depending on the time of day, you might encounter an unfortunately long line.... and my only annoyance with this place is that they are painfully slow when they get busy. But the crepes are so delicious and the chantilly whipped cream that comes with the dessert crepes is to die for. The Napoleon crepe is amazing.... the lemon custard and the berries are so perfect together. \n\nIf you can help it, try to buy your beverages elsewhere.... they are just a little crepe stand and therefore they charge you an arm and a leg for bottled water/pop."
        }, 
        {
            "index": 327, 
            "rating": 4, 
            "review": "Loved this.  Look at the photos!  Crepes were not overly sweet and were very tasty.  I had the apple, and my wife had the pear.  Great for a quick snack.  Tables are off to the side in a little common area, and we had no trouble finding one."
        }, 
        {
            "index": 328, 
            "rating": 4, 
            "review": "i LOVE LOVE everything about Crepes, so i was definitely excited when i saw this place. My friends and I each ordered a crepe, I was blown away by the size of it. The size was so large, it could have been easily shared with 2 or 3 people. The sweet ones were a little too sweet and the savory ones were a little too salty.   \nIt was still a good experience!"
        }, 
        {
            "index": 329, 
            "rating": 3, 
            "review": "Came here to catch a quick bite before taking the family to see the Nutcracker. It's a small shop along their faux street where you order at a counter, wait for your food, then hope you can find seating. Our order was up in about 10 minutes and lucked out by grabbing a tiny table to eat at. Between the three of us (2 adults and a kid) 2 crepes were plenty filling.\n\nSt. Louis ($9.99) - imported ham and mozzarella and fresh basil with bechamel. The description mentioned imported ham. Maybe they meant imported from the local grocery store, because the ham didn't taste any better than what I get at Albertson's. The bechamel sauce was too thin and runny for my liking.\n\nToulouse ($9.99) - ground sausage, pepperoni, sautéed mushrooms, mozzarella, basil, topped with marinara. This was the better of the two that we ordered. Tasted just like a pizza. The marinara lacked the depth in flavor that would make it special, but was good enough to satisfy.\n\nThis might be a good place for a quick bite, but definitely not some place that I would seek out or ever crave. The portions are ridiculously large, so share."
        }, 
        {
            "index": 330, 
            "rating": 4, 
            "review": "I had the banana fosters crepe with rum and chantilly cream for lunch. It was delicious and I could taste the rum flavor. The banana's texture was soft and marinated with all the flavors. It was just right. Big and fully enough for a quick lunch!"
        }, 
        {
            "index": 331, 
            "rating": 5, 
            "review": "This place is to die for! We had the Shrimp crepe and it is so savory and creamy. The sweet woman at the counter recommended the bananas foster crepe, and my husband and I are fighting over it. So good. It would be a shame to stay at the Paris Las Vegas and not have a crepe from here!"
        }, 
        {
            "index": 332, 
            "rating": 5, 
            "review": "Best crepes! If you are looking for lunch and you're in the Paris definitely hit this place. They were delicious and hit the spot after we had been walking the strip all morning! Unique location it feels like you are at a cafe in paris!"
        }, 
        {
            "index": 333, 
            "rating": 4, 
            "review": "These things are amazing. I haven't had one yet that I didn't like! They are big so I suggest sharing one! It also helps to cut down the calories... But your in Vegas so who cares about that anyway!? I do like the feel of the little alley that all the shops are on at the Paris... It does add to the experience. It's a must go if you are looking for something sweet to eat while in Vegas."
        }, 
        {
            "index": 334, 
            "rating": 4, 
            "review": "Located inside the Paris hotel.  I had the shrimp and wild mushroom crepe.  I used my hotel comp and note that you can get discounted price if you show your total rewards card.  The crepe was delish!  Shrimp and mushrooms created this incredible combination.  The portion was enough for one person.  It was made to order and I will definitely come back for this crepe.  I've also had their nutella crepe before and it was just perfect if you like nutella.  Hazelnut spread with bananas are a perfect match!"
        }, 
        {
            "index": 335, 
            "rating": 3, 
            "review": "I loooooove crepes!! sweet or savory, I'm a fan.....and these were delicious!  The presentation was a little cheap (plastic plate & plastic forks) and they were way over-priced at about $11 each (its Vegas)...but they were very tasty and fast."
        }, 
        {
            "index": 336, 
            "rating": 5, 
            "review": "This is located inside Paris. We came here for brunch because we were staying at Bally's, which is attached and a short walk away.\n\nThe decor was very cute and European. The crepes are ordered and served through a window, or you can walk in the doors to the left and there is a separate restaurant with pizza, sandwiches, etc.\n\nExpect to pay $10-12 for a crepe. I went with the cinnamon bun dessert crepe, which was delicious. They also have savory options, like a breakfast option or chicken. You can watch them as they make it which is also nice.\n\nThis is a great option for fast and reasonably priced food. It was well prepared and I would definitely visit again."
        }, 
        {
            "index": 337, 
            "rating": 4, 
            "review": "Ordered the Nutella Crepe and it was delicious! It has the right balance of bananas and caramel so it's not overpowering sweet. Would come back!"
        }, 
        {
            "index": 338, 
            "rating": 4, 
            "review": "Not bad. Although I didn't try their hot crepe, but I did love their dessert strawberry crepe. Probably one of the best one i had so far.."
        }, 
        {
            "index": 339, 
            "rating": 4, 
            "review": "I usually always go here when I'm in Vegas for at least one of my breakfasts. The crepes are delicious (especially the savory ones!). The menu changes seasonally, I believe, because last time I came, they did not have my favorite, which is the ratatouille crepe. Note, if you ever see it on the menu, GET IT! The service is always fast and friendly, and I have never disliked any of the crepes I've gotten here. My one and only complaint is that the crepes are kind of small for the amount you pay for them, but then again, it is Vegas. I'd definitely recommend for a snack, breakfast, or lunch."
        }, 
        {
            "index": 340, 
            "rating": 2, 
            "review": "I'm sorry to say I dont like anything about La Creperie. Sadly, it la sucks.\n\nThe Soleil crepe in particular sucks, the ratatouille was disgusting. I dont use disgusting lightly (not about food anyway) but it was really really bad. It tasted like old tomatoes that had been marinated overnight in a weird sauce that I dont understand. Once I got all that off my crepe, it was edible but certainly not enjoyable.\n\nThe Forestiere  crepe was good, but not amazing. I've had much better crepes in Seattle... Disappointed.\n\nI dont like the counter you order at, nor the way the people behind the counter wont make eye contact. I got coffee there once too and it was burned. I like the Paris, but this wasnt a good representation of their quality."
        }, 
        {
            "index": 341, 
            "rating": 5, 
            "review": "Amazing breakfast crepes!  We ate crepes almost every morning for breakfast. They have an extensive menu that will satisfy everyone's tastes. I want to go back to Vegas just for the crepes!"
        }, 
        {
            "index": 342, 
            "rating": 4, 
            "review": "We did it again...we were in Vegas for 9 (!) days and had almost as many crepes.  The Monte Cristo was a favorite but the true loveliest of lovely was the Cinnamon Bun Crepe.  We had this for dessert almost every night.  It was truly amazing."
        }, 
        {
            "index": 343, 
            "rating": 5, 
            "review": "Oh my, the gigantic Nutella crepes are just as delicious as I remember."
        }, 
        {
            "index": 344, 
            "rating": 2, 
            "review": "say \"au revoir\" to this place...don't ask me how to pronounce it.  please excuse my french, but the crepes here are f*cking nasty!!!  seriously, they are on a verge of becoming pancakes.  i wouldn't even give them to my enemies (thanks to the geneva conventions treaties), not that i have any...\nthis is one of those places that falls into \"what happens in vegas stays in vegas\"!"
        }, 
        {
            "index": 345, 
            "rating": 4, 
            "review": "This is a quick spot for breakfast and very good. A litle overpriced, $9.99 for a crepe and $3.50 for a regular coffee!! However, the crepes were freshly made and delicious. I had a ham crepe with bechamel sauce which was very tasty and my man had something that resembled pizza, a sausage and mushroom stuffed crepe covered in marinara sauce. We went back another day and he had the the seafood crepe which was filled with shrimp. Both were very good."
        }, 
        {
            "index": 346, 
            "rating": 4, 
            "review": "Decent quality - they're super fast to get your order out too!  I usually go to Jean Phillipe Patisserie, but this was a nice change.  We had the Breakfast crepe and the Cannolli crepe.  The Breakfast was good, but ditch the eggs - they're dry but that's kind of normal since eggs are often hit or miss in fast restaurants like this.  The Cannolli was good - I enjoyed it, and I usually don't do too sweet things for meals.  Good call!"
        }, 
        {
            "index": 347, 
            "rating": 5, 
            "review": "I go to Vegas every year. When I found out about this place 3 years ago, I've made it a point to come to Paris just for the crepes every visit."
        }, 
        {
            "index": 348, 
            "rating": 1, 
            "review": "Horrible! Didn't get a free coffee with mug purchase, as advertised. And they couldn't even explain why!!\n\nFinally, dessert was meh. The vanilla napoleon's top layer was too tough and we had to squish the entire cake to take a bite!"
        }, 
        {
            "index": 349, 
            "rating": 4, 
            "review": "One of the best places to eat in Paris Hotel. I love their savory crepes!!"
        }, 
        {
            "index": 350, 
            "rating": 4, 
            "review": "DROOOL worthy (soft) crepes. I tried the shrimp scampi with spinach and the blueberry lemon curd crepe for a taste of both sweet and savory types. Highly recommended. It's fun watching the guy in the back make them, too. Prices are a little high, but it is Vegas afterall. (~$12)"
        }, 
        {
            "index": 351, 
            "rating": 4, 
            "review": "I got the butter and sugar crepe and it was so good!!  The crepe was warm and the combination of the butter with the sugar particles and chantilly cream was perfect."
        }, 
        {
            "index": 352, 
            "rating": 1, 
            "review": "Awful! I just wanted a basic sugar crepe like the ones I had at the corner stands in Paris. 10 dollars for this basic item that cost two dollars in Paris. I paid it with a smile thinking it'd remind me of the delicious ones in France. Not even close. Overly dry, and the guys serving it appeared miserable."
        }, 
        {
            "index": 353, 
            "rating": 4, 
            "review": "We always come here once or twice when we come to vegas. We love it.\n\nRoasted Chicken Crepe~~ I had it a few days ago, and I already don't remember it... i think it was good or fine or ok. $10.50\n\nShrimp scampi crepe~~ delicious. I don't remember much else about it though, besides that it inspired me to want to make crepes and try to replicate that one at home. So much for that idea. ;P $11.25\n\nBlueberry Lemon~~ this crepe would've done better and been more delicate tasting if they gave you a thinner layer of the lemon filling. The filling is simply a lemon custard like in pie. Tastes like you're eating way too much plain simple sugary pie filling.  Nothing else in the inside of the crepe, besides loads and loads of that filling. $10.75"
        }, 
        {
            "index": 354, 
            "rating": 4, 
            "review": "I was in a rush to get some quick filling food before going out for the night. I'm so glad that La Creperie was so close to the hotel room elevator or else I probably wouldn't have found this amazing place in such a hurry. The seafood crepe that everyone was talking about is called Fruits De Mer which has shrimp, scallops, mushrooms, mozerella cheese, and fresh basil. It was sooooo delicious but they could've seasoned the seafood a little more. The plan was to go back to the hotel room, change clothes, and then eat it in the taxi but I ended up getting locked outside my hotel room so I ate it sitting outside my room as I waited for security to come let me in. I also ordered a Forestiere crepe, but I accidently left it in my room when I rushed to get in a taxi, so I didn't get to try it :(\n\nThe service is quick and the crepes will usually be ready in about 5-10 minutes. All their crepes (savory and dessert) are $9.99."
        }, 
        {
            "index": 355, 
            "rating": 4, 
            "review": "Every time we come to vegas regardless of where we are staying we have to come to the creperie and get our fix for crepes. This year we stayed at the Paris so it was crepes every night. \n\nI love Nutella and of course have to get the Nutella and banana crepes. My only complaint........get rid of the cool whip."
        }, 
        {
            "index": 356, 
            "rating": 4, 
            "review": "When everyone's in line at the buffet up the walkway, it'd probably be smarter to actually get your money's worth and come here. Less of a wait (although it's not guaranteed you'll score a table) and more laidback than everyone frantically scrambling for overpriced buffet food, it's kind of made for the Paris hotel. The ham with basil crepe came topped with a good amount of bechamel and was perfect with a smooth cup of coffee. Not exactly Parisien, but definitely better than waiting an hour or more just to gorge yourself."
        }, 
        {
            "index": 357, 
            "rating": 4, 
            "review": "Mixed berries? What do you mean I can't have just strawberries? You're serious? \n\nSigh... \n\nEnded up getting my usual strawberry, whipped cream and Nutella crepe without the strawberries, and it cost La Creperie a star. Lucky for them, their crepes are absolutely fantastic. Though they are on the expensive side of the crepe scale, for Vegas, the prices seem fair. \n\nThe Nutella crepe I ordered was packed with Nutella, and served with a generous amount of whipped creme and a thick drizzle of chocolate. The pancake itself had a perfect flavor and texture. It was glorious. My girlfriend ordered a savory crepe filled with ham, cheese, and a variety of other goodies, and it too was wonderful. \n\nEven if you're not staying at Paris, you should give this place a try."
        }, 
        {
            "index": 358, 
            "rating": 3, 
            "review": "Who doesn't love crepes? I'm always a sucker when walking past a crepe stand to order something, and so when I was walking through the Paris hotel in Vegas and saw this little stand, I had to try it.\n\nLuckily I was with friends, so I got to try a few different kinds.\n\nEvery stand is a little different, and being that this stand is on a busy walk way in a busy hotel in Vegas, they tend to me more about speed than anything else. So don't expect mind blowing crepes here. But if you think of it as fast food rather than fancy French pastries, you should be fairly content.\n\nThe prosciutto, gruyere, & béchamel crepe was the clear winner for me. I love bechamel sauce when it's done right. This was not perfect, but for a fast food stand I thought it was better than I expected, and it paired great with the prosciutto and gruyere.\n\nThe spinach and artichoke with bacon and cheese was also really good. I generally have more of a salt tooth than a sweet tooth, so I wasn't surprised that I preferred the savory crepes over the dessert ones. \n\nIt's hard to screw up strawberry and chocolate crepes, and these were pretty good as well. But it's not real chocolate, it's Nutella. (I like Nutella, so this wasn't a bad thing, just not what I expected) But the strawberries were either over ripe or over cooked. Great strawberry crepes (in my opinion) have crisp strawberries laid in the crepes right before pulling it off the burner, so they are just starting to get warm, but not cooked.\n\nSame thing with the chocolate banana. It had overly ripe or over cooked bananas with Nutella. \n\nSo in my opinion, it's a good fast food option for the favors crepes, but if you want dessert, look elsewhere."
        }, 
        {
            "index": 359, 
            "rating": 3, 
            "review": "For the price, the portions are pretty decent, however after watching the chef make a few orders its clear that most of the crepes' fillings are pre-made and stored in large containers. Its probably not a big deal, considering this is basically an Americanized fast food version of a classic French staple. What do you expect?"
        }, 
        {
            "index": 360, 
            "rating": 2, 
            "review": "The crepes are open late which is nice for a midnight snack... but they were not as good as I was anticipating. We walked quite a bit for these little treats. My baby mama can make them better (and she uses the pre-made crepes)"
        }, 
        {
            "index": 361, 
            "rating": 1, 
            "review": "My boyfriend and I were craving something sweet and small so we decided to come to this tiny shack place. We ordered Bayonne and Napoleon Dessert Crepes. \nPortion is good to share with one person. Personally I rather have ice cream Crepes than just fruit Crepes. I don't like savory Crepes because it tastes weird. It's like eating something hot fruits. Well the reason why I don't like the Bayonne is because the pork tasted funny and it was full of cheese. A little too much cheese for me. For $8.99, I'd rather just get something else like a slice of cheese pizza. \n\nThe person who took our order was kinda rude. (not to us, but to the people in front of us) The family in front of us doesn't speak English, so they didn't know how to order. They had a difficult time pronouncing the name of the dish and the cashier was rolling his eyes and rushing them. How rude...\n\nI wouldn't come back."
        }, 
        {
            "index": 362, 
            "rating": 5, 
            "review": "This place is always on my Vegas to-do list. My first couple of visits, I was a fan of their sweet crepes, but have since switched over to the savory side. The shrimp and mushroom crepe I had last night was delicious! My daughter loves the classic banana and nutella. Would recommend this place 100 percent :) :) :)"
        }, 
        {
            "index": 363, 
            "rating": 3, 
            "review": "I thought my savory pesto roasted chicken crepe was delicious! Lots of chicken, asparagus, and sun dried tomatoes (maybe even a little too many sun dried tomatoes..). It was surprisingly filling despite it just being a single crepe. Some friends got the sweet one with nutella and the one covered with fruit, and consensus was that everyone was happy. Prices ran about $10-$11. \n\nI've never had a \"real\" crepe in France before, so I guess I don't know if these are legit or not, but overall it was satisfying and a quick and easy way to grab something to eat!"
        }, 
        {
            "index": 364, 
            "rating": 4, 
            "review": "This place is a must whenever you want a cheap and delicious cure to your hangover! Or if you just want to satiate your hunger!\n\nThere is always a line here! But it is well worth the wait! \n\nToulouse includes cheese, sausage, and mushrooms enfolded inside thin, waif-like crepe skin. It is topped with red sauce. This tastes like a light lasagna. But way better!\n\nFruits de Mer- a seafood crepe topped with bechamel sauce! I actually prefer this one over my Toulouse! They are not cheap with their seafood! every bite is guaranteed a piece of shrimp or scallop! \n\nRight across from this little stand is a bar, go ahead and order a Paris souvenir drink while you're waiting. Or you can even grab a delicacy from a bakery since there are little \"French\" bakeries lined up along the walkway La Creperie is located at."
        }, 
        {
            "index": 365, 
            "rating": 2, 
            "review": "They say it's the same, but it's not the same.\n\nMaybe because it was my first time and you always remember your first, but this was only passable. I mean, it was still a okay crepe, but not how I remember it. \n\nI obviously got the D'Anjou again. The time before, it was filled with an almond cream that was like marzipan. This time, I think it was a runny vanilla sauce without any hint of almond. The pears were the same, the chantilly cream was the same, the caramel was the same... but where is my marzipan??? \n\nSigh. I say \"Meh. I've experienced better\" but it was them... I swear they gave me better before."
        }, 
        {
            "index": 366, 
            "rating": 4, 
            "review": "Took a long time for them to make crepes... Eventho the line wasn't long at all. The wait was worth it. I have had better crepes but i feel that their crepes were decent. Maybe bc i just ordered the plain sugary crepes. But it sure taste a WHOLE lot better than across, inside the buffet's crepes!"
        }, 
        {
            "index": 367, 
            "rating": 4, 
            "review": "we waited for about 45 min after ordering... that was the bad part. but it was very very good. we had the sausage thing with the ragu sauce on it.. never had crepe like that before. expensive... but well worth it."
        }, 
        {
            "index": 368, 
            "rating": 5, 
            "review": "mmm.....bananas foster crepe with real sweet whipped cream on top (not that crappy oily mess that so many places serve)\n\nI ate the whole thing by myself....and every bit was delicious!"
        }, 
        {
            "index": 369, 
            "rating": 4, 
            "review": "Well, for an $11-12 crepe it better be good...and it was.  I got the Banana Nutella crepe and it was delicious.  Now, I would think twice about spending that type of money on a crepe but hey, either spend the money and get something that leaves a good taste in your mouth or go throw it away on the slots, which certainly won't leave a good taste.    La Creperie is located just beyond the casino, back in the shopping area - not too far in."
        }, 
        {
            "index": 370, 
            "rating": 4, 
            "review": "Ever since I have known him, my die-hard crepe fanatic bf has raved about the crepes from La Creperie. He swears they are the best in the world. \n\nHe was certainly right about them being delicious. Maybe it's the batter or simply the way they cook the batter. Maybe it's the combination of fillings. Whatever it is, they should stick to it. \n\nI ordered one of the savory crepes, the Toulous. It was filled with ground sausage, mushrooms, cheese, and more. It was topped with marinara sauce (yum!). He ordered a dessert crepe, the Napoleon. It was filled with lemon custard and fruits, topped with cream and sugar. Both were good, but his was far better than mine. \n\nThe wait was about 20 mins per order and each crepe was about $10. It's definitely something you should try while you are in Vegas. I recommend that you stick to the dessert crepes if you do decide to stop by! :)"
        }, 
        {
            "index": 371, 
            "rating": 1, 
            "review": "I was here several times years ago and I was excited to go back. Unfortunately they served me a pile of wet mush. The whipped cream was all melted.  Even though the soggy crepe did still taste good I couldn't eat any of it because there was hair in it. \n\nDisgusted by the lack of effort to serve something decent."
        }, 
        {
            "index": 372, 
            "rating": 4, 
            "review": "We enjoyed eating the seafood crepe and the toulouse crepe. I was afraid that perhaps it would not be enough to eat for dinner before going across the street to see the O show. The portion size on the crepes were more than enough. They were packed with lots of flavor and quite yummy! \n\nI'd definitely come again to grab a crepe the next time I visit Paris!"
        }, 
        {
            "index": 373, 
            "rating": 3, 
            "review": "I had the shrimp scampi crepe which was good, but nothing special in my opinion. I did like that it was creamy, and not too dry."
        }, 
        {
            "index": 374, 
            "rating": 4, 
            "review": "Soooooooooooooo good! Cheeeeeeeeeessssse...don't know what else to say 'cept this hit the spot when I was staying at The Paris and it was a bargain for the size compared to some meals in sin city. Vege options of course ; )"
        }, 
        {
            "index": 375, 
            "rating": 5, 
            "review": "Located at the Paris Hotel. One of my favorite spots to get crepes, especially the Banana's Foster one. All crepes are good and perfected, made to order. Seating is around the corner, shared with the bakery/pizza place right next door. It tends to get crowded usually around breakfast time, but it's worth it! I recommend this place if anyone is craving crepes and wanting to visit another hotel in Vegas!"
        }, 
        {
            "index": 376, 
            "rating": 4, 
            "review": "Pretty good. A bit big, if you're looking for an actual crêpes. But the taste is good. I ordered the Strawberry lemonade.  Thumbs up."
        }, 
        {
            "index": 377, 
            "rating": 1, 
            "review": "I was DISAPPOINTED BEYOND DISMAY. The crepes were dry, thick flour, thick with cheese, and the custard was filtered with water from the pears. My friends and I tried 3 entrees and 1 dessert crepes. If I could give it a -5star, I would. It was a waste of money."
        }, 
        {
            "index": 378, 
            "rating": 4, 
            "review": "An accidental discovery as I was walking around Paris after a long night.  I decided to come here instead of the buffet which is across the pathway. As a crepe place in the Paris hotel, I expected it to be awesome and it met my expectations! They have a good selection of dessert and savory crepes.\n\nCrepes:\n1) Nutella Crepe with Bananas - Very soft and delicious, but it was a little too sweet with the chocolate and the whipped cream. A crepe with nutella and fruit is enough.  \nhttp://www.yelp.com/biz_photos/6fPQJq4f_yiq1NHn0fd11Q?select=Hc6LPpoACvPTE_457TUOPg\n\n2) Bayonne Crepe - Prosciutto, mozzarella, fresh basil, and bechamel.\nWhat to say... It had some of my favorite fresh ingredients except bechamel. I had no idea what the heck that was, but provided a good flavor.\n http://www.yelp.com/biz_photos/6fPQJq4f_yiq1NHn0fd11Q?select=ac9-kNlfYElhfxc5TxW--g\n\nDon't go during peak times, because it can be difficult to find tables. You might end up having to take it back up to your room."
        }, 
        {
            "index": 379, 
            "rating": 4, 
            "review": "Very nice crepes, but to wait in one line to order it, and then have to turn around and wait in another line to pick it up.... it's like a 30 minute wait and way too long for a place that doesn't even have proper chairs and tables for you to eat on..."
        }, 
        {
            "index": 380, 
            "rating": 4, 
            "review": "Giant crepes! Giant crepes!\nEven with a small menu to choose from, I still had a tough time deciding on which sweet or savory crepe I'd devour.\n\nCost - For the crepe I would consider it fair, especially in Vegas. However, the price of coffee was stupid. $4 for a coffee is a bit much and it gets closer to $10 if you add a shot of something to it. Yikes.\n\nI chose a sweet and my wife chose savory. We were both happy with our selections. \n\nThe biggest downside to ordering from here during breakfast hours is a lack of somewhere to sit. La Creperie is right next to another food stop (and across from a buffet) and seating can become a bit of an issue. \n\nBut based purely on food taste, amount for dollars and service - I think it's pretty good eats. Check it out if you're looking for something a little different and delicious."
        }, 
        {
            "index": 381, 
            "rating": 5, 
            "review": "Found a promo code for a buy one get one free crepe at LVPromoCodes.com and could not have been anymore pleased. \n\nCrepes were fresh and hot cooked well. The selection was great and a welcome change from the buffets you tend to eat the whole trip. \n\nStop in and you will enjoy it"
        }, 
        {
            "index": 382, 
            "rating": 4, 
            "review": "Delicious crepe! Maybe a little more cheese on the Ham & Cheese but other wise just fantastic! Only real complaint was the wait time, but it was worth it in the end!"
        }, 
        {
            "index": 383, 
            "rating": 5, 
            "review": "the crepes were amazing; made simple and freshly with nice ingredients (:\nMe and my sister ordered the tomato mozarella crepes -- divine!\nMy brother ordered ham and cheese -- he loved the béchamel sauce!\nmy dad ordered the spinach artichoke -- cleaned the plate clean!\nfor dessert we got the nutella and it was delicious also (:"
        }, 
        {
            "index": 384, 
            "rating": 5, 
            "review": "this is THE place to get crepes in Las Vegas. i wont write alot, it's already been said, but for the first timer, try the Favorite Dessert Crepe (mixed berries whipped cream), and the Fruits De La Mer Savory Crepe (shrimp, scallops, cheese).  \n\nDO NOT buy bottled water here.  for a 1.5L Aquafina, i was charged $4.75.  broke my heart, but i couldn't say never mind, as there were many people behind me, and i didn't want to appear cheap. it will not happen again!"
        }, 
        {
            "index": 385, 
            "rating": 2, 
            "review": "Well, it's probably one of the only places for crepes on the Vegas strip.  The crepes aren't bad; sweet crepes are pretty tough to screw up and the savory crepes are actually pretty good too.  But they are overpriced (of course) AND take foreverrr to order / make.\n\nNot worth waiting in line / paying $10 for unless you're really craving crepes."
        }, 
        {
            "index": 386, 
            "rating": 3, 
            "review": "Decent crepes, my husband and I each ate our own savory and split a sweet and it was a good sized meal. I had the prosciutto crepe and it had a lot of meat, would have balanced better with tomato, I think. The Nutella sweet crepe was very yummy. The water is $4 for half a liter and the receipt shows it being a full liter and that just bugs me."
        }, 
        {
            "index": 387, 
            "rating": 4, 
            "review": "Granted, I've really never had a bad crepe...and I think it would actually be hard to have a botched crepe that is completely horrible because crepes are SO. FRICKIN. GOOD!!!  But the crepe I had here was excellent!  The D'Anjou is a crepe filled with pears, candied walnuts, and almond paste with a caramel topping and lots of whipped cream.  Num!\n\nSince we were staying in Paris, I brought it up to the room, but forgot to get it 'to go'.  So I just carried the plate up.  While leaving La Creparie, a lady saw my dish and, with a thick French accent, asked \"Excuse me, what kind of crepe is that?\"  I told her \"the D'Anjou crepe\" in what I thought was my best French accent.  She didn't understand me (what can I say?...I took Spanish in high school  :P), so I translated for her and told her it was \"the pear one\".  Then in the elevator on the way up to the room, a French family was going up to their room.  They were all eyeing my crepe and talking about it in French, then asked where I got it from.  I let them know it was just downstairs.  Thankfully, they didn't ask me what kind of crepe it was because I didn't want to have to say the name again.  Who knew there were so many French people who fly half way around the world to stay at the Paris Hotel and eat crepes?!?  But I did a lot of free advertising for La Creperie with that D'Anjou!\n\nDownsides:\nLong wait?  Yes.  There's usually a line.  \nOverpriced?  Yes.  It's $10/crepe.  Pricey, I know.\n\nBut, it's Vegas.  Your paying for the atmosphere of enjoying a yummy Parisian snack along a sidewalk in Paris without having to pay for a plane ticket to Europe.  :)"
        }, 
        {
            "index": 388, 
            "rating": 2, 
            "review": "The crepe is thick and doughy and there is not much content inside. My chicken was cold. Prices are raised from what used to be $9.99 to ~$14. This is not a sit down restaurant but more like a cafeteria of tables, and you order and pick up your food at the counter.\n\nFrom what I remember, the dessert crepes are more edible than the savory ones.\n\nMakes me so sad because nothing makes me happier than some perfect, delicious crepes...this place does not cut it :-(\n\nStill it's one of the more fast and affordable eats in Vegas, and is easy to find inside of Paris."
        }, 
        {
            "index": 389, 
            "rating": 5, 
            "review": "OH MY GOD IS THIS PLACE GREAT.....NOW DISCLAIMER.............If you have a normal metabolism you will get fat by eating here.  Its just the way it is.  But WOW WOW WOW WOW WOW!!!  Its soo fricken good."
        }, 
        {
            "index": 390, 
            "rating": 3, 
            "review": "Delicious yummy breakfast crepe, wonderfully cooked\n\nWaited 22 minutes while standing for it. Not worth it"
        }, 
        {
            "index": 391, 
            "rating": 4, 
            "review": "This is the second day we eat crepes but the 1st time at le Creperie. Prices were relatively average. Definitely less than at The Blizzz at the MGM. It was intensely buttery and decadent. My son, 7,  ordered the Butter&sugar crepe- yum. It did not disappoint. My daughter,12, ordered the apple & caramel-again, yummy. The Granny Smith apples were indeed crunchy. I ordered the roasted chicken w pesto, etc.- yum. This was a definite Score! -in our search for awesome savory and sweet crepes. Oh and the have combo deals. You know buy crepe and drink for one set price. We will definitely return."
        }, 
        {
            "index": 392, 
            "rating": 4, 
            "review": "Some of the best crepes I've ever had. I ordered a savory crepe first: the ham and cheese. It was warm and the cheese gooey. I also enjoyed the creamy sauce that is served over it. My husband and I then shared a nutella crepe. I kinda wish we hadn't shared because it was so good that I wanted it all for myself. The nutella combined with the banana, whipped cream, and candied nuts were just perfection. I will definitely be stopping by next time I am in Vegas. Only down sides are the price of each crepe and the little tiny cups that fountain drinks are served in."
        }, 
        {
            "index": 393, 
            "rating": 5, 
            "review": "This place is extravagant!! Loved the Very Berry crepe! Delicious! My boyfriend and his cousin's came here this morning for breakfast! The ambiance and everything is amazing!! They cook in right in front of you while you wait!"
        }, 
        {
            "index": 394, 
            "rating": 4, 
            "review": "We got a berries crepe with Nutella and a tomato basil crepe. Both of which were delicious and tasty. It would have been nice if the crepes were a little bit more crispy because it got a bit soggy with all the ingredients."
        }, 
        {
            "index": 395, 
            "rating": 4, 
            "review": "Average food but a big plus for speed and price when you have somewhere better to be.  Half the people seated there were speaking French, so it couldn't be all that bad, eh?"
        }, 
        {
            "index": 396, 
            "rating": 5, 
            "review": "Mmmm..i love crepes and we decided on La Creperie at Paris hotel for lunch during this past labor day vegas trip..\n\nWe both ordered savory crepes since it was for a quick lunch..we had one St. Louis, which had imported ham, mozzarella cheese, topped with fresh basil with bechamel sauce..and one Bayonne, which had imported prosciutto, mozzarella cheese, topped with fresh basil and bechamel sauce..\n\nThe wait time was around 20min..but these are all made to order and they were delicious! the ham was smokey, sweet, and savory and went perfectly with the crepe..\n\ndefinitely coming back here when we come back to vegas!!"
        }, 
        {
            "index": 397, 
            "rating": 3, 
            "review": "I was in Vegas for work and needed to get a quick bite to eat so I decided to give this place a try.  There was a line but the service was quick.  I ordered the ham and cheese crêpe.  It was yummy but I did semi wished I would have ordered a desert crepe instead. I will say the portion is huge. I could not finish it.   I will come again but will try a desert crepe."
        }, 
        {
            "index": 398, 
            "rating": 4, 
            "review": "Crepes the size of my head filled with nutella and topped with a giant dollop of cream? Yes please! \n\nThe only downside is I tried to eat this by myself, and failed. Definitely for two...or three.\n\nA bit on the pricey side, but definitely better than the thing they called crepe at Mon Ami Gabi."
        }, 
        {
            "index": 399, 
            "rating": 3, 
            "review": "If i were to compare the other crepes restaurant that ive been to,i can say that i had far much better than the one i had in here,its good but for the amount that i paid its not worth it"
        }, 
        {
            "index": 400, 
            "rating": 4, 
            "review": "I ordered the Nutella Crepe and felt like I was back in Paris at a cafe next to the Notre Dame. It was so good and a great way to start my morning.\n\nMy friend had one of the savory crepes and loved it. Get a total rewards card. Even gold members get a discounted price!"
        }, 
        {
            "index": 401, 
            "rating": 3, 
            "review": "It was this past Sunday morning and I was looking to eat to quiet down my stomach from all the beverages I was drinking over the weekend. My gf was looking forward to trying this place and why not.... crepes are pretty tasty.\n\nWe shared our breakfast crepes and went half and half on an order of the St. Louis and the Du Soleil. We had asked for the bechamel sauce on the side so we could control how much sauce we got with each bite. Overall, it was just average and nothing outstanding. It was worth trying once but will probably check out some of the other breakfast places in the future."
        }, 
        {
            "index": 402, 
            "rating": 5, 
            "review": "i'll tell you why it is getting 5 stars from me... because they put a hella lot of meat!!!\n\nfinally- a place that doesn't skimp on the protein.  after a relatively long night, we catch la creperie right before they close.  after quickly skimming their menu, the sausage/pepperoni/mushroom/mozza crepe looked amazing.\n\nit was like a pizza crepe thingie.\n\nhuge.  filling.  and delish.  SO GOOD.  wish i had time to go back and try the others!\n\ndo yourself a favor and try it already."
        }, 
        {
            "index": 403, 
            "rating": 5, 
            "review": "The crepes are really delicious. The ones we tried are fresh berry, breakfast and berry lemon. The portion is pretty good too!"
        }, 
        {
            "index": 404, 
            "rating": 4, 
            "review": "Delicious! perfect to take girls to and get some sweet desserts. =]\n\nSee when I think of Crepes I think sweet, or desserts, and theyre nutella crepes are the best! however it is a bit overwhelming but overall a good crepe nontheless! and the crepes are just 10 dollars!! but for an enormous portion, enough for two people for sure!\n\nDefinitely recommend this place for dessert! very tasty!"
        }, 
        {
            "index": 405, 
            "rating": 3, 
            "review": "I have ate at this creperie for a couple of years now. I actually just ate there two weekends ago. I really did not enjoy the crepes. First of all, the concept of this place is perfect. It is located in Paris near the buffet. You can actually watch them make the crepes. In some sort of a way, it is almost like art. The lady with the long pony tail did not make it like art. I know there were a lot of people and she was rushing, but she was kind of sloppy and throwing them all together really quick. I think if she took her time a little more and put a little more love in making them, that they would actually be better. The best part about the crepes is the menu. You have sweet and savory options. I had the monte cristo.I would of liked more cheese that was melted, less turkey and ham, and a more flavorful bechemel sauce. I would of liked more powdered sugar and more micro basil. But, it was decent."
        }, 
        {
            "index": 406, 
            "rating": 3, 
            "review": "Avoid the seafood crepe. \n\nBut everything else was yummy! My favorite was the Prosciutto and cheese crepe. It was the perfect amount of saltiness and chessyness. \n\nI think you'd fare better if you stick with the dessert crepes :)"
        }, 
        {
            "index": 407, 
            "rating": 5, 
            "review": "The Berry Crepe is so yummy! Every time I come to Vegas I make sure to stop in and get a Crepe.  Nothing like you've ever tasted before"
        }, 
        {
            "index": 408, 
            "rating": 3, 
            "review": "This was a split decision. I had the cinnamon roll crepe and it was not good. The lump of cinnamon and sugar inside the crepe was grainy and inedible. My daughter had the berry one and it was great. I guess it depends on what you order. So, this being Vegas the takeaway is, if you feel like gambling on food, come here. The odds are better than the casino will give you!"
        }, 
        {
            "index": 409, 
            "rating": 3, 
            "review": "I tried the dessert crepe with fruit and lemon curd at La Creperie and it was a pretty average crepe. There wasn't much special about it and the berries weren't very sweet or fresh. And the service took a LONG time for just a simple berry crepe. They also mounded half of my plate with really heavy whipped cream, and although I'm biased because I only like whipped cream from starbucks, it was just bad whipped cream in general. The only good thing about this creperie is that for about $10, the huge crepe will fill you up, whether you get the dessert or savory crepe because they're both the same price there."
        }, 
        {
            "index": 410, 
            "rating": 4, 
            "review": "This place is super delicious!  I went w/ a friend and we shared one savory and one sweet.  The savory had shrimp, scallops and some bechamel sauce over it.  The sweet was the Napolean which had raspberries, blueberries and strawberries w/ some lemon custard and a delicious raspberry sauce drizzled all over.  Both were amazing and hella tasty.  \n\nIf you want a get away from the endless buffets in Vegas, you have to try this place.  The only critique I have is that service was very slow, it took them 20+ minutes to get my crepes out.  But regardless, it's worth the wait and just mouthwatering!"
        }, 
        {
            "index": 411, 
            "rating": 5, 
            "review": "This place is $MONEY$ Every time I go to Vegas with my friends we always stop here for a dish even if we arent staying at the Paris Hotel. Both sweet and savory crepes are awesome. We always get something different so we can all share to try each others. It is also fun to watch from the order window of them making the crepes. You would go here if you knew what was good for ya buddy."
        }, 
        {
            "index": 412, 
            "rating": 4, 
            "review": "The wait is a bit long, but the crepe is well worth it. Soft and delicious, we tried both savory and sweet and they're all good. The best part is the crepe itself, I would have enjoyed even just the butter powdered sugar crepe."
        }, 
        {
            "index": 413, 
            "rating": 2, 
            "review": "I bought the Toulouse crepe, which reminded of a pizza before eating. The crepe looked delicious and was freshly made. The Fresh basil on top was a nice touch  The mariana sauce was cold when they put it on top of the crepe so it ruined the entire dish. :( This also made the cheese clump together faster, making it more dissatisfying by the bite. It had so much potential!!! I'm disappointed."
        }, 
        {
            "index": 414, 
            "rating": 5, 
            "review": "Any crepe with the bechamel sauce here is good...I would make love to it."
        }, 
        {
            "index": 415, 
            "rating": 2, 
            "review": "This place is okay. Nothing special and I've had better before.\n\nBut, when you're stumbling around drunk and you're hungry (and perhaps feeling not so rich after gambling), this isn't a bad place to go. You'll get a decent sized crepe and can sit in a fake Paris ambiance. It's weird that you have to go to the restaurant next door to get water/utensils."
        }, 
        {
            "index": 416, 
            "rating": 4, 
            "review": "YUM!!!! So this is basically a fast food window for crepes. Next door to the shop is a nice little place you can sit and eat your delicious crepes. We went for lunch and had a wonderful meal - and one that was honestly too much food for 2 people. We got 1 savory and 1 sweet crepe and we could barely finish the sweet one (though we did it was so good).\n\n~ Caramelized Pear $10.25 caramelized pears, raisins, maple syrup, candied hazelnuts & chantilly cream. This was wonderful- sweet, warm, and the combination of soft pears and crunchy nuts was wonderful. One needs a tea or water to cut the sweetness after a while though. I think it would have been even better with peaches- which I seem to recall they used to have (I've been here before) but I'm not 100% sure on that.\n~ Ham & Cheese $11.45 parisian ham, gruyere & béchamel sauce. WOWOWOWOW!! This was AMAZING! If you only have room for 1 crepe get this one. The meat  has a wonderfully smoky flavor and the gruyere is the perfect addition to the dish. The creamy and salty flavors mix well and leave you very full. \n\nFor roughly $20 you can be stuffed and spend the rest of your time walking it off in either the casino or the strip!"
        }, 
        {
            "index": 417, 
            "rating": 4, 
            "review": "We went to Paris to hit up the Le Buffet for the crepes but the line was about a mile long. Luckily there was La Creperie located exactly across from the buffet. The price of $10 per crepe will at first shock you, but then you have to realize 3 things ... 1. this is Vegas; 2. the crepes are HUGE; and, 3. the crepes are delicious!!! My hubby and I ordered one savory and one sweet crepe and decided to split them. For the savory we got the (forge the formal name of it) cheese and prosciutto crepe. I had never had a savory crepe before, just sweet ones in the real Paris. The crepes are a bit thicker than the real things but they are very very flavorful. After taking my first bite of the savory crepe, I couldn't believe I went this long in life without having one before. All I can say is .... OMG Yum!!!! This is not a crepe I would recommend trying to eat on your own. It is to be shared. It is huge and very very filling. The next was the sweet crepe. We were already full but there was no way I was going to let this go to waste. We ordered the crepe with cinnamon apple filling, topped with caramel and creme. And, when I say creme I mean to say C-R-E-M-E. It's a wallop of real whipped cream; maybe a bit too much. It also melts quickly so be sure to not order it at the same time as the savory crepe. Next time we'll get up and order it separately. Anyway, back to the crepe. Again, yummy goodness! I had never had a crepe with apples before. It was like apple pie hooked up with a Frenchman. Perfection! Even though we were stuffed, we licked our plate clean. This is a definite must-visit when stopping at Paris Las Vegas. I look forward to it in the future.\n\nAdd'l notes .... seating is a problem. This is not a restaurant. Seating is available next door to the crepe stand but on a busy day, it can be tough to find seating. Have one person stalk out a table while the other is in line getting the crepes. While the crepes run $10 a pop, soda is about $4 and it's for a small ... very small ... 16oz cup. The drink prices are not posted on the menu so it's a bit of a shock when they ring it up and you'll be too stunned to say anything. There is no kids menu so when a child orders a crepe, they'll be getting the same size as an adult. Be sure to share!"
        }, 
        {
            "index": 418, 
            "rating": 4, 
            "review": "These are the best crepes I've ever had. Hopefully my mom in law will change this soon! I had a savory crepe with prosciutto, basil, and that white sauce. the prosciutto was on the salty side but overall it was very yummy. The dough was a nice chewy texture. Also had the Napoleon which had berries, custard and whipped cream. Mmmmm custard in a sweet crepe is a must!\n\nI came here because I remembered in from five years ago and wanted to see if it was still there. Lo and behold, it was in the exact same spot. Warning: long lines in the morning--don't even bother with trying to find good coffee. Also, people are animals about tables...I went to touch a coffee to see if it was still hot --meaning the person was claiming the table...and she came pouncing with a squeaky 'excuse me but thats mine'....well well well....i was just checking, don't freak out or anything! anyways, i was the table holder and set myself down as soon as a party of 8 left. it was a big family. =P\n\nPrices were good for vegas we paid around $45 for 4 crepes. the sign says $8.99 per."
        }, 
        {
            "index": 419, 
            "rating": 5, 
            "review": "Really good crapes got the dessert and lunch. The Nutella banana was to rich for my taste but good wish I had milk with it. And the cheese and ham and the roasted chicken were great as well they might not seem filling but they were. Recommend this place to all my friends"
        }, 
        {
            "index": 420, 
            "rating": 4, 
            "review": "love these crepes. being anti-sweets, i've only had the savory ones and can only talk to those.  the crepe was a bit thicker than ones i've had in france but is perfect for holding in the mushrooms, ham, spinach, cheese and everything else.  when you've been out drinking til 8am and back at it at 10am, you gotta watch what you eat.  these make a tasty snack that's not to filling."
        }, 
        {
            "index": 421, 
            "rating": 2, 
            "review": "I've had real crepes in Paris and none have ever been as salty as the one I ate at this place. I had the one with prociutto and boy was it salty. I had to pick out the pieces so I could justify finishing it up. Most of it I threw away because it was making my stomach hurt. I doubt I'll ever give this place a second chance. Two stars."
        }, 
        {
            "index": 422, 
            "rating": 4, 
            "review": "When in Paris, do as Parisians do.  When in Paris Las Vegas, stop by La Creperie.  \n\nI come here a few times a year for a quick, casual breakfast.  Notice I didn't say \"cheap,\" because that's one thing it is NOT.  $8.99 a crepe is a lot of money.  I guess they have to pay for their charming location on Le Boulevard inside Le Casino.\n\nLa Creperie only offers food for takeout, although there's a charming seating area to the left of the stand.  Go with a friend and have him or her save you a seat.  The seating area is pretty small, and you might have to get creative about getting a table.  The crepes are made to order, so get ready to wait 4-5 minutes for your order.\n\nSince I have to order two of everything, I opted for two crepes: one breakfast crepe and one dessert crepe  They offer 6 breakfast crepe choices and 6 dessert crepe choices.  I went with a St. Louis crepe (pronounced \"sen-loo-WEE,\" like the Tampa Bay Lightning player, not like the city in Missouri) and a Peanut crepe (no pronunciation tips necessary).  \n\nThe St. Louis had prosciutto, cheese, basil and was drenched in bechamel sauce.  The sauce was thick, but a bit mealy.  Actually, now that I think about it, it looked pretty disgusting, kind of like milky cream of wheat.  The crepe was very tasty and filling, though.  The second crepe, the Peanut was chock full of chunky peanut butter and bananas.  I would have called it The Elvis (in loving memory).  The Peanut was very sweet, but it still made for a pretty good dessert.  It's not the best dessert crepe out there, though.  Berry and fruit crepes are much better.\n\nPiece of advice: skip the coffee.  It's too weak and taste-less.  I saw people walking around with Starbucks cups.  If I hadn't been so lazy, I would have stopped by a Starbucks before ordering my crepes.  Starbucks is not very Paris like, but . . . you know how they say that Seattle is the Paris of the Pacific Northwest?  Well, they don't really say it, but they could."
        }, 
        {
            "index": 423, 
            "rating": 3, 
            "review": "This is the only way to end a trip to Vegas. The Nutella was good, but I couldn't finish it, it was too sweet. I suggest splitting with a friend, one order sweet and the other savory. Don't go when they're busy, they loose track of who ordered what. They gave mine away last time... Twice!"
        }, 
        {
            "index": 424, 
            "rating": 5, 
            "review": "After a really tasty savory crepe of Gruyere and ham with Bechemel sauce, we went back two nights later for a dessert crepe. We could not choose so picked two, the Bananas Foster and the Cinnamon Bun. Let me just say do NOT miss the chance to indulge. As good as the yummy rum caramel sauce was on the Bananas Foster, the Cinnamon Bun was out of this world! Of course we could not finish and wished their would have been a good way to save it. It is ABSOLUTELY worth the calories and could easily be shared by 4-8 people if you just want a touch of a sweet treat."
        }, 
        {
            "index": 425, 
            "rating": 2, 
            "review": "If you've ever had real Parisian crêpes, you'll be disappointed. My ham and cheese minus the ham was soggy and not all the cheese was melted. Molten. Melted. Anyway, wouldn't go again. Also, the coffee was fit for dissolving large drain clogs. Peace."
        }, 
        {
            "index": 426, 
            "rating": 5, 
            "review": "Oh my goodness, My breakfast crepe was so fresh and yummy! I ordered the Forestiere. Sauteed spinach, Mushrooms, cheese and topped with Bechamel (not that I had any idea what that was before I ordered this... still don't really... but it was good stuff!)! If I could have eaten every meal here on this trip... I probably would have!"
        }, 
        {
            "index": 427, 
            "rating": 5, 
            "review": "I am an avid fan of crepes and this was one of the t I have had. The simple butter and sugar crepe is amazing with amazing flavor. I highly recommend!"
        }
    ]
}