{
    "category": "Las-Vegas", 
    "entity": "Gonzalez-Y-Gonzalez-Restaurant", 
    "avg_rating_stars": 3.5945273631840795, 
    "review_count": 402, 
    "reviews": [
        {
            "index": 1, 
            "rating": 2, 
            "review": "Edible but in no way enjoyable. The \"Perfecto Patron\" margarita was far from perfect. The menu states that it's made with lime juice, but the taste was strictly syrupy mix. The corn tamale appetizers were a sacrilege: there is no reason to deep fry tamales, which is why I stupidly ignored the menu's description that they were \"fried crisp.\" Unfortunately, regarding the tamales, the menu was accurate. The final disappointment was the shredded beef burrito, which was simultaneously spicy and lackluster. The one decent item that we ordered was also the least Mexican--the steak salad. And it was not a WOW! rendition, it was just, thankfully, not a What!?! It is also worth noting that there is a charge for the perfectly average chips and salsa. All in all, our experience was underwhelming and unsatisfying. I won't be heading back."
        }, 
        {
            "index": 2, 
            "rating": 2, 
            "review": "I came here because of the high Yelp ratings.  Boy, they were wrong.  Chi Chi's is better than this place.  Located in the NY NY casino, this small place looked like another food counter place.  There was no food counter, but should have been.  Although slightly better than Taco Bell, there was nothing special about this place.  The meal was so so.  Service was slow and unhelpful as well.  Maybe I came here on an off night.  Doesn't matter, because I ain't coming back."
        }, 
        {
            "index": 3, 
            "rating": 3, 
            "review": "We were staying at the NY-NY Hotel Casino, so we thought we'd try Gonzalez Y Gonzalez for a pre-show dinner.  Arrived at 5:30 PM and were seated in the dining room right away.  The baseball playoffs were on the bar T.V. which is part of the front dining room.  At the bar were 5 younger guys watching the game, and one of them was so drunk he was barely able to sit on his stool.  On most plays, he would scream and shout so loud that it completely disrupted the dining experience, and I could tell that everyone around us was disturbed by this.  However, the bartender continued to serve him.  Even his friends were telling him to quiet down.  The manager came over and spoke with him, but apparently didn't ask them to leave as they all remained (and the disruptive show continued). \n\nThe food was good, although nothing exceptional.  The restaurant charges a nominal (I think it was $2.95) for chips and salsa, which were good.  The service was average to above average.  Overall, I would say give it a try, but they lose one star for food that was nothing special and one star for the manager failing to ask a drunk,"
        }, 
        {
            "index": 4, 
            "rating": 5, 
            "review": "Awesome place to eat inside NYNY. Enjoyed sitting and watching everyone walk by as we ate yummy food. Reasonably priced and had a pretty good selection. Great service too. Would definitely eat here again."
        }, 
        {
            "index": 5, 
            "rating": 4, 
            "review": "Our second dinner in Vegas led us to this little gem stashed away in the back corner of \"Times Square.\"\n\nThe atmosphere definitely screams \"Chevy's Tex-Mex\" which isn't a bad thing, I love Chevy's, but may be off-putting to those that are seeking something more authentic.\n\nAfter reviewing the options I settled on a two-item consisting of a chicken taco and a chile relleno, and after a short wait, they arrived.\n\nThe food was excellent. In fact, the chicken taco was probably among the best I've had at a sit-down Mexican restaurant. The chile relleno was also excellent, though the breading was a bit on the heavy side. The cheese inside was fantastic and the rice and beans that accompanied the two were good as well.\n\nI left a very happy, full gringo that night."
        }, 
        {
            "index": 6, 
            "rating": 3, 
            "review": "The food was very good, but the service was less than par! I really think it was the server assigned to us because the other tables seem to be having prompt service. Food was worth the money"
        }, 
        {
            "index": 7, 
            "rating": 4, 
            "review": "Good place to pop in for a margarita and an appetizer. Went there with my brother on our vegas trip to grab a giant margarita to begin our trek down the strip but decided to have some food before diving head first into a day of drinking. \n\nSteak nachos were good and tasted really fresh. Chips and salsa were free for the first and were above par imo. Prices kinda sucked but its on the strip. Margarita was nice and strong which had me surprised, because I was expecting it to be weak as hell. Overall good place"
        }, 
        {
            "index": 8, 
            "rating": 5, 
            "review": "I had barbocoa (sp?) enchiladas & my husband had pork carnitas. Both meals were excellent!! The meats were fresh and homemade. The guacamole was excellent, fresh! chips & salsa..amazing. We both had the Ultimate margarita which was fabulous until we found out they were $15 each! All in all....we will definitely go back next time we're in Vegas. Oh...the service? was amazing!!!"
        }, 
        {
            "index": 9, 
            "rating": 5, 
            "review": "I frequent G&G every time I come to Vegas, and always enjoy the quality and consistency of the food.  I highly recommend it, and keep in mind that's comin' from a Texan, folks!"
        }, 
        {
            "index": 10, 
            "rating": 4, 
            "review": "Drinks were super cheap music was good but it was pretty dead we just got our buzz and left I will come back"
        }, 
        {
            "index": 11, 
            "rating": 4, 
            "review": "Never disappointed! Great soups. Loved the steak tacos and their chips & salsa is soooo good."
        }, 
        {
            "index": 12, 
            "rating": 4, 
            "review": "The steak nachos are so worth it. The nachos are big enough to fill you up and the jalapeños are not too spicy for those who don't eat hot foods. \nThe drinks are the best they're only $20 bucks for a drink with 6 shots in it. This drink will definitely get you feeling good fast."
        }, 
        {
            "index": 13, 
            "rating": 5, 
            "review": "They switch owners like toilet paper. Food Is great, decent prices, workers are friendly and good ambiance.. Sucks that they charge for the salsa and chips now.. I totally recommend this place, authentic mexican food."
        }, 
        {
            "index": 14, 
            "rating": 3, 
            "review": "I'm a hard-core foodie so I can't say that I have to eat here again in my life but the food was good, I would go here again if I am in the NYNY hotel again. The guacamole was fantastic and fresh made.The service was a little on slow side ( a trend I am noticing in LV), we were part of a group of about 20 and they only gave us one server for the whole table. Salads are large so either make it your meal or share with someone else."
        }, 
        {
            "index": 15, 
            "rating": 3, 
            "review": "Used to be one of our favorites...but the last few times, not as good.  i felt rushed by the servers and the food was overly salty.  Prices are pretty good, but I haven't been back in over a year.  May try again, but disappointed last 2 times."
        }, 
        {
            "index": 16, 
            "rating": 4, 
            "review": "Margaritas great especially at happy hour. Fish tacos good. Chips and salsa were plenty and delicious. Chicken tamales were mostly chicken, but good sauce. Would recommend this place for Mexican meal and it is inside New York,New York!"
        }, 
        {
            "index": 17, 
            "rating": 4, 
            "review": "2014 YELP 365 CHALLENGE - 90/365\n\nWe met up with a few friends who were eating here. Had a few bites of my friend's beef tacos and they were delicious. Everyone said they enjoyed the food. The waitress was very nice to us too."
        }, 
        {
            "index": 18, 
            "rating": 3, 
            "review": "Service was great just quality of food for price you pay isn't worth it to me"
        }, 
        {
            "index": 19, 
            "rating": 5, 
            "review": "We stopped in here for late night munchies of chips & guac with salsas and margaritas. It was so yummy as a port in the vegas strip storm. We fueled up and headed back out for more fun on the town! Very good for a mexican place on the strip!"
        }, 
        {
            "index": 20, 
            "rating": 4, 
            "review": "Gonzalez Y Gonzalez is located in the NYNY casino resort. It's in the food court \"alley way\" near the ThePark LasVegas exit door. \nThe restaurant has family style seating,as well as a bar area, and patio style seating over looking the \"alley way\" walkway. There are wall mounted TV's in the bar area. \nAtmosphere: inviting while being very unassuming. The color schematic is traditional golden hues of yellow, red, and rustic orange. The booths are large allowing plenty of elbow room. Tables are spaced in such a way as to not impede the flow of traffic. \nStaff: customer service here is impeccable. Your server, the next tables server, and the host all greet you with a warm and genuine smile. Their attention to detail, empty cups, finished dishes, and low chips is what makes this place extra special. \nFood: EXCELLENT, no other word would do it justice. It's more of a TexMex style, but that is my preferred way. My burrito was stuffed with meat and beans and covered in a nice layer of red sauce. It was large enough that it could be shared, but we all know by now, I do NOT share. The beans were creamy and smooth with the right amount of cheese to top. The chips were made fresh on site as is the salsa, which has just the right amount of kick and hint of lime. The one thing I would change is the rice, it could almost be a tad more tender. All in all, this was an excellent lunch/dinner option. The cost was agreeable as well."
        }, 
        {
            "index": 21, 
            "rating": 5, 
            "review": "This place was AMAZING! My coworker recommended it, and she was right to. I went with my boyfriend and I got the pork tacos and he got the pork carnitas. Both dishes were amazing and their chips and dip weren't bad either. I would definitely go there again, especially considering how much we both love Mexican food."
        }, 
        {
            "index": 22, 
            "rating": 5, 
            "review": "We stayed in the NYNY during this trip to LV & our last night in town we were both pretty tired & just wanted to hang out in the hotel for the evening. We chose J&J based on reviews posted here & we are glad we did! The atmosphere was calm & quiet which was a pleasant refuge from the noise & bustle of the strip, the staff was great & the food was awesome! We expected the margaritas to be the standard sour mash lime mixture but we were ecstatic to find out we were wrong! The drinks were real lime juice & had a pretty heavy pour on the booze. Also I was expecting the prices to be 2 or 3 times more expensive than they should be just like everything else on the strip but was very happy to find that prices were about average with any good Mexican restaurant that you would find in any town USA. Check it out!"
        }, 
        {
            "index": 23, 
            "rating": 1, 
            "review": "This wasn't the worst place ever, but for the price I would never go back. For a soda, and iced tea and 2 meals we spent $45!!! I would totally pay about $7 for my Chimichanga...but not a penny more. My husband and I both got chimichangas- his was chicken and I got ground beef. There was flavor, but mostly of onion. Our meals both came with some cold, bland spanish rice and refried beans. We did get the free chips and salsa, but I've better of both in Denver. I'm not sure why everyone is so impressed that they are free. The waiter didn't even come back to see if our food was okay...instead he just stood around staring into space since we were his only table. If you've have real Mexican food at any point in you're life don't waste your time or money at Gonzalez y Gonzalez."
        }, 
        {
            "index": 24, 
            "rating": 5, 
            "review": "Chips & salsa are the best. No matter what time we are there, we always get in and get our food quickly. Food is a lot better that a lot of \"Mexican\" restaurants in California. We always eat here when in Vegas. Don't miss this gem inside NYNY."
        }, 
        {
            "index": 25, 
            "rating": 3, 
            "review": "Food was OK - and the best thing we ate was the guacamole made table-side. My wife compared her tamales to those from a jar, and my chili rellenos was average. The draft Negra Modello was tasty, but the margarita was nothing special. The Flan was good - but a great deal larger than our server indicated, so we could've shared one and been happy. Being close to the Zumanity theater was our primary reason for stopping here - and in a pinch we'd stop again."
        }, 
        {
            "index": 26, 
            "rating": 5, 
            "review": "Visiting from Oregon. Had no idea what to expect. The customer service was soo spectacular. Really attentive and checked on us allot. Food was great too. I would deff suggest eating here!"
        }, 
        {
            "index": 27, 
            "rating": 1, 
            "review": "Food tasted like it came out of cardboard boxes or something i could have gotten at costco is was nasty and service was bad."
        }, 
        {
            "index": 28, 
            "rating": 5, 
            "review": "Table side guacamole is awesome.  Had quite a few different things on the menu and all were good.  The one I remember being the best to me were the enchiladas with green sauce, forget what they called them.  I have probably been here 5 or 6 times now and me and the wife love it."
        }, 
        {
            "index": 29, 
            "rating": 4, 
            "review": "This was by far one of our favorite places we ate the whole week we were in Vegas. We went during the soccer game, so it was BUSY! It was loud, rowdy and FUN!  It took quite awhile to get our order taken, or our margaritas for that matter. But like I said, they were beyond busy and seemed under staffed. The manager was running and doing as much as she could. The staff was all VERY polite [something we encountered very little of while in Vegas]. The food was worth the wait, hot and delicious! We didn't finish and they boxed it up, along with extra chips & salsa for us... napkins, cutlery, etc. \n\nOnce the game ended, it calmed down a ton. The manager made sure we were taken care of.. and our waiter was funny & didn't stop smiling the whole time. We will absolutely be back on our next trip!"
        }, 
        {
            "index": 30, 
            "rating": 5, 
            "review": "Our server, Oscar, was amazing! We just stumbled upon this bar in NYNY and as soon as we sat down, Oscar made sure we had everything we needed.  He chatted with us and kept our drinks full all night.  He was so great, we went back the next night just to see him!! We will definitely be back.  Stop by and ask for Oscar!!"
        }, 
        {
            "index": 31, 
            "rating": 1, 
            "review": "The menu sounded great but was disappointed. We tried their famous table side guacamole with king crab, and the crab did not taste fresh at all. We ordered the Arabia pork tacos and the chipotle sauce was so overpowering that that is all you tasted. I will say their ceviche was good but overall not impressed with the food at all. The service was good but it was our first bad meal in Vegas. Bummer"
        }, 
        {
            "index": 32, 
            "rating": 2, 
            "review": "Stayed at the NY NY Hotel/Casino - 111 F outside.\nWe were NOT going out for dinner! Ended up in the\n\"Village\" downstairs - saw a gaggle of mediocre \nrestaurants, wandered into Gonzalez Y Gonzalez.\n\nBoo. \n\nFOOD: Ordered 2 steak nachos, a plate of boneless/\nskinless chicken and a bean and cheese burrito. \n\nSteak Nachos were TEENY TINY!!! We had literally 10\nchips each with beans, cheese, 2 small strips of steak\nand a jalepeno pepper baked on top. They were placed\naround in a circle - fancy like. To their credit, the meat was\nvery tasty but damn... come on... give me more than 10 \nchips for $12. I was expecting a plate of nachos. Plural.\n\nBean & Cheese burrito was also small. Taco Bell makes\nbigger burritos. No bullshit. $5 for that.\n\nThe chips and salsa are endless. Verde salsa was decent.\nWait, our chip basket had a handful of unbroken chips and\nthen the rest of the basket was FULL of chip pieces. WTF?\n\nWhatever. The waiter came by and asked, \"Everthing ok? \nCan I get you anything else?\"\n\nWe lol'd.\n\nSERVICE: Slow. TVs all showed the same lame golf channel.\n\nPRICES: Fair. For Vegas. I guess. $48 for 4 of us.\n**soft drinks are not bottomless.**\n**cocktails are weak**\n\n2 Stars for the 20 nacho chips we had to share between us"
        }, 
        {
            "index": 33, 
            "rating": 4, 
            "review": "Decided to eat here because we are staying in New York New York and the positive reviews on yelp. The food was good and decent portions. The service was also GREAT!! The Salsa for the chips was amazing. I was actually pleasantly surprised because everyone knows that good salsas are hard to come by. The restaurant is adjacent to a bar/club with great variety of Latin music. If you are looking to get your feet wet in to the night scene in Vegas but are timid or shy and not quiet ready to make the plunge this is a great transitional place you can go to. Because if you are not feeling like dancing or getting out there quite yet then you can finish your food and not dance. But if you so feel like dancing then you can step right into the scene. Overall great service and a good experience. Another neat fact is that there is actually a Gonzalez Gonzalez in New York City. I love the way the hotel has all kinds of restaurants that are in NY."
        }, 
        {
            "index": 34, 
            "rating": 2, 
            "review": "I have been coming here since the place opened. We would start our weekends in Vegas with tacos and beer. The food is all fresh, but it just doesn't have much flavor or any sort of spark to it. The inside of the restaurant is clean and not super noisy. Service is never an issue, the food could just be better. If you are hungry and just want something to eat then this place is fine but if you are looking for great Mexican food then I would keep looking."
        }, 
        {
            "index": 35, 
            "rating": 4, 
            "review": "Since we was staying at NYNY, we  decided to check this place out late at night. No cover charge, just a little donation in the entrance is all that's required! Small place to dance, but it was cool. Good ambience here. Beer was reasonably priced. The  music is what I enjoyed! Nothing but Spanish music to get the evening going!! Overall it was a great experience, except for this drunk girl that kept bothering my girlfriend!! But we didn't let that ruin our night. U gotta wait a while for the bartenders to attend to u, like it is usually. Overall, great experience, here....would come back!!!!"
        }, 
        {
            "index": 36, 
            "rating": 3, 
            "review": "The food was good. The margaritas even better. I had the potato taco plate. It was good. My partner had the 3 taco rice/ beans combo. I'm picky when it comes to mexican food but I enjoyed it. It was nice to sit out on the tables located as people walk by"
        }, 
        {
            "index": 37, 
            "rating": 4, 
            "review": "So good!\n\nSunday through Thursday they have deals for $15.95 that offer a pretty decent-sized, though watered-down margarita with your meal!\n\nThe hubby and I got this deal:\n- I got the chicken and shrimp suiza. Jam-packed tortilla was moist, well-flavored shredded chicken and fat, succulent grilled shrimp with sour cream and guac. The dish also came with black beans and a green-colored rice that was okay. I paired this with their classic lime margarita on the rocks. \n- My husband got the shrimp and lobster chile relleno. I don't really like chile relleno and this was no exception; it was soggy and I don't the batter they cook it on. His meal was served with refried beans and green rice. He paired his with a blended mango margarita.\n\nGood Spot for\n- people watching\n- not waiting forever to get a table\n- cheesy, delicious Mexican food\n- FAST service\n\nBad Spot for\n- a quiet meal (Screaming patrons on the roller coaster that goes indoors right above)\n- getting drunk for moderately cheap (watered-down drinks)\n- free chips and salsa. They are really good and well portioned, but they cost money. I'm from CA and I'm not used to having to pay for that."
        }, 
        {
            "index": 38, 
            "rating": 5, 
            "review": "Great experience. Prices are reasonable for the strip. Our server Chris was attentive and friendly. Steak and chicken fajitas were tasty. Would recommend!! Salsa is delicious!"
        }, 
        {
            "index": 39, 
            "rating": 5, 
            "review": "We sat at the bar and Joe took excellent care of us.  Phenomenal tableside guacamole! The shrimp street taco was also amazing.  NYNY restaurants continue to be consistently awesome.  Best Rita in Vegas!"
        }, 
        {
            "index": 40, 
            "rating": 5, 
            "review": "Sat at bar, Brittany was great. Food was so so, which is what I expected. Salsa was best part. Rellano tasted like a week old. Oh well, maybe the kitchen was having a bad day."
        }, 
        {
            "index": 41, 
            "rating": 4, 
            "review": "Recently dined here with my father on 12/15 and came away very impressed. Being from San Diego we appreciate good mexican food and we were not dissapointed. Moreover our server Armando went out of his way to make are dining experience as memorable as possible. My father can be a very picky eater and basicaly Armando listened to what my father wanted. (None of which was on the menu) and recommended something they could make from scratch. Armando is what customer service is all about.  He was friendly,efficient, and a great centerpiece for the restaurant. I ordered the steak fajitas which were great and my father ordered a chicken burrito ()ff the menu) which he loved.  Overrall I felt food was of good value considering you are dining in a casino and ambiance of restaurant was fine. But it was our waiter Armando who made our dining experiance memorable. Thanks Armando!\n\nWilliam Harris\nSan Diego CA"
        }, 
        {
            "index": 42, 
            "rating": 3, 
            "review": "Grilled chile lime chicken ceasar was tasty and fairly fresh. The portion size was above average.\n\nAn order of steak nachos is good enough to split between two people. Preparations of these nachos were different than nachos from other Mexican restaurants.  There are four large chips with toppings and steak strips stacked real tall.  \n\nThe drink menu was decent; the standard assortment of drinks found at most Mexican restaurants.\n\nThe server was attentive but drinks and food took forever to get."
        }, 
        {
            "index": 43, 
            "rating": 3, 
            "review": "Definitely reasonably priced, but this isn't the place you want to go as a veggie on your first day in Vegas when you're hot and tired from an early AM wake up call and plane ride to Vegas.  The belly definitely wasn't happy walking out in the hot sun after a big Mexican lunch.  I was in a burrito stupor for most of the afternoon.\n\nI might come back for dinner on a cool day, but veggie lunchgoers, stay away on a hot Vegas afternoon!"
        }, 
        {
            "index": 44, 
            "rating": 3, 
            "review": "I went here on Saturday with Arkady G. at about 2ish. The place wasn't busy at all and we were seated right away on the \"patio.\"\n\n The chips and salsa were good; I could definitely taste some liquid smoke in the salsa. Like everyone else says, it's cool they give everybody their own salsa. What sticks out was the extremely fast turn around time from when we ordered to when we got our food - I'd say it was less than 15 minutes, tops. I had the tortilla soup, which was less than $7. Arkady ordered the enchiladas which were around $18, he didn't eat them all, and he left his to-go box there. Ooops! \n\nI'd definitely be back, but I wish I had gotten a stamp on the frequent diner's card. Go there 5 times and you get a $15 dining credit. Not bad at all."
        }, 
        {
            "index": 45, 
            "rating": 2, 
            "review": "I used to like the club portion of Gonzalez y Gonzalez until I stopped by today and saw they now have reserved bottle service and all of the seating area is no longer available. $190 for a bottle of SKYY not cool and the restaurant area is now open later. Not a big fan of Reventon at Gonzalez y Gonzalez! The music is still good!"
        }, 
        {
            "index": 46, 
            "rating": 5, 
            "review": "Excelent.\nWe had queso fundido, tableside quacamole, blue corn chicken- excellent.\nMargaritas were good too although maybe a bit pricy compare to the food"
        }, 
        {
            "index": 47, 
            "rating": 4, 
            "review": "Denise was a great bartender/server.  Friendly, helpful and knowledgeable.  If you like good service and Mexican food.  This is a good choice. Fast service"
        }, 
        {
            "index": 48, 
            "rating": 4, 
            "review": "Love this place! I've stopped here the last three times in Vegas. The food is pretty good but I come here for the margaritas! Patron Silver Chambord Margarita! All of a sudden I am thirsty..."
        }, 
        {
            "index": 49, 
            "rating": 4, 
            "review": "Not surprised at ALL that I ended up at a Mexican place for the second time before heading home from Vegas.  I do what I want!!\n\nIt was a Sunday and the football game was on, so it was pretty lively in there.  The service was a bit slow, but oh well.  Chips and salsa - for FREE - was a nice change from the other Mexican place we tried (Yolos @ Planet Hollywood), and the salsa had a nice smoky flavor to it.  \n\nMy chicken tortilla soup was just how I like it - good amount of broth-to-food ratio and everything was super flavorful - I looooove my cilantro, that's for sure! Chicken was nice and tender.  We also shared an appetizer of chicken taquitos, which also had a nice blast of flavor and topped with some deeeeeelicous cheese.  \n\nGood pick if you want something more on the casual side."
        }, 
        {
            "index": 50, 
            "rating": 4, 
            "review": "Wow - for a relatively inauthentic-looking Mexican place inside NY NY I was pretty impressed with Gonzalez Y Gonzalez. \n\nWe sat at the bar and I ordered a very berry margarita and it was KILLER. I couldn't finish it all and the bartender gladly gave me a to-go cup. Started with some chips and salsa - the chips weren't hot but the salsa was perfect - just the right amount of spice. My cousin got the chicken nachos - meh - they were all right, but what really impressed me was the drunken chicken. It was a dinner special that day and it consisted of grilled chicken chunks, grilled veggies and a side of cornbread chorizo stuffing. My mouth was uber-happy (and as many of you may know, Mexican isn't even in my top 5 favorites.)\n\nFor Vegas it was pretty reasonable too - huge marg, couple beers, two entrees and it was around $40. Better-than-decent service and food - I'd definitely recommend."
        }, 
        {
            "index": 51, 
            "rating": 1, 
            "review": "A friend suggested this place to eat before the Zumanity show. The service was really good, that's a plus. Sat us at a little table outdoors, we enjoyed that.\n\nThe food was the issue! We ordered the table side guacamole, it was delicious. \n\nI ordered the chili rellenos....the cheese in the middle was not melted at all, it was actually a large hunk of cheese unmelted, disgusting!!The pepper itself was not cooked properly and was basically in raw form. I enjoy some crunch to my veggies but this was not cooked long enough.\n\nThe BF ordered the chimichanga and he kept biting into large \"whole\" basil leaves. These are used for seasoning (which is understood) but are supposed to be removed prior to consumption. When complained to the waiter we were told \"the ground beef is prepared in the basement in a mass amount and they aren't able to pick out the whole basil leaves\".  eww."
        }, 
        {
            "index": 52, 
            "rating": 4, 
            "review": "I chose Gonzales Y Gonzales for convenience and I was really hoping for somewhere that offered options that catered to everyone. They have a separate vegetarian section! Score. Located inside the New York, New York Hotel & Casino, this little Mexican restaurant featured some different options I've never seen before. Pork belly in an enchilada!? Chipotle mashed potatoes with crispy potatoes inside a taco!? They also feature fresh guacamole made at your table, even guacamole that included pesto in it! I ordered the combo with a taco and enchilada, and that taco was awesome! The cilantro rice was an interesting addition. She got the tres enchiladas that included, shredded brisket, shrimp and pork belly. Overall I enjoyed my meal and was glad they had options for everyone."
        }, 
        {
            "index": 53, 
            "rating": 5, 
            "review": "We really enjoy coming to eat and dance at this place, after 11pm the DJ starts playing and its party time, this place is great for Tourist and Locals alike, the staff; Edwin, Oscar, Juan and all others are very good on providing customer service."
        }, 
        {
            "index": 54, 
            "rating": 5, 
            "review": "This is the place we always make sure we get to first when visiting Vegas. The shrimp fajitas and steak are so yummy. And I love the super tall margaritas. The food here is even tastier then some of the fancy restaurants we've been to. The service is always friendly and great."
        }, 
        {
            "index": 55, 
            "rating": 4, 
            "review": "Definitely a fan of this place.  Wish there were 4 1/2 stars.  We had my best friend's bachelorette party dinner here (NYNY seems to have a lot more options in terms of restaurants than MGM!), and it was a great choice.  It's a lively atmosphere, and it's so affordable for Vegas!  All of us ordered full on meals and margaritas, and after splitting the price, it was only about $30 a person!  And the food is gooooooooood.  I don't know what it is about their salsa, but it is DELICIOUS.  I filled up on chips and salsa and I was full by the time our meals came.\n\nThe service is fast and friendly.   I will definitely visit here again next time I'm in the NYNY/MGM area."
        }, 
        {
            "index": 56, 
            "rating": 5, 
            "review": "Just grabbed a great lunch at the bar,  the food is so fresh and the employees have a fun sense of humor and are really nice and helpful!  The Tortilla soup is the best!   Yum"
        }, 
        {
            "index": 57, 
            "rating": 3, 
            "review": "Underwhelming. We stopped in around midnight after some heavy drinking, so the food served its purpose, but had I been stone sober, I would have been deeply disappointed. This was classic Tex Mex. nothing authentic, unique, or delicious. Just food. The drinks were decent."
        }, 
        {
            "index": 58, 
            "rating": 5, 
            "review": "Best Mexican food I've ever had!!! I don't usually like to eat Mexican because anytime I try, something is always dry like the chicken or rice.. Yuckkk. Or the beans have no flavor, etc but this was so was soooo good. I didn't even come up for air to breathe. Nothing was dry or tasteless :D\n\nI had the King Crab and Shrimp Relleno. It was a special but they need to put it permanently on the menu! My friend got the Chicken Fajita (and of course I had to try it).. so good! Of course I finally find a good Mexican place on its on the other side of the country! I just looked on Yelp and I found in NY! Yippieee! I will be definitely going their! Fingers crossed its the same delicious chain! Otherwise I will be making another trip to Vegas soon ;)"
        }, 
        {
            "index": 59, 
            "rating": 5, 
            "review": "Great service! 7 of us came in on break from our convention and we were starving. Chips and salsa were immediate and fantastic. We had a lot of special requests which were all accommodated. Service was fast and attentive and pleasant. Food was tasty and we were all impressed."
        }, 
        {
            "index": 60, 
            "rating": 5, 
            "review": "I had the honey chipotle wings and the chimichanga. Both were great. The ranch was the best I ever had. Service by Brittany was Awesome."
        }, 
        {
            "index": 61, 
            "rating": 5, 
            "review": "My friend and I randomly picked this place while walking through New York, New York.  The atmosphere was just like any typical chain Mexican places (think multi-color Christmas lights strung above your head).  We were seated within 10 minutes and promptly had a basket of chips and two salsas.  The chips were very fresh...they were hot like they were just out of the frier, not a warming oven (and not greasy at all).  Salsa was tasty and spicy.  I had the Tacos al Carbon and my friend had the crunchy tacos for $11.95 and $10.95 respectfully, both served with rice and beans.  Good prices and good food!"
        }, 
        {
            "index": 62, 
            "rating": 3, 
            "review": "Food was ok.  Prices are decent for a place on the strip at New York New York.  It was cool to sit in the patio area in the streets of NYC."
        }, 
        {
            "index": 63, 
            "rating": 3, 
            "review": "Decent.  \n\nFood could have been a bit warmer.  \n\nCarnitas street tacos.  Maybe a bit greasy and the meet could have been a bit crispy on the edges, with a quick trip to the oven for a broil.  \n\nFlavor was decent with a mild heat. \n\nPresentation was excellent with great  beans and rice. \n\nNo chips and salsa.  \n\nConvenient."
        }, 
        {
            "index": 64, 
            "rating": 4, 
            "review": "This is a go-to spot for us when we visit Vegas. The food is yummy, the ambiance is great and the salsa is so, so good! \n\nGive it a try! And then, wander around the streets of NYC in this fun little casino. Don't forget to stop upstairs for a Nathan's Orangeade before you leave!"
        }, 
        {
            "index": 65, 
            "rating": 5, 
            "review": "My mom had the burrito and I had the potato and cheese tacos: delish! Fresh guacamole made right at the table, place was very clean, great service, and very reasonable prices: which in Vegas we all know isn't hard to come by."
        }, 
        {
            "index": 66, 
            "rating": 4, 
            "review": "A solid choice for Mexican food while in NYNY.\n\nProbably not the absolute best Mexican food you've ever had, but definitely not the worst.  The service here was quick and attentive.\n\nOverall, the food was pretty good and so was the service.  If you want a quick break from the tables and a decent bite to eat, you won't be disappointed."
        }, 
        {
            "index": 67, 
            "rating": 2, 
            "review": "I wanted to watch some football games while eating and ESPN zone was SUPERPACKED, so I wandered into this dive in the New York - New York.  Now I don't get what it is about places like this that have multiple TV's and have all the TV's on the same game while there are multiple games on different channels.  I mean, stagger some TV's between different games yanno people?  We don't all want to watch the same commercials on every TV.\n\nAnyhow, the food.\n\nI sat at the bar and got a margarita that was pretty good.  I got some chips and salsa.  After reading some other reviews here, I'm kinda miffed.  They only brought me the red salsa, I didn't even get to try the green one!  Bastards!  The chips were HOT when they brought them out, and were light and flavorful, good chips.  The red salsa was adequate in flavor but lacked a little heat, so nothing outstanding there.\n\nThe bartender asked if I was 'really hungry' while I perused the menu.  I said sure I guess, so he suggested the Fajita burrito.  That choice sounded fine so that's what I got.  It was served fairly quickly and yeah it was a good sized burrito served with rice and beans.  The meat was not bad, heavy taste on the marinade, but did seem to be cooked alright.  The burrito itself was heavy, the guacamole did not taste fresh, and the sauce they put on the burrito seemed distracting to the taste of the fajitas.\n\nMy biggest peeve was the the side rice and beans were not good at all.  The rice lacked flavor and seemed stale, and the beans were horrid.  I've tasted better beans right out of a can of Rosarito.  I only ate about half of what was on the plate and that's highly unusual for me. \n\nSo overall this seemed a decent place to grab a margie and a tequila shot, but I don't plan on eating here again."
        }, 
        {
            "index": 68, 
            "rating": 1, 
            "review": "Waited for 25 minutes was not served despite several attempts. Restaurant was fairly empty. Portions looked like over-priced plus-sized casino garbage. Save yourself some time and head elsewhere."
        }, 
        {
            "index": 69, 
            "rating": 4, 
            "review": "My best meal in Las Vegas!\n\nService, food and drinks were all top notch.  \n\nI sat at the bar and had a nice view of a TV to watch a Dodgers game and it was a perfect place for people watching too.\n\nService was so fast...I ordered my drink (Cadillac Gonzalez Margarita) and I had only had one sip when my chimichanga arrived.  The drink was very good, if a bit strong.  The food was hot and delicious.\n\nI'd definitely recommend this place."
        }, 
        {
            "index": 70, 
            "rating": 4, 
            "review": "Excellent atmosphere and vibe. The margaritas were great too. It was a little bit tight for seating within the restaurant, but I get it. I would recommend for a group of people in Vegas looking for some margaritas and good Mexican food!"
        }, 
        {
            "index": 71, 
            "rating": 4, 
            "review": "Fast service and great drinks. Stopped here before Zumanity. Got the frozen peach margarita and it was awesome."
        }, 
        {
            "index": 72, 
            "rating": 4, 
            "review": "While in Las Vegas this past weekend, my girlfriend and I decided we wanted a Mexican dinner one night, but didn't want to venture off The Strip, as we were walking from resort to resort for the night.\n\nGonzalez Y Gonzalez came up with high marks on Yelp, so we decided to give it a go, since New York New York was a central location for us. Entering from the doors nearest the Brooklyn Bridge, the restaurant was very easy to find fairly close to where we came in.\n\nThe hostess was very friendly and we were seated immediately, even though it was a Saturday night. The restaurant is fairly noisy, but not so much that you're annoyed. It's not quiet and intimate, but it's not loud and douchey like a sports bar can be. It appears that there are no booths, only tables. However, the tables are far enough apart that you don't feel as though you're dining with a family of 60 when there.\n\nChips and salsa are not complimentary - we asked only after they weren't brought to us. They are VERY tasty however, so I recommend the $3 or whatever to get them; the serving is generous, and the salsa fire-roasted goodness.\n\nI ordered the Arrachera, which is the restaurant's version of a carne asada platter. Holy crap, was it AMAZING! SO flavorful, and so perfectly cooked! My mouth is watering just thinking about it! It comes with a small cup of \"drunken beans\" which I totally suggest dipping the meat into before each bite - jackpot in your mouth!\n\nI ordered an El Coco Loco margarita, and let me tell you - it was a religious experience, as if the food wasn't good enough. The ingredients are Malibu, tequila, pina colada mix, and sweet & sour mix, blended. I'm not kidding when I say it tasted almost exactly like Smarties Candy. Unreal, and so damned good!\n\nOur waiter and one other guy that served us were not terribly friendly; normally, I would have dinged a star for that, but the food is SO good that it made up for not becoming BFFs with the wait staff. The guys should have been more personable, and I hope they aren't indicative of the rest of the staff's attitude at Gonzalez Y Gonzalez.\n\nThis is our new go-to Mexican place on The Strip, and I cannot wait to hit it again the next time we're in town! I'd highly recommend this restaurant to anyone and everyone looking for amazing, affordable Mexican food in Vegas!"
        }, 
        {
            "index": 73, 
            "rating": 5, 
            "review": "This was a great meal, everything was really fresh and the guacamole was delicious. I had the carne asada street tacos and it was really a lot of food. We also had chips and salsa and the salsa was one of the better ones I have had. Will definitely be back this trip."
        }, 
        {
            "index": 74, 
            "rating": 3, 
            "review": "My experience at this Mexican restaurant located inside the NYNY hotel and casino was pretty good and meet all my expectations in terms of food, drinks and service. This isn't a 'refined' dining experience, it is a good, I'm hungry, don't want another hamburger or pizza restaurant.\n\nGonzalez is a reasonable sit-down restaurant with a reasonable menu with most entrees coming in at between $17 and $22. There are quite a few appetizers to choose from as well, most being around $8-9.\n\nI ordered a simple house margarita on the rocks with rim which was pleasant, not too tart, possibly a little light alcohol, but good none-the-less. My BF ordered the sangria which he loved so much that he didn't even save me a sip!\n\nWe decided to go for the Crab Guacamole (just under $12) and were pleasantly surprised to find that this was prepared table side, to your specifications. The serving of this appetizer is just about enough for 3 people to share. A generous portion served with a good stack of chips and pitas.\n\nFor mains, I had the Steak Fajita while the BF ordered the pork carnitas. Both are served with sides of refritos and rice, while the fajitas also came with pico de gallo, guacamole and sour cream. \n\nThe steak fajitas is enough for 2 people, especially if you started with an appetizer. I am not afraid to stuff my face and there just was no way I could finish my meal. The leftovers will make a great lunchtime sandwich!\n\nThe pork for the carnitas was quite good too if just a little too sweet for my taste. That said, my BF devoured it. \n\nOnce finish, our waiter happily brought over some take-out boxes along with some utensils. \n\nMy notes would be that the waiter seemed somewhat overwhelmed with an unexpected rush mid-afternoon. The margarita, as mentioned, was a little light on alcohol, I think they are more used to making the frozen margaritas. \n\nOverall, I would eat here again but only order an app or two and then share an entree as the portions are quite large."
        }, 
        {
            "index": 75, 
            "rating": 1, 
            "review": "I will never go back, we had horrible service.......until the manager started walking around. They did not bring out the right food for my friend. Then to top it off I ended up getting sick from the food that I ordered. \n\nAlso expect to pay a good bit for your \"experience\" there."
        }, 
        {
            "index": 76, 
            "rating": 3, 
            "review": "This has been a favorite of my family's since we started going to Vegas years ago.  There have been recent changes in the operation that just make you feel like the place is cheap and trying to nickel and dime  you to death.  They have always had solid salsa and chips, and that has always been part of the meal as is custom in most Mexican food restaurants.  However, on my visit of January 11, 2014 there was no salsa or chips without an extra charge.  A buddy and I ordered nachos and when they were delivered we requested salsa for the nachos and were told by the waiter that he couldn't do that without a charge.  The food was as good as always, but I won't return under the mickey mouse nickel and dime operation that it has turned into.\n\nIf you really want Mexican food I would go to Mesa Grill at Caesar's.  It is fantastic."
        }, 
        {
            "index": 77, 
            "rating": 2, 
            "review": "Located inside the New York New York hotel.  The food was just okay.  Since I live in Arizona and get great Mexican food, this place left little to be desired.  I thought the salsa was bland and they didn't have a spicier salsa available.  My girlfriends and I all had different entrees and we all agreed that the food was not very good."
        }, 
        {
            "index": 78, 
            "rating": 1, 
            "review": "If you're desperate to eat then this is your place. When my husband and I went here since it was 11pm and hungry. We were seated, but hostess didn't know anything about the menu so don't ask.  She said she is \"not supposed to know\". Really, customer service 101, know what you're selling. It is key and so making sure your customers don't  walk out. We should have walked out but my husband was really hungry. The food was ok, not like Mexican food from San Diego. We didn't really see the waiter...4666 Roberto: 1. Took our order 2. Drop off my drink order 3. Drop off chips and salsa order (not free!!), someone else dropped off food 3. Refill my husbands water, but no \"how's everything? Or how's the food?\" 4) ask for a check. 5) gave us check and NO thank you whatsoever. I guess customer service is not a priority. It also feels a lot like a cheap TJ club. Please, save your money and time. I gave a $3 tip but my husband said $0 will be better. Well, eat at your own risk if customer service is not prior you. Husband is at the bathroom as we speak."
        }, 
        {
            "index": 79, 
            "rating": 1, 
            "review": "Sub par Mexican at Strip prices! Anyone who says this is great needs their head examined. Their Cadillac Margarita was completely watered down. I'm not convinced there was any tequila in it. My wife's carnitas sucked - it's like they were pre-cooked bad reheated. My chimi was the worst I've ever had and the equivalent of Taco Bell. Plus, the service was nonexistent. \n\nThe only good part of the meal was the hostess. She was warm, friendly, and kind. \n\nI expect to get gouged on the Strip, but not like this. We won't be back."
        }, 
        {
            "index": 80, 
            "rating": 4, 
            "review": "Located inside of NYNY Hotel & Casino, I believe this is the only Mexican restaurant that's tucked away along their food alley. Francisco, was our impeccable waiter. He never left our glasses half empty (or half full for you optimists), was always attentive, but never intrusive. \n\nFOOD\n+ Carne asada street tacos ($15.95): The steak was tender with a really good marinated flavor, and the tomatillo salsa gave it a spicy, but not in your face, kick.\n- Burrito ($14.95): My friend didn't care for this at all and barely ate it. Francisco offered to give her something else on the house, which was not needed, but very appreciated.\n+ Chips and Salsa ($2.95): Not included unlike other Mexican restaurants. The mesquite roasted tomato salsa gave the warm tortilla chips a unique flavor profile.\n\nCONCLUSION\nThis restaurant is a step above Taco Bell and is Americanized to suit the masses. If you don't feel like walking the Vegas Strip to find something better, Gonzalez Y Gonzalez is a safe bet."
        }, 
        {
            "index": 81, 
            "rating": 5, 
            "review": "An excellent Mexican restaurant in Vegas.  My wife and I weren't actually expecting much given that it's in a casino / hotel but we were very pleasantly surprised to find out the food, service and prices were excellent.  Quite authentic Mexican cuisine and service was very personal and attentive.  Probably the least expensive sit down restaurant in this hotel.  Overall, a great value, decent atmosphere, and food and service that we're be sure to come back for when in town again."
        }, 
        {
            "index": 82, 
            "rating": 4, 
            "review": "My girlfriend wanted to come here, but I'm a sucker anyways for Mexican food!! I have to say it wasn't too bad!! I ordered the pozole and she ordered the tortilla soup cause she wasn't feeling too well. It definitely hit the spot though!! I've only had homemade pozole once which happened to be my first time and so I figured right now try this one, plus I was craving it! My pozole was super delicious, just perfect! We also ordered the table side guacamole, it wasn't bad, but definitely not worth $8.75.\n\nI do have to say that the 4 stars were for the food, maybe a star for service and it was lacking it. The hostesses up front weren't very friendly, more like in a hurry. When my girlfriend and I were seated, it took 10 mins for someone to come ask us what we wanted to drink. I understand if it was a weekend but it's Monday. \n\nOf course I will give this restaurant another shot next time we are back here, or staying at the Monte Carlo again."
        }, 
        {
            "index": 83, 
            "rating": 4, 
            "review": "Guacamole made fresh, in front of you, was superb. My friends said the fish tacos were great and my fajitas were pretty good as well."
        }, 
        {
            "index": 84, 
            "rating": 4, 
            "review": "Since I don't live in Vegas we really didn't know where to eat cause there are just 1 too many options for when 1 is hungry and dying so we decided to stop in here. The service was good, the food was yummy, they're house salsa was delicious! I had the Gaucho steak salad which was really good! My only complaint would have to be that I liked the salad after I doctored it up with guacamole vs just the slices of avocado on top. If I'm ever in Vegas again I wouldn't mind dropping in for a bite."
        }, 
        {
            "index": 85, 
            "rating": 5, 
            "review": "Food was delicious! The cook in the front line named Jorge is a great cook. Elena i believe? She was our host. She took care of me and my 3 guy friends. She stayed on top of everything. Made sure food was good and drinks were full. The shrimp tacos i ordered were delicious. My friends all order different things but it all looked great. Atmosphere was nice and relaxing too. Service was so good i left a 25$ tip and went and thanked Jorge for the delicious meal."
        }, 
        {
            "index": 86, 
            "rating": 5, 
            "review": "We decided to revisit this restaurant based on our previous visit 2 years ago. Upon arrival, we were quickly seated and Chris made us feel at home. Ordered a margarita & guacamole which were both awesome. I had the shrimp fajitas while my wife ordered potato tacos. We were thrilled with the service and attention Chris provided to us. It wasn't surprising as Chris was the same server we had exactly 2 years ago today. Based on the food & excellent service, you cannot go wrong with this place."
        }, 
        {
            "index": 87, 
            "rating": 5, 
            "review": "ok..i dont know if this is \"real mexican food\" but it was damn good haha. \n\ni shared the wings.. and had a chili rellano. (spelling i know) but it was really good and the prices were good, the people were nice and .. ill go back sure!"
        }, 
        {
            "index": 88, 
            "rating": 5, 
            "review": "Excellent customer service, attentive but not intrusive.  The food was very good and great portion size.  Definitely better than a buffet : )!"
        }, 
        {
            "index": 89, 
            "rating": 5, 
            "review": "This place is great. The chicken tacos are the best with a sky high drink."
        }, 
        {
            "index": 90, 
            "rating": 4, 
            "review": "Food, 4 stars.\nChicken enchiladas. 4 stars. Great flavor. The runny beans would be my only suggestion for improvement.\nCrunchy tacos. 4 stars. Hubby thought the ground beef was seasoned spectacularly. I didn't sample them... They're just tacos, right? (But he did say 'wow, the meat is seasoned well' on the first bite)-his rating was 4.5\nAppetizer Dip trio. 3.5 stars. Chili queso is excellent. Superb even. Also loved the green chili sour cream. The roasted tomato salsa was mediocre. I like my salsa to pack a little more heat.\n\nService was 3.5-4 stars. Our waiter was on point, prompt with food but overloaded with tables. He couldn't keep pace & we waited to place order & for the change on the bill. \n\nHostess... 3 stars. She could work interpersonal skills & body language. She seemed to work hard but 'appeared' not to enjoy her job."
        }, 
        {
            "index": 91, 
            "rating": 3, 
            "review": "We ordered tortilla soup. Not very authentic but good. We ordered guacamole. It was made table side and decent. We ordered a plain bean and cheese burrito for a kid. It was retried canned beans with a little cheese. That was acceptable but what wasn't was the 15.95 that they charges for it. Yikes. Highway robbery."
        }, 
        {
            "index": 92, 
            "rating": 1, 
            "review": "After reading all these reviews I thought I was going to be going to a good mexican restaurant but I was wrong.Just an FYI if  you want chips and salsa you have to PAY and they do not come FREE with the meal. The main salsa was OKAY but nothing to write home about. I ordered grilled chicken nachos and they were brought to the table and looked like something a 5 year old would have made and I felt the presentation of them was bad. My family members ordered the fish tacos and YIKES..not good at all!!! I ordered the chicken & shrimp fajitas and they were nothing special. I have been to many mexican restaurants in Vegas here and I don't recommend this to anyone."
        }, 
        {
            "index": 93, 
            "rating": 5, 
            "review": "We had dinner on Sunday May 10 and we have to say best food in Las Vegas for us.\n\nMy husband had the beef chimichanga which it was delicious.  I ordered the rib eye steak which it was a little to fatty for me. The waiter without any hesitation apologized took my plate and brought me back another steak which was unbelievable super tasty and tender.\n\nGreat food and service!!\n\nThanks Bill and Maria"
        }, 
        {
            "index": 94, 
            "rating": 2, 
            "review": "It was very very difficult to communicate with the waitress. I ordered nachos, which was only 4 chips - $11. Fajitas were better, but strip priced too. Service was poor. 2 stars only because the meat was tender. No salsa on nachos? Beans, meat and cheese. Ugh."
        }, 
        {
            "index": 95, 
            "rating": 3, 
            "review": "It was a busy cute Mexican restaurant . They didn't serve us any chips and salsa. We were hoping for. Our food was ok. My husband had tacos, I had posole  soup. \nOur service was slow!!!"
        }, 
        {
            "index": 96, 
            "rating": 2, 
            "review": "Service is not good, i had diarrhea after eating chicken fajita burrito today. Took long time to take my order. The border grill at mandalay bay is way better. Food and service is way better. Should not have to get sick in vegas after eating at expensive restaurant."
        }, 
        {
            "index": 97, 
            "rating": 3, 
            "review": "This restaurant is inside NYNY a cute little place to stop at, while enjoying looking around at the NY decorations. If you sit out on their patio, you can enjoy the feeling of sitting out on a patio in NY. You are surrounded by decorated walls that are transformed into apartment buildings, cafe's, little tables to look like people are eating outside restaurants in NY. I have never been to NY so it was cool checking things out while we enjoyed a few drinks before our meal.\n\nEverything about this dining experience was good, except my sister receiving the wrong order. For some reason our waiter thought she said something different then what she wanted, so when our order came out we had to send hers back and the waiter had to put in her order. I ordered the nachos, which were ok. They come on large home made chips, with steak, cheese, jalapenos and guacamole. The steak was a little tough to chew through which was disappointing, but their guacamole was pretty tasty. My sister ordered their taquitos. They weren't bad, nice and simple dish, dip them in their chipotle sauce and they were actually pretty tasty. Besides getting the wrong order out first and her having to wait for the taquitos everything else was nice. Our waiter was polite and quick, the scenery was cool and the drinks were delicious."
        }, 
        {
            "index": 98, 
            "rating": 2, 
            "review": "This place was ok.  I order beef tacos, the beef was a little and the food tooka  while to come out.  Other than that it was ok.  If I ever return I would go elsewhere."
        }, 
        {
            "index": 99, 
            "rating": 4, 
            "review": "Great Mexican place - I think we ate at all the restaurants in NYNY since we stayed there.  We all were happy with our meals, the flavor was great - some of the meat was a little tough though.  We also ordered guac which was tasty as well.  The chips and salsa were also good - which is how we rate our mexican restaurants.  The margaritas were tasty too!"
        }, 
        {
            "index": 100, 
            "rating": 5, 
            "review": "Got seated quickly \nGreeted by our waiter Chris quickly. \nThey charge $3.00 for chips n salsa. Worth it. Salsa has a nice roasted flavor. Good size fresh tortilla chips. \nCrispy shredded beef tacos are tasty. Shredded beef a teeny bit spice but good. Good portion and not too expensive. \nTaco plate was around $14 for 3 tacos with a side of rice n beans. \nI would come here again :)"
        }, 
        {
            "index": 101, 
            "rating": 1, 
            "review": "Overall experience was not good. The guacamole had too much lime.  They charge u for everything including salsa and for chips also.   The waiter we had was not friendly. The tortilla soup was bland and served cold.  The food was lukewarm when it arrived.  Fish tacos were not tasty at all.  I would suggest to just past this place by when your walking thru New York New York!"
        }, 
        {
            "index": 102, 
            "rating": 4, 
            "review": "This is about 7 months overdue, but somehow I lost this review. After my initial review, I was contacted by a manager, who apologized for my and my family's experience, and she told me to please let her know when we were in Vegas next, and she would make sure we had a better experience.\n\nMy parents ended up in Vegas a few months later with two friends, and since they were with me on our first visit, and they paid for it, I figured they should be able to enjoy the free visit. They called and let the management know they were coming before a show, and were treated to a completely free meal, including drinks. \n\nFrom all accounts, the meal they had was great. The manager gave them what she considered her \"best\" server, who my parents agreed was attentive, charming and responsive. My parents and their friends enjoyed an appetizer, entrees and plentiful drinks, and had no complaints. My father even ordered a seafood dish and said it really surpassed his expectations. \n\nIf this had been the only time we'd been to this restaurant, it obviously would be a 5 star review. However, it was pretty clear that the amazing service my family received was due to our previously bad experience, so I have to take that into account. Also, although they were treated to their drinks, they retail price for margaritas was nearly $16 dollars each, which is a pretty pricey margarita. They were pretty good, but definitely not the best we've had, and certainly not worth their normal price tag. I'm not sure we would come back immediately, since our two experiences obviously differ wildly, but if we were coming for appetizers only, I might consider it again. Their willingness to correct their mistakes, especially in a town where repeat customers are not always a realistic goal, make me more inclined to visit again in the future."
        }, 
        {
            "index": 103, 
            "rating": 1, 
            "review": "We went to this place because it had some good Yelp reviews, but I'm not quite sure what people were thinking. The server did not seem like he cared much about doing a good job, and he didn't even check back with us after we received our food. We ordered chips and salsa (they cost $2.95, but it seems like it is typical for Mexican restaurants to charge for chips and salsa in Vegas). The chips and salsa were the best part of the meal. If that's the only thing you order there, you're doing yourself a favor. I ordered a bean and cheese burrito (it cost over $10, which seemed a little pricey), and it did not come with beans and rice on the side. I also did not get an option of what type of beans I wanted in my burrito, and that seems odd for a Mexican restaurant. I received my order very quickly, and once I started eating I realized why. It was a store bought, flour tortilla, with over cooked rice and I'm guessing canned re-fried  beans inside. The cheese inside was not completely melted. It was truly the worst Mexican food I've ever had, and I'm originally from California, so I've had good, authentic Mexican food. I would also avoid the margaritas at this place. They are very costly, and there is very little alcohol in them. You're better off buying a dollar margarita in one of the casinos. Overall, do yourself a favor and go to a different Mexican restaurant."
        }, 
        {
            "index": 104, 
            "rating": 3, 
            "review": "Gonzalez y Gonzalez is a reasonable place to get some of the standard Mexican fare that you'd expect from a restaurant in a big hotel on the strip.  In other words, it's convenient but a bit overpriced and underspiced.  I live in a small city in Maine and it's crazy that I can get better Mexican food at home than I can in Las Vegas.\n\nTwo stars for the food and prices, four stars for the service and convenience.  Yeah, I guess it's okay but there must be better places to get Mexican food outside of the hotels."
        }, 
        {
            "index": 105, 
            "rating": 2, 
            "review": "We went for salsa night tried to purchase bottle service which has clearly posted pricing once we sat down the waiter tried charging $60 extra for  the table claiming tip is included and juice was extra... So we left because I personally hate up charges tried getting water and the bartenders claim they don't serve water at this bar extremely disappointed I used to love coming here not anymore"
        }, 
        {
            "index": 106, 
            "rating": 1, 
            "review": "It's really hard to explain but the reason why they deserve 1 star is thanks to Joe,a worker there that worked on March 31,2012 the night shift hmm around 11:30 pm...He was very rude.If it wasnt because we were celebrating my sisters birthday and this is where she had choosen to spend it ...I would have left.Thts how bad it was Of course my sister was not there when all happen.The music was very good and i enjoyed it.The bartender was nice and pleasant and the drinks were yummy.If i ever go to Vegas thks to him i will not stop by there.He was Very unprofessional and rude.I cannot comment on the food because i did not eat there.Me and a party of 11 people went there for drinks and music."
        }, 
        {
            "index": 107, 
            "rating": 4, 
            "review": "Good! I had the Ancho Chile Halibut.   The Halibut was perfect! The service was spectacular!"
        }, 
        {
            "index": 108, 
            "rating": 5, 
            "review": "A MUST GO TO!!!!  If you love Mexican food, you'll LOVE this place!!!!  And it's not as crazy expensive as other places on the strip."
        }, 
        {
            "index": 109, 
            "rating": 2, 
            "review": "My best friend wanted to eat here when we were staying at the New York New York hotel. She said she ate there before and really liked the food. Since we rarely get to eat good mexican food, I was totally down. \n\nLong story short - The food was okay (I had the steak fajitas) but there was one MAJOR problem. Our waiter had a mad case of staring. He kept looking at us from one table away. It was so disturbing. Actually there were three waiters just hanging out by the bar talking story and playing with each other while my waiter was staring at us like we were rock stars.\n\nThen, in an effort to give tip I was supposed to get $6 back in change. I asked him to give me dollar bills so that I could tip him what I wanted. When he came back, he assumed he was going to get $5 before even giving me my change back and passed me a $1. I was like, \"no, no, no\" can I please get my change and get a receipt? He was looking at me really confused, and didn't want to give me my change. \n\nFinally I got my stuff - I was upset and pissed off that the restaurant sucked. Not to mention my best friend had soup that was filled with salt as well and she was upset too. When we got up to the room, I looked at my receipt and saw that my waiter's name was \"Jesus\" - no way!"
        }, 
        {
            "index": 110, 
            "rating": 3, 
            "review": "I stopped in here with my boyfriend early in the day before we took off to head back home to California. I can eat Mexican food for breakfast, lunch, or dinner. It wasn't too crowded in here since it was before noon and the service was quite friendly. \n\nThey have crunchy chips and flavorful salsa - good way to start a Mexican meal. The food was not top-notch nor was it poor. It was just...good. Being from So-Cal, I didn't expect anything out would this world. It was fatty, greasy, delicious, and it hit the spot for a long drive home.\n\nA-okay by me."
        }, 
        {
            "index": 111, 
            "rating": 5, 
            "review": "Delicious food and great service. We mentioned were in a hurry since we had to get to the airport and they immediately sat us and got our food out quickly. They checked in often to make sure we had everything we needed. The food was also really good and at a great price. Would definitely recommend this place!"
        }, 
        {
            "index": 112, 
            "rating": 2, 
            "review": "The Hostess was pleasant sat us after a brief wait. Our waiter appeared 10 minutes after being seated. When we tried to order, our waiter was extremely rude and had zero concern over my food allergies which he ignored. When I responded with, ok just no cheese on anything please, I have a dairy allergy. Our waiter responded with- I HEARD YOU - No BEANS! Really? this guy ruined a perfect evening with my daughter. He was so rude, We chose to leave the Gonzalez-Gonzalez before ever receiving our water. Since we came to eat after a concert we had a crepe instead @48th and Crepe- delish and wait staff very pleasant."
        }, 
        {
            "index": 113, 
            "rating": 2, 
            "review": "For the life of me, I don't know why people throw around 4 and 5 stars for the food here.\n\nThe food lacked flavor.  Should be \"0\" stars.  There is no category of \"sad\" to select, either: my traveling companions, unfortunately, agreed with me.  Whoever writes their menu should write ads for online daters, as my friend Dita likes to say (and she is quoted so often): Singles in Sin City would be getting more ass than a toilet seat if we put these folks on the job.\n\nThe drinks were watered down.  We all noticed, except for the one person who ordered a bottled beer (he's my attorney, a senior partner from the law firm I call 'Sharks & Piranhas.')  You're liable to get higher from your blood being too thinned-out by consuming their drinks (and being on the high desert plateau) than you'll ever be from the alcohol in their beverages.  Maybe 1 star, at best.\n\nThe service was good, but I declined the offer to provide me with another entree.  Not a fan of getting someone's phlegm in my food.\n\nStill, I guess that getting real -- but bland, tasteless -- food is far better than the so-called best offered by McDonald's."
        }, 
        {
            "index": 114, 
            "rating": 5, 
            "review": "The first time I ate here was amazing. The next two were just as good. Good selection of happy hour items from taco salads, enchiladas, and burritos. Buckets of corona for large groups. Sizzling fajitas are my favorite. I went with the carne asada and it was cooked just right. Lots of flavor and very soft. \n\nIf you're at New York New York make it a priority to stop by here and grab a bite."
        }, 
        {
            "index": 115, 
            "rating": 4, 
            "review": "I eat here every single time that I'm in Vegas. I love their burritos. This time I chose a chicken fajita burrito and I was not disappointed. Be warned - it is a LOT of food. I find that their food does a nice job soaking up the alcohol haze I sometimes get in after a big partying day in Vegas. Then, I just have to sleep the food coma off. If you like Americanized Mexican food, you'll like Gonzalez Y Gonazelez. If you're looking for authentic Mexican food, this isn't the place for you. Their drink prices are a little high, so I never order alcohol here. Last year, I tried their fried ice cream, and it was also very good. All-in-all, I think this restaurant is a must visit every year for me."
        }, 
        {
            "index": 116, 
            "rating": 1, 
            "review": "It was a mediocre experience. My husband and I stopped in for dinner before Sur Du Soleil. I ordered the Pork Milanesa Salad and my husband the ground beef enchiladas. The pork for my salad, thankfully, was served on the side. It was cooked through but came coated in oil rendering it inedible. The salad was missing the pumpkin seeds and though the avocado dressing was very good the salad was overdressed. \n\nThe beef in the enchiladas was seasoned and maybe from the disappointment from my salad, I only thought they were okay. The beef was a little sweet for my liking.\n\nIt felt since we didn't order alcoholic drinks we were not important. Once we placed our order we didn't see our server, Jet, until the very end. I explained about the pork, the server didn't offer to correct my meal or apologize. We were not offered refills on our drinks."
        }, 
        {
            "index": 117, 
            "rating": 1, 
            "review": "Called ahead for a reservation for a large group.  Arrived and they claimed they didn't do large groups and we must split our party into groups of 5.  Separated us all over the restaurant.  One table at our group never got served for almost a full hour.  Got their drinks, orders were taken just no food.\nMy son ordered steak nachos for $15, came with 4 chips and a few pieces of steak.  kids quesadilla was hard.  My shredded beef burrito was good, but service was so poor will never eat here again."
        }, 
        {
            "index": 118, 
            "rating": 5, 
            "review": "I've been coming to gonzalez y gonzalez for over five years and am never disappointed.  We always ask for hector because we know we'll get great service and pleasant conversation to accompany excellent food! Thank you, hector.  See you next year."
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "This place is good!   I was surprised how great the food was.  My friend and I were walking all over the strip and just happened upon this place!  I only like two Mexican restaurants in Vegas and they are Viva Mercados and Gonzales, Gonzalez!!!"
        }, 
        {
            "index": 120, 
            "rating": 3, 
            "review": "As far as anything in Vegas goes, the prices were high and the food was sub-par.  I got beef nachos, but it tasted like the beef from taco bell.  My friend got the chimichanga, but his stomach was hurting almost immediately after eating it.  We definitely should have gone somewhere else since we paid a lot and didn't feel so great after."
        }, 
        {
            "index": 121, 
            "rating": 3, 
            "review": "We ended up coming here pretty late on evening.  The service was fast so that was nice when you are hungry but they were not very busy so I don't know if this is normal service for them or not.  \n\nI had the chili rellenos, it was OK overall.  The rice was strange in my opinion as it had carrots it in.  It came with 2 stuffed peppers, I could only eat 1/2 of once since I had a stomach full of frozen drinks.  \n\nMy husband had their version of a caesar salad and said it was just OK.  My mom had a chimichanga and said it was greasy.  The chips and salsa were good and tasted fresh."
        }, 
        {
            "index": 122, 
            "rating": 4, 
            "review": "Delicious chips and salsa! I was shocked that we had to pay for chips and salsa, but it was worth it! Some of the best salsa I have had. I got a combination with a beef burrito and chicken taco. Shredded beef was delicious. I would eat here again."
        }, 
        {
            "index": 123, 
            "rating": 3, 
            "review": "As many other yelpers have noted, this is not the best Mexican food you'll ever eat and definitely not the most authentic, but it was definitely reasonably priced and fairly tasty. \n\nThe restaurant is located at NY NY near where the theater for the Cirque du Soleil show Zumanity is. The atmosphere is nothing all that special, but it's got strings of Christmas lights and a decent sized patio to give it a little ambiance. \n\nThe food was average Tex-Mex at average Tex-Mex prices. They've got tacos, burritos, salads, combo plates, chips, salsa, guac, and a comprehensive list of tasty margaritas (even a 3-foot-tall one!). \n\nOne thing that made this place great was the service -- I was staying at NY NY with a 15-person group for a bachelor/bachelorette party and the hostesses, waiters, and servers were all VERY nice and accommodating and actually seemed genuinely excited to have our group there. Even when we got a little bit rowdy and loud, nobody blinked an eye or said a thing and they were overly helpful in getting our orders, separate checks, and drinks taken care of easily and quickly. \n\nI wouldn't go here if I was in the mood for the best, most authentic Mexican food, but given the convenience of it, their great service, and the fact that the food was tasty enough and decently priced, I'd definitely go back."
        }, 
        {
            "index": 124, 
            "rating": 3, 
            "review": "Good place to stop for a beer and grab a bite to eat. On a side street in New York New York. Outside setting was great. Waiters were on it, order taken and food recived. \nFood was decent and the beer was cold. Plenty of  people watching time, the staff didn't push you along after your meal. \nLast word... Relaxing."
        }, 
        {
            "index": 125, 
            "rating": 4, 
            "review": "Surprise! i loved this place. Great chips, good drinks, music, dancing, the works. The food was great. the staff superb. Wish I found it earlier."
        }, 
        {
            "index": 126, 
            "rating": 3, 
            "review": "Very bland food. Not one thing came to my table spicy enough. Drinks were ok, Pablo kept my cup full. Environment was Alrite. Overall I give this place a D."
        }, 
        {
            "index": 127, 
            "rating": 5, 
            "review": "We try to eat here every time we are in Vegas - its that good!  I've been happy with all my meals here, the latest being a gaucho steak salad, which is a whole bunch of steak strips served on half a head of lettuce with onions and a fabulous dressing, as well as an interesting vegetable that looked like a cross between asparagus and broccoli.  It was all very tasty.  My dh had the chef make a shrimp diablo fajita that he really enjoyed.  Prices are good, service is great, food excellent!"
        }, 
        {
            "index": 128, 
            "rating": 3, 
            "review": "On a Friday night, there was only one host working. It's Friday night in Vegas in the summer, it's probably going to be a bit on the busy side. At least one more host would have been better service so you have one to greet and one to seat.  After being seated, it took a while to get greeted. Eventually our server greeted us and took our drink order. Since we had been sitting a while, we knew what we wanted to eat but he did not give us a chance to order all at once. I hate when that happens.  It's busy, I get that but at least look at me while you are taking my order. \n\nThe food was good. I had a tamale and enchilada combination.  The portions were good except I would like to have had a slightly larger portion of rice.  \n\nThe lower rating is in response to the lack luster service not the food. I would return for the food."
        }, 
        {
            "index": 129, 
            "rating": 5, 
            "review": "Heebus Jeebus this is our new favorite \"mexican\" restaurant in Vegas.\n\nThree words: BEST. SALSA. EVER. Wait, is that drool on my space bar as I nostalgically reminisce about the most fantastic, mind blowing restaurant salsa I've had IN MY LIFE? Hold on as I grab some more tissue. *slobber slobber*\n\nWe flagged the waiter down and I attempted to charm the kadoozie out of him to get the secret recipe, but all we pulled out was that it was \"made fresh daily\", \"the tomatoes are roasted on a hickory grill\" and \"vegetarians always get mad 'cuz they say there's meat flavor in the salsa when in fact it's just the smoke from the grill which gives it that sweet smoky taste\". Stupid vegetarians. Every day I try to consume twice as much meat as recommended by my doctor just to cancel out one vegetable-eating moron. \n\nI got the enchiladas and hubby got a burrito. We got massive food coma immediately after and swore that the next night we'd down massive amounts of red bull to make up for pitifully calling it quits at 11pm. Vegas Fail!\n\nCame back again for a farewell lunch a few days later. The tortilla soup I ordered was nothing to write home about but jiminy crickets the hubby's chile relleno knocked my socks off. Buahaha, that's what she said.\n\nAlso, GREAT service. Definitely returning."
        }, 
        {
            "index": 130, 
            "rating": 3, 
            "review": "Bartender was very nice and also engaging. I like the fact that you can walk by and just order a drink on your way by in the NY NY casino. Nice looking eatery among many other delicious looking options. Vegas really is a food mecca.\nI will say though, even with my $12 top shelf Patron tequila choice (Silver tequila option was $9), I had the weakest margarita of my life here. It came in a large cup with lots of ice, salted rim. Refreshing but not boozy whatsoever to justify the price. I would be shocked if it had a full ounce in it.\nHubby had a beer and stated that the temperature of that was perfect.\nWill come back for sure to try the special on the daily board - King Crab Leg tacos!"
        }, 
        {
            "index": 131, 
            "rating": 4, 
            "review": "This was a truly great meal. It was hands down the best  cheese enchiladas I have ever had. The sauce was sublime and just a little smoky. My hubby had something with pork, which he is now forgetting but thinks might have been carnitas? Anyway, he said it was really, really good - the best meal he had in Vegas to be sure. They also have a separate vegetarian menu - nice!\n\n I do have a couple of gripes - the chips and salsa are not free and they will not mention this to you if you ask for some. I saw them come out to another table so I asked because I thought they forgot. Gripe number two, the prices are pretty high. With that said, it was still really good food."
        }, 
        {
            "index": 132, 
            "rating": 2, 
            "review": "The food was great I had a chimichunga and ordered the carnitas! the chimichunga was the only thing that was served warm and  The service was bad...unfortunately, the steak nachos were cold and one of my guests was charged 3.00$ for sour cream and she ordered nachos! E yi yiiii ...newy the food was medium n service is rude... only eat here if u really want some Mexican food and really starving..our waitress was unprofessional and rude.Honestly the best thing was the chips and salsa...thats what the two stars are for OmG! yikes....."
        }, 
        {
            "index": 133, 
            "rating": 5, 
            "review": "Amazing place to eat ! The food and atmosphere is the best! Chicken enchiladas, fresh guacamole, steak tacos and very berry drink are the best. Our waiter was full of energy, definitely made it better! Thanks Marcos. \nMost deff will be back next time we're in Vegas"
        }, 
        {
            "index": 134, 
            "rating": 4, 
            "review": "My husband and I ate here for lunch.  I ordered the avocado shrimp tacos and he had the carne asada tacos.  The tacos were excellent but the rice and beans I could do without.  I had a mango margarita which was delicious and he had a regular margarita on the rocks (they were 2 for $10 for happy hour). Our waiter was very nice and helpful.  I would recommend this place to eat but don't get your hopes high on beans and rice."
        }, 
        {
            "index": 135, 
            "rating": 5, 
            "review": "This food was outstanding. I ordered a sampler which included tomales and empanadas. These were the best empanadas I have ever had. They were delicious. \n\nThe atmosphere was similar to any Mexican restaurant. \n\nThe food was reasonably priced. We spent around 40 dollars which bought us a lot of a really good food. The serving staff also did a wonderful job of keeping drinks filled and dirty dishes clear. \n\nYou can't go wrong eating here."
        }, 
        {
            "index": 136, 
            "rating": 3, 
            "review": "This place is inside the New York New York hotel, friends in town for a visit picked it or I don't think I would have ended up there as I have my favorite Mexican places here in town without fighting the Strip traffic....nonetheless here goes. \n\nThe service was great, it was a Saturday night but Jose was right on top of everything. \n\nThey specialize in half yard margaritas, I had a regular size  one...Blue Beach Bliss margarita was very tasty. No complaints. \n\nThey charge $3 for chips and salsa, call me naive but I have never been charged for that before. \n\nI had the chicken chimichanga, it was good I didn't find it fantastic. Just good.  Rice and beans were good, slightly bland. \n\nAtmosphere was ok, the roller coaster noise was noticeble but not a big deal. \n\nAll in all the service was the shining star of this dinner."
        }, 
        {
            "index": 137, 
            "rating": 3, 
            "review": "Not the greatest Mexican food I've ever had, but certainly not the worst.  The waiter wasn't that great, but he did ensure fast service.  I ordered the chicken tortilla soup, the cheapest thing on the menu, and quite tasty as well.  The soup had generous portions of chicken (this is nice because restaurants skip out on meat portions quite often).  Instead of traditional red salsa, they give you salsa verde and another dip that tastes similar to guacamole, but in a salsa form.  Good food for a good price, but there's nothing special about this place."
        }, 
        {
            "index": 138, 
            "rating": 4, 
            "review": "Loved the Happy Hour!  Their bartender Frank is super friendly and made us feel very comfortable.  Taquito appetizers were fresh and very delicious.  We came back every day of our stay."
        }, 
        {
            "index": 139, 
            "rating": 3, 
            "review": "2 stars for food and 1 star for service. I was honestly really disappointed because the last time I came everything was perfect. The first thing I want to complain about is our waiter, Hector. \nHector, he didn't listen when I said NO CHIPS AND SALSA. Told him twice but he brought & charged any ways. Saying its \"only a one time charge.\" I didn't want it because the queso fundido we ordered already comes with chips and 3 chile salsa on top. He never actually came to check up on us. He would stand by the bar and watch. Never actually came up and said \"are you doing okay?\" It was only towards the end when he was going to get his tip when he seemed like he actually cared. However, Juan was really nice & friendly & asked if we were okay and had a nice conversation with my family. The food was ok. I'm really sad they got rid of the sopes. My brother didn't like the carne Asada tacos because he said the tortilla was soggy. Also got the meat in my dads enchiladas wrong. I hope they improve next time because the food & service is usually great."
        }, 
        {
            "index": 140, 
            "rating": 4, 
            "review": "Must visit!!!\nSteak tacos, fresh guac, awesome drinks and dancing at night! Not into getting out at night? They have HAPPY HOUR too. Hurry up and come here. This spot is awesome and located in NYNY next to Vegas strip exit and Tom Urban. \n\nI came here on my second day in Vegas and was still trying to figure everything out. The staff is amazing 5 stars. Got the deets on Vegas strip and cool spots around NYNY.\n\nFood:\n- Steak tacos. The meat was juicy, tender and seasoned well. Almost melted in my mouth. ~$11\n- Guac. It was nice, fresh and chunky. Served in a traditional bowl and had a jalapeño kick to it. ~$8\n\nDrinks: \nWashed all this awesome Mexican food down with 2 ice cold beers. Forgot cost.\n\nIn total with tip I probably dropped $33-$36 bucks. All well WORTH it. Hand downs this was one of the best meals I had in Vegas. Also at night the Spanish music comes on and it's like Latin Quarters Lounge in here.\n\nStop in, have some food, have a drink, enjoy HH or come late at night and dance the night away. If I return to Vegas, Gonzalez and Gonzalez is in my top 10 of things to do! Enjoy folks."
        }, 
        {
            "index": 141, 
            "rating": 4, 
            "review": "Before a night of heavy drinking, packing my belly full of Mexican food always seems like a good plan.  I like this place because in the land of pricey dining, it is pretty inexpensive.  They have great salsa, and really good food.  Not the best enchilada taco combination ever, but right up there...and they aren't shy with serving sizes.  I would be happy to eat there again."
        }, 
        {
            "index": 142, 
            "rating": 5, 
            "review": "this place is GREAT!\nCame on a Friday night on my last trip to Vegas and I loved it! We had a late dinner at midnight and the service was great, friendly and attentive.\nI had the carnitas plate, which was very delicious.  After dinner we went to the club they had inside. Not only was there no cover for everyone all night(!), They were also playing latin music. Cumbias, merengue, etc. Just how I like my clubs! \nI didn't drink much that night (I know, it's Vegas, I was lame...) but I'm sure the drinks are just as good.  Will DEFINITELY come back for dinner and dancing next time!"
        }, 
        {
            "index": 143, 
            "rating": 3, 
            "review": "Being from Texas, I automatically give Mexican food places a little leeway once I leave the state. The positives were that the chips and salsa were really good as were the rice and beans. My husband said his fish tacos were great, but I cannot attest since he did not let me try them. The margarita I had (a house rocks with salt) was decent, but had a slightly off flavor that I could not identify. I guess it could not have been too bad since I ordered another one. I ordered the shrimp tacos which by themselves would have been two stars. The sauce they had on them was just weird, and the shrimp was overdone. \nBut, the service was great - really friendly and attentive, but I didn't feel rushed."
        }, 
        {
            "index": 144, 
            "rating": 3, 
            "review": "This is a decent very casual lunch spot.  The chips and salsa are solid.  We opted to add queso for more flavor.  The queso has good flavor.\n\nWe split an order of steak nachos.  They are prepared differently than most nachos.  There are four large chips with toppings stacked high on them.  The chips have quite a bit of steak on them.  They have ok flavor.  Not bad, but not a lot either.\n\nThey have an assortment of your standard drinks found at most Mexican joints.  The prices are inline with other casual casino options."
        }, 
        {
            "index": 145, 
            "rating": 3, 
            "review": "Pretty much like Chevys or El Torito but in New York, New York.\n\nI didn't like their sangria it tasted just like pure juice. The chips and salsa was pretty good...but how can you mess that up? Chicken tacos were okay, rice was fine as well. Overall, the service was okay. Weird when everyone's plates were steaming hot except one of ours in our group. Honestly, I didn't choose this restaurant for dinner but I wouldn't go back again. Would rather eat in Earl's of Sandwich or Wicked Spoon."
        }, 
        {
            "index": 146, 
            "rating": 1, 
            "review": "I've had a lot of Mexican food, this tasted like pre made frozen microwaved food, not impressed"
        }, 
        {
            "index": 147, 
            "rating": 4, 
            "review": "Nice place, really good food and the sangria ugh.... the best!!!!!!!! The queso fundido in the beginning was a nice touch, really like everything but I expect more!"
        }, 
        {
            "index": 148, 
            "rating": 2, 
            "review": "This 2 star rating is ONLY for the food. The service was way below a 0. \nFor starters, 4 of us sat down here on a Sunday afternoon around 1pm. We were probably 1 of 5 tables filled. \n\nThe waitress came over and brought us our salsa and chips (which was delicious and the salsa was quite smoky too). She proceeded to take my friends order, which was just tacos, and she couldn't get that right. So three of us ordered the same thing just to make it easy. (I'm not kidding). We specifically mentioned that we wanted soft tacos. So... our meals come out and go figure, they're all crunchy tacos. The restaurant doesn't even serve soft tacos, but you think she would have mentioned that! \n\nAfter we ate and she refilled our chips, we never saw her again, so we had to go to the bar and pay for our tab. The whole thing was a joke!"
        }, 
        {
            "index": 149, 
            "rating": 1, 
            "review": "Would have put zero stars but it won't let me! I have been here so many times but now I'll never come back. We come for the club in Saturday nights and I loved to come here because there is no dress code but then we came with 10 heads and all of a sudden they change the dress code, without even posting something in their web site and we couldn't get in because one of the guys in our party was wearing Jordan's! We took a $40 can ride just to get here and we come here all the time and they are telling us no even after we told them we were planning in getting a few bottles! Plus they were so rude about it! I'll never come back after this and am so disappointed!!"
        }, 
        {
            "index": 150, 
            "rating": 4, 
            "review": "While staying in this hotel, we tried many of the restaurants here.  I love mexican food so I was very excited to eat here.  Reme was our server, he was very friendly and personable, the salsa and chips good, I like a bit more spicey-ness so I added habanero for a kick, and it made the salsa perfect! I ordered a taco with ground beef and when they brought me one with steak in it, they were very willing to bring back what I ordered made the right way, and they were very quick about it. Very reasonably priced for the strip, and I would come here again."
        }, 
        {
            "index": 151, 
            "rating": 4, 
            "review": "On our way out of Vegas we were both getting kinda hungry, so why not stop and eat Mexican food? Each time i think about trying to eat Mexican food outside of San Diego i kinda question it. No doubt SD has the best Mexican food on EARTH! Then again this is Vegas so i wasn't too surprised when they got it right. \nWe walked right up and were seated right away. The place was a little packed, the Packers vs. Bears! a nice positive vibe in the place for sure. \nIt took a while for us to get our waters and to even be approached by our server but after that i think the service got a good grade. I've had better, but then again the place was busy so I'm fair! =) \nFor starters they offered up some fresh chips and Salsa, not bad. The chips were warm not the best I've had but not the worst. Huge plus was that they were free! a fine example of what EVERY Mexican food spot should do! I ordered up the chimichanga and taquitos. The chimichanga was kinda bare on the outside, Vegas and all Mexican shops this is where you fail when it comes to SD. The chicken on the inside though, FREAKING GOOD!! The taquitos were pretty dang good as well. The gf ordered the Chicken Tortilla soup and she said it was good as well. \nThe place is just a touch on the pricey side, but being in a major hotel and on the strip you cant really expect not to pay too much."
        }, 
        {
            "index": 152, 
            "rating": 4, 
            "review": "I like this place.  Think of Gonzalez Y Gonzalez as like an upscale Chevy's, but with better service and higher quality food.  My friend brought me here and I didn't know what to expect.  What I didn't want to order was something traditional like a burrito or enchiladas, I get plenty of that at home.  I ordered the Blue Corn Chicken ($15.95 - maize fed chicken pan seared with cilantro lime potatoes, grilled broccolini, and salsa cruda).  It took me by surprise because it was presented very gourmet like and it was so good!  Finished off the dinner with a Oaxacan Chocolate Cake, not sure if it's still on that menu, but that was really good too.  If you're in NYNY and want something affordable with good portions, give Gonzalez Y Gonzalez a shot!"
        }, 
        {
            "index": 153, 
            "rating": 4, 
            "review": "Possibly some of the best enchiladas I've ever had. Too bad Cirque has a strict no food / no drink policy. Damnit.. The sauce was just rich with flavor and the food was hot and fresh. We just don't normally get that kind of Mexican food where I grew up. Oh well. Looks like we have to stop in again."
        }, 
        {
            "index": 154, 
            "rating": 4, 
            "review": "I really enjoyed Gonzalez Y Gonzalez!  We stayed at New York New York and when you sign up to be a part of the Player's Club, they give you a 10% off coupon to visit one of the restaurants in the hotel and we tried this one.  I was happy with our choice!\n\nLike everyone is saying, yes the salsa is very good!!!!  We probably had like 2 backets of chips and they gave us our own salsa!  If you know me at all, you know I hate sharing salsas because chips and salsa is my favorite food! :) \n\nI probably could've left right after my complimentary chips and salsa, but that might have been a little mean.  I wonder if anyone has ever done that...haha.\n\nAnyway, I ordered the shrimp tacos and loved it!!!  I was glad someone had posted a picture of the food because it sold me. :) I would recommend this restaurant if you are in the area.  Very good stuff!"
        }, 
        {
            "index": 155, 
            "rating": 5, 
            "review": "Mary, Deme, Saba and all the staff are awesome!!!  Fresh guacamole made at the table, carnitas and fish were perfect!!!!  Just can not say enough about this place!!!  The service and food was excellent.  It's nice to find a place that really cares about the its food, customer service and a great working atmosphere!  You can tell everyone working here is like family!  We'll be back for sure!!!!  Thanks everyone for a great time!!!!!  Mark & Terry"
        }, 
        {
            "index": 156, 
            "rating": 1, 
            "review": "I was really excited to eat at a restaurant that was open past 11 pm but was instantly disappointed when it took the waitress 15 min to come to our table.\nThe food was also disappointing - too much sauce on the clinic chimichanga and the chips tasted a little stale."
        }, 
        {
            "index": 157, 
            "rating": 5, 
            "review": "Friendly people. Fairly priced. Nice atmosphere. Good food. The salsa could be more authentic. Ask for the tomatillo based salsa it has a little more flare to it. They also have a hotter salsa but the flavor was terrible. All and all I thought this was a nice place to eat for a small amount of money."
        }, 
        {
            "index": 158, 
            "rating": 4, 
            "review": "Great food, whatever u desire out of a mexican resturaunt."
        }, 
        {
            "index": 159, 
            "rating": 5, 
            "review": "We were lucky to stumble to this place after a fail attempt to eat at Tom's Urban next door (a review will be done on that place soon). This place actually honored their happy hour and willing to move seats and change the channel for us to watch some of the ncaa basketball games.\n\nThe food was pretty good as we ordered almost everything from the happy hour menu. Our waitress refilled our drinks without us asking and also made sure we got the right drinks.\n\nThe service alone is enough for us to go back there again"
        }, 
        {
            "index": 160, 
            "rating": 3, 
            "review": "Had the chicken zinga enchiladas and chicken tomales. solid but not necessarily stand out. Cilantro rice was good. So we're black beans. Above average mex on the strip"
        }, 
        {
            "index": 161, 
            "rating": 3, 
            "review": "its July 4th Monday. I understand things are a bit slow, but really, this was taking unprofessionalism to a new extreme. Me an my boyfriend and other people are lined up to get seated at the restaurant. The hostess seemed to be plainly ignoring us while she was taking her sweet time gossiping with a waitress. I think the whole line of people were glaring at her while she was gossiping instead of seating us.\n\nAfter a long while, she seats the first party. at least 5 minutes later she seats me and my boyfriend. Seriously?! how long does it take to seat a party of 2?\n\nService inside was not much better. We ordered food and got our free chips and salsa (saving grace). One of our friends decided to join us. The server is NO where to be found. Finally find him and flag him down to put in our friends order. Later, 2 more of our friends join us and same problem. \n\nI've never been in the restaurant business, but logically I would think big party = great bill = potentially more tip? Guess it didn't matter to him that we normally tip 25%. I was upset at the wait and having to literally find him ourselves most of the time. I told my bf to dock the tip. \n\nFood was alright. Standard stuff. Like the free chips and salsa."
        }, 
        {
            "index": 162, 
            "rating": 3, 
            "review": "Five stars for the amazing tableside guacamole. Five stars for our server Damon, who was super-friendly. He knew what we meant when we said \"We're vegan\" and made several trips back to the kitchen to check on ingredients for us. Two stars for the lack of vegan options in pretty-vegan-friendly Las Vegas.  We were able to eat the guac and chips, and then we had to cobble together tacos that ended up being pinto beans, slices of avocado, lettuce, and tomato.  Rice?  Made with chicken stock.  Black beans? Made with chicken stock. Refried beans? Made with lard.  A cute place, and it's worth making the trip for the tableside guacamole if you're in or near New York New York."
        }, 
        {
            "index": 163, 
            "rating": 5, 
            "review": "Last night before going to see the show zumanity at the new york new york my fiance and I decided on a place to eat we chose out of all the eateries at the new york new york we chose gonzalez y gonzalez..the staff was great from the beginning our waitress mimi was absolutely the best we ordered guacamole which was prepared at our table magnificent  and the food was outstanding my honey had the fish tacos I had the sizzling fajitas delicious thanks to mimi recommendation  I'm so looking forward to going back I would recommend this restaurant to everyone I can't wait to return please try this restaurant soon"
        }, 
        {
            "index": 164, 
            "rating": 2, 
            "review": "Gonzalez Y Gonzalez does not offer authentic Mexican food by any stretch of the imagination: the tacos are served on hard shells, they do not stock lime juice for margaritas, and the flour tortillas that came with my fajitas were chewy. \n\nThe salsa was tasty enough, chunky and underwritten by a smoky chipotle flavor, but the chips were too thick for my taste. I ordered the vegetable fajitas, and the mixed vegetables were a mixture of excellent and undercooked. The standard cherry tomatoes, onions, peppers, mushrooms, and zucchini were superbly cooked, but the dish also contained some hard, chewy greens that offset that pleasantness. The flour tortillas on the side were not edible.. I believe they did not steam them, so they were sort of... tough. And thick. \n\nAs for the sides, you get your standard rice and beans. I opted for the cilantro rice and refried beans (topped with cheddar cheese, do not expect cojita) which were fine enough. \n\nThe service was friendly, and the food arrived promptly. \n\nThe bottom line: If you're in a pinch, it's better than opting for the food court and probably wont cost you much more. Go elsewhere if you're looking to eat well, because this place seems to be fairly hit-or-miss in terms of quality."
        }, 
        {
            "index": 165, 
            "rating": 2, 
            "review": "The girl who sat us wasn't too friendly she tried to sit us on the patio area without even asking, the Steeler game was on which is the only reason we picked this place (TV's, and Margaritas) and she acted like it was a sin to sit us in eye shot of a television smh...the hostess is the first contact a patron has if she's rude that kinda sux \n\nThe food was okay for hotel mexican food \nSampler platter, nachos (eeeh), chimi's (good), guac (yum), wings (blah), ceviche (worst I've ever had, sweet, kinda tasted like they put Italian dressing on it, very curious dish)\nAmericanized beef taco, rice n beans were cool, el pollo loco's seasonal tamales are better, beef and cheese enchiladas were okay. The chips n salsa, iced tea, and Cadillac margaritas were all very good, the bar service for our drinks was kinda slow ... but our server CHRIS was awesome all the way just super attentive sweet and patient... he went above and beyond for our party. Also i'd like to note we wen't against our servers suggestion of the fajitas or the tacos el carbon and went with something else so thats our fault (always listen to the server)\n\nThis place was okay i probably wouldn't come back there are so many good places in New York New York hotel let alone Vegas but i don't regret trying Gonzalez Y Gonzalez either"
        }, 
        {
            "index": 166, 
            "rating": 1, 
            "review": "Holy Mother Of God, I just got a case of food poisoning from this place that was so bad I was surprised I didn't retch up my shoes. \n\nI ate carnitas here at two o'clock. By five o'clock I was flat on my back. And by nine o' clock I was driving the porcelain bus. I became Mr. Creosote from \"The Meaning Of Life,\" unleashing like a firehose until six hours later, at three in the morning when I passed out into a fitful semi-stupor. Eating here basically ruined the last day and a half of our vacation. \n\nSo, to sum up... \n\nI DO NOT recommend eating here. \n\nI DO recommend a kitchen fire and salting the earth where it once stood."
        }, 
        {
            "index": 167, 
            "rating": 4, 
            "review": "Awesome experience from the mango and regular margaritas, the chips and salsa, table side made guac and crispy tacos! I had the 3 taco lunch special, 2 chicken and 1 shredded beef. The chicken was really tasty but after trying the shredded beef I was so mad that I didn't get all three beef! LOL. Yes, the rice is not the best I've ever had but I quickly looked past that in comparison to the rest of my lunch. The guac was super fresh and perfectly made as was the salsa. My travel companion had the chicken enchiladas and loved them as well. I felt since we were in Vegas, we had to try other places to eat but honestly, I would have been fine eating there every day! Will surely come back and eat there next time I'm in Vegas."
        }, 
        {
            "index": 168, 
            "rating": 4, 
            "review": "I have been eating here for the past 8-10 years each time I visit Vegas.  This place is always excellent.  I highly recommend this for anyone who enjoys good \"Tex-Mex\" food.  The service is always good, the prices are reasonable for Vegas standards and the quality of food has always been exceptional.  NYNY is the place to be if you ever want some good down home Tex-Mex food and a cold margarita or cerveza.  p.s. I will always rate that any place in Vegas is not good for kids...........(the little survey thingy at the bottom of the review).  I am on a mission to make Vegas kid free!\n\nThank you Gonzalez y Gonzalez for providing me with excellent fajitas and ice cold Beer!"
        }, 
        {
            "index": 169, 
            "rating": 4, 
            "review": "Good food better service.  Had a rib eye came with rice and beans. Steak was good for the price. Good atmosphere and the service was great."
        }, 
        {
            "index": 170, 
            "rating": 4, 
            "review": "I've died and gone to Mexico.  Best bang for the buck.  Come with an appetite because the food is filling.  Had steak and shrimp fajitas.  Fabulous!   Get the guacamole for the chips.  Made right in front of you."
        }, 
        {
            "index": 171, 
            "rating": 2, 
            "review": "My husband and I came in here during a recent trip to Vegas. We had:\n\n* Chips and Salsa (two salsas - one red and smoky, the other spicy and green).\n* The \"Salsa\" Trio - guacamole, queso, and sour cream. Oddly enough, no salsa?\n* Chicken Tortilla Soup.\n* Oven-Roasted Broccoflower Soup with Green Chile Puree and Sweet Corn Dumpling.\n* Chili-Lime Chicken Fajitas.\n* Combo - chili rellenos, chicken tamale, barbacoa burrito.\n\nWe really weren't impressed with the food here at all. It started out good though. We both enjoyed the salsas that were brought to the table. The broccoflower soup was a little watery but had great flavor. Everything else was terrible. The chicken tortilla soup was bland. The entrees took far too long and were definitely not worth the wait. The chile lime chicken fajitas tasted like store brought chicken strips. They were pretty much flavorless, with no tasteable chile or lime anywhere. The sauteed peppers were the best thing on the plate. The combo plate was buried in sour cream. It looked bad and tasted bad. The tamale was dry and flavorless, the chili rellenos were soggy and the barbacoa was dry. \n\nNot to mention that there was some emergency light flashing over our head for half the meal, and the constant slot machine sounds. If I ever return to Vegas, I won't be making a stop in here."
        }, 
        {
            "index": 172, 
            "rating": 1, 
            "review": "Horrible, horrible food! Stay AWAY! \n\nMy boyfriend and I were in the mood for Mexican and saw this place. Bad choice. I ordered the carne asada tacos while my boyfriend ordered the chicken tikka enchiladas. They sure didn't look like the pictures plastered all over the restaurant or menus. (Though really who's food ever does?). When we got our food, it tasted like our dishes were sitting for a while even though there were not many customers. My taco shells were so soggy that I had a hard eating them. The texture was mushy at that point that I just ate the meat out of them. The meat had good flavor but was too dry. \n\nThe server was really nice, but overall I can't recommend coming here."
        }, 
        {
            "index": 173, 
            "rating": 4, 
            "review": "Great food, great service.  Service was really fast.  Chips and salsa brought to the table right away.  Salsa was very good.  I had enchiladas and my husband had fish tacos.  Both were very tasty.  Our waiter was very nice."
        }, 
        {
            "index": 174, 
            "rating": 3, 
            "review": "The menu looked great with many options. Hubby ordered chips and salsa. The salsa set my mouth on FIRE. Hubby was fine but I drank half a glass of water after one soaked chip. \nHubby had chicken fajitas which were yum. I ordered a crab and shrimp enchilada which was a special for the night. \nMy meal not so great. A soft tortilla covered with vegs spicy sauce and three shrimp and very little crab. Moral, terrible entree. The guac on the side of my plate was great so I used that to dip my chips."
        }, 
        {
            "index": 175, 
            "rating": 5, 
            "review": "GYG satisfied my mexican craving and then some while in Vegas.  I have been planning to visit while on the East Coast and never got around to it. Happy Hour in Vegas presented the perfect opportunity. \n\nLocated in New York New York ofcourse is GYG. This restaurant features a street side bar equipped with all your tequila fantasies. 1800, Avion...Patron (all my bffs). They advertised the Buy 1Get1Free deal Margaritas 2 for $9. My friend and I were famished and we're craving nachos. The Happy Hour menu featured $6 appetizers including tostadas, tacquitos, nachos. We paired beef nachos with the overly addicting Honey Chipotle Wings. \n\nThe fresh flavor here is definitely unmatched anywhere else. For simple appetizers these dishes were magically delicious.  The nachos featured fresh cilantro,  tomatos, Seasoned beef and were perfect. The WINGS!!!!! Crisp, succulent, spiiiiiicy,  honey dripping glazed TO PERFECTION.  My Margarita paired well with my menu items and left me light as a feather.   \n\nThe service here was professional and speedy. I love this location.  GYG represents NY so well. Perfectly placed in the Village of the hotel replica of NYC. Easily my favorite Hotel on the strip.  I later learned GYG turns into a little lounge after hours."
        }, 
        {
            "index": 176, 
            "rating": 3, 
            "review": "Nothing amazing but pretty good Mexican food that is sort of like any of the large Mexican chains. The tacos were fresh, HOT, and had a good flavor. The rice and black beans were also pretty good. They used to offer free chips and salsa like most Mexican restaurants but now charge $2.99 for them.\n\nThis place isn't a must try in Vegas but if you're on the strip and want Mexican food you won't go wrong here."
        }, 
        {
            "index": 177, 
            "rating": 3, 
            "review": "It's basically like Mexican fast food...but it tastes OK.\n\nI had the chicken tamales and didn't like it (smelled more like tuna than steamed chicken), but the chips and salsa (I ordered a $5 guacamole side) were amazing! The other order on my table was the chicken fajita burrito and that was better than the tamales..(he ate it all, so I assume it was good)...\n\nAll in all, an OK experience..."
        }, 
        {
            "index": 178, 
            "rating": 5, 
            "review": "Very good atmosphere and friendly and attentive waiters. My husband has the halibut special and he said it was perfect. I had fajitas and it was large portions and well seasoned. We also ordered the table side guacamole and that really added to the meal. Good prices especially for the Strip."
        }, 
        {
            "index": 179, 
            "rating": 5, 
            "review": "Raymond was absolutely amazing! He took care of our entire family and everything we ordered was perfect!"
        }, 
        {
            "index": 180, 
            "rating": 5, 
            "review": "Stopped by yesterday wanting some great mexican food and the food was great. Our waiter JOE was GREAT!! Very nice and on top of things. We ordered the asada tacos they were delicious and the shrimp and chicken enchiladas. Didnt have to wait long for our food either. Great customer service. Give that man a raise!! G Y G"
        }, 
        {
            "index": 181, 
            "rating": 3, 
            "review": "Decent place nothing special. \n\nThe service here was good and the food was just mediocre. We all got s variety of different things and a few of the items just were kind of bland like my moms steak salad? (Don't know if that's what it was called) the chicken enchiladas that I had were ehhh ok. I was hungover and hungry so I ate them lol."
        }, 
        {
            "index": 182, 
            "rating": 4, 
            "review": "Our server was great and explained the Mlife points to us, because clearly we were new. The food was also pretty good. The rice was delicious. Beers were a little expensive and chips and salsa is not free."
        }, 
        {
            "index": 183, 
            "rating": 4, 
            "review": "I ate there with 6 others and we ordered two baskets of chips and salsa. To have to pay for chips and salsa at a Mexican restaurant was strange but it was only 3 dollars and this is Vegas after all. The server however was quick to bring us more chips free of charge which was awesome. The salsa was great with a good spice to it. I ordered the Ancho Chili Halibut which had great flavor to it. Sided with a slightly too bland for my taste cilantro lime rice and black beans which were delicious if a bit runny. The halibut was slightly over cooked but only just and was so good the toughness is almost not even worth mentioning. I was not expecting much from this place but I was very pleasantly surprised and would be more than happy to come back."
        }, 
        {
            "index": 184, 
            "rating": 4, 
            "review": "The customer service was awesome. They accommodated our request to change channels on their TV's. Happy hour was decent for the price. Drinks were good for the happy hour price. Server was very attentive and fulfilled every request with a smile."
        }, 
        {
            "index": 185, 
            "rating": 2, 
            "review": "The food was good for the price.  The service was not good at all.  The server, an older gentleman,  was more occupied with the football game instead of taking care of us.  Probably won't be back again."
        }, 
        {
            "index": 186, 
            "rating": 2, 
            "review": "Like all the other reviews are saying, the chips and salsa were excellent.  Top that off with my mango daquiri and it could have been a great meal.  Note, could have been...\n\nI ordered the steak tacos but little did I know that they were actually ground beef tacos.  Okay, I shamelessly love Taco Bell so it's unfair that I would rather have a Taco Bell taco but I think others would agree if they tried it.  It was so bland and blaah.  Pass.\n\nThere's also some major construction going on in NY NY right now that made it hard to even hear our conversations.  I guess it just made me think we really were in NYC."
        }, 
        {
            "index": 187, 
            "rating": 4, 
            "review": "Went here before a cirque show. Prices and food were good. Best part of our experience was the amazing service."
        }, 
        {
            "index": 188, 
            "rating": 3, 
            "review": "一品のボリュームがすごいので、頼みすぎないように注意が必要です。\nビールと共に。"
        }, 
        {
            "index": 189, 
            "rating": 4, 
            "review": "I always try to go to Gonzalez y Gonzalez when I am in town because they have the best chips and salsa!  Our party of 4 got great service and the food was really good, too.  Get their guacamole--it's made table side, and you will not be disappointed."
        }, 
        {
            "index": 190, 
            "rating": 2, 
            "review": "Bleh...seriously that's all I want to say but I won't.\n\nFood was terrible. Ordered chicken tacos and the chicken tasted FUNNNKKKYY... I don't know what was up with that. Drinks were pretty yummy and I thought this could be dangerous! :)\n\nCame here late Saturday night and they turn the inside into a club (maybe 3 people were in there) and it's all Latin Music BLARING!! Super annoying and the DJ sucked. If they turned it down a little bit, we would be able to talk to each other and I honestly wouldn't have minded the music that much. It doesn't need to be that loud unless your in an actual club.  Probably won't be back."
        }, 
        {
            "index": 191, 
            "rating": 1, 
            "review": "This has to be one of the worst Mexican restaurants I've been to. First off, who pays for chips and salsa? For the quality of the food the whole menu is horribly overpriced. It literally took less than 5 minutes for the food to come out. We had just got our chips and dip and the food came out right after. I ordered their burrito and it was disgusting. The flour tortilla was hard, the food was cold, and their idea of ground beef is this nasty brown gunk mashed together that doesn't even look like meat. The queso taste  nothing like cheese. It had this weird taste. We orders margaritas that didn't seem to have any liquor in them. Tastes like straight sweet and sour. The did remake my burrito, which tasted way better than before but still had that horribly goop they called ground beef. I would never recommend this place."
        }, 
        {
            "index": 192, 
            "rating": 2, 
            "review": "Blech!  Don't waste your slots money here!  Very mediocre and pricey (just like Vegas! Ha!).  I ordered the patron margarita and it was undrinkable - tasted like salty dishwater.  It sat on the table all night and the server didn't even ask about it, and seemed surprised when I asked him to take it off the bill.  I had drank so little of it, he had to be careful when he carried it to his manager to \"show him so he had proof I didn't drink it\"  My meal - chili relleno and tamale with rice and beans - was seasonless.  I kept salting it, but it never got better.  The tableside guacamole was pretty good, but the guy who made it was obviously having a bad day - no eye contact, no smile, no talking - just made the guacamole and left.  Definitely would not return there, not with so many other choices."
        }, 
        {
            "index": 193, 
            "rating": 3, 
            "review": "Everything here was pretty good. It was a 12 or 1am stop for dinner and they were still packed. The food was surprisingly good, though a little pricey."
        }, 
        {
            "index": 194, 
            "rating": 4, 
            "review": "Great margaritas and great tasting food. I would have liked he shrimp on the shrimp tacos to be larger thou."
        }, 
        {
            "index": 195, 
            "rating": 4, 
            "review": "excelente comida desde la salsa en chips en adelante, la atencion también muy buena especialmente Roberto quien fue up and beyond por atendernos"
        }, 
        {
            "index": 196, 
            "rating": 4, 
            "review": "Went here last night during a fight night. Food was good and hot and our order was correct. Atmosphere was ok. Lots of tvs with different sporting events. But the bartender Justin was awesome!! He really took care of is and made us feel at home and laugh, great guy and awesome bartender!  I don't recommend the sangria, I didn't like it. We will be back to see Justin!"
        }, 
        {
            "index": 197, 
            "rating": 1, 
            "review": "Service was awful!  Our waitress was unable to effectively communicate or respond to questions.  When I ordered a MARGARITA at a Mexican restaurant I was told it wasn't an option.  The bartender explained they were out of a kind of tequila, but he would sub it for any kind of tequila I wanted; when I asked the waitress for this she refused again.  The food was by far the worst I had during my weekend in Vegas. My quesadilla was soggy and greasy.  \n\nThere are so many great places to eat in this area, so skip this one and head to the next."
        }, 
        {
            "index": 198, 
            "rating": 2, 
            "review": "Mediocre food, at most. The fish tacos were pretty lame; almost no flavor, but the rice was quite tasty. Refried beans were nothing new, and the guacamole... come on, even I can make better guacamole! My friend got the enchiladas, which she said were nothing short of mediocre. Mediocrity seems to be the theme at this place, but at least the food came out amazingly fast. The chips were not that tasty,  but the salsa was actually quite good. Price, again, was moderate but considering the quality of food should be considered as expensive garbage as the food here isn't quite worth the price you pay for it.\n\n\nAvoid if possible, it's Las Vegas... there are plenty more places that you should go to instead of here!"
        }, 
        {
            "index": 199, 
            "rating": 5, 
            "review": "One of my favorite spots in Vegas. We always sit in the patio area to people watch and feel like we're in the streets of New York City! I ordered the carne asada tacos which come with beans and rice, I always swap the Mexican rice for the cilantro option. And the steak nachos look like a small portion but they definitely hit the spot! Very hearty. Definitely recommend this spot!"
        }, 
        {
            "index": 200, 
            "rating": 4, 
            "review": "Yes, it's Tex-Mex. No it won't be better than that time you had tacos made by your grandmother who only spoke Spanish on the side of the road in Guadalajara with fish she just grabbed out of the ocean. \n\nWhat it will be is a totally above average casino meal with reasonable (for the Strip) prices, free chips/salsa and great service. I sat at the bar and the bartenders were the nicest guys in the world...not too chatty, not too formal, just straight up friendly. The salsa is nicely spicy, the food portions are big and it all comes out as described. I'm sure if I paid twice as much I could have a better meal elsewhere, but that's hardly Gonzalez/Gonzalez's problem, right?\n\nNote: This is around the corner from the casino floor, so if you're like me and don't like to see slot machines as you eat, this is one of your only options in NYNY."
        }, 
        {
            "index": 201, 
            "rating": 4, 
            "review": "We came here last night right before going to Zumanity! We decided to sit at the bar. Even though we only ordered chips & salsa & some drinks, the guys were very on top of it. They were constantly making sure everything was fine! We were impressed because most places, they seat you, you order, they give you your stuff and that's the last you'll probably see of them. I would have given them 5 stars if I had a meal there !"
        }, 
        {
            "index": 202, 
            "rating": 5, 
            "review": "Yummmy yummmy! my bf and I were tired from scrambling around different hotels for that night so we decided to eat at this little mexican place at NY before our show Zumanity started (which was like 10 steps away). The salsa for the chips was SOOO GOOD (not watery and not too full of random crap) Anyways, He ordered tacos and I ordered the steak salad. We were in Vegas for 5 days and the whole time we kept craving to go back. My steak was so tender and the sauce over the lettuce had such a great taste to it. Everything on the plate was delicious. The onions, the tomatoes, the avocado. BASED on what I was looking for it was perfect. Not fatty with a lot of taste. Not a day goes by, do I not think about Gonzalez y Gonzalez. Mmmm"
        }, 
        {
            "index": 203, 
            "rating": 3, 
            "review": "We decided to try this place because we wanted to see how New York, New York decorated for the holiday season (mildly festive, it turns out; no Rockefeller Center Christmas tree).  It was a little hard to find - it's located on one of the \"side streets\" that branch off the casino floor.  Don't be afraid to ask someone to point you in the right direction.\n\nMost of the food was good, but the salsa was too hot for my taste.  I asked whether they had a milder salsa, and my server looked at me like I had asked whether they had puppies on the menu.  Unfortunately, my enchilada/burrito combination plate was drenched with the salsa, which made the whole meal unpleasant.  Unless your tastes run to pretty hot food, ask them to hold the salsa, and order a side of guacamole for the chips.  (Both the chips and the guac were good, but not great).\n\nThe ambiance was, of course, faux New York side street.  The roller coaster ran overhead; fortunately, they manage to make it a lot less noisy when it runs through the casino than when it runs outside the building.\n\nThe selection of margaritas is excellent, if a bit pricey.  Most of them run $15 and up, which is more than most entrees on the menu.  Since I am not a margarita connoisseur, I ordered the happy hour house margarita for $5, and it was fine.\n\nThe service was quick, but it would have helped if our server spoke better English, or even Spanish.  (I think her first language originated somewhere in East Asia, but it was hard to tell.)  My wife asked a few questions, and it seems that the server's approach to answering was \"Just Say No,\" which might be fine for drugs but was not very helpful if you're trying to make a substitution on the menu.  Who knows; maybe you won't be able to get them to hold the salsa."
        }, 
        {
            "index": 204, 
            "rating": 5, 
            "review": "My husband and I always stay at New York New York. This is our favorite place to eat there by far! The food is amazing! Their appetizers are so good. And the service is the best. The manager Mary is wonderful and I wish all servers at other restaurants were as awesome as Chris. Already looking forward to our next trip just so we can eat there!"
        }, 
        {
            "index": 205, 
            "rating": 4, 
            "review": "I really like the Gonzalez y Gonzalez restaurant in Manhattan, so when I come to Vegas this is an opportunity to enjoy that delicious cuisine.  Not quite as good as New Mexican food, but close."
        }, 
        {
            "index": 206, 
            "rating": 3, 
            "review": "I was with a friend and we were looking for a place to eat that we hadn't been before.  New York New York was our usual stomping ground so we had tried many of the restaurants in the area.  We decided on some Mexican and stopped in at Gonzalez Y Gonzalez.\n\nWe both ended up having the same meal, the beef fajitas, and they tasted, looked, and smelled like any other fajita you have ever had.  We also had some margaritas that were solid but a little light on the alcohol.  The fajitas were okay, but they did not outmatch any other Mexican restaurant in the area.  The service was very good, however.  The prices were not outrageous, with the whole meal costing about $20.  \n\nThis is a pass in my opinion, but if you're craving Mexican then this will do."
        }, 
        {
            "index": 207, 
            "rating": 5, 
            "review": "Was here years ago- big portions and lots of flavor! Great service! This is by far my favorite place to eat at in Vegas!!!"
        }, 
        {
            "index": 208, 
            "rating": 5, 
            "review": "Great food, guacamole made fresh at the table, amazing sangaria. Service was good, atmosphere is nice. \n\nI highly suggest the potato and cheese tacos!!"
        }, 
        {
            "index": 209, 
            "rating": 5, 
            "review": "Amazing food. Like, delectable. Awesome drinks. Fantastic service. Legit ambiance. Feeling this place big time. Eat here ladies and dudes.\n\nPs. Chris, our server, was especially attentive, unquestionably delightful, and a scholar and a gentleman. Request him. Smeriously."
        }, 
        {
            "index": 210, 
            "rating": 5, 
            "review": "Third or fourth time dinning here!  Expectations were high for both food and service and they did not let us down. Party of twelve tonight with a variety of entrees and everyone was happy!  Margaritas were tasty, not too strong, just enough lemon, lime and tequila. Chicken and shrimp fajitas were perfect. And really enjoyed the beans, rice, and pico de gallo.  Thanks again to Edwin, Raymond and supporting service staff. We will definitely be back!"
        }, 
        {
            "index": 211, 
            "rating": 1, 
            "review": "First off I don't typically give negative reviews and I barley know how to start. The wife and I were trying to find good Mexican food in Vegas. Upon reading many positive reviews on yelp we decided to go. Hope they can fix their problems. I ordered the burrito with green chile. Was bland and lack spice. Insides seemed like they had been run through a blender. All of it was way over cooked. Rice was mush, yuck! \nAlso ordered the berry margarita. Wow what a train wreck. Had little if no alcohol. Was more a creamcyicle than a margarita. Big chunks of ice in the bottom. Was also spilled all down the side of the glass.\nNow for the good. The salsa and chips are not to be missed if you go! Salsa had a great smokey favor.\nYou can make your own decision but, I won't be back.\nIf and when you are also disappointed try La Salsa. They have many locations. Price is on par. Also much better food and drinks."
        }, 
        {
            "index": 212, 
            "rating": 2, 
            "review": "Used to be better. Fish tacos were decent. Drinks used to be a lot better. Striking it from the list."
        }, 
        {
            "index": 213, 
            "rating": 4, 
            "review": "It's a tradition for us to stop here to pick up a large margarita for my girl. We take it to go. It's $20 bucks but it's well worth it. Just so you know if you save the large container and return, the refills are $14."
        }, 
        {
            "index": 214, 
            "rating": 3, 
            "review": "This is tucked into the inside of NYNY.  Unlike most Mexican restaurants, chips and salsa are not included.  The service and convenience is the only reason to eat here.  \n\nThe waiter was attentive and our food came out quickly.  Flavor was weak, if you're accustomed to eating real Mexican food, like I am in Los Angeles, you may be disappointed with how bland the food is here (clearly intended to attract a wide audience who might think Taco Bell is Mexican food).  Portions were fair for the price.  I probably wouldn't return, in the hopes of finding better options, but otherwise it's an \"okay\" restaurant."
        }, 
        {
            "index": 215, 
            "rating": 5, 
            "review": "Great service!!! Food is great.. Have to try chocolate lava cake and churro cheesecake"
        }, 
        {
            "index": 216, 
            "rating": 1, 
            "review": "Here's how to get a one star review from me: ignore me. Treat me like the peg-legged, buck-toothed, stanky-breathed stepchild of an ill-tempered, leperous sasquatch.\n\nI'm in Vegas for business, staying at New York New York, and I stopped in at Gonzalez y Gonzalez for dinner. It's one of several eateries inside the casino. Long flight. I was starving. I'm traveling by myself and I really didn't want to wander too far from my room. I asked the host-dude if I could sit at the bar. He said okay. No one gave me a menu. They had some little takeout meus at the bar. I looked one over. In fact, I practically memorized the f*king thing. I sat there for 15-20 minutes and the little bartendresses never asked me if I wanted a drink or something to eat. Nada. Zip. Zed. I could have been f**king invisible.\n\nThe gals at the bar were quite adept at avoiding eye contact with me, however. Seriously, how could they miss me? I'm 230 pounds of pure ugly. Kind of hard to miss. I finally picked myself up and walked away. I shot a look at host-dude as I left. \"WTF?\" I said with my totally pissed off body language. I could understand if the place had been slammed, but there was barely a soul inside.\n\nHonest to gawd, it takes a LOT to make me flip a place off over my shoulder, as I walk away with my WALLET FULL OF MONEY. Do yourself a favor and avoid this place like the plague.\n\nJerks."
        }, 
        {
            "index": 217, 
            "rating": 4, 
            "review": "After walking back and forth the strip, I was hungry. I only had a 730am breakfast burrito from the OAK airport all day. By 930pm, I was ready to bite someone's arm. LOL Anyways, I ordered their Chicken Tortilla Soup, a Large Strawberry Margarita and Shredded Beef Enchiladas. I didn't know their soup was in a huge bowl. It was a meal by itself already. So, I only ate one of the enchiladas and boxed the rest to go. The food was good. The place was noisy and crowded. Service was friendly and attentive. Chips weren't free! Boo! I guess there's nothing free in Vegas. Go to the Bay Area and there are tons of free chips. Overall, it was fun. Would I go back? Probably, after I tried the other restaurants around it."
        }, 
        {
            "index": 218, 
            "rating": 1, 
            "review": "Do not eat here! The food was so bland and disappointing. I had the fish tacos and I didn't even taste the fish. PLUS THE CHIPS AND SALSA ARE NOT INCLUDED.  This place is too expensive for how crappy the food is. You are better off getting going anywhere else!"
        }, 
        {
            "index": 219, 
            "rating": 2, 
            "review": "Mimi was a server.  She was very friendly and attentive.  I thought it was a bit whack you had to purchase chips and salsa but that was that.  My margarita was very ok and the skirt steak that we ordered was extremely chewy and overcooked."
        }, 
        {
            "index": 220, 
            "rating": 1, 
            "review": "If you think this place has good food, then you've never had real good Mexican food. We ended up here because they were the only ones that were open. The chips were so salty I might as well eat salt chips. The Tacos al Carbon which they highly recommended tasted nothing like Tacos al Carbon, for some reason. And we were hungry! You usually have forgiving taste buds! And then they played this really, really, really..really loud party music. The last time I checked they were a restaurant and NOT a club to be playing music that loud. Isn't that hazardous to your ears? I just think this restaurant is bad news."
        }, 
        {
            "index": 221, 
            "rating": 4, 
            "review": "Once again, loved this place.  Our waiter, Raymond, was a great guy.  On top of all of our requests.  We happened to be here during the running of the Kentucky Derby.  Place was hopping. We will always have a fond memory of this place on that particular day, as my wife won her first bet on the Derby.  Dinner was basically free!!!\n\nI had the fish tacos, SO good!  She had chicken taquitos.  Though the chips and salsa come for a small cost, Raymond gave us extra to go, which was very much appreciated.  I have to say, possibly the best part of my meal was the salsa.  IMO, some of the tastiest salsa ever.\nGreat environment within NYNY."
        }, 
        {
            "index": 222, 
            "rating": 4, 
            "review": "We went to Gonzalez Y Gonzalez our first night in the US, and didn't have a meal afterwards which came close! I'm a ood snob as well, so I heop this comes accross the way I mean it :). Great authentic Mexican, great atmosphere. The chimichumgas were fabulous , my new favourite mexican dish - margaritas unreal - and going to try and make guacolmole the way they did myself from now on! We ordered combination meals with a selection of dishes, which I'd recommend . They were also very accomodating with my daughter who didn't want food that was \"too\" spicy, ordinarily a bit cheeky to ask for considering where we were!I'd stay in New York New york hotle next time, just to be closer to this place and the indoor street courtyards!"
        }, 
        {
            "index": 223, 
            "rating": 1, 
            "review": "Good for Kids: Yes ?\nThat is so wrong. The music was blaring so loud we had to leave for fear of damaging our child's hearing. Food is overpriced and just plain. I can get a better steak salad at El Pollo Loco."
        }, 
        {
            "index": 224, 
            "rating": 4, 
            "review": "This restaurant is located in New York, New York.\n\nVery good food, comfortable seating, no wait for a table at 1PM on a Sunday afternoon.  The server was friendly but took forever to take our order and bring us the check.  Chips/salsa are not served immediately when you sit down, maybe you have to ask for them and they are an additional charge.  We ordered the fajitas, which were super good but only came with three small tortillas.  We had to ask for more tortillas and then the server brought out 3-4 more small flour tortillas.  The fajitas were plenty for 2 people to share.  I had a fun time, enjoyed the food, and would return if I was in the area again."
        }, 
        {
            "index": 225, 
            "rating": 3, 
            "review": "New York New York is one of my favorite places to visit in Las Vegas and this time the vibe was as cool as ever. My beautiful bride had a hankerin' for a chile relleno, so we stopped by Gonzàlez y Gonzàlez, as they were reported to be good.\n\nThe place has a really interesting décor, with rough brick walls, red and yellow accents and the usual touches that are supposed to be reminiscent of Old Mexico.\n\nSince neither one of us was exceptionally hungry, we asked if we could split a combo and they readily agreed. Our server was pleasant enough, and I have no complaints about the service.\n\nBut while most Mexican restaurants that I know of bring out chips and salsa almost immediately, we were told that there would be a $3.00 charge. So we skipped that. Then the sodas were priced at $3.50, which is much higher than I expected. Our food appeared almost as if by magic, but neither the rice nor the frijoles refritos were hot, but just warm. \n\nSo, nice try Señores Gonzàles - but I can't give you more than a \"C\" this time."
        }, 
        {
            "index": 226, 
            "rating": 5, 
            "review": "My first Yelp and here in Vegas !!! Had the best experience at Gonzalez y Gonzalez , the bartenders Denise and Maria are the best !!! Delicious margarita!!! Love their happy hour and spin the wheel deal !! Carne asada fries and salsa are amazing !!! Next time we are in town we will for sure be back !!! 5 stars!!!!!"
        }, 
        {
            "index": 227, 
            "rating": 3, 
            "review": "My husband and I stayed at New York New York and I had a craving for Mexican Food so this is the first place we ate at in Vegas. I ordered the carnitas tacos and he had enchiladas. I for one loved the food. My tacos were served with big portions of salsa, guacamole, and sour cream on the side for me to put on my tacos. The rice and beans were good too. My husband said he also enjoyed his enchiladas. The prices were comparable to portions that you get which was also nice to find in Vegas. Our waiter was also attentive and checked on us often throughout the meal. Then something happened, he just brought us the check without offering dessert which we wanted and we had to let him know. He seemed annoyed by that for some reason. For dessert I ordered flan any my husband ordered the fried icecream and we both really enjoyed the dessert. The flan was made from scratch instead of coming from a box which you do get in alot of Mexican restaurants. I love flan and I consider myself somewhat of an expert. LOL. Then our waiter disappears and we end up waiting forever for the check which is one of my pet peeves when I go to restaurant. He was so quick to bring it before no he is nowhere to be found. Then he finally brings us the check some 15minutes later and we stick our card in there and then again he pulls his disappearing act. It was at least another 15 minutes that went by making paying for our a meal a 30 minute ordeal, then he reappears again and he is socializing with his co-workers instead of collecting the check. The quickest way to piss me off in a hurry is to keep to me waiting too long for something that should not take long in the first place. Our food was settled and we were hungry by the time he decided to grace us with his presence. I was amazed at how quick he changed after the dessert incident. He went from being a great server to being a real jerk and for that I deduct two stars. This could have easily been a 5 star experience had our waiter not been bi-polar. I still recommend the place for their food but maybe you should make sure they know you want dessert in advance."
        }, 
        {
            "index": 228, 
            "rating": 5, 
            "review": "This is my second review for this amazing restaurant! We took my grandmother here for her 85th birthday dinner. There were 12 of us and the food, drinks, and service was immpecable! I plan on returning every time I visit Las Vegas. :)"
        }, 
        {
            "index": 229, 
            "rating": 5, 
            "review": "i went here before i went to see the basketball games @ MGM and the food here is great, i had no problems with service"
        }, 
        {
            "index": 230, 
            "rating": 4, 
            "review": "A Mexican restaurant/Salsa Bar located inside NYNY Hotel. It's open late. They have \"outdoor\" dining where you can eat and people watch or go in their lounge and dance to some salsa. They have live music or DJ. \n\nCame here for a late night bite on a Saturday night.  \n\nWe had...\n-CHICKEN TAQUITOS $8- 3 taquitos stuffed with seasoned chicken with guac on top. I enjoyed this a lot. It taste like something my mother in law would make. \n-CHICKEN and SHRIMP ENCHILADAS SUIZAS $19 - Very tasty and the shrimp were cooked perfectly, but the chicken inside was a tad bit dry. \n\nService was great. Hostess and our server were nice and knowledgeable with the menu. Wouldn't mind dining here again if we stay in NYNY."
        }, 
        {
            "index": 231, 
            "rating": 5, 
            "review": "I see a lot of mixed reviews for Gonzalez y Gonzalez but I've been here three times over the years and I've  come away with good experiences each time. I was in Vegas for my job and my co-workers wanted Mexican food. Vegas usually isn't where I come for Mexican but I'd eaten at Gonzalez y Gonzalez before so I recommended it. We were sat quickly and our guy Hector was quick with the chips & salsa. I really like the salsa here. It has a roasted flavor which I've yet to find anywhere else. I usually roll with the wet burrito but I was in a nacho mood that day so the Gonzalez Nachos it was ($10.95). Really good. Melted cheese, guacamole, sour cream and shredded chicken it was definitely a meal's worth of food. My coworkers went with a couple of enchilada plates and a street taco plate. Everyone liked everything they got (whew!). Service was friendly and the food came out fast. Hector had to separate tickets a couple ways (four tickets for food, two additional for alcoholic beverages) and he did it with no issues. While there's no doubt you could find better Mexican food in Vegas if you don't want to fight traffic leaving the Strip you could do much worse. Food comes out fast, service is friendly and prices (for Vegas) are pretty reasonable."
        }, 
        {
            "index": 232, 
            "rating": 5, 
            "review": "While killing some time in between shows on that side of the strip we stumbled up this Mexican gem! Had a seat at the bar to people watch and enjoyed frozen margaritas. Our bartender Oscar was great and fun. We also had guacamole with chips. I love that they have a cart come around to make it fresh in front of you! It also allows for you to customize what you want in the guacamole. It also comes with this fresh mild salsa that was delicious. Menu looked like it had a lot of options, would check it out another time for lunch. The food smelled amazing!"
        }, 
        {
            "index": 233, 
            "rating": 2, 
            "review": "I guess if you're from part of the country that doesn't have decent Mexican food in your town that this would be super delicious and exciting, but, when you're from LA....no. Charged for chips and salsa (chips were good though), basic rice and beans, and carne asada tasted of A-1 sauce. No joke. Oh, and I know this is Vegas and price gouging is the norm but good lord that bill hurt. Normally I write much longer reviews but I'm not going to continue wasting my time on this place."
        }, 
        {
            "index": 234, 
            "rating": 1, 
            "review": "You know what sucks is when you've been dying to trying a place for months and you finally get the chance to go with your family and you get the worst service of your life. Don't get me wrong the food it was tasty but food is nothing when your being judged by the staff and getting bad service. Just a FYI for your staff just because a family looks young and maybe doesn't seem like they could afford to eat there seeing as thats the vibe we got the WHOLE time doesn't mean they should be treated badly. If people are at your asstablisment they are obvously there to spend money and eat and they should be treated with respect! Very disappointed."
        }, 
        {
            "index": 235, 
            "rating": 4, 
            "review": "We eat here just about every time we come to Vegas.  We had fajitas today and they were outstanding!  The tortillas are warm, soft, and tasty.  We had beef and chicken fajita -- both were terrific. The server seemed like he might be new, but was clearly doing his best to take good care of us. We'll continue coming back . . ."
        }, 
        {
            "index": 236, 
            "rating": 3, 
            "review": "The family couldn't decide what to eat so they decided to play it safe and have Mexican food for dinner. Located in NYNY, it is fairly close to the Monte Carlo which was where we were staying over the weekend. There was no wait to be seated for a party of 5 on a Saturday early-ish afternoon. We were seated and greeted by our waiter who offered us chips and salsa (not on the house!) as well as some of their many tequilas that they offer. I mean, seriously! they have a good range of different tequilas from the usual Patron Silver under their blanco and silver menu that also includes Jose Cuervo Platino and Don Julio Blanco, they also have Cuervo tradicional and 1800 reposado under the reposado menus, and they also have abocado, muy anejo tequilas and regular anejo. Super awesome if you are a tequila fan. Of course they also have their margaritas, beers, and even wine. \n\nThe husband and I wanted to try to eat something else other than Mexican food for dinner so we only ordered an appetizer to share. We ordered the chicken empanadas which were ok. Crispy, flaky and soft with a good amount of chicken in them. I thought they were a bit on the oily side but then again, I guess it is fried food. My brother ordered the carne asada tacos which I took a bite off and were alright. At $15.95 though, I thought they would be a tad bit better. The meat was a bit on the bland side but if I had enough salsa on them, it was better. \n\nService was ok. We did get our waters refilled  and our waiter came once to check up on us."
        }, 
        {
            "index": 237, 
            "rating": 4, 
            "review": "To be honest you don't expect much out of these pricy hotel, non \"master chef\" restaurants and the same applied here when we dropped in at 9PM for quick dinner. I'll admit I was wrong. The service was very friendly and timely; staff were nice and accommodating. The food was good and portions were fair for the price. \n\nOverall a positive experience that helped filling a gap in food needs on a Saturday"
        }, 
        {
            "index": 238, 
            "rating": 1, 
            "review": "Inside NY NY, food was good, prices are little high, service was poor if you want more than one drink order two at one time!"
        }, 
        {
            "index": 239, 
            "rating": 5, 
            "review": "I loved the chips and mesquite roasted tomato salsa (2.95), but  I was CRAZY about the shrimp and chorizo sopes.  They come with an ample amount of guacamole, black beans, and cilantro rice.   17.95\n\nI was sorry I ate so any chips...but that salsa....\n\nService was good, we were seated immediately, and it wasn't too noisy when we were there."
        }, 
        {
            "index": 240, 
            "rating": 3, 
            "review": "Wanted to watch the end of the USC game last night and sat at the outer portion of the bar. Was first served by Brandon and then Oscar.\n\nAt first they gave their back but they were kinda busy but once they noticed I was new they waited on me very well. Very attentive and always asked if I wanted anything else or how I was doing.\n\nOrdered some DOS XX and a two item combination plate, went with a carne asada taco and a carnitas burrito. Opted for the black beans and rice.\n\nThe asada and carnitas meat were really decent, not outstanding. The beans and rice were okay."
        }, 
        {
            "index": 241, 
            "rating": 5, 
            "review": "What a nice surprise! We've been staying at New York New York for years and had never eaten at Gonzalez Y Gonzalez. I honestly don't know why because it was wonderful.  My husband and I split an order of fajitas as they are quite generous. Everyone in our party had a great meal, we will go back next visit to NYNY.  They have $5 margaritas and daiquiris during happy hour. Our waiter, Raymond, was a gem! Probably the best person we dealt with at NYNY."
        }, 
        {
            "index": 242, 
            "rating": 5, 
            "review": "This place is one of my favorite Mexican restaurants in Vegas. Service is always quick and we've never had to wait for a table. There are plenty of tvs inside if you are wanting to catch a sporting event. Chips and salsa are complimentary but we always get the guacamole and add crab! The margaritas are also a must and prices are very reasonable!"
        }, 
        {
            "index": 243, 
            "rating": 5, 
            "review": "This review is long over due, but better late than never. I just wanted to give a giant THANK YOU to Mary the G.M. at Gonzalez. On Saturday, April 27, 2013 she and all over her staff front and back were absolutely amazing and worked with us immensely on short short notice. \n\nThe back story: \nWe had just finished up with a wedding and the Bride (my cousin) decided she wanted the entire bridal party and all the guests to meet at Gonzalez's in New York New York for a celebratory dinner. Mind you this was NOT preplanned so we did not have a reservation and had a party over 20+ headed that way. My girlfriend and I were one of the first ones there and took it upon ourselves to get a reservation in. We were extremely worried with the amount of people expected that we would not be able to all be seated at one time. The hostess was unable to book a reservation of that size on short notice without the G.M's approval...so we spoke with Mary. Mary was amazing (I couldn't say it enough). She and her staff cleared out the left side of the restaurant as the guests left and \"reserved\" the tables for our party. They were able to pull a table together for the entire party and saved some seats along the outside of the table for any stragglers. \n\nThey we're more than accommodating with our needs and even with a party of our size the service was great. Each person we encountered was happy and smiled and was willing to help service our needs. The food was prompt (a little slower than normal, but nothing outrageous taking in our groups size and short notice).\n\nNeedless to say the Bride and Groom and everyone who came were extremely please with the attention Gonzalez's staff gave all of us, the food, and the experience in general. \n\nNext time I'm in Vegas I will make it a point to stop back in and have another Beer-A-Rida (or three) and the yummy chips and salsa! \n\nThanks again Mary - you guys were truly life savers!!"
        }, 
        {
            "index": 244, 
            "rating": 1, 
            "review": "Not sure why we ate here but we were at NYNY because our girls wanted to ride the roller coaster.\n\nIn any case, we decided on Mexican and boy was that a mistake.  I ordered the fish tacos and the fish was really quite fowl tasting ~ not fresh at all.  Okay, so I moved onto the refried beans and rice ~ simply the worst ever ~ how hard is it to make rice and beans anyway???\n\nThe waitress noticed that I hardly touched my food and asked if she could bring me anything else.  I deferred given that they could not make decent rice & beans.\n\nTo top it off, I had to argue with both the waitress and manager to have the  meal removed from the bill.... Enough said."
        }, 
        {
            "index": 245, 
            "rating": 4, 
            "review": "Good choice to grab something quick and affordable. Came here starving from walking around the strip. Guacamole was freshly prepared for us from Haas avocados. Ordered enchiladas pork, shredded beef and chicken. Would recommend chicken, while pork would rank last.\nOverall good food, very good service and great prices."
        }, 
        {
            "index": 246, 
            "rating": 2, 
            "review": "I guess if you want some Mexican in you, you can eat here.   I would choose another place.  I was brought here by my sister in law who doesn't have any flavor."
        }, 
        {
            "index": 247, 
            "rating": 5, 
            "review": "Great place! We got sitter right away, our attendant was very friendly, the food that we ordered came super fast and was excellent. I would definitely go back there, and I would recommend it to anyone who loves Mexican food and good service."
        }, 
        {
            "index": 248, 
            "rating": 4, 
            "review": "I stopped in here after a long day of traveling with my husband and we were able to quickly get a table. The service was excellent- servers were all very friendly and accommodating. The chips and salsa were great- nice and spicy. My veggie tacos were good. Nothing spectacular but good sized portions. My husband loved the pork belly tacos. The margaritas were on the small size but were delicious. The star of our meal though had to be the table side king crab guacamole! It was FABULOUS! A definite must if you're a guac lover."
        }, 
        {
            "index": 249, 
            "rating": 5, 
            "review": "My group of friends and I went to this restaurant after casually walking around NY NY trying to decide where a good, casual place to eat would be. Came across GyG and decided to give it a try. Loved it!! To start off, the chips and salsa, delish! The salsa has some kind of bbq grilled taste to it. We tried to figure out what made the salsa so unique, and we couldn't figure it out...we just know we all liked it. All five of us ordered something different and each of us were very surprised. We ordered steak nachos, pozole, shrimp ceviche, tortilla soup, and a chimichanga. We all left very satisfied and had no complaints about the food. I will definitely go back next time i'm in Vegas."
        }, 
        {
            "index": 250, 
            "rating": 5, 
            "review": "This was one of our favorite casual restaurants during our trip to Las Vegas. The chips were amazing. We ordered a variety of entrees and they were all amazing. \nI liked the atmostphere of the restaurant. It towards the middle of New York New York on the ground floor, but it is away from the loud noises coming from the casino. It is in the middle of a cute New York street, which i enjoyed. They have an inside of the restaurant as well as what looks like a patio. It was fairly quiet for it being in a casino. \nThe service was excellent. We got everything in a timely manner."
        }, 
        {
            "index": 251, 
            "rating": 3, 
            "review": "MEdiocre at best.  Pork loin entree and guac was solid, not great, everything else was blah.  ambiance=lame.  Go to diablo's cantina, border grill, taqueria canonita, pink taco before you go here.  If Management cared, food would be better."
        }, 
        {
            "index": 252, 
            "rating": 5, 
            "review": "I came to Vegas for a weekend trip, and I HAD to come back here because I've had some intense cravings for the salsa ever since I was here the last time in February. It was like nothing had changed - still had the delicious mesquite salsa, still had the incredible service, and still had the large portions of flavorful food. Now my craving has been satisfied and I got my friend hooked on this place as well; this place will always be on our itinerary when we come back to Vegas."
        }, 
        {
            "index": 253, 
            "rating": 3, 
            "review": "Pretty good food. Had a good time there. There was good music playing. my wife and i danced a little before we left. Service was the only thing kinda lacking but it could of been just our waiter. There wasn't a lot of people there and service was a tad slow. But over all a good experience at NY NY hotel and casino."
        }, 
        {
            "index": 254, 
            "rating": 4, 
            "review": "After getting several refills on our yard margarita, my boyfriend and I decided to have dinner here one evening while on our Vegas vacation.\n\nLet me first start with the margaritas... you get a full pitcher of your choice of margarita in a colored yard glass (plastic) which is easy, and fun, to carry around the Strip. We kept returning with our glass to get discounted refills. It was pretty awesome. The downside is they won't mix flavors for you. Also, after the 3rd one you start to crave other booze.\n\nNow for dinner: Our waiter was very efficient. The chips and yummy salsa arrived on our table immediately after being seated. I ordered the Baracoa beef enchiladas - they were AMAZING! I got 3 enchiladas and a side of rice and beans. It was a lot of food, I was unable to finish my meal. The prices are comparable with other Mexican restaurants I have been to in Wisconsin. \n\nI loved how this resturant had a private feel, even though it was inside New York New York.  I would recommend stopping here if you are wandering around the strip and get a craving for Mexcian food :)"
        }, 
        {
            "index": 255, 
            "rating": 3, 
            "review": "We cruised in on Thursday night and it was empty...a running theme I have noticed on this trip.  We had a really nice waitress and that is why I'm giving this place three stars instead of two.\n\nWe ordered the Gonzalez combo platter which included nachos, chicken wings, chimis and shrimp ceviche with a bowl of chicken tortilla soup.  Everything was O.K. nothing really too impressive.  Still the service was good and the restaurant itself is really cool with nice decor.  \n\nI would go here again and try some other menu items...but mainly you come to this place for it's ambiance and nothing more."
        }, 
        {
            "index": 256, 
            "rating": 1, 
            "review": "Not sure how the food is here. It could be wonderful, but we left due to a shocking lack of gluten-free items on the menu. We were told that only the steak tacos and a few salads were safe due to the marinades they used. There are a lot of us out here with food allergies...time to step up the game!"
        }, 
        {
            "index": 257, 
            "rating": 4, 
            "review": "Sister wanted Chinese or Mexican, I like Mexican, had been wanting to try this place for several trips, and we wanted to not spend a fortune.  All in all, no regrets.\n\nWe were able to get a table right away, and ended up being seated \"outside\" the restaurant, on the hotel floor.  The restaurant is away from the casino, so we had a view of the fake NYC decor and a very brief glimpse of the screaming occupants of the roller coaster.  I would've preferred a table that wasn't right near the entrance/exit, but it was fine.  I had a drink which was good, but not special since I can't remember its name  I think it had pineapple juice in it.  I ordered a chimichanga with the shredded beef and sister ordered a chicken taco salad.  The rice and beans that came with my chimi were nothing special, but we both agreed the meat was great.  Mine was delicious, with just the right amount of sauce and spice, and sister thought her chicken was good.  The chips and salsa were average.  The best part was the bill, which was a good bit lower than what we had been spending, and very reasonable for a Strip casino.\n\nThere's better Mexican food in Vegas, I'm sure, but we were happy, the portions and service were good, and I would have no objections to coming back here."
        }, 
        {
            "index": 258, 
            "rating": 3, 
            "review": "Positives:\nThe service was attentive \nMargaritas were reasonable for a pretty touristy place\nPrices were reasonable for a Vegas strip restaurant\nFresh guacamole is made at the table for you and it was tasty\n\nNegatives:\nStill messed up one of the dishes (no cheese requested - dish came covered with melted cheese)\nWhy do restaurants not put prices for the drinks on the menu - very annoying\nOverall food quality is just ok - about the level of Mexican chain restaurants like Chevy's\n\nSummary:\nVegas strip doesn't have many choices for Mexican.  It works if you are craving some, but it's disappointing when you consider the sheer number of quality restaurants in the hotels."
        }, 
        {
            "index": 259, 
            "rating": 3, 
            "review": "This place was okay. I would advise not ordering the steak in your fajitas unless you really like your meat well-done (to which I say, you must not really like meat...). Also, cheese does not come with the fajitas and the vegetables in it are not fully cooked. So biting into a piece of red pepper, way undercooked...my tongue was burning off. My boyfriend liked his, though. Overall, the service was fine and the prices were okay. Nothing spectacular."
        }, 
        {
            "index": 260, 
            "rating": 4, 
            "review": "Salsa and margaritas = 4 stars. Wonderful. Salsa was awesome, and Im from Texas, so trust me. \n\nFood = 3 stars. As I said, I am from Texas. So the food was better than I expected it to be in Vegas, but it was still not awesome. \n\nI have to give it 4 stars because I would be back for the salsa and margarita alone."
        }, 
        {
            "index": 261, 
            "rating": 4, 
            "review": "Food was great. Had the shrimp tacos, and everything was fresh. The chips were fresh and warm. My boyfriend had enchiladas, and they were delicious. His bloody mary was well-made. Only problem was it was a bit pricey for what you get....even for Vegas prices."
        }, 
        {
            "index": 262, 
            "rating": 4, 
            "review": "Food was good.  Drinks were good.  It's a nice, casual place to grab Mexican food while at a casino that is reasonably priced."
        }, 
        {
            "index": 263, 
            "rating": 5, 
            "review": "I think this place has got better than before.\nSince I started eating fish lately, every restaurant I went to, fish used to be the highlight of the meal.\nAt Gonzales Gonzalez, I tried the grilled pacific swordfish with lime jalapeno butter which comes with rice and beans.I really couldnt taste the lime jalapeno but the fish tasted divine and the cilantro rice was probably the best rice I have ever eaten.\nI had this two nights in a row..thats how good the fish was.\nService is great and prices are not your typical vegas prices."
        }, 
        {
            "index": 264, 
            "rating": 5, 
            "review": "Everytime we stay at New York, New York we eat at this restaurant. The staff is friendly and the food is delicious. We love the table side guacamole and Patron margaritas.  Highly recommend going to this restaurant. We were at the restaurant for Super Bowl and Mary took wonderful care of is. We had a great time!"
        }, 
        {
            "index": 265, 
            "rating": 3, 
            "review": "I would simply say this was an average Mexican restaurant.  I had the carnitas street tacos and they were delicious but the meal didn't blow my mind.  The service was top-notch, my waiter was attentive, friendly and checked on me frequently."
        }, 
        {
            "index": 266, 
            "rating": 4, 
            "review": "We ate at this spot and it was a great decision check inn girl was very nice..the server was also very friendly I forgot his name sorry buddy. The appetizer was great   And the dinner was also good. This is a good spot to eat at. Try it out."
        }, 
        {
            "index": 267, 
            "rating": 5, 
            "review": "This place is delicious. If your looking for a place in las vegas with excellent service. yummy food, great decor and a decent place that doesnt charge a bundle.. this is the place. came here with my husband and his brother Joe (who used to work here) and had a great time. I ordered a combo meal that included a chile relleno, an enchilada, taco and rice and beans. it was soo much food but i couldnt stop eating it. i literally cleaned the plate. everyone else at the table loved their food too. to top things off we ended the meal with fried icecream that was the best. it was huge and enough for everyone to eat at the table. If your near new york new york or staying there dont miss this excellent mexican restaurant."
        }, 
        {
            "index": 268, 
            "rating": 1, 
            "review": "This was my first time coming to this restaurant. The service was bad and slow. My order was delivered wrong, and we were never approached during our meal to see if we needed anything else or a refill on our drinks. They forgot our request for more salsa twice and the overall experience was not great at all. The overall food quality was not that good either. Some of my food was cold, but I was too hungry to send it back. I would not recommend this place to others, and I will not be coming back."
        }, 
        {
            "index": 269, 
            "rating": 5, 
            "review": "The Gonzalez Sampler was delicious came with nachos, wings, chicken empanadas, and tamale bites. Food was ready promptly and was full of delicious flavor. Service was great and friendly, overall extremely satisfied. Happy hour from 3pm - 6pm offers margaritas 2 for 1."
        }, 
        {
            "index": 270, 
            "rating": 2, 
            "review": "This food is NOT good. My wife and I have tried it twice and it is sub-standard and overall poor. I am giving it an extra star because the atmosphere is very cool. I would advise walking down the street and going to Diablos!"
        }, 
        {
            "index": 271, 
            "rating": 2, 
            "review": "This had always been our favorite place to eat whenwe come to Vegas.  Since our last trip (year &1/2 ago) the prices went up, they now charge for chips & salsa, and drink refills. They also tacked on an 18% service charge since their wees 6 of us. The service also seemed  impersonal. We need to find a new dinner spot for our next trip."
        }, 
        {
            "index": 272, 
            "rating": 4, 
            "review": "The food was ok, enjoyed the guacamole that is made right in front of you by a server.\nChips were fresh and refilled quickly and include salsa.\nMe and my party had Enchiladas & Chimichangas along with the tasty beans & rice. \nYou get a choice of refried or black beans here. (plenty of cheese is included here)\nThe cadillac margarita was not as good as other ones i've had. Just was not mixed right.\nServers were nice and attentive. We were seated about 5 min. after arriving.\nPrices were fairly good and we found the restaurant quickly in the New York, New York hotel."
        }, 
        {
            "index": 273, 
            "rating": 4, 
            "review": "We were strolling the Las Vegas strip looking for something different to eat and walked thru New York New York casino and stumbled upon this place. Actually the aroma is what really caught our attention. The seating is pretty tight here not the most comfortable but I am a trooper. Their customer service was excellent and on point. I had the carne asada tacos and I can honestly say I have never had asada that tender before it was very good. The Spanish rice and beans were good and their guacamole is excellent. I would definitely visit again when I'm in town, just not sure if I would order a drink from here, they were pretty weak."
        }, 
        {
            "index": 274, 
            "rating": 5, 
            "review": "I was pointed here for the best dessert in New York, New York. I ordered the grande fried ice cream. Grade cost  an extra dollar. It is worth the extra dollar, unless you are on a diet. Then, don't order dessert. It was an excellent fried ice cream (am not usually a fan). The ice cream was great quality and neither melted nor too frozen. The bowl was perfectly accented with cinnamon sugar. Overall, it was fantastic.\n\nThe staff was friendly and attentive. The entrees looked promising, but we only had time for dessert. It was fantastic."
        }, 
        {
            "index": 275, 
            "rating": 5, 
            "review": "Great spot for some amazing food. Great service, ask for Chris. Chips and salsa were the best I've ever had. Fresh and great flavor. Great service, even got checked on by the General Manager which was a nice touch. Thank you Chris and Mary and Gonzalez Gonzalez for a great Las Vegas lunch!!!"
        }, 
        {
            "index": 276, 
            "rating": 4, 
            "review": "Good lunch. Drinks are over priced but Vegas isn't about cheap drinks. Figure $30-35 for lunch with one drink. Food was very good. I had Ancho Chili Mahi. Salsa is good if you like it spicy. Inside NYNY"
        }, 
        {
            "index": 277, 
            "rating": 4, 
            "review": "Of course on vacation I decided to eat fajitas for breakfast (wrong choice, but am not regretting it at all). My sensitive stomach did not cooperate being that it's such a heavy meal to be eating as your first meal of the day, but it was so delicious! I wish I was able to finish all of the food we ordered, but sadly I couldn't. \n\nWe ordered guacamole, fajitas, and fish tacos. I didn't get to try the fish tacos, but my boyfriend said those were the best tacos he's ever had in his life. The fajitas were standard, but delicious. The guac was alright, but I'm a garlic monster so that could be why. \n\nService in the beginning was awesome! We got everything in a timely manner. But when trying to cash out, we had to wait forever. Our server was so busy helping everyone else and doing others jobs though that we understood the feeling. \n\nOverall, this place was awesome! I would come back here again and I'd probably try the fish tacos next time too."
        }, 
        {
            "index": 278, 
            "rating": 2, 
            "review": "I ordered a shredded beef chimichanga and for it to be as pricey as it was, the portions were tiny. I am so used to larger portions at authentic Mexican restaurants so I was disappointed by the portion size. The chimichanga was fried too crispy, the rice was just a spoonful and I received little to no guacamole and sour cream. Despite the decent flavors, I will not be returning to this location due to my disappointment in the meal."
        }, 
        {
            "index": 279, 
            "rating": 5, 
            "review": "We were in a hurry and hungry, we went in and we're seated. We got our drinks really fast and she took our order. We showed up the last 20 minutes of happy hour , not only did the amazing waitress get us our good but when happy hour was about to end she made sure she we had enough drinks, even though we still had our first ones she got us two more still at happy hour price. The manager was as sweet as our waitress. We went back the next day for dinner. I recommend you go out of your way to go there."
        }, 
        {
            "index": 280, 
            "rating": 2, 
            "review": "We found ourselves here towards the end of an evening of mojitos, shooters and craps. Having walked and monorailed from Mandalay Bay looking for inspiration, we allowed ourselves to be led here on the recommendation of the most inebriated member of our group, who also happened to be the most Vegas-savvy. We lived to regret it.\n\nThe salsa that came with the complimentary chips was, I admit, very good. So was the fresh guacamole. Sadly, it was downhill from there on in.\n\nThe biggest complaint, from the whole group, was how salty all the food was. My experience was of very ordinary diner food served with little real care. The presentation was sloppy and some of the plates looked like they'd been sitting around for a while.\n\nThe next morning, when our friend surfaced, his only comment was 'How did we end up at Gonzalez y Gonzalez. I hate that place.'"
        }, 
        {
            "index": 281, 
            "rating": 5, 
            "review": "Simply the best Mexican restaurant around the area. Food was was good and service was great, thank you Mimi!! I've been coming to the New York New York hotel for many many years and this was my first time eating at Gonzalez y González. I definitely recommend this restaurant,and if you are looking into a good and flavorful Mexican food this is the place. We'll be coming back."
        }, 
        {
            "index": 282, 
            "rating": 5, 
            "review": "So I was in Vegas a few months ago for a cheer competition and as well know we have all had to tighten the belt a little so going to Vegas in these times was not the best timing. So having a Steak dinner was not going to happen and room service was only ordered once :( \nBut lucky for us we were meeting some friends at the dueling piano bar and had some time for some grub so we stopped over at Gonzales Y Gonzalez and man am I glad we did. They greeting us with a warm basket of chips and offered their margarita which sounded and tasted so good! As always I ordered the Carnitas tacos which I have always ordered from all mexican restaurants that are put to the test and they passed with flying colors. The tacos were a perfect size their beans and rice tasted authentic and the price was oh so right! I don't know about you but I get so excited when I get a cheap bill. I dont know how many times we have gotten a big bill that was so over priced and made me mad. You have to pay no matter what but sometimes it just sucks. We ate here twice during our trip and didnt even feel guilty about not going to try something new, it was like why \"try\" something else when we have a sure thing...I guess I wasn't into experimenting that weekend. I will definitely go back next time I am in town."
        }, 
        {
            "index": 283, 
            "rating": 5, 
            "review": "We had dinner here while at the SHOT Show and it was fabulous. Lupita seated us and she was so friendly and sweet, then Karl took care of us. The chips were big and warm and the salsa was delicious. I had the roasted veggie fajitas and they were the best I've ever had--fresh broccoli, mushrooms, peppers, zucchini, cherry tomatoes and onions with a yummy marinade, served with spicy guacamole, pico, and beans and rice. The cilantro rice is really tasty. My husband had a chili relleno, chicken enchilada, and a tamale. He chose the black beans and Mexican rice and they were good too, but I liked the cilantro rice and refried beans best. The portions were big and we left stuffed. Absolutely a great place. Nice and casual, and we didn't need a reservation. Price was right, too. Even with a decent tip it was less than $50."
        }, 
        {
            "index": 284, 
            "rating": 5, 
            "review": "My husband and I visited Gonzalez Y Gonzalez in Las Vegas inside of New York New York Hotel & Casino on a Monday night for a late dinner. \n\nService: Upon arriving we were seated right away in the patio area. Our waiter, Chris was awesome. He was very attentive and knowledgeable of the menu items. After we placed our order he gave each of us a detailed description of what we ordered and how the food would be served.  We were really impressed with the level of service Chris provided.  He was genuinely nice and friendly.\n\nFood: The food exceeded my expectations. We started with chips and salsa, which were very good. The chips were crispy, fresh, and warm; and the salsa was very flavorful and spicy, but not too hot. Note, the chips and salsa are not free, but definitely worth the $3.00. \nI ordered the Chimichanga with shredded beef (pictured below). The chimichanga was STUFFED with shredded beef and the flour tortilla was fried to perfection. Considering the outside is fried, it was not overly greasy. The shredded beef was full of flavor; a bit on the spicy side but delicious if you like spicy food. I personally could not get enough. It was topped with guacamole, pico de gallo, sour cream and shredded cheese. It came with a side of pinto beans and rice. The beans had lots of flavor and were topped with a bit of crumbled queso fresco. The rice was cooked well but had a lemony flavor which I didn't care for much.\nMy husband ordered a 3 item plate with a taco, enchilada, and burrito. It came with a side of refried beans and rice. The taco was made of carnitas, the enchilada was chicken, and the burrito was ground beef. FYI, you have the option to choose different types of meats. My husband said the carnitas had lots of flavor and were really good. They were cooked well and not greasy. The only thing he did not care for much was the carnitas were served in chunks rather than shredded. I think it's more of a personal preference. The ground beef burrito and chicken enchilada were also good. He agreed that the rice had a lemony taste but said it was good and didn't mind it.\n\nValue: Prices were reasonable and comparable to other restaurants. We spent about $47.00 for chips & salsa, 2 entrees, and 2 drinks. The food was definitely worth it; very flavorful & filling.\n\nI would definitely recommend eating here and cannot wait to go back."
        }, 
        {
            "index": 285, 
            "rating": 2, 
            "review": "Went here for dinner a month ago while staying at New York New York.  It was relatively early Saturday night (6ish) and got seated right away.  \n\nThe food was mediocre at best.  I had a barbacoa burrito, which was decent in flavor and quality of meat. However, all of the food almost felt like it had been pre-made and then microwaved to order.  \n\nIt wasn't horrible, but there's definitely better options to be had."
        }, 
        {
            "index": 286, 
            "rating": 3, 
            "review": "Decent little Mexican place inside the NY,NY hotel and casino.  Somewhat pricey, but that's everything on the Vegas strip.  I've been here a couple time and we got good fast service and pretty decent food.  I like the street tacos."
        }, 
        {
            "index": 287, 
            "rating": 4, 
            "review": "Pretty good!\n\nThe atmosphere/setting of this restaurant is awesome. Located in the New York, New York you will actually feel that you are sitting in an outside table in an alley of the big city. Lighting was of course somewhat dim with some \"christmas-type\" lights strung above you.\n\nThe chips and salsa were very tasty. They use white corn tortilla chips instead of the regular yellow corn at most Mexican restaurants. The salsa was very flavorful as well. And of course, I found myself gorging in these before our meal came.\n\nLunch was actually pretty tasty. Much better than any chain Mexican restaurant around, I had the two combination plate with a chicken enchilada and beef burrito. Both were very hot and had a good mix of cheese/sauce smothered on top. Rice was flavorful and beans were not too salty or bland.\n\nAll in all, we had a great time. The food was pretty good, service was ok, and setting was awesome. Also a rather cheap lunch on the strip."
        }, 
        {
            "index": 288, 
            "rating": 2, 
            "review": "It's good cheesy American-style Mexican good.  Think El Torito, Don Pablo, or Acapulco, but double the price and slightly better.\n\nI've given it two stars for the price/quality as compared to other better Mexican places in Las Vegas.  Vegas has both amazing and crappy food, this is in the middle."
        }, 
        {
            "index": 289, 
            "rating": 4, 
            "review": "ate here before seeing a show at NY NY.  Made a reservation, but did not even really need it on a Saturday night.  Service was friendly and quick.  Food was great as well.  I had a shrimp quesadilla.  Chips and salsa were super yummy.  Highly recommend for a casual meal if in NY NY."
        }, 
        {
            "index": 290, 
            "rating": 4, 
            "review": "The steak fajitas came out of a sizzling hot plate, cooked to perfection. Very tasty and flavorful. Prices were on par for the strip. If I'm ever in the area (and hungry) I would definitely make an effort to stop here!"
        }, 
        {
            "index": 291, 
            "rating": 5, 
            "review": "The service was amazing, the food was fantastic, and I can't say enough good things about the manager Mary and our server Joel. \n\nAbsolutely get the King Crab Guacamole and Gonzalez Nachos!  They will STUFF a party of three, and are just appetizers. \n\nThe shots are also very generous."
        }, 
        {
            "index": 292, 
            "rating": 4, 
            "review": "Ordered Burrito Gonzalez with barbacoa (beef) and it was so good. Comes with rice, beans, and guacamole. Burrito was covered in enchilada sauce and cheese. In the burrito was just the meat. Everything was seasoned just right. My 3 year old ordered chicken strips which was way too breaded and hard. If im ever in the nyny, i will eat here again. but i wouldnt go out of my way to eat here."
        }, 
        {
            "index": 293, 
            "rating": 2, 
            "review": "A very large restaurant in the New York New York Casino. They offer \"outdoor\" seating - meaning on the fake city streets within the casino. We chose the outdoor seating so we could people watch while we ate.\n\nThe Margarita was too sweet and a little watered down. They served it in a plastic cup rather than glass. That was a bit of a disappointment. They are generous with their chips and salsa. They also made us table side guacamole which was very good.\n\nFor dinner, I had a beef burrito. I've had better."
        }, 
        {
            "index": 294, 
            "rating": 5, 
            "review": "A staple in all of our vegas trips.\n\nThings we like: \n-Salsa is amazing. AMAZING.\n-Good priced drinks -the strawberry daiquiri was AWESOME.\n-Great waiters, quick service. \n-Prices for being \"in vegas\" are SUPER reasonable!\n-Atmosphere -fun lights, you can hear the hustle and bustle \n-Never super busy!\n\nThe beans are not my favorite from a Mexican Restaurant, but I'll get over it because the combo's are priced GREAT and I love the Chicken Tamales! YUMMMMM.\nHusband had a shredded beef burrito and he said the beef was great! \n\n If you are craving mexican, like we always are, this is a GREAT stop!"
        }, 
        {
            "index": 295, 
            "rating": 4, 
            "review": "Feels like home! Finally, a Mexican restaurant on the Strip with great food and not for $20 for 2 tacos. \n\nEven though the steak in my fajitas weren't stellar, I still really enjoyed my meal. I think it's because they didnt put the plate over a candle, so the steak became cold and dry very fast. The guacamole, beans, and sour cream more than made up for it though. My other half ordered the Arrachera (pretty much like carne asada) which was freaking amazing. The meat was perfectly cooked and tender with BIG flavor. Was kinda jealous that he ordered that! My steak was nowhere near as good as his. \n\nLots of different kind of margaritas. We had the El Choco Loco, and it was fantastic! IT HAD MALBIU IN IT!\n\nThe downside... Our server was... weird. He would come to our table and not saying anything. He just stood there waiting for US to say something. Uh. But it looked like the servers around us were decent, so maybe we got the sour one out of the bunch. \n\nAlso, no complimentary chips and salsa. Meh. It was $2.95 at least. \n\nOverall, great Mexican food that doesn't try to be fancy like most Vegas restaurants do. Just the kind of Mexican food you crave! Finally a great restaurant on the Strip that has great prices. I didn't feel ripped off at all."
        }, 
        {
            "index": 296, 
            "rating": 4, 
            "review": "Happened upon this place while waiting to watch Zumanity @ the NYNY. I was actually pretty surprised by this place. It has a nice atmosphere and really decent prices for an in casino restaurant. The chips and salsa were perfect and the carnitas tacos I had were moist and juicy. Everything served hot and fresh with great ambiance. The beans were pretty tasty, and something most restaurants mess up. If your on this end of the strip its not a bad place to stop before heading to the club."
        }, 
        {
            "index": 297, 
            "rating": 4, 
            "review": "Great place for a quick bite, and a few drinks before heading over to .... \"Hey, where are we going?\"\n\nWe had these jalapeno poppers with shrimp, and mini chimichangas (I think that's what they were ~ in the appetizer section) and they were SO GOOD! \n\nThe girls ordered some tacos, and the food was so good -- it was the first time we were quiet in 4 days. \n\nGood times, we were pleasantly surprised with the food, drinks and service! We also enjoy to rubberneck, so we sat *outside* at the little pull up bar instead of inside the restaurant."
        }, 
        {
            "index": 298, 
            "rating": 2, 
            "review": "\"MEH\" is right!\n\nLiving in California makes it really hard to give high ratings to mexican\nrestaurants around the world.. ours are so much better! We had an awkward\ntable that felt like was in the way of everyone and everything. The place was\nexpectedly noisy (inside NYNY, next to the casinos and the rollercoaster)\nand also rather dirty. Taquerias aren't always spotless, but hey.. it just FELT\nlike we were in a dirty place. The food was below average, I don't think I even\ngot halfway through before throwing in the towel.. and the service was\npretty non-existent. With all the places around, I really doubt I'll ever be back here..\nfelt too much like a crowded Taco Bell full of drunk teenagers."
        }, 
        {
            "index": 299, 
            "rating": 3, 
            "review": "Good service and a cute little place to grab a bite but beware of the refried beans. Best time to go is the happy hour. Saved a little on the bill on the appetizer."
        }, 
        {
            "index": 300, 
            "rating": 2, 
            "review": "One of the worse Mexican restaurant I've been to!  It gets two stars because the chips and salsa were good, otherwise it would get one star (I'm being generous!)  I ordered a watermelon margarita and it was horrendous!  I ordered a combination plate and it didn't come the way I ordered (besides the food being cold).  My brother in law ordered a steak salad and mentioned it's one of the easiest dish to make and from the look on his face, it was not acceptable.  On a positive note, our server was nice and attentive, but we will never go back to this place again.  The food sucked!"
        }, 
        {
            "index": 301, 
            "rating": 4, 
            "review": "This place really surprised me. My son and I went in after walking the strip. They had 2 for 1 margaritas for happy hour so of course I had to go for it. Chips and salsa were great. Awesome flavor and a nice heat. Drinks were strong, which wasn't a bad thing. I got the lunch special tacos and they were delicious. Beans and rice also very good.. Not expensive and very tasty on the strip."
        }, 
        {
            "index": 302, 
            "rating": 3, 
            "review": "Good food and good service. Prices are a little on the higher side for what I am use to paying for mexican food, but still would go there again if I was at NYNY casino in vegas and craving mexican food."
        }, 
        {
            "index": 303, 
            "rating": 4, 
            "review": "Been here a few times. If your staying at nyny and don't feel like walking this place is good for apps and drinks. Most impressive is the 3ft margarita. Although pricey at 15 bucks they aren't shy on the alchy and refills are 13 anytime you bring the glass back. Theyre great to bring to the pool and check out the scenery with, if u get my drift."
        }, 
        {
            "index": 304, 
            "rating": 5, 
            "review": "Mary the GM always takes care of us when we're here! Service is great.. I recommend the steak nachos & table side guacamole... Always amazing. Hard to find good Mexican food on the strip but I love this place!"
        }, 
        {
            "index": 305, 
            "rating": 3, 
            "review": "Walking around in NY NY came acrossed Gonzalez Y Gonzalez and we need desperately to relax our feet.  Menu is pretty basic they have all of the popular Mexican dishes, huge plus complementary chips and salsa! 2 thumbs up- seems that nothing is free in Vegas."
        }, 
        {
            "index": 306, 
            "rating": 4, 
            "review": "If we are craving Mexican food while we're in Vegas we usually make our way to Gonzalez Y Gonzalez. For a reasonable price you can arrive at the restaurant and leave content (full tummy). I often like to have their taco bowl and I'm yet to be disappointed. My other half likes their wet burritos. I don't usually have their alcoholic beverages because I like to get mine while playing the slots, but everyone who seems to order their margaritas etc. appears to love them."
        }, 
        {
            "index": 307, 
            "rating": 3, 
            "review": "Went there last night.  The ambience is very good in this restaurant and the waiters and staff were delightful.  The food presentation is also good.  The problem is that the food is hit or miss.  The vegetarian fajitas were excellent but the beef inside the chimichangas and the tacos tasted like the cheap-quality frozen kind you would get from the grocery store.  Bottom line is that I liked the place and may even go back again to try some of their other dishes but would avoid their beef dishes."
        }, 
        {
            "index": 308, 
            "rating": 5, 
            "review": "This place satisfied our Mexican food craving so well we ate there two nights of our five day trip to Vegas. We had crab guacamole made table side, best chips and salsa, and both times I ordered the chicken fajitas, so good and large enough to share with the table.  If your close to NYNY eat there. The service both times was amazing, very attentive. Thank you!!!"
        }, 
        {
            "index": 309, 
            "rating": 5, 
            "review": "The starter they offer is fresh chips and salsa and it was AMAZING, I haven't had fresh salsa like that since I was in Texas! \n\nI would definitely suggest you visit this restaurant if you're at the NY hotel, we got the enchiladas and they were the best I'd EVER had (better than when I was in Mexico)! The menu has an excellent variety of Mexican food and the pricing is excellent for anyone on a budget. The portions are also very well sized (enough to share and be full). \n\nABSOLUTELY A MUST WHILE YOU ARE IN LV! :D"
        }, 
        {
            "index": 310, 
            "rating": 3, 
            "review": "A decent \"cheap eats\" in a casino. I really liked their chicken nachos. The chicken was cooked in a tasty red sauce similar to tinga (tinga is a traditional Mexican dish). I would go back on my next visit to Vegas. The first time I went to this place was for the Latin dancing on a Saturday night about six months ago. On our most recent trip last week we decided to give the food a try while visiting NY-NY."
        }, 
        {
            "index": 311, 
            "rating": 3, 
            "review": "Very average Americanized Mexican joint. Chips and salsa are excellent (salsa is very fresh) but food is on the bland side. Service is as terrible as others have said. I went with a group of 8 on a Saturday night and most were satisfied but 2 hated the place, mostly because their food was cold. I got chicken fajitas and they were ok, comparable to a chilis or 99 restaurant unfortunately. Salsa alone would bring me back though"
        }, 
        {
            "index": 312, 
            "rating": 4, 
            "review": "Coming from Southern California, one would think that I would be tired of south-of-the-border cuisine as I visited Las Vegas. Perhaps Mexican food is in my comfort zone, but as I strolled through New York-New York around dinner time, Gonzalez Y Gonzalez sounded very appetizing.\n\nIt's a small restaurant, with many tables outnumber the few booths. Our waitress was below average to everyone she was serving, though my party and I noted that the other waiters seemed more attentive. The bar served 48 oz frozen margaritas, which could be seen on many of the dining tables. It's also good to note that there is a wide selection of tequila and margaritas offered.\n\nLike many Mexican restaurants (at least in California), chips and salsa were presented as starters. The salsa was amazing, with the chips not lacking either. I ordered a chicken enchilada and chicken burrito two item combo, along with a mojito. The mojito was delicious; the drink was almost green from the mint. Both the enchilada and burrito did not disappoint, either. The chicken was moist and flavorful, and the sauces covering each item were delicious. The beans were tasty, but the rice was not good. It tasted like the microwavable kind. \n\nOverall, the food was very good, and well-priced. I was surprised to find it comparable to the great Mexican-American food chains found in California."
        }, 
        {
            "index": 313, 
            "rating": 5, 
            "review": "LOS!!...12-1-12...missed you again...guess you have the weekend off.  Dinner is not as good when you are not serving.  See you on our next visit.\n\nOddity:  I stopped by to ask if you were working and the hostess told me she would not answer that question.  I restated my question and she told me she could not share that information with strangers.  What????  This is very strange...and she was not kidding and never once showed any sort of smile.   I asked if anybody would answer this question;  she stated I could ask the manager.  I believe I then spoke to Mary;  she was delightful."
        }, 
        {
            "index": 314, 
            "rating": 5, 
            "review": "They have huge Margaritas for only $20. Not bad! We came here to watch the Vikings beat out the Raiders, winning me a nice $53 bucks. While watching the game, we ordered some food and drinks. \n\nThe drinks were great but the food stole the spotlight. We had a huge plate of yummy chicken nachos and table-side guacamole. Not just regular guac either, no King Crab Bacon Guacamole. It was the best of all worlds coming together. And do you want to know how you make sure your guac is fresh, get it table-side. Our kind waitress made it right in front of us. It was soooo goood. \n\nGreat place, good prices, and right on the Strip."
        }, 
        {
            "index": 315, 
            "rating": 2, 
            "review": "Meh is correct. One of the worst margaritas I couldn't finish. I think you could get better Mexican food from the freezer section at a grocery store. I'm not sure how this could really have 3.5 stars. Maybe these Yelpers are drunk and need to go home.The nachos were at least edible, so I'll give them that. But those empinadas, nice try, Gonzales. Yuck-O!"
        }, 
        {
            "index": 316, 
            "rating": 4, 
            "review": "My friends and I (7 total) came in here after partying for 2 straight days. We needed hangover food which was breakfast food, but every place serving breakfast was closed and buffet was too much. I digress.\nWe passed by G y G and figured Mexican would be perfect. Plus they had tv's and the 9er game was on so we were sold.\nI feel like we practically ordered half of the menu. Everything I got a taste of was great. I got the steak salad and loved it. \nThe service was pretty good. The staff were very accommodating with our requests. My friend who is an avid 9er fan really wanted to watch the game so she requested for us to be seated by the tv and they made it happen.\nThe people dining while we were there were a riot. We made them take a shot of vodka because my friend had a bottle of Grey goose and they totally killed it.\nFun times"
        }, 
        {
            "index": 317, 
            "rating": 4, 
            "review": "Great food. Interesting ambience.\nThe crab and shrimp enchilada and pork belly tacos are really awesome. Very refined Mexican food."
        }, 
        {
            "index": 318, 
            "rating": 5, 
            "review": "We took our 3 year old here for her birthday! She got free ice cream and they sang to her! The food was amazing and the salsa was so good! We will definitely be going back for more!"
        }, 
        {
            "index": 319, 
            "rating": 3, 
            "review": "Gonzalez Y Gonzalez is located inside the New York New York Hotel and Casino. It is a Mexican themed restaurant. I didn't really know what to expect after reading the reviews so I decided to take a chance and eat there.\n\nOur waitress was very friendly and let us know what the popular dishes and drinks were. At first I had ordered the steak nachos but our waitress was quick to point out that the portion was really small and it was more of an appetizer. I truly appreciated her honesty. I ended up ordering the chicken quesadilla which came with pico de gallo, sour cream and guacamole. The shredded chicken was very tasty however I was quite disappointed by how small the quesadilla was. My friend ordered the Gonzalez nachos which consists of nacho, cheese, ground beef and guacamole. I was able to try some of it and it was good.\n\nWhile my experience at this restaurant was very positive, I thought the restaurant was a bit pricey for the amount of food served (both our bills added up to $26). If you are really craving or wanting to eat Mexican food while vacationing in Las Vegas, I suggest you look for a place away from the strip."
        }, 
        {
            "index": 320, 
            "rating": 4, 
            "review": "The menu is great here and the food is wonderful and very reasonably priced for Las Vegas.  Our service was great and there was no line to get a table!"
        }, 
        {
            "index": 321, 
            "rating": 5, 
            "review": "This was a great experience! The whole staff was so warm and helpful! My friend was having a hard time opening her water bottle and 3 employees came by trying to help. We eventually got it open. The table side guacamole was amazing as well as the salsa. The servings are big and filling. I enjoyed my beef chimichanga. Such a lovely staff! Thank you for a great dinner guys!"
        }, 
        {
            "index": 322, 
            "rating": 4, 
            "review": "Delicious Mexican food! Good chips and homemade guac (table side). Enjoyed the fajitas, especially the shrimp, very flavorful."
        }, 
        {
            "index": 323, 
            "rating": 4, 
            "review": "You gotta get the fresh guacamole. They make it fresh right at the table! It was delish! The fajitas were awesome and so was the chips and salsa. My hubby got the chimichanga but it wasn't all that. It was a little dry and not alot of flavor. It was a little pricey."
        }, 
        {
            "index": 324, 
            "rating": 4, 
            "review": "Early dinner last night. I'm starting to feel like a Mexican food snob because the food here was just meh. I ordered the crispy tacos thinking I'd be getting a nice fried shell and instead I got something that was more like what you buy at a box in the grocery store. Boo\n\nThe chips were pretty good though and out waiter was super friendly so kudos to that."
        }, 
        {
            "index": 325, 
            "rating": 4, 
            "review": "I have tried a lot of restaurants in Vegas and honestly this is the ONLY place that my BF and I return to on every visit.  The environment is casual and the food is so good. Gonzalez y Gonzalez never lets me down!"
        }, 
        {
            "index": 326, 
            "rating": 4, 
            "review": "I really should have rated this place a 3, but considering we came here after having a horrible time at Vanity, it was such a relief! Good latin music, the vibe was nice. The margaritas were good and it had the girls dancing. What more can you ask for? I didn't try the food but the drinks were good."
        }, 
        {
            "index": 327, 
            "rating": 5, 
            "review": "Nevermind the food, this is the spot for dancing!! When going back to my room at 11:30pm leaving a shitty time at Senor Frogs I heard Spanish Rock (Mana). I stopped my husband dead in his tracks and asked him \"do you hear that?! that's where we need to be'!! we followed the music and quickly found the spot and stayed there till 3am! IT WAS GOOD! definitely going back in July!! The DJ played mostly cumbias and a small assortment of reggeton, hip hop and banda!! The spot!!"
        }, 
        {
            "index": 328, 
            "rating": 4, 
            "review": "Great guacamole. Good atmosphere. Service is good. Must get the queso cotija. Good go to in the Sin City!"
        }, 
        {
            "index": 329, 
            "rating": 3, 
            "review": "It was in our hotel so it was easy to get to.  But this place lacked in anything original.  It was just \"fine\".  \n\nChips and salsa...fine\nEnchiladas....fine\nMargarita.....meh....\n\nSo, it was affordable, it was close to 'home', but it was not fantastic and not someplace I would seek out specifically in Vegas."
        }, 
        {
            "index": 330, 
            "rating": 3, 
            "review": "Since I had made reservations, we were seated promptly. Before we had the chance to look over the menu, we were asked about our drinks. I ordered a margarita and husband ordered a modelo. They were offering a free margarita with the special entrees. We both decided to get the specials, but there was a catch.. Since I ordered a margarita prior to ordering our meal, I couldn't include that as my free margarita, even though it was the same size. The waiter stated it was already in the computer as an order. But for the meal, it was delicious. Shrimp, crab rellano , with cilantro rice and black beans. Husband had the shrimp and chicken suiza. Yummy. And 3 margaritas, alittle watered down but good."
        }, 
        {
            "index": 331, 
            "rating": 3, 
            "review": "Gosh, I love Mexican. Fish tacos are quite possibly my favorite food of life so when I saw grilled fish tacos on Gonzalez y Gonzalez's menu, I had no doubt that's what I was going to order. We popped in before heading to the Jimmy Buffett concert at the MGM so we were on a margarita-drinking roll when we stopped by. The food was good, but it was pretty standard Mexican (not that that's a bad thing); not particularly creative but nevertheless a good, decently-priced fish taco with good service. Since we were heading to the concert, we opted for their oversized margarita (the 48oz. behemoth) for the road. For $20, it's hard to beat considering we were paying $8-10 a pop for margaritas elsewhere. All around, good Mexican and perfect for a casual bite."
        }, 
        {
            "index": 332, 
            "rating": 5, 
            "review": "I enjoyed the food here. The Carne Asada plate was great. The meat had amazing flavor and the tomatillo salsa they put on top is great!!! They had really amazing service. Very very very Attentive!! And We were a party of 15 and they were on top of it. I would come back here again when I come back to town."
        }, 
        {
            "index": 333, 
            "rating": 3, 
            "review": "Needing a place to eat inside New York, New York this seemed like an appropriate choice that could satisfy the tastes and budgets of the group. It did turn out to be a very expensive meal anyhow but I will admit that is mostly due to our need to buy many delicious margaritas and someone else's need to get souvenir cups. Be forewarned though my most delicious margarita was 16$ and so tasty I had to have two. It did come with a very unique lemon lime salt on the rim that kept me perplexed the entire time. My server was also kind enough to bring us to go cups when we were finished eating and not quite finished our drinks which is something I truly love about Vegas. Everyone seemed pretty happy with their meals, but disappointed that this place charged extra for chips and salsa causing us to go without. I had the tableside guacamole as an appetizer which was pretty big and I was unable to finish it. It was reasonable at 9$ and made the same as at other similar places which offer this, consisted of 1 and a half avocados, cilantro, jalepenos, lime, etc. and a huge basket of chips. Others seemed happy sharing a meal of fajitas and were delighted to be given extra tortillas. Service was okay, but did seem like we ended up spending a lot of time here. My favorite part is being able to look through the \"windows\" and see the New York decor on the \"buildings\" nearby."
        }, 
        {
            "index": 334, 
            "rating": 4, 
            "review": "Huge portions and the prices are reasonable for a restaurant on the strip.  Very attentive staff to make sure your dining experience is great.  Try the burrito, carne asada fajita or the fish taco."
        }, 
        {
            "index": 335, 
            "rating": 4, 
            "review": "Top of the line tequila selection of anejo and reposado tequilas. Tortilla soup was great. Service was great. Prices were great. Stop here to eat."
        }, 
        {
            "index": 336, 
            "rating": 1, 
            "review": "Food tasted like if it had been reheated in the microwave. The only good thing about this place were the chips and salsa. Food didn't have much taste, but did make me feel sick later in the evening (perhaps because it's not fresh). I know Mexican food isn't the easiest to digest, but my stomach should be able to handle it since I've been eating it since I was born! This is definitely a no go for me."
        }, 
        {
            "index": 337, 
            "rating": 5, 
            "review": "Great late night atmosphere at NYNY. We came here for an appetizer before Zumanity show. Service was great. The prices were extremely fair. Food was good. We will definitely make Gonzalez-Gonzalez a regular place to eat while visiting in Las Vegas"
        }, 
        {
            "index": 338, 
            "rating": 5, 
            "review": "This is where the fiance and I decided to have our Christmas lunch :)\n\nOur waiter was terrific!  He gave us recommendations on what was good and checked up on us a reasonable amount of times.  \n\nIt starts off with their house salsa and chips.  It's kinda salty but I'm a salt lover so it was awesome to me.  We ordered the honey chipotle chicken wings and a crispy shrimp something (so sorrry... I forgot the name).  Both were appetizers and both were deliciouso.  :)\n\nWe shared a meal.  It was the Avocado Skillet ribeye.  We had it made medium well and again it was very delicious.  \n\nThis place is located in New York New York Hotel.  Place is nice and well kempt and our waiter took a picture for us...twice.  Nice vibes and the price was reasonable.  Food portions are perfect."
        }, 
        {
            "index": 339, 
            "rating": 4, 
            "review": "Excellent place for Mexican food.  Very loud most of the time mainly from music and the roller coaster running overhead and it's close location to the casino floor, but no problem for us.  We first tried this place over 15 years ago and have been coming here every time we visit Vegas.  Food and service have been consistently excellent over the years.  Complimentary chips and salsa are no longer provided.  You are now charged for them.  I tried their new carne asada street tacos and they tasted great. You can substitute refried beans for black beans.  Wife ordered a two beef enchilada combo which she said was great as always and served hot, very hot. She had a Mojito which was awesome!  We loved it, kids loved it, everyone happy."
        }, 
        {
            "index": 340, 
            "rating": 5, 
            "review": "I had the King Crab/Shrimp Chile Relleno. It was one of the best meals I have ever had.   We were a party of 6 and EVERYONE loved their food. Highly recommend."
        }, 
        {
            "index": 341, 
            "rating": 5, 
            "review": "Love the food here.  Chips and salsa are delicious, and the service is really quick as well."
        }, 
        {
            "index": 342, 
            "rating": 4, 
            "review": "So I was craving some Mexican food while in Vegas and looked for somewhere that was nearby that had great reviews ... I found Gonzalez Y Gonzalez.  \n\nImagine my surprise though when I discovered that this place is in the New York New York hotel.  \"Isn't hotel food usually sub par?\", I thought to myself.  \"Hmm, let's find out!\"  Yes .. I have conversations with myself ... any who ... \n\nSo we were seated and the waiter came out immediately.  The down side, you have to pay for chips and salsa here, it's not free like back home.  Ok, no problem.  The salsa was VERY good so I was glad that we ordered it and the chips.  \n\nI ordered the grilled fish tacos and a skinny margarita ... OMG the fish tacos were probably the best I have EVER had!!  The skinny rita was good, too, and I again was pleasantly surprised that it actually gave me a buzz because they usually do not at other places.  \n\nMy daughter had the margarita with red bull it in ... meh, tasted like red bull, which is fine for staying up and being buzzed, but not sure about having it with a margarita.  LOL. \n\nOverall, good food, good service, and easy access to my hotel!  If ever in Vegas again, which I will be next year, I'll definitely stop in!!"
        }, 
        {
            "index": 343, 
            "rating": 5, 
            "review": "The servers were all very attentive and informative. I had the potato and cheese tacos whilst my husband had the loaded nachos. They were both incredible. My tacos were deliciously cooked and there was just enough of them. The price was pretty comparable to all other restaurants in this area. We paid $35 total for the tacos and the appetizer portion of nachos which was enough for us. It was clean and wasn't too rowdy. Thoroughly enjoyed it."
        }, 
        {
            "index": 344, 
            "rating": 3, 
            "review": "Ate here for lunch on a weekday with my wife.  It was good.  Very good prices.  Free chips and salsa.  The salsa had a unique taste, but I really liked it.  We both ordered the chicken burrito off of the lunch menu.  Great portion size.  I really liked it, but my wife didn't like the sauce that was on the burrito.  I agree the sauce could have been better, but it wasn't bad.  I had no problems cleaning my plate.  The service was a little slow however.  It seemed like there was only one waitress working the tables that day."
        }, 
        {
            "index": 345, 
            "rating": 4, 
            "review": "Coming from Austin, TX, I eat Tex Mex all the time and I've very critical when I find it elsewhere. Gonzales Y Gonzales @ NYNY gets it right. I decided to go all the way with this dining experience and I ordered chips and salsa as an appetizer, chicken fajitas for my entree (my pickiest dish) and their Partron Perfecto margarita.\n\nThe chips were decent, obviously not house made, but not poured out of a Totino's bag either. The salsa was nothing to write home about, but neither was it bland and they also gave me plenty of it. My margarita was excellent, neither too stiff nor watered down; expertly made and delicious. The fajitas were always going to be the kicker in this deal though. Even in Austin I'm picky about fajitas, but outside of Texas I rarely find any I like. These fajitas, I liked. They weren't burnt, the marinade on the chicken wasn't overpowering or non-existent, and they tasted like fajitas are supposed to taste. Also the fajitas came with 4 tortillas! I thought fajitas only ever came with 3. Maybe this was just Vegas excess.\n\nAlso, as an honorable mention, even though the restaurant in inside New York New York, and I sat on the \"patio\" the ambiance was lovely. The sidewalk theme of the casino's casual dining area actually worked rather well."
        }, 
        {
            "index": 346, 
            "rating": 3, 
            "review": "Rimelig meksikansk måltid med god smak. Ikke noe fancy. Gode drinker. Minus for mye støy og mange tver med sport."
        }, 
        {
            "index": 347, 
            "rating": 5, 
            "review": "If there was a 10 I would rate them a 10. Joe the bartender is awesome, makes the best drinks and is super friendly. Come check this place out you won't be disappointed."
        }, 
        {
            "index": 348, 
            "rating": 2, 
            "review": "I wasn't particularly crazy about this place. I got a veggie quesadilla and was not thrilled with the taste. The black beans tasted funny as well. I was also a little disappointed that chips and salsa for the table was $3. Almost every other Mexican restaurant I've been to offers them for free. One thing that I really did enjoy was the restaurant's decor. There was so much to look at. I wouldn't come back."
        }, 
        {
            "index": 349, 
            "rating": 1, 
            "review": "Yet another place for tourist slop.\n\nAwful food. Awful service. Not much more to be said.\n\nI could melt Velveeta and dump some chili powder in it, but I wouldn't call it chili con queso. The enchiladas were a wet mess of shredded chicken and zero flavor. The salsa was equally bad. \n\nI couldn't complain, as our waiter never returned to ask. We had to hunt him down to even place an order in the first place. Maybe he was wrapped up with the one other table having lunch."
        }, 
        {
            "index": 350, 
            "rating": 3, 
            "review": "Meh, I didn't eat here so I can't attest to the food, but I didn't have a pretty mean margarita. The server was a little sketchy and the decor a little frightening (creepy fat people paintings... weird!) but overall it wasn't an unpleasant experience."
        }, 
        {
            "index": 351, 
            "rating": 2, 
            "review": "Ok people, you want a real review from a real mexican from southern cali? Here's the scoop....... this is very very mediocre mexican food!!! I'm giving it 2 stars only because it was ok & not disgusting. I was there a couple wks ago for the 1st time & was dissapointed :-( I had cheese enchiladas wth rice & beans. Let's start wth the enchiladas, the sauce was ok, I think they use las palmas canned salsa, which is definitely not 5 stars. The rice seemed to come from a pouch that reads \"spanish rice\" and the beans were merely edible. I don't c the hype about this place at all. Also, the service sucks!!! I wanted to sit wth my frnds at a little side table next to the restaurant so the hostess told me to order my food to go frm the bar. I walked over & waited while the bar waitress chit chatted wth a couple of guys. The heffer completely ignored me 4 a few mins till I waved at her. She clearly saw me but didn't want to be bothered while she flirted wth the guys. Anyway, its way overpriced (mine was compd wth my mlife points luckily), food sucks & the portions are actually small. Don't eat here! Instead go to a buffet, they have better mexican food there & u get what u pay for."
        }, 
        {
            "index": 352, 
            "rating": 4, 
            "review": "I was craving for Mexican comfort meal so bad. We went to New York New York to pick up our show tickets, decided to eat at Gonzalez, we had drinks there last time, it was good, I figured the food should be good too. Turned out I was so right! Delicious large portioned Mexican food, so yummy! \n\nI ordered a huge frozen mango margarita, it was fairly strong, but a little too sweet like all frozen drinks here in Vegas. Loved their salsa, so spicy! Just what I needed, chips & salsa are not free, it's $2.50. \n\nI ordered tableside crab guacamole to start, it came with flat bread and chips, so fresh, spicy and flavorful! A huge bowl that could easily feed up to 4 people, we couldn't finish it all of course! \n\nHubby had a soup to start, he said that soup was for hangover, I wanted to try some, but I saw pork in there, no... So I just had the diced tomatoes and lettuce that came with it. \n\nI had grilled fish taco as entree, 3 small tacos with guacamole, radish, beans and rice: the fish was very tender and flavorful, so delicious. \n\nHubby had steak fajita: the steak cooked perfectly to medium close to rare, tender, yummy with enough flavors, I loved the beans and rice came with it, hubby loved the tortilla! \n\nOf course I had to have desert, ordered fried ice cream, it was a bomb, a huge bomb! The cinnamon sugar bowl was so crispy and sweet! A great sugar fix! \n\nLoved the decor and ambience of this place, very relaxing and chill, we got seated outside the main restaurant, it was better than sitting inside, we took our time to enjoy our big comfort meal, it was fun! Our server was very attentive and polite, we asked how was business, he said it was the busiest day of the entire week? I was surprised! Why, I love the food and service here, and the tab was only $85, much more cheaper than other restaurants in Vegas! Well, I plan to come back anyways! \n\nA great place for margaritas and big comfor Mexican meals! \n\nGreat late lunch, I was sooo full, but very satisfied!"
        }, 
        {
            "index": 353, 
            "rating": 3, 
            "review": "I recently revisited GyG for Sunday lunch.  Though we had a long wait (even though there were plenty of empty tables) and there was only one bartender (during the NFC Championship game), I felt the need to update my review to 3 stars. Food was much better this time. And chips, salsa, and table side guac were excellent.  Our server, Chris, was very friendly. So- good job, GyG...whatever you changed over the last year worked.  Now work on your scheduling of staff. \n\nThat's all."
        }, 
        {
            "index": 354, 
            "rating": 2, 
            "review": "This was our default restaurant every time we visit Vegas until last time.  To summarize,  food and location stays great as always but the service from host needed improvement.  When the host obviously missed who's next in the line and denied an empty booth when requested meant two strikes in one day and Gonzalez is history for us."
        }, 
        {
            "index": 355, 
            "rating": 4, 
            "review": "Great food for the money, the best salsa and chips anywhere, but the best thing is Joe the bartender is back. with great service, great margarita's, and a fun atmosphere."
        }, 
        {
            "index": 356, 
            "rating": 3, 
            "review": "Alright: Nothing amazing happened here. The seating was ok. Not a very new restaurant. The service was good. The food...eh. it was just a little too bland for Mexican. Probably won't be back. Nothing exciting."
        }, 
        {
            "index": 357, 
            "rating": 4, 
            "review": "Food excellent. Chimichanga very light shell and stuffed w shredded beef. Fried but no greasiness. Wife's pork tortas also exc. but worst margarita i ever had. Watered down mix and alcohol. $9 for water with little mix or booze. Get the food, avoid margarita"
        }, 
        {
            "index": 358, 
            "rating": 4, 
            "review": "The wings are the best here! A good combination of spicy and sweet. \nEverything is pretty good. Semi overpriced but good really affordable lunch specials, only offered during the week, so I was lucky to eat there on a friday. I would wait to purchase any margaritas outside of this restaurant. You can go upstairs in NYNY and get a cheaper Margarita at the bar outside of Coyote Ugly."
        }, 
        {
            "index": 359, 
            "rating": 3, 
            "review": "Average Mexican food, nothing special.  I had the chile rellenos which were decent.  I'm not used to paying for chips and salsa.  $4 is a little steep for what should be complimentary.  Chips were straight out of a bag.  Salsa was pretty good.  Overall, one of the better values at New York New York."
        }, 
        {
            "index": 360, 
            "rating": 4, 
            "review": "Let's start first with the salsa and chips the mild salsa is amazing has a bit of a kick. I ordered the coco Loco very delicious I would definitely recommend if you love Malibu and coconuts. We ordered the adobado shrimp tacos the sauce was very good but was disappointed by the size of the shrimp very small. The rice and beans were ok. What really wowed me was the chip and salsa and mixed drinks would come back just for the salsa and chips. Our waiter was checking on us constantly and was very friendly."
        }, 
        {
            "index": 361, 
            "rating": 5, 
            "review": "Ok, so looks like there are two categories of reviewers here, people either love this place or hate it. I am definitely the former. We were staying at NYNY and this is hand down one of the best parts of the experience. We ordered the guacamole (which they make in front of you. Cool! And that taste that you can't quite place in it? Cilantro) and as entrees the tacos, wet burrito and chimichangas. Our server, I believe his name was Alphonso, was so nice, the service was excellent! It is expensive but I honestly felt it was worth it. My dad ordered a whiskey and it ended up being something like $15, so that was a but of an \"oh ok,\" but other than that it was great. Highly recommended if you're in Vegas and in the mood for mexican!"
        }, 
        {
            "index": 362, 
            "rating": 3, 
            "review": "Yes, the NyNy is cute as are all the restaurants on the \"city streets\".  Service was good but the food was not outstanding.  Ordered the specials (steak and chicken/shrimp enchilada) and didn't compare well to our small town Mexican restaurant.  They did come with \"free\" Marqueritas but never easy to tell the tequilla content in these."
        }, 
        {
            "index": 363, 
            "rating": 4, 
            "review": "Joe was my bartender/server, thanks Joe. Very friendly and willing to help. Checked in often. My main critique of his service, which may be due to the restaurant owner(s) or his boss's required service attitude, was that he tried too hard to sell me extra stuff.  It felt like I was at a corporate must-sell-and-mention extras place, which is off-putting. Once Joe started talking to me about other (real life / experiential) things, I felt much more at-ease and like a normal human or friend.\n\nFood was great, NYNY was the first casino I ever stepped foot in (10+ yrs ago), and I happened upon this restaurant and its spicy shrimp tacos... I've been coming back every trip since. In this case, I thought last visit had spicier and more flavorful sauces in the tacos, but it was still tasty. Yum. Will be back."
        }, 
        {
            "index": 364, 
            "rating": 4, 
            "review": "I can only give this place 3.5 stars cause I didn't order any food and that's my bad. I was looking for quick drink nearby the Zumanity theater and this place had a walk up bar...perfect. I ordered couple of Margaritas...Ultimate and couldn't believe they were only 9 bucks a piece. Of course I assumed that it will be watered down but no. I watched the bartender pour a good amount of tequila in both of my drinks and they were pretty potent. Needless to say I felt very tipsy but sexy and ready to experience Zumanity :)  I have to try the food next time but the a couple beside me ordered some chips and guac and looked damn good!"
        }, 
        {
            "index": 365, 
            "rating": 4, 
            "review": "A resturant in the same building as your hotel room. Yes you just died and went to heaven. I love Mexican food, and I was super excited to eat here. The decor was nice, very mexican-ish. The service was eh okay. Not good-not bad kind. I enjoyed the chips and salsa. I order tacos, they were done pretty well. I don't really have many complaints for a place I didn't have to really walk to. I suggest you try them out. Order a beer and some tacos and enjoy yourself, you won't be dissatisfied."
        }, 
        {
            "index": 366, 
            "rating": 4, 
            "review": "It's a little bit hidden in New York New York casino, but it's a gem.  The drinks are strong and the portions are both high-quality and generous.  Our waitress was also very friendly.  \n\nI would recommend sitting on the \"patio,\" which is still inside (there is not exterior patio), but you get to look at the NY NY roller coaster and \"sights,\""
        }, 
        {
            "index": 367, 
            "rating": 1, 
            "review": "Do you want to dance? Do you want to sit on a table? You better spend $400 or more to be treated like a human being....you better believe it!!!! My husband and I are salsa dancers,  but we left like there is no tomorrow...this place is NO place to spend your money! Trust me...better go out and gamble! You'll be better off"
        }, 
        {
            "index": 368, 
            "rating": 2, 
            "review": "Food bland, they made us Guacamole because if the reviews, but we had to ask for lemon and we also put extra salt.   Would not go back."
        }, 
        {
            "index": 369, 
            "rating": 5, 
            "review": "I found this place by accident.  But let me tell you the food is first class and so are the drinks.  JOE at the bar made a mean margaritas.  And Caesar made a wicked quacamole.."
        }, 
        {
            "index": 370, 
            "rating": 4, 
            "review": "Crab guac was tasty. We got it without the bacon for some reason. Chips and salsa were also delish. The beef chimichanga was ok. The sauce is kinda weird- like sweet in a way, not what I was expecting. The carne asada street tacos were very good and I would definitely recommend them and order them again."
        }, 
        {
            "index": 371, 
            "rating": 5, 
            "review": "I was there Saturday late night! The DJ gets down playing awesome dance music. Drinks are inexpensive and best of all no cover charge. Great atmosphere. The restaurant turns into a nightclub from 11-4am. I totally recommend it to anyone visiting Las Vegas. It gets pretty packed tho. Overall fun place."
        }, 
        {
            "index": 372, 
            "rating": 5, 
            "review": "**This review is ONLY for the Gonzalez nachos and El Grande Helado! \n\nWe came back to our hotel after a Cirque Du Soleil show and wanted a nighttime snack so we settled for this place. \n\nThe Gonzalez nachos were FANTASTIC - some of the best nachos I've ever had! Nothing was too overwhelming and I found myself digging in despite my pretty full stomach. It was huge and great to share among the 3 of us. Not only were the various toppings really fresh, plentiful, yet not too heavy, but the chips themselves were really delicious. \n\nEl Grande Helado is basically a giant ball of dense and creamy vanilla ice cream deep fried in a flaky cinnamon shell served with deep fried cinnamon pita strips.... It's death but SO unregretfully amazing.. My parents don't have much of a sweet tooth so I ate basically the whole damn thing. I normally don't like fried ice cream because the fried shell distracts from the ice cream, but in this case, the shell was thin and flaky like cereal and offered great texture to the dish! And of course, how can fried cinnamon strips with vanilla ice cream not be amazing....\n\nThese two dishes were the best things I ate at Vegas, and I've been trying tons of places! I don't know how the rest of the food here is, but definitely come in if you wanna try the appetizers and desserts. :)"
        }, 
        {
            "index": 373, 
            "rating": 3, 
            "review": "Stopped by about 10pm on Saturday to grab a late dinner before heading out for the evening. We were greeted and seated quickly, but the service kind of went down hill from there. Our waitress didn't even  bother to make eye contact as she slid our chips and salsa onto the table and kept walking. She came back and took our drink orders, still not even a \"hello\" or \"how's it going?\".\nAnyhow, we place our drink/food orders and enjoyed the very tasty chips and salsa. I ordered the Tacos Al Carbon, the chicken was very flavorful, the steak, not so much. Everyone else seemed to enjoy their plates. I had a margarita on the rocks ($9.51) yet couldn't even taste the tequila...bummer. The rest of my party had only ordered sodas/water, none of them were offered refills. \n\nOverall, the food was good. The margarita was disappointing and the service left something to be desired. This place serves the purpose of filling you up with some decent food at a reasonable price, but other than that, don't get your hopes up."
        }, 
        {
            "index": 374, 
            "rating": 2, 
            "review": "2.5 stars, but rounded down based on taste and value.\n\nBasically, this restaurant was just easy to sit at yesterday, versus the over-crowded ESPN Center. \n\nThe menu looked decent enough, but when the food came out, it was pretty unexciting and unimpressive. The taco/burrito/enchilada combinations will be sure to affect you later in the day (if you know what I mean). My steak salad had good steak, but sad salad. \n\nFree chips and salsa!"
        }, 
        {
            "index": 375, 
            "rating": 4, 
            "review": "we've been here one other time about 3 plus years ago and decided to come again for lunch.  we were the first and only ones in at 11 am.  i really wish more restaurants would open earlier than 11 am because i like to eat early lunches.  chips and salsa were good.  its a roasted darker salsa which i enjoy.  i like this place because i like americanized mexican food in big portions and not pretentious or fancy and ridiculously expensive.  my enchiladas were filling and tasty, and my wifes tacos were good.  so to me it really hits the spot.  its reasonably priced, good service, and its in new york which is always enjoyable to go visit."
        }, 
        {
            "index": 376, 
            "rating": 2, 
            "review": "Service was friendly but the carnitas I had looked like they were 5 days old. For those that dont know how carnitas should look just imagine pulled pork they are almost identical. I dont recommend eating here if you want to get what you pay for. The only reason I gave it two stars is becasue my wife liked there shrimp tacos."
        }, 
        {
            "index": 377, 
            "rating": 5, 
            "review": "Hands down the BEST table side guacamole EVER!!!!  Wait staff was very nice and the food was great."
        }, 
        {
            "index": 378, 
            "rating": 5, 
            "review": "Best fajitas anywhere!!!  Get it with the Ultimate Margarita. For the margarita ask for a splash of orange juice! The service is great and the place is clean. I recommend eating here if you are visiting. If you are a local like is then you probably already know about this place!"
        }, 
        {
            "index": 379, 
            "rating": 5, 
            "review": "This was a great restaurant! My husband and I were a little hesitant to eat here because we are really picky about our Mexican food, but I am glad that we did! The service was good and the food came out fast. We were only looking for a late night snack. I got the steak nachos, and they were excellent. They had a lot of cheese, beans, and good quality steak on them. My husband had their chicken tortilla soup and he loved it, I tasted it and it was really good a flavorful. Their prices were really good for what you get. I would definitely recommend going here if you are in the mood for good Mexican food."
        }, 
        {
            "index": 380, 
            "rating": 5, 
            "review": "Stumbled across this place... literally. Came to NYNY to go check out Coyote Ugly and saw this was a cute little dance bar & grill .  Saturday night they had merengue/bachata, no cover, cheap drinks (for LV).  It was a blast!  Great vibe, pretty people!  I danced the night away and never made it to Coyote Ugly! Def check it out if you want to get away from the high cover nightclubs."
        }, 
        {
            "index": 381, 
            "rating": 4, 
            "review": "I really only go here for Pozole (hangover cure) after a night of partying.  It's really delish and so is the handmade guacamole.  Service is usually good too.  Decent prices and nice atmosphere."
        }, 
        {
            "index": 382, 
            "rating": 4, 
            "review": "Stopped by here on the way to the roller coaster in NYNY for some Raspberry Margaritas para llevar.  Drank them while we waited in line.   Great idea, definitely need to go double fisted as the line is semi-long."
        }, 
        {
            "index": 383, 
            "rating": 5, 
            "review": "Great food. So delishious. Ask for Nicola he was the boom. He had great food and drink suggestions."
        }, 
        {
            "index": 384, 
            "rating": 4, 
            "review": "Ran into this restaurant while walking around New York New York Casino during happy hour. They did have a small happy hour menu however I don't eat meat so it didnt help me. They have buy one get one free margaritas during happy hour. I got the portobello mushroom to tostada that comes with black beans. It was really good. My mom got the chicken tostadas from the happy hour menu, that she enjoyed. The service ws pretty slow however it appeard that our waitwr was the only person working the floor at the time. I  would return."
        }, 
        {
            "index": 385, 
            "rating": 3, 
            "review": "This was and OK stop after a night of drinking. Tamale bites were disappointing. It was very loud. Chips and salad and margaritas were pretty good."
        }, 
        {
            "index": 386, 
            "rating": 4, 
            "review": "We were staying in the New York-New York Hotel, so this restaurant was right below us. This was actually the first place we ate at on our trip to Las Vegas.\n\nThe serivce here was beyond what I expected. There was a Raider/Saints preseason game on TV, and we my chick and I sat at the bar. Wanted to sit down, have a beer, watch the game and relax. Especially after the 3 and a half hour drive over here. The bartender who took our orders, I think her name was Heather, she was a real Cool chick. She was from Denver and told us how much of a Broncos fan she was. I Love It when a chick knows her shit about football! Actually kind of a turn-on.......\n\nAny-who, LOL.\n          I ordered a Negro Modelo, and my chick had a Mango Margarita. They use Patron Silver, which gained some points from me. Bartender actually gave us an extra one for free. Which I gladly drank. Our appetizer we shared a chicken tortilla soup, its been a while since I had a bowl of this stuff, and I was shocked on how tasty this soup was, We both agreed that this soup was very flavorful. Highly recommed this soup if your looking for a lil snack. \n\nFor our entrees, I ordered the Barbacoa Chimichanga. Very good flavor, meat was perfect, came with rice & beans and some guacamole. My chick had the three tacos, two beef & one chicken. Nothing amazing about them from what she said. \n\nNothing negative to say about this place. Food was good, not too expensive (Mexican Food should never be expensive), the people passing by streets that look like New York is Awesome, but the thing that impressed me the most by this place was the service. Of course the bartender was cool, but everyone else that worked there was just as cool & hard working. The gentleman who brought us our food was polite and you can tell this guy works his ass off for this place. From asking for more limes for our margarita to the sour cream for my Chimi, this places service was what I'll remember from here at New York-New York."
        }, 
        {
            "index": 387, 
            "rating": 3, 
            "review": "Basic margaritas and \"Mexican\" food. We opted to avoid the margaritas and went with a basic cosmo and a tanqueray and tonic. Both good choices, strong and well mixed. \n\nStarted with the chips and salsa which came with two salsa varieties: a red, smoky salsa and a green and rather spicy salsa. The chips were warm and salty (just the way I like them). We asked for more of the red salsa because we loved the smokiness of it. The waiter, Raymond, obliged and was very courteous to us. \n\nSince we were heading to a show, we ordered a couple of appetizers instead of full entrees. Got the shredded chicken taquitos and an order of the table-side made guacamole. Both were good choices, in fact, the guacamole was perfectly seasoned. \n\nAll in all a good choice, fairly inexpensive, and decent service."
        }, 
        {
            "index": 388, 
            "rating": 4, 
            "review": "We came here for lunch last week.   The hostess was very courteous and sat us down immediately. Our waitress was very courteous and prompt as well.  The meals are reasonably priced.\n\nWe had the Carne Asada street tacos, chile relleno, green chile cheese enchilada, red sauce cheese enchilada, rice and beans, a house margarita, cold beer & my kids had a chicken finger kids meal and lemonade.\n\nHands-down the Carne Asada was the best and the meat has a good marinade and it is good quality meat and delicious.  The Margarita was good and my husbands beer was very cold.  As for the rest of the food, it was fresh tasting & ok.  To be honest, the food is comparable to El Torito chain restaurant.  The only exception was the kids chicken fingers--they were blah and appeared to be previously frozen.  \n\nThe restaurant is very quaint with very neat Mexican Decour and we really enjoyed having lunch here.\n\nWe will definitely stop by here again on our next Vegas trip for carne asada tacos and refreshments!"
        }, 
        {
            "index": 389, 
            "rating": 5, 
            "review": "I know I've only checked in here twice, but I've been at least 10 times. It is a must-do on my list every time I go to Vegas.\n\nGood Mexican food, great chips and salsa, good margaritas, great sizzling fajitas, and nice pozole soup. It is easy to get to (NY NY food area) and the staff has always been great.\n\nHighly recommend if you're a fan of the food style!"
        }, 
        {
            "index": 390, 
            "rating": 2, 
            "review": "In a city overflowing with food options, from the all-you-can-eat buffets that range from excellent to mediocre to the $1.99 shrimp cocktails to the Michelin-star fine dining experiences, this place falls flat on its face.  \n\nWe came in here after a long, long day of boozing and traipsing up and down the Strip.  We found ourselves here later in the evening and instead of being, \"well, what do you want?\"  \"No, what do you want?\"  We decided upon this place \"just because\" and of all the places we ate at, w/the exception of the Victorian Cafe at the old Barbary Coast, this was the most unimpressive of all our meals.  \n\nThe food here is atypical of any \"tex/mex\" eatery, as in On the Border or Jose Teja's, but I didn't leave here with my clothes and hair smelling of the place, so that bumps it up a star, and being in close proximity to a toilet doesn't hurt, either. \n\nYou will leave here with a burrito hangover, I assure you, if that's what you are looking for - so uninspiring, I almost forgot I ate here."
        }, 
        {
            "index": 391, 
            "rating": 3, 
            "review": "The carnitas were ok. Someone else made a comment that they tasted like they were cooked bad and reheated....I agree with the reheated part as the meat was a little tough."
        }, 
        {
            "index": 392, 
            "rating": 1, 
            "review": "Honestly one of the worst Mexican food I have ever tasted. Ordered the portobello mushroom toastado which tasted so bad. The marination of mushroom with chillelime had a very strong pungent flavor. They charged us for the chips and salsa which we thought   was complementary and was not informed that it wasn't for free! Salsa tasted like a store bought one. I wish I had tried any other restaurants near by!"
        }, 
        {
            "index": 393, 
            "rating": 4, 
            "review": "I visited Gonzalez y Gonzalez both times I was in Vegas.  the first time was just chance, we were hungry,  it was there.  But, the delicious food, good service, and beverages brought us back the second time! The restaurant has an atmosphere of fun and excitement, exactly what you want in Vegas!"
        }, 
        {
            "index": 394, 
            "rating": 5, 
            "review": "Just eat here!\n\nI needed a last minute place to eat after my wedding for 18 people. After three days of searching I found Gonzalez Y Gonzalez and it was perfect. I showed up before they opened and chatted with a server and then the manager. Both were incredibly helpful and had everything set up perfectly for our wedding party. I honestly couldn't have been happier! The food was great and the prices were better than anywhere else."
        }, 
        {
            "index": 395, 
            "rating": 4, 
            "review": "We took tequila shots and had few drinks and finished by sharing two different nachos on the menu and was plenty! The entree nachos were amazing and were individual chips piled with lots chicken cheese and guac, my favorite. The nachos on the appetizer menu were just a pile of nachos with TONS of toppings, we actually had toppings left over with no chips to put them on!"
        }, 
        {
            "index": 396, 
            "rating": 4, 
            "review": "I used to go the the Gonzalez Y Gonzalez back in the actual New York City and have the pozole at least once every 6 weeks. It's unfortunate, but they took it off the menu here. Maybe it's because visitors to Las Vegas who stay at the New York, New York don't \"get\" what pozole is.\n\nSo.\nThere's tortilla soup instead.\n\nBut I'm not sooo disappointed because each time I've come here the staff has been friendly and efficient. The food is basic mexican but it's done consistently well. The tilapia tacos were seasoned enough to please me and also my 2 year old. The enchiladas and tacos were simple and tasty. Chips were light and the salsa smokey and spicy.\n\nIt's kid friendly and good for big groups. You're not going to get anything out of the ordinary here but you don't have to leave the Strip to get decent Mexican food."
        }, 
        {
            "index": 397, 
            "rating": 5, 
            "review": "Very good! Food is very good! Fajitas and carne asada tacos are the way to go!\nStaff is very kind and friendly and funny! I definitely recommend coming here :)"
        }, 
        {
            "index": 398, 
            "rating": 1, 
            "review": "Not good \"Mexican\" food at all. You deserve better! \nServers were friendly but food left much to be desired.\n\nWorst salsa ever. Carrots and peas in the \"Spanish\" rice...really?\nBurrito was bland and not Mexican! I want to see its papers! \n\nIf you have a jones for Mexican in Vegas, wait til you get to California. If you're looking for a good place to eat on the strip, find somewhere else! \n\nWhile you're sitting on the patio or in the restaurant trying to eat your meal, you're reminded that NYNY built a rollercoaster through the hotel/food area. So every 10 min a group of SCREAMING youngsters go by. Happy digesting on that one."
        }, 
        {
            "index": 399, 
            "rating": 5, 
            "review": "Great place where we go every time in Vegas.  Authentic food, great drinks at a fair price and happy hour specials.  One of the secrets on the strip.  We didn't spend a lot on drinks and food for a large group and the service was awesome!  Will be back next time in Vegas!"
        }, 
        {
            "index": 400, 
            "rating": 3, 
            "review": "If you're coming here for a margarita, congratulations. Spend the $15 and get the yard margarita on the rocks (name escapes me, evidence of a good night in January). I don't know if it was because it was off season or the bartender was quitting or something, but he made our yard margaritas with GOOD tequila. It wasn't just a dash, either. He used one bottle to make both our drinks. Yes, ladies and gents, I was walking around Vegas with half a bottle of tequila in January. Happy times, happy times. The guacamole was good, the chips were salty. Just like a pre-tequila fest should be. Don't remember the food too much...probably worth noting that it wasn't memorable.\nSeriously. Get that drink. You won't need to order anything else during that night. It's something magical."
        }, 
        {
            "index": 401, 
            "rating": 5, 
            "review": "Hector was super. It is a must place to visit when in Vegas."
        }, 
        {
            "index": 402, 
            "rating": 5, 
            "review": "Freaking awesome delicious food! Clean. Fast service. Gi Gi (Genet) was an AMAZING server! Thank you so much!"
        }
    ]
}