{
    "category": "Las-Vegas", 
    "entity": "Joyful-House-Chinese-Cuisine", 
    "avg_rating_stars": 3.6972010178117047, 
    "review_count": 393, 
    "reviews": [
        {
            "index": 1, 
            "rating": 4, 
            "review": "Was here about midnite on a weeknight:\n- Went with the $18(?) bbq combo platter app.  Options were pork, duck and jellfish and I went with the first two.  Don't know how they do it, but the pork & duck were flavorful.  \n- It's a nice restaurant and an upgrade from the typical Chinese restaurant service/decor, and the menu prices seemed to reflect that.\n- Definitely a good choice to eat a nice Chinese restaurant off-Strip."
        }, 
        {
            "index": 2, 
            "rating": 5, 
            "review": "By far the BEST chinese food in Vegas! I love everything and everything on the menu. Two dishes that could eat eVery single day never get tired of it. Salt and pepper pork chops/ green beans with xo sauce. The salt and pepper pork chops are no words describe except need too try it. It crispy on the outside with prefect light crispy type batter, the inside is spot on moist, and the flavor there sooo much depth. U bite into crispy outside crust then hit moist spot on cook pork chop and combine it with salt/pepper flavors. Divine. The string beans with xo sauce can say EXACT same thing feel eat it. The greens beans nice green, fresh, spot on cook bean that snap into them, and the sauce that the key nice spicy but not too much. I also like their mongolian beef, and any of noodle dishes are excellent! \n\nThe waitress sometimes hit or miss keeping up with your drinks being filled. Overall never had problem with the waitstaff."
        }, 
        {
            "index": 3, 
            "rating": 4, 
            "review": "My family has been coming here pretty much since we first moved to Vegas 15 years ago.  It's a regular staple and relatives from out of town know how much we love the place because we always bring them here.\n\nThe food has changed somewhat since we first started coming, probably due to some sort of change in management or in the chef, so dishes haven't been entirely consistent.  However, overall, really solid Chinese food that brings us back year after year."
        }, 
        {
            "index": 4, 
            "rating": 5, 
            "review": "Once again we are back in town and enjoying our favorite Chinese meal:\nSteamed eggplant with garlic and Singapore rice noodles. So glad we have a \"go to\" place!"
        }, 
        {
            "index": 5, 
            "rating": 3, 
            "review": "I was married to a Chinese guy before, and we would eat here frequently. They would bring us complimentary soup before our meal and bean dessert at the end. Well, I discovered if you're not \"Chinese\" you can forget about it! I even asked them for soup and the waiter said,\"You never order!\". Whatever!\n\nI did the ordering for 8 of us. I ordered deep fried flounder with garlic sauce (very good), orange chicken (for the kids), salt and pepper pork chop (soggy), fillet mignon w/ portabella mushrooms (salty and mushrooms was under cooked), beef chow fun (good), salty fish & chicken fried rice (cooked perfect), and snow peas and water chestnuts (not my favorite).\n\nOur order arrived very quickly, but the serves were all stone faces. My mom whispers over, \"The waiters aren't very joyful\". That was classic. The wait staff receives a C- grade for blah service.\n\nThe food was tasty and extremly filling, but we did a great job putting it down. The flounder was on special for half price $20. My bill was $139 including tip, for feeding 8 people it was a win win situation. \n\nThe reason I gave them 3 out of five stars is, the food was over all good, and service was fast. They lacked in personality, friendliness, and they didn't bring us any complimentary soup and bean dessert. I seen the giving the other tables, but why not us? I give them one and a half thumbs up"
        }, 
        {
            "index": 6, 
            "rating": 4, 
            "review": "The Joyful House is one of the few China Town restaurants that I never got around to trying when I lived in Vegas but... on my last trip here, I met some friends there...\n\nIt's good.  And nice inside... and they accommodated our group really well with little complaint.  I'd say 4 star overall except.. for the dish I ordered.  Lucky me, we were eating family style.  I ordered the seabass mushroom claypot which sounded amazing and was the most expensive thing we ordered... but it was toooo fishy tasting.  Everything was great except for my dish.  *cry*\n\nI'd still go back... I don't hold a grudge.\n\nSee ya there."
        }, 
        {
            "index": 7, 
            "rating": 5, 
            "review": "Came here during lunch hour with family and they accommodated us easily.  The family ordered various items but it was my order of beef tenderloin in black pepper sauce that everyone agreed was the most popular.  The beef was oh so tender.  It was moist and soft as cotton and the flavoring was incredible.  I'd have to say this dish really made my day.  Other dishes we tried were salt and pepper tofu (very very good), eggplant in garlic sauce (good but bit too sweet), stringed beans with minced pork (fresh and very tasty) and their wonton soup (standard).  Overall, a memorable dining experience that we will repeat."
        }, 
        {
            "index": 8, 
            "rating": 3, 
            "review": "I really miss my go to chinese places in los angeles,alas Im not in kansas anymore,I have landed in mediocre land. Its not the food was bad it just didnt blow me away,I find myself comparing everything to what i am used to and unfortunately it falling woefully short. The potstickers were super weak,I mean worse then supermarket frozen weak. The BBQ pork fried rice needed flavoring and was a bit on the dry side. The shrimp in lobster sauce was average. The kung po chicken was ok,and the best dish was the mongolian beef a bit of sweet and hot flavor,pretty tasty. All in all it was another just ok experience,my search continues :)"
        }, 
        {
            "index": 9, 
            "rating": 5, 
            "review": "We've been here before and we're always satisfied. Today, Joyful House, you upped the anti. We brought friends here in search of Chilean Sea Bass cooked a certain way. My friend has food allergies. She really enjoys Chilean Sea Bass. We asked that the Sea Bass be steamed plain; no sauces, no seasoning. To add flavor Joyful House offered ginger with scallions. She went for it!.... and loved it....and so did we. She offered to share in her taste bud joy by letting us have a taste. It was very good!\nFor those of you allergic to soy or are going gluten free, this is a wonderful dish that offers just that. My friend is very grateful for the accommodation & sense of humor the waiter provided. Customer service that was very welcoming! Joyful house we will be brining more friends to you when we are back in town."
        }, 
        {
            "index": 10, 
            "rating": 3, 
            "review": "Hostess greeted us immediately. Warm and friendly. Complimentary tea brought to out table quickly. \nOur waitress was less than pleasant. She did not greet us nor did she smile.\nThe food was fresh and very good.I had the general Tso's chicken. There was enough on my plate for two meals plus a midnight snack.My only request was that they make it spicy. They didn't.Oh well, it was still very good.\nI would give 4 stars but wait staff just lousy.\nFood good enough I'll possibly go back but am still looking for a Chinese restaurant with a bar and friendly staff as well as good food."
        }, 
        {
            "index": 11, 
            "rating": 4, 
            "review": "Went here for my sisters graduation because we were all craving Chinese food. One of my sisters friends insisted this place was good so we went. We ordered 3 orders of Honey Walnut Shrimp and that thing disappeared in a heart beat. The food was really good and the service and pricing were just okay. Go here if you are craving good Chinese food. I recommend it!"
        }, 
        {
            "index": 12, 
            "rating": 4, 
            "review": "Wonderful food and service. Recommend the Peking Duck and Honey Walnut Shrimp (amazingly complex yet subtle). Pot stickers were average or below. Excellent alternative to get off the strip and away from megabuck and loud casino restaurants."
        }, 
        {
            "index": 13, 
            "rating": 5, 
            "review": "We tried Joyful House for the first time last night and we loved it.  We had fantastic hot and sour soup, a delicious duck appetizer, and yummy shrimp fried rice.  Our service from Diego was wonderful!  He was friendly, attentive, and knowledgeable. We will definitely return next time we come to town.  This place is a hidden gem."
        }, 
        {
            "index": 14, 
            "rating": 4, 
            "review": "This is definitely my go-to Chinese restaurant in town because it's family-style dining and they serve my favorite dishes. We're usually here with my parents because they love it as well and luckily, my mom has cravings often enough for me to have my fill. We normally order the same dishes when it's the four of us (my parents, Ruben, and myself): Salt & Pepper Calamari (BEST place to order it!), Chicken Chow Fun in Black Bean Sauce (not always consistently delicious, but I love these wide, flat, chewy noodles), Kung Pao Shrimp (my mom's favorite dish; I love picking out the peanuts hehe), Combination Fried Rice (I'm not a fan of their fried rice, but everyone else enjoys it), Chinese Broccoli, and Mapu Tofu (this time I ordered it without meat and it was still good). What a great meal. Honestly, I could come here for JUST the calamari. Very good.\n\nEven with the mostly \"just okay\" service, the food keeps bringing us back. I also appreciate the generous pot of Jasmine rice and the fantastic prices!"
        }, 
        {
            "index": 15, 
            "rating": 4, 
            "review": "This is probably the best Chinese restaurant in town. Highly recommended."
        }, 
        {
            "index": 16, 
            "rating": 4, 
            "review": "Really good chinese. Fried rice was good. The duck was good and very meaty, not overly greasy. Good service. Good Chinese restaurant atmosphere."
        }, 
        {
            "index": 17, 
            "rating": 4, 
            "review": "Staff was attentive. I can't judge too much yet on the first visit so I'll have to update this later. The first thing I noticed when coming in was that this is one of those restaurants that big Chinese families go to to have their huge family dinners. Just wanted to throw that out there.\n\nGot the mandarin pork chops and steamed tofu. Won't be getting those again just cause it's not really my thing. But I can hardly use that to judge the restaurant overall.\n\nI will definitely be back during happy hour to try the many other dishes :).\n\nThey've all been so nice so far."
        }, 
        {
            "index": 18, 
            "rating": 5, 
            "review": "Will always be my favorite Chinese restaurant in Vegas. The portions are giant. This is always my family's go-to place for get togethers or just to have family dinners. Nothing but good memories at this place every visit. My favorite's are the salt and pepper calamari and combination fried rice. I could eat that fried rice for a week straight without getting sick of it."
        }, 
        {
            "index": 19, 
            "rating": 3, 
            "review": "Needing to get away from the Vegas strip for awhile, we searched on Yelp for a good Chinese restaruarnt and our party of 6 decided to come here for dinner.\n\nWe ordered:\n3/5 Spicy hot and sour soup $14.25\n3/5 Imperial peking duck $39\n4/5 Seafood combo claypot with tofu $15.50\n3/5 Eggplant, pork and bamboo claypot $12.50\n5/5 Taiwan A vegetables $11.50\n3/5 Yang Chow fried rice $11.95\nTsing Tao beer $3 each\n\nThe Peking duck was a bit disappointing as the skin was not as flavorful and crispy and the man who filleted the skin did not do a very good job. There were uneven pieces but nevertheless, we got to have Peking duck. The claypots were okay. The sauce was a bit heavy. The stir-fried A vegetables was the best! Over all we had a fun meal but the quality was just okay."
        }, 
        {
            "index": 20, 
            "rating": 3, 
            "review": "I hate posting mediocre reviews but it's hard for me to rave about this place. I went last night with my husband at around 1AM. We were the only people there, which is odd to see anywhere in Vegas but my husband used to come here years ago so we figured to give it a try.\n\nWe ordered  honey walnut shrimp, it was really salty but pretty good. \n\nThe XO Green beans were amazing, I could have  had that alone. \n\nWe also tried the crispy pan fried combo. It was TERRIBLE. The beef and chicken were gray and rubbery. It was completely inedible. The noodles were soggy and not crispy. Thumbs down there. \n\nOverall, I would go back because of the countless 5 star reviews.  Maybe we caught them on a bad night,"
        }, 
        {
            "index": 21, 
            "rating": 5, 
            "review": "Great Food!!! love this place, highly recommend if you want to eat great Chinese food with a good clean atmosphere and excellent service"
        }, 
        {
            "index": 22, 
            "rating": 5, 
            "review": "Just had an amazing dinner there.\nPeking duck 3 courses, live fish and crab!\nOne of the better Chinese quality food in town. Not cheap but really good."
        }, 
        {
            "index": 23, 
            "rating": 4, 
            "review": "Joyful to eat here!  We had our mouth watering for the lobster with ginger & scallions but was told that they only had 5lb lobsters left, way too much for just two people dining. Well maybe we could have finished it (not)!  LOL\nSo we ordered the seafood claypot, combo H.K. Style pan fried noodles, and the garlic spinach.  Food was delicious will definitely come back when in Vegas."
        }, 
        {
            "index": 24, 
            "rating": 5, 
            "review": "Good authentic food. :) my Chinese wife and mother in law (in from shanghai) enjoyed it."
        }, 
        {
            "index": 25, 
            "rating": 4, 
            "review": "The food was good. We went at 7 p.m. for hotpot which didn't start until 10 p.m. We made the drive, so we stayed anyway. The servers were polite, the bathrooms were very nice, and the place was clean. They never brought one of the dishes we ordered, and one that we did receive had extra ingredients that weren't pictured in the menu. We left those with the dishes. Stars are for food and facility. The two-minute drink service after being seated didn't apply here."
        }, 
        {
            "index": 26, 
            "rating": 5, 
            "review": "My family has been coming here for over 20 years. So much to say about this place and so many memories have been made because of the simple fact that they are a GREAT Chinese/American restaurant. My grandfather started bringing my family here and since he has passed we're still keeping that tradition. It's nostalgia everytime I come here with my family, which can make this review seem a little biased, but it's because of the same great food and service that we have had over the years. \n\nDespite what happened recently with the restaurant, my family has been EXTREMELY satisfied and never had any problems whatsoever with the quality of their food."
        }, 
        {
            "index": 27, 
            "rating": 3, 
            "review": "I went here on the recommendation of a friend in the restaurant industry...doubtful I would have ever found the place w/o that.\n\nThe facility is clean and bright with lots of seafood tanks for selecting fresh seafood.\n\nThe staff was friendly, efficient, and helpful.\n\nFor starters I had the Rosy Duck. The meat was tender and flavorful, and the skin was delightfully crisp. The plum sauce was pretty bad...another reviewer described it as \"industrial cleaner\"...which I'm sympathetic to. I'd definitely order this again...but will steer clear of the plum sauce. \n\nFor mains, I had the \"Salt and Pepper Pork Chops\" which many reviewers raved about. The batter and spicing/seasoning of the pork was very well done. Quite crisp and a good balance of salt/heat/batter/fat. The pork itself was quite disappointing though...very stringy, low-quality cut of pork. I would have MUCH rather had 1/2 or even 1/4 of the quantity for a better quality of pork.\n\nFor dessert I had the chocolate Mochi Ice Cream. It was served far too cold. The ice cream was actually chewy....more than a little. If served a bit warmer, it would have been good i think...the chocolate flavor was decent, the pastry wrapper was nicely done...just the temp.\n\nI think maybe I didn't order the dishes these guys do best...next time I'm going to have to try the fresh seafood. Also, the prices were quite reasonable. Appetizer, entree, dessert, and hot tea for $26 in Vegas..that's a pretty good deal."
        }, 
        {
            "index": 28, 
            "rating": 3, 
            "review": "I went here for lunch the other day with some friends. I had the won ton noodle soup which was a little bland. The beef and broccoli was pretty good. We also had pork chops and pan fried noodles with sauce on top and both were also pretty good. Aside from the soup we had a good dining experience. The place was nice and the service was good. I heard that this place is conveniently open late. I may have to try this place when I am out late one night."
        }, 
        {
            "index": 29, 
            "rating": 1, 
            "review": "Terrible! Do not recommend the lunch special. Spicy beef is slimy and the consistency is not normal. As if it's not beef or is the lowest quality available."
        }, 
        {
            "index": 30, 
            "rating": 5, 
            "review": "Finally a Chinese restaurant that is worth revisiting. Thanks Yelpers for the reviews on this one, most of you were spot on for this place. We kept it simple this visit to feel the place out.\n-sweet and sour pork- perfect balance of flavors. The pork was not over coated and had a nice crisp\n-Singapore noodles- thin rice noodles with a pleasant spice. Some shrimp, pork, beef with some veggies including Jalapeño. Very tasty\n- pork fried rice- another excellent dish. \n\nEverything is family style so this is a great place for groups. There were only 2 of us so plenty of left overs. Definitely a return trip"
        }, 
        {
            "index": 31, 
            "rating": 3, 
            "review": "I have had better Chinese food elsewhere (I 'm from the Bay Area), but this place was still a decent family styled Chinese restaurant. Good thing was that this restaurant opened pretty late.\n\nWe got here at around 9 PM, and ordered 5 dishes:\n\n- Wonton soup: which we split into 5 small bowls. Decent\n- Peking duck: was ok. not excellent. A little dry and small compared to other places\n- green with mushroom: The green was quite bitter. Plus, in the menu it was showing baby bok choy. What we actually got was the mustard green, which was misleading.\n- Mapo Tofu: was pretty salty\n- orange chicken: was better than Panda Express, which saved the salty mapo tofu.\n\nCame out $78 for 4 people which wasn't too bad."
        }, 
        {
            "index": 32, 
            "rating": 5, 
            "review": "We had a big group in our family of 13. The food is fabulous and the service was very good. Must have is the Calamari and the Chilean Bass. We will be back again for sure."
        }, 
        {
            "index": 33, 
            "rating": 4, 
            "review": "Heard about this place on food network and saw it had decent reviews on yelp so we thought we would try it out.  We ordered the lunch specials, sweet and sour chicken, spicy beef and chicken chow mien.   Unlike other lunch specials they bring you family style plates of your entrée so you are able to share which we thought was really nice.   The entrée's were delicious, one of the best chicken chow miens I have ever had and I don't usually like chow mien, the beef slices were large and tender and the chicken held its crunch in the sweet and sour sauce the service was also very good.   My only disappointment was the pork fried rice that came with the lunch special it was flavorless and mushy.   I would definitely go there again but will opt for the steamed rice next time."
        }, 
        {
            "index": 34, 
            "rating": 4, 
            "review": "Joyful House is one of my favorite Chinese restaurants in town, and I come here quite often because of it's convenient hours (open til 3 am, I believe), and it's great food.  They have a large selection of live seafood to choose from, all coming from the tanks they have in the middle of the restaurant.  A sign acts as the menu with the prices for the fresh fish and seafood of the day.  They have different sized lobsters, crab, snapper, sea bass, and many others.  Seafood is not all they do well, though.  \n\nThe Mongolian Beef is very good, as well as the Pork Chops with Salt & Pepper.  I also really like their Roasted Duck, which is a huge portion that serves a lot of people.  I usually try to come to Joyful House with a lot of people because their portions are large, making it a very affordable feast for lots of hungry people.  \n\nThe prices are a about a dollar more per item than most Chinese restaurants in the area, but it's worth it with the quality of food you get from Joyful House.  The price might also be attributed to the nicer ambiance you get here.  The waiters are professionally dressed, and the decor is fancier than most places.  The tables are well set, and the plates and silverware are even of good quality.  \n\nIf you're looking for a nice Chinese dinner with a lot of people, go to Joyful House.  Great food, great service, great restaurant!"
        }, 
        {
            "index": 35, 
            "rating": 5, 
            "review": "We went tonight and had Chinese. They were super shirt staffed....that being said, the service was AWESOME!!! Super friendly. All the people working chipped in. The food was super Dee dooper.\nWalnut shrimp....forget about it. \nSweet and sour shrimp....forget about it.\nWhen I say forget about it, I mean, holy sh×× It's good , best bbq pork ever."
        }, 
        {
            "index": 36, 
            "rating": 4, 
            "review": "Had dinner here last night with my swol-mate after an intense gym sesh. The food was pretty good, we ordered the meat sample small (good for two people), fish mau soup with grab meat, honey walnut shrimp, seafood hot pot and kung pao chicken (was ok).\n\nWould definitely go again to try the rest of the menu."
        }, 
        {
            "index": 37, 
            "rating": 2, 
            "review": "This place is clean and they serve good food but I am not sure if I want to go back. The pecking duck is dry and I don't think this is one of the best chinese restaurants in Vegas. It is too expensive but nothing special about the food."
        }, 
        {
            "index": 38, 
            "rating": 2, 
            "review": "Pretty mediocre Chinese food; one of the few times that Yelp reviews have led me astray.\n\nCame here with the GF when we were craving Chinese in LV.  After 40 dollars in cab rides round trip, would have been better off splurging at a strip-based \"signature chef\" restaurant.\n\nFried rice was truly bad.  How do you mess this up?  The brocoli and beef was decent but nothing exceptional.\n\nPerhaps we ordered wrong, but again, fried rice?  There were only a few other occupied tables on Thursday night at 10 pm, implying a recent change in quality here maybe..."
        }, 
        {
            "index": 39, 
            "rating": 4, 
            "review": "A bit of a drive to get to this restaurant from the Vegas strip. We came here on the recommendation of a friend who lives here. We ordered corn soup which was delicious. We moved onto Fukien fried rice, with a light gravy on top. The stir fried green beans were crisp and not over cooked. My favorite was the beef tenderloin sautéed in black pepper sauce.  \nI would eat here again if I were craving Chinese food."
        }, 
        {
            "index": 40, 
            "rating": 4, 
            "review": "Ordered the roast duck from their lunch special (which included egg roll appetizer, corn soup, pork fried rice and soda) plus their combination pan fried noodles. The 2 dishes were not too shabby but I would say that I've had better. This restaurant is nice and clean inside so if you have guests from out of town or business lunch of some sort, this place will do.The service was surprisingly good. I'm asian so I know that asian restaurants care more about how good their food is than service but this one actually surprised me on the good side."
        }, 
        {
            "index": 41, 
            "rating": 4, 
            "review": "Surprisingly good Chinese food in Las Vegas!  I came here recently with my family and this was my first time in Vegas' Chinatown.  It's about 10-15 minutes (depending on traffic) off the Strip.  The restaurant was pretty empty for a Friday night dinner, but don't let that deter you from coming here.  We had the following:\n \n1) Scallops in Black Bean Sauce - Pretty average dish.\n\n2) Pan Fried Chilean Sea Bass in Garlic Soy Sauce - This was the daily special.  It's on their regular menu, but discounted from the regular price.  It's a thick fillet, not a whole fish, and I'd go with this over the scallops.\n\n3) Crispy Fried Dungeness Crab with Salt and Pepper - I loved this dish!  The tempura batter was crisp and the seasoning was not overly salty.  The crab meat was hot and tender.\n\n4) Crispy Fried Marinated Chicken - The crispy skin was fantastic.  The meat was fine.\n\n5) Pan Fried Spinach in Garlic Sauce - Simple and good.\n\n6) Wonton Noodle Soup - Good, but pricey.\n\nI enjoyed our meal and the service was not bad with the exception of my drink order.  I wanted the Hong Kong Style Hot Tea with Cream, but they just couldn't get it right.  First, my drink never came.  We asked for it again and some more time passed before a cold mug of tea was brought out, ugh.  There wasn't even any cream in it!  We sent it back and the manager apologized for the server being new.  They have a lot of drink options, but since I didn't try mine I can't vouch for any."
        }, 
        {
            "index": 42, 
            "rating": 3, 
            "review": "the food and service was hit or miss, i been here numerous times before. it's depend on the night you're there, you can tell the different in the way the food cook, must be the chef. some night i'm there, the food tasted really good, and then there are night that the food tasted awfully oily!!! They are also a bit more expensive than other Cantonese restaurants i have been to"
        }, 
        {
            "index": 43, 
            "rating": 3, 
            "review": "I have mixed emotions about this place.  It's open late, which is awesome.  Food is decent, but nothing fantastic.  Service has always been sub-par.  But somehow I keep going back... hmmm..."
        }, 
        {
            "index": 44, 
            "rating": 4, 
            "review": "If you want good Chinese food served in a nice restaurant with good service this is the place to go off the Strip.  Try the clay pot dishes, chow fun, Peking duck, scallops in black bean sauce or any seafood dish and you can't go wrong.  Service can be inconsistent but the food is \"dynomite.\"  Open late for those of use who get the munchies."
        }, 
        {
            "index": 45, 
            "rating": 4, 
            "review": "This place was REALLY good.  My husband and I ordered the Family Meal B for 2, which came with so much food it could have fed 5!  And it was only $16 per person.   The food was really good too.  It came with hot and sour soup, egg rolls, dumplings, and another appetizer, pork fried rice, chicken chowmein, lemon chicken, and sizzling beef.  Seriously enough food to feed ALOT more than just 2.\n\nAlso, I forgot my credit card on the table and before I even made it out the door the waiter had handed it to me, making sure I didn't forget it. Also, the two hosts of the restaurant came to our table both while we ate, and after to make sure we had enjoyed our food. \n\n Our 2 year old son also really enjoyed the huge fish tanks that had live fish and lobsters (which I'm sure were also on the menu)."
        }, 
        {
            "index": 46, 
            "rating": 2, 
            "review": "Over priced and disappointing. How do you mess up a simple cashew nut chicken? The worst part is, our waiter recommended it. It was extremely bland. Oh and their thai tea tastes like milk. HOW DO YOU RUIN A POWDERED BASE DRINK?!\n\nTwo stars for cleanliness and good service. Food was awful."
        }, 
        {
            "index": 47, 
            "rating": 5, 
            "review": "This place makes me feel like I'm in San Francisco! Enough said. Quality and price are absurdly reasonable! You can get a whole duck prepared for less than a frozen grocery store duck. Seafood is great! You get what you pay for and then some! This isn't panda express or wok #24, this is real deal Holyfield chinese."
        }, 
        {
            "index": 48, 
            "rating": 5, 
            "review": "\"The MSG is strong in this one\" , that's what I expected my fortune cookie to read after tanking 5 glasses of water and 5 cups of hot tea.\n\nBut none the less the food was fantastic.\nHere's what we ordered for a party of 3.\n\nScallop Soup\nHoney Walnut Shrimp (HUGE PRAWNS)\n2 lb Garlic Crab\nPan Fried Sea Bass with Soy Sauce \nSizzling Beef platter\nBlack Bean Clams\nRoast Duck\nChicken Chow Fun.\n\n\nGod. Please forgive me for I have sinned. I am a gluttonous whore and I deserve to have an apple stuffed in my mouth and be roasted over an open flame."
        }, 
        {
            "index": 49, 
            "rating": 1, 
            "review": "Guys, WTF?  Ate here because of the great reviews on yelp.  Ended up throwing away basically all of our food.  The meats were all chewy and grossly over-battered.  It was highly disgusting and mostly inedible.  I blame yelp for wasting my boyfriends $40 and calories on this crap."
        }, 
        {
            "index": 50, 
            "rating": 4, 
            "review": "I was pleasantly surprised with this place. I took the recommendation from yelp. My friends and I came here recently and really enjoyed dinner. We're all Asian and we've been to numerous Chinese restaurants in San Francisco, Orange County, Los Angeles, New York, etc. and this place wasn't too bad at all. Prices were really reasonable and the servers were all friendly. Absolutely no complaints here. We will be back. Great job...joyful time!"
        }, 
        {
            "index": 51, 
            "rating": 4, 
            "review": "Nice clean Chinese restaurant in Chinatown. Large menu and entrees come in pretty large portions. My friend and I had the marinated fried chicken and beef chow fun and they were so tasty we finished all of our food. They don't charge for rice and tea either unlike some of the cheapo restaurants here in town. Most things on the menu are about the same price $9.95-11.95 is average for this place I'd say. But for the portions I don't think it's too bad. It was also quiet because it didn't get too packed while we were there. The employees are very friendly and food seems to come out fairly quickly. I look forward to coming back here in the future to try other dishes"
        }, 
        {
            "index": 52, 
            "rating": 3, 
            "review": "Stopped in for lunch today because of all of the great reviews. I came in by myself and was greeted by a female waitress that didn't seem very happy. I was seated and ordered my drink. I asked about the lunch specials she looked borderline upset. I ordered the salt and pepper pork chop which was fantastic, I then decided to order the Crab Rangoon. About 5 minutes later I see an order of the lovely little cream cheese  babies headed my way...NOT...the waitress passed my table and put them on the table next to mine, ok fair enough they must have ordered them also. Not the case, 3 minutes later the other waiter comes and picks them up from them and says to me they are making me new ones. Not possible in the less than 1 minute they were in the back. I told them I did not want them. They should have left them on the other peoples table and REALLY made me new ones. But I will say the food tasted wonderful, they just need some skills in service!!"
        }, 
        {
            "index": 53, 
            "rating": 4, 
            "review": "Good Chinese seafood place in Vegas Chinatown that's open until 3am.  They have a late happy hour menu too, as well as a regular happy hour menu so it's a perfect place to go after late drinking or gambling.  The first thing you notice is the huge banner they have that says it's been named one of the top 50 restaurants in the US by CNN, which is pretty impressive actually.  Food is really good, I've ordered the Maine Lobster cooked Chinese style with ginger and onions, about $20 per pound (advertised half off) which was about 3 1/2 pounds.  Very tasty with the shell pre-cut so it was easy to get to the lobster meat.  I also had the clay pot clams with pork dish, which was about 95% clams and onions but very little pork.  Overall very good and I'd come back again. One thing, if you come after 2:30 am they won't let you sit so you have to get takeout.  Service is good and attentive too, which can be unusual in a Chinese restaurant."
        }, 
        {
            "index": 54, 
            "rating": 5, 
            "review": "Wonderful find and I am going again soon.  If you are tired of Vegas Strip food, then go to China Town."
        }, 
        {
            "index": 55, 
            "rating": 5, 
            "review": "The Absolute BEST in Chinese food in Vegas.. Period. Service, prices, and food top notch. No need to go anywhere else. Joyful House rules."
        }, 
        {
            "index": 56, 
            "rating": 4, 
            "review": "***3.5/5 starts***\n\nGreat service in a nice setting 5/5 for service and decor\n\nhad the rosy roasted duck to start 4/5\na bit salty and the dipping sauce was a tad too sweet; however the skin was very crispy and the fat cut the salt nicely\n\nshrimp stuffed eggplant & tofu 3.5/5\neggplant was nicely fried. I'm not a big fan of silken tofu, lacked flavor and while the shrimp was good there wasn't much of it\n\nmustard greens and oyster mushrooms 3/5\nthe greens were the Chinese variety while cooked well were a bit under seasoned. Mushrooms were ok.\n\nI've searched the States and Canada for food to compare to the food I had in Beijing, the best is still Chia Shang in Ann Arbor, MI. This one in my top 10."
        }, 
        {
            "index": 57, 
            "rating": 4, 
            "review": "my family went to vegas for a mini getaway, we wanted to stay away from buffets so we yelped this place, i must say i wasn't disappointed at all. this place is pretty good, and they have nice and friendly service here!"
        }, 
        {
            "index": 58, 
            "rating": 4, 
            "review": "Authentic Chinese at 3.5 stars.  I like the food here more than most of the Chinese restaurants in the surrounding area.  Duck is moist and has good flavor, decent hotpot offerings and overall above average food.  As for seafood, try their sea bass and most of all the Salt and Pepper Crabs, good stuff."
        }, 
        {
            "index": 59, 
            "rating": 5, 
            "review": "Best chinese food so far in Vegas. It's a little more expensive than other similar restaurants but worth it."
        }, 
        {
            "index": 60, 
            "rating": 4, 
            "review": "Love this place. This spot has always been a quick family get together go to spot. Years of going here I still enjoy their food. Good portions, great quality never left disappointed. \n\nThe service is a hit or miss but this time around we enjoyed ourselves. It was just me and the hubby, I recommend the HK house special pan fried noddles, Peking duck with the steamed buns, and ofcourse their Wonton Soup."
        }, 
        {
            "index": 61, 
            "rating": 5, 
            "review": "Great service. Good food. I have some of the best in LA, D.C., NYC... It's the best I have had in the three months that I have been in Las Vegas. It's a touch pricey, but it was worth it to have a great meal, environment, and leftovers."
        }, 
        {
            "index": 62, 
            "rating": 4, 
            "review": "This place was spot on. We had the steamed chicken with scallions, egg foo young, beef chow fun, sweet & sour shrimp, and the minced pork with salted duck egg. My parents has been going here for a while, and I will be too. 10 years ago I went there & didn't think anything of it. I ordered the Kau yuk and I didn't care for it. Not like Hawaii style Kau yuk, but now maybe my taste changed but what we ordered complimented each other well. I was amazed. I will be going back there again. The staff is a little slow, but the food was tasty for me & my family. I gave it 4 starts because of the slow service, & NOT because of the food."
        }, 
        {
            "index": 63, 
            "rating": 2, 
            "review": "While we were ordering, the man behind the counter was full on picking his nose.  It was revolting.  If we were not starving after already leaving the line at a dim sum house and having to get my son home before late nap meltdown occurred, I would have absolutely left.  It is beyond disgusting that they had an employee standing there picking his nose.\n\nThat being said, the combination dry fat rice noodle dish was delicious.  It tasted the way I like it cooked.  The sesame chicken is a skip it.  It was our least favorite dish.  The kung pao shrimp was tasty.\n\nOur service was terrible.  I had to keep flagging people down to help us.  \n\nI would not go back.  The prices are too expensive for what you get."
        }, 
        {
            "index": 64, 
            "rating": 3, 
            "review": "This review is delayed but I ended up going here for my Thanksgiving dinner. I was excited to dine at a place where I didn't have to have a huge wait in Vegas.\n\nThe service was really good and the food I would say it is just okay. What sticks in my mind is the fried fish that had a lot of bones inside."
        }, 
        {
            "index": 65, 
            "rating": 4, 
            "review": "Great place for late night need for Chinese food. They're open til 3am so after a long day, they're my version of comfort food.  I love their schezuan (sp?) shrimp with onions and their chow fun and lo mein dishes.  My fave appetizer to get is the jellyfish with pickled carrots.  The service is better than your hardcore Chinese restaurant where the server doesn't smile and just asks you what you want but not much better.  Food comes out hot and fast, just the way it should.  They must have a buffet or something at night since I see the layout against the fish tanks but I always order from the menu.  The menu does have a mixture of what I like to call Real Chinese and American Chinese dishes so it will appeal to those who order egg rolls and pork fried rice (you know who you are) and those of us who do not.  \n\nI minus one star for the fact that the bathrooms are sketchy and dirty bathrooms at restaurants freak me out because I wonder what the kitchen looks like."
        }, 
        {
            "index": 66, 
            "rating": 3, 
            "review": "Above average food, good service, but pricey.\n\nWe chose this place because there didn't seem to be too many restaurants that could accommodate our large group of 12.  The decor was average for a Chinese restaurant and I would compare the food just a slight notch below most of the ones in Irvine and San Gabriel Valley.  The service was good as our waiter made some good recommendations and the plates were constantly being taken away and drinks refilled.  But the food was just too pricey.  Every dish was close to $20 if not more.  And the portions seemed smaller than average -- we had to order two of most dishes.\n\nIf you have a large party, you may want to consider it."
        }, 
        {
            "index": 67, 
            "rating": 4, 
            "review": "Good, authentic Chinese food at reasonable prices. Ample seating is available for parties of all sizes. Nice selection of Chinese wine.\n\nThe restaurant displays fish at the front and that may be distasteful to some but the great food and convenient location near the strip make it worth the trip!"
        }, 
        {
            "index": 68, 
            "rating": 4, 
            "review": "For those of you who are going to order Kung-Pao whatever and Cashew whatever, Fried Rice, Egg Foo Young, or Egg Rolls,  then complain how it wasn't good, better not eat here.  This is a Chinese Restaurant.\n\nI wouldn't go to a fine Mexican Restaurant and Order Nachos Bell Grande or Meximelts for dinner.\n\nWith that said,  finding a good Chinese Restaurant in a desert would be challanging.  I am writing this as a customer with lots of Chinese restaurants tested. \n\nThe ambience was conservative and they are open from 11am - 3am\nThe price was a bit higher, but not outrageous, but this is Las Vegas.\nGood wine list, but not really apropo for some of the food here.\n\nThe seafood dishes we ordered were extremely fresh\nWe had a Stir-fried scallop and veggie dish that tasted very fresh and was cooked perfectly.\nThe sweet and pungent shrimp dish was very good. The sauce was made from fresh tomatoes and not ketchup like other restaurants.\nThe Filet Mignon dish was very good\nThe waiter had recommended the sauteed young pea leaves which btw was excellent.\nWe had a Fried Tofu dish that was standard, nothing special.\nThey used good quality rice for the steamed rice.\n\nWe skipped the pricier seafood dishes that spiraled near the $100 mark or more, but all in all we got out for $75.00 (not including tips) for 3 people.\nWe were too full for dessert so no reviews here\n\nI would have to say I definitely would make a return trip here when I am back in Las Vegas again."
        }, 
        {
            "index": 69, 
            "rating": 5, 
            "review": "Excellent Chinese food - real Chinese food!!  \n\nWe ordered the house soup - which turns out to be free!  I like free soup!  Pork bones soup.  Delicious.\n\nThere was a special on flounder so we decided to try it steamed with soya sauce and Chinese wine and ginger, garlic and green onion for $19.95.  Such delicate taste.  \n\nThe other dish to die for is the Rosy Duck - 1/2 order - skin so crispy and the meat so tender.  \n\nWe also ordered the braised tofu and black mushrooms with choy sum.   Good dish.\n\nAlso, Chinese brocolli or kai lan with garlic - very green and fresh with loads of garlic!  \n\nFree Chinese dessert of the day was red bean soup.  Very well done."
        }, 
        {
            "index": 70, 
            "rating": 2, 
            "review": "Not great, but at least not disgusting...\n\nWe picked this place by looking in the window and noticing there were customers, customers which were Chinese, no less!\n\nThis joint serves the typical Cantonese style chinese meal, I ordered the vegetarian noodle soup (think wonton noodle soup without the wontons and a bunch of blanched veggies on top).  The soup and noodles were passable, but the veggies were super bland.  \n\nBetter than nothing."
        }, 
        {
            "index": 71, 
            "rating": 4, 
            "review": "Best deal. Best authentic chinese food. Worth the short drive from the Strip.\n     The $9.50 lunch special huge. But I had to ask for the lunch menu."
        }, 
        {
            "index": 72, 
            "rating": 3, 
            "review": "Took my dad here years ago.  We both ordered the pre-fixed dinner.  We had a variety of dishes, it tasted very similar to Panda Express (Americanized Chinese food).  The food was good, and the service was good as well.  Open late night, so this is a good option for late night dining."
        }, 
        {
            "index": 73, 
            "rating": 5, 
            "review": "the best chinese food in las vegas, by far"
        }, 
        {
            "index": 74, 
            "rating": 1, 
            "review": "After a morning at the casino, we decided to drive to Chinatown to eat.  I wanted really good nonamericanized Chinese food and we just happen to pass this one and decided to give it a try.  \nPros:  good sea bass but how could anyone mess that up?, beef was really tender, waiter was friendly\nCons: we ordered snow pea leaves and they brought out snow peas, they took it back and brought us the correct dish but ended up charging us for both dishes and we didn't even get to eat the first one they took back, charging 16.95 for a small amount of snow peas is unacceptable, we didn't want to spend time arguing with them so we paid and left but felt it was unethical practice, we will never return! The wonton soup is the worst we ever had also.\n\nIn summary, overall the main dishes are decent but over priced and make sure you ask how much anything is or you could end up paying an outrageous price."
        }, 
        {
            "index": 75, 
            "rating": 3, 
            "review": "Portions here are really big, so I would recommend asking the server if what you ordered is too much food or just right.  The hot and sour soup is delicious but the duck was super greasy and kinda flavorless.  Fried rice was massive portions. I mean, massive. \n\nAnd of course, you get your standard you're-a-gringo-in-an-Asian-restaurant neglectful service. \n\nFor being such a renowned place here on Vegas, I wasn't all that impressed."
        }, 
        {
            "index": 76, 
            "rating": 1, 
            "review": "the place is a dump. Filthy. They write the check in chinese most of the time and double charge. I would never return, I would rather lick the handrail on a NY Subway. Do yourself a favor,run away as fast as u can."
        }, 
        {
            "index": 77, 
            "rating": 5, 
            "review": "love it! the biggest and freshest Live Seafood Seclection. the Peking Duck was awsome. Steam Giant Oyster with Black Beans Sauce will be one of my favorite! must try!"
        }, 
        {
            "index": 78, 
            "rating": 4, 
            "review": "It's pretty hard to pass up Joyful House.\n\nStrolling in with Ricardo A for a bite to eat on a Saturday night, we realized quickly that no reservations were required. \n\nAs soon as we walked in we were seated very quickly with menus and hot tea. At the start of the menu there is 3 dinner servings with a easy simple courses if you don't want to think to hard or simply are not sure what you want.\n\nI selected the number 1 serving. With soup, massive plate fried rice and another plate with noodles. I can't 100% tell you what was in all the dishes but I can tell you they were pretty good with a decent serving.\n\nJoyful house has a great seafood selection with a lot of  live crabs and lobsters swimming in the tanks on the rear wall. Although a speciality I didn't get to try any. But with other yelpers reviews it shows that it maybe something worth coming back to.\n\nThe decor of Joyful isn't a 5 star restaurant that you would find in a fancy strip casino, but what it does bring to the table is good food and prompt service.\n\nOverall\nService: 4-5\nFood: 5-5\nDrink: 4-5 (seems to be a full bar)\nComing back: yes"
        }, 
        {
            "index": 79, 
            "rating": 4, 
            "review": "I'm quite surprised I haven't written a review for this place already. \n\nIn a town lacking in quality Chinese cuisine, this is a shining star. I used to be a regular a few years back, but since discovering lots of other treats around town and becoming an addict for trying something new each time I go out, I have neglected poor Joyful House. \n\nI have never had a bad meal here. They have lots of selection and their staff is extremely friendly and welcoming! Some of my favorites are Peking Duck, Eggplant and Pork Claypot, Salt & Pepper Prawns and too many more dishes that I can't think of off the top of my head. They have something for everything. Orange Blossom Beef for the less adventurous in your group or Steamed Fish and Sea Cucumber for the authentic Chinese Food Palates.\n\nThey have great hours, open late for you night owls and great food. I have tried quite a number of dishes on their menu and I haven't ever really been disappointed. I have to make sure I keep them in my rotation more often now that I'm reminded. YUM."
        }, 
        {
            "index": 80, 
            "rating": 1, 
            "review": "You may think this is BEST OF LAS VEGAS, but it's not. Came here two times and was never satisfied. The food wasn't good at all and the portion was small as well. Would not recommend this restaurant to anyone unless you have bad taste in food."
        }, 
        {
            "index": 81, 
            "rating": 4, 
            "review": "The best Chinese food! My favorite is the fried calamari with jalapeño s and extra garlic. Made fresh. ginger chicken with extra olive/peanut oil.  Emmmm. Only 1 critic I have is the servers stand there in mid floor watching everyone eat. I hate that. They need to find something else to do."
        }, 
        {
            "index": 82, 
            "rating": 4, 
            "review": "After moving from the Rowland Heights area to Vegas, I was desperately in need of some yummy Chinese food.  The local Chinese restaurants in my neighborhood are awful!!!  Thank goodness I found this place.  I ordered the roast duck, Chinese broccoli, mandarin style pork chops, and salt & pepper shrimp.  The salt & pepper shrimp was awesome.  Probably one of the best shrimp dishes I've had.  The rest was ok.  It wasn't nearly as good as the Asian cuisine found back in Cali, but the best in Vegas so far.  I will gladly drive the half hour to eat there.  I took off one star because of the price.Thanks yelpers for this find.  :)"
        }, 
        {
            "index": 83, 
            "rating": 1, 
            "review": "Absolutely revoltingly disgusting attitude! Asked for table for four looking at at least 8 empty tables for more than four people. Instead of taking 2 chairs from a 6 top they told us there was a 20 min wait. When I referred to the empty tables she waved a paper in front of my face yelling she had many reservations. They will never see me again."
        }, 
        {
            "index": 84, 
            "rating": 4, 
            "review": "Have to this place several times, with late night groups and for dinner for two. Have also done take-out. Have never been disappointed. The service is very good, the food is always great. The Salt and Pepper Pork Chops are always a must have."
        }, 
        {
            "index": 85, 
            "rating": 5, 
            "review": "We have dinner here all the time and love eating here. The food is usually great, and if there are problems they are very efficient on fixing the dish. I would suggest the seafood chow fun with black bean sauce."
        }, 
        {
            "index": 86, 
            "rating": 2, 
            "review": "My wife (Chinese), her business partner and I booked a table here for Chinese New Year's Eve.  From glowing reviews, I was stoked about a great seafood meal, perhaps like I had while living in China for 10 years.  Pity.  No such luck.  The char su (bbq pork) was lean, alright, but chewy like jerky.  And cold.  Noodles were served immediately, when any self-respecting Chinese restaurant owner knows that the \"pasta is served at the end!\"  At least along side the steamed fish.  Pacing is critical in a good Chinese restaurant with courses arriving at appropriate intervals.  The 'highly recommended' shrimp dish was laden with red sauce.  Very Midwestern and sweet - with all due respect to my Midwestern friends, whose steak and pizza I adore.  In a word, \"Fake\".  And not cheap!  It may be worth a second try, but I may venture to other places along Spring Mountain to find a great kitchen.  Not the best way to begin the Year of the Rabbit.  Now that's a dish served well and spicy in Beijing."
        }, 
        {
            "index": 87, 
            "rating": 4, 
            "review": "Good food. Always stop by whenever we are in town. The fact that they're open late is a plus. Price is decent. Then, why not 5 stars, it is the service that they are lack off.  The servers r super lazy. :("
        }, 
        {
            "index": 88, 
            "rating": 5, 
            "review": "There is a reason why they have award banners hanging outside.  It is just simply delicious.  Growing up our family went to Sam Woo BBQ all the time.  As I got older and busier I discovered this place.  WOW. It's great.  My friends and I come here and order a dish each and we share. This is a typical family style Chinese Restaurant.  I love everything that my friends and I have ever ordered here.  \n\nThe reason I gave it 5 stars is because they have good service and it's clean but still have that legitimate Chinese food.  I have never waited to get a table.  I recommend Salt and Pepper anything: from Pork Chops to Tofu, its all good."
        }, 
        {
            "index": 89, 
            "rating": 4, 
            "review": "Got a late night craving for Chinese food in Vegas? Came here after hours on Monday night. Food came out considerably quick. I feel like some dishes were over priced but overall good flavors. Sizzling rice soup with seafood was $12 large avg price, crispy calamari $13.50, claypot eggplant tofu $12.50, house combination platter duck $29.95 (great appetizer cold dish but a little pricey compared to other Chinese restaurants), sizzling beef $15.95... All around attentive staff, quick food and major plus open late. I liked the claypot eggplant with tofu. Good vegetarian options."
        }, 
        {
            "index": 90, 
            "rating": 3, 
            "review": "Received a recommendation to restaurant. Ventured off the strip to have lunch. Ordered the salt and pepper prawns, garlic bok choy, and hot and spicy soup. Food was yummy and portions was good size. Would recommend if you're looking for Chinese food."
        }, 
        {
            "index": 91, 
            "rating": 4, 
            "review": "The food was very good (my wife and I chose Family Dinner B) and the service was great.  I especially like the Hot & Sour soup, which is not easy to get right.  This was both heat enough and sour enough.  It makes it even better that they're open until 3AM.  I'll definitely be back for more!!!"
        }, 
        {
            "index": 92, 
            "rating": 4, 
            "review": "Our foray into Chinatown - unbelievably the first in our 9-year history in Las Vegas - started out a bit rocky, but was quickly transformed into a wonderful dining experience.  After the initial kinks were knocked out, the food won out, as did some hands-on attention by Gary, the manager/(owner?).  I can understand why the guy sitting next to me on the plane last week heartily recommended Joyful House.\n\nWe started with Hot and Sour soup, at first dismayed by the price, but after hubby had four bowls (to my 2 1/2), the quantity and quality made up for it:  it's gotta be the best Hot and Sour in the Valley!\n\nWe shared a Chicken & Portobello Mushroom, also delicious, and also a String Bean with Minced Pork that would have been fabulous if I had only remembered to ask for \"no extra salt.\"  Gary offered to remake the dish, but we kept it, since it was really good despite my anti-salt crusade.  \n\nFor us, the hallmark of a good restaurant is being made to feel welcomed and appreciated.  If not, it doesn't matter how good the food is.  Joyful House wins on both counts, and we look forward to returning soon."
        }, 
        {
            "index": 93, 
            "rating": 5, 
            "review": "So, I've posted a review about how absolutely delicious the dinner is here. My family always stops here whenever we come to Vegas. Recently they've added ramen to their happy hour menu. At first I thought that was really weird...Japanese ramen at a Chinese restaurant? But wow! It's delicious. I'm originally from LA and we have a lot of amazing ramen places, but this beats them all. Seriously. Shinsengumi? Foo Foo Tei? Not as good as Joyful. This actually tastes like ramen from Japan (except their weird tomato flavored one). They only have about 3 flavors and it runs on the salty side (like ramen from Japan). Portion sizes are good, but most of all the taste is delicious. I just wish it was closer to home."
        }, 
        {
            "index": 94, 
            "rating": 1, 
            "review": "WORST CUSTOMER SERVICE EVER! !! The food is ok not the best not the worst, just average. Don't waste your time to be ignored"
        }, 
        {
            "index": 95, 
            "rating": 3, 
            "review": "I chop yo chicken!!! I chop yo chicken into small chunks. I don't mince yo chicken.... I just chop into tiny juicy pieces. This is the reason why the egg drop soup with minced chicken didn't suck. Unlike Most restaurants which tend to abuse their chicken (Capitol Seafood), Joyful did chicken right like your gams gams making homemade chicken soup. But not everybody is your gam gams, and most tend to abuse their chicken because chicken is so lean it leads to dry bland chicken bits that you will choke on (I just wanted to put \"choke\" and \"chicken\" in the same sentence).\n\nThe spicy and probably sour shrimp was decent, but not stellar although they did do a stand-up job on prepping those on-yerns (onions) which was sliced thinly - most Chinese restaurants will just quarter the onions.... slackers!\n\nAlso ordered the tau miu which was your standard garlic pea shoot vegetable dish. Nothing like your leafy green vegetables to keep you \"regular\"... this might be good for you, if you're one of those people that disappear for an hour or so with a magazine under your arm. FYI - I'm in'n'out in record time... the secret is \"leafy greens\".\n\nThe last dish was some beef dish with a generic indistinctive flavor. That's why I'll generically just say it was \"decent\".\n\nThe reason why I tried this place out, is because I can't stand getting screwed with all the high priced, hyped up crap on the strip. Instead, I like my \"crap\" off the strip.... speaking of crap, those leafy greens I had earlier is working their magic."
        }, 
        {
            "index": 96, 
            "rating": 2, 
            "review": "Ordered take out from this place for the first time last night. We ordered chicken chow fun and a order of fried rice and crispy orange chicken. Orange chicken was not anything close to crispy and the chow fun had a few pieces of chicken and the chicken was old and dried out. Fried rice tasted old and stale.Way over priced and the food sucks find somewhere else to go"
        }, 
        {
            "index": 97, 
            "rating": 1, 
            "review": "You would think with 200 plus reviewers and an average of 4 stars rating the place would live up to its name of JOYFUL . NOPE!!! Based on their location, you would think it's some bomb authentic Chinese food, WRONG again. It was the most flavorless food you could put in your mouth.  Money, not well spend. Overpriced. Note to Owner: Please rename your business to AWFUL HOUSE FAKE CHINESE CUISINE.  I am giving it a one star, because yelp made me do it, in order to comment.  P.S Absolutely not the best of LAS VEGAS!!!"
        }, 
        {
            "index": 98, 
            "rating": 4, 
            "review": "Never thought I'd find a Chinese restuarant that is open until 3:00am. But then again we are in Vegas.\n\nAfter some gambling and a bit of drinking, the wife and I were craving some off the strip, more afordable Chinese food (yes I lost some dough at the tables that night).\nWe enter here at about 12:30 am and obviously it is totally empty besides 1 other client. We are seated and start looking through the menu. \n\nThe restaurant itself is pretty big. It has a lively atmosphere with 1 flatscreen TV. They have a decent selection of beer which was cool. We end up ordering the basics wich were Honey Walnut Prawns, Pan Fried Noodles with beef, and fried rice. Huge portions which was prefect since I was starving.\n\nEveything tasted great. No complaints from us whatsoever. No we were not drunk, so our taste buds were definitely not decieving us. The walnut prawns were addicting, and had to have a fork fight with the wife to grab the last one. She won.\n\nOur waiter was great the entire time. Wich of course he should, being as it was empty.\n\nI would love to comeback and try some of the other dishes.\n\nSo if your having a late night craving, or just a craving for for Chinese grub in general, don' hesitate to stop by this place."
        }, 
        {
            "index": 99, 
            "rating": 3, 
            "review": "My family took me to this restaurant while we were visiting in Vegas. The food was great! You have to try their roasted duck! Our food was brought out quick. The place seem very clean and nice, but it was a bit small. \n\nOn the bad side, when we came the host told us we only had an hour to eat since all the table were already reserved. The waiter rushed us to order and took our food away when we weren't even done yet. And the table right next to use was extremely loud. \n\nBut other than that I DO recommend this place, but make reservations ahead of time!"
        }, 
        {
            "index": 100, 
            "rating": 5, 
            "review": "Just introduced to Joyful and find the name appropriate.  Very comfortable, appealing atmosphere, and good service,  The duck is superb, as good as I had in Hong Kong.  This place has renewed my interest in Chinese food.  We will be back."
        }, 
        {
            "index": 101, 
            "rating": 4, 
            "review": "Good late night Chinese food. A little on the pricey side, but hey for 2am. I can't complain."
        }, 
        {
            "index": 102, 
            "rating": 5, 
            "review": "I'm ashamed to say tonight was my first trip to joyful house. I've heard a dozen times that it is the best Chinese food in Las Vegas and my husband is Chinese but I never went!\n\nWell, it lived up to the rave reviews. The food was excellent. Zero complaints. Even the service, which generally leaves much to be desired at Chinese places, was friendly and attentive. \n\nWe ordered the salt and pepper calamari, beef chow fun, Mongolian beef, and spicy string beans with minced pork. The calamari was perfection. Nuf said. Ooh and a surprise of crispy jalapeños were mixed in. The string beans were flavorful, fresh, and crisp. The Mongolian beef melted in your mouth. Not a single hint of the tough, chewy, overcooked beef you may have encountered elsewhere. \n\nNo culinary surprises here. Classic Chinese cuisine done right. Really right."
        }, 
        {
            "index": 103, 
            "rating": 5, 
            "review": "After eating here, I can understand why it's won so many local best Chinese restaurant awards.  \nThe high quality shows in everything I had, from the iced cappuccino, to appetizers, to the entrees.\nThe sizzling beef was tender.  The lemon chicken was excellent.  The chow mein was top notch, and that iced cappuccino had a very robust coffee flavor.  All of the food had very well balanced flavor, and was not overly salty.\nThis is the kind of place that's a quick drive from the strip, and I would be proud to take out of town visitors to.\nService was very attentive, and I look forward to coming back to Joyful House!"
        }, 
        {
            "index": 104, 
            "rating": 4, 
            "review": "This was a great experiance for sure. The dinner for two for $15.50 a person is well worth the money.  Great service, Great food, and a great atmospher."
        }, 
        {
            "index": 105, 
            "rating": 5, 
            "review": "I don't often give 5 stars, but joyful house gets them for Great food, generous portions (not too big so I feel I'm wasting), value and fabulous service! \nMy daughter and I had the dinner plan \"A\". It was magnificent and eye pleasing. \nThe Taste was top notch! joyful house will be on my \"to do\" ears from now on!"
        }, 
        {
            "index": 106, 
            "rating": 3, 
            "review": "The food was good, but not great. I can definitely say it's geared toward tourists because there are much better Chinese food restaurants in town for much less. The service was very poor. We sat there for 10 minutes with our menus, not one server came over to greet us or take even a drink order.  We had to flag down the waitress to come take our drink order then waited 10 minutes for water. The food was good, I would go back if it wasn't for their high prices. The dishes were as high as $25 for shrimp! The chicken fried rice was mediocre. The lemon chicken was barely edible. On a positive note, the Chinese broccoli was good and so was the beef chow fun."
        }, 
        {
            "index": 107, 
            "rating": 4, 
            "review": "Pretty authentic - they even have won-ton noodles - that great comfort food for Hong Kong'ers !  \n\nGreat part is they open late (3 am, I think).  Classy joint."
        }, 
        {
            "index": 108, 
            "rating": 4, 
            "review": "I have not found a good, authentic Chinese restaurant, but when I tried this place with some family members...how should I say this...I saw a clearing (after a search for decent Chinese food) hehehe...\n\nWe ordered their Hong Kong Style Chow Mein, Tofu & Eggplant w/ Shrimp Sauce, a Chilean Sea Bass dish, and my fave....their Crispy House Chicken! I was actually impressed with their quality of food. Service was pretty good, but they took a while to give us our tab after it got busy (I guess that's good that they don't rush you!). \n\nI will be eating here more often now that this place has been discovered....(maybe I should just venture down Spring Mountain more often!)"
        }, 
        {
            "index": 109, 
            "rating": 5, 
            "review": "****MAKE SURE JOYFUL HOUSE IS YOUR ASIAN 10 COURSE WEDDING BANQUET CATERER****\n\nHave you ever wanted a 10 course Asian banquet for a wedding for 125 guests?  You have 2 options: 1) Choose to have the wedding at an Asian restaurant, where you are limited with the restaurant capacity and limited floor space for dancing or 2) Find a restaurant to cater the Asian food in the venue of your choice.  \n\nI selected option 2.  I went to several Asian restaurants to see if they had the capacity to perform the duties.  Most of the Asian restaurants in Las Vegas were very poor on communication and none of them would return my phone calls even after constant reminders of having their restaurant provide me a quote list of the dinner items and an agenda on how they will be able to perform the function.  All of them failed miserably on the capacity test except for Joyful House.  Joyful House was the ONLY restaurant that had the means to cater in the food.   \n\n\nThey have 2 very helpful managers willing to provide constant communication to make sure your Asian catering and wedding event is a success.  High 5's to both Dell and Stanley.  They are truly amazing and made my wedding planning so easy.  \n\nHere is why:\n\n1) They are extremely good at constant communication.  I am ABC, so they speak good English.\n2) Planning - I would give them a 100 out of 10 in terms of their planning skills.  Chef Yau, Dell and Stanley went to Havana Room at the Tropicana Hotel and met with the Director of Catering.  They laid out the entire inventory items of plates, forks, dinner platters, etc.  They make things look so smooth, yet there were so many complexities in performing the catering job.  Joyful House brought in all the raw materials, tea cups, tea pots, soy sauce, etc. and cooked everything fresh in Tropicana's kitchen.  \n3)Food Quality - I would give them a 100 out of 10.  We had a lot of Asian food connoisseur's in our guest list and I got nothing but raving reviews.  There is a reason why CNN ranked Joyful House as Top 50!  Their specialty is Honey Walnut Shrimp.  My guests were extremely happy about all of the food quality.  Joyful House delivered above and beyond on their quality of food.  The food was so darn good that my guests kept asking for more food than what I originally ordered.  \n\nI can't thank Joyful House for doing such an amazing job!  Thank you again!"
        }, 
        {
            "index": 110, 
            "rating": 4, 
            "review": "People, I have finally found an amazing Chinese joint here in Vegas!  Who would have thought that it was going to be in Chinatown on Spring Mountain! LOL. This place got great reviews from my Elite friend, Jessica P.  Here's what we got:\n\nBeef Chow Fun in Soy Sauce for $9.95.  Really flavorful, love the chow fun noodles, super soft with green onions.\n\nCrispy Salt and Pepper Pork Chops for $10.95.  They said it was hot but it's not as hot as I thought.  There were jalapenos and red peppers.  This was AH-MAZE-ING.  The pork chops were perfectly cooked, batter was crispy and nice marbelized ratio.  HIGHLY RECOMMEND THAT DISH.  \n\nGeneral Chow Chicken for $10.95.  Lots of flavor, great batter, included carrots and peas.  The sauce was a little too salty for me but if you like oyster, soy and other sauces combined, get this dish.\n\nCrispy Fried Lemon Chicken for $10.95.  People, I have FINALLY found the perfect lemon chicken dish in Vegas.  The chicken was crispy, the lemon sauce was perfectly made and this dish made my meal!  \n\nCrispy Fried Dungeness Crab with Salt and Pepper for MKT PRICE.  PLEASE MAKE SURE THAT YOU CONFIRM THEIR PRICE.  We kept asking the server the price and it sounds like she was saying $6.95 and we kept asking her, however it turned out to be $16.95 and threw us for a loop when the check came.  I did like how they brought out the live crab in a bucket before cooking it.  It was juicy, crispy and perfectly flavored.   \n\nThe place has a lot of stuff going on.  To me, the typical Chinese restaurant, full of Chiness decor and statues.  Round tables, only thing missing is a lazy Susan LOL.  They even ask if you want an ocean view seat, which is in front of a big fish tank.  The staff is on it.  They always refilled our drinks when the glass was 75% full.  I think that our little misunderstanding of the crab price was the only thing that I did not enjoy.  The staff kinda got a little impatient with us but other than that, I WILL BE BACK!"
        }, 
        {
            "index": 111, 
            "rating": 3, 
            "review": "I had great expectations when I came especially when I saw many posters and banners saying that it's one of the \"Best Chinese Restaurant in United States\". Sadly it doesn't seem entirely true at all. The foods were moderate, some were delicious, but too oily. I had a lot of people with me that day and one large plate of food seemed little. I thought I ordered a lot of food but it wasn't enough in the end. Overall I give it a fair rating but would I go there again? Sure- it's affordable and worth the cost as a whole."
        }, 
        {
            "index": 112, 
            "rating": 1, 
            "review": "Was just on dirty dining! So nasty! Las Vegas, NV (KTNV) -- One of the most famous Chinese restaurants in town was shut down after a strongly-worded health inspection."
        }, 
        {
            "index": 113, 
            "rating": 4, 
            "review": "Second Anniversary celebrating with Chinese New Year!! Love the late night menu and duck, tofu, and jellyfish!!! The desserts are really good we shared mango pudding, Mochi, and fried bananas w ice cream. Always consistent and service is nice"
        }, 
        {
            "index": 114, 
            "rating": 2, 
            "review": "I'll keep this brief. Key points:\n\n1) It's open REALLY late. That's why I went there.\n\n2) They serve sweet Americanized Chinese, sort of a blend of Mandarin and Cantonese styles. The Kung Pao Chicken is a complete joke if you've ever had the real thing, closer to the typical sweet-and-not-very-sour dishes you can find at every bad Mandarin joint in America.\n\n3) They serve the dark, soy-colored fried rice that has generally fallen out of popularity in recent times.\n\n4) The ingredients are fresh; Beef with Broccoli was acceptable. It may be possible to assemble a 3-4 star meal if you can stay away from dishes with sweet glazes.\n\n5) It's a clean, modern place with table cloths and decent furniture. You don't feel threatened by disease when there.\n\n5) There are so many better Chinese restaurants in Vegas that there is just no need for this place...except when it's REALLY late."
        }, 
        {
            "index": 115, 
            "rating": 4, 
            "review": "I came here the other night because we needed a good Chinese fix while in Vegas. Let me just say, this is one of the best Chinese seafood restaurants I've tried so far, and I've tried a lot!\n\nI love that the tables are wide apart and not squished together. There's plenty of space to walk in and you don't have to suck yourself in to move in between seats. The decoration is not shabby, but not good. The place is very clean though. \n\nI ordered the Sizzling Rice Soup, Tofu and Eggplant stuffed with Shrimp Paste, Fried Tofu with S/P, Honey Walnut Shrimp, and Half a Chicken W/ Ginger Sauce.\n\nThe Sizzling Rice Soup tasted of MSG, but I haven't tasted one seafood restaurant that doesn't make it taste like MSG. But the sizzling rice was greeeat, and the seafood was very, very fresh. The Tofu and Eggplant stuffed with shrimp paste was deliciouuus. I eat this all the time and this is one of the best places I have ever tasted it at. The stuffing is great, it's packed with flavor and the eggplant and tofu were soft but not falling apart. The Honey Walnut Shrimp.. Mmmm, delicious. My favorite dish there. I love that they don't go heavy on the mayonnaise and they keep the dish light and flavorful. The shrimp is super crunchy, unlike many places. The chicken was great. It was a little bit dry but I loved the flavor they got into the chicken, and that was without the ginger sauce! The Fried Tofu was good too! The skin was very thin but super crunchy and the whole tofu kind of just melts in your mouth. Although this isn't a dish, I just have to compliment it.. We asked for fresh chili and they give us chili, with soy sauce, and fried garlic. I don't know what else they put in it, but it was delicious.. Wow, so great! \n\nService was quick, everything was brought to us in a blink of an eye! Loved that. They were friendly and informative. \n\nPrices are very steep here though, especially when you compare it to the portion of the dish. But the quality of the food here is superb, at least when I came. Everything was tender, fresh, juicy and delicious! I will definitely come back and try the Peking Duck."
        }, 
        {
            "index": 116, 
            "rating": 5, 
            "review": "Great decor! Excellent food! Informed watier! Garlic Shrimp were to DIE for!"
        }, 
        {
            "index": 117, 
            "rating": 4, 
            "review": "Vegas + drinking + 1am = greasy chinese food cravings kick in, STRUGGLE IS REAL!! My friends & I just finished our epic spartan race and idk why but my cravings for Panda Express Orange Chicken were going on overboost. However, my friends all said that the Panda Express on the strip (the only one open that late) wasn't as good as back in OC. I ain't about to waste my calories on crappy chinese food so luckily one of my friends that live in Vegas recommended Joyful House.\n\nI was surprised walking in that there were still families eating so late, so place must be good. The workers here speak english, but if you want any modifications you better know your chinese. Thank god they spoke cantonese so I busted my chinese speakin skills on them lol\n\nWonton soup - Started off w/ this, I liked that it was just the soup w/ veggies, wontons, and bbq pork. NO NOODLES YAY! It was a very big portion, but flavor was on point and no salty MSG. In fact, their soup was actually on the lighter side and not greasy. The BBQ Pork was lean and surprisingly one of the best I've had.\n\nHoney Walnut Shrimp - Busted my chinese to ask for mayo on the side and thank god I did! I recommend you try asking for the sauce on the side also, it makes a big difference. The shrimp was all nice and crispy, not leaking out oil at all from the batter. I think that if the sauce was on it, it'd make the shrimp soggy. Very good dish and they didn't skimp on the shrimp either! We still had half the plate left to take home. The shrimp were a good medium size, not overly coated in batter\n\nCrispy Orange Chicken - I wished it were a bit more crispy, didn't really satisfy my Panda Express cravings, but can't complain. The sauce wasn't the same as Panda either, but more like a traditional Orange Chicken flavor you'd get at asian restaurants like Sam Woo. It tastes great w/ the steamed white rice. I would say skip this and try another entree, it's not a TDF item\n\nYang Chow Fried Rice - Fried rice w/ BBQ pork & Shrimp! You can get it chinese style which is Plain, Soy Sauce Free - Pan fried with Eggs and Shredded Cabbage, or American Style which has soy sauce. The fried rice was pretty good and again the BBQ pork was delicious! Really big portion, we had to take the rest home. Unlike most chinese restaurants, they didn't skimp on the bbq pork and shrimp! It wasn't too greasy either so brownie points for that\n\nThey give you sweet and refreshing orange slices at the end of your meal which helped the hefty meal go down! Our total bill came out to be about $50 w/ tax which isn't bad. It's a great place for value, you get a lot for what you pay! Hits the midnight munchies in Vegas and the food tasted pretty authentic :)"
        }, 
        {
            "index": 118, 
            "rating": 4, 
            "review": "Ate here once and I was instantly impressed with the atmosphere. The place is very clean. The staff was friendly, prompt and attentive. I had the General Tso's a.k.a Cho  Chicken. It was a portion for 2 but it made dinner for the next night easy. They could have eased up on the sauce a tiny bit (it was caked in it). The Won Soup was awesome. Overall, I will definitely eat here again but I will be trying something else to expand my horizons. BTW this place has a MASSIVE seafood menu for all you seafood eaters."
        }, 
        {
            "index": 119, 
            "rating": 4, 
            "review": "I haven't been here for awhile...my last memory from years ago was deliciousness...but as time had gone, so has my trips to joyful house. The outside looks pretty much the same as it has been, a small looking building with nothing too flashy to invite you in...but we did notice a banner saying it was renovated...so we decided to check it out with the family for my post bday celebration. As most Las Vegas joints especially in China Town, this place does close late past midnight...2am I believe. This makes it convinent for those late night munchies, hangovers or out of town peeps looking for something to eat at almost any given time. Definitely wasn't disappointed after a long absence. Food comes out fast...and full of flavor. The Roast Duck is amazing ... one of the most flavorful moist Roast duck with crispy skin I have ever tasted...in Vegas anyways! It wasn't drowned in sauce and just perfect. The restrooms are clean, and the inside looks pretty contemporary yet keeping food traditional. They did get Las Vegas Review Journals BEST of Las Vegas award in 2014 so that should mean something. Definitely a place to try and check out once or more than you would expect."
        }, 
        {
            "index": 120, 
            "rating": 4, 
            "review": "Good Chinese food is hard to find in Vegas so consider this your notice!  Joyful house is delicious flavor is 8/10 customer service 7/10 and the fact that they don't close til 3am in a 24 hr city gives them bonus points. For the most part I only go here for Chinese food. I recommend the salt and pepper shrimp (shells on) and the roasted duck, never dry! Can't say I'm surprised they have so many awards bestowed upon the restaurant. I appreciate consistency."
        }, 
        {
            "index": 121, 
            "rating": 1, 
            "review": "This restaurant sadly has become very mediocre.  Too expensive, crab in claypot is $68.00, which very little crabmeat.  Steamed veggies $16.50, total bill for three $168.00, total ripoff. AVOID! I used to be a huge fan of this place but not any more."
        }, 
        {
            "index": 122, 
            "rating": 2, 
            "review": "Food was okay- crispy duck was very good. Service was HORRIBLE! Got to the bottom of the Baby Bok Choy and found a hair...SUPER!"
        }, 
        {
            "index": 123, 
            "rating": 4, 
            "review": "What a nice way to end a busy day of running errands in the Vegas heat. My best friend, her family and I came here around 10:30pm. It had been ages since my last visit (I think I was 10 years old or so) ,so I couldn't exactly remember what the food tasted like, but at the moment I was up for anything in the Chinatown area. \n\nWe ordered: \n\nCream of Chicken and Corn Soup- pretty standard soup. It reminded me of egg flower soup with cream of corn. I don't know if I'd order this again because it wasn't anything special. I think I'd prefer won ton soup over this. \n\n\nBeef & Broccoli- I was a little skeptical about ordering this dish because I always try to order things that you can't get at other places. This dish you can order anywhere and I was sort of sick of it from places like Panda. However, that is only due to the fact that I forgot how much better it tastes at authentic Chinese restaurants. Beef was chewy and tender, while the stems of the broccoli was soft. The sauce was typical and there was a perfect amount to moisten the dish up and I'm tough critic when it comes to dryness. I couldn't believe at how much the dish amazed me as if it was my first time trying it. \n\nHoney Walnut Shrimp- one of my all time favorites at any Chinese restaurants. Joyful House will not disappoint because theirs definitely meets the standards. The batter of the shrimp was the perfect thickness, good ratio of shrimp to walnut and the mayonnaise glazed the entire dish perfectly. Loved this! \n\nSteamed Flounder- just as good as it is anywhere else. My dad also cooks this at home and now I honestly don't find this dish as amusing as I did before. But I'm sure for everyone else they still love it. The fish is very light that is balanced with the soy sauce and oil. The chopped scallions also adds a nice touch, almost like sprinkles on a sundae. On another note, the fish came with all the bones intact and the server meticulously de boned the entire fish at the table. I was truly impressed because the fish still held up it's shape and it wasn't distorted into pieces (if that was my job, it would have been another story). My best friend and I both chatted about how it was our first time experiencing such an art. Apparently all Chinese restaurants are suppose to do this. \n\nThank you Joyful House! I was so caught up with the hype of other Asian cuisines from sushi to banh mis that I had forgotten the Chinese were the first to make a good impression on Americans. No wonder, your food is absolutely delicious and will always be considered the Asian classic. You may now be my Chinese restaurant fix when I'm in the Chinatown area."
        }, 
        {
            "index": 124, 
            "rating": 1, 
            "review": "I was hoping that this place would offer really good Chinese food, but ordering pickup this late at night, I should have suspected.\n\nI ordered the shrimp with pork in lobster sauce and combination pan fried noodles, and got: egg flower soup with 1 shrimp, sweet& sour soup, dried/ uncooked noodles, and a small container of white rice. \n\nEverything I received was something I did not order, which is kind of funny and disappointing. I called to ask about the issue and the employees tried to tell me that this was, indeed, what I ordered. \n\nWill not return. :("
        }, 
        {
            "index": 125, 
            "rating": 4, 
            "review": "LOVE their Rosy Duck. TIP: appetizer portion if 8.99, half duck is 9.99...it is much larger and worth the $1. We get the duck everytime we go.\n\nLunch menu is decent. For 6.99 or so you get a drink, eggroll, soup, wonton, entree, and fried rice. The entree I had (beef and green pepper) wasn't exciting or that great, but I felt it was a good value. \n\nHouse crispy chicken is also amazing.. I will say the house chicken and rosy duck are v. similar, so only order one or the other depending on your particular poultry craving that day."
        }, 
        {
            "index": 126, 
            "rating": 5, 
            "review": "Great food, price is more than other Cantonese restaurants around but they are always consistent and food quality is better! Haven't been back since the new remodel but sure look forward to it and the staff is always friendly with great service! IMO, it's my #1 choice for Cantonese family style dishes!"
        }, 
        {
            "index": 127, 
            "rating": 3, 
            "review": "Wasn't impressed with their Honey Walnut Shrimp. But their deep fried King Crab was delicious! Garlic fried Tofu was tasteful."
        }, 
        {
            "index": 128, 
            "rating": 4, 
            "review": "Went to Joyful House to check it out for our Ethnic Dining club.  Very nicely decorated, big enough for a crowd.  Food arrives pretty quickly at Chinese restaurants, and since Joyful House was pretty empty last night, food came too quickly.  We had steamed dumplings to start, then sizzling scallops in black bean sauce, and whole rosy roasted duck.  Scallops and duck came out before we were finished with our dumplings.  However, it was all steaming hot, and absolutely delicious.  We are definitely bringing our club here for dinner during Chinese New Year!!!!"
        }, 
        {
            "index": 129, 
            "rating": 3, 
            "review": "Got to try this place finally for the first time. Heard good things abut them so coming here was a no brainer.\n\nI gotta give them props for their menu. It looks like they put a lot of thought and detail into it. For example, if you were craving a certain item like soup, bam! All the soups they have are all in one section. This applies to all others like noodles, seafood, etc. We ordered Salt n Pepper Calamari, Salt n Pepper Porkchops, and Honey Walnut Shrimp. \n\nThe Honey Walnut Shrimp was decent, but to me it seemed to lack a bit of sauce to it. When we got the plate, it already looked like somebody ate some shrimp off of it. If you refer to my picture, you can see that they don't give you much shrimp to begin with. The best Honey Walnut Shrimp I ever had was at Panda Inn in the city of La Palma, Ca. \n\nBoth the Salt n Pepper Porkchops and Salt n Pepper Calamari was very good. The only thing lacking I thought was some kind of sauce to dip it in. There was soy sauce on the table but that will only add to the saltiness of the two entrees. I was thinking sweet n sour sauce would be perfect to dip it in. \n\nService was very good. They took our order and processed it right away. We got our food in no time. Refills were constant and im glad because of the salt content we ordered which was good with the steamed rice we ate it with.\n\nThe main negative thing that stood out for me was the prices. With all the three items we ordered plus tax it came out to 41 dollars and that's without any drinks (we had water which was good because it was filtered and not tap water). I thought the food was good but 15 bucks a pop for the Honey Walnut Shrimp and the Salt n Pepper Porkchops is bit much. Even the appetizer Salt n Pepper Calamari was 8.99. \n\nAll in all I thought it was an ok experience based off of the negatives and positives that balanced each other out. All I know is be prepared to spend a lot of money if you are paying for a party of 4 or more.\n\nP.S. They don't give out fortune cookies when you get your check and its a 20 dollar minimum to use debit/credit."
        }, 
        {
            "index": 130, 
            "rating": 3, 
            "review": "We went here from reading good yelp reviews.  I wasn't very impressed.  We went late at night so I don't know if that had anything to do with it but the flavors were just not there.  Very bland."
        }, 
        {
            "index": 131, 
            "rating": 5, 
            "review": "SHELLFISH ALLERGY? 6LB LOBSTER?  WHAT TO DO?\n\nLobster!  Duh.  So there was a small possibility that I might have had a shellfish allergy, but after my 6lb plate of deep fried lobster perfection, I think I can rest easy now.\n\nMan, I had forgotten how great this place is for seafood.  Despite being \"only kinda hungry\" my group of four proceeded to order a 6lb deep fried lobster, XO beans, ong choy, soup, and steamed fish.  \n\nThis is one of the best lobsters I've ever had.  Lightly dusted in cornstarch, salt, pepper, and crack(?), then quickly fried to perfection keeping the meat moist and succulent.  The pictures speak for themselves.  Plus they were having a 50% off special on lobster, so our titanic crustacean only cost us $100. \n\nThe only disappointment was the fish, not because it wasn't good, but because we had no idea it cost $59/lb!  That 1.5lb cost us as much as the lobster and wasn't worth it.  Next time we'll be sure to ask how much the fish costs before we order.  \n\nOther than that, a perfect meal."
        }, 
        {
            "index": 132, 
            "rating": 3, 
            "review": "If I was writing this review 2 years ago this place would have 5 stars without a doubt. The food in this place is really good and the service is also but they've gotten greedy. I've been coming here for years and we liked this place so much we'd come at least 2-3 times a week for lunch and other times for take out. I highly recommend the tenderloin beef in black pepper sauce with portabella mushrooms, their fried rice and spicy crispy shirmp.\n\nThe prices have been on increasing regularly and the amount of food has gone down drastically, not good business. This last time I went for dinner with my parents and we all noticed how small the portions have gotten, it was really bad and that irritated me. The only good thing is that the quality of the food is still there but their competition is very close by (less than a mile down the road) and they've been consistent for years."
        }, 
        {
            "index": 133, 
            "rating": 4, 
            "review": "An excellent meal. Service was very rapid. The wonton soup for two certainly was enough for 4. The rest of the dishes were tasty (though a little too much salt for us.) And plenty of food."
        }, 
        {
            "index": 134, 
            "rating": 5, 
            "review": "We got \"Family Dinner B\". \n\nIt was quite possibly the tastiest Chinese food  I have ever had.\n\nI'm pretty sure there is some MSG in there. But, really, what is chinese food sans MSG?"
        }, 
        {
            "index": 135, 
            "rating": 5, 
            "review": "LV is littered with Asian fare, which makes it hard to discern the dives from the treasures. My girllfriend chose Joyful House, and boy were we amazed. The menu is filled with high end culinary seafood, exotic dishes, and wine choices that would make your AMEX card burn (2-3k for high end years). My girlfriend and I decided to order the dinner combos, which turned out to feed an army. I am not kidding. From the start, we had three appetizers-wontons, eggrolls, and potstickers. Next, we barely scratched the surface of a gallon sized bowl of sweet and sour soup. Our entrees arrived, accompanied by a heaping bowl of white rice. In total, we had four entrees and barely made a dent in any of them. We ended up leaving with four large styrofoam containers loaded with food, and we didn't even spend $50 bucks. The service was prompt, waitstaff was friendly, and the food was excellent with the caveat that my girlfriend felt the food was a bit greasy. However, we both thought it was spot on and felt warm inside after our Joyful dinner."
        }, 
        {
            "index": 136, 
            "rating": 4, 
            "review": "Came here in a group of 5. We were actually planning on going to another restaurant, but it was packed and we came across this place. \n\nI was a little late, so when I arrived all the food was already there. We got crispy noodles, garlic crab, honey walnut shrimp, duck, and soup. I have no complaints at all about the food, it was all delicious.\n\nThe waiter was pretty friendly and efficient as well. He always filled up our water glasses once they reached halfway and took away our plates the second we were done. \n\nI'd like to come back. The prices are cheap, the portions are large, and the food is good."
        }, 
        {
            "index": 137, 
            "rating": 4, 
            "review": "Have visited Joyful House on a number of occasions over the  years.  Very tasty authentic Chinese food.  Would recommend for those interested in trying it out."
        }, 
        {
            "index": 138, 
            "rating": 4, 
            "review": "January 31 2011. Dinner.\n\nWe had the Sizzling Rice Seafood Soup first.  The Flavor of the broth and fish was wonderful, however the calamari pieces were as chewy as slices of rubber tire, completely inedible. But alas, don't fret...\n\nThe Crispy Fried Chilean Sea Bass with S&P was completely without fault. Absolutely full of flavor, very fresh tasting (and i'm extremely conscience of fish freshness). A large center slice of Seabass. Just lovely.\n\nWe also had the Sauteed Prawns in Spicy Sweet and Sour Sauce which was very good.  in addition to the incredible menu choices, they have several live seafood tanks with a variety of seafood; prawns, geoduck, shellfish, other live fish.  \n\nAtmosphere was marred by this random table in the middle of the walkway heading to our booth - this oddly placed table was covered in clean restaurant dishes, glasses, napkins, and brickabrack of things that are usually hidden at the back or behind a divider, not sitting in the middle of the restaurant.  At first glance, I thought they weren't ready for business yet, but there were patrons inside and that table never disappeared. O, well.  The food was reasonably priced and delicious. Definitely recommend.\n\nhttp://www.joyfulhouselv.com/menu.html"
        }, 
        {
            "index": 139, 
            "rating": 5, 
            "review": "I am pleased pleased pleased.  Food yummy. Salty fish fried rice. Scallion chicken, bok chow with oyster mushroom. Mmmmmmmmm. I love this place. Quick service. Excellent service. The waiters, bus boy, host all excellent and polite. I just cant say enough good stuff about joyful house here in vegas. Very rarely do you come accross such helpful, friendly staff. Loving it."
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "Overall the ambience is very nice (I may feel uncomfortable wearing a t-shirt.) \nOur group of 4 took some time to figure out what we wanted since the menu is extensive. You can get a dinner for around $10 if you a stick with a noodle dish or simpler stir fry or clay pot. You can also splurge on a Peking duck or their market price seafood up to $70/lb. I chose to go a little less expensive tonight. \n \nThe eggplant tofu clay pot was delicious! It has a strange shrimp pate in the middle of the eggplant which was unnerving at first but I loved it.\n\nThe waiter was extremely helpful and nice.  On a Friday night at 630pm our food took only 10 minutes!\n\nI would definitely recommend and will return!"
        }, 
        {
            "index": 141, 
            "rating": 5, 
            "review": "Excellent place and open late to boot!  If I am here with 4 or more, we usually just go with one of the dinner sets on the 1st page of the menu.  Great value and you get A TON of food.  Something is seriously wrong if you ain't totally full after that.\n\nI am a sucker for fresh squid so that is one dish I always order if it isn't a group outing.  I've been happy with everything I've ordered there."
        }, 
        {
            "index": 142, 
            "rating": 5, 
            "review": "BOMB.COM\n\nHands down the best Chinese restaurant in Vegas. \n\nSweet & Sour Shrimp: spot on, shrimp was cooked perfectly.\nFried Whole Fish: It's like a deep fried fish chip. Delicious.\nHoney Walnut Shrimp: Light on the mayo, perfectly cooked.\nFried Crispy Tofu w/ Shrimp Paste: Probably my favorite dish, the dipping sauce is to die for.\n\nAnyways, those are the dishes I've tried and all have been great.\nMy only qualm with this place is the prices are just a tad bit more than what I'm used to in California, but hey it's worth it!"
        }, 
        {
            "index": 143, 
            "rating": 5, 
            "review": "This was our first time here and we were seated immediately. The outside of the building in a little strip mall doesn't do justice to the inside. The place was very clean and inviting and the staff was great. We ordered a dinner for 2 which was 4 different entrees, soup and an assortment of appetizers. Everything tasted very good and fresh. They also served us hot teas when we were seated. We also had a couple of soft drinks and our total ticket was around $42. We felt the price was within reason for all we received. We will definitely go back, but we will also try some other places around there to have a good comparison."
        }, 
        {
            "index": 144, 
            "rating": 3, 
            "review": "This is usually my fav Chinese spot to eat at in Vegas but today the food was just sooooo oily. I ordered chicken chow mein and sweet n sour chicken both seemed drenched in oil like I needed to let it drop a few times before I could even take a bite. I'll come back because I know they can do better but this order was not as good as it usually is."
        }, 
        {
            "index": 145, 
            "rating": 1, 
            "review": "Went there yesterday with the family for Mother's day, the service was awful. There was 7 of us and we had to keep trying to find our server to get more tea, not once did our server ask how anything was. I arrived after my mom and sister (we were coming from church and got stuck at a traffic signal that was out),when I did get there the server NEVER ONCE asked me if I needed or wanted anything. I guess that she just assumed that my kids and I were alright with what very little food was left from what my mom, sister and nieces were picking at. It wasn't at all busy, they didn't appear short staffed, just sheer negligence. \nThe icing on the cake was being on the phone with a friend this morning and her asking me what I did for mother's day and her responding that the last her and get husband were there they had awful service too. It was just the two of them and it wasn't busy then either so it couldn't be attributed to the size of their party, just bad service all around. My friend said her and her husband will never be going back, my mother said the same yesterday and I have to say I agree with both of them. Such a shame too because their menu choices are vast and the food wasn't bad."
        }, 
        {
            "index": 146, 
            "rating": 5, 
            "review": "This place is not be well-rounded when it comes to food, but I still like it. Their service is always friendly and attentive. The restaurant is also clean. It's hard to find those in a Chinese restaurant. \n\nMy favorite is the Mongolian beef. The meat is very, very tender. The plate is colorful. It looks like it came out of a Samsung TV. I usually like my Mongolian beef spicier, but theirs has lots of flavor so it's fine. The portions are just right too, for the price. Their rice is always free so you have to take that into account if you think they're too expensive. Then there's the lemon chicken. It's very crunchy, and the sauce is not as tiring. It's not made up of mushed up meat so it's real chicken. \n\nI can't say everything in their menu is great, but they always get my favorites on point. You really have to come here for those specific dish they get right. Overall the experience I get is always awesome here. They're open late. Love that."
        }, 
        {
            "index": 147, 
            "rating": 2, 
            "review": "Tried this place because of Yelp reviews. Totally disappointed. Other than the service - nothing else. No flavor at all! Those reviewers never had good Chinese cooking."
        }, 
        {
            "index": 148, 
            "rating": 5, 
            "review": "We came here for a late night dinner.  The food was very good and flavorful!  The Chilean sea bass with fried tofu and mushroom was so tasty.  Seasame chicken and Chinese style beef tenderloin with onions was good as well.  If you want quick, tasty and fairly reasonable for Vegas food, try"
        }, 
        {
            "index": 149, 
            "rating": 5, 
            "review": "Joyful House serves consistently good food--I tried something different tonight--salt & pepper fried tofu, and pan-fried string-beans with minced pork. I always ask for chili-oil on the side, and theirs is excellent; I used very little this time since the food was already quite piquant. The string-beans were tasty, and the tofu was in crispy cubes on lettuce with sliced jalapeño peppers. Will order both dishes again."
        }, 
        {
            "index": 150, 
            "rating": 4, 
            "review": "A great place for late night dining.\n\nHave never been there before midnight, but i am sure that it is good around the clock."
        }, 
        {
            "index": 151, 
            "rating": 4, 
            "review": "It was almost midnight and all I could think about was how much I wanted some chow mein. Not the kind of chow mein from a cheap, take-out place but the real stuff. I searched Chinese food in my Yelp app and Joyful House came up first on the results. The reviews had me sold, so we jumped in the car and drove across town for a midnight snack. \n\nThe parking lot was a little dark, but it was expected since it was so late and everything else in that little shopping center was closed. The restaurant had about two tables filled, now three once we all sat down. Must be a good place if there are people here eating Chinese food instead of on the strip at midnight. We ordered soft noodles, salt and pepper pork, minced beef with tofu and sizzling beef (came on a hot plate). All of the food arrived at the table family style and freshly made-- just what I was craving for! It was delicious and I would definitely come back again. I especially like how late the Joyful House stays open and how accommodating the service was. Our drinks were never empty and our server brought more rice the moment I scarfed it all down. We definitely felt welcomed, even when it was probably past our server's bed time (and mine, too!) \n\nI definitely recommend this place to anyone who might be visiting Las Vegas and craves some authentic Chinese food-- not that greasy chow mein from a fast food chain or the 'meh' broccoli and beef from a tray at a casino buffet. Joyful House does Chinese food right and I will definitely be back for more."
        }, 
        {
            "index": 152, 
            "rating": 4, 
            "review": "Yelp Challenge 365 # 177/365\n\nSeafood at its best!!!! I would never have found this place if not for Rod U who kindly directed me to several places in the great city of Las Vegas.\n\nUnfortunately, there were no spot prawns when we dined but chose crab and shrimp in a basket with garlic and vegetables... we were there for lunch so it was just the right amount= not to heavy and enough to satisfy our appetite. Noodle dish? Cake noodle topped with more seafood and a side dish of green beans (lots of chili pepper with it too !)\n\nThe food was excellent by taste and the service as excellent. Oh, parking was plentiful compared to other restaurants and shops in the Vegas Chinatown district. \n\nA definite stop if you're into seafood, chinese style!"
        }, 
        {
            "index": 153, 
            "rating": 5, 
            "review": "Phenomenal Chinese food.  The green beans with XO was probably the best dish.  The salt and pepper crispy pork and duck appetizer were also very good.  The beef chow fun noodles were acceptable but I have had better.  Overall one of the Chinese places in Vegas."
        }, 
        {
            "index": 154, 
            "rating": 5, 
            "review": "Before I moved to Las Vegas, my full knowledge of Asian food was Panda Express. (Not that I'm not going to give it up.) As I've been here, Elite Emily (and LChee before he abandoned me) started dragging me into real Asian food, and of the places we've been so far, this is my favorite Chinese place. For those who are adventurous, eggplant clay pots and various prawns and what not are available for your dining palate, but if you have friends who are new to Asian or Chinese food, basic but delicious items are available, such as fried rice, sweet & sour pork, and lemon chicken. Last night I had the orange blossom beef. Simple but tasty with a delicious sauce.\n\nAfraid to try other cuisines? Go to Joyful House, they can ease you into it. The staff is helpful too; if you have questions, they'll fill you in!"
        }, 
        {
            "index": 155, 
            "rating": 4, 
            "review": "I haven't had Chinese food in a while so I took advantage of the fact that my husband wasn't hungry. (He doesn't really eat Asian food) I didn't order much because I knew I would be the only one eating. The crispy lemon chicken sounded good so I ordered that with a side of white rice. It was good especially liked the pieces of lemon. If you order this it's best to eat it there. It gets too soggy the next day ...even if you bake it. I'd like to come back and try the Walnut Shrimp, Fried Rice, and some Chow Mien. I'm getting hungry just thinking about it!"
        }, 
        {
            "index": 156, 
            "rating": 5, 
            "review": "Came here for a wedding reception. DELICIOUS. Really indulged here. Had all kinds of good food. Peking duck, walnut shrimp, delicious spring rolls, delicious fish. The fish was to die for, you better bet I tore that shit apart.\n\nToo bad I live in San Diego or I would come here more often."
        }, 
        {
            "index": 157, 
            "rating": 3, 
            "review": "For dinner, this visit was my third.  The first two visits were for Hot Pot and the third was family-style for a party of 14.  I recommend family-style to share and taste several dishes you wouldn't otherwise try.  I thought the food last night was okay; I wasn't very impressed with any particular dish.\n\nDinner was served only minutes from ordering and our server was very attentive and responsive.\n\n$23 per person including gratuity"
        }, 
        {
            "index": 158, 
            "rating": 2, 
            "review": "The service here was good but the portions for the price and the quality was not. Yes the food did taste good but nothing really stood out. I guess since I live near the san gabriel area im pretty much used to this type of food at a more reasonable price. Good dishes to get here are the black bean sauce clams, stir fried string beans,  and fried salt and pepper sea bass. Parking is easy and the wait isn't long."
        }, 
        {
            "index": 159, 
            "rating": 2, 
            "review": "Based on the reviews I read, I decided to get food for my family from this place. Unfortunately, I was a bit disappointed with their food. On top of that, their food was pretty pricey, which included $9 for just chicken fried rice. \n\nI also ordered clams with vermicelli in special sauce as well as walnut pr0nz. The pr0nz were the most expensive, which was $14 bucks. As good as they were, they only put in roughly 7 or so pr0nz in the to-go box. I don't get it. I was expecting more than that. The clams and vermicelli was way too salty, and there were hardly any vermicelli noodles in it. I appreciate there being a good amount of clams, but unfortunately the sauce was more like a soup. The fried rice didn't have much flavor and it was too salty for my tastes as well. \n\nService was cool though. All the staff were very helpful in making sure I was being helped. Sadly, I wasn't too fond of the food. I'd like to give this place another chance when I'm in town again, but for now 2 stars."
        }, 
        {
            "index": 160, 
            "rating": 1, 
            "review": "Wtf this place sucks!!! Overpriced and cheap food! Did they get bought out?!"
        }, 
        {
            "index": 161, 
            "rating": 3, 
            "review": "The food there is good but the customer service can be hit or miss. I can't even count how many times I've been there and the experience ranges from the most pleasant to the most bizarre.\n\nOne low point was when we wanted to order pork & scallops as an entree (I know it's an odd combo but my friend digs it!). We've ordered this many times before without having any issues. On this rare occasion when the moon was full... the guy wanted to charge us PER scallop. Weird!\n\nAnother time I was there I think they forgot to flavor the soup.\n\nSo as you can see I've had very odd experiences there but yet I keep coming back... Why? Because overall you get a lot for what you're paying and the food is good :)"
        }, 
        {
            "index": 162, 
            "rating": 4, 
            "review": "In my world, there's 2 kinds of food.\nYou have Grub and Chow.\nChow is the kinda food you eat just to get full (i.e. taco bell, jack'n the box) and grub is something that's of a higher caliber.\nThis place is MOST DEFINITELY some grubbin ass grub.\n\nI would suggest the following:\nSalt & pepper pork chops\nRosey duck\nSalt & pepper calamari\nPan fried baby bak choy\nPan fried chinese broccoli"
        }, 
        {
            "index": 163, 
            "rating": 4, 
            "review": "I remember coming here years back when they used to be in a different location (I think, can't remember that far back...).  I also remember that it was quite good, although I again cannot remember at all what I had.  I'm sure they were fairly typical dishes such as mushu or kung pao or something.  Recalling that they were good and being in the mood for Chinese, we made our way here for lunch.\n\nFirst of all, no lunch menu on weekends.  We got the menu of dozen pages or so that were just normal dinner dishes - fairly expensive dishes.  Fortunately we were not looking for a lunch menu and wanted the full gamut so it didn't faze us any, but be prepared that it will not be a cheap lunch.  The menu you do get is upscale in both the menu itself and the contents with right balances of seafood and non-seafood.  \n\nI was craving some Chinese seafood so we ordered the Seafood Wor Wonton Soup ($10), marinated spicy clams ($14), and sweet & sour crispy rock cod fish ($14).  The soup had plenty of fat wontons and ample amount of seafood, and with the large size it's well worth the price.  Spicy clams were in deep red, spicy sauce, with a hint of mala tingliness.  Loved it.  The sweet & sour was not too sweet, not too sour, with perfectly fried fish that was as tender as can be.  As good as the first two were, this was even better.  With enough unusual items on the menu, this may very well be our go-to Chinese.\n\nOur meal came to $50 after all was said and done, but it was the best Chinese we've had in a long, long time.  Service was more pleasant than the typical Chinese restaurants, although it's all relative.  Food came fast, restaurant is clean, and traffic was brisk.  I'm torn between 4 & 5-stars, but let's leave it at 4 until I revisit.  It's really 4.5 stars.\n\nTable-for-1 Factor:  Despite the large table-centric set up, I think the atmosphere might actually work for 1.  Maybe."
        }, 
        {
            "index": 164, 
            "rating": 4, 
            "review": "Fantastic! I'm coming back soon and if the food and service is as it was the other night, I'm bumping up to 5 stars. Woooooow. Really can't say enough good things. First, I called to make reservations. Had no problem with that. Yay. Upon arrival, they seated us immediately. (when I made reservations, guy said it might take a minute or two to get seated if others were still at table). The menu was great. They offer 3 options for family style dining, starting at $17.95 per person.  We ordered \"C\" and it was $19.95 PP, and the Kung pao scallops. First the scallops were definitely the highlife of the dinner. Absolutely fantastic. Delicious favors and veggies cooked to perfection. The fried rice was great ( they altered from chicken fried rice to veggie for me, super accommodating which I'm not used to in Chinese restaurants. Cough cough KJ's!  \nThe waiter, Kenny, was great. The manager stopped over several times to see how things were. Our drinks were always full. Food was really really good. What more can you ask for?? If you dig Chinese food, please check this place out. I was really impressed and will definitely return."
        }, 
        {
            "index": 165, 
            "rating": 3, 
            "review": "This is my mom and dad's favorite Chinese restaurant. The mixed fried rice is great, the chicken (any recipe really) is awesome and I absolutely love the soup.\n\nThe only problem I have for this place is that the servers can be a little pushy sometimes. Not every time, but the second to last time I went there, the dude was slightly rude...and there was like 5 other partys, with like 5 other servers...CALM DOWN."
        }, 
        {
            "index": 166, 
            "rating": 5, 
            "review": "Authentic! Huge Menu Selections! Great for vegetarians since they have a huge selection of veggies. But also fabulous for the carnivores since they carry from all sorts of seafood, shark fin, big no-no to all sorts of land animals.\n\nTry any of the Ducks\n\n Late night they have the all you can eat hotpot. You pick your meats and veggies and cook it at your table in a rich clear broth $15.95."
        }, 
        {
            "index": 167, 
            "rating": 4, 
            "review": "We go to the Joyful House every time we are in Las Vegas. The prawns in spicy sweet and sour sauce are awesome! our grandsons love it too!"
        }, 
        {
            "index": 168, 
            "rating": 4, 
            "review": "My family and I met here for Christmas lunch and the food was excellent. It was nice to finally get some old school Chinese instead of the same old buffet style that you see know days. We had 4 or 5 dishes and all of them were very good.The server went out of his way to please everyone at the table, even though the place was packed he did a great job keeping up with the pace. I will definitely be going back next time i'm in town."
        }, 
        {
            "index": 169, 
            "rating": 3, 
            "review": "The only reason I didn't give Joyful another star is because they use dark meat chicken which I don't eat and they don't offer white meat at all :( \n\nService - on point.  \n\nHot and Sour Soup - plentiful, flavorful and filling.  Made with mushrooms, tofu, dark seaweed, egg and more.  \n\nSautéed Shrimp with Sweet and Sour Sauce - delicious if you like onions.  \n\nDecor - doesn't feel  like Vegas, more like a family owned (which I think it is) restaurant in a middle class neighborhood. Live lobster tank @ MP. \n\nThis is definitely my new go-to for Chinese in Vegas, when I don't want chicken.  Ive lived here for 5 years and only ate Panda Express for lack of anything better."
        }, 
        {
            "index": 170, 
            "rating": 4, 
            "review": "This was the first chinese restaurant I came to when I moved to Las Vegas 13 years ago.  It is where I would take out after getting off of work late at night, or after a late night of anything.  Is it the best Chinese food in Vegas?  Nope, but I give it 4 stars for consistently satisfying my hunger and cravings."
        }, 
        {
            "index": 171, 
            "rating": 3, 
            "review": "Potstickers and wonton soup were not good\nFried rice and sweet and sour pork ok \nCurious how they got a 4.1 rating"
        }, 
        {
            "index": 172, 
            "rating": 5, 
            "review": "My husband and I were at a loss as to what to have for dinner this evening. So we both hopped on yelp and found THIS restaurant. Upon walking in I noticed how clean everything was, and I liked the way the tables were set up. We first ordered egg drop soup with mushrooms, I can honestly say that it was the best egg drop soup I've had in a very long time. It was perfectly seasoned, perfect consistency. Only SMALL issue I had, was I wished there was more egg, other than that it was absolutely delicious. I ordered sweet and sour pork and my husband ordered sautéed chicken with Portobello mushrooms in a black pepper sauce. The sweet and sour pork was fairly generic, but it was awesome. The pork was still crunchy even with the sauce on top, the onions and bell peppers were sautéed to perfection. An absolute great dish. My husbands chicken dish was off the chain, the mushrooms were in big chunks so you REALLY got a good taste of them, the chicken was tender and flavorful and the pepper sauce was perfect. I expected the pepper sauce to be too spicy (I don't handle spice very well) but it was great! It had a good pepper flavor, but it wasn't over powering or too spicy. A freaking epic dish. The service, for a Chinese restaurant, was actually really good. Our waiters were very attentive.\nI would totally recommend this place, great food and great service.\nKEEP UP THE GOOD WORK!!!!!"
        }, 
        {
            "index": 173, 
            "rating": 4, 
            "review": "We went there on our first date. \n\nWe were greeted by a friendly hostess. \n\nOur server on the other hand, didn't speak English very well. We did manage to get our order in by ordering by number on the menu. He meant well though. lol\n\nWe started with the salt and pepper calamari, it was delicious but she didn't have any. She is allergic to seafood and vegetarian, I know! But we pressed on through dinner..lol\n\nI had the seafood hot pot which was amazing, it was perfectly cooked  and so flavorful. \n\nShe had the vegetarian hot pot with tofu. Although I'm not a big fan of tofu. it was pretty damn good.\n\nIt was also my first time having a drink with those tapioca balls. At first, it was hard to get used to, the straws were so wide, it felt quite weird but the tapioca balls were good. (no pun intended) lol\n\nThis place has been around for years and really does it right."
        }, 
        {
            "index": 174, 
            "rating": 4, 
            "review": "The food was really good and they were very accommodating for our large party. They are open very late so it's a great choice for a midnight meal. We had a wide variety of food and it came out hot and fast. The only negative is that they forgot one of the items we requested. We let it go since the food we did get was enough to keep us satisfied. We would go again."
        }, 
        {
            "index": 175, 
            "rating": 5, 
            "review": "The food is simply great, and the waiters are very helpful. They replace the used plate and serve the food very fast."
        }, 
        {
            "index": 176, 
            "rating": 5, 
            "review": "This was one of the best Chinese restaurants I've been to and the service was fast and excellent! Great find!"
        }, 
        {
            "index": 177, 
            "rating": 3, 
            "review": "Maybe I'm used to New York style Chinese food???  But this place seemed a little bland.  I guess I like my chicken and broccoli (American broccoli) with sugar, ginger, soy, and corn starch.  We visited this place around midnight and were the only customers.  The service was good and the atmosphere was modest to humble.  There were live fish tanks in the back.  With so many Chinese restaurants on Spring Mountain, I doubt we'll revisit."
        }, 
        {
            "index": 178, 
            "rating": 3, 
            "review": "Very solid place, but nothing special either. I wanted to try this place because they have Peking duck, I have had this dish in many restaurants both in China and the US. None of the duck I had in US can compare to the ones I had in Beijing, but the duck here is still on the lower end compare to the other US restaurants. It's not technically bad, but it's not very good either. The duck was very skinny, and the person that cut the skin for us did not know how to do it properly. I would pass if you are only here for the duck. \n\nWe also ordered the salt and pepper calamari and a seafood stone pot dish, calamari was really good, serving slightly small, and the seafood stone pot was somewhat bland but was made with quality ingredients. \n\nOverall, it's a good place, and it will please different people. But I wouldn't crave anything from this place anytime soon."
        }, 
        {
            "index": 179, 
            "rating": 4, 
            "review": "Far and away the best Chinese restaurant in Las Vegas. I'm fairly contrarian if you've read my reviews, but I agree here. I'd give it 5 stars, but it's not the old Say Eng Look in New York's Chinatown, which was the best ever for me."
        }, 
        {
            "index": 180, 
            "rating": 4, 
            "review": "Came here late at night and we were the only customers at this time.  Service was fast and attentive.   Ordered combination fried rice, beef chow fun with sauce, and walnut shrimp.\n\nThe walnut shrimp that everyone here on yelp raves about was not bad.  Nothing that stood out about it, tasted great, but not to die for.  Also at $16 it's a bit overpriced in my opinion.  It did come with a side of white rice.\n\nHowever, the fried rice and beef chow fun were great values!  Both came out, and my wife and I realized we would have tons of left overs for the next day or two.  The beef chow fun was super yum.  Fried rice was fried rice, not bad.\n\nFor late-night chinese craving, definitely the place to go.  They have a extensive menu and even cool whole lobsters.   I will have to try that the next time I go here."
        }, 
        {
            "index": 181, 
            "rating": 4, 
            "review": "OUTSTANDING seafood.\n\n\"That was really good.  What was it?\" asks my Midwest white friend\n\n\"Spicy jellyfish with bean curd\" is my straight face response.\n\n\"Huh?  So what is this?\" he stupidly continues.\n\n\"Um, sea cucumber with abalone\"; again straight faced.\n\n\"What?!?\" With great exasperation in his voice.\n\n\"And this is Santa Barbra Spot Prawns with their egg clutch, deep fried crab with fermented black beans, steamed live fish with ginger onion, and the soup was made from tiger shark fin\".\n\n\"I think I'm going to be sick\" is all he can say.  Sorry I can't help but to explode in laughter.\n\nJoyful House is a Cantonese seafood restaurant for the initiated.  I'm not sure if I should even write this review.  It's one of those places that long time Asian Vegas locals cherish.  Yes its won the \"Best of Vegas\" from the Review Journal but that barely speaks to it's hidden greatness.\n\nSo maybe they need to get to know you before they reveal their secrets, persist.  For example, you MUST ask for their spot prawns with the eggs.  Yes, they are now $12 each but they are worth every penny.  Eggs exploding in your mouth with the essence of fresh shrimp.\n\nThe spicy jellyfish was excellent.  Clean oceanic flavor accented by sesame and chili oil, and a touch of soy.  The sea cucumber with abalone, a tender sweet explosion of sea flavor.\n\nDon't hate me but this is one of the few places that still uses real shark fin.  While I deplore fining and think it's inhumane, I couldn't resist.  It's been 12 years since I had the real thing.  Add a jigger of Remy XO, perfect.\n\nThis is not your typical Cantonese restaurant.  Yes, if you choose, they make great Americanized favorites (beef broccoli. shrimp fried rice, \"Peeking duck\", lemon chicken, shrimp with honey walnuts) but ultimately only those in the know will experience it's greatness.\n\nShhhhh.  Not for everyone."
        }, 
        {
            "index": 182, 
            "rating": 3, 
            "review": "Do you ever wake up in the middle of the night craving sweet and sour chicken? Well do I have a place for you! Yep, even at 2am you can get Chinese food in Vegas. We ordered a shit ton of food for only 4 of us so Ill just laundry list each item with a few thoughts. \n\nWonton Soup (Cantonese style).. kind of blah and bland. I'd opt for the hot and sour instead which was exactly as its named. Perfect. \n\nRosy Duck, crisp, duck fatty.. Came with plum sauce which tasted like industrial cleaner.\n\nSalt and Pepper Pork Chop, bone-in thin pork chops deep friend and covered with fried garlic and chilies. This was a hit!\n\nBoiled Chicken with Chives, pretty bland and the garlic ginger sauce was too oily masking most of the flavor.\n\nCombination Pan Fried Noodles, generously covered with shrimp, beef and chicken the dish over all was super goopey and not very appetizing. Opt for Lo Mein next time.\n\nBeef Chow Fun with black bean sauce was good. The beef was silky and tender while the noodles chewy and oily. This was another hit!\n\nService was pretty amazing (fast, efficient), well priced and portion sizes were huge. They also have a humongous menu plus fresh seafood on premises. For late night eats their selection is hard to beat!"
        }, 
        {
            "index": 183, 
            "rating": 2, 
            "review": "I went here after a suggestion from one of the local Chinese bakery workers.  I don't know if it was what we ordered but I didn't care for the food.\n\nI ordered Kung Pao Chicken and my friend ordered Cashew Chicken.  The Cashew Chicken was tasteless with a bland sauce, Kung Pao had flavor in the sauce with a bit of a kick but not a memorable experience.  \n\nThe pork fried rice was decent for lunch special but not amazing in any sense of the word.  One plus of the take out of this place is that they will give you the soup to go.  The soup was very tasty it was a corn based egg drop soup.\n\nI don't know why a native speaker would send me here but I probably wouldn't go back too quickly."
        }, 
        {
            "index": 184, 
            "rating": 4, 
            "review": "It was good but our initial server was not pleasant or helpful.   Everyone else was wonderful and attentive. Therefore 3 out of 4 servers were worth out time.  Not happy to see shark fin on the menu though."
        }, 
        {
            "index": 185, 
            "rating": 4, 
            "review": "Great food w/o waiting to long. Can improve on the service. Overall I will come back to this place."
        }, 
        {
            "index": 186, 
            "rating": 2, 
            "review": "Joyful for who? Or is it whom? The cook? The waiter? The guy making the money?\nIt was eh. A friend sent a link and review about this place, but to me it was nothing more than poor Americanized Chinese. Now I must have missed what I should have ordered to be Joyful."
        }, 
        {
            "index": 187, 
            "rating": 4, 
            "review": "This is an excellent chimes restaurant!  We go at least once a month for lunch!  Services is excellent and meals are served quickly!  It is also peaceful in the restaurant not a lot of noise.  Lunch menu is inexpensive!!"
        }, 
        {
            "index": 188, 
            "rating": 4, 
            "review": "After finish our hike from bottom of grand canyon to the south rim and the 5 hrs drive to las vegas, we were ravenous. 8 hungry asians quickly ordered and the first combo appetizer plate was cleared within 2 minutes. The cold combination plate had some hot items which was a bit odd but everything was delicious. Jelly fish strips were flavorful, the duck was not as juicy as I would like, but I was happy. Ham was yummy and the braised beef slices were ok.  \n\nThen we had some stir fried greens (well cooked but pretty expected), the seafood claypot had a lot of seafood (shrimp, scallops, squid, etc), fish sauce eggplant clay pot had a lot of sauce that went well with rice. Beef chow fun was quite good and I don't normally like that stuff. the pepper and salt pork chops was good but had a lot breading. but i loved it regardless. we got another tofu dish with mushroom.. it was nice and light (be careful though - it burned the roof of my mouth).  Last dish we had was some kind of beef in sweet sauce which i didn't try.  \n\nAt the end of the meal, they brought us slices of watermelon and one in the group spoke cantonese so she got us an overflowing plate of watermelon --- on the house!  They even told her that if we ran out, we can ask for more. :)  yayyy for free watermelon. \n\nWe were quite loud/excited after being starved for a week from camping and road tripping in the wilderness, but they were completely fine and service was good."
        }, 
        {
            "index": 189, 
            "rating": 4, 
            "review": "This was an easy late night staple and we've eaten here quite a bit of times. What we have gotten is pretty good and have not had a bad experience here yet. It's not the best I've had, but it is solid and specially when it comes to late night where most places go downhill in quality, I appreciate that it's consistent. We just get off of work, we're not drunk so we actually care what food tastes like.\n\nThey have stuff that serves more for a friendly palette but they also have legit dishes too and have tried quite a few of those are are indeed, authentic and want to note in particular that the seafood is fresh and fairly priced. Servers are pretty friendly here too, specially since the late night crew are the same, they are familiar with us and are attentive on the drinks refills\n\nIt's a good standby for late night eats. We are fairly regular here."
        }, 
        {
            "index": 190, 
            "rating": 1, 
            "review": "After seeing 4 stars and reading some of the reviews, I was expecting something much better than what I got. The servers were nice and the tea was good but that's about it.  I went for lunch and they had only been open about 30 minutes which is how I explained away the empty restaurant to myself.\n\nI tried a lunch special, pan fried beef, and I was extremely disappointed.  The beef had a slimy texture to it and my egg roll was super oily. Won't be going back and definitely won't be recommending it to anyone. \n\nI should have had a V8. :-/"
        }, 
        {
            "index": 191, 
            "rating": 1, 
            "review": "If you are looking for an authentic Chinese restaurant, I wouldn't touch this with a 10ft pole. Came here for the rating alone and regretted it as soon as they brought out the dishes. Ordered 5 dishes and most were subpar and overpriced for the portion they give. \n\n- Pork belly with preserved vegetables was terrible, I am not sure how they could even bring themselves to call it that, all the ingredients were there, but it is like they didn't even try to make it properly. It was dry and probably been precooked in the kitchen for a while, have had canned versions that were immensely better than this.\n- The salt and pepper pork chop was even worse, the meat itself was flavorless and they didn't even bother to properly spread the seasoning, ending up with a couple pieces over seasoned  and the rest tasteless.\n- The eggplant and tofu dish was the only good dish. I am a sucker for crispy outside and silky smooth inside tofu. Eggplant was fried very well, reminds me of what you would get in a fresh dim sum restaurant.\n- Pineapple pork was not edible, it was mostly breading and soggy sweet and sour pork.\n- Sizzling beef with shacha sauce was ok, beef was done well, soft and tender, flavoring was a bit off."
        }, 
        {
            "index": 192, 
            "rating": 4, 
            "review": "This place is really good.  You get a lot of your favorite dishes in big portions.  The restaurant itself is very nice both in cleanliness and decor.  They served us green tea as soon as we were seated.  The menu offers a wide variety of dishes.  We ordered the family dinner B and combination soft noodles.  Great deal to have a mini buffet at your table.  The portions are huge and everyone gets their fill.  The servers are polite and very helpful.   It seemed a bit pricey but you get rally great food and service so it's more than worth it!"
        }, 
        {
            "index": 193, 
            "rating": 4, 
            "review": "This place has everything! Portions are large. Don't order pho soup or Vietnam food . Everything else is good. Great Chinese food. Open late. Good service. Chinese lady explained some meals."
        }, 
        {
            "index": 194, 
            "rating": 5, 
            "review": "Great food, Good service, and Fair priced. I would suggest the beef and Portobello mushroom dish and Hot and Sour soup very good and a huge bowl. One of the best Chinese places in Vegas."
        }, 
        {
            "index": 195, 
            "rating": 3, 
            "review": "Time to give a bad review...\n\nOf all the places I've tried during my trip, this is one of the more overrated restaurants.\nNothing really stood out, everything was average.\nFood: Clearly overload with MSG. Our mouths were super dry hours after dinner. The veggies (Chinese broccoli and rapeseed leaves) are very hard to bite/chew. The lack of sauce make it even harder.\nService: Very good, the waiter was patient, and offered additional menu choices when we were indecisive on what to get. Dishes came one after another\nPrice: It was ok. 4 dishes and rice = $60ish with tips."
        }, 
        {
            "index": 196, 
            "rating": 3, 
            "review": "A very clean Chinese restaurant that has plenty of seating to accommodate large parties and good sized parking lot. Their menu comes with gorgeous pictures of their entrees, but unfortunately it doesn't transfer over to the real deal. \n\nAs this is a family style restaurant, we wanted to get around 6 - 7 items to share amongst each other. The entrees we got were;\n\nPeking Duck: probably one of their best things here, good sized duck, lots of meat, very crispy skin, comes with the white bun and colorful shrimp chips, wasn't overly salty. \nBBQ Combination Platter 1/2 size: This was my favorite along with the duck, I probably would have just gone with the full order and just taken off something else we ordered, the dish comes with fried chicken, jelly fish, pork loaf slices, meat loaf slices, and cha shu pork. \nHoney Walnut Shrimp: Disappointing portion size, there was literally like 7 pieces of shrimp on there.....for $16 bux? Man we got jipped hard, I probably would recommend putting that money into a different dish.\nClams in vermicelli special broth: clams were good but the broth wasn't that special, it was sort of bland, but it was different than the usual ways people order clams at Chinese restaurants.\nSteamed Egg plant with garlic sauce: Wasn't really garlic sauce, more like just sauteed egg plants with crushed garlic sprinkled on top, so technically, it needed some sauce.\nYang Chow Fried Rice: decent, no real complaints from this, probably need some more salt.\nPan Fried Chinese Broccoli: probably our only real healthy dish, it was good, nothing memorable from it, but we did finish it.\n\nOverall, this restaurant is a decent Chinese joint."
        }, 
        {
            "index": 197, 
            "rating": 5, 
            "review": "Delicious food here. Got free sweat ice tea and soup. Broccoli beef was great. Chicken is fresh. Prices are pretty good as well. Would recommend!"
        }, 
        {
            "index": 198, 
            "rating": 5, 
            "review": "OMG! This may rank as one of the best Chinese restaurants in Vegas. I'm a local and just let me say this is not your average run-of-the-mill place. The service was great - the host was amazingly friendly and helpful from the moment we walked in the door - he even helped us order. Try the whole duck for about $14. Seriously - $14. It was great. We will definitely add this to list of great restaurants in Chinatown."
        }, 
        {
            "index": 199, 
            "rating": 5, 
            "review": "We decided to eat here for Chinese New Year because of the good reviews and it truly lived up to its reputation. A bit pricey, but worth it because of the food and ambience. I especially enjoyed the Chilean sea bass with black bean sauce, which just melted in my mouth and I couldn't stop eating it.\n\nBonus points for honest employee who returned my purse that I had left, right before we got into our car. Thank you."
        }, 
        {
            "index": 200, 
            "rating": 4, 
            "review": "A little behind on reviews, stopped in here about 2 months ago for lunch.  I remember this place as being one of my mom's friends favorite places and I have been here before a long time ago.\n\nWe ordered a chicken to split and it was amazing, we also ordered the eggplant which was very good as well..\n\nThis place seems to be keeping up its reputation of good food, the service was a little slow which was surprising being it was past the lunch hour and there were not a lot of people in there.\n\nI recommend this place as they have a good variety on the menu to suit anyones appetite."
        }, 
        {
            "index": 201, 
            "rating": 1, 
            "review": "The staff here are extremely rude. I came in with a mixed crowd and they nearly neglected to serve us. We were seated right away but service didn't come around for maybe 10 minutes. We nearly left. Well, we should have. The waiter that took our order was a little less rude but outwardly impatient. He had no recommendations when we asked what vegetables they had that day and was in a hurry to get back to doing nothing - there was only one other table besides us. When the food came, the rice was stale, the vegetables were way too oily and everything else was just plain bad. I highly recommend anyone to avoid this disaster of a place and go elsewhere."
        }, 
        {
            "index": 202, 
            "rating": 2, 
            "review": "I was here the other night and I was not impressed.  Joyful house is overpriced and overhyped.  I had a fried flounder with sweet and sour sauce (the special of the day $22) and honey walnut shrimp.  The honey walnut shrimp was good but lacking for the price.  The flounder was a mess.  It came soaked in cheap, and unpleasant sauce that came straight from a bottle.  I wasn't even surprised when the check came and I was charged $8 more for my $22 flounder because they had used an entire bottle of sweet and sour sauce.  Needless to say I was not happy with being charged $30 dollars for an item I ordered under the clear impression it was $22.  Overall my check came to $56 including a $4 sprite.  If the floors were made of marble and the ambience was that of a 5 star restaurant I could see getting away with this but this is china town off the strip folks!  There are hundreds of amazing ridiculously reasonable Chinese, Thai, and Japanese restaurants in close proximity.  This restaurant is a tourist trap. Chinese locals do not eat here."
        }, 
        {
            "index": 203, 
            "rating": 3, 
            "review": "As far as food is concerned it is good. As far as what we got for our reunion \"Chinese banquet\" dinner -- not so much. However, having said that, it is tough to organize a banquet for a large group and I felt we were jipped in price for what we got. I know if I went to the restaurant myself and ordered the same dishes, it would've cost much less.\n\nStill, our dishes were good. We had:\n\nSalt and pepper calamari -- your standard Chinese restaurant fare, good with tons of garlic\n\nFried veggie rolls -- I would've preferred these rolled in beancurd sheets, but what the hell\n\nShrimp with broccoli was nice, shrimp were plump, large and snappy.\n\nPeking duck -- this was sad as there was a measly piece of duck in a huge bao \n\nBlack pepper steak with portabello mushrooms -- strange combination but what the hell, it was good\n\nSteamed flounder -- okay I mean I order this dish often and it rarely runs more than $10-$12 a pop so don't sell it as something expensive PLEASE!\n\nStir fried green beans -- this was done really well with bits of preserved turnip greens in it. LOVED it.\n\nBraised duck E-fu noodles -- okay, epic fail because these were not E-fu noodles. They looked and tasted more like regular egg noodles. I was so damn disappointed because I love E-fu noodles and these were not it.\n\nAt the end of the day, this meal did not constitute $50/head even with a few bottles of wine and beer thrown in. PUH-LEEZ! Only about 30% of the people had drinks. I think I was more upset that it was $50/head. I know if we had just gone in ourselves and ordered this menu, we would've easily walked away paying no more than $25/person tax and tip included."
        }, 
        {
            "index": 204, 
            "rating": 3, 
            "review": "We've been coming here for the past 12 to 15 years.  The taste is still great BUT I am surprised that their portion is a lot smaller, at least 1/3 less, for the same price.  I wish I had take some pics of the dishes before.    It's disappointing!"
        }, 
        {
            "index": 205, 
            "rating": 2, 
            "review": "Went for lunch but not much on lunch menu so ordered from dinner menu. Most Chinese Restaurants have a fair to good lunch menu but not Joyful House. We were greeted and seated by a nice lady, maybe a manager. But our waitress was far from friendly, never cracked a smile once. I ordered the fish special, a deep fried flounder. And that is what I got. A good size fish with head and tail, deep fried. No veggies or sides. We also ordered the Manila Clams which were very good. It is a dish that can be eaten as a soup but were not given smaller soup bowls or soup spoons. The waitress seemed irritated when we asked for the bowls and spoons. We also ordered the seafood special Hong Kong noodle dish. The noodles are supposed to be fried crispy and the sauce and seafood poured over the crispy noodles. Our noodles were only crispy along the very edge of the dish. The rest were soft and not what Hong Kong noodles are supposed to be. We asked for chopsticks for the noodles. Again the waitress seemed irritated when asked for chopsticks. The table setting was one napkin and one fork. If you want chopsticks you had to ask. Service was very poor, slow, and unfriendly. It wasn't that they were busy. There was only one other couple there besides us. Prices were a little more expensive compared to similar Chinese Restaurants along Spring Mountain."
        }, 
        {
            "index": 206, 
            "rating": 5, 
            "review": "My friends and I were craving for good authentic Chinese foods after few days of American foods around Vegas areas. I mean real Chinese foods. So I decide to search the Yelp and find Joyful House Chinese restaurant. Am I lucky? The food and service are excellent and no doubt to recommend this place.\n\nMy friends and I ordered a steam red big eye fish. The fish is made just right. If you know how to make a traditional Chinese steam fish, you know it is important to have good quality of fish, have to be fresh, and also the timing to steam the fish has to be just right, not too long or too short. We also have the coral shrimp, those shrimps are fresh and  tastes sweet. We also tried the lobster as well - I mean those over 4 lbs lobster. The lobster meat is fresh and tastes very good, can't get it from somewhere else. \n\nAnother dish that we ordered is black bean sauce clams, it is amazingly good. They are juicy, tender and \"big\" as a clam. I never taste such a clam before. As Chinese, we got to order a dish of vegetable - garlic baby bean sprout (the leafy ones.)\n\nAs far as the space, as other described, they are spacious and sit comfortably for a big group. Very clean place. Decoration is ok.\n\nThe service is excellent. The waiter and waitress all are friendly and answer all our questions. The food is served promptly. They even serve complimentary dessert as well.\n\nIf you are looking for Chinese foods and wants to get away from the Stripe. I would highly recommend this restaurant."
        }, 
        {
            "index": 207, 
            "rating": 5, 
            "review": "Do you like fresh seafood? Like, it-was-swimming-two-minutes-ago fresh seafood? And would you like your seafood served in a simmering hotpot of wine, asian chiles and whole cloves of garlic? Then Joyful House may be for you.\n\nDo you like noodles? How about tender cuts of beef stir-fried in a rich whole black bean and garlic sauce served atop large portions of rice noodles? Then Joyful House may be for you.\n\nLastly, are you intimidated by large menus offering delicacies you've never heard of? Well, then Joyful House will definitely be for you! they've got a fantastically broad and diverse menu... organized by protein and illustrated with large photos to tempt your tastebuds.\n\nJoyful House has quick service, is clean (although the decor is a bit tired), and most importantly delicious. My favorite aspect, though, it that they are open until 3am! Perfect for a late night dinner date in Chinatown. I noted that they had a bar so you can order a cocktail, but I also noted they have a limited beer and wine selection. They serve Coke products and hot tea is complimentary. They have combination dinners available for 2 or more diners, but for the most part meals are served family style (which is my personal preference for Chinese restaurants anyway). They can accomodate tables of 2 or tables of 10 quite easily and our server was very nice.\n\nWe will definitely be visiting Joyful House again. We were so impressed with the seafood (delicious clams!), and we look forward to trying the roasted duck on our next visit. Highly recommended."
        }, 
        {
            "index": 208, 
            "rating": 5, 
            "review": "Way to close to the strip to be missed fresh seafood tanks friendly staff the salt and pepper calamari. you know you are at the right place when you are the only table that is all Chinese"
        }, 
        {
            "index": 209, 
            "rating": 4, 
            "review": "The only thing keeping me from giving this a full five stars is that the portions are a bit small for the price.  The food is excellent and the service is great.  One of the few good Chinese restaurants that I've been to in Las Vegas."
        }, 
        {
            "index": 210, 
            "rating": 4, 
            "review": "Excellent Chinese food at decent prices.  I have come here a few times in the past years, but since I haven't been recently, I wanted to wait to review it with a fresh mind.\n\nI think the average entree was about $10-11, with large sharing portions.  Everything was cooked well and it's one of the better Chinese restaurants in town IMO.  Here is a pic of everything we ordered :\n\nhttp://www.yelp.com/biz_photos/joyful-house-chinese-cuisine-las-vegas?userid=eZZyuJDouIg4p-GYB3PV_A#GAN-B1GGaFvLw0tAS5zyuQ\n\nWe tried their salt and pepper shrimp (shells), which were cooked perfectly and had a great flavor.  One of the better ways I've had it.\n\nTried the salt and pepper pork since everyone was saying great things about it....it was also very good!  Nice crispy pieces of pork with a light breading around it.  It had lots of flavor and a little spice to back it up.\n\nThe half duck was good and flavorful.  I haven't had duck for a little while, so it really hit the spot.\n\nWe tried the garlic eggplant, which was good, but a little mushy for me.  The flavor was there, just not my favorite way to eat eggplant.\n\nThey are open very late, 3am every night, so this will really hit the spot for late night cravings!"
        }, 
        {
            "index": 211, 
            "rating": 5, 
            "review": "Don't listen to the naysayers.  This place is as good as any A-List Chinese restaurant in greater Los Angeles.   Food was top rated. Service was superb. Atmosphere much better than average Chinese deco. NOT expensive. Go without fear"
        }, 
        {
            "index": 212, 
            "rating": 3, 
            "review": "The host is really hospitable and friendly, he made us feel like honored guests!! I would give 5 stars just for him if I could.\n\nThe dishes are great! We especially liked the crispy fried pork chops, so crispy and tasty (they were not soggy at all as a previous reviewer mentioned). I agree that the portion size is on the smaller side, not like what you normally receive at your usual chinese restaurant, no leftovers to take home :P I always ask if they have snow pea leaves when I'm in a chinese restaurant (it's never on the menu, you have to ask), and Joyful had it - yum!! The honey walnut shrimp was good, but not the best I've ever had (a bit disappointed because of all the raves on yelp, maybe they've never had it before lol).\n\nFor parents: they have both high chairs and booster seats. Our waitress misunderstood us and would not get us one when we requested it. We found out at the end of the evening when the host noticed and apologized sincerely."
        }, 
        {
            "index": 213, 
            "rating": 5, 
            "review": "The restaurant is very clean and well designed. Staff were very polite and provided excellent services. I tried the imperial duck and fried rice, definitely the best chinese food I had ever eaten. Well deserved to be top chinese restaurant in the U.S"
        }, 
        {
            "index": 214, 
            "rating": 2, 
            "review": "Attentive, Clean, friendly, decently priced and accurate with our order. Nice atmosphere.\n\nUnfortunately I Wasn't impressed with the food. The salty pepper pork chops were not as crispy as I would like them to be and the flavoring a were all toppings not cooking into the batter. \n\nThe seafood sizzling soup was awful. No flavor in the soup. No sizzle in the block of rice the put in before it actually got to the table. There was mushy fish and a few tiny tiny shrimp with no flavor either.\n\nI thought I would try it because it had good ratings but maybe what I ordered wasn't the favorites of my fellow yelpers."
        }, 
        {
            "index": 215, 
            "rating": 4, 
            "review": "First let me start by saying this place was pretty clean for a Chinese joint. Second the food was also good, they carved a whole duck table side. That deserves a star, and another for their service because it was good especially having to deal with a party of 12 sitting at different tables, with a language barrier, and the food came out in reasonable time. I would of gave them 5 stars but this place is a bit pricey. Try their oysters it's pretty bomb!"
        }, 
        {
            "index": 216, 
            "rating": 2, 
            "review": "Unfortunately Yelp REALLY  let me down w/ this restaurant.  We had the seafood family dinner.  Seafood was fair, but not plentiful - more vegetables than anything else, and an overabundance of celery which we don't even like. :-(   Chow mein and fried rice were the greasiest, most unappetizing I have ever had.  Since I tend to lean toward eating healthier fare, I had wicked heartburn 10 min after leaving! UGH!!!  :-(.  If this is the best Chinese in LV, I feel sorry for the locals!"
        }, 
        {
            "index": 217, 
            "rating": 5, 
            "review": "Love this place! Wanted to eat here about 2 weeks ago and it's closed. Sign said something about power?? Drove by on Saturday and still closed!! What's going on??"
        }, 
        {
            "index": 218, 
            "rating": 4, 
            "review": "Since my wife and I moved to Las Vegas (this year), we have been looking for Chinese delivery as good as what we were used to getting in Los Angeles.  Joyful House the best we have found yet.  It is not delivery, but the takeout service was quick and attentive.\n\nAppetizers - the Crab Rangoon and Potstickers were good.  The Crispy Fried Prawns were a bit thick on the breading, but the prawns themselves were flavorful.\n\nMain dishes - The Beef Tenderloin Mignon With Onion really was filet mignon, so far as I could tell.  Very tender and flavorful, and they didn't skimp on the beef.  The Sweet and Sour Pork was also flavorful, with only a hint of toughness; and the sauce did not drown out the flavor of the pork.  The soft Pan Fried Noodles With Chicken was also well-prepared, with small but tender chunks of chicken breast.\n\nThe prices were a little more than what we are used to, which is odd because coming from Los Angeles almost everything is much cheaper in Las Vegas.  While we have not quite given up on trying some other places, we would be entirely satisfied to stick with Joyful House as our \"go to\" Chinese food in Las Vegas."
        }, 
        {
            "index": 219, 
            "rating": 4, 
            "review": "I am only docking this place a star because the staff is never pleasant or welcoming!\nBut the food is always on point!\nI love their sea bass hot pot and their beef chow fun with gravy! Their food is always hot and fresh, made to order. \nThe restaurant is always clean. Staff is always on point as far as just doing their job basics. They never go the extra mile to converse or ask if everything is good. But I guess they never ask because we always eat all our food, or maybe they just don't speak English....?"
        }, 
        {
            "index": 220, 
            "rating": 5, 
            "review": "My favorite Chinese restaurant. A bit pricy but its worth it. \n\nI love the pan fried sea bass and calamari. Sometimes they get crowded. Service was fast though"
        }, 
        {
            "index": 221, 
            "rating": 2, 
            "review": "I like this place n visit ofen ,,,but i found they are treat a lot ,,,,,i order hf roast duck ,,,,some thigh is missing,,, then second time ,,i order  hf hai nan chicken,,, some wing n thingh is missing,,,, Fuck it i really hate that ,,the other good place asain bbq located in jones n spring mountain time square  they never happen like that ,,i recommend you guys go there try ,,"
        }, 
        {
            "index": 222, 
            "rating": 5, 
            "review": "Just what you would expect from one of the top 50 Chinese Restaurants.\n\nTHE FOOD:\n\nAuthentic Chinese food and, while not as good as Hong Kong, it is easy to see why CNN rated JH in the USA top 50. It also earned Best Chinese Restaurant by the Las Vegas Review Journal in 2014. Live seafood in the tanks look healthy and vibrant. The wine list is extensive from house wine to Château Lafite.  \n\nSea Food Wor Won Ton Soup (***  ) \n\nIt is really hard for A Chinese Restaurant to mess this dish up and JH was no exception. While it was above average, it was not exceptional, There was Broccoli in this dish that was cooked just right.   \n\nImperial Peking Duck (*****)\n\nWhile the duck was prepared to perfection, this dish got five stars because of what they do with the carcass afterwards: the meat is stripped from the bones and minced then fried in a wok where it takes on a smoky savory flavor, the minced meat looked like it had some scallions in it and was served on lettuce leaves.\n\nBraised Tofu with Salted Fish & Minced Chicken (*****)\n\nSimple yet flavorful soft chunks of tofu with chicken and salted fish. The salted fish is slightly fermented lending an interesting flavor: the flavor was well balanced tho and the fish did not overwhelm the dish as it sometimes can.\n\nLive King Crab (*****)\n\nWe had an 8 pound crab (don't know if it was the Alaskan or Australian but it was $69/lb) served two ways: the body (base of the legs) were served with Ginger Scallions and the Carapace and legs were sauteed with butter and garlic. The Ginger Scallions were cooked to perfection and well balanced. The garlic legs had fresh finely diced garlic piled on expertly halved leg sections: I found that the garlic was pretty strong for my taste but simply removing the garlic with a flick of my chopsticks solved that. The presentation was amazing but the portions were cut in such a way that the meat was easy to separate from the shell: well done! \n\nLive Main Lobster (*****)\n\nGinger Scallions topped off this monster 7lb lobster and it was cooked to perfection (not over cooked and tender) and well balanced. The presentation was not as good as the crab but this is splitting hairs: so I still gave it 5 stars.\n\nChinese Broccoli in Oyster Sauce (***  ) \n\nLike the Wor Won Ton Soup, this dish is hard to do badly. Some places might over cook it but not here; it still maintained some crunch while being tender. Perfect!\n\nManila Clams - Ginger & Scallions (**** )\n\nFresh (maybe live it was so delicate) clams cooked just right. Not a stand out for me, but then again, I don't normally eat clams: the reason I gave it 4 stars was because the freshness of the clams was exceptional and delicate. \n\nTaro Tapioca Soup (*****)\n\nThis hidden gem is not on the menu but served as a complimentary desert. small squares of White Taro rest on the bottom while Tapioca floats playfully on top of this milky warm desert soup. would have given it a six if I could!\n\nTHE SERVICE:\n\nThe Staff (****)\n\nWell groomed and friendly; we were greeted and sat immediately. Not your usual Chinese Food wait staff: well spoken and attentive; beverage refills came quickly with out asking. Dishes were cleared and replaced with clean ones the moment they became cluttered with shells. Soup and wine were expertly served.\n\nThe Layout (**** )\n\nThe exterior was acceptable but not spotless (hey: this is Chinatown right!?), Live seafood tanks were clean and the animals were healthy and not showing any signs of stress. Tables were well set with clean table cloths and no grime/oil/leftovers on the settings. I knocked off a star for the restrooms (I know that it is bad luck to have a spotless restroom: but I hope a Chinese restaurant will break that tradition one day). Parking was scarce even tho the restaurant was half full (we parked in back)."
        }, 
        {
            "index": 223, 
            "rating": 1, 
            "review": "What...In...The...WORLD were people thinking giving this place any more than one star?? This food is just nasty and the absolute lowest grade meat you could possibly eat! Trust me, I know about this stuff. The meat is DISGUSTING!  Best in Vegas award? Something tells me they know somebody who knows somebody. That is the biggest lie I've heard since moving here! Oh yeah, and they're over priced! What a joke. I so regret giving them my money."
        }, 
        {
            "index": 224, 
            "rating": 2, 
            "review": "Came in post lunch rush at 2:30pm and made it just in time for their lunch special. The value is definitely worth it! It ranges from roasted duck, fried shrimp, pork, and veggies that you can pick from. It comes with an egg roll and another fried app, looking like a samosa. It also comes with a free drink all for $10!\n\nThat being said I probably won't be returning for 2 reasons. 1) food 2) service\n\nThe food I ordered was the salt n pepper fried shrimp lunch special and a salt n pepper fried pork a la carte. The shrimp was good 4/5 nothing spectacular but could order again. The fried pork was terrible. The flavor was there, however 3/4 of the pieces was just fried fat. Barley any meat in any of the pieces 1/5. The egg roll wasn't great 1/5. Samosa was pretty good 4/5. There was also a corn soup and I was super hyped! I love Asian corn soup, unfortunately it was luke warm and too gooey I believe there was too much corn starch added in it.\n\nService. I sat down and the waiter was friendly (probably the only good part of service). I had to ask for the lunch special menu, maybe because I came late they didn't have it on the table. Then I went to order and looked around the room my waiter was busy and there was a waitress available. We made eye contact then went on her phone... I also had to ask from some condiments, like vinegar. It goes great with fried foods!  My waiter pretty much never checked on me until I asked. I had to ask him to come over 4 times. 1 for lunch special 2 to order 3 to get vinegar 4 for the check.\n\nIf you're in China town there's plenty other spots to check out"
        }, 
        {
            "index": 225, 
            "rating": 4, 
            "review": "I feel like lately I've only been reviewing places I didn't like so now I am going to pick a place I like and review it.  I've been to Joyful House many times and it's pretty consistently good.  My favorite thing to get here are the steamed oysters that you order individually.  I rarely am able to find this dish anywhere else but it is just so amazing.  Oysters steamed with black bean sauce and globs of garlic on top...How could that ever not be good?\n\nOther stuff I've had that were really good are: Sizzling Scallops with Black Bean Sauce and Steamed Live Rock Cod (at $80 it was a little pricey but it was divine).  Most of other items I've had were decent.\n\nThe only thing I've had here that was bad was the dessert.  I ordered the ice cream mochi and the mochi skin was dried up and not chewy, probably due the packaging not being sealed properly.  I might've been able to send it back but I didn't ask.  The fried ice cream wasn't good either.\n\nOh, and this place is open til 3am!  Ideal for blowing some money on seafood after a night of fruitful gambling (or eating your sorrows away if you lose)."
        }, 
        {
            "index": 226, 
            "rating": 4, 
            "review": "Came here for lunch with my Fiance. We ordered 2 things and became instant fans.\n\n- Salty fish & chicken fried rice.  Plenty of salty fish & chicken bits.  Not over oily.  Not too salty.  Just right.\n\n- Shanghai Dumplings aka Xiao Lung Bao.  OMG.  These are delicious.  The skin was perfect.  Not too thick and not too thin so the soup stayed where it belongs - inside the dumpling.  I was shocked to find out that it was only the 2nd day since they began selling these.  The waiter said that they were doing a test run to see how people would like it.  If I lived in the area, I would definitely come back for these dumplings.  With the first bite you can tell that they use high quality ingredients and they don't skimp on the meat at all.\n\nOkay, so maybe we're more fans of the xiao lung bao.  I'll have to revisit the next time I'm in LV.  In the mean time, you really need to come and try these before they stop making them.  This might turn their lunch business around!"
        }, 
        {
            "index": 227, 
            "rating": 4, 
            "review": "Great service. The food was decent. But kinda expensive."
        }, 
        {
            "index": 228, 
            "rating": 2, 
            "review": "Not too good, not too bad.  My husband and I ordered the salt & pepper calamari, clams in black bean sauce and sesame chicken.  The calamari was pretty good, a little overrated but came out nice and crispy w/ salt and red pepper seasoning and some sliced Serrano peppers that were hella spicy.  The clams in black bean sauce wasn't that good, the sauce was super salty (we ordered it after reading all the rave reviews on it).  The sesame chicken was good, it's our safe go to dish whenever we eat Chinese food.  Our bill came out to $47.24 including a HongKong iced tea that was never refilled, a little disappointing since it cost $3.75.  Perhaps I'm just cheap but I'm used to paying $2.50~ for iced tea w/ unlimited refills.  Another disappointment was the cleanliness, lots of dust on the wood window sills along the restaurant.  Makes you wonder what the kitchen looks like.  Better get to cleaning before Darcy Spears hits them up and they end up on Action 13 new's Dirty Dining!  Eeeks."
        }, 
        {
            "index": 229, 
            "rating": 3, 
            "review": "Service is fairly good and attentive.  As for the quality of the food, I find the food way too greasy.  I know Chinese food in general can be greasy, but this is way beyond what I expected.\n\nThey do have a fairly extensive menu and the quality of the food is slightly above average (minus the grease).  However, this has got to be one of the more expensive Chinese restaurants in Chinatown.  Frankly, I think Wendy's Noodle Cafe serves better HK-style Cantonese food at a cheaper price, and much less greasy!"
        }, 
        {
            "index": 230, 
            "rating": 1, 
            "review": "We went for Christmas eve dinner ( as Jews often do!) looking for a straight forward chinese food meal. Ordered standard fare, pot stickers, wonton soup, egg foo young, mongolian beef... the worst, brown gravy, cornstarchy, old oil tasting, salty, gooy , single note tasting chinese food I have had in years... if this wins all these banners for the best in las  vegas, they must have fed the LVRJ for free for years.\nYuck!"
        }, 
        {
            "index": 231, 
            "rating": 1, 
            "review": "We were looking for a Chinese seafood restaurant and we came across this one, I know it's been around forever so we decided to give it a try. We came in on a weekday for dinner, we were seated right the way, there were only two or three tables  but it took forever to get the waiter's attention when we were ready to order. The waiter did not speak Chinese (not saying it's an requirement, but it is a Chinese restaurant). But he didn't seem want explain when we asked him about the dishes, so we asked for the manager. The manager came over and also had an attitude. \n\nWe ordered 2 item BBQ Combo with duck and BBQ pork, honey walnut shrimp, a beef soup, Hong Kong style noodles, stir fried clams with basil, and a seafood rice noodle clay pot. The food is OK but man, the service is beyond horrible. Everyone in the staff looked like we owed them money. Needless to say, we won't be back."
        }, 
        {
            "index": 232, 
            "rating": 4, 
            "review": "I love it. Really Quality food with excellent service all served up with a smile. Seriously, awesome staff and particularly fresh items from this place. I've heard so many awesome things and it did not disappoint. \n\nScallops, \"street noodles\" and one of my favorites - garlic baby bok Choy... Even the house soup of the day.. Simple, and delicious. So awesome. I'll be back :)\n\nIt's open very late and you will be happy you went if you are fan of Chinese/Asian flavors."
        }, 
        {
            "index": 233, 
            "rating": 5, 
            "review": "Great, true Chinese food. You can't go wrong with anything on the menu. The servers and staff are great. We eat here many times every time we are in Las Vegas. Open til 3am for maximum convenience. Joyful House is excellent!"
        }, 
        {
            "index": 234, 
            "rating": 4, 
            "review": "Great Chinese food\n\nI really didn't expect this place to be this good. There are sooooo many Chinese places around here.  I had king pao chicken and potstickers.   The kp was great. The pot stickers were ma ma hu hu. (Just okay)\n\nThey have a fantastic menu and tons of live fish. Lots of great plates coming out of the kitchen.   \n\nThe service was the most impressive.   They made sure to swap out my plate after my appetizer and kept my drinks full!  \n\nGood work"
        }, 
        {
            "index": 235, 
            "rating": 5, 
            "review": "Love this place the dungin crab with salt and pepper is deliceous great food and customer service"
        }, 
        {
            "index": 236, 
            "rating": 3, 
            "review": "Food: 3 Service: 3\n\nWe came here because of Yelp reviews and photos other diners took. A caveat, we knew from previous reviews that this would be more \"Americanized\" Chinese than Yunnan Garden, where we ate an awesome meal last night.  But because we were bringing two non-Chinese friends with us, this was more in line with what they considered \"adventurous\" dining.  Our suspicions were confirmed when no chopsticks were present on the table or being used at any of the adjacent tables.   \n\nWe ordered the salt and pepper scallops, steamed flounder, Mongolian beef, green beans with minced pork, and snow pea leaf with garlic.  The salt and pepper scallops were pretty good, with a reasonably crisply breading and very hot jalapenos topping them.  One of the two specials was the steamed flounder, and it was very well presented.  However, the fish was unevenly cooked with the lowest half inch of the fish under cooked to the point of still being somewhat gelatinous.  The Mongolian beef was salty and drowning in a gravy-like dark sauce.  The green beans were crisp with a decent amount of minced pork and snow pea leaf with garlic was cooked just right.  The veggies were definitely the best of the bunch. \n\nOur first waiter was initially very helpful and filled our drink and food orders accurately.  After that, he checked on us twice to refill beers and sodas, and that was it.  The staff was mostly absent for the second half of our meal.   We had to try several times before finally flagging another waiter to get takeout containers and the check.\n\nUnless we have other friends who have very conservative palates, we won't be going back.   There are too many better places."
        }, 
        {
            "index": 237, 
            "rating": 4, 
            "review": "love this place. I liked the passion tea, the colors were pretty. it wasn't even that good, but I'd order it just because it's pretty tbh."
        }, 
        {
            "index": 238, 
            "rating": 2, 
            "review": "Omg... What happened? Dinner was all oil coated. Spicy scallops smelled off. I'm very disappointed. New chef? I'll hold off returning"
        }, 
        {
            "index": 239, 
            "rating": 4, 
            "review": "I just got home from dinner here with the family. There were 12 1/2 of us (lil madison isn't even big enough for a booster seat yet). I've been here many times already and always have a good experience, except for the one time I was here for lunch and the roast duck was all dried out. The staff is always super nice.\n\nI was here on a Tuesday a couple weeks ago and the whole roasted duck was on special. We asked them about discounted whole duck tonight and they said it's only on special Monday through Friday.  \n\nI can't remember everything we ordered. We had to get 1 1/2 orders on most of the dishes. Here is what I do remember:\n\nRoasted Duck - a whole one (\"I'll have the chicken. A whole one\")\nPan Fried Fresh Scallop w/Broccoli\nHoney Walnut Prawns\nSizzling Beef Tenderloin Mignon in Pepper Sauce\nCrispy Fried Whole Flounder Sole in Garlic Sauce\nBraised Tofu w/Black Mushroom in Brown Sauce\nSweet & Sour Pork\nFried Rice w/Salted Fish & Diced Chicken\nBeef Chow Fun\nPan Fried Spinach in Garlic Sauce"
        }, 
        {
            "index": 240, 
            "rating": 5, 
            "review": "A repeat customer.   Imperial Peking duck was awesome.  Shrimp in black bean sauce was very tasty.  Kung Pao chicken nicely spiced.  The duck is carved table side just like Wing Lei but for less than half the price. Service is excellent .  Chow mein just like the food in Hong Kong.  The food is as good as any Chinese food on the strip."
        }, 
        {
            "index": 241, 
            "rating": 4, 
            "review": "We are in Vegas for the July 4 weekend and wanted to get away from the casinos food.\n\nI searched Yelp for Chinese Restaurants and this one had 4 solid Yelp stars. It was a couple miles from our hotel so I decided to check it out.\nThis place is elegant but comfortable, you would be fine in casual wear. It is clean and the male host that met us at the door also waited on us and was very friendly and accommodating.\n\nWe ordered Mongolian Beef, Lemon Chicken, Yang Chow Fried Rice and Mustard Greens in Broth. We got our made to order food in less than 5 minutes and each dish was great. \nThe beef melted in my mouth; the Lemon Chicken was crispy on the outside and tender inside; and fried rice and the mustard green dish were both scrumptious. However, at $60.86 it may be a little pricey for some but it is worth it. Nevertheless. I am giving them 4 1/2 Yelp Stars.\n\nI will definitely come back here when I am in\nVegas again."
        }, 
        {
            "index": 242, 
            "rating": 4, 
            "review": "Well, first off, we found that Chinatown in Las Vegas is nothing like Chinatown in San Francisco. It is a bunch of shops and mini-malls spread out along about a two-mile stretch of Spring Mountain Road, west of the I-15.\n\nJoyful House has been listed as one of the best Chinese restaurants in Las Vegas, but in my opinion it's not THE best. \n\nMy wife and I and two high-school girls from Shanghai tried it out the other afternoon for an early dinner, and they, at least, seemed to think the food was somewhat authentic. We started out with bowls of West Lake Egg Flower Chowder, which I thought was somewhat bland. Adding a small amount of chili paste and a splash of shoyu (soy sauce) helped.\n\nThey ordered steamed chicken with ginger and mustard greens with mushrooms, but didn't seem to eat much of the greens. My wife and I tried the Pan Fried Spinach with Garlic, Barbecued Pork Fried Rice and Chicken Chow Fun. The latter actually wasn't much fun, as the noodles turned out to be really thick and hard to handle. We should have ordered the skinny noodles instead. I thought the fried rice was very good. \n\nServing sizes here are huge, so we had the leftovers boxed up and we found a couple of homeless guys down the street who really appreciated them.\n\nWe could have ordered a bit less and still fed one homeless person, but we got out the door for $95 (including tip) and thought it was quite a bit better than the typical Chinese place."
        }, 
        {
            "index": 243, 
            "rating": 5, 
            "review": "Amazing! I had been looking for a great Chinese place in town, and randomly stumbled upon Joyful House.\n\nI had the Half Shell Steamed Oysters with Black Bean sauce, which were absolutely fantastic and fresh. The delivery person arrived there after we had been told they were out of oysters, so these were very very fresh. \n\nI also had the Crispy Fried Tofu stuffed w/ Shrimp Paste. It came with slices of eggplant as well - and the whole thing was delicious. \n\nTo top it all off, we added some chicken fried rice. My expectations with fried rice are pretty basic, and this easily met those. Fried rice is basically fried rice....it's fairly easy for a good Chinese restaurant to not screw this up.\n\nI was pleasantly surprised by their extensive wine menu. I didn't happen to order a $1,500+ bottle of Petrus nor Lafite, but it was nice to see that was an option. ;)  For those of us who aren't on CEO incomes, they had plenty to choose from, and I opted for a $9/glass Merlot.\n\nTotal cost for two people - those three dishes and a glass of wine - was about $40. Bottom line: incredible food, friendly service, and a definite place for repeat visits."
        }, 
        {
            "index": 244, 
            "rating": 1, 
            "review": "Disgusting and overpriced tried the two most popular items on the menu honey walnut shrimp and salt and pepper pork chops and I couldn't eat past one bite."
        }, 
        {
            "index": 245, 
            "rating": 4, 
            "review": "You know you're friends with real Asian people when Day 2 of the trip... you're all craving rice! \n\nWe came in here before closing time... and thankfully they were able to accommodate our big group... I ended up just letting the ladies order... our side were mostly veggie oriented while the other table went meat crazy.\n\nFriendly service... good tasty veggie food... price was decent as well.\n\nMy apologies that I can't say much... I was so out of it while eating... my mission was just to chew and swallow. Yep, I was that tired! Nonetheless, the ladies of the group all enjoyed this dinner so I'll definitely check it out again next time around."
        }, 
        {
            "index": 246, 
            "rating": 4, 
            "review": "When we walked in the place, only three other tables were occupied and they soon left, leaving us the only diners in the place.  It was a Monday evening, after all.  My sinking feeling got worse when I saw therre was a fairly small (for a Chinese place) selection of poultry dishes.  I opted for sauteed shrimp and onions in a spicy garlic sauce and my wife ordered the sesame chicken.  Both were very good.  Mine was VERY good.  And being the only diners in teh joint, attentive service was a given.  This irestaurant is VERY seafood-oriented.  Recommended."
        }, 
        {
            "index": 247, 
            "rating": 4, 
            "review": "A Chinese hot pot place?!  Richard C. proclaimed that Joyful House offered such a treat after 10 pm!\n\nLast Friday night, the Husband and I ventured over to Spring Mountain to find out if such a thing really did exist.  We were only expecting Chinese hot pot, not AYCE for the mere price of $15.50/pp.\n\nWe were easily persuaded and a quick peek at what they offered helped as well.\n\nAs they set up the gas stove and dual hot pot, they also provided two dipping sauces - one being a chili oil and the other a sesame-like paste.\n\nEverything was laid out nicely on a couple of tables along the back: \n\n* octopus balls\n* beef balls\n* pork balls\n* wontons\n* dumplings\n* chicken\n* beef\n* pork\n* squid\n* mussels\n* shrimp\n* napa cabbage\n* spinach\n* bok choy\n* tofu\n* tofu sheets\n* flat rice noodles\n* vermicelli noodles\n\nI'm sure they had a few other things that I forgot to mention.  Also in the broth was taro and radish.\n\nFor dessert, they offered complimentary red bean soup and fortune cookies.\n\nService was surprisingly attentive.  It was slow when we arrived shortly after 10 pm, and there were a few diners.  Business picked up with at least two large parties also enjoying the AYCE hot pot.  The staff was good at refilling our water, tea, and asking if we needed more broth in our pot.  They had a lot of staff around, so that was a good thing.\n\nLate night AYCE Chinese hot pot begins at 9 pm! \n\n3.5 stars"
        }, 
        {
            "index": 248, 
            "rating": 5, 
            "review": "This is place is legit!  The food here was awesome and the service was great.  I was with a group so we collectively ordered a whole bunch of stuff but I opted for the Hong Kong style Shrimp plate and the Steamed Tofu with Chinese Greens.  The Hong Kong noodles were perfect and not overly saucy like some of the other places I've tried in Chinatown.  I love the crunchiness of the noodles and the amount of sauce was perfect and kept the outer edges of the noodles crunchy enough to enjoy.  The tofu came out soft, hot, and ready to consume.  Nothing too special going on with the tofu but that's actually how I expected it to be so I was okay with it.  The servers were friendly and checked up on us without being so overbearing about having enough of anything or whether I needed more water after taking 2 sips.\n\nOverall, a great experience!  Will return to grub again soon."
        }, 
        {
            "index": 249, 
            "rating": 4, 
            "review": "Delicious food with excellent service. The food was delivered to us in quick manner and all at once as well. They also have boba tea which was good too. If you want some above average Chinese food this is the place to be."
        }, 
        {
            "index": 250, 
            "rating": 3, 
            "review": "The environment is clean with a spacious dining area. \n\nThere is a wide menu selection of seafood items \n\nWe ordered the following dishes:\n\n1) Yang chow fried rice with BBQ pork and shrimp.\n\n2) Fillet fish with vegetables\n\n3) Sesame chicken\n\n4) Half duck\n\nMy favorites were the fried rice and sesame chicken. The taste of each dish is average."
        }, 
        {
            "index": 251, 
            "rating": 3, 
            "review": "Food was pretty good; service was prompt but not excellent; open til late night like at least 2am.  I loved the fried fish filet in cream corn sauce; portion was not small and good enough to feed the hungry crowd!  For those of you looking for something fancier like shark fin, bird's nest, etc., this place's got it!  Prices in general were alright and acceptable."
        }, 
        {
            "index": 252, 
            "rating": 2, 
            "review": "My husband and I decided to try this restaurant because of the reviews. We ordered the pan seared Chilean sea bass, chicken fried rice and sweet and sour chicken. The sea bass was terrible! It was soaked in oil. The sweet and sour chicken was made with dark meat and precooked. The fried rice was excellent. I sent back the sea bass and was given the explanation of \"this is how it's made\", with an attitude. I asked for beef and broccoli instead. It was delish. As we the service, we were approached and asked for the entire order. We had not even looked at the menu. We weren't offered dipping noodles or tea, as the table behind us was. We will not be returning to this restaurant."
        }, 
        {
            "index": 253, 
            "rating": 4, 
            "review": "Luckily, the place is decent sized with many tables, so although it gets busy, you won't normally wait too long to be seated. \n\nTea is a given to be served straightaway, but water isn't. But suppose it won't kill anyone to have to ask. \n\nWe ordered: Wor Wonton Soup, Chicken Chop Suey, Honey Roasted Walnut Shrimp, Beef Chow Fun, and  Fried Flounder\n\nWor Wonton Soup is always good to me. Has everything I like in it from various vegetables to meat to squid. Yes.\n\nChicken Chop Suey was average. Not bad, but nothing special.\n\nThe Honey Roasted Walnut Shrimp never goes wrong. Ever.\n\nI normally really like the Beef Chow Fun here, but I remember it was pretty salty this past time. They could work better on controlling their salt actually on other dishes as well.\n\nI was a little disappointed with the Flounder. It's one of my favourite dishes, but it was my first time trying it here. Like the Chicken Chop Suey, it was good, but not as good as I had hoped.\n\n\nOverall, I have eaten here a lot with my family. There are ups and downs, but nothing has happened that would stop me from coming back."
        }, 
        {
            "index": 254, 
            "rating": 1, 
            "review": "This place is absurdly expensive and a tourist trap. They don't have any lunch specials on the weekends or a lunch menu for that matter, so we had to order 1 plate of honey walnut shrimp from the dinner menu (even though it was 2:30pm on a Saturday afternoon). \n\nHoney Walnut Shrimp with Mayonnaise $16.50 -- The portion was small (10 med/small sized shrimp) the shrimp tasted very fishy, not succulent and like they were freezer burned, plus they barely gave us any walnuts. We did not enjoy this dish at all. KJ kitchen's version costs less, gives you more shrimp and gives a ton more walnuts. Or you can go to China Tango Bistro in Summerlin and get a delicious, generous version for only $12! They rip you off here.\n\nTheir rice was super hard and dry - I have no clue how a legitimate Chinese restaurant can mess this up? \n\nAlso, I was shocked they didn't have the real deal homemade authentic saté chili sauce in oil. They brought out the commercial bright red sambal oelek from a bottle which tasted weird and sour, not spicy at all. Very disappointing. \n\nOur 1 dish, rice and a soda was not worth $20, everything was unsatisfactory.\n\n----- to that person who messaged me to move out of Vegas because my honest review insulted him. \n\nI will not! :P you're not the boss of me. but I will sit here and laugh about your idiocy and share it with all of my friends! :)"
        }, 
        {
            "index": 255, 
            "rating": 4, 
            "review": "If ever there was a place away from the strip that offered great Chinese food, this is it. I love eating Chinese food, and the one thing that I use to gauge their greatness is honey walnut shrimp, or walnut prawns. This place has the best honey walnut shrimp in Vegas so far, and I base this on the food from home.\n\nWatch how far you drive down Spring Mountain--this place is right off Decatur and Spring Mountain in a little strip. Although the building is a bright color, at night it is still easy to miss. Parking is a bit tight, but it is worth it!\n\nWhen you walk in, the Buddha statue is at the entrance with piles of coins from customers on his belly. I always rub his belly when I walk in. The servers are very attentive--and all male--and there is no wait for a table. The menus are easy to read with the set dinners on the very first page, but if you feel adventurous, I would suggest the more foreign dishes to eat. They are truly authentic, serving black fungus and jellyfish, shark fin soup, among other things. Most Americans would never order these dishes, but trust me--you have to try it.\n\nWe ate the honey walnut shrimp (obviously), black fungus and season vegetables, braised tofu, wonton noodle soup, and jelly fish. It was all oustanding, all in their right sauces and the vegetables with that nice slight char from the breath of the dragon. The tofu was perfect, and the black fungus was cooked just right. I love cold jellyfish, and this was one of the best that I've had in Vegas.\n\nOverall, the meal was outstanding and reminded me of the Joyful restaurant back home on Guam. We waited four minutes for our food, and everything was cooked perfectly, presented beautifully, and tasted spectacular.\n\nWho says that you have to eat on the strip? Save some money and go to the side streets. You never know what gems you may find."
        }, 
        {
            "index": 256, 
            "rating": 5, 
            "review": "Been going here for years! Love this place! We always order our usual beef chow fun with gravy,honey walnut shrimp , salt and pepper pork chops and salted fish fried rice..yumm! Best Chinese food I've tasted by far."
        }, 
        {
            "index": 257, 
            "rating": 5, 
            "review": "Love Love Love this place! Get the roast duck, some sweet and sour pork, and the honey walnut shrimp. They prepare them the old fashioned way, with love and taste in mind! Always professional, responds with sir and ma'am, never hovered over the table, always checked us at appropriate times. We brought the whole family, from my dad ( a senior) to my son ( a 1yr old).  They were extremely welcoming even if we did come in late, they didnt try to hurry us out because of closing time. We were the last ones to leave, but they still acted as if we were spending a million dollars in the restaurant. Come here if you want to be served like a king!"
        }, 
        {
            "index": 258, 
            "rating": 4, 
            "review": "Went to Joyful House with my friend on his recommendation. Found that Joyful House had a very comfortable atmosphere with a wait staff that was friendly and always waiting our request. We had ordered the Black Sea Bass, fried noodles, Honey Walnut Shrimp on a previous Yelp recommendation and Chicken in Black Bean Sauce. Honey Walnut Shrimp was quite honestly the best I've ever had. Fried Noodles were very good and the Black Sea Bass was good too. I've had better Sea Bass, but it was good. I just prefer my Sea Bass too be a slight bit on the sweet side in the preparation. The Chicken in Black Bean Sauce was tasty too. But back to the Honey Walnut Shrimp, that dish was the highlight of the night! Very happy and will return to Joyful House in the future!"
        }, 
        {
            "index": 259, 
            "rating": 3, 
            "review": "On a recent trip my boys and I had a \"ChinAtkinese\" diet here at Joyful House.\n\nWe ordered the salt and pepper pork chops, honey walnut shrimp, and sizzlin beef in satay sauce. \n\nMy favorite dish was the Honey Walnut Shrimp.  I was delighted to see more shrimp than almonds; however, the dish was small in size overall.  The sweetness originated from the honey (of course), a dash of sugar or brown sugar, and a hint of coconut milk.\n\nThe pepper pork chops were tender with a small spicy kick to it.  The sizzlin beef was okay.\n\nEven though the plates were small we were actually satisfied but not totally full.  \n\nThe service was Americanized compared to a typical Chinese restaurant.  Everyone working was fluent in English.  Our food was delivered fast as well."
        }, 
        {
            "index": 260, 
            "rating": 2, 
            "review": "I guess you wouldn't expect great chinese food in Vegas but there's got to be something better. Some dishes were good but when it comes to more upscale dishes, this place fails miserably. There's not much authenticity to there dishes. I also sense a little bit of shadyness when someone orders Peking Duck and they keep the duck after slicing off the skin."
        }, 
        {
            "index": 261, 
            "rating": 5, 
            "review": "5 stars not just for being open until 3am but for providing consistently great food until the wee hours of the night.  I used to come here a lot more (when I had a well-employed boyfriend who always paid!).  Since it's been frugal times around these parts I've been going out to eat a lot less.  This weekend we had a late night out and forgot to eat dinner, I suggested this place because I remembered the hours and how good the food was.  So we rolled in at about 1am, no problem getting a table!  The service was great and the food was as yummy as I remembered.  The menu is huge so you can have more traditional REAL Chinese food and Americanized versions, too.  And the kill tanks are pristine!"
        }, 
        {
            "index": 262, 
            "rating": 3, 
            "review": "Conveniently located in Las Vegas' Chinatown on Spring Mountain Road, Joyful House offers authentic Cantonese food served by friendly and helpful waiters.  \n\nWe started with the chicken and corn soup and then had the chicken and mushrooms with veggies.  Both were good.  The sizzling plate beef with onions was a bit salty for my tastes.  Salt and pepper pork chops were very good.  Good Fukien fried rice with gravy.  \n\nEasy strip mall parking."
        }, 
        {
            "index": 263, 
            "rating": 4, 
            "review": "Stopped by here after a late night of casino hopping. I wouldnt say it's the best chinese food ever, but it did the job especially for late night. Plus that it opens til 3am."
        }, 
        {
            "index": 264, 
            "rating": 2, 
            "review": "The past few times I have visited Vegas, I have been in search of a damn good Chinese restaurant.  The mister was craving some Chinese food, so we busted out Yelp on his iPhone and Joyful House was highly recommended.  Per some suggestions made by other Yelpers, I ordered the pan fired spinach in garlic sauce, the sauteed shrimp in sweet and sour sauce, e-fu noodles, and 1/2 order of peking duck. \n\nThe food was alright.  Nothing that kicked my socks off.  The peking duck was dry and slightly rubbery.  Also, they didn't even serve it with the bao bread or those puffy chips.  I liked the e-fu noodles, but it was a tad bit salty.  The shrimp was average and the spinach is something I could've cooked, so it wasn't special to me.  \n\nIf this place is the best Chinese restaurant in Vegas, then I am afraid to try the other places.  Perhaps I have higher expectations since I have tasted great Chinese food back in Cali like in Chinatown, Monterrey Park, Alhambra, Rowland Heights, etc. I won't give up, the next time I am in Vegas, I will try another place and see how it is."
        }, 
        {
            "index": 265, 
            "rating": 5, 
            "review": "The food offered at Joyful House was delicious, and the service was incredible.  As I write this, I am fondly remembering my Hong Kong style noodles and craving them.  I think I may order some after work!"
        }, 
        {
            "index": 266, 
            "rating": 4, 
            "review": "My SO and I were craving really good Chinese food. This was our first time trying this place out and also from being out of town. We ordered the Option B  includes hot and sour soup, fried egg rolls , cripsy lemon chicken,  beef with black beans , and chicken chow mein, which was all good and impressed. The service was good and very attentive. I'm glad my SO picked this place, we'll be enjoying our leftovers for breakfast lol. :p"
        }, 
        {
            "index": 267, 
            "rating": 5, 
            "review": "This place had a big hype to live for when I first visited.  A lot of my friends kept telling me of this place.......and they were right.  The restaurant itself does not really stand out for me, typical looking, but the food was very good.  My favorite was the honey walnut shrimp. I always loved that dish and this place did not fail in making it good.  My friends ordered the spicy salt and pepper pork chops.  That was very tasty and was how it should be, crispy outside, but moist and tender inside.  It really is easy to eat here, if you're in a buig group like we were, just order a bit of everything and everyone just picks off different plates.  This place is a defiantly to come back to and I'm a fan now."
        }, 
        {
            "index": 268, 
            "rating": 1, 
            "review": "I arrive at 11:50 pm to this place, just to order something to go!! WORSE MISTAKE. At the door a mexican guy ask me if i know what to order? Well this guy was some how disappointed cause i was alone, probably he was a spectin a big party!! Lol, anyways i seen worse people in the restaurant bussines. Then i order a combination fried rice $12 something but this dish have nothing of combination!! No chicken, no srimp,NO SHIT. What a joke , people avoid this place an go to the panda express they have better food."
        }, 
        {
            "index": 269, 
            "rating": 5, 
            "review": "This place ranks in the top 5 with my family. The food was excellent and plentiful! Our group of 4 adults and 3 children(under 10) was treated very well. They were very nice to the kidlings and grea with us grown-ups too. More then enough food to make us all happy. Thank you for making dinner out with friends so very nice!"
        }, 
        {
            "index": 270, 
            "rating": 5, 
            "review": "Best of Las Vegas 2014 !!!  Way to go.  Love the food, been going to Joyful House for 15+ years.  Always been a reliable Chinese restaurant."
        }, 
        {
            "index": 271, 
            "rating": 4, 
            "review": "Yum! I'm not a huge lover of true Asian food - for example, my favorite Chinese food is served at Panda Express. Despite my best intentions, I typically balk at the stuff people actually eat in places like Vietnam and Taiwan. You can understand why I was a little leery of venturing to a Chinese place on Spring Mountain for dinner with my coworkers the other night, especially when it was recommended by the Taiwanese guy! I consulted with him and he assured me that 'americans' like myself would still be able to find something to eat at Joyful House, so we decided to check it out. \n\nThe restaurant is quite large and well-lit, with a bunch of (like 15) tanks for fresh seafood that you can see. It seemed like a pretty legit operation and my coworker was already conversing in mandarin (or something) with the friendly wait staff, so we knew we'd be treated to a wide variety of dishes.\n\nSpeaking of wide variety, everybody ordered a bunch of stuff and then my coworker spoke to the waiter and apparently ordered like 6 more dishes. Everything is family style, so we had waaaayyyy too much food, even for our large group of like 12. Here's a quick run down:\n\nGarlic Baby Bok-Choy - loved it. Not bland like your usual veggie dishes. Highly recommend.\nMandarin pork chop - the favorite of several people at the table. Sweet and breaded, which is my fave.\nSizzling steak - just ok. We were pretty pumped after the sizzling presentation, but it wasn't anything special. Not spicy (despite the warning on the menu).\nClay pot scallops - served with rice noodles and really good.\nSeafood dish - don't know what it was called, but I really liked it. It came with shrimp, crispy noodles, and some other stuff I can't remember. My 2nd fave.\nClay pot eggplant - good not great.\nPork fried rice - standard.\nString beans with pork - good not great.\nAppetizer soup - just the soup they serve to everybody, I guess - beef broth with nothing in it. It was as good as you can make beef broth, but the 1 year old LOVED it, so bonus for that.\nTapioca Dessert Soup - no thank you. If you're into tapioca, you might like it.\nLemon iced tea - really good! Sweetened, but not too sweet. I actually had two glasses, which I usually don't do.\n \nPrices were kinda high - $15-20/meat dish, but everything was good, including the service.\n \nAny time I have somebody in town craving a 'fancier' Chinese meal, we will definitely take them to Joyful House.\n \nBonus points for being open late (til like 3am)!"
        }, 
        {
            "index": 272, 
            "rating": 4, 
            "review": "Awesome roasted duck, which I ordered based on my fellow yelpers reviews here.  Good call peeps!  I'm still drooling over that one. Also tried the combination pan fried noodles (with soft noodles) and it was quite good, although I only found 2 shrimp, they were big shrimp and extremely flavorful.  Seemed to have mostly pork in it, which was really good though.  Can't wait to go back and try their hot pots!  Extreme yum-quotient here, so check it out ASAP!  \n\nAlso, thumbs up to their awesome interactive online menu.  All restaurants should have a web site like theirs."
        }, 
        {
            "index": 273, 
            "rating": 4, 
            "review": "Best Chinese food I had in Vegas so far. Would rather go here than the expensive restaurants in the Vegas strip.\nAnd staff was very helpful!"
        }, 
        {
            "index": 274, 
            "rating": 5, 
            "review": "My wife and I are new in town and use Yelp as well as some friends input when looking for a particular kind of food. Such was the case in finding Joyful House. We arrived around 5:30 or so and were seated immediately.  Our server came over within 2-3 minutes to ask what we would like to drink and if we wanted water. The drinks and water were returned almost immediately as well as a hot pot of delicious tea. Our waiter was very helpful in choosing our dishes. However, the portions are way too large to be shared by just two people and should be considered food for four, especially is you plan on trying several dishes. We started with pot stickers and they were simply outstanding. We did not realize the dinner was served with a large bowl of steamed rice and ordered combination fried rice, which was excellent, but not necessary. Based on another review we tried the Walnut Prawns which were simply outstanding. We also had Sweet and Sour Pork as out second dish. Way too much food for two people so guess what we are having for lunch today. Next time we will wither go with four people or order a little less food. Initially, prices seemed high, but when we saw the amount of food it was well worth the price. We have started a folder of restaurants we have enjoyed and keep a copy of the menu in there for future reference. Needless to say Joyful House menu has been added. This is definitely a keeper!"
        }, 
        {
            "index": 275, 
            "rating": 3, 
            "review": "order a claypot from the menu it come out different they substitute my chicken to pork spare ribs without telling me"
        }, 
        {
            "index": 276, 
            "rating": 4, 
            "review": "I loved the fried noodles here!!! Yummy. The deep fried tofu and halibut were pretty good too."
        }, 
        {
            "index": 277, 
            "rating": 3, 
            "review": "The food quality was pretty authentic and price point reasonable; however, there was no \"Joyfulness\" in their service.  There was no greeting upon our entry.  What was uttered represented a grunt at best.  And like with too many Chinese restaurants, do not expect the server to return to check after serving your dishes.  The only person who communicated and provided some positive attention was the non-Asian bus boy, or maybe he was a waiter-in-training.  \n\nIt was a quiet night so several waiters stood a few feet from our table surveying the empty tables.  Guess they had nothing else to do; they stared at times and never said a word or cracked a smile.  \n\nThey should remove the \"Joyful\" name from their business and replace with \"Me-No-Smile Chinese Restaurant.\"  If hungry for Chinese food in Las Vegas, give them a try; just do not expect a \"Joyful\" atmosphere, because that's false advertising!  Will I go back again if in LV?  Maybe.......food was tasty."
        }, 
        {
            "index": 278, 
            "rating": 1, 
            "review": "This was my favorite restaurant before it was shut down. I went there yesterday and the fried rice was horrible! I ordered the House/Combination fried rice and it had very minimal of the extras.. Basically it was only fried rice with lots of pees!!! I was very disappointed :-'("
        }, 
        {
            "index": 279, 
            "rating": 2, 
            "review": "not as hot as i would have thought. \n\nhad 3x 10 people dinner tables. \n\nSoup was bland, no taste, had to add vinegar and some pepper to bring out the taste (note~, i'm asian so i don't need a lot of MSG). \n\nhad 3 different kind of Seafood. One was Lobster entree and the other was Fish. 1 person i knew went back to the hotel and had a horrible stomach ache. 3 others has allergic reactions because of the seafood. \n\nthe place had pretty good business. I didn't order or choose what dishes we were going to have that night, but perhaps, if i ordered things that were more my style, it would be better?. Service was pretty good probably because we had 1lobster and 1 fish per table. I dunno the price but, 15/20 bucks per seafood entree multiply by 3 = a lot of money + tips. LOL"
        }, 
        {
            "index": 280, 
            "rating": 5, 
            "review": "So far this is my favorite Chinese restaurant.  It is consistent. Everything tastes good. I always order the salt and pepper shrimp and beef chow fun. When I crave Chinese this is my go to."
        }, 
        {
            "index": 281, 
            "rating": 3, 
            "review": "Clean Chinese restaurant along Spring Mountain Road. I guess the cleanliness, cloth table napkins and servers wearing tux are the reason why this Chinese restaurant is overpriced!\n\nWe had the basic salt and pepper pork chops, HK style seafood noodles, Chinese mustard greens with garlic and 1/2 order of roasted duck for $60! \n\nThe flavor was ordinary, nothing fancy. \n\nNot sure if I'll be back. I suggest you just go to neighboring Chinese restaurants."
        }, 
        {
            "index": 282, 
            "rating": 5, 
            "review": "In my drunken stupor, I fell asleep in a taxi while my friends navigated and ended up at this heavenly Chinese food establishment. They wouldn't stop raving about how good the food was, and it definitely lived up to the hype. Years later, I couldn't remember what this place was called or where it was. But I could never shake the memory of how delicious this food was. My meal was interrupted by my boyfriend throwing up after being passed out on the table. The next day he never heard the end of us all talking about the food and how he had missed out. But in my internet searches I found a picture of this place and was instantly excited to come back again for my next Vegas trip. I'll make sure my boyfriend is sober this time."
        }, 
        {
            "index": 283, 
            "rating": 4, 
            "review": "Sweet corn chowder pretty good,( I would have liked it better with WHITE MEAT not dark meat, that's just me)\nOrdered Kung Pao Shrimp, but they brought us CHICKEN? We took it, & it was still yummy. And the best part was the Chilean Sea Bass steamed with bean sauce but hmmmm it had bones? Never ever had my Real Chilean sea bass WITH BONES? But the flavor was buttery & creamy and we could NOT stop eating it EVEN after we were full!!!\nWE WILL 4 SURE BE BACK!!!\nMost Asian clientele...."
        }, 
        {
            "index": 284, 
            "rating": 2, 
            "review": "Despite all the awards, there was certainly nothing spectacular about the meal - or the experience. \n\nWe were promptly greeted and seated - right under a TV airing Glee, and a speaker playing Top 40 from the 90s. A few people were seated in our section after we were...all American. The Asians were seated on the opposite side of the restauraunt. \n\nWe weren't offered any chopsticks...because we are American. \n\nThe food was really, really not great - especially for $30 per person. I could have ordered the same quality and taste from china a go go...maybe even Panda Express, for half the price. \n\nBut...the tea was good. \n2/5 would not dine again."
        }, 
        {
            "index": 285, 
            "rating": 4, 
            "review": "Definitely love the half price lobster when they had the special. I ordered the lobster with thai chili sauce and it was to die for. I ordered the lobster fried with xo sauce before and it wasn't as good as the thai chili style. Honey walnut prawns were the best. Fried sea bass was fresh too. baby bok choi with garlic was a little greasy but perfect. Word of advice, take a chinese friend with you who knows how to order cuz the experience will b 10,000 times better."
        }, 
        {
            "index": 286, 
            "rating": 5, 
            "review": "So, in the car with fellow yelper Trev W. and were in China town looking for a place we haven't been.     I suggest to \"just pick any place...    I'm sure it will either be Awesome or it will at least be a story\"...       Now the sound of screeching tires...   a wild left turn from the right lane and we were there...    at Joyful House.\n\nOnce we thanked the gods that we were still alive...  we checked the yelp reviews...      a lot of them... and a really good average.  Alright, looking forward to this.\n\nSo the place is kinda what I was hoping for...     something that didn't look like a high over-head \"Asian Fusion\" type place like PF Changs (all do respect to PF...   I do love the Mongolian beef)...   it's simple and to the point...    kinda like a dinner.  Think denny's.   We got seated right away and menus came out to us...   we started looking at stuff but noticed that on the first page were three combo set dinner options...   we made it easy and ordered option 1...( We are not picky...  no food allergies...     we were just hungry)\n\nOh My God...    Come HUNGRY\n\nOut comes tea...     that's cool...   then a very large bowl of soup...Sooooo tasty.   \n\nNext egg rolls, dumplings, and other assorted fried goodies.....     MMmmmmmmm\n\nOk now rice.   Not a little but a huge plate of the rice along with chicken chow mien...     man...    there was a lot of food....  but wait there's more\n\nTwo more huge family style plates of noodles and sweet and sour chicken.   Table now covered in food...  and good food.   We ate and we ate but alas...   we barely ate half of it.    \n\nListen if you're looking for the Vegas Strip style place...   this is not your place.   If you want to be seated and fed in a relaxed, local and unpretentious place, then give this a shot.   \n\nI've read some of the other reviews about the bland food and what not and I feel bad for those people that they had a bad experience.    Clearly they came on an off day because what we got was great....     \n\nNow I just need to go and digest....     \n\nSoooooo   Fuuuuuuullllll\n\nPS    My fortune cookie was empty...   I have no fortune...    Oh my god I'm gonna die!!!!    Ok maybe not"
        }, 
        {
            "index": 287, 
            "rating": 5, 
            "review": "Ooooh, yeah. We had a hard time choosing dishes to order because everything sounded good! They brought out the food really fast. We ended up getting 4 dishes for 3 people and thought we would have leftovers. Nope. Cleaned every plate. They also gave us the baby tapioca for dessert. We also ordered a red bean shaved ice. It was a little too sweet, so we just diluted with water. Satisfied my craving for chinese food. Their food hits the spot!"
        }, 
        {
            "index": 288, 
            "rating": 2, 
            "review": "I generally agree with yelp but in this case the 265 other reviewers are dead wrong. The food was bbbllllannnndddd as hell. No spices or sauces on the table, not even chop sticks. The meat was fatty and cheap, the noodles plainly sucked and were flavorless and the whole meal was pretty pricy as well. \nIf we wanted super white washed Asian food we could have stayed on the strip but dating an Asian has it's drawbacks as she needs to eat Asian food at least once a day.  All I heard all night was how awful that place was and how the owner brings shame to his family by serving such terrible cuisine.."
        }, 
        {
            "index": 289, 
            "rating": 4, 
            "review": "Thanks to Kevin and his night crew for providing superb service!!! Good food and pricing in the heart of Chinatown LV. Back to Cali I go until next time!!!"
        }, 
        {
            "index": 290, 
            "rating": 4, 
            "review": "Super authentic Hong Kong style cuisine. Everything was on point with flavor, portion sizes, and service. My only gripe is the place is a little pricey for what it is. You can get similar style cuisine and quality at other places on Spring Mountain for a little cheaper. Nonetheless the service here was great which is pretty rare for Chinese restaurants. Even the busboys and runners here are friendly and helpful. Also the place is very clean including the bathrooms, also a rarity for CR. Have you seen the bathrooms at Sam Woo?? Ew. If you don't mind paying a little more for great Chinese food, cleanliness and service this place is certainly the spot to be."
        }, 
        {
            "index": 291, 
            "rating": 5, 
            "review": "This place never fails I'm always happy when I come here. The employees here are amazing and respectful. Food is always fresh and great! Anyone who is hungry this is the place to eat!"
        }, 
        {
            "index": 292, 
            "rating": 1, 
            "review": "Says they are open 3:00am. Show up at 2:25am to order food to go and I'm told the kitchen closes at 2:30. Won't be back. Don't care how good the food might be. Customer service is not their priority."
        }, 
        {
            "index": 293, 
            "rating": 4, 
            "review": "This stand alone building on Spring Mountain road may not look like much from the outside, but once you step inside you might feel underdressed. With white linens and waiters dressed in suits, it's got an upscale vibe. But, most of the customers seemed to be dressed as casually as me. \n\nTheir menu is massive. It's a large book full of items that will satisfy those looking for authentic fare and those looking for Chinese-American food -- the kind you can get from any corner take out spot.\n\nKung pao chicken was heavy on sauce, but a decent portion size with plenty of chicken, green peppers and nuts. Shrimp fried rice was light on ingredients (other than rice) but the flavors were solid. If you're a fan of bok choy, the mushroom and bok choy dish had just enough sauce to let the ingredients shine while enhancing their flavors. My favorite dish of the night was the tender, well seasoned beef in oyster sauce with green onions. I loved the flavors of the sauteed green beans, too with it's subtle use of heat and minimal amounts of oil. If fish is your thing, try the seabass. Flakey and delicate, it was a well executed dish with a light buttery flavor. Not as successful was the house fried half chicken. The skin was perfectly wafer thin and crispy, but the meat was bland and dry as a bone.\n\nPerfect for large parties, it's also great for families. Kids will love the aquariums full of crabs, lobsters and other future meals."
        }, 
        {
            "index": 294, 
            "rating": 5, 
            "review": "My favourite Chinese food in Las Vegas.  Very nice staff and great food."
        }, 
        {
            "index": 295, 
            "rating": 5, 
            "review": "As always, our lunch was excellent.\n\nIntroduced another set of friends to the wonder that is Joyful House on New Years weekend.  They were as impressed as we always have been!  The interior has been remodeled a bit recently, looks great!  Staff is always kind and helpful.  Food is exceptionally prepared and served.  I highly recommend the Sweet Corn Chowder, Peking Duck, Chicken (or beef) soft noodle... well, the reality is that we have never disliked anything we have ordered.  Ever.  Coconut Shrimp is a fave, too."
        }, 
        {
            "index": 296, 
            "rating": 5, 
            "review": "Don't listen to the negative reviews, this is a great authentic restaurant. Diego our server was on point, and the busser and the other server who greeted and sat us were all friendly and prompt. Im a server at a fine dining restaurant here in Vegas and the service was great. We had the hot and sour soup and it was perfect, reminds me of the wonderful days I spent working at a Cantonese restaurant in Seattle over 10 years ago. We also had the Manilla clams in black bean sauce which were again, wonderful as expected. We washed it down with Tsingtao  and for $30 something (plus $10 tip...dont forget to tip people!!!) you can't go wrong. It is not overpriced anyone who says so is cheap. I can't wait to go back and try everything else! Oh and they close at 3am which is a bonus!"
        }, 
        {
            "index": 297, 
            "rating": 5, 
            "review": "Joyful House has the best Chinese food. We ventured off of the strip and into Chinatown and loved all of the menu options -- of which there are many. Anything you order is going to be amazing. They have shark fin options on the menu though, eek. \n\nWe had hot and sour soup, completely delicious. At the server's rec, we ordered the pan fried sea bass and sweet and sour scallops. We also had crispy noodles with vegetables, seafood and chicken (I can't remember the name of the dish). \n\nThe manager came and chatted with us for a bit, too. The service was excellent and the food was even better. We are definitely coming back next time we are in Vegas."
        }, 
        {
            "index": 298, 
            "rating": 5, 
            "review": "awesome food! \n\nnever left this place disappointed. i discovered this place a few years ago and became an instant fan! i try something new every time. the honey walnut shrimp was surprisingly good i didnt think i was gonna like it but i did. salt and pepper pork chops were cooked perfectly cooked, a nice crispy and tender in the middle. cant remember the other dishes my friends ordered but i couldnt find anything wrong with the dishes we shared. \n\nthe prices on the other hand i remembered them to be slightly lower before. but none the less still an awesome meal to end a vegas trip!"
        }, 
        {
            "index": 299, 
            "rating": 4, 
            "review": "I love Chinese food and I heard that this restaurant serves good food. The place was clean and the server was friendly and attentive. I enjoyed their food and all I can say is their honey walnut shrimp, beef crispy noodles, beef and chinese brocolli was great but I didn't think their fried rice was that great. Their menus are kinda expensive but I just want to try it. Well see If I will come back to this place again..."
        }, 
        {
            "index": 300, 
            "rating": 4, 
            "review": "Purpose of visit: late night dinner after watching the pacqiano fight. He was so robbed by the way. We decided to head to Chinatown for some Kate night Cantonese food. Joyful house is open late. We ordered salt and pepper shrimp with the skin on. A must try the shrimp were fried enough to make the skin crisp and you old eat it in one bite. Fantastic flavor. Salted fish in clay pot was a also a good choice. The tofu was tender and the fish slightly tender. The chicken and black bean sauce was good but was probably the weakest dish that we ordered from a flavor perspective. Not a spicy as they say it is. We also ordered fried Singaporean style noodles with seafood. Noodles were slightly crispy and the fish topping very tasty. Excellent place for quick, reasonable late night dinner. Decor is to be expected uninspiring and rather dated but you don't go there for the people or the atmosphere but for the food."
        }, 
        {
            "index": 301, 
            "rating": 1, 
            "review": "If you go to a Chinese restaurant to eat make sure you see at least 10 Chinese people eating not standing around watching TV.  If you don't see them run. One of Funniest things I ever heard in my life the owner or maybe not was talking to a couple next to our table saying I require my staff to speak English. Really?  I asked for a jack and coke what came to the table was regular coke. I asked the server what's up? He said we don't have that. I said take the coke away he gave to the couple sitting next to us.  Joyful house! Our shrimp in lobster sauce came out with canned mushrooms strange.  My wife Asian was laughing. She said check out your fork I think they used that one to fix the drain in the kitchen seems the forks and spoons have been there sense 1980's it wouldn't be so bad if the food was really fantastic. Costco has GREAT deals on quality table wear on MLK (TIP OF THE DAY) I asked the server what is in the dumplings he said chicken. I asked if they had shrimp of pork dumpling he said you can go up the street if you want that. OMG! I said we will try the dumplings how many do you get ?  He said 5 - I said r u sure the menu says 6. He said 5 only. Ok served 6.  Keep in mind we went in early before 5pm to check this place out. I was here 12 yrs ago and it was pretty good. How many signs do you need that say vote #1 in the 2011 RJ readers poll inside your restaurant? I think I counted 6 big ones and a CNN international one blocking the front door.  Don't believe everything u read. It's  Dec21st we are all still alive and the food is below average. RJ readers poll is rigged.  Look I have been to Asian restaurants around the world this place is NOT in the top 100.  Maybe the real employee's are on vacation?  Hmmmmm..."
        }, 
        {
            "index": 302, 
            "rating": 3, 
            "review": "Been here a couple times but last week was the first in awhile. Figured it was time to write a review on this place now having visited it once again.\nMy mom loves this place. For this latest visit, it was a family affair. I don't know how weird this sounds. For I, upon walking into Joyful House, the ambiance feels like how I'm used to a chinese restaurant feeling like. I will admit the food is slightly pricier here. To be fair, the food is, for the most part, decent to very good. They do serve complimentary jasmine rice, which not every place would have. Jasmine is very fragrant and less starchy than say, a long grain calrose. It does cost more and better, at least I think so. Along with complimentary hot tea. Even though most chinese restaurants serve these 2 items complimentary, it is worth mentioning since I am aware some places charge for them.\nService overall has been ok. Everyone is very friendly and helpful. There seems to be a lag sometimes when it gets real busy to get something or having water or hot tea refilled. And believe me, this place does get busy! I give Joyful House a solid 3.5 stars."
        }, 
        {
            "index": 303, 
            "rating": 2, 
            "review": "The food is good, but the device we received was HORRIBLE!  Don't take your issues out on customers.  This waitress was ridiculous. We shouldn't have to get the hostess to ask for waters and drinks.   Most places I go to your food comes out all at the same time. Not one dish at a time and then have to wait an extra 7 minutes for the last dish and the waitress sit it on a totally different table and walks away. I am sure I can find another restaurant where both the food and SERVICE is good!"
        }, 
        {
            "index": 304, 
            "rating": 4, 
            "review": "The food is so good here. A must try is the roasted duck, salt and pepper lobster and combination fried noodles. Very high quality here. I wish there was a Joyful House in Orange County. The service is pretty good."
        }, 
        {
            "index": 305, 
            "rating": 4, 
            "review": "Really good beef with peppercorn hot plate, salty fish fried rice was on point my friends. The Shrimp in the Kung Pao were humongous. I checked out the restaurant prior on YouTube and Yelp. Apparently they won Best In Vegas Chinese for 2011 and 2014. Definitely did not disappoint and I manage to capture a few Pokemon here. Boo yah or shall I say, \"Gotcha\"!"
        }, 
        {
            "index": 306, 
            "rating": 3, 
            "review": "It's open till 3am, so it's got that going for it. It's decent, not OMG great, but at 1am and Ichiza's packed and you've been burned-out of Shuseki, Joyful's a good place to go. I've gotten the Hong Kong style beef chowmein, and it was good. The salt and pepper porkchop was -meeeh-. Not as good as others i've had. No black pepper is used, just jalapeno.(not a huge fan of it)\n\nGood for late-night Chinese cravings."
        }, 
        {
            "index": 307, 
            "rating": 5, 
            "review": "My family and I have been going to joyful for so long that I don't even remember the first time. We would go for family birthdays or just because this is the best Chinese place in Vegas."
        }, 
        {
            "index": 308, 
            "rating": 5, 
            "review": "After a second visit I realize that not only is Joyful House above average Chinese but they are also very high end Chinese Dining.\n\nWhere else can you order Geoduck and not too many places offer Abalone. I do note that these are very high end luxury seafood items and do cost around $60. $70. a portion. They also have a variety of many reasonably priced fresh fish dishes and daily specials. Free range chicken is also on the menu. (I've never seen that at any other Chinese Restaurant).\n\nWe ordered the Sweet Corn Soup for two. Actually the portion is enormous and can feed 4-6 people. It's delicious and anyone would enjoy it. Our waitress offered us a hot chili sauce and soy sauce condiments with the soup.\n\nI had to try the Braised Tofu with Bamboo Fungus. (I think it cost around $12.00) The presentation isn't good but the dish actually tasted good. Bamboo Fungus is actually a veil from a mushroom grown in Asia. It really has almost no flavor on it's own but does have a most interesting delicate texture and is suppose to be extremely beneficial to your health. Under the Tofu and Bamboo Fungus was a large pile of fresh Chinese Broccoli.\n\nThe Special of the day was Whole Flounder for $23.00 so we ordered one fried and it was served  de-Boned Table side.\n\nJoyful House was a Joyful Experience and is on my Las Vegas Rotation!"
        }, 
        {
            "index": 309, 
            "rating": 1, 
            "review": "Horrible food. We ordered won ton noodle soup and the flavor was horrible. Well let's say it had no flavor. We couldn't even finish the soup. The worst won ton soup ever. \nOur other dish was Chicken Chow Fun the rice noodles. Another lousy dish. We left food on the plates and left about 10 minutes after we got the food. The only thing decent was the tea \nI would give them minus stars if it were possible . I don't know how these restaurants even stay open"
        }, 
        {
            "index": 310, 
            "rating": 3, 
            "review": "I went to this place on a recommendation, we are from Green Valley and have struggled to find a chinese place we like.  The food was pretty good and portion sizes were huge.  I only gave it 3 stars because of the service.  Our waitress never came to check on us.  We would have to ask random employees for more water, salt & pepper (they were not on any table) and sugar for the tea.  When we requested sugar, the lady kind of scoffed at us.  They took our food away to put it in to-go containers, which I really don't feel comfortable with.  Then they refused to give us the steamed rice in our to-go container; however, they came and swooped it off the table.  Leading me to wonder where is that rice going?  I would probably eat here again, but it did not end my quest for the best chinese place in Vegas."
        }, 
        {
            "index": 311, 
            "rating": 5, 
            "review": "This is the best Chinese food I've eaten and it's not close. Highly recommend the lunch specifically. We got the salt and pepper pork chop and it was ridiculous. We will return because it's a heck of a bargain."
        }, 
        {
            "index": 312, 
            "rating": 3, 
            "review": "Our crew needed some eats after the Hoover Dam tour so we decided to check out what Joyful House had to offer.  After looking at the expansive menu we decided on three dishes.  We ordered the salt and pepper pork chops, honey walnut shrimp, and sizzlin beef.\n\nThe honey shrimp was ok, my friend makes it better, maybe because she drizzles it with the sauce.  The same goes with the sizzlin beef, nothing to oh ah after.  This was recommended by our server.  It was tasty but nothing orgasmic.\n\nMy favorite were the chops, as they were juicy and tender!  It was seasoned and cooked perfectly for my taste buds.\n\nServing size were small as we ended up going to In-N-Out a few hours later.  Service was excellent and our food came out rather quick, like within 10 minutes from placing our order."
        }, 
        {
            "index": 313, 
            "rating": 2, 
            "review": "I was so excited because when I called this place to place an order, the guy actually spoke enough English that I thought I didn't have any problems talking to him! I always order Chicken and Broccoli, and since I've moved here from the East Coast I have noticed a lot of places put mushrooms in it. I don't want mushrooms, chicken and broccoli, I want chicken and broccoli. So I thought I would be smart and ask whether or not it had mushrooms before I ordered it. He said no, reassuring me that there wasn't and then asked me if I wanted American broccoli or Chinese broccoli. I thought all broccoli was the same, but silly me. So I said American, being safe. Well I received me food and found mushrooms all over the dish. I guess he didn't understand as much English as I gave him credit for!"
        }, 
        {
            "index": 314, 
            "rating": 2, 
            "review": "Recently came here for lunch with my wife.  We were really disappointed with the dishes that we ordered.\n\nSizzling beef tenderloin mignon with satay sauce.  Did not taste like mignon beef.  I had to cut the pieces of beef into smaller pieces to make it less chewy.  The satay sauce was not spicy and very salty.\n\nMapo tofu tasted too sour.  It had way too much pickled peppers and not enough spice.  The consistency was also thick and almost slime-like.\n\nCrispy pan fried noodle with beef was ok.  The beef texture was almost the same as the mignon beef, but just a little thinner.  It also tasted like they cooked it in a pan that they had just cooked something with seafood in it and did not wash the pan. \n\nThe servers were nice and friendly.  Just wished the food matched their service."
        }, 
        {
            "index": 315, 
            "rating": 4, 
            "review": "The salt and pepper shrimp was fantastic. I didn't have the opportunity to try the calamari but if its anything like the shrimp, it's probably just as fantastic. My husband had the chicken chow fun with black bean sauce and that was ok. He said he would not order it again because it lacked the smoky flavor that other Chinese restaurants have in their chow fun. The Chinese broccoli was a little aged so some of it was stringy and towards the end there were a few pieces that were gritty.  I would definitely come back here for the salt and pepper anything."
        }, 
        {
            "index": 316, 
            "rating": 1, 
            "review": "Worst dining experience I ever had. \nWe  came to this place because of the restaurant was \" Voted The Best Chinese Restaurant of Las Vegas 2014 by Las Vegas Review-Journal Poll\" .\nService was bad, waitress was extremely rude. The portion of the dishes are much smaller compared to the price charged. Food was average, as matter of fact the shrimp that we ordered did not taste fresh. I don't think they live up to its rating. \nI will never come back to this restaurant."
        }, 
        {
            "index": 317, 
            "rating": 2, 
            "review": "Apparently quality Chinese seafood restaurants are not that easy to find in Vegas.\n\nWent two days in a row and had the live Dungeness crab both times.  Second time was particularly disappointing, with the crab meat having no texture and the garlic pork scallion sauce burnt to the point of excessive bitterness (and no ! it was not the 2.75 lbs they charged for); the fried squid appetizer was tough and tasteless as well.\nThe service was non existent and for dessert they actually served rotten watermelon -- they must be clueless.\n\nThe first occasion was better, but after going back its clear this place really doesn't care."
        }, 
        {
            "index": 318, 
            "rating": 1, 
            "review": "Yuck. \n\nThe best part about this place was the ice water. \n\nAll of our appetizers were undercooked, and when we got our entrees, it was clear that our food was recently frozen. Went here because of all the good reviews, will not ever return. Take your money elsewhere.\n\nA huge $50 mistake."
        }, 
        {
            "index": 319, 
            "rating": 5, 
            "review": "We went the three of us and each of us ordered different appetizers, entrees and desserts. EVERY dish was superb. Give this restaurant six stars, five stars are not enough."
        }, 
        {
            "index": 320, 
            "rating": 2, 
            "review": "Overrated and overly priced. The food was half decent and the customer service wasn't that great - had to ask for our water 3 times.   Lobster and Dungeness crab was 3-4 times more expensive than a normal chinese restaurant - $65 per pound for lobster, I might as well eat at an actual 5 star restaurants in a 5 star casino.  Don't come here unless you want to waste your money.  If you're going to spend this much money, I recommend Blosom restaurant located inside the Aria Casino and Resort.  My review might be harsh because I've had better food or the same food quality for a much lower price."
        }, 
        {
            "index": 321, 
            "rating": 5, 
            "review": "Great customer service, great food! Just a few notes, lunch portions are huge, interior is nice & warm, its clean. Thanks again! Will definitely go back!! ^_^"
        }, 
        {
            "index": 322, 
            "rating": 3, 
            "review": "I used to love this place, but over the years there have been many Chinese restaurants that have opened with better prices. Joyful has kept their price high.  \n\nThe food is good, but pricier than others. My usual order at Joyful are:\n\nEggplant and Tofu Hotpot w/ Shrimp Paste\nEgg Foo Yung\nShark's Fin Soup\nGreen Beans with X/O Sauce\nFried Tofu\nSalt & Pepper Pork Chop\n\nDon't get me wrong, the food here is amazing but it is pricier than others so I give it A-OK."
        }, 
        {
            "index": 323, 
            "rating": 4, 
            "review": "Outside building don't look so cool. Inside looks decent like other restaurants. They have really good service though. The food was pretty good, and I plan on going back there to eat again. I'd ordered the seafood clay pot, which was delicious. They made it spicy for us. The flavor was tasteful and not overwhelming. We also had the fried pork chop. I like the light salt and hot peppers seasoned over it. The pork chop had some parts too fatty though. They also brought out complimentary soup and green bean dessert drink for us. Next time, I will try their hot pots. It's a minimum of 2 people. I left the place indeed feeling joyful."
        }, 
        {
            "index": 324, 
            "rating": 4, 
            "review": "Great food, cool fish, nice lobster. Fortunes could use some work. Boba tea 10/10 recommend"
        }, 
        {
            "index": 325, 
            "rating": 1, 
            "review": "I eat out a lot but never made reviews until today but I felt I had a civic duty to warn you especially with these rather suspiciously positive reviews.  This place is horrible.  This food is not authentic and poorly made.  The food came instantly out showing this is not freshly made. It's sad that even the Chinese food in Vegas buffets are even more authentic and better quality than this place.  Run away and be wary of any positive reviews of this place!!!!"
        }, 
        {
            "index": 326, 
            "rating": 4, 
            "review": "Service is always good. Get the following:\n\n1. Peking the duck\n2. Honey, you like walnut shrimp?\n3. Garrick n peppa powkchop \n\n... Portions are huge so bring your friends and your fam.. & me! But you're treatin! \n\nWhy 5th star? Cause they don't have sriracha! I mean, c'mon, isn't sriracha Chinese hot sauce?"
        }, 
        {
            "index": 327, 
            "rating": 3, 
            "review": "Third year in a row here. Family style authentic Chinese food in the middle of Chinatown. Don't think we picked as good dishes this year. Most not a fan of the duck. Tofu dish was a little bland. Good value for the money. Will be back."
        }, 
        {
            "index": 328, 
            "rating": 5, 
            "review": "First time here for us. Nestled in the heart of Sin City's \"Chinatown;\" this place is a gem of qualify Chinese food with an authentic atmosphere that keeps you feeling welcome even after you leave. \n\nWe had the \"Dinner A,\" which includes mushroom eggdrop soup; a small appetizer medley of egg rolls, wontons, and pot stickers; chicken fried rice; beef choy mein; sweet and sour pork; and cashew chicken. We also had hot tea and Thai iced coffee with boba!\n\nLiterally everything was perfectly prepared and delicious! What do we recommend? Yes. Thank you Joyful House, we'll be back!"
        }, 
        {
            "index": 329, 
            "rating": 3, 
            "review": "We ordered the beef chow fun, peppered beef, roast duck and garlic eggplant... All pretty good, especially the duck.. \nPretty suprised for a place open late.. think they're open till 2am, but not sure.\nGonna have to try the hot pot next time."
        }, 
        {
            "index": 330, 
            "rating": 5, 
            "review": "Fantastic food and fantastic service!  Great value for the price.  Lots of food to take home afterward.  Will definitely be back."
        }, 
        {
            "index": 331, 
            "rating": 4, 
            "review": "I have been here multiple times on different Las Vegas trips, food is absolutely delicious and authentic.  We have ordered fresh seafood, tofu, noodles and many more .  They offer fresh Chinese vegetables here as well you have to know what to order or you can ask them and they will be happy to assist you with the ordering.\n\nThe only down side to this restaurant may be it is a little pricy but it is worth it because you do get what you pay for.\n\nDefinitely good Chinese food."
        }, 
        {
            "index": 332, 
            "rating": 4, 
            "review": "Loved it. Had fried tofu and the green beans with minced pork. Both were delicious...plenty of leftovers. Nice, friendly, chatty service -- I lucked into a slow hour :) Definitely recommend it and plan to come back"
        }, 
        {
            "index": 333, 
            "rating": 1, 
            "review": "This place had good food...but served 5 different varieties of Shark Fin soup.  'Nuf said."
        }, 
        {
            "index": 334, 
            "rating": 1, 
            "review": "I've been here a few time and never had bad service until today. Today was one of the worst service. The food wasn't great. We had to wave them down to get service. Sad part was we were the only one dining in. It was just all bad!!!! I don't even want to give them any stars"
        }, 
        {
            "index": 335, 
            "rating": 5, 
            "review": "Delicious! We decided to go outside our comfort zone and got a chicken and Chinese sausage clay pot and it was to die for. We also got pan fried soy sauce noodles which were great and the Mongolian beef which was so-so but that's what I get for ordering a standard. Appetizers included moo shu pork (yum!) and hot and sour soup which was delish. Great service. Clean. Ill be back."
        }, 
        {
            "index": 336, 
            "rating": 5, 
            "review": "This was the first restaurant I was brought to when I moved to Las Vegas, and I make sure to bring all of our friends here when they come to town! (Actually, I come here any time I am in the mood for REALLY good Chinese food!) This restaurant's \"salt and pepper\" anything is delicious - my favorite is the salt and pepper sea bass. The service is usually pretty good, but when they are super busy, the servers can be a little preoccupied. But - I still love this place!"
        }, 
        {
            "index": 337, 
            "rating": 3, 
            "review": "I tried Joyful House today with a friend because another friend has always told us that it is delicious.  It was pretty good.  We had the Steamed Tofu in Seared Soy Sauce and the Marinated Pork Chops.  The Steamed Tofu was just alright.  The tofu kind of lacked flavor.  The Marinated Pork Chops were really good though.  It was not amazing, but it was pretty good.  \n\nI definitely will be checking this place out again to try other things.  They do have a happy hour from 11 am - 5 pm, and 10pm-3 am.  It is a little pricey.  The service was pretty good as the waiters were pretty attentive."
        }, 
        {
            "index": 338, 
            "rating": 1, 
            "review": "Ordered 2 items:\n- half roast duck\n- clay pot sea bass with tofu\n\nFlavor of food is just OK.  Not spectacular.\nHowever service this evening was horrible.\n\nWe waited more than 30 min, before the waitress realized that we haven't got our food yet.  She actually may not have realized it if the busboy had not pointed it out to her.\n\nThen she rushed in to the kitchen to check on our order and pushed our order.  The roast duck with rice came frst.\n\nIt's another 15 min +before the fish came.\n\nSo for sure will not come back to this place anymore ..."
        }, 
        {
            "index": 339, 
            "rating": 4, 
            "review": "We ventured out to Joyful House with another couple and had another very good meal but not a five-star dining experience.  The broth of Seafood Wor Wonton Soup was quite flavorful, and the filled wontons very memorable, but a scary-looking Calamari, tough scallops, and inferior pork made the soup a story of contrasts.  Average-sized pan-fried Potstickers were good and I received my several requested condiments of sliced ginger, Sweet & Sour Sauce, Potsticker Sauce with onions, Hoisin Sauce, and Hot Chili Oil without any difficulty, and Shrimp-Fried Rice with carrots and peas was very good.  \n\nBeef & Snow Peas with Black Mushrooms in Oyster Sauce was a sumptuous Cantonese dish, and Kung Pao Chicken had a nice level of controlled heat.  Service by the well-trained and disciplined staff was consistently on the ball and responsive to needs.\n\nFour solid stars this time out!"
        }, 
        {
            "index": 340, 
            "rating": 2, 
            "review": "We ate at Joyful House two saturdays ago. We ordered egg rolls, kung pao shrimp and roasted duck. The duck was a major disappointment. It looked decent at first, but once I dug in it was fatty, tough and grizzly. I've never had to work so hard to get to the meat before. Our waiter came by and asked how we were doing, I mentioned that the duck was very difficult to eat. He brought me wet naps. It was appreciated, but a knife might have been more helpful. \n\nPhotos are posted."
        }, 
        {
            "index": 341, 
            "rating": 4, 
            "review": "Don't be that person that comes here and gets basic Chinese takeout dishes and whines that this place is overpriced. I mean, you can (and they kind of are), but you're far better off doing their specialty dishes like the live seafood (always check the specials!) and hot pot. \n\nIf you're not that adventurous, it's okay. You will be pleased with anything cooked salt and pepper style- shrimp (get it with the shell on), pork chops, and calamari (shout out to Amelinda for the suggestion!), are all good but the squid is best. \n\nNOTE: Despite the old-school diner-style exterior, it's nice inside with linen table cloths and waiters in vests. Maybe opt for takeout if you're wearing gym clothes."
        }, 
        {
            "index": 342, 
            "rating": 3, 
            "review": "Used to go to Joyful House for the oysters in black bean sauce which was wonderful. Went tonight and yesterday and they did not. have my oysters. The restaurant is behind the times. No brown rice, you have to say \"no msg\"... Get with the program. Seafood is pricy and mediocre. If you are going to charge the same amount as Jasmin in the Bellagio, then bring on the waterworks show and delicious food. I'm not going back there. Money is not the issue--the quality has gone down.  I am merely recommending Jasmine as an alternate spot."
        }, 
        {
            "index": 343, 
            "rating": 5, 
            "review": "Have gone to this place several times. The first time based on the reviews on Yelp. \n\nTry the seafood with tofu in clay pot. Delicious. My wife raves about their salt and pepper pork chops; and seafood hotpot. My fav is always the chicken chow fun. \n\nLast night had the dried chowmein and chicken...not so good this time. The noodles were wet, not crispy. Update: went there again last night with my mother-in-law from Ukraine. Her first Chinese food and she loves the seafood hotpot and chicken chow fun.\n\nThe tofu with veges are awesome. T\n\nWe have to try their crabs and lobster some day."
        }, 
        {
            "index": 344, 
            "rating": 4, 
            "review": "Good chinese food in vegas?  Yup, I was pleasantly suprised.  The food here is standard chinese restaurant food, good but not excellent.  It is better than what I like to call \"Chinese Themed\" restaurants that you'll find in the casinos.  Trust me, it's better than the strip stuff."
        }, 
        {
            "index": 345, 
            "rating": 2, 
            "review": "Our server had zero personality and was basically a robot. Super unfriendly. We had to ask for water. We ordered Moo Goo Gai Pan and Beef with broccoli, and they were both not good. The vegetables and rice were good. The meat in both dishes was slimy and soft. Will not be returning."
        }, 
        {
            "index": 346, 
            "rating": 5, 
            "review": "CNN didn't give this place Top 50 Best Chinese Restaurants in America for nothing! This goes far beyond just a good Chinese restaurant. The seafood and meat was as fresh as it could get and the flavors were matched to perfection. I do not like msg, or salty food. This place made the flavors of the food pop, without any heavy sauces or salt. It was Chinese food heaven. A MUST eat before you die."
        }, 
        {
            "index": 347, 
            "rating": 4, 
            "review": "This is definitely the best Chinese in town. It has become part of our Christmas Eve tradition (Chinese and A Christmas Story), but I would eat it anytime. Our must haves are:\n\nSalt and Pepper Pork Chops - SO delicious! Small pieces of pork that are breaded and fried. They are served with some salt and peppers for just the nicest hint of spice. Seriously you must try these!\n\nBeef Chow Fun w/ Soy Sauce - Nice thick noodles in a savory brown sauce. The most perfect Chinese noodle dish.\n\nWe also enjoy the sesame chicken (although not the best I have had), Mongolian beef, and the sauteed sliced chicken with cashew nuts. Definitely some great food, although they have shark fin soup on the menu which really irks me, tisk tisk Joyful House. Such a deplorable practice (stepping off soap box). Other than that, the food is delicious and worth a trip next time you find yourself in Chinatown."
        }, 
        {
            "index": 348, 
            "rating": 4, 
            "review": "Been here 2 or 3 times now. Easy to find parking (right outside restaurant), good service, medium sized place, good portions, tasty food and not too oily.\n\nThe last time I went, we ordered:\n\n- Sizzling Beef Tenderloin Mignon in Pepper Sauce - Very tender, delicious, tons of onions\n- Pan Fried Spinach in Garlic Sauce - tasty\n- Combination Pan Fried Noodle - nice and crispy\n- Beef Chow Fun in Black Bean Sauce - yum!\n- Fried Rice w/ Salted Fish & Diced Chicken - small bits of salted fish here and there that are easy to mistake for chicken until you taste it\n\nGreat place for Chinese Food in Vegas! (especially if you need to eat dinner early because you have a show to watch or if you want a break from buffets)"
        }, 
        {
            "index": 349, 
            "rating": 4, 
            "review": "Solid 4\n\nI have dined and done late night takeout for several years and always had good service and solid food. \n\nFor those who are looking for a place for large groups. They do a good job on service. We hosted a party for a graduation. Of course the restaurant was packed from other graduates, food came out hot, fresh, and in a timely manner. Always had hot tea, ice water filled. The tables that had larger eaters were taken care of (they asked if that was enough) and even though they were busy, still pushed there food out first. \n\nFor those looking for high end Chinese food this is not, but it should not leave you disappointed."
        }, 
        {
            "index": 350, 
            "rating": 4, 
            "review": "This is one of the best Chinese restaurants in town. they are open pretty much all the time (I believe they close at 2am)  there stuff is always very friendly and on top of everything - well not literary :) - I would recommend their crispy noodles, Mongolian beef , fried rice... well everything is great. If you are going with a group their family menu offers you a lot of food for a good price- I would say 2 orders would feed 3 people easily."
        }, 
        {
            "index": 351, 
            "rating": 4, 
            "review": "This was our second time coming here, and we enjoyed it just as much as the first time.  We actually came specifically for the salt and pepper fried tofu with garlic, which was amazing!  The pieces of tofu are perfectly deep fried, but not oily, and the tofu inside is so soft.  We also had garlic gai lan (Chinese dark green vegetable) and a sizzling platter with beef and onion.  The food was all excellent.  I wish we had the lobster/crab special, but we were on a budget.\n\nThe service is just OK, but typical of a Chinese restaurant.  This place was named best Las Vegas Chinese restaurant in 2010."
        }, 
        {
            "index": 352, 
            "rating": 5, 
            "review": "Brought the family here after having a great experience during our last Vegas trip. They accommodated our very large group perfectly and with no notice. Food was very good all around and service was excelent. Will likely be back every time we stop in Vegas."
        }, 
        {
            "index": 353, 
            "rating": 4, 
            "review": "I always get the peking duck and deep fried sea bass those two dishes are very good..everything else is what you expect just a little pricey.."
        }, 
        {
            "index": 354, 
            "rating": 5, 
            "review": "Dude. Get off of the strip and head to china town for the most amazing food of your life! We had the Chilean sea bass steamed with black bean sauce as well as the Kung pao chicken and a corn chowder soup with chopped chicken. The sea bass was melt in your mouth, buttery goodness. There were small bones in it, however, so beware. The Kung pao was amazing too. Both were served with rice and we sipped on their jasmine tea. It was PACKED so call ahead like we did. A+++!"
        }, 
        {
            "index": 355, 
            "rating": 5, 
            "review": "We had a great meal here!! We ordered some live Dungeness crab, that was turns into salt & pepper crab! We ordered some of the fresh Santa Barbara spot prawns, and a Peking duck! All on point and totally delicious! Not the fanciest place, but amazing food!"
        }, 
        {
            "index": 356, 
            "rating": 5, 
            "review": "Always great Chinese food and excellent service. Let me be more specific... \n\nThe shrimp wonton soup has great hong kong style flavor, the noodles are al dente, and the wontons are shrimpy and delicious. The server comes to the table to serve and portion the noodles and wonton for each person on the table (they keep it fair whenever possible). \n\nOn another occasion, I came in with my mom and she noted how good and flavorful the white rice was. I don't really eat white rice much, but apparently it's a big deal to traditional Chinese folk. I think they think if the restaurant can't get the rice right, then what does that say about the rest of their food. \n\nSince moving out here, I miss my mom's soups/elixers and to get a taste of home, I like to order their house soup. This is on the menu but it's usually some traditional soup that Chinese families cook at home. Nothing like Egg drop, Westlake or Hot and Sour soup. It's usually a combination of chicken and pork broth based with herbs and vegetables. Generally it's good for your body or health, but it depends on which soup. \n\nIt is a little pricier than some of the more casual Chines restaurants but it shows in the quality of ingredients."
        }, 
        {
            "index": 357, 
            "rating": 4, 
            "review": "When this restaurants wins Best Chinese Restaurant by Las Vegas Review Journal Poll and has been featured on Food Network and CNN voted it top 50 best Chinese Restaurant in the whole USA you've got to try it.\n\nThe outside doesn't look much but the newly renovated inside is welcoming and just oozes good food vibes.\n\nSo many must orders such as the Salt & Pepper Pork Chop, Imperial Peking Duck & Crispy Fried House Chicken. \n\nBest food to cure your hangover though heavy handed on the MSG so beware!\n\nCheers!"
        }, 
        {
            "index": 358, 
            "rating": 5, 
            "review": "This is hands-down the best Chinese restaurant I've ever been to. The customer service was amazing, and the food was orgasmic. Everything that entered my mouth was delicious and cooked to perfection.\n\nWe ordered the chicken corn soup, combo fried rice, fried oysters, lemon chicken, gau gee mein soup, honey walnut shrimp, and beef broccoli. Every single bite of every single one of these dishes was tasty and savory. We could taste the freshness of the ingredients in the dishes. It was ridiculously good.\n\nOur waitress was very attentive and friendly. She made sure that we were satisfied with the food and that our glasses always remained full.\n\nThis restaurant went above and beyond our expectations. We will be sure to return as often as possible."
        }, 
        {
            "index": 359, 
            "rating": 5, 
            "review": "We came here for my grandmother's birthday dinner and this was fantastic Chinese restaurant! We ordered at least ten dishes and they were all very delicious and authentic. The only complaint I have was that the beef slices were too tough, but other than that everything else - fish, vegetables, seafood, etc - was great. They even served us complimentary dessert! I would definitely recommend this Chinese restaurant to authentic folks!"
        }, 
        {
            "index": 360, 
            "rating": 4, 
            "review": "Good food and fast service! The best part is that they're open late!"
        }, 
        {
            "index": 361, 
            "rating": 5, 
            "review": "All I can say is WOW!! Well maybe I can say more than that, AUTHENTIC, FRESH, FRIENDLY, DELICOUS. They brought out our seafood alive prior to cooking so that we knew that our meal was fresh. EAT HERE!! It is only minutes from the strip. The staff at these off srtip places are so greatful to have you there they make the experience one of a kind with their attentiveness. SUCH AMAZING CHINESE FOOD!!"
        }, 
        {
            "index": 362, 
            "rating": 4, 
            "review": "Man, each time we eat here, we're not disappointed.\n\nNot a huge fan of eating entirely on the strip, my party tooled out on Spring Mountain and decided to gorge out here.\n\nThings to get whenever you're in Joyful House:\n\nSalt and Pepper Squid\nHot and Sour Soup\nBlack Bean Sauce Crab\nMa Pa Tofu\n\nNow, make sure that the guys hear you correctly.  We ordered the crab but maybe he heard \"crap\" - the waiter ended up bringing out a totally different dish.  We had to send it back but at least they were \"friendly\" about it.  Yes, for what we could tell, they didn't spit in our food.  But man, that crab was the $hit and we killed the entire thing.  All 2.5 pounds of it."
        }, 
        {
            "index": 363, 
            "rating": 2, 
            "review": "Not very good Chinese food in my opinion.  Had lunch there this week with my wife. We ordered the Garlic chicken and Kung Pao Chicken.  The lunch specials come with sweet corn soup -  not bad, egg rolls - greasy and bland, fried rice - greasy and bland and tea. The main chicken courses were also greasy and bland, dumbed down, I think, for the laowai among us. \n\nMuch better and more authentic Chinese in Chinatown in Vegas. Try Yunnan Garden, for instance. \n\nWe won't be back to Joyful House."
        }, 
        {
            "index": 364, 
            "rating": 4, 
            "review": "The food is great there duck is a killer and beef with gai lan taste perfect.  The food serving is small each dish can only feed 2 people.  There  duck can serve 4 people easy.\nNot  bad at all"
        }, 
        {
            "index": 365, 
            "rating": 5, 
            "review": "It doesn't get more joyful than this people.  Lunch special is sick and you can easily share with a group and at $7.50 for an eggroll, curry puff, soup, entree selection, and a limitless drink.  You can't go wrong.  Open till 3 am people so anyone who gets out as late as I do and wants to get their chinese food on, go.  Only place I can take my man for chinese food that he actually likes and he is super picky about his asian food.   Out of all the joints in chinatown to eat, best HONEY WALNUT SHRIMP  to date. Nuff said!"
        }, 
        {
            "index": 366, 
            "rating": 3, 
            "review": "The best thing about this place?  Closes at 3 a.m.\n\nNext best thing?  The service.  There are some nice folks here.\n\nThe food?  Just okay.  Also, all the seafood seemed extremely expensive.  And that comes from a guy who usually doesn't look at pricing.\n\nThe gf and I had:\n\n- Cilantro, Preserved Eggs, & Sliced Fish Filet Soup (pretty good)\n\n- Clams in Black Bean Sauce (nice and tasty clams)\n\n- Sizzling Tenderloin Mignon in Black Pepper Sauce (sounds incredibly tasty, tastes like nothing)\n\n- Chilean Sea Bass with Tofu & Black Mushrooms in Clay Pot (not a bad dish, but had I known the sea bass was going to be deep fried, I would have opted for the steamed version)\n\nI think I also ordered one other dish, but for the life of me I can't remember.\n\nAnyhoo, nothing really wowed us here.  Plus, we polished all of our food, which surprised us, because we thought we'd get bigger portions than we did."
        }, 
        {
            "index": 367, 
            "rating": 4, 
            "review": "My coworker swears by this place for their authentic cantonese cuisine.  We went there after work one night for some late night grub.\n\nIt's a very nice restaurant in chinatown complete with live fish, prawns, lobster, and crabs.  We went for takeout so we couldn't really judge the service but the guy that seats you was really nice and helpful.\n\nMy coworker recommended the salt and pepper pork chops.  Since I had always been told by my ever-so-seasoned fellow yelper/coworker reggie to always order salt and pepper anything whenever I can, I agreed to try said pork chops.  After about a 15 minute wait, the waiter brought out our food.  It smelled great and I couldn't wait to get home to try it.  I opened up the to-go box and there were small breaded pork chops (some with bone, some without) that had bits of garlic and jalepeno all throughout the dish.  It came with rice as well.  When I dug in I couldn't believe how tender they were.  These pork chops just melted away in my mouth.  The contrast of the jalepeno against the pork was incredible with just the right amount of heat and saltiness.  All in all it was a great dish and I would definitely go back.  They had a lobster sale while we were there...19.95/lb down from 29.95/lb and these things were monsters!  Anyways, check this place out...it's great for late night eats."
        }, 
        {
            "index": 368, 
            "rating": 5, 
            "review": "I always make sure to stop by here when in Las Vegas. This is a true authentic chinese restaurant! It will definitely satisfy your chinese food cravings. I always get the peking duck and they carve the whole duck in front you and serve it on shrimp chips. Always call ahead to find out if they have the duck available since they sell out quickly. I was the lucky one today to get the last catch of the day! Lol i meant the duck. The staff are very attentive too and its about 10 mins drive away from the strip. So if your using a cab to get there make sure have the address ready from yelp to let the cab drive know too since they all arent familar with the restaurants off the strip. Its nice to at times get away from the fancy dinners on the strip and try it out."
        }, 
        {
            "index": 369, 
            "rating": 1, 
            "review": "Went there following yelp reviews for lunch. Seeing that they had 4 stars my expection  was high, I must say. But I was a little taken back when no one was there. Should have been a sign but I trusted my fellow yelpers. \n\nServers were nice. But food was very low quality. Because the menu was all over the place I went for what I know. Beef and broccoli (can't go wrong there) boy was I wrong!!! Beef was low grade skirt steak. Just bad!! Had the hot and sour soup. And must admit that was good. But entrees where very disappointing. Overall I'm giving them a 1 star. I would definitely not recommend this place."
        }, 
        {
            "index": 370, 
            "rating": 5, 
            "review": "Best Chinese food in Vegas.  Pleasant experience all around.  Great chef great servers.   We take out there all the time and dine in for the past 15 years.  Never had a problem ever.  Best BBQ pork anywhere."
        }, 
        {
            "index": 371, 
            "rating": 4, 
            "review": "Stumbled onto another Chinese place in Vegas, we wanted to try many things they have to offer, but we arrived late night.  The ambience was clean and classy like a traditional place.  They have enough for mid-size parties.\n\nThey did not seem to have any Late Night specials, just the regular menu.  We got some bean sauce oysters, the flavors were good and oysters were fresh.  BBQ Platter was ok probably due to being late at night, they got the essential components, the meats were reheated, but the cold dishes in the center tasted good.  The House Pan Fried Noodles was good.\n\nJoyful House provided a somewhat joyful experience for us late at night, although not everything was perfect, but the place seems promising.  The AYCE Chinese hotpot sounds exciting, so until next time."
        }, 
        {
            "index": 372, 
            "rating": 5, 
            "review": "The food was delicious and was worth way beyond the price paid; the best Chinese restaurant I have ever been to.  They play nice songs and the interior is nicely designed.  The staff was very friendly, they accommodated my specific food request; some have difficulty speaking English.  \n\nHonestly, the worst part about this place is that I feel I'm ripping this place off since everything was amazing!"
        }, 
        {
            "index": 373, 
            "rating": 4, 
            "review": "I love the salt fish fried rice here. This is the best place in town for it. The chow fun was really good too. But what brought me back here was the amazing wine list. Are you kidding me? Petrus? Lafite? What?\n\nYou wouldn't expect it from this typically family-oriented chinese restaurant but they have an impressive wine list where you can spend thousands on a bottle of wine if you wanted to.\n\nConsidering their late night hours, I'm not surprised they offer these bottles. I'd imagine some high rollers come in here for a late dinner after some serious gambling."
        }, 
        {
            "index": 374, 
            "rating": 5, 
            "review": "A must try for anyone who enjoys Chinese. When we come to Vegas this place is one of our favorites. Food is beautiful and clean. I mean not oily. The duck is outstanding as is salt and pepper pork chops. We love all the beautiful  seafood, vegetable dishes and soups. They are know for their seafood and have a variety of fresh fish and shell fish to offer kept in the wall of aquarium tanks at the front of the restaurant.. Go and enjoy."
        }, 
        {
            "index": 375, 
            "rating": 5, 
            "review": "Best Chinese in town.  Been coming here for over 10 years.  Love it."
        }, 
        {
            "index": 376, 
            "rating": 4, 
            "review": "Best Chinese food I've had in Vegas. Quick courteous service, pleasant decor, large portions and everything was cooked as I specially requested. Much better than that PF place. Easy to get to from my hotel on the strip, too."
        }, 
        {
            "index": 377, 
            "rating": 3, 
            "review": "We went for lunch after a hike at Red Rock.  We both got a lunch special which comes with a curry wonton, egg roll, rice and egg drop soup.  I ordered the salt and pepper shrimp.  These were whole large shrimp cooked shell and head on.  I didn't taste much pepper, more of a salt and garlic shrimp.  They were hot and sauteed with jalepenos.  He got the Kung pao chicken and had a taste.  It wasn't that spicy, though the veggies were very fresh.  The sauce was really sweet to me though.  The pork fried rice was okay, had nice big chunks of pork in it.  \n\nThis was a nice change than restaurants off the strip.  The service was really good and prices were great for lunch."
        }, 
        {
            "index": 378, 
            "rating": 4, 
            "review": "Having lost my shirt at the roulette table only a few minutes earlier, my friends and I decided that we need some good old comfort Chinese food.  Hubby pulled out his new phone and found this place.  We hopped into our rental van and away we went.\n\nIt was about 9:30 when we strolled in - understandably, the place was deserted.  They tried to seat us directly in front of the entrance but were quite accommodating when we asked for a table more out of the way.  \n\nPrices are higher here, compared to your typical Chinese/HK style seafood restaurant.  Portions are skimpy...but the food sure tasted delicious!  \n\nWe ordered 6 dishes plus a 1.5 order of the fish maw and crab meat soup which worked out perfectly for all of us.  \nScallop w/ Snow Pea - taste was good but the scallops were scarce\nSalt/Pepper Pork Chops - good tasty, not-as-greasy version\nSalt/Pepper Flounder Filets - great batter, very light and airy...a big hit with our table\nClay Pot shrimp pasted-stuffed tofu with eggplant - again, it worked out to 6 pieces of tofu and 5 pieces of eggplant.  but I could eat the sauce for days.\nChinese broccoli sauteed in garlic - some of you know that Chinese broccoli can be old and tough.  But this dish used greens which turned out to be very tender and perfectly seasoned\nClams in black bean sauce - probably the least remarkable of the dishes.  A number of the clams were cracked (did they drop them from high above into the wok???) and the sauce could have used a few more black beans.\n\nService was attentive, possibly because there were only 2-3 tables occupied by the time things got rolling for us.  The bus boy was on top of the tea and rice and our dishes came out long before our stomachs started roiling from hunger.\n\nThis was a great meal and helped to drive away the sting of losing at roulette...as well as the cold weather outside."
        }, 
        {
            "index": 379, 
            "rating": 4, 
            "review": "So it was late (11pm) for me anyway lol! Me and the fiance were grocery shopping and saw joyful and went for it! We were seated immediately, very clean and bright seating area. They have tanks which are filled with shrimp, lobster, crabs, and fish in the main seating area. The staff is very friendly, and we're then offered some complimentary tea. It was great, very smooth and not o er brewed by any  means. With a light and subtle flavor it went perfectly with our meal which consisted of crispy fried salt and pepper tofu, Mongolian beef, and honey walnut shrimp. The crispy fried tofu was done to perfection. Great texture of crunch, the seasoning was done with perfect balance and wasn't to salty or peppery. I almost ate the whole dish to myself lol! We then got our Mongolian beef and honey walnut shrimp. I can say that the flavor of these two dishes were,the best that we have had. The only downside would be the texture of the beef. For us it could have been fried a little lo,her to get a nice crisp texture on the outside, but non the less the flavor was there and it didn't hinder us, with the jasmine rice It was awesome! Bow on to the honey walnut shrimp, THE BEST!!  Crazy but it really wast the best honey walnut shrimp we have ever had. The shrimp had a nice fried coating. The shrimp itself was savory. The dish hot it's sweetness from the walnuts. It seems like the walnuts were roasted with honey and honey alone. Mixed with fried shrimp and tossed with a light coating of mayo. What a surprise. I was expecting an overly sweet, saucey dish. But it was a great balance of sweet and savory. Everything went well and ended with teat which was a nice way to end our meal. The entire meal was above our expectations and gives US a reason to come back. The portions to me are a little small for the price but what you get back in flavor is awesome."
        }, 
        {
            "index": 380, 
            "rating": 5, 
            "review": "First time diner at this restaurant, and was very pleased with the food and service. I ordered the dinner C which came with egg rolls, dumplings and fried prawns along with Won Ton soup to start which were all delicous. Chicken Fried Rice, combination chow mein, a sizzling seafood platter and kung pay chicken followed. Portions were generous and taste was great. Complimentary hot tea tradition in play, service was good, will dine again."
        }, 
        {
            "index": 381, 
            "rating": 4, 
            "review": "Great place for super late night Chinese food. Boyfriend and I stopped here for a very late dinner around 1 am. What could we do? We were craving Chinese food!\n\nYummy noodles, although they were a tiny bit too greasy, and finally a place that serves Sesame Chicken! That was certainly delicious. The server was friendly, though his English was somewhat limited. They also brought a pot of tea to the table, I guess it was complementary because they didn't charge for it, and the table settings already had tea cups at them. And it was very good, although I couldn't tell exactly what kind of tea it was. Had it been morning or day time, I would have said the tea was a little weak, but being the hour that it was, it was perfect. Boyfriend doesn't drink tea, so I had the whole pot to myself! I just wish the teapot had been easier to pour from, as it dribbled every time.\n\nOverall great experience, we will be back!"
        }, 
        {
            "index": 382, 
            "rating": 4, 
            "review": "This place is an excellent restaurant for Chinese food.  Definitely one of my all time favorite Chinese food restaurants to visit.  The food is always fresh and well prepared.  There is a wide variety of dishes to choose from with good portion sizes.  I could make a meal out of the appetizers alone.  The last few times I was there I have eaten the salt & pepper chicken, pork, shrimp; sweet & sour chicken, pork, shrimp; whole fried Flounder, honey/ walnut shrimp, seared scallops and most recently the Lobster w/ garlic and scallions.  Their Fried Rice dishes are also superb.  I have not been disappointed with this restaurant yet."
        }, 
        {
            "index": 383, 
            "rating": 5, 
            "review": "Ive been eating here for years.  Food and service is consistantly excellent.  The soft lo mein noodle is a traditional receipe; very thick and delicious.  I try to order something different everytime but I just cant resist that noodle.  My mother is from NY which she has deemed the capital of Chinese food.  Everytime she is in town , we have to eat here.  She says no other Vegas restaurant compares and I agree."
        }, 
        {
            "index": 384, 
            "rating": 4, 
            "review": "I saw this restaurant on the food network as a good late night eat.  I'm so glad we tried it.  It was really good and I'm so glad that it was open late.  I'll most definitely return.  If you want Chinese food I would eat here, not on the strip."
        }, 
        {
            "index": 385, 
            "rating": 3, 
            "review": "Excellent gai lan vegetables and their pork  lettuce wraps were good. Main complaint is that they pushed tea and rice on us even though we did not ask for it so I told them to take it back so as to not get charged as pricier chinese restaurants usually charge for these items. Also a bit pricey in general. The hallway to the bathrooms is packed full of stored furniture making it hard to walk to."
        }, 
        {
            "index": 386, 
            "rating": 4, 
            "review": "It has been a while and the menu we enjoyed ecapes me. The ambiance \nis pretty standard of spring mountain area. The one thing that should stick out to the Yelp community is the SICK and I ain't kidding wine list. Joyful house is a regular stop for Hong Kong whales late night. They evidently \ncan't get enough vintage Bordeaux. There were 61's 82's 90's and a plethora of other rediculous vitages and other fun Germans as well. I am not convinced that most of the wine list paires with the food style but damn it is sexy reading."
        }, 
        {
            "index": 387, 
            "rating": 5, 
            "review": "This place is definitely my favorite Chinese Restaurant in Las Vegas. Hands down. Every time I have friends in town and they want to eat good off the strip Chinese food, this is place we go. Its open around lunch time and closes super late, 11am-3am. When I first walked into this place, I saw a good sign. Tons and tons of other Asian families eating here. The menu is pretty extensive and also has pictures for the newbies.\n\nWe ordered: Salt and Pepper Pork Chops, Pan Fried Sea Bass, Roast Duck, Salt and Pepper Sea Bass, Spicy String Beans with Chicken, Garlic Ong Choy, and some Oyster Clay Pot.\n\nWow. I was definitely amazed by the taste and quality of the food. The Salt and Pepper Pork Chops are definitely different from the other restaurants. Instead of battering the pork and deep frying it, they do it in a way that the batter isn't fried in. Its like a separate layer above the meat so you can taste both parts when you bite into it. Its weird to explain but its good. So good, that we order it every time we go there. \n\nThe Pan Fried Sea Bass is my absolute favorite. The lightly fried sea bass comes swimming in sweet soy sauce but it doesn't overpower the taste nor the light crisp. Definitely a must order.\n\nThe Roast Duck here is waaaaaay better than at Sam Woo BBQ. The dish here actually has large chunks of meat. It has a right combination of crispy skin and meaty meat. That's the way this dish should be served.\n\nThe Salt and Pepper Sea Bass was good but not a must have. The Spicy String Beans with Pork was good also.... But not a must have. I would probably order other dishes the next time I'm here.\n\nThe Oyster Clay Pot was surprisingly filled with..... Lots of oysters! It comes with roast port, fried tofu, and lots of oysters. Definitely a must have if you like this kind of dish.\n\nLast but not least, the Garlic Ong Choy is one of my favorite veggie dishes. It was cooked perfectly. The leafy part was soft, yet not overcooked, and the stems were slightly crunchy in texture.\n\nThis place is great. I highly recommended it. Funny thing is when I ask my coworkers where they go to get good Chinese food, they always say Joyful House. I felt like I was the last one in on this wonderful secret. I've been back here at least 5 times since I first discovered it. Its that good.\n\nAs always, pictures are included! Yummy!"
        }, 
        {
            "index": 388, 
            "rating": 5, 
            "review": "Eat, rewind, repeat!!\nyummy EVERY time Chinese food!  Beef dishes are fabulous, my husband will even venture out and try a new one.  This time he tried the spicy one on their special lunch menu.\nSPECIAL lunch menu..did I mention it?  Corn soup, not just regular egg drop... TWO appetizers, choice of over 10 entrees and pork fried rice OR steamed rice.  WOW.  We had salt & pepper shrimp one day, duck is even a choice which I got the second time and then the spicy beef.  OH my goodness.  All for $9.75.. \nFor dinners, we've had the Chow Fun Beef with wide rice noodles...to die for, Salt & pepper fish, Mongolian Beef,  seasoned Chinese cabbage, too many good ones to remember.\nIt's no wonder this is a top 50 in THE USA Chinese, clean, ambient décor, and attentive servers.\nMUST GO there!"
        }, 
        {
            "index": 389, 
            "rating": 4, 
            "review": "The consistent 4 star Yelp reviews compelled me to try the Chinese restaurant voted best for 2011.  \n\nWe ate here on Christmas evening at 10pm and the place was FULL.  The crowd was mixed with locals and out of towners.   After a 10 minute wait we were seated.  Hot tea and ice water on the table within minutes.  The server was very patient and friendly answering our ignorant questions. \n\nThe menu is full of pictures so it's easy to spot the popular items quickly. \nService is good. Prices are higher than average but just by a small percentage.\n\nWonton soup was great. Fried pork chops, flounder and fried tofu were the winners at the table.   Chinese broccoli was fresh and tender and sautéed perfectly.   Yang chow fried rice was ok.  Solid 4 stars."
        }, 
        {
            "index": 390, 
            "rating": 4, 
            "review": "I almost didn't eat here after reading previous reviews, but I'm glad I did.  \n\nWe ordered: \n\nVeggie Egg Foo Young\nVeggie Crispy Fried Noodles\nFried Tofu\nFried Rice\nRoasted Duck\nWalnut Shrimp\n\nWe loved all the dishes.  No complaints from anyone.\n\nI had fun with the Passion Fruit juice with green jelly."
        }, 
        {
            "index": 391, 
            "rating": 4, 
            "review": "This is the second year in a row that we visited vegas and joyful house is one of our many must stop by. Not only their food is unforgettably delicious their staff is attentive and customer service is by far the best I have seen at a Chinese restaurant. Must try out their deep fry crabs. See you again next time. Keep up the good work."
        }, 
        {
            "index": 392, 
            "rating": 5, 
            "review": "I came here with lower expectation being that I think the best Chinese food can be found in Chinatown SF. I was proven wrong, not only did they have great food, they had GREAT service, I didn't expect it (coming from a Chinese food restaurant) it was a great experience from food to service."
        }, 
        {
            "index": 393, 
            "rating": 1, 
            "review": "The service is absolute shit. The food is tasteless. Definitely not worth spending $$ on one star food. The only good server was the manager. Also our silverware was dirty."
        }
    ]
}