{
    "category": "Las-Vegas", 
    "entity": "Downtown-Cocktail-Room", 
    "avg_rating_stars": 4.3072463768115945, 
    "review_count": 345, 
    "reviews": [
        {
            "index": 1, 
            "rating": 4, 
            "review": "This is always our go to spot when we are Downtown. \nOne time when my fam was in town my mom went with us and she requested a yummy martini. The bartender made her a beautiful ginger blend and made the rim of the glass sparkle. She loved it!"
        }, 
        {
            "index": 2, 
            "rating": 2, 
            "review": "Here is the thing the drinks are good, but maybe I am just old or out dated, but why does every bar have to blast some loud crappy music.  You aren't a club, you are a bar.  I like to go to bar, have a drink and talk to the people I am with, not going to happen at Downtown Cocktail Room.  My drink was good, but I only had one and left.  I have worked downtown for over 6 years, you used to be able to go to bars and have a happy hour or meet friends and talk, now they blast music like nightclubs.  If you own a bar, be a bar, turn that shit down and I will stay and spend more money on your alcohol."
        }, 
        {
            "index": 3, 
            "rating": 3, 
            "review": "They do have creative drinks... unfortunately the ones we had were not very tasty...\nIt was more like an experiment for us.\nThe bathrooms were \"fun\" with the one way mirror... \nAnyways, was it a cool place to stop by? Yes.\nWould I go back if I had a choice? Maybe not."
        }, 
        {
            "index": 4, 
            "rating": 5, 
            "review": "Once you figure out how to get in, you're in for a treat. It's only 1/2 a block from the madness of Fremont street, and it serves the best cocktails in Vegas.  At happy hour, they're only $7, so come in and try a whole bunch. The staff is knowledgeable and very friendly. They'll take the time to explain the drinks and the unusual ingredients. (byrhh??? Try and find that at a liquor store.)\n\nA great place to relax, try something you've never seen before, and take a break from the craziness.\n\nDon't miss it."
        }, 
        {
            "index": 5, 
            "rating": 5, 
            "review": "Located on the corner of Las Vegas Blvd. and Fremont St. is one of THE most fabulous hangouts in Las Vegas...The Downtown Cocktail Room.  Everything about this place is perfect: the down-tempo music, the vibe, the chill crowd, the drink menu and the dim candle lighting.\n\nIt reminds me of something that would be in New York or San Francisco...very hip and chic.  I discovered my new favorite drink, the Mohave Mist, which was: Chandon, Pomegranate liquor, and Cassis...perfection! Love this place, you gotta check it out!"
        }, 
        {
            "index": 6, 
            "rating": 4, 
            "review": "Great drinks n house music. Little more expensive then the other bars DT. No cover charge."
        }, 
        {
            "index": 7, 
            "rating": 5, 
            "review": "I love this hidden gem! Not many downtown goers seem to know about this place, which makes it a special experience. It's located on the corner right behind Inspire. From the outside, it almost looks like it doesn't exist because nobody walks around that area. The door is easy to miss because it's blended with the rest of the building. With that said, the hidden vibe makes this a very unique bar.\n\nThe inside is amazing. It's dark and has a different atmosphere than most bars in downtown. It's not as loud and you can actually have a decent conversation with your peers. They have quite unique but delicious cocktails and also serve absinthe if that's your cup of tea. While most bars are crowded with no place to sit, this cocktail room has plenty of seats so you will most likely find one even on a busy Saturday night out. This is definitely a good in-between bar compared to a traditional speakeasy bar and a typical, loud bar in downtown Vegas. I can't wait to share this place with my friends who haven't heard of this place!"
        }, 
        {
            "index": 8, 
            "rating": 4, 
            "review": "I love the atmosphere, the bartenders, the cocktails, the location and so on and so forth. however, fix the a/c please."
        }, 
        {
            "index": 9, 
            "rating": 4, 
            "review": "pretty chill environment with some great mixed drinks.  try the Caveman.  You'll either love it or hate it.  Pretty fun place to find if you're downtown and wandering off Fremont St."
        }, 
        {
            "index": 10, 
            "rating": 4, 
            "review": "Best-kept secret in Fremont. Dim-lit, chill environment, well-made craft & classic cocktails, fantastic service. Features extensive absinthe selection. Ample lounge seating. Love this Fremont speakeasy."
        }, 
        {
            "index": 11, 
            "rating": 5, 
            "review": "This place is great at what they do, which is a trendy place for cool cocktails. Try the absinthe drinks! Prices a little high for the neighborhood, but not crippling."
        }, 
        {
            "index": 12, 
            "rating": 5, 
            "review": "The Downtown Dill is my favorite cocktail! This place is the most amazingly chill cocktail bar I've ever had the pleasure of being to. They have a number of great cocktails for you to expand your tastes with. I've never had a bad drink at DCR and I've pretty much tried most of the menu. The bartenders are also extremely friendly and personable!"
        }, 
        {
            "index": 13, 
            "rating": 3, 
            "review": "cant wear baseball style hats.\n\nalot of of different drinks to be had.\n\nnice looking cocktail waitress'\n\nsitting fills up pretty fast so get there a bit earlier\n\nDCR is usually our starting point  and then hit up the rest of the bars in the area"
        }, 
        {
            "index": 14, 
            "rating": 5, 
            "review": "It isn't often that there is a place that is so transformative- it becomes an institution without trying. DCR just might be one of those places.\nIf you squint your yes- you might feel like you are in the lower east side, the mission, london, or Buenos Aries. The deliciously ridiclous cocktails (please do try the Downtown Dill, or the Sazarac) will reinforce your good decision to leave the tourist areas of Vegas and before you know it, you have arrived at one of Las Vegas's best unkept secrets\nModestly positioned on Las Vegas Blvd. the Cocktail room will be all things you have wanted in a bar. Knowledgable and creative bartendars, and a cocktail staff that will readily fulfill your imbibing pleasures.\nOn the contrary- if having a beer and a chat with friends after work is more your speed, there is no shortage of nooks to do so, and interesting people who sit at the bar to chat with.\nThe music is always low key and sexy, the DJ's on the weekends make it fun without playing all that nonsense on the strip. \nWithout going overboard, this bar is for locals and tourists who want something real and special on their trip to Vegas, which unfortunately a trip to Vegas can turn very un-special quite quickly.\nThank you DCR for always being there, no matter what the day, to offer yummy drinks, and always a cool atmosphere."
        }, 
        {
            "index": 15, 
            "rating": 5, 
            "review": "Easily my favorite place for cocktails in Las Vegas.  There really is no better place in town that has the combination of an amazing cocktail menu, music, and atmosphere.  The staff is incredibly knowledgeable with regards to the drink menu, and the service is always top notch.  You will not find a cocktail menu in town with more creativity and selection. The drinks are made by the most talented bartenders that the city has to offer, and are a great value for what you actually get - all fresh ingredients and top quality liquor.  I would highly recommend checking out \"Mixology Monday\" if you haven't been yet: the drink quality-to-value ratio for that event is hands down is the best you will find anywhere.  I have been going to DCR for a couple of years now, and the quality of the menu and staff has always been excellent and consistent.  It is great for groups as well, and everyone that I have taken there has always had a good time, and has returned often.  In terms of overall quality and enjoyment, DCR easily stands up to other cocktail lounges that you would find in NYC, LA, MIA, and other major cities.  In my opinion, it's even more enjoyable because of its humble and non-pretentious atmosphere.  It's clear that the ultimate goal is to create a unique environment and make sure that guests have the best time possible.  This is definitely accomplished here.  The lack of gimmicks and lowest-common-denominator advertising is absent, which is hugely refreshing - especially in this city.  It definitely sets the standard for Las Vegas and is a must-see for anyone who hasn't been there yet."
        }, 
        {
            "index": 16, 
            "rating": 4, 
            "review": "This is a couture cocktail bar. Every major city has one if you look hard enough. First time customer but would definitely revisit for another cocktail fix when in Vegas again.\n\nNot of the league of MH in nyc or Noble Experiment in San Diego but an \"A\" for honest effort. That is the only reason for only four stars. (Please note that  I rarely give five stars on a first time visit.) The decor is swanky intimate... great to take a date or to converse with close friends. Slightly off the beaten path which is common for this class of bar.\n\nTo increase stardom this bar would need to extend it's bartenders knowledge of classic couture drinks. At an establishment such as this, with all proper ingredients on hand, I expect to be able to order off menu from any of the cocktail categories. Although the bartender was not familiar with the cousins of the rikki, old fashioned and fizzes, he made an honest effort to please. Those who are new to couture cocktails will still be pleased with this establishment.\n\nWill return."
        }, 
        {
            "index": 17, 
            "rating": 5, 
            "review": "Very simply the coolest, friendliest bar/lounge in all of Las Vegas. Well run, fairly priced, and comfortable. This venue shows what Las Vegas is becoming. It really is a gem, and candidly, is more fun than any of the bar/lounges I frequented in New York City in the 45 years I lived there. The mixologists take there role seriously and have fun with it. \nLas Vegas needs more of this."
        }, 
        {
            "index": 18, 
            "rating": 2, 
            "review": "I saw good reviews online about this place, so the hubby and I thought we would check it out for happy hour.  I went to their website first....it says drink specials and 1/2 price appetizers from 4-8pm.  There is even a food menu available to view.  We went with the expectation of eating apps along with having a couple drinks....We were wrong! \n\nSo we arrive at the bar and could not find any food on their drink menu.  My hubby asked the bartender if they had food.  She said \"you mean like a kitchen?\" We said \"yes, like appetizers\"  She proceeded to tell us that they only have munchies like pretzels, almonds, cashews, ect.. and apologized if we saw food on their website.  She said they used to have food, but don't anymore and their website is not updated. How can a business not keep their website updated??...sounds like bad management to me.\n\nAnyways, since we were already there I ordered one of their original cocktails. I don't remember the name, but it had an orange slice in it.  The drink was so freaking strong I could barely drink it.  I could literally feel the alcohol burning in my empty stomach.  I then decided to order some of their munchies to fill my stomach.  I ordered the cinnamon almonds and the pretzels, which were pretty good, but I was expecting some kind of free munchies.  Usually bars have some free peanuts or something to nibble on, but not this place.\n\nWell hubby had to help me finish the drink.  His beer was pretty good, nice and cold.  We only stayed there for one drink and left.  We both decided we won't go back.\n\nBy the way, the decor is nice, but they need to put in some kind of flooring.  The floor looks like the tile was ripped out and they never got around to finishing the floor.  It's just cement with old marks of what used to be a floor.  This doesn't match the nice decor."
        }, 
        {
            "index": 19, 
            "rating": 5, 
            "review": "The trick to this place is finding how to get in.  There's no hidden door, but for some reason our party and other parties that followed seemed to have a difficult time figuring out how to open the door.  Thankfully, the bouncer witnessed all of our difficulties and opened the door -- guess that beats throwing people out.\n\nDCR is in downtown Vegas, so there are plenty of people around, but it's definitely not the type of place one finds on the strip.  This was a cool place to grab a few cocktails before making our way around town, and this was my favorite bar of our trip.  Definitely a hipster vibe.  There's no crazy uptight scene, but the people watching was great, service was fast and friendly, and the drinks were fantastic.  Best of all, they weren't ridiculously overpriced like some clubs on the strip.\n\nDefinitely coming back next time I'm in Vegas."
        }, 
        {
            "index": 20, 
            "rating": 2, 
            "review": "So a local friend of mine bragged about this place and claimed this is the spot for all the local people.  At first glance, I thought the vibe was cool.  As the night moved on the place felt pretentious and boring.  I give it 2 star for a nice spot, but the drinks were less than average and the music was okay, not bad but okay."
        }, 
        {
            "index": 21, 
            "rating": 3, 
            "review": "Checked this place out for the first time on Saturday.  Its a good lounge to meet with friends or a date as you can find an intimate spot where you can talk.  Decor is nice...and a also a little on the \" trying to be trendy\" side and seemingly pretentious.  But we still enjoyed the fact we (group of four) got a booth and our waitress was super nice and unassuming.  Drinks were good...they have absinthe, which we did not participate in, but thats kind of a different twist."
        }, 
        {
            "index": 22, 
            "rating": 4, 
            "review": "This place had a really cool ambiance. The service was alright. Cute. But more appealing than attentive. Ordered a couple specialty drinks... They were good, not great. Overall I'd return to have an unwinding cocktail after a long day in the office downtown but I don't see it being a place I could add to a list of favorite hotspots."
        }, 
        {
            "index": 23, 
            "rating": 4, 
            "review": "Very cool lounge that is an excellent, non-tourist, find just off Fremont St. I went on a Tuesday night and the DJ was playing very good and proper house music. It's low key here with a small dance floor but no one was dancing. Oh, the nosh items are not that good. Seems like they buy their olives from 7-11 they weren't good....the almonds could have also been from7-11. Drinks are good and the music is great!"
        }, 
        {
            "index": 24, 
            "rating": 5, 
            "review": "Best damn bar in town period.\n\nThe Huntridge is awesome and totally deserves the name and the Bloody Mary is the only one I will ever drink.\n\nThis place is awesome and like the guy said earlier this is a cocktail room. If you want Bud Light this is the wrong place for you."
        }, 
        {
            "index": 25, 
            "rating": 1, 
            "review": "Came here last night with a couple of girlfriends. just bar hopping and I saw this place and remembered it had great reviews on yelp:) I was excited to try it out although my older sister said the cocktails were really just ok. I wanted to try it out myself. \nLoved the layout and the whole feel to the place. Music was loud, dim lights, bathrooms were clean.\nI'm going to try to keep this short because i could go into every little detail. I got an extra extra dirty martini. My friend got some watermelon cucumber martini. There were 4 of us.  Before I could tell him, I want ketel one Robert walked away. My girlfriends did not like his attitude with us so decided not to order. he was really impatient and giving us attitude when we were looking over the menu.  I'm so oblivious to people sometimes lol but hey I just wanted to have a good night. \n They were busy, but nothing crazy. My friends wanted to go to another place, so I walked up to him on the other side of the bar and yelled Sir  I'm sorry I was just wondering if our drinks were started. Robert then seemed really annoyed and said yes. Then rolled his eyes. I was definitely taken back and found it extremely rude. Of course we took the drinks, but i didn't see anything wrong with canceling them if he hadn't started making them. I honestly don't know if it was because the way we were dressed or how we spoke to him. I felt like he looked down on us. Maybe he didn't think we would tip or spend a lot of money. I have no clue. He was really nice to other people sitting at the bar, but treated us differently.  anyways Watermelon cucumber was pretty good, but mine was Not extra extra dirty. It was actually pretty gross, but I was already upset with the service. I just wanted to leave. I took a few sips and left. I ended up tipping but honestly i wish I wouldn't have. I serve and I hate leaving a bad tip even if  the service was shitty.  But he did it for me. There are better cocktails at Martini bar oh and you won't be treated like shit either."
        }, 
        {
            "index": 26, 
            "rating": 5, 
            "review": "Wow, this place was great. I make it my mission to do \"deep research\" to find just the right place to suit my needs when out of town, and this place nailed it.\n\nGreat atmosphere (amazing DJ and I don't even know about that kind of \"thing\"), great cocktails (I was drinking Patron NorCal Margaritas (look em up) for $11 each and they were strong, I tell you.), and great service. The waitresses (we had two since we were there for a while), were the perfect amount of attentive and engaging. Even the bouncer was a friendly chap. \n\nThis place is a hole in the wall hidden gem. It's comforting to know that places like this exist in an era of yelp and overpricedness. (Pronounced oh-ver-PRICE-ed-ness.)"
        }, 
        {
            "index": 27, 
            "rating": 4, 
            "review": "This place is kind of a savior in vegas. You can walk in (without waiting in line), and sit at a *table* for *free*....WHOA. Get over the strip people...unless you really want to wait in a line for 2 hours and bring 20 girls and $2k to get into a sweet lounge.\n\nSmooth ambient dj, awesome wait staff, and reasonably priced drinks. Not to mention, super close to some amazingly divey yet kick ass lucky (at least for me) casinos on fremont street. Make sure to try the rhubarb refresher when you are there. Yes...a whiskey and rhubarb drink. Seriously...could life-iness be any better??\n\nBeware of the mirrored bathrooms there if you are tanked (like I was). Some of those urinals are actually reflections of urinals in mirrors. The pee does not flush when you are done (thankfully, I noticed this juuuust before I started going, but after I bumped my head on the wall).\n\nAlso beware of the exit door if you are tanked (like I was). The door part is the *solid* side, not the glass side. Anyone remember the movie birdie? Yeah I pretty much did the same thing - full sprint into a glass wall. Thankfully, I did not break my neck, but I did have the biggest bruise ever on my right kneecap for a week. Ah the cost of my stupidity."
        }, 
        {
            "index": 28, 
            "rating": 4, 
            "review": "It is more pricey than most the bars in this area but they have some awesome absinthe drinks--which I love.  The Huntridge makes absinthe taste delicious.  It is usually less crowded and not very smokey.  I hate how smokey all the bars get in this area.  The hummus at happy hour is from the Greek place next door which is good and cheap.  Happy Hour is cheap.  Music is chill and not loud."
        }, 
        {
            "index": 29, 
            "rating": 5, 
            "review": "COOL. I loved this place. Its got a very comfortable and relaxing vibe. Dark wood and walls painted red. Red candle holders on all the tables. The bathrooms are made almost entirely out of mirrors, so its a little wierd when you first enter them...almost like a fun house at a carnival. And you can look out from inside the stalls almost as if there are no walls at all. The DJ was spinning very low key funky music from his Mac laptop, and it added very well to the laid back atmosphere. It is a little tricky trying to find your way in, but once you find it its so obvious. Im not going to give away the secret to getting in, because its kind of  fun watching people look for the door from inside the windows, and even funnier to watch tourists just give up and go somewhere else."
        }, 
        {
            "index": 30, 
            "rating": 5, 
            "review": "Jeff is the best bartender in Vegas. On a slow Monday, I challenged him to surprise me, after I couldn't decide on a cocktail on the menu. He was gone for a while and I realized... he had been making my cocktail the whole time. For maybe five minutes or more. He's stop and sniff, add a little of this and that. That kind of dedication to one's craft if hard to come by these day in any profession.\n\nAfter a long night that had started too early and gone without food too long, he took me seriously when I said, \"I need all the water you have.\" (I had actually tried this earlier the same day on 3 occassions, got one small glass of water and a disappearing waiter/bartender each time). He came back with a glass he had chilled and cool water without ice so that I could drink it faster. Yes... he chilled my water glass as if he were serving me a martini.\n\nJEFF YOU ARE ONE CLASSY FELLA!"
        }, 
        {
            "index": 31, 
            "rating": 4, 
            "review": "Friends in town, time to show them the new and improved Downtown!  So a must go to is the Downtown Cocktail room.\n\nAfter figuring out the door after a couple of cocktails, I am reminded of the relaxing indoor environment.  Greeted by a fabulous waitress and told about the intricacy of the specialty drinks being made.  We viewed the yumminess waiting around the corner.\n\nThe drink menu is constantly changing and ever evolving they do have some of the old favorites on standby but if you come here don't go with your old standby plea try the specialties.  They Are Amazing!\n\nI had one called the Redeemer sadly I forgot to write what was in it,  I know it had Brazilian Rum Lemon and something cucumber.  It was a light slightly sweet very refreshing drink so much so we stayed for another and 3 out of 4 people ordered my drink! \n\nA new/old go to for visitors and/or a drink while walking around!"
        }, 
        {
            "index": 32, 
            "rating": 4, 
            "review": "Chill atmosphere, very dark,nice bartenders. They serve absinthe and a host of other unique and delicious cocktails. My favorite is the Downtown Dill--not on the menu anymore but they still serve it. Like a sweet dill tomatoey martini. Amazing."
        }, 
        {
            "index": 33, 
            "rating": 4, 
            "review": "This is a cross between a really awesome bar and a really terrifying Las Vegas nightclub.  It's somewhere closer to the \"really awesome bar\" side of things.  There is usually a DJ here who is pretty good (Vegas usually has pretty rippin' DJs).  And one thing you'll notice here are the ice cubes. So dope.  They're great big chunky mothers. Not sure exactly how that helps but it does. And dig the weird/creepy one-way glass doors in the bathroom."
        }, 
        {
            "index": 34, 
            "rating": 5, 
            "review": "This spot is located on a deserted block of Las Vegas Blvd in the downtown/Fremont street area.  It's a nice, refreshing change from the \"PARTY PARTY PARTY!\" vibe most other Vegas bars have.  The Downtown Cocktail room is a nice, swank lounge with a chill vibe.  The bartender we had was great and our drinks were DELICIOUS.  Most drinks are about $10/ea.  They also have a few cheap beers...but you don't want that!  Seriously, if you are in Vegas this is a MUST HIT UP SPOT."
        }, 
        {
            "index": 35, 
            "rating": 4, 
            "review": "Let's start with the entrance...where is it??\n\nHere's a tip..when you arrive at the entrance area, knock 3 times to the glass to your right, then 2 times to the glass in the front.  The entrance will magically open.  I tell everyone this when we first arrive...classic!!!  Yes, doors are hard to find.\n\nOnce you're in, you're in.  This is the most chill cocktail lounge in the Fremont area.  Like others, it's dark, but it's spacious and with plenty of places to lounge. This is a great starter for the evening and an even better after bar. Great place to go with friends and even chill enough to take a date here. If you're looking to hook up or you specialize in \"What Happens In Vegas, Stays In Vegas\", then this may not be it.  Most people here are here to kick back and relax.  My suggestion is to meet someone at the other lounges, bars, and cocktail rooms.  Then take them here after.  \n\nYou receive a drink menu with the prices and proofs.  This place specializes in Absinthe.  Yes, the strong stuff that I avoid so I can make it home safe. \n\nThe staff is pretty good.  Usually when you walk in, they will help seat you if you do not know where to go or can't settle on a spot. There's also enough watresses roaming that you are kept filled.  \n\nTIP: For your drinks, ask for a little or no ice.  Drinks are not watered down, but way too much ice at times.  I like the drinks cold, but hate it when it's just a sip and you're done."
        }, 
        {
            "index": 36, 
            "rating": 5, 
            "review": "Is there really anything not to love about DCR? This is by far my #1 fav bar in the Vegas area.\n\n1. It can be a little hard to get into. And that is simply because of the entrance door. It is hilarious to sit inside and look out and watch people fumble around trying to find the entrance.\n\n2. The bartenders are actually very knowledgeable about the drinks.\n\n3. The menu rotates seasonally - and each season I find a new favorite cocktail. And more often than not, it is something I never would have normally thought of or tried.\n\n4. The layout of the menu is awesome. It gives you the name of the concoction, the type of glass it is served in, and a brief flavor profile. It does not tell you what is actually in the drink. Major appreciation points for this.\n\n5. The tourists have yet to really discover this place. In fact, I don't think I've ever encountered a tourist in here ever.\n\n6. It's a great after-work hangout. Few patrons, no loud music, and it's pretty much all locals that work in the downtown area.\n\n7. On weekend nights, it can get pretty busy and there is a DJ.\n\n8. Skip the \"food\" menu. It's all awful - I don't know why they even bothered adding these \"food\" options to their menu. However, the various nuts ARE quite good and I highly recommend them.\n\n9. You've got to go to the bathroom here. It completely freaked me out the first time. The stalls are glass. And you can see out, but others can't see in.\n\n10. Did I mention the cocktails? Seriously amazing cocktails. It WILL be the best cocktail you've ever had."
        }, 
        {
            "index": 37, 
            "rating": 5, 
            "review": "I absolutely love this bar. The staff is fun and great and the drinks are great for the price! We had such a great time chatting with the bartenders and other customers! \nI would definitely recommend this place!"
        }, 
        {
            "index": 38, 
            "rating": 5, 
            "review": "I arrived early so it wasn't very busy. The drinks are outstanding. The drink menu changes every season. And the staff create the drinks on the menu, which I find amazing. My bartender was Kevin. A great bartender. He was pleasant and friendly. I'd recommend a visit if you're in the area."
        }, 
        {
            "index": 39, 
            "rating": 4, 
            "review": "I had an interesting experience here as a lone Hawaii woman looking for some drinks on New Years Eve.\n\nThe secret door was easy enough to find as over time I suppose the strength of the door mechanism has worn, keeping the door slightly ajar. Upon entering, I found the place quite lovely. It has a sort of upscale yet cozy vibe, seemingly the kind of place for socialites in their late 20's and up. It's also quiet in the earlier hours, which is nice for a date.\n\nOne hiccup in my experience is that I found it a bit difficult to find a place I could sit alone--most of the tables had four chairs around them and the bar was already full. I felt bad taking up a table all by myself, potentially putting a whole three other people out of a seat.\n\nThat's when the host at the door let me know there was a brand new bar area in back, through the second curtain on the right. I love new places AND I love being alone so I was ecstatic to find the cute little bar was empty. I think I was officially the first person to order a drink as that night was their soft-opening.\n\nService was great, both bartenders seemed cool and upbeat but friendly. I noticed one man siting off on the far right side of the bar whom I later discovered to be the owner of DCR. I get the reason for not interacting with patrons but after finding out someone is the owner, you get a kind of weird vibe when they're not smiling, upbeat or friendly, y'know? I would have loved to compliment him on the venue if he seemed more approachable. It's one of my new favorite lounges in vegas.\n\nThe bar itself aside, the interesting part of my experience happened when an entire posse of people came in looking like they came straight out of the movie Zoolander. I don't mean to disrespect them, but that's the best way I could describe the clothing and hairstyles. I don't know if they were models, artists, singers, actors or YouTube stars... but it was quite interesting to be in the mix of it. Someone was filming a few of the people in the group.\n\nIf DCR is as popular as it is to have a crowd there filming something, who knows who else will stop by? Check it out and maybe you'll be lucky to meet some artists/celebrities~"
        }, 
        {
            "index": 40, 
            "rating": 5, 
            "review": "This is a pretty neat bar.  It's located within walking distance from where I was staying, which is a total plus!  I love the ambiance. Upon entering, you notice that the place is very dimly lit and smells of sweet incense. There are couches and soft plush chairs with small, round tables. It's an intimate setting.  The music was low, so you could actually hear and be heard by whoever you're there with.  \n\nWe were there around 11, and the place was pretty quiet, which I like.  There were people scattered at tables, but it was easy to find a seat. They have a good selection of mix drinks, but I just had a malbec. Their wine selection is very limited. The person I went with doesn't drink, so he had a virgin Bloody Mary.  He says that it's good...I'll just take his word for it.\n\nJust like the general area, the bathroom is also very dimly lit. In fact, it borders on being too dark.  The decor consists of walls of mirrors, including the stalls. I had a difficult time at first finding the stalls. And then there was the issue of it being very dark in there.  I tried to look for a light switch, but alas, there was none.  It was awkward, but guess you have to make do with what you're given.\n\nOverall, I really like this bar.  I like the feel of it. The lighting works out well and it's got a very chill ambiance. I'd definitely come back next time I'm in Vegas."
        }, 
        {
            "index": 41, 
            "rating": 5, 
            "review": "We came here with about 15 people and the back room was closed for construction but we hung out for 15 minutes and eventually the large table in the middle opened up that seats about 10-12. Our group kept growing in size to close to 30 which I know can be a huge nuance as a server. But our server was more than accommodating. She was always sweet and polite and kept asking anyone if they needed anything. We order 3 large punch bowls. Two of the pink ones and one of the red ones. The red one tastes like cough syrup but it's got quite the array of liquors in it. I definitely prefer the pink punch bowl although it is quite sweet. Overall thanks for the wonderful experience! We always have a blast every time we go here!!!"
        }, 
        {
            "index": 42, 
            "rating": 5, 
            "review": "Not wanting to do the club thing for my 21st birthday, I chose to bring  my 21st in at DCR this past December. Got there at midnight (a Saturday) and was let in by the doorman because I could not find the door (thankfully not the first and certainly not the last one to be confused by it). Interior is well designed and manages to be upscale without seeming too pretentious. The waitresses were friendly and very quick to bring our drinks. I asked one waitress for '4 shots of anything' and they were easily the best shooters I've had of anything I just wished I asked what they were so I could re order them. A good experience, and I try to visit there once a week and force my friends to come check it out. Cannot go wrong with this place, great cocktails, staff and atmosphere. Though there is no official dress code it is not the place for the following: Ed Hardy, Tap Out, sunglasses"
        }, 
        {
            "index": 43, 
            "rating": 4, 
            "review": "Definitely an above average dive bar... wait, can I even call this place a dive bar?  They're playing club music and specialize in fancy cocktails.  I met some friends there for a drink... ample seating, but it was a little loud for us as we could barely hear each other talk.  Bartender was ok but cocktail waitress was better.  Maybe this just isn't my place, as I'd prefer the Griffin most nights."
        }, 
        {
            "index": 44, 
            "rating": 4, 
            "review": "Atmosphere: DCR, you do not fool me. When everyone is pushing at the glass, I am pressing through the solid frame on the left. This place is like a fabulous drag queen because you are left wondering where everything is hidden. The music is at the right level allowing people to comfortably talk yet creating atmosphere. \n\nSeating: Once in, it is important to find a place to sit. Although the sheer number of patrons outnumber seats, no one seems to mind.\n\nLibations: Water of Life is the drink to get. Feeling dehydrated but do not want to stop drinking? This is the poison of choice. \n\nStaff: The bartenders believe in singular handcrafted drinks. Even if everyone in the group is ordering the same drink, each person has their cocktails made separately. The waitresses walking around are so nice and checked on us several times."
        }, 
        {
            "index": 45, 
            "rating": 5, 
            "review": "Great place to spend a night with friends. The cocktails are fantastic, moderately priced and the little snacks are great and very reasonably priced. I love that the menu changes seasonally because there is always something new to try."
        }, 
        {
            "index": 46, 
            "rating": 5, 
            "review": "Ambiance is great. They have very interesting cocktail menu and they change it seasonally. This place is a jam. I couldn't find the entrance door when I first went... I will be coming back to try some more crafted cocktails here. You can see many bitters and mixes they use at the bar."
        }, 
        {
            "index": 47, 
            "rating": 5, 
            "review": "I have been here twice and both times, the drinks and service were very good. Last night the bartenders went above and beyond, not just for my friend and I, but every patron that came up to the bar. The music was just the right volume where we could talk, but enjoy it and the doorman was smiling and very personable, unlike a lot of doorman you find at most places downtown! We will definitely be back."
        }, 
        {
            "index": 48, 
            "rating": 5, 
            "review": "I really enjoyed the DCR. The atmosphere inside is very welcoming and the vibe is amazing. My husband and I decided for the bar since we wanted to know more about all the cocktails. It was Wednesday night happy hour and we paid $7 per cocktail. I had the \"Handsome Halo\" and my husband ordered something with watermelon... I cannot remember the name. The bar tender was very friendly and answered all of our questions. It was fun to watch her mix the drinks and they turned out amazing."
        }, 
        {
            "index": 49, 
            "rating": 4, 
            "review": "Service was great, went here for a birthday event last weekend and it was quite the experience. The bathrooms are defiantly different and very amusing. Very dark place with loud music. Great environment and had a great time. Will be going back!"
        }, 
        {
            "index": 50, 
            "rating": 4, 
            "review": "this place is dope.  Awesome hangout for those that love deep house and well balanced cocktails. \n\nthe atmosphere is simple--- dim, warehouse-y, feel with simple furniture.  I didn't try any fancy cocktails, but from the looks of the menu they have some great ones for a decent price 8-10$.  I had a couple manhattans (great) and an old fashioned (ok).  \n\nThe service was so- so, took our waitress a little bit to circle around, but I was so content with the music it didn't bother me.  If they had a dancefloor this place would be perfect!"
        }, 
        {
            "index": 51, 
            "rating": 5, 
            "review": "We were told by the owner of Black Bridge Brewery in Kingman that this was one of the must visit places in Vegas. We were intrigued by the idea that we had to figure out where the door is. We were up for the challenge. So we stroll up and there's absolutely no indication of where it might be so we just start pressing on things. You can barely see thru the glass that there are people watching and being amused by you trying to find out how to get in. Luckily after some time of trying someone gave us a hint. \n\nOnce inside it was a quiet dark vibe. Very relaxing and definitely not touristy. It was a chill place with plenty of seating arrangements and a DJ playing music at a very reasonable sound level. I really dug the vibe they were going for. \n\nOrdering a drink was easy; the bartenders were very attentive and didn't play favorites like I've experienced other places. The drinks were VERY good. All of the ingredients tasted very fresh, nothing from a mix. \n\nOverall:\nFun way to get in kind makes this place seem mysterious, ambiance was good, staff was attentive and the drinks were excellent. I def plan to come back on future trips to Vegas."
        }, 
        {
            "index": 52, 
            "rating": 4, 
            "review": "Kind of hidden away, although there is signage on the street. To be honest, I wasn't sure if the door was actually *the door* until someone walked out!\n\nOnce you step inside, it is a bit dark and moody, but it is fitting of the theme. I sat at the counter during their happy hour. Not a whole lot of people there, so I was able to chit-chat with the bartender as well as the other person sitting at the bar.\n\nSince I am not well versed in craft cocktails, I asked for a recommendation. They have seasonal menus and when I mentioned \"light, citrus, floral\" the bartender perked up his ears and made me the Lavender Lover (lovely?) drink. A blend of gin, creme de violette, mint and lavender. Effervescent and light describes it perfectly.\n\nService was wonderful. I didn't catch the name of the bartender as I had a flight to catch, but he explained the menu in a way I could understand. Also, he mentioned that they use spirits from Las Vegas Distillery. Local liquors is a plus for me!"
        }, 
        {
            "index": 53, 
            "rating": 4, 
            "review": "Nice, cozy atmosphere with tasty drinks. I tried the \"Don't Fig With Me\" and \"Pumpkin Spice\" which were both delicious. I'd definitely come back."
        }, 
        {
            "index": 54, 
            "rating": 5, 
            "review": "The coolest place downtown. \n\nNOT started by Tony Hsieh and the Downtown Project, but adopted by those folks as home+office while they got things going, and it sure seems like something they would have done.\n\nAmazing specialty drinks. Great (dark, moody) atmosphere."
        }, 
        {
            "index": 55, 
            "rating": 4, 
            "review": "Came here after July First Friday. Dark, red, leather, stiff drinks, good drinks (skip the beer and read the drink legend), great nuts. I was there with a group and was pretty much left alone (which I like). The music was also real good.\n\nGreat place to lounge."
        }, 
        {
            "index": 56, 
            "rating": 1, 
            "review": "First, the place was dead. As in not a soul in sight other than some burnout sitting at the bar. \n\nSecondly, our waitress was a complete and utter jerk and that's as lightly as I can put it.\n\nThirdly, put a door handle on the front door so people don't stand there trying to figure out how to get in the bar you dimwits."
        }, 
        {
            "index": 57, 
            "rating": 5, 
            "review": "The lighting is low casting a great atmosphere, the DJ does a great job with the music selection keeping the mood light. The drinks are fabulous, taste great and the server will answer any questions you may have. It's right off the entrance to the Fremont experience, it has a low key entrance but do go in. The only thing I would suggest is to have more than one bartender, it took a lil bit to get the drinks but still worth 5 stars."
        }, 
        {
            "index": 58, 
            "rating": 4, 
            "review": "This is a nice little spot off the strip, you don't really know it's there.....Well I didn't know it was there.  But alot people knew it was there.  We went there for a group meet up.  Got there before anyone else.   So we couldn't find how to get in, you walk up, and there's windows everywhere, and a door, that didn't look like a door, so we were going to go down the alley, around back.....ummm that didn't look like a good idea.  So we were going to walk along LV Blvd, to the back, then we heard a voice.  OK, we go back, looked around and didn't see anyone.  So we started walking away.  Then the guys that worked there was just goofing around.  It's was funny, but just know, there isn't a handle on the door, so just push it open.  \n\nSo back to the bar!  Ohhhh, we liked it, they had these L 'ish shaped couches all over the place, it was black and red.   So I had to go to the ladies room.  I go in there, open the stall ready to do my thing WAIT it's dark in here, where's the light?  Why would they put a light in a stall that you have to turn on.  Well I couldn't find it.  So I go and ask for help.  The girl told me, there's no light, because the glass is a double glass.  You can see out, but they can't see you doing your business.   Um mm, the toilet is black and it's dark in the stall.  You don't know if someone missed the toilet (if you know what I mean) Yea, so during the night, it was a issue with alot of the women about going in the stalls, it was actually funny.  Some women would straight out say, don't sit on the toilet, I might have missed!!  lol\n\nOther than the bathroom we really liked this spot.  It's not a place for the penny pincher.  The least expensive drink that I saw was $9.00  But it's a cool place to go and chill out, get away from the craziness of Fremont street."
        }, 
        {
            "index": 59, 
            "rating": 5, 
            "review": "HATE  Nothing.\n\nDISLIKE  Nothing.\n\nLIKE  Our friendly server. The nice bathrooms.  The chill music.\n\nLOVE  The hidden entrance. All the cocktails my friends and I ordered. Our mixologist George Sproule. The fresh and seasonal ingredients they used. The atypical atmosphere for a downtown Vegas lounge."
        }, 
        {
            "index": 60, 
            "rating": 5, 
            "review": "Amazing cocktails. Great ambiance. No cover. Relaxing retreat from the Fremont Experience. Great bartenders. Best.Punch.Ever. This place deserves to be on the main strip. Do yourself a favor and stop in."
        }, 
        {
            "index": 61, 
            "rating": 3, 
            "review": "don't like the dark dull atmosphere at all..... and couldn't get used to the cocktail's taste. but the waitress is really nice, help us with patience though we couldn't understand very much."
        }, 
        {
            "index": 62, 
            "rating": 5, 
            "review": "Great Drinks and Speakeasy atmosphere. Unexpected gem in Downtown Vegas!"
        }, 
        {
            "index": 63, 
            "rating": 5, 
            "review": "Great drinks and great atmosphere anytime of the night try the killa kiwi!!"
        }, 
        {
            "index": 64, 
            "rating": 4, 
            "review": "If you appreciate the craft of well made cocktails and a cool lounge environment that feels natural, then Downtown Cocktail Room is for you.  The bar staff is friendly, knowledgeable and they enjoy their work.  The cocktails are made from fresh ingredients and with unexpected twists.   The vibe is laid back and intimate.  The tables are surrounded by comfy chairs and couches and are lit by candles."
        }, 
        {
            "index": 65, 
            "rating": 4, 
            "review": "i have only been here once and for about 45 minutes but I was super impressed.  I went in around last call, got a seat at the bar, and was promptly served a superbly crafted cocktail.  It is pretty hard to find a cocktail that is made this expertly anymore.  The decor was dark and cool and just being in their made me feel as if I was part of a secret that only the cool kids knew about.  Just getting in to the place can be amusing, especially if you are drunk.  I was not but still took a minute to find the proper door.  The bartenders were engaging and very knowledgeable.  Definitely check this place out, especially if you are a fan of hand-crafted, delicious, strong, old-school cocktails."
        }, 
        {
            "index": 66, 
            "rating": 4, 
            "review": "I am constantly on the look-out for decent places to spend a Friday or Saturday night in Las Vegas that don't include standing around a packed club having douchey guys in popped collars trying to rub their crotch against me. Luckily, Downtown Cocktail Room happens to provide a relief from such terrible adventures.\n\nLocated downtown, secluded, and wonderfully hidden from most tourists eyes the Downtown Cocktail Room is a wonderful placed to spend a night drinking with friends. Get there early enough and you'll also get a place to sit (AMAZING!) and waitresses will actually bring your drinks to you! Also, amazing. Sit in front of the window and watch people attempt to get in (the doors are a bit tricky for the uninformed, which makes this place even better). \n\nThe only reason I didn't 5 star is because sometimes the service can be a bit slow. I think my friends and I waited for our drinks for almost 10 minutes and there really wasn't a whole lot of people there yet (it was early for a Friday night). Other than that I have no complaints about this place. Oh and by the way, the drinks are fabulous, yet not over-priced, another plus plus! Try the Aviation. It's my favorite drink, besides the $5 shots of Jameson, of course."
        }, 
        {
            "index": 67, 
            "rating": 5, 
            "review": "When the sun sets in Las Vegas and you find yourself downtown fancying a cocktail, DCR is the only way to go. Between the dim lights, dark furniture and hidden door to get in the place, DCR reminds me of what Las Vegas would have been like in the yesteryears. Like 70's-80's Vegas when Sinatra and the gang would do gigs at the Sands and then after head to a place like this. \n\nHowever what really sets this place apart from all the other trendy downtown bars is they serve Absinthe and know how to properly prepare it. The cocktail servers know to ask the right questions when you request some of the green stuff. And if your knew to it, they all do a great job explaining the differences between each one and the different preparations. It's these little details that earn the full Yelp five star rating."
        }, 
        {
            "index": 68, 
            "rating": 5, 
            "review": "This place has been around forever, I always liked to come here, great music in the week ends, awesome cocktails and very good prices on the bottle service, kudos to Kevin the manager, Doug and Carlos the DJs on Friday and Saturday. Keep it on!!!!"
        }, 
        {
            "index": 69, 
            "rating": 4, 
            "review": "Headed to this palce after eating at Le Thai around the corner.\n\nPlace looked appealing walking by and can be very amusing seeing watching people try to leave and come in since the place has lots of glass.  People think they can just walk through.  I know I tried to walk out.  Oww..  \n\nGuys with me thought it was fantastic because drinks were only $3 to $5.  Happy hour, but all the time..?  We had a fairly large group so we ordered everything on the $5 list.  Not all were solid choice of course.  We ended up enjoying only 2 on the list and I heard that the actual bartenders created the drinks on this list.  I believe that everyone ended up getting the Traditional Calivailia (the one served in a jar).  Great drink and server is very sweet.  They come around plenty to take away your empty jars.  \n\nYes, i do agree with most folks who have written a review.  Tony Hsieh (CEO of Zappos) was sitting next to us.  Can't miss the guy since he wears a black T-shirt that says \"Zappos.\"  Music is pretty loud, wish the dj would turn it down a bit so we could chat.  No dancefloor, remember.. lounge, not club.  \n\nOverrall, nice place.  Cheap. Convience. I'd come back for the jar drink."
        }, 
        {
            "index": 70, 
            "rating": 5, 
            "review": "A cozy little lounge, very intimate. Great hand mixed drinks and the service was phenomenal."
        }, 
        {
            "index": 71, 
            "rating": 3, 
            "review": "Went here to meet some friends for happy hour after work.  Ordered one of their specialty drinks, it was good but I see nothing really special about this place.  The decor is kind of cool but for the money they charge for the drinks you can hang out on the strip at a better place.  Also, they no longer serve appetizers which I was looking forward to.  If you must come here, make it during happy hour becuase these drinks aren't worth the full price.  Overall, an ok average place but probably upscale for downtown."
        }, 
        {
            "index": 72, 
            "rating": 4, 
            "review": "Tonight we visited this place to hang out with some peeps from out of town.  I have to say that for the most part, I love DCR.  This place has become the unofficial place for our CEO.  They actually named a shot after him.  Here's what I thought:\n\nDRINKS:  I usually get an ordinary vodka, soda water and a lime.  I'm not to big on \"foofy\" drinks.  Simple is always better for me.  They do make their drinks strong and I think it's valid because the drinks are a little pricier than normal.  If you're into Absinthe or Fernet, you will like their mixed drinks.  I think highly of the place because of the way they make their drinks.  Their mixologists have really taken the time to perfect the right cocktail.  Their bartenders take the time to handcraft these drinks in a seemless manner, down to the way they shake their martinis...very chic.  \n\nThe shot that we have (named after my CEO) is called the \"Delivering Happiness\" shot.  This shot  contains Fernet, an herbal liquer.  Fernet is known as a digestive spirit, very aromatic and slightly bitter.  This shot also has whiskey and lime juice.  It's an aquired taste, true.  But trust me, the Fernet really helps stablize your stomach LOL.\n\nAMBIANCE:  This place is super trendy, very chic and the low lighting offers a very intimate setting.  The decor is a bohemian theme with lots of wall art, a middle table seating and back VIP area.  The one thing this place is known for as being unique are the doors.  First, when you get in, be careful.  The glass is not the front door, it's the big metal wall to the left.  The bathroom has a one sided glass-mirror doors and walls.  When you're inside the stalls, you are able to look out as the walls are glass and see-through, however when you're looking towards the stall, it's a big mirrored wall.  The door leading to the DJ booth is a hidden door and looks like the entire wall.  Lastly, the door from the bartender's station to the backroom looks like it was made for little people.  It's half the height of a regular door.\n\nAll in all, this place has a speakeasy vibe that anyone would enjoy.  Great place to visit after a long day at work.  The ambiance allows you to properly wind down.  Lot's of executives frequent this place.  On the weekend, come early if you want proper seating."
        }, 
        {
            "index": 73, 
            "rating": 5, 
            "review": "I've never heard Thievery Corporation played at any other venue in Vegas.  There is a cocktail made with Lienenkugel beer which pleasantly surprised me.  I appreciate the vibe here very much, and it's definitely on my list of places to go in Fremont East.  Though the hidden-in-plain-sight door messed me up the first time I went."
        }, 
        {
            "index": 74, 
            "rating": 4, 
            "review": "4.5 Stars \n\nLove the drinks...others love the DJ and House music...I wish I did my homework better because I really enjoy some of the jazz they play but like to converse with classic cocktails in hand.  IMHO the drinks here are too good for the scene which is not bad at all...just not what I want."
        }, 
        {
            "index": 75, 
            "rating": 4, 
            "review": "I used to frequent Salon of Beauty (or The Beauty Bar) on Fremont. One day while we were walking from the Big Red Garage, we saw \"downtown\" in neon on the west wall of the same building that The Beauty Bar is located in. \n\nWe finally checked it out and were blown away. Granted the first time we went, there was like, only one other party in there. But we could smell the massive potential. \n\nIt was like a true speakeasy. The music was mellow, they had earnest barmaids, and the decor was trendy but warm. \n\nThe bathrooms are cool. The stalls are partitioned with two-way mirrors. Perfect for people that have I-want-to-watch-people-while-I-pee fetishes. Walking in, seeing all of the moving mirrors, I felt like Bruce Lee in Enter the Dragon. \n\nThe lounge is partitioned into two parts. The front has several tables and comfy bench seats. The back has small tables and private booths, just large enough to comfortably fit four people. I think sometimes they close up the back like a VIP area. \n\nThere is a sealed-up DJ booth and sometimes there's live bongos. \n\nThis place is hit or miss, though. Its different everytime I go.\n\nThe second time I went, it had picked up a little and there was just the right mix of people. It wasn't too crowded, there was no That Girl, and not too much pretentiousness (my biggest pet peeve). \n\nThen the third time I went, it was jam packed full of totally obnoxious, borderline frat boys. \n\nI haven't been back in a long time. I'll go back on a Wednesday or something. \n\nOh, and I had a problem finding the door, too. \n\nPark in the garage east of Fitzgerald's and just pay the fee (prolly $6 for the night). \n\nUpdate *11 June 08* \n\nWe went again this last First Friday and as I suspected it has mellowed out so much since our last visit. Plus we went a little early, like 10p. By the time the rest of our party rolled in an hour later, it had packed in. When we got there, the back section was curtained off. When our friend joined us, it had opened up and we got a table large enough to accommodate us plus one in the back. \n\nThey are now one of the few establishments in Vegas that legally serves the famous Absinthe, brand: Kubler. If you order it Van Gogh style, its chilled and served with a sugar cube. \n\nI like the versatility of Downtown. You can go there to wind up for the Beauty Bar or decompress from the chaos of the strip or downtown. \n\n$8 drinks. I recommend the pre-drink. I never leave home without a flask. \n\nWe always park in the big red garage on Carson and fourth and pay the $6 (depending on how long you stay) fee. \n\n* off the strip (kind of), non-casino"
        }, 
        {
            "index": 76, 
            "rating": 5, 
            "review": "This is my favorite place downtown. Actually, it is probably my favorite lounge/bar in Vegas. The vibe is relaxed yet classy. The staff is friendly and unpretentious. The drinks are imaginative and delicious. The only downfall are the prices. The cocktails are generally between $9 and $12 and shots (well, lemon drop shots at least) are $10 a pop. The cocktail list is pretty extensive with some very unique concoctions. My favorite is probably Water of Life - it is basically rum and coconut water with some herbs mixed in. Might as well get some electrolytes while imbibing. The decor is dark and an interesting mix of gothic and contemporary. I love to sit near the window and watch people feel their way around to find the door. The bathrooms are also a trip. They are all mirrors and can prove very confusing once one has imbibed a sufficient amount of alcohol. The stalls are one way mirror and are actually really cool. If you come early enough, you will find comfortable seating and great service."
        }, 
        {
            "index": 77, 
            "rating": 5, 
            "review": "Love this place! Dark and cozy with good music, wait staff is always pleasant.\n\nIt's hard to rate this place on only the drinks, they are always so different with them having seasonal menus and the drinks being very different. I've had a few I have loved, and even more that I hated... One even tasted like spiked refried beans.. bleh! When that happens, they are more than willing to make something else. They do have numbers near the names that tells you how extreme or adventurous, so to speak, the drink is.\n\nAside from their seasonal hand crafted cocktails that have a list of different liquors and beers they offer, so there is always something for everyone!"
        }, 
        {
            "index": 78, 
            "rating": 4, 
            "review": "They would get ALL stars if it was NON SMOKING. But alas.... it isn't...\n\nI also love the fact that it feel upscale in the middle of what seems to be the downtown drug deals & annoying drunk tourists.\n\nAMAZING SERVICE! Bianca was our incredible bartender!  Not only was she attentive but she gave us samples of things AND extra pours \"to try\" of other people's drinks. AMAZING.\n\nI am sad that their website doesn't have the current cocktails, otherwise i would give you the actual names. wah. here goes...\n\nI had the martini made with almond milk??!!! WHAT??? Oh yes... it was everything i LOVED in a glass... kinda like an alcoholic iced latte' w/ some sort of cinnamon or nutmeg around the rim. YES please.\n\nThe Gin, Orange Peel, Bitters & Absynthe cocktail was good. My hubby forgot that Absynthe tastes a bit like licorice... which he is not  fan of... he was a bit disappointed... but if you like that? go for it.\n\nWe also tried a Scotch drink, which my man LOVED! \n\nAlso some sort of lemon amazingness which was brilliant. I think \"Jack\" was in the title.\n\nA truly amazing evening besides the cigarette smoke. wah."
        }, 
        {
            "index": 79, 
            "rating": 5, 
            "review": "Best bar in town.  I've been coming here since they opened.  Great drinks, music, service, room.  I hate the big, thumping clubs and \"ultra-lounges\" aka clubs with couches.\n\nChillax to groovy toons in a hip, San Francisco style lounge done right..."
        }, 
        {
            "index": 80, 
            "rating": 5, 
            "review": "LOVED THE MUSIC. Great house music both Friday and Saturday.\n\nEverything else was chill as well; good vibe, nice crowd, and the ginger shot I did was really good as well.\n\nWe were visiting just for the weekend but had so much fun there Friday that we returned Saturday."
        }, 
        {
            "index": 81, 
            "rating": 4, 
            "review": "Great atmosphere and drinks are unique. I love to pre-game at the Downtown Cocktail lounge. It atmosphere is very chill and drink are pretty good. The music played by the DJ could range from electronica to Trip hop. The servers and bartenders are very friendly. You should definitely try out their Absinthe drinks. They're pretty good."
        }, 
        {
            "index": 82, 
            "rating": 5, 
            "review": "Awesome bar. They have great cocktails. I stopped by to get a few drinks and was surprised how great this place was. I guess downtown is slowly getting classier and it shows!"
        }, 
        {
            "index": 83, 
            "rating": 5, 
            "review": "We came here to find some good mixology/craft cocktails since we love going to these secret speakeasy style places here in NYC.\n\nThis place is incredibly hard to find and get into... literally. We thought it was closed when we walked up to a wall of dark tinted windows. The door looks like an unmarked metal wall you have to push to enter.\n\nIt was pretty empty around 9pm on a Thursday so service was very personalized.\n\nWe asked the bartender for recommendations and got exactly what we expected. The drinks are very unique and delicious. Apparently the menu changes monthly which is neat.\n\nUnlike NYC, the menu isn't so Whisky-centric (thankfully) so we were able to find a nice array of drinks that didn't suck.\n\nPrices were also great  and the average was around $11\n\nWe tried a few of the sweeter cocktails and loved every one of them.\n\nAfter going to a handful of similar places in New York City, this place easily competes with the best cocktail bars we've been to.\n\nHighly recommended."
        }, 
        {
            "index": 84, 
            "rating": 4, 
            "review": "I think entry into the Downtown Cocktail Room is designed as something of an IQ test set to weed out only the intelligent (and lucky) customers.  It took me a minute or two to figure out which part of the dark wall is the actual door.  While I am sure this is a continual amusement for regulars of the lounge, a small sign, a doorman, or even a handle would shave time off of the deductive reasoning.  In retrospect, it IS kind of funny.\n\nThere's a lot to like about this place.  The place looks excellent, the bartenders and servers are dressed stylish, the art on the wall is excellent, as is the (non-deafening, non-screaming over) music, and the place has a very cool \"vibe\" to it.  The vibe of any place is an intangible thing, and somewhat hard to explain.  It either feels right, or it doesn't.  This place is excellent to sit back and enjoy.  And very clean.  Someone knew what they were doing when they set up the overall look of this place.\n\nThe drinks?  I had a very nice server.  Being a first-timer, she pointed out a few excellent drink choices, both were very satisfactory, unique, and flavorful.  They even serve absinthe there, which got an eyebrow raise of surprise from me.  During the night, she forgot part of my order, but was very apologetic, and worked hard to set it right, which I couldn't help but recognize the sincerity, and the EXCELLENT customer service.  She was class.  The whole night was just a wonderful experience in which I would return again... in a particular time period.\n\nSo why 4 stars?  Another review noted it gets busy at the place around 11, which was an accurate forecast.  The issue I had with the place isn't a direct fault of the actual establishment itself or its staff, but I have to make note of it.  As it got busy, the building hipster crowd that began to appear in droves as the night wore on didn't so much as chain smoke as they began to chew and eat cigarettes in an attempt to go through what was apparently a pack smoking contest to see how many could be lit and inhaled during one night.  I can handle smallish amounts of smoke, and crowds don't bother me, but my God, man.  I was there for two previous hours of awesome, then... yeah....\n\nThey serve bar treats here.  A nice variety of bar related nibbles (served very well, and very cheap), and I guess it's debatable if that could actually be considered \"food\", but I wish it was, as food in an establishment keeps the smoking element out.  Perhaps a separate lounge, or larger fans, or an outside area, or something.  All I know is that I was having a wonderful time, but I got so smogged out that I just had to leave.  I was disappointed because I REALLY wanted to stay longer and try yet another drink, but around 11-12, it was just too much.  One of my friends and I had to leave as we started feeling sick.  Again, I don't blame the Cocktail Room itself at all, but I do hope that they can try to find an a little help for us non-smoking types.\n\nI can easily 5-star this place (and it pains me not to), but I think that will mean me both coming and leaving early here if last night was an indication of a regular weekend night.  They nailed the atmosphere, service, and drinks.  I just wish I could breathe in there as the night wears on.\n\nCool place, though."
        }, 
        {
            "index": 85, 
            "rating": 5, 
            "review": "Obsessed\n\nIve been coming here for years and it never disappoints! this past experience last weekend particularity stood out from the rest. Kevin our bartender was amazing. I was fairly buzzed by the time we arrived so I was in the mood for something light & fresh. I told him I wanted something fresh and cucumbery. He made me an amazing cocktail that was mixology gold. \nThey also have an array of house made bitters. Because of Kevins explanation for all of them it inspired me to start making my own bitters at home. My friends all ordered different cocktails as well. My girlfriend ordered the Fig cocktail. It was surprisingly great. I'm sure it will be a great seller in the winter. Also the apple pie cocktail.. OMG. outstanding. \nThis is always a must visit place for anyone out of town or any local just looking for a chill spot with customized craft cocktails."
        }, 
        {
            "index": 86, 
            "rating": 4, 
            "review": "Cool, chill vide and killer music/DJ going on.  Drinks are always mixed just right.  Love how is is kind-of hide of to the side and it is fun watching people find the door for the first time."
        }, 
        {
            "index": 87, 
            "rating": 2, 
            "review": "The reason I'm giving this place 2 stars is for the amount of smoke that's in this joint!! Yuk! I'm sorry, but this is the 2014. Either don't allow people to smoke in your joint, or only allow e-cigs. Smoking USED to be cool, key word, USED. \n\nI love imbibing, and this place definitely has a cocktail menu that would tickle anyone's fancy. I also love that they have seasonal drinks on their menu as well. Oh and the snack mixes! Love that they have snack mixes on the menu too! \n\nThis place also plays deep house, vibe house music! I love it, sooo great for cocktail lounges. \n\nWould have spent a lot more money here, and would suggest to hit this place up more often. Unfortunately, I like my lungs, and my lungs are extremely sensitive to smoke. I came home and was sick the next morning from being here ."
        }, 
        {
            "index": 88, 
            "rating": 3, 
            "review": "Cool little hidden lounge right off of the Fremont Street experience. Some friends and I had a little trouble finding the door, and tried pushing in on all the windows. We even tried going into the alley next to it hahaha. We figured it out when the DJ inside knocked and guided us. Just look for the unmarked metal door. Super dark inside, but not bad one your eyes grow accustomed to it.  Not sure if we just ordered the wrong things,  but none of us were really happy with our cocktails.  The star of most of the drinks available was anise, and the flavor was too overpowering. Not a great first experience, but the ambiance was nice enough, and I know they switch drinks out seasonally, so I might check it out again."
        }, 
        {
            "index": 89, 
            "rating": 5, 
            "review": "Great drink options - seasonal and fun - the Netflix & Chill I tried has a sour patch kid in the bottom to mix things up. Absinthe bar, swanky ambiance and intimate seating. A perfect spot if the lights of Fremont get too bright. And did I mention the music is on-point."
        }, 
        {
            "index": 90, 
            "rating": 4, 
            "review": "A friend of mine Lenny Co DJs Thursday night play all different type of music! The drinks here are amazing all the drinks are made from scratch so they make their own sweet and sour etc. They also have a number system on the menu that lets you know how strong the drunks will be! \n\nI didn't get a picture of the fireball shot but they're really good they taste like Red Hots"
        }, 
        {
            "index": 91, 
            "rating": 3, 
            "review": "A nice break from the craziness on Fremont Street!\nThere are always some unique cocktails to be had here, as the bartenders take their time to craft each beverage. A happy hour enhances the experience, as you can choose to go the cheap route or the more pricey hand crafted route.\nThe decor is on the darker side, and the candles add a nice touch. The vibe is laid back and mellow, and you can actually have a conversation without having to yell to be heard."
        }, 
        {
            "index": 92, 
            "rating": 1, 
            "review": "This place sucks.\n\nFirst off, we couldn't find the damn door. That was kinda funny tho. \n\nAtmosphere was dark and gloomy. Going to the bathrooms there were no lighting, I couldn't see the toilet! They didn't have any seat covers either!\n\nWe asked for a sweet cocktail-- we got the Tippy Toe. It was NOT sweet at all. Pretty nasty. My friends got a Pear beer that was pretty good. The cocktail waitress were very friendly though. \n\nOverall, probably won't be returning."
        }, 
        {
            "index": 93, 
            "rating": 4, 
            "review": "Been wanting to try this place for a long time . . . however . . . even reading  the clues on how to open the door to enter so you don't look foolish . . . still didn't work, but still got in.\n\nThis place was everything other before me have posted . . . great ambience . . . great music . . . unbelievable drinks . . . it was definitely one of the highlights of our evening.\n\nBut then why only 4 stars . . . well . . . the place was semi busy, but with only one mixologist . . . it took way to long to get our drinks . . . but definitely on my list of returns spots."
        }, 
        {
            "index": 94, 
            "rating": 4, 
            "review": "Cute place. Couldnt find the door to get in, lol, but my friend had been here before so she knew. It's a small place but it's a nice intimate setting. The have an in-house DJ and sometimes they have a band. Neither were here but that was cool because sometimes it gets too noisy when there is a band/DJ. The drink list was super cool. I had the meddled watermelon and vodka, (I forget the name). The smell of watermelon as you sip the drink was amazing! The floating cucumber was a classy touch too. The honey-do-me drink was real nice to. The service from our waitress was OK. The prices are strip prices even though it's downtown. I've noticed that last time I was on Fremont street that it's NOT cheaper than the strip. Not at all.I'll definitely come back here. The drinks were that good!"
        }, 
        {
            "index": 95, 
            "rating": 5, 
            "review": "This is my favorite bar in downtown Fremont east, hands down.\n\nYou enter the door, which is hard to find and often entertaining, and instantly you're at home.  Low candlelight and atmospheric art work glow in the background, and a nice house mix is playing through the speakers.  Plenty of space to sit at tables, or couches, with any amount of privacy you could want for you and your date or friends.\n\nThe drink menu changes with each season.  I tend to prefer the winter menus, with more whiskeys and warm concoctions.  I wasn't a big fan of the summer menu (too much cucumber).  But no matter the season, you're bound to find something on the menu that fits you.  Each drink is highly priced, but they're all made with care and the finest ingredients so they're well worth it.  I highly recommend the absinthe, served traditionally with cold water dripped over a sugar cube.  They have plenty of brands to chose from, and each is a taste of delight.\n\nIf you're in a large group, consider ordering one of the old fashioned punch bowls.  It's basically a giant cocktail that everyone can share, with individual glasses and a ladle for all.  It's a conversation piece for sure, and for the price its well worth the amount served.  As with all other cocktails on the menu, the particular punches change with the seasons.  Just stop in to see which is on the menu and ask your server.\n\nThis is a wonderful place to go for socializing downtown in a high class atmosphere, where you're bound to avoid the screaming drunks of west Fremont.  Also, there is a door guard who is very friendly, and ensures that your evening is a safe and enjoyable one."
        }, 
        {
            "index": 96, 
            "rating": 5, 
            "review": "Downtown Cocktail Room has become one of my new favorite places to go. I'm going to chime in with Dave here and agree that this place has a Hollywood vibe. Downtown Cocktail Room is something you wouldn't expect to find in Vegas with its air of mystery and sophistication. It's one of those inconspicuous places that doesn't advertise and you would never know that it's there unless you heard by word of mouth, which probably adds to it's allure. \n\nYou walk in to a dimly lit, red walled room with concrete floors and delicately placed candles and modern art. The entry way is filled with small tables and leather chairs with a live DJ to your right . The back wall is tinted paneled glass obscured by sheers. The bar is towards the back with the female bartenders wearing red cocktail dresses and the men wearing button downs and vests, a la old school Hollywood. The drink list changes seasonally, and the bartenders are more mixologists than pretty faces (well they're actually both). I ordered a martini with freshly shaved ginger, a hint of wasabi, freshly muddled strawberries and vodka. It was one of the most unique, yet fantastic cocktails I have ever had the pleasure of enjoying. The bartender was friendly and the crowd was young and mixed. The live house music was fantastic, was at an appropriate volume, and everyone seemed to mingle. The price points are higher than other Fremont Street bars, but the prices are well worth the cocktails and ambiance. Here's to DCR! I'll see you again tonight for my 24th birthday!"
        }, 
        {
            "index": 97, 
            "rating": 2, 
            "review": "I went here at 6pm on a Friday night to meet up with some friends.  My downtown co-workers and I used to go here all the time because they would give you a free bottle and mixers if you showed up before 6pm.  I think they changed to more of a high-end cocktail place, which I was eager to try.\n\nI sat down at the bar and tried to make eye contact with the bartender for a good 15 minutes.  But he was preoccupied with a group of older gentlemen in suits who seemed to think that they knew how to make drinks better than him.  He'd give them whatever they ordered, they'd taste it (or just look at it) and then tell him to add more of X (usually alcohol).  The bartender seemed kind of spacy because he kept trying to add tequila when they asked for vodka.  He didn't seem to know what he was doing.  Very slow making the drinks and would stare at the labels on the bottles for a good 30 seconds before pouring the liquor.  It was seriously weird.  After getting pissed for being ignored, I sat in the lounge area and waited for a cocktail waitress who showed up eventually after my friends showed.  \n\nI got the Devil's Whiskers, Last Word, and a French 75... all gin cocktails.  I love gin.  They were all reasonably good, especially at $7 happy hour prices.  But nothing extraordinary compared to high-end cocktail bars in SF and NY.  Plus, the cocktail waitress seemed spacy as well, quoting me the full price, not the happy hour price, but then charging me the happy hour price.  Also, when I was almost done with my first drink and tried to order another one, she exclaimed, \"What? You didn't like it?\"  Uh... no.  I'm almost done with my first drink and I know it takes forever to get another one so...\n\nMaybe I should try it later at night and re-review.  Overall disappointed."
        }, 
        {
            "index": 98, 
            "rating": 3, 
            "review": "An invitation from a couple of friends presented the opportunity to experience the DCR first-hand after reading many great reviews. I want to share my experience because it seems significantly different than most of the other reviews I've read...\n\nA DCR bartender came to our table and asked us what we would like to drink. A woman in my group was interested in a certain 'Japanese' cocktail on the menu which contained ginger and wasabi ingredients, and the bartender asked her, \"What interests you about THAT drink, the strawberries?\" She mouthed the words, \"Uh, no...\" And she said it was actually the description of the drink as being a \"Filler\" drink - one with \"food qualities\" according to right-hand-side 'drink guide' on the DCR cocktail menu. The bartender said, \"I don't like the menu\" and basically told us he didn't know or care about the 'drink guide'. He seemed eager to only make drinks that were not on the menu. This was surprising, as it seemed that the DCR put a lot of effort into creating its cocktail menu and 'drink guide'.\n\nThe bartender then suggests an off-menu strawberry-based drink to the woman in my group. This is funny and ironic. Funny because I have heard her criticize bartenders for assuming that because she is a woman, she likes sweet strawberry drinks (which she doesn't) - \"8 out of 10 times when I ask a bartender to create a drink of their choice for me, it comes out sweet and strawberry. So annoying!\" Ironic because from the sleek decor of the DCR, I assumed this wouldn't be one of those times.\n\nThe bartender then asked me what kind of alcohol I would like in my drink. I suggested, \"Vodka,\" and he quickly replied, \"I don't work with vodka.\" How pretentious! What is it about this guy that he is so confident that he will get his way and only make drinks he likes to make? The 'speakeasy' vest? Over HALF of the specialty cocktails listed on the DCR cocktail menu are made with vodka! if this bartender were a waiter at a restaurant we would have walked out by now. At this point, I was ready to believe that everything Yasmin T. said in her previous review was spot-on...\n\nSo, since vodka was out of the question, I suggested, \"Bourbon.\" He suggested a \"really good Manhattan\" and the drink I ended up with was really good. He told me he used Woodford Reserve and he placed a pitted black cherry on the bottom of the martini glass. The flavor of my drink became more intense as I got to the bottom of the glass - the cherry did a good job of infusing the drink and keeping things interesting.\n\nFor being downtown, one would assume that the cocktails here cost less than those on The Strip, but apparently 'mixology' is a magic password to charge regular price, or in the case of one of the drinks on our group's DCR bill (a Sazerac), an eye-popping price: $19.00! The rest of our drinks were all between $9 and $11 each. I wonder if the old real estate adage, \"Never buy the most expensive house in the neighborhood\" applies to the DCR in some way. On the way to the bathroom I took a look around the DCR, and I was surprised to see that their 8PM Saturday night clientele basically fit two categories: Touristy guys with Oakleys on top of their heads and their Coach-bag-toting wives, and groups of 50-something single local men out with their girlfriends. DCR seems to be doing a good job fending off the hipster crowd? Where are the hipsters tonight?\n\nTo the DCR's credit, they have put considerable thought and money into the fixtures and furnishings. Overall the place was clean, the lighting was relaxing, and the QSC speakers throughout the room put out a quality sound. The music being played during our visit was a trance-electronica style which matched the decor well.\n\nOverall, I had higher expectations. Now for the hard part: 3 stars means \"A-OK\" and 2 stars is \"Meh. I've experienced better.\" My experience wasn't A-OK, and I've been to a lot of bars - I've traveled through 19 countries outside of North America in the past 12 months. (And no, I'm not in the military.) But in the spirit of benefit-of-the-doubt, I will give it 3 stars.\n\nAfterwards we had a pretty good Super Gyro and falafel plate around the corner at the Kabob Corner, which should be named Kabob-Around-The-Corner because it's not actually on a corner. Then, off to a dance club down the street. The night ended well, and the company was first rate!"
        }, 
        {
            "index": 99, 
            "rating": 5, 
            "review": "My boyfriend and I love this bar. We went in last night and Davey was our bartender... AMAZING. We always get great service here but we were truly blown away by how knowledgable and personable Davey was throughout our entire experience. The cocktails were off the charts, as usual, but what really brought it home for us was our lovely bartender!!! Also, their doorman is the friendliest man ever! Always look forward to seeing him when we arrive. We will be back for more very soon. Happy, happy, happy customers!!"
        }, 
        {
            "index": 100, 
            "rating": 4, 
            "review": "This place is truly so cool. It's usually got dim lighting that gives it this sort of hole in the wall feel. \n\nSome of the best cocktails I've ever tried, with the most creative combinations and flavor additions like jalapenos, lavendar, ginger, and pomegranate.\n\nIt's not as pleasant when it's packed, which it sometimes is, but I still give it 4 stars.\n\nDefinitely try the absinthe served in the traditional. Can't go wrong with that, but watch yourself! It's very strong and very sneaky. \n\nIf they open the side seats and booths, grab one quickly because they fill up fast. It's definitely a nice change of pace from the madness that is Freemont. \n\nOne of the only problems is that the women's bathroom is comprised almost completely of mirrored glass, and there's no lights in the stall. We all know what happens when drunk girls use the facilities. And in the dark? Ah forget about it. Pee pee and toilet paper everywhere. \n\nEven so, this is still a diamond in the rough."
        }, 
        {
            "index": 101, 
            "rating": 5, 
            "review": "The BEST music in the city. Yes, we have a lot of mega clubs in Las Vegas and I have only heard the best music in town here. On my birthday, one of the guest DJs was from Japan who flew in just to play at this bar. WHat a treat! This is my joint! Heaven on the strip. Downtown vegas on Fremont Street Experience."
        }, 
        {
            "index": 102, 
            "rating": 4, 
            "review": "This is one of my favorite places to go, I do not care that everyone tries to dress like a hipster which I detest, the music is great, the ambiance is perfect, I kind of feel like I am back in Chicago area at a very hip artistic club.  The ONLY thing I hate are the douche bag male bartenders!  The last time I was there I stood at the bar for 20 minutes, not one person behind the bar would look at me, they looked at every single woman that came up and cut in line, but not me....one even tried this \"Tom Cruise Cocktail\" move with a bottle of vodka and sprayed it all over me, never once said SORRY.  One of my friends ordered 4 drinks and her tab was actually over 300.00, the idiot bartender rang it up wrong and never told her, had we not notice it she would have spent over 260.00 more than what she should have....it makes me wonder how many times they do this and no one notices...he never even apologized. \n\nI would recommend taking a seat at one of the tables because the female staff is always right on top of their customers and always really friendly.   \n\nOne of the best parts is watching someone that has never been there try to figure out how to go in.  The first time it took me about 10 minutes, the door guy finally felt sad for me and opened the door LOL!!"
        }, 
        {
            "index": 103, 
            "rating": 5, 
            "review": "DCR is the best. Great cocktails. Great atmosphere. Even when it's crowded you can still talk to the person next to you. And, you can order food from Uncle Joes next door during happy hour, if not all of the time. I highly enjoy the seasonal drink menu as well. I like being able to get a new drink every time I go in."
        }, 
        {
            "index": 104, 
            "rating": 5, 
            "review": "they change the drink menu every season here (only small snacks) avail and the drinks are always on point. every single one of them. they have something for everyone. I've celebrated a few birthdays here, gone on a few first dates here, met some awesome people here... this is where I like to start my night. The ambiance is very trendy, very dark and sensual. Sip your drink slow, they are expensive but worth it. Music is loud but that's the way I like it!"
        }, 
        {
            "index": 105, 
            "rating": 5, 
            "review": "The hidden gem of all the bars downtown if you enjoy a brilliant cocktail.  So much so, that I won't say more because I want it to stay a hidden gem."
        }, 
        {
            "index": 106, 
            "rating": 4, 
            "review": "Great local hangout in downtown Vegas. If you are looking for a break from the strip where you can have fun and drink for reasonable prices head downtown. The place has fire pits inside with seating surrounding it"
        }, 
        {
            "index": 107, 
            "rating": 5, 
            "review": "Innovative cocktails with a really great happy hour for drinks. The cocktails were 7 dollars each. It did take a bit of time for service but the bartenders were really nice and accommodating."
        }, 
        {
            "index": 108, 
            "rating": 5, 
            "review": "Was headed down Freemont to get a pre-dinner \"pop\" at the Griffin when we spy a door in a brick wall on a side street that says \"downtown.\"  Weird.  Anyhoo, it was 4pm so the Griff was locked.  Spur of the moment return to find that Downtown is a cool cocktail lounge.  They know how to make the classics and have a creative menu of their own. \n\nThe happy hour menu includes snacks from a nearby Indian restaurant.  The wife had a French cocktail and one of their originals (that included coconut water).  \n\nI love places that crush their own ice, take care with juices and ingredients and have droppers full of interesting flavorants.  I call them REAL cocktail bars and this is one.  I will be back, maybe even at night."
        }, 
        {
            "index": 109, 
            "rating": 5, 
            "review": "\"Figure out how to open the door\",  I was told as they chuckled and thought I would not be able to figure out the tricky hidden entrance, but I was quick and into this cocktail bar we went! \n\n*The Downtown Cocktail Room* is in the heart of Downtown Las Vegas, a little off to the side the main street, but still right near the heart of town. I usually prefer going to \"The Griffin\", but it was cool to check out and try a different bar. \n\nUpon coming in, it has that dark vibe.. lots of posh seating and a fun and unique menu. The cocktail menu here is seasonal as they change it up, which is cool to allow a new array of cocktail recipes to try. They have a DJ playing music that matches the atmosphere here. The server who helped that evening was in training and she was great, (very knowledgeable with the drink menu as she was being observed by her trainer) and provided us with friendly service. \n\nDRINKS I tried: Waters of Mars (gin cocktail) & Sweet Georgia Brown (bourbon cocktail)\n\nOverall, a great ambiance.. come here thirsty and ENJOY. :P"
        }, 
        {
            "index": 110, 
            "rating": 1, 
            "review": "Trying too hard. That was the impression I got from this place after spending an hour there.. From the impossible-to-find front door, to the Eastern European underground \"feel\" they are aiming for, to the complicated and foreign ingredients in the cocktails offered, the DCR ruins what could be an otherwise cool place to hang out.\n\nI had the opportunity to visit DCR during a happy hour gathering for a friend's birthday and the experience left much to be desired. First, they were painfully understaffed. In fact, there was only one employee working and she was being the bartender, waitress and table busser...not a good spot to be in when there are 25 waiting to get drinks.\n\nSecond, and most importantly for me, there was no appeal to their happy hour or their drink menu. Now, I would be ok with the fact their 'happy hour' only discounts a couple of dollars from their $12 drinks (average price) but what I am not ok with is that out of the 3 drinks I purchased none were drinkable. When ordering a cocktail please beware of the many mystery jars and eyedroppers they will use to add the ingredients to your drink that will surely ruin it. If you find yourself visiting the DCR just order a glass of wine. You will thank me later."
        }, 
        {
            "index": 111, 
            "rating": 5, 
            "review": "Dark little bar just off Fremont Street that serves up excellent cocktails. I've come here two years in a row now on Vegas trips and think it's worth it if you want a real drink and not one of those syrupy concoctions in a plastic cup the size of a man's thigh.\n\nThe menu changes depending on the season and I imagine the staff's whims, but we've liked everything we've tried.\n\nSpeaking of the staff, they were great when we forgot our credit card. The bartender remembered us and greeted us with the card in hand when we got back a few hours later."
        }, 
        {
            "index": 112, 
            "rating": 1, 
            "review": "Definitely NOT the place for me!\n\nWe couldn't find the door! Which was pretty funny, the security guy helped and laughed with us.\n\nReally dark, small place..\nOur waitress was really nice and seemed like she knew the popular drinks.\n\nWe asked for something sweet, she suggested a Tippy Toe--- Horrifyingly NOT sweet. Every sip had a gag to follow..\n\nA couple of our guy friends had an Ace Pear Cider which was really good.\n\nI don't know if a return is in the near future... Again, just wasn't the place for me."
        }, 
        {
            "index": 113, 
            "rating": 4, 
            "review": "This place is exactly how it is described. Dark, secluded, local bar right off Fremont experience. The bartender was awesome. Very friendly and good recommendations on drinks. I would have stayed there all night if the drinks were a little cheaper. We went for happy hour which was $2 off classic cocktails.\n\nThe level 3-4 flavor drinks were really interesting tasting. Not your typical vodka cran."
        }, 
        {
            "index": 114, 
            "rating": 5, 
            "review": "Oh DCR how I love you! \n\nYou are dark. \nYou are cool. \nYou are aloof. \nYou are mercurial. \nYou are poetic. \nYou are mysterious. \nYou are everything this man could wish for.\nI count the minutes until we can be together again.\n\nYou are worth SIX stars but alas, this rating system doesn't know you the way I do."
        }, 
        {
            "index": 115, 
            "rating": 4, 
            "review": "Came here for the first time before we headed over to Wish. Very dark as you step inside and cool house beats playing added to the cool vibe inside.\n\nTried a drink called Naughton In My Coconut which must've been created for somone's birthday(There was a special birthday menu as well) It was pretty good and was one of those \"creeper\" drinks...\n\nCool place to hang out with the gang, and most definitely will return...ALOHA!\n\nYELP 100 CHALLENGE 2013-(25/100) \"A Little Drinky Drink Before Dancin'\""
        }, 
        {
            "index": 116, 
            "rating": 5, 
            "review": "If you are looking for a chill place to go on a Friday or Saturday night.... THIS IS IT! It's dark and sexy! I love it! Great cocktails and great music! What more can you ask for!"
        }, 
        {
            "index": 117, 
            "rating": 5, 
            "review": "I can't believe it's been nearly 4 years since my review. I have probably been here a few times in the past 4 years, most recently last week. Nothing has really changed... I really love this spot. This time, I was there a bit earlier where it was not very full but still a great spot to hang out!\n\nThe waitress thought we were locals, which was a great compliment and a great way to start our experience! She was also super knowledgeable about the menu and explained the complexity scale for the drinks. I had two of them - Batship Crazy and Vow of Silence. The former was rated 4.5 and the other 3.5. I didn't think I would like Crazy but it was one of the best drinks I've ever had. Silence was much different but still a really good drink."
        }, 
        {
            "index": 118, 
            "rating": 5, 
            "review": "Wonderful drinks and a very quaint crowd. Enjoying the night! Specially the drinks and the DJ  we will return!"
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "Love this place. Somewhat hidden and a dark romantic atmosphere. Drinks are absolutely ridiculous and the service was even better. Ask for Davy the bartender, what a guy. This is one of my new favorite spots."
        }, 
        {
            "index": 120, 
            "rating": 4, 
            "review": "This is a slightly odd review. I really like this place...on weeknights, at happy hour, when it's not catering to the Drunken-Nightclub-Hopping-Touristy crowd. I really hate this place on some random weekend nights, when it seems to be a completely different place. It happened to me once, and I've not been brave enough to try a weekend since. Maybe it's not that bad every time.\n\nOne of the things I miss most from Chicago are the cocktail bars (Violet Hour, Weegee's), and on some nights of the week, the Downtown fills that niche for me. On others...it's just another OONTSOONTS-DUBSTEP-OONTS filled nightclub that's so packed its impossible to move and so loud its impossible to hear the person next to you. So. Take this review with the grain of salt that particular perspective offers. \n\nI would give it 2 stars on it's \"Club-lounge\" nights, and 5 on it's \"actual cocktail room\" nights.\n\nPros:\n- I always get amazing cocktails here, and the bartenders know their stuff. Order off the menu, or tell them what you like and ask them to suggest something, either way, you can't go wrong. They are made with love, and great, fresh ingredients. \n- On \"good\" nights, it's a great place to take an old friend who just flew into town, pull up a chair, and catch up over a cocktail (or four). It's quiet enough you can talk, loud enough you aren't overheard by the world, and the staff never gives you the \"GTFO\" stinkeye.\n- These cocktails are actually worth $14. The prices are really not that bad for damn good cocktails made out of fancy pants ingredients. It's not the sort of stuff you can say, make at home, without dropping at LEAST $150 on all the necessary bottles. Unless you're ordering a gin and tonic or something, and that just sort of makes you an idiot. Be adventurous and order something with chartreuse.\n- Atmosphere is cozy and mellow. Sort of like some rich old fella's study. Curl up in a chair with a smoky scotch drink and just say \"ahhhh.\"\n\nCons:\n - Realizing you came on random nightclub night. Oontz."
        }, 
        {
            "index": 121, 
            "rating": 5, 
            "review": "Delicious cocktails.  Chill environment.  Great service.  Clean venue.\n\nCame here on a Wednesday night after a friend came into town from LA.  The door is not that tricky to find if you have any common sense (if you don't, it will make for a funny sight for those inside).\n\nThe menu contains a list of great cocktails and beers.  I tried the Summer Sazzy and the girls had The Links.  Overall the drinks were a bit strong, but they tasted great! The bartender was very nice and showed passion in creating the drinks.\n\nThere was a live DJ playing super chill deep house (my favorite) which flowed perfectly with the environment.\n\nOverall this place gets 5 stars and I will for sure be going back again in the near future.\n\nCheers!"
        }, 
        {
            "index": 122, 
            "rating": 1, 
            "review": "if i wanted overpriced drinks/mediocre music/yuppie vibe, i'd go to the strip. i had heard good things from friends, but was pretty disappointed. the bartender was pretty nice, though."
        }, 
        {
            "index": 123, 
            "rating": 5, 
            "review": "So we went hopping around last night to our 2 favorite bars then went to the Downtown Cocktail Room. My girl loves this place and so did her friend that came with us, it was my first time and I must say quiet a nice time. It started off a lil slow as we waited a bit for our drinks, it was not busy and no clue why it took so long but they finally came and the waitress was very nice. She even let 2 of the drinks slide because even she knew it took a bit so that rocked. Then she brought us 3 lemon drops on the house again in a way to say sorry for the time it took... I am telling ya she really rocked it.\n\nMy girl had a \"Roasted Nuts\" it gets the name I think from of course the roasted nuts and honey around the edge of the glass, sweet and strong, very nice flavors.\n\nOur friend had a \"Wolf in Sheeps Clothing\" It was a great drink tasted a bit like coffee and was very nice...and strong. lol\n\nI had a Delirium Tremens Belgium Ale, ok so I'm going on a lil tangent here... omg this was like some kind of champagne ale or something, so sweet and bubbly, I think it's the best ale I ever had, and apparently after researching it today is one of the most highly regarded ales ever made. \"The golden color gives way to an ice-white head, with a complex aroma of citrus, banana and spice.\"\n\nOn a side note \"Delirium Tremens\" is a severe form of alcohol withdrawal that involves sudden and severe mental or neurological changes. -  LMAO too funny and a great name to give a ale.\n\nI also tried an Absinthe, which I have never had so I wanted to try it as they have several brands on the menu. It was a \"Le Tourment Vert\" 100º, from Brie-Sous-Archiac, France, which I had in the \"scorched\" style of preparation. It was not my cup of tea. Now as far as Absinthe goes my girl liked it and said for an Absinthe its really smooth. I am not downing the drink, I guess I just did not like the earthiness that it has, so I'll not be ordering Absinthe again, but I had to try it at least once in my life.\n\nAll in all it was a great time there and our waitress rocked so we tipped her like $30 and we will definitely keep going back there."
        }, 
        {
            "index": 124, 
            "rating": 5, 
            "review": "Downtown Cocktail Room is essentially a speakeasy bar. A speakeasy bar was a hidden bar that sold alcohol illegally during the US Prohibition period. Therefore, the entrance is hidden. Though, the Dj or security guard will get a laugh out of you trying to find the door and then show you where it is. Once you get in, everything is pretty dark but they have a small bar and comfy seating areas. \n\nUnlike many other bars and restaurants, they have a rotating menu. Their menu changes every season so it is always exciting to go back once a season to take a look at their new menu. On every menu, every drink that's crafted will have a number underneath it. That number represents how intricate the drink is -- kind of like the creativity level? \n\nNow, being under the category of a speakeasy bar .. it means that a  majority of the crafted drinks are gin or whiskey based. If you dislike these two types of liquors then you may not enjoy any of the drinks. However, I don't like either of those liquors and yet some of their crafted drinks are deliciously well mixed. Their drinks are also very creative -- some include a cookie, some with a cone, and some with cheese and crackers. Their drinks are not cheap compared to a lot of the bars on Fremont St. .. they run for $10 and above. \n\nWhat's even better? Their punch bowls! If your group doesn't mind getting the same drinks, just get a punch bowl. It ends up to be a better deal than getting your own drinks. \n\nAside from the crafted drinks, they have absinthe that could be prepared with three diff methods: the traditional, scorched, and the last method I forgot the name to but it makes it really sweet. They have little snacks, beers, and shots as well. \n\nIf you got friends in town or you and your friends just want a different atmosphere, give DCR a try. It's a pretty sweeeeet experience.\n\nThough, on the side note .. I really wished their bathrooms weren't so creepy."
        }, 
        {
            "index": 125, 
            "rating": 5, 
            "review": "Will always be my go to spot downtown. The seasonal menu is crafted with precision every time, and the staff are extremely knowledgeable. I have loved the lavender lover since it first appeared on a menu, and I appreciate they will still make it for me when I visit. The background music is nice and sets a great mood to any night!"
        }, 
        {
            "index": 126, 
            "rating": 4, 
            "review": "This place is a hidden gem located in downtown Las Vegas!  It's a hard spot to find, and even harder to figure out how to get in the door...\n\nThe DCR (as it's referred to by locals) features an ever evolving menu of expertly hand crafted cocktails.  The mixologists here the best in Vegas and they concoct recipes that later become popular in trendy places on the strip.\n\nThis place often has DJs and a hip crowd on the weekends, however my favorite time to come here is during the week when the regulars congregate around the bar and mixologists are working on their latest creations.\n\nI would recommend a drink or two, but by the time you read this, the menu will be completely different ;)"
        }, 
        {
            "index": 127, 
            "rating": 5, 
            "review": "This place is amazing! Very crafted cocktail that taste wonderful. They have a \"smash\" of whatever type of liquor you like with whatever fruit you like muddled into it with some triple sec for sweetness... I chose strawberries and lemon with vodka and it was so fresh and delicious!"
        }, 
        {
            "index": 128, 
            "rating": 5, 
            "review": "Good DJ and great drinks. They have their own creations which are great but also do the pre prohibition drinks. Great Ramos gin fizz. Fun to sit and watch people try to find door. Wonderful atmosphere and very nice wait staff."
        }, 
        {
            "index": 129, 
            "rating": 5, 
            "review": "Yum. Great cocktails. Not good. Great. If you ordered something out of your comfort zone, didn't love it, then gave this place 3 stars, you're a fool and your Yelp privileges should be suspended for six months. Truly a Vegas gem, take your foodie friends."
        }, 
        {
            "index": 130, 
            "rating": 5, 
            "review": "The music was awesome on Saturday 12/26!!  Nice job with the vibe, tunes, atmosphere, and drinks.  I strongly recommend this place.  Recommended to us by a local.  Fun nooks to chill with friends and catch up."
        }, 
        {
            "index": 131, 
            "rating": 5, 
            "review": "I love DCR! \n\nIt's a small bar on my favorite hangout spot, Fremont East. The door at the establishment is confusing. I will give you a hint. It's on the left hand side. \n\nDCR is composed of little tables and couches and a few booths. The music is house/techno, not my cup of tea, but it's not too annoying loud where you can't hold a conversation. The lighting is dim, but not too dark.\n\nWhat makes DCR so damn boss are the never ending rotation of seasonal cocktails. You can order your typical vodka-cran or beer, but what sets DCR apart are these complex, tasty beverages. I strongly believe that if you go to DCR and don't order a cocktail off their menu, you're not experiencing DCR!\n\nDCR is not pretentious, there's no typical patron. Vegas movers and shakers are spotted here (writers, CEOs, the mayor). The bar itself is small, but the place is classy, artsy, and vibrant, but without being \"in your face.\"\n\nDCR, you rock my socks and shoes!"
        }, 
        {
            "index": 132, 
            "rating": 5, 
            "review": "After hearing about this gem for many months, we finally had the chance to experience the Downtown Cocktail Room.  Unfortunately for me, going to the valet here helped me avoid the pitfall of walking in the front door (which I never would've found).  Sitting at the small table that immediately faces the front door, however, provided me a few hours of entertainment as I watched people feel around the glass, slam their knees into the concrete wall near the door or try in vain to pull the door open when it could just as easily have been pushed.\n\nThe libations were excellent with my companion enjoying a few mixed drinks that were masterfully created.  While only one of the two did she truly enjoy, it was still a pleasure to see a truly mixed drink created instead of simply poured.  I also had the pleasure of trying one of their new drinks: absinthe.  While the brands they now carry are not truly absinthe, the flavor and alcohol content are still there (Lucid is 126 proof).  You can have it traditionally poured or simply have a shot.  It's the same price ($15 for Lucid) either way, so have it traditionally done.  You'll never realize you've needed so many accessories to have a drink (spoon to pour water over sugar into absinthe, ice cubes and extra water to cool or tone down taste).\n\nThe atmosphere here is excellent.  It's laid back, unpretentious and cool.  The music and DJ were excellent...loud enough but not too loud to keep you from talking with your friends (or soon to be friends).  There are private rooms and areas throughout that we didn't even get to see.  In the main bar area, there is a large table that is cordoned off by a see-through mesh type of material which seemed like a great idea (kept the noise in/out, some privacy but allows others to venture in easily).  The waitresses were excellent with excellent ideas for a drink if you can't figure it out.  \n\nCheck the pictures already posted of this place, but better yet head downtown and enjoy it for yourself.  Drinks are a little pricey for my tastes, but sipping a glass of absinthe or something more to your liking with a good friend or group can keep the price down.  I'd rather spend $10 here on a good drink than $1 each for a crappy 1/10 ounce of tequila margarita at the Fremont Casino nearby."
        }, 
        {
            "index": 133, 
            "rating": 5, 
            "review": "I am in love with the Downtown Cocktail Room.  There is an ambiance here I've never found in Vegas or anywhere else.  This place is sexy, the drinks are works of art, these aren't bartenders, they're mixologists with voodoo. Something to keep in mind, it's quiet and intimate early but as the night goes on it gets loud and busy fast.   I'm impressed there's an absinthe menu, the regular menu is spectacular, and the staff is great at making suggestions based on a couple questions.  I got the starry night, and it was so good I wasn't sure where to go from there.  I was brought a lavender lover, which is now my favorite drink.  If I ever attempt to seduce someone, I'll start here."
        }, 
        {
            "index": 134, 
            "rating": 5, 
            "review": "Perfect drinks, perfect ambiance, perfect food. Maybe the coolest bathrooms in town."
        }, 
        {
            "index": 135, 
            "rating": 5, 
            "review": "Vegas is built upon offering visitors an experience -- much of which is over the top.  Subtly is rarely appreciated in a town where prostitutes are advertised on giant billboard trucks driving up and down the main drag.\n\nAs there must be an exception to every rule, in a town of excess someone must arise to sneak a little quiet class into the mix.  Enter the Downtown Cocktail Room.  The LA-style bar is hidden just off Fremont with a bolted entrance door that makes the place look boarded up (it has no handle and you have to push).  The bar is dark, with most of the tables lit by candlelight.  Curtains hang from the ceiling, separating the room into intimate areas where guests sit in comfy leather chairs.\n\nBut that's all atmosphere.  Even if this place wasn't mellow and intimate, the drinks would make it worthwhile.  The Downtown Cocktail Room is all about drinks as art.  Fresh ingredients and inventive flavors abound.  Martinis with ginger or papaya; several varieties of absinthe (and a staff knowledgeable enough to explain the absinthe ceremony); a good Manhattan and an entire menu of liquor art.  \n\nThe folks I went with usually drinks straight liquor, refraining from any sweet or poofy drinks, but the menu's cocktails were so inventive we indulged.  And the bar did an excellent job ensuring that the flavoring ingredients accented the liquor, rather than drowning it out.  5 stars for the Downtown Cocktail Room, which is one of the places I take visitors to town when I want them to have an quality experience. \n\nHappy hour is M-F from 4pm - 8pm (discounts on cocktails and beers)."
        }, 
        {
            "index": 136, 
            "rating": 3, 
            "review": "This place is hard to get in. I mean literally it's hard to get in. The windows are tinted and the door is a glass pane that you push in with no door handle. I literally was trying to find the door to get in. I bet the people were wondering who the heck is this crazy guy trying to get in like a rat trying to get out of a fish tank. I was pushing on every surface. Nobody from inside offered to open the door for me, but when I finally made it in we were seated promptly. The drinks were good in the sense that they were strong. The music was a good jazz feel and reminiscent of old Vegas cocktail bars. It's great to see a place that hasn't lost its old charm. Also, the hilarity of watching other people struggle to get in is also very entertaining. 3 stars for good stuff."
        }, 
        {
            "index": 137, 
            "rating": 3, 
            "review": "I can't give DCR a rave review, mostly because I don't think our visit was representative of the place as a whole.  After losing out on the Book of Mormon lottery at the Smith Center, we decided to go to the downtown area for Happy Hour.  It was Tuesday, so our options were limited, since a number of bars are dark Mondays and Tuesdays.  \n\nWe couldn't figure out how to get inside; DCR was dark and looked closed, but a waitress going in opened the door for us.  I learned later that it billed itself as a speakeasy, and I can understand why.\n\nInside is a comfy and attractive dark lounge that was nearly empty.  We sat at the surprisingly small bar, and the bartender, was very helpful, describing each drink on the menu.  Based on his description I ordered an Aqua Boogie and liked it.  Hubs had a beer.  \n\nWe were disappointed that they didn't have the kind of HH food menu that we're used to at other places, just a few items that they get from Uncle Joe's(?) pizza around the corner.  We had chicken fingers, which were very good, but they wouldn't have been our choice if it had been a real menu.  \n\nThe full impact - and I do mean impact - of the speakeasy vibe happened when we left:  I walked head first into the glass wall right next to the door.  I thought that glass wall was the door, but nooooo!  A waitress was very quick to bring me an ice pack for my aching forehead.  I'm writing this five days later, and still have a nasty and painful egg.  And I only had one drink!"
        }, 
        {
            "index": 138, 
            "rating": 5, 
            "review": "This place was fabulous. My friend decided it would be fun to watch the rest of our group try to find the door (which was an interesting ordeal). Once inside, we were all shocked to find such a chill place right on the edge of the Fremont Street insanity. Being a responsible designated driver, I asked for the best nonalcoholic drink they could whip up and was presented with an amazing mint/ginger/juice/seltzer blend that totally made up for the inability to intake any alcohol. One very generous patron sent us a round of shots that I was told were wonderful, and everyone else thoroughly enjoyed their drinks and the snacks. The music was the perfect volume, there was plenty of comfortable seating, and everyone else in the place was friendly. So glad I found this classy place downtown!"
        }, 
        {
            "index": 139, 
            "rating": 5, 
            "review": "This place is very unique.  The door is a nice touch and adds to its mysterious appeal.  I also personally love their bathroom sinks that are made of concrete.  The decor and vibe is unlike most of the city.  Their ever-changing menu is filled with drinks that you will never find elsewhere.  They also have a great variety of absinthe.  Everything is a little pricy but you pay for what you get :)."
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "Go with your gut and just push the strange metal panel to get in. DCR is a great spot to relax (we went for happy hour and so it wasn't busy) and the drinks were amazing. We had the watermelon cooler and their take on a classic Tom Collins.  The bartender was so great and the atmosphere was nice. My issue was the bathroom,  which was interesting when you first walk in, then a little scary once your in the stall trying to go. Just bring your phone. But I really enjoyed this place and would definitely go back if I wasnt just visiting Vegas. By boyfriend even tried the Absinthe which they prepared properly. I would recommend this place to anyone"
        }, 
        {
            "index": 141, 
            "rating": 5, 
            "review": "My friend and I were recommended to this place by the woman who runs the Burlesque Hall of Fame. I was so excited when we walked in, it was dark and gorgeous. I just wish I had been better dressed ha-ha. I had the Korbin Dallas which was beer based but surprisingly good even though I'm not a beer person. My friend had the Watermelon Cooler which tasted more like cucumber than watermelon but I enjoyed that. The bartender was really nice and checked in with us regularly. I can't wait to go back, next time in a little black dress."
        }, 
        {
            "index": 142, 
            "rating": 5, 
            "review": "I absolutely loved this place. Came here after a disappointing experience with at The Lady Silvia and it was perfect. Beautiful room. I hear it can get crowded, but it wasn't bad when my friends and I came and I appreciated that the background noise and music were soft enough to allow for conversation.\n\nPerhaps most importantly, the cocktails were fantastic and really creative. The four of us all ordered different things and all were 5-star interesting and 5-star good. The server was really nice, too. It apparently took a while to bring our drinks out. We didn't even notice or complain, but all of a sudden she appeared unprompted at our table to apologize for the delay and serve us a free drink on the house.\n\nSo far, this is definitely my favorite cocktail bar in Vegas."
        }, 
        {
            "index": 143, 
            "rating": 4, 
            "review": "This place doesn't disappoint. It feels exactly like a downtown cocktail room, with lipstick red walls, and mildly alarming abstract art. \n\nThe crowd is young drawn by the DJ spinning tunes.\n\nTry the Carciofo Swizzle - it is essentially a full fledged Italian dessert in a glass."
        }, 
        {
            "index": 144, 
            "rating": 5, 
            "review": "If you are looking for a chill place with great, stiff drinks and excellent service, you have to come to Downtown! Seriously, this place does not disappoint. \n\nI've been here a couple of times when visiting Vegas. Both times I've been here, we struggled with the door. Both times the bouncer was inside laughing and greeting us in. He seriously has the best attitude, so it really doesn't bother me looking like a fool for a few minutes. The drinks are absolutely worth it.\n\nAs soon as you walk in, you will notice the dim lighting and the loud, but not obnoxious, music. It's beautifully decorated and gives it a lot of character. There is plenty of room to sit both near to the DJ and in the back. There are sofas as well as booths with tables where you can kick back to enjoy your drink and have a conversation. \n\nWhen you approach the bar, the bartender will greet you even if he/she is busy. Anything you order will be awesome since they don't really hold back on the alcohol. For the quality of the drinks, they are very much reasonably priced.\n\nAnyhow, if you are looking for a classy, more tranquil ambience away from the craziness of Fremont, I absolutely recommend Downtown. It's mellow and a great experience when in good company."
        }, 
        {
            "index": 145, 
            "rating": 4, 
            "review": "I had never been to a bar by myself but I had an hour to kill between social engagements downtown and the idea of taking the edge off the day at a swanky bar was appealing. The place was basically empty when I rolled up at 4 PM, but even in it's sad empty state I was into the vibe here. The bartender working was adorable, sweet, and carried on just the right amount of conversation with me to make me feel welcome. Oh, and she was a badass bartender, too! \n\nI told her I wanted something fruity but not sweet. Not much fake syrups, added sweeteners, that sort of thing. She suggested the watermelon martini, light on the simple syrup. I hate most watermelon cocktails because they are green or hot pink and remind me of jolly ranchers and they use \"pucker\", but I trusted her and she delivered! The cocktail wasn't sweet at all, and was so fresh and summery and delicious. I followed up the watermelon with a blueberry cocktail. Also tasty, but  the watermelon cocktail was the best ! \n\nShe also offered me an \"earthy\" free shot of some kind. So complex, interesting, and tasty. Oh and I polished off an entire f-ing cheeseplate by my self while there. Oops (I literally think I downed 12 ounces of cheese in one sitting - my cheese addiction is scary!). The cheese and 2 cocktails came to $20ish during happy hour. Well worth it ! I will be back, but not sure if I'm ready to see this place on a happening night. The tasty well crafted cocktails pair nicely with a quiet relaxing evening in my book !!"
        }, 
        {
            "index": 146, 
            "rating": 5, 
            "review": "I went to the Downtown Cocktail Room for a friend's going away party.  The atmosphere is classy, cool, young professionals.  No annoying scenesters (that I noticed), no ghetto club types, just normal people wanting a cool place to take the edge off.  Another unique to Vegas plus is that there's no video poker machine staring you in the face at the bar.  The only minor complaint is the entry is far from obvious.  The door looks nothing like a door, rather part of the building.  If you don't discover where to push, you'll look like a tool.  But that's not enough to warrant a star loss.  Drinks are average for Vegas.  If I recall correctly, my Newcastle was 4 or 5 dollars.  The place doesn't look too big from the outside, but inside it's spacious.  There's plenty of tables and booths to sit with friends.  There's also places if you just want to stand around by the bar.  The seating area wraps around to the back.  It's really a good spot."
        }, 
        {
            "index": 147, 
            "rating": 4, 
            "review": "Walked into this place for the first time on a Friday night around 8.  Given the location I was a bit skeptical at first.  Very intimate spot, dim lighting, nice decor, solid music (just the right volume) ideal spot for a 1st or 2nd date.  \n\nWaitress did a great job explaining the menu and how they have different hand crafted cocktails seasonally.  This is not the place you go to order a regular run of the mill drink, it would almost be an insult.  \n\nService did start to lack after a few more of our friends showed up, but all & all a good place to start off downtown."
        }, 
        {
            "index": 148, 
            "rating": 4, 
            "review": "Leine's for $5, great deep house & a hella chill environment to kick it & drink. A little chilli though lol"
        }, 
        {
            "index": 149, 
            "rating": 5, 
            "review": "I love their menu ideas! I didn't believe my boyfriend when he told me that their drink menu changes every couple of months until a bartender confirmed it by clarifying that their menu changes with the season (ex. Watermelon Cooler for the summer). \nIf you don't exactly want anything off their menu, just give the bartender an idea, and they'll totally try to accommodate your craving profile. I remember going with the boyfriend 2 nights ago, and he said he wanted something spicy with an orange flavor, and the bartender delivered the goods. Geez Louise... It was certainly a spicy number - I literally felt it burn going down my throat and was only able to tone it down with my drink (Feathered Serpent). \nAs for their customer service, the servers who just usually happen to be ladies, are always nice and knowledgeable. The bartenders are just as knowledgeable, nice and social, and naturally more so when you get to sit at the bar. \nConsidering the setting, it's a small space and dim to add to the casual atmosphere, yet I've never seen this place crowded. \nOh yeah... Good luck finding their door and using their restroom if you're feeling adventurous!"
        }, 
        {
            "index": 150, 
            "rating": 5, 
            "review": "Best drink spot in town...super chill!!!"
        }, 
        {
            "index": 151, 
            "rating": 5, 
            "review": "Great Ambiance in here. The prices arent bad, and they serve absinthe. People of all walks come in here, and really isnt a dress code besides no hats. Music is playing but you can still talk to the people in your party. If this place was back in the 70's im sure coke would be on the table in lines. LOL just saying."
        }, 
        {
            "index": 152, 
            "rating": 5, 
            "review": "What a great bar! Nice speakeasy feel and Crystal can make a mean drink!"
        }, 
        {
            "index": 153, 
            "rating": 4, 
            "review": "DCR has slowly gotten back in my rotation. It's a good place to chill when it isn't First Friday. Really, I should avoid all my haunts on First Friday because I'll just be crowded and rushed. \n\nWith tasty drinks meant to be appreciated and with the nice dark, quiet, comfy room it encourages to stay sip and listen to house music. It's a sexy space, great for a date night but also still good for group. I've been taking some visitors to Fremont East to understand what local culture is like and all have been very impressed. \n\nMy favorite drink out of recent menus is the Sage Advice. This alone will have me returning until the menu changes again and I fall in love with another beverage."
        }, 
        {
            "index": 154, 
            "rating": 4, 
            "review": "Dark, smoky and stiff. \n\nThere's one thing that DTLV has in spades and that's great cocktail bars, the more the merrier if you ask me. Downtown Cocktail Room celebrates this many times over with multiple cocktails for any palate. \n\nMy most recent trip here had me sampling the, \"Batship Crazy\" and the \"Button Popper\", both great drinks and handmade to order. The Button Popper was the favorite of the two drinks; this whiskey-based cocktail had all of my favorite flavors all wrapped up in one glass espresso, pecan and rye whiskey. Just like the menu states this drink would be great with dessert, slightly bitter from the espresso, but balanced with pecan liqueur and rye whiskey. \n\nThe Batship Crazy was just that, cray. This is rum based cocktail; with Batavia being the rum flavored addition had a funky flavor almost like a bland version of Fernet. This was drink was still good, just not a favorite. \n\nI really love the look and vibe of this place dimly light and for the most part a very mellow hang, but I hate that they allow people to smoke in here. Come here on a packed Saturday night and you'll be walking into a fart cloud of nicotine."
        }, 
        {
            "index": 155, 
            "rating": 4, 
            "review": "Dimmer than a midnight vigil, this cocktail room is swanky, posh, relaxed as a reclined armchair. Plush seats and simple tables sink into the premises like olives in a martini glass. This is by no means a location to slosh around frothy brews in your mouth while lassoing women with your Popeye-like forearms. Downtown Cocktail Room is all about decor, reserve, gently clinking glasses together in cheer while massaging the knot of your necktie. There are rules here that state, in so many words, that they don't want you to swivel in your seat and pinball your egregiousness around the room like a Gremlin in heat. \n\nNot to say you cant have fun. Rolling a comb through your mane and getting gussied up doesn't mean your voice has to be siphoned from your larynx. I came here with a group of friends, ordered one of Downtown Cocktail Room's signature punch bowls that was stoned with ice cubes and wedges of oranges, and put a lofty buzz into my brain. This little minx of a spot makes everything from traditional cocktails that have been around so long they've seen the fingerprints of dapper people such as Cary Grant, to artisan, neo-cocktails that have some serious bite of their own.\n\nWhen you want a break from getting your arm hair scorched by Treasure Island pirate ships, the bullhorn of an alpha male that is trying to leg sweep a random girl, or seven-hundred dollar beer on the strip, DCR is a rad time."
        }, 
        {
            "index": 156, 
            "rating": 5, 
            "review": "This place is the spot! i love the ambiance, music, bartenders, and the overall hole in the wall feel of the place. It is tucked away in the DTLV scene which means that I can tell many folks in the area probably like it that way.\n\nThe music is purely down tempo/house which is my cup of tea...or bourbon. =]\n\nI will definitely keep coming back as a new LV resident."
        }, 
        {
            "index": 157, 
            "rating": 3, 
            "review": "Whoa!  I am definitely not cool enough to hang out here.  \n\nFirst of all, it took me 10 minutes groping around to figure out how to get in the door.  I was trying to muster up some clever hipster jargon in case there was a password required.  Note: the entry is a pitch black semi creepy vestibule and the ginormous metal section on the left with no discernable handle or moving parts is the door.  \n\nThere is lots of seating but this joint was packed on our visit (10:00 on a Tuesday? - go figure).  So, we ended up trying to stay out of the way but got jossled back and forth by passers by.  \n\nThere was an excellent band playing.  They were super good, entertaining and talented.  \n\nBartender was nice, and personable.  He took his time and made our drinks with love.\n\nHubby got a gin martini.  $13.  Yikes!  Guess this place doesn't conform to downtown pricing.  \n\nI did notice they offer some cool eclectic cocktails and absinthe drinks and such.  They are following suit with the trend for legit bars and they have homemade bitters.\n\nIf you are into good live music, expensive fancy drinks, and hipsters...this is the place for you!"
        }, 
        {
            "index": 158, 
            "rating": 5, 
            "review": "Awesome spot downtown to get some specialty drinks. The mood inside this place is amazing. Call it romantic, sophisticated, sexy, chill, inviting, soothing...or whatever you want. You won't know you're in Las Vegas. This is my first time here and I can't wait to go again. My new favorite spot."
        }, 
        {
            "index": 159, 
            "rating": 5, 
            "review": "Great chill space to relax and get some cocktails.  Darkly lit but welcoming, comfortable chairs to spend some quality time with your people, upscale but totally relaxed, and one of the most diverse lists of cocktails I've seen.  Will transport you out of the cheesy Vegas and into the cool of Vegas."
        }, 
        {
            "index": 160, 
            "rating": 5, 
            "review": "Where to even begin.... I am a local, and have been coming to DCR regularly with my boyfriend ever since he introduced me to the place several months ago. Drinks are always gorgeous and tasty - not to mention incredibly unique! The atmosphere and music at DCR is perfect - laid back to where you can still have a conversation with friends,but so fun and upbeat. Everyone here is so incredibly nice and make sure to go above and beyond to make sure you're happy.\n\nA few months ago when it was time to start planning a surprise party for my boyfriend, I immediately knew this was our place. I put in a request to see what it would cost, and was thrilled to see a more than reasonable quote for a 2 hour open bar reserved in the private back area. We had the party there last Friday night, and talk about accommodating - DCR let me come in an hour before they even opened to drop off the custom cake and set up decorations... and were an absolute pleasure to deal with from start to finish (as always). Special thanks to our awesome waitress, Mona, for being there for us throughout the event. I can tell you that this place was already my boyfriend's favorite spot, and now even MORE so!\n\nWe also owe endless thanks to Kevin for making sure that we're taken care of every time we're at DCR! He's truly one of the absolute nicest people I've ever met, and we know we're in good hands anytime we see him. He has made me some of the most delicious drinks, and is always so much fun to chat with.\n\nSeriously, these guys are the absolute BEST - and we will see you again soon, DCR!"
        }, 
        {
            "index": 161, 
            "rating": 1, 
            "review": "The bathroom stalls are supposed to be two way mirrors, allowing the people washing their hands (or not) to only see their reflection while the people in the stalls can see out clearly. The lighting is obviously messed up because you can completely see the people using the stalls. Nice ass shot of a girl puking during April's First Friday. We left right away."
        }, 
        {
            "index": 162, 
            "rating": 2, 
            "review": "Been going here for years and have experienced service that's gone from bad to worse to unbearable. I'm so done with this place. Craft cocktails are creative and original but NOT worth the 15-20 minute wait even when it's not crowded. I will not be back."
        }, 
        {
            "index": 163, 
            "rating": 5, 
            "review": "Love coming here, wish Vegas had more bars/lounges like this.  They have a unique cocktail menu and change it seasonally!   Love the music (downtempo trip hop) and the semiprivate booths are always fun to be in."
        }, 
        {
            "index": 164, 
            "rating": 5, 
            "review": "A superb oasis of calm in downtown Vegas. I don't know if it gets wild later or on weekends, but at 5-8pm on a Thursday night, the crowd was small and serene (and nobody was smoking!) and the music volume was pleasantly low. So nice not having to yell at a bar.\n\nThe cocktails here are adventurous, and it's cute that the menu provides a little guide as to how complex each drink is. Going off the new summer menu, I had the My Cousin Vinnie, a nutty(!) drink using Aquavit (or, rather, home-infused \"Vodkavit\") and pistachios. It was unlike anything I'd had before, and it was delicious. Followed it up with a Mezcal-agave drink (forget the name) which was good, but was made by a new bartender, so it wasn't as good as the one my wife had earlier that evening, made by the head bartender.\n\nService is friendly and prompt, and prices are amazing (most drinks around $10, brought down to $8 during the 4pm-8pm happy hour). Very generous for such strong, top-quality cocktails."
        }, 
        {
            "index": 165, 
            "rating": 5, 
            "review": "Where in Vegas can the beautiful soulful, deep house heads seek refuge? \n\nLook no further than Cocktail Room. Man, this place is one of my favorite lounges. Its classy, dark, sleek, romantic but unpretentious. I enjoy taking people here that aren't familiar with what East Fremont has to offer as they typically have those preconceptions of being run-down and dilapidated. At DCR you'll find creative seasonal cocktails and a fairly diverse crowd. While there really is no dance floor to practice your latest house dance moves, on busier nights impromptu mini-dance floors may appear as the night progresses and DCR's strong drinks begin to take effect.\n\nHead towards the right side of the bar and you'll find some semi-private, plush little booths with these dope chandeliers -- for those more cozy, intimate rendezvous ahem*wink*wink*nudge*nudge* The last time I visited it was a windly, cold and wet Thursday which I'm sure scared people off and there was no DJ. Typically Fridays and the weekends are definitely the best times to visit. Good luck finding a seat during summertime tho. And if its First Friday then fuggetaaboutit. One small knock -- service can be lax at times and its lack of light may make it hard for the waitress to see, but no excuses from me. Still, its a great place to kick it and hang out.\n\nDCR was listed as one of Food & Wine's \"50 Best Bars in America\" list. \nhttp://www.foodandwine.com/slideshows/americas-best-bars"
        }, 
        {
            "index": 166, 
            "rating": 5, 
            "review": "My favorite hideaway on east Fremont. It's a great place to relax, once you find the door. Depending on your mood, it's a good spot to begin the night or end it. The craft cocktails are delicious and the staff is knowledgeable. A seasonal menu keeps me coming back. It is dark inside, so watch where you step."
        }, 
        {
            "index": 167, 
            "rating": 5, 
            "review": "@DowntownLV bitters & syrups are made in house :-)  \n\nWaitstaff that is extremely knowledgeable about the cocktails :-)\n\nFeatured cocktails that are unique and interesting with often surprising and sublime characteristics :-)\n\nDark and intimate atmosphere befitting a cocktail lounge :-)\n\nDrunk girl passed out in the bathroom...it is Vegas after all :-/\n\nThe Downtown Cocktail Room @FremontBars is a real gem."
        }, 
        {
            "index": 168, 
            "rating": 5, 
            "review": "One of the coolest spots in all Las Vegas. It is such a contrast from the neon signs and loud barkers on Fremont and the strip. With a small sign and hidden door, meeting someone who has never been there will be an issue, but it is definitely worth the trouble. Candle little tables, knowledgeable bartenders, and vintage speakeasy vibe make this place a one of a kind spot."
        }, 
        {
            "index": 169, 
            "rating": 4, 
            "review": "The ambiance, decor, seating, customer base are all very cool. You can work here with a laptop, have interesting conversations with people, or get together for drinks with personal or business friends! \n\nThe service was a little slow, but the cocktails, when they did finally come out, we're strong and tasty! Their happy hour runs from 4-8pm and cocktails for $7 was a good price! Their 2 for $5 munchies were pretty good - pretzels and honey sesame cashews are the 2 we tried!"
        }, 
        {
            "index": 170, 
            "rating": 5, 
            "review": "Went for an event \"creatives & cocktails\" first the bouncer was such a joy, friendly, helpful and just made my night. Second the bar is small, but cool. Reminds me of a cool Los Angeles hip dive. Everyone was friendly and prompt, will come back."
        }, 
        {
            "index": 171, 
            "rating": 4, 
            "review": "A cool lounge in downtown Vegas.  The bartender made me a great negroni.  Good conversation at the bar with techno geeks and hipsters."
        }, 
        {
            "index": 172, 
            "rating": 5, 
            "review": "went on a Monday night 6-16-10. Was greeted by a friendly and helpful hostess. She introduced my group of 4 to Downtown's signature drinks made by the in house mixologists. The drinks were fresh, tasty and worth the ($9 to $10) each. The drinks were unique, definitely one of a kind."
        }, 
        {
            "index": 173, 
            "rating": 5, 
            "review": "There are craft cocktail bars and then there are those that truly make it a craft.\n\nYes, the Downtown Cocktail Room can make the classics and they have their own unique creations but the real magic happens in the fact that they make all of the bitters. The bartenders work as a team so that nothing is just somebody's pet project but everything is vetted to perfection. And it shows.\n\nThis place embodies downtown Las Vegas. Outside, you'd swear it was an abandoned building and you're not entirely sure why the city doesn't do something about this block. Inside, you're treated to a simply decorated bar that insulates your from the outside in every way and takes you back in time."
        }, 
        {
            "index": 174, 
            "rating": 5, 
            "review": "This is an awesome gem of a place around Freemont Street! The outside of the place is brick and the entry door is hidden, so you may not recognize it with all the lights and noise of downtown. \n\nOnce you're inside, it's lightly dimmed and chill definitely a place to escape from the craziness of Vegas.\n\nThe bartender was amazing, he was super attentive and an expert in giving us information on the drinks. I had the watermelon cooler which was delicious! Don't be scared about the ingredients, they have a way of putting together a mixture of flavors and making it amazing.\n\nIf you're tough enough try the punch bowl."
        }, 
        {
            "index": 175, 
            "rating": 5, 
            "review": "Heard about this little bar from a friend. Since I was in Vegas I had to check it out. \n\nWalked in and....\n\nI LIKE this place. Dark......dj playing the triphop....good drinks...ambiance was wayyy chill, curtains everywhere. I was only here for about an hour.....but this is MY kind of place."
        }, 
        {
            "index": 176, 
            "rating": 5, 
            "review": "I love this place! They have an awsome hand crafted drink menu, which changes with the season. The drinks are very unique, and they also make unique ingredients, like herb infused bar syrup. The bar tenders are dressed in vests which is very classy. The service is excellent!"
        }, 
        {
            "index": 177, 
            "rating": 5, 
            "review": "Why harp about what is already a legit mixology spot? There's an order to drinking madness! You start with a good meal (or adequate as the case of this night at Therapy---go for the dates and tuna tartare) and progress to a watering hole that has been good to you in the past. In my case, two previous occasions. Arriving at 8:20, only nerds and old farts are struggling with the entrance. It's the wooden door on your left, push it. Management must not put a helping hand sign because it amuses the wait staff to see potential patrons miming the glass. \n\nWe had the lounge chairs to ourselves. The back room, behind a red curtain is redolent of some Wizard of Oz shit. There's booths and more tables where one can get lost with party in tow. Right. To the real part. This bar doesn't serve food. It's speciality booze. We had the My Cousin Vinnie, the lamb leg-cured mezcal sipping shot, before the spin surprise, a free cocktail tasting of lemon-honey cough drops. Interesting and so cool the bartender wants to play with able bodied palettes. Then came a round of what we would call the Ham & Cheese BBQ drink and a Suzie something with more mezcal for me. By this time, I'm sloshed and tell our lovely waitress it's the punch at the end of a party. She looks at me with that expression of \"Oh, do you amuse yourself?\" But the party of bachelors starting their evening paid for this round because we willingly moved to other chairs so they could sit together. Very classy move. Thank god my love can metabolize like a true Italian. We made kissy faces and departed, wishing the DJ happy shuffling. \n\nIt's always a good time with red velvet drapes."
        }, 
        {
            "index": 178, 
            "rating": 3, 
            "review": "There are a lot of things I appreciate about this place.\n\n1.  It exists in Las Vegas.  Thank goodness and why didn't I know about it before now?\n2.  Our server was so sweet, attentive and patient with our group of too many (14).\n3.  They use fresh ingredients.  It was obvious that the fruit in the drinks was fresh.  After reading some of the drink descriptions, I was afraid that they would be too sweet.  Not so at all.\n4.  Our entire group drank for three hours for around $400 and not during happy hour.  I didn't know that was possible.  OK, some of our group were drinking beer but still.\n5.  The bathrooms are awesome.\n6.  They have punch service.\n7.  The house music was just the right volume.\n8.  The place was not too crowded on a Friday night, it was just right.\n9.  It's a really cool place to hang out.\n\nUltimately, I never wanted to go there with a group.  I wanted to go and sit at the bar and not have to deal with a bunch of people.  I love talking to bartenders, not in a creepy way but so that I can hear all about what they're working on and what they have planned for the next great drink.  The good part about going with a group, though, is that you can try lots of different cocktails.\n\nI got to try both punches, the Orthodox Caveman, Japanese Cocktail, Hemingway Daiquiri, Downtown Cider, Pumpkin Spice, Rufus Xavier Sarsaparilla, Funky Pear Medina, and the Grande Absente Traditional Absinthe Service.\n\nOverall, I didn't feel like the cocktails were all that well balanced.  As I mentioned before, I noticed that the fruit was fresh in all of the cocktails.  Perhaps the tartness of the citrus impacted the drinks.  I'm not sure but they all seemed very heavy on the citrus.  The Daiquiri in particular had an overwhelming amount of lime.  Taking note of this, I asked the bartender to go easy on the lime in the Japanese Cocktail and it was perfect.\n\nThe Orthodox Caveman was interesting.  I wasn't sure how they were going to make cachaca and scotch go together but it worked.  It was a little heavy on the scotch, though.  We really liked the Sarsaparilla and I liked the fact that they offer a variety of absinthe and styles of service.  I was a little bummed that they don't bring the fountain to your table.  Another good reason to sit at the bar.\n\nI'm really glad that I found this place.  Spending over two months out of the year in Vegas for work can really suck when you're stuck on the strip.  I can't wait to come back and try some more cocktails...and hopefully check out happy hour!"
        }, 
        {
            "index": 179, 
            "rating": 3, 
            "review": "Great vibe.  They had some really weird drinks on the menu, but that was what they were going for.  A decent amount of comfy couches and chairs.  The bathrooms are pretty cool too."
        }, 
        {
            "index": 180, 
            "rating": 5, 
            "review": "I've gone to the Downtown Cocktail Room twice now and part of what makes me enjoy my time there is how sociable and knowledgeable the bartenders are here. Since they aren't stuck serving the same drinks as every other place, they definitely put a lot of pride in what they make.\n\nNow the prices here are certainly higher than some dive bar, but they're also pretty reasonable for a specialty drink. They use some interesting flavor extracts as well as more exotic ingredients (jamica??) to both compose and accompany the drinks. Additionally, the place itself has an interesting vibe to it that you don't get in a lot of other places.\n\nCome here for the drinks though. I can't even begin to describe the list, and it changes seasonally anyways."
        }, 
        {
            "index": 181, 
            "rating": 4, 
            "review": "Love the atmosphere, a true hidden gem.  Not too crowded & comfortable sitting with a relaxed ambience.  Bartenders are hit or miss...  Some of them really know there mixology & some not so much."
        }, 
        {
            "index": 182, 
            "rating": 5, 
            "review": "Love this spot every damn day of the week! House music everyday. Whiskey cocktails everyday. Mona always looking beautiful - but she's not there everyday. Go to DT cocktail room - everyday!"
        }, 
        {
            "index": 183, 
            "rating": 4, 
            "review": "Tip: There's no door handles, just push on the brown or bronze door on the left.\nVery cool and sleek design out side  and continues throughout the bar.  The lights are set very low and has a comfortable and lounge type atmosphere. I was here on a week day and it was quite and relaxing. My type of place. I hear on the weekends that it get packed.\nYou can choose from their specialty drink menu our have the mixologist \ncreate a cocktail based on your preferences.  Great service, nice atmosphere and quality cocktail. Your specialty cocktails are gonna run you at about $9. I've been to other mixology bars that have charged me $15 +."
        }, 
        {
            "index": 184, 
            "rating": 5, 
            "review": "Undoubtedly my favorite vibe in LV. A great room that's immediately welcoming. The sound system is wonderfully conducive to both dancing and conversation. Interesting people, nice art, great drinks. If you can figure out how to enter the place the rest is easy!\nWhen in doubt, go Downtown...cocktail room, that is."
        }, 
        {
            "index": 185, 
            "rating": 5, 
            "review": "Awesome little bar leading the Downtown Las Vegas revolution.\n\nThe owners helped convince Zappos CEO Tony Hsieh that Downtown was a neighborhood worth revitalizing (no doubt with the help of their excellent and strong cocktails), and they've been pioneers in opening distinct small businesses in the area. The place has a hidden entrance, but once you find it you'll be pleased by the chilled out ambiance and  excellent drinks they pour. An awesome spot that's become a go-to watering hole for Downtown's growing population of young and cool residents."
        }, 
        {
            "index": 186, 
            "rating": 4, 
            "review": "Drinks are incredible and well made.  \nbartenders are friendly.\nNot the best downtown spot but definitely a nice place to start Friday after work."
        }, 
        {
            "index": 187, 
            "rating": 5, 
            "review": "Best cocktail bar in Las Vegas.  If you didn't know it was there you'd miss it.  It's right on Fremont but off to the side in an unassuming, lightless area.  We walk in and immediately jump to the bar and talk to the bartenders.  They say the menu has been finely tuned so you should order off of it, but I always enjoy ordering off the menu and giving the bartender a chance to shine.  We had two whiskey-based concoctions and two absinthe-based concoctions.  All we asked for was the base, maybe a flavor or two, and a sweetness factor.  They came back with delicious offerings each and every time.  The bartenders also were very talkative and nice even with a full crowd ordering drinks.  \n\nThis is the best cocktail bar downtown by far.  Herbs & Rye and Oak & Ivy are other solid offerings in town for a quality cocktail, but I think Downtown is my new must stop for the best drink in Vegas.  The prices were around $10-12 per drink which is very reasonable for a drink of this type, so in total nothing bad to say about this place.  I highly recommend."
        }, 
        {
            "index": 188, 
            "rating": 5, 
            "review": "This place is an ultra cool cocktail lounge and serves the best cocktails around.  They are seasonally changing the menu so we go there every few months to try the new concoctions and they are always delicious and well thought out.  They make there drinks out of all kind of different made in house ingredients like black pepper syrup or rose water and they always use fresh juices and fruit.  I wish I could remember all the drinks I have had but they are so complicated and over the top it is hard to exactly remember but they have all been interesting and tasty.  The only down fall is that it is a little pricey, about 10-12 bucks a pop but you get what you pay for. They do have a happy hour when they are only 7 bucks. \n\nThe decor is ultra hip if thats your thing and they usually play some \"techno\" type music thats fits the atmosphere but it isn't super loud so people can still kick back and talk.  \n\nThey also have a selection of absinth if you like that stuff.\n\nAlso check out their bathroom stalls, they are crazy, thats all I will say."
        }, 
        {
            "index": 189, 
            "rating": 5, 
            "review": "One of my favorite places to grab and drink and hang out with friends. Drinks are awesome! Very well made, staff is friendly and somewhat knowledge depending on the server, but the bartenders are always on par and make up for knowledge of drinks where the servers lack so it balances it out nicely. Prices are awesome, especially for being in the heart of downtown. Great little hidden gem of Las Vegas!"
        }, 
        {
            "index": 190, 
            "rating": 5, 
            "review": "This is hands down one of the best bars in Vegas! I was in the mood for an interesting cocktail and Downtown Cocktail Room delivered! Super friendly service! We got there at 8pm on a Tuesday night and practically had the whole place to ourselves. I couldn't believe how cheap the drinks were! I'm so happy to know i can get a real cocktail somewhere in Las Vegas that wont break the bank..I cant wait to take more of my friends here!"
        }, 
        {
            "index": 191, 
            "rating": 5, 
            "review": "Another great craft cocktail lounge in Vegas.\nGreat drinks, cool atmosphere, and the bartenders are awesome.\nIt should be on your must do list in LV"
        }, 
        {
            "index": 192, 
            "rating": 4, 
            "review": "Oh DCR ...how I have loved thee.\n\nFriday's are my night to drop into DCR for a Dark n' Stormy and some good electronic music. I usually arrive around midnight and get there when Dj Carlos Sanchez is on - spinning house music and breaks .. among other styles. There's usually a live percussion performance along side the EDM playing and the seats are comfy and the dance floor sufficient. \n\nGive it a stop in when your downtown some night ! The door is on the left ..."
        }, 
        {
            "index": 193, 
            "rating": 5, 
            "review": "My fav in Vegas. DTLV is having a MAJOR make over. look out people!! Check out Downtown3rd.com"
        }, 
        {
            "index": 194, 
            "rating": 5, 
            "review": "Hands down, my favorite bar in Vegas. The bartenders really know how to make a good cocktail. \n\nThey have seasonal menus which feature Classic cocktails as well as DCR originals. They usually have something for every palate, from sweet to spicy to bitter to \"does this taste like campfire and graham crackers to you?\" The bartenders will even throw something together on a whim. \n\nThe ambiance and music is pretty low key and it's a great spot for a date or just a nice quiet evening out. The front door is sometimes a little hard to find and the bathrooms are a bit interesting but that all adds to the allure of the place."
        }, 
        {
            "index": 195, 
            "rating": 5, 
            "review": "Aside from just hanging out every now and then for a drink and great atmosphere, I have hosted two events here - one for friends and one for business associates and was pleased with both.  The staff is friendly, easy going and helpful.  The drinks are fantastic and worth the price.  I could keep typing but that would waste your time - just get there yourself and check it out - you'll be hooked."
        }, 
        {
            "index": 196, 
            "rating": 5, 
            "review": "Great, chill find in the heart of Downtown Vegas. \n\nOur bartender was awesome, very knowledgable and willing to explain anything we didn't understand. They make their own cherries and various syrups, so everything is fresh and tasty. High quality ingredients makes for high quality cocktails.\n\nWe were there for 3 hours and tried just about everything on the menu. The drinks were really creative and delicious! No complaints on that front. We got there early enough that the bartender kept the happy hour prices going well past the end, so our 9 drinks + food + a generous tip came in under $100.\n\nA wonderful surprise in that city of over-priced tourist traps."
        }, 
        {
            "index": 197, 
            "rating": 5, 
            "review": "Imagine this:  a group of very scholarly (said with tongue in cheek) graduate students decide to unwind after our last class on Thursday evening.  We leave the lovely 5th Street Campus in downtown Las Vegas and begin walking excitedly toward a destination where we will imbibe on alcohol-infused concoctions.  Imagine our dismay when we find the closest establishment is shut down, the 2nd establishment isn't even a bar (we all swear that small neon sign in the window looked like a beer label), and the third is closed.  As we stood there laughing at how eight very bright scholars (again, tongue in cheek) can't figure out how to find a bar, someone suggested Downtown Cocktail Room.  Yes!\n\nWe arrived and the two of us who've been there before enjoyed watching the others try to figure out how to get inside.  Our need for an alcohol-infused libation overcame our slightly evil enjoyment of watching \"Where's the door?\" and we finally went inside.  Nirvana (but with an acute awareness of the modern surroundings of dark leather chairs and espresso tables)!\n\nI figured I would enjoy the same delicious beverage I'd had before (some kind of martini with fresh sage & black pepper), but on the menu it was not to be found.  You see, although they do have some standard drinks that remain on the menu, the real gems are the creative concoctions they create using fresh, seasonal ingredients.  They are even so kind as to provide a guide as to the approachability of said drinks (I mistakenly thought the numbers represented the strength of alcohol in each drink).\n\nPow!  Bam!  This perfectly described the very pretty & very fun & very aptly named luscious libation - Onomatopoeia.  A fresh raspberry was perched atop a champagne glass filled with dark cheery, cherry goodness.  Pop the berry in your mouth and it popped right back!  It's true!  There were pop rocks on the berry!  The fresh fruit muddled in the remaining liquid love was, well, fresh.\n\nWe all enjoyed a variety of flavored cashews, tasty pretzels, and olives (two choices for $5).  The chili infused were spicy, spicy goodness!\n\nLove this place and look forward to another visit sometime soon.  Cheers!"
        }, 
        {
            "index": 198, 
            "rating": 4, 
            "review": "The service seemed a little slow given the fact that they were not very busy when we were there. The original cocktails are very creative and very tasty. We were disappointed that they no longer have the happy hour food menu that is advertised on their website. Maybe someone should update that!"
        }, 
        {
            "index": 199, 
            "rating": 5, 
            "review": "To clear up any confusion, this place makes COCKTAILS.  Like a chef gets credit for being a chef, a bartender earns equal merit for making exceptional drinks.  They even have COCKTAIL ICE CUBES.  If you have to ask why this would make a difference you probabaly belong in that crap-hole Hennessey's across the street or you should be walking up and down Fremont Street with \"one them big-ass beers\" in a football mug."
        }, 
        {
            "index": 200, 
            "rating": 3, 
            "review": "Stopped by last night after the First Friday UYE with the Yelp-izzles.\n\nI ordered a Watermelon Cooler, Wasabi Peas, and Cashews. Everything was good.\n\nWe all stopped ordering drinks after the first round because we wanted to go eat. It took us a while to decide and I think our server was getting a little mad that we were not ordering drinks. She must have asked us 20 times in 30 mins if we needed more drinks."
        }, 
        {
            "index": 201, 
            "rating": 4, 
            "review": "I have always enjoyed going to this place to have a few drinks and amuse myself with people trying to find the door. \n\nIt is usually not too packed and I can find a seat here and enjoy the chill atmosphere. The bathroom stall doors always freak me out as they are one way mirror style. This place is always getting me with that!\n\nIf you are into cocktails, especially if absinthe is your gig, this is a great place to go. I have always had really great service here as well."
        }, 
        {
            "index": 202, 
            "rating": 3, 
            "review": "We finally tried DCR last week for the first time and had a decent experience. It was a weeknight and not very crowded, with a quiet yet cool vibe. I know that between my husband and I, we tried four cocktails including the Pumpkin Spice, Rufus Xavier Sarsaparilla and Don't Fig With Me but I cannot remember the fourth. I swear there was something with chocolate bitters but it's not in anything we ordered according to the online menu.\n\nThe Pumpkin Spice was a bit heavy on the bourbon; there was a nice pumpkin flavor underneath but the liquor overpowered it. I think I preferred the Sarsaparilla, which had a surprisingly complex flavor yet wasn't too sweet at all. I finished off with the FIg which was VERY sweet, as you would expect from figs- maybe too much for my taste, but very autumnal.\n\nService was a little slow, but friendly. I found the drinks fairly priced for what they are- complicated and strong- but none of them would be a repeat for me; if we go back, I'll try something else next time."
        }, 
        {
            "index": 203, 
            "rating": 4, 
            "review": "Interesting place.  Very dark and quiet.  If you haven't been there before, you'll have a bit of trouble finding the place...and the entrance.  It's located on Las Vegas Blvd., right before Fremont.  The entrance door is actually a big wooden door surrounded by glass,  it is very deceiving.  And it is hilarious to be sitting in the bar and watching people try and find the door.  It's like a mime act.\n\nGreat place to meet with business partners to discuss matters, or to take a date if you want soft music and a quiet place.  Drinks are a little pricey, that is the only thing keeping this place from receiving 5 stars."
        }, 
        {
            "index": 204, 
            "rating": 1, 
            "review": "I've been going to this place off and on since it opened.  It used to be one of the few nice bars downtown and I work downtown at a law firm.  I went there last weekend and gave the bartender my debit card to run a tab.  An hour later I paid and left.  Two days later my debit card was fraudulently used and my checking account drained.  I didn't use my debit card anywhere else all weekend and I don't use it online.  The bank said it probably happened there.  When I let the owner know he said he had never heard of this happening and said he'd research it.  He emailed me back and said \"it's pretty simple, you paid the bartender and your card was given back to you.  does this sound accurate?  I said I'm just letting you know what happened, next time you might want to just say thanks we'll look into it.  Then he responds with \"thanks, we'll look into it."
        }, 
        {
            "index": 205, 
            "rating": 4, 
            "review": "This place needs blankets, it's November and they don't have a heater! The vodka soda, 11 parts vodka, 1 part soda. Worth the  $10!"
        }, 
        {
            "index": 206, 
            "rating": 5, 
            "review": "The first thing you encounter when going to this bar is the front door. Of course. BUT, if you are already buzzed/drunk, it can be a funny thing. It is somewhat hidden...or disguised as a wall. So when you first try to open the door, you feel like an idiot pushing on this wall. When you eventually get in, you will notice immediately how swanky this lounge is. There is plenty of seating, however, due to popularity and small size, it is usually not easy finding a place to sit. The bartenders are very good at making drinks based off of requests consisting of flavors followed by the letter y or -ish (example: tropical-y, cucumbery, not too sweetish). This is usually one of my favorite first stops since I don't like stumbling into such a classy place."
        }, 
        {
            "index": 207, 
            "rating": 5, 
            "review": "We decided to celebrate renewing our vows after 10 years of marriage with a drink at the Downtown Cocktail Room. We were beyond early for a bar like this one and for that I am grateful. \n\nMona, the daytime bartender, is a wizard. \n\nIf she were a D&D character she would be unbeatable. \n\nI had a spin on a Negroni, made with rye instead of gin, complete with flamed orange oil over the top. Figuring out how to master this on my own will be my end of summer project. It was spectacular. \n\nMy wife was indecisive so Mona offered to create something special for her and what she came up with was stunningly tasty and a perfect read of her customer. We just wished we'd paid attention while she invented it in front of us. \n\nWe had a fabulous time and will definitely be back."
        }, 
        {
            "index": 208, 
            "rating": 5, 
            "review": "This place is fantastic. Great vibe. Ambiance is dialed in. Great place to start the night on Fremont St."
        }, 
        {
            "index": 209, 
            "rating": 4, 
            "review": "Despite the bartender having made me the wrong drink on my first order I like this place. Relatively quiet early on and a good place to have conversation over great cocktails. All 3 drinks I chose were delicious (even if one wasn't something i had ordered)\n\nI'd like to say I originally planned on giving this 3 stars but I've been back a few times since my first experience an it's been spot on every time since."
        }, 
        {
            "index": 210, 
            "rating": 5, 
            "review": "Just at the end of Fremont Street and just down Las Vegas Blvd. in the Fremont East district is the Downtown Cocktail Room.  This place is slightly off the tourist circuit and away from the main downtown attractions and the strip.  It seems to be a local hang out and that made it all the more appealing for someone who wanted to get away from the rest of the tourists.\n\nThe lounge is dark.  The walls are red and the furniture black.  The light and the artwork is minimalistic.  It's relaxing and chill and a great place to kick back with a cocktail.  The DJ spun energetic remixes of soul and funk which reflected the lounge's balance of being chill yet a hip destination.\n\nThe cocktail menu is seasonal and full of many craft cocktails.  The libations and mixology is interesting and unique.  The cocktails are around $8-10 and are mixed well with fresh ingredients and fine spirits.\n\nThe bartender was very friendly and helpful.  The server was very nice and she talked to my friends and I for a long time.  She thought we were locals and if I was I would visit this bar all the time."
        }, 
        {
            "index": 211, 
            "rating": 5, 
            "review": "LOVE THIS PLACE.\nWent here for the first time friday night, and from the front door to the back of the place is amazing. loved the two-way mirrors in the bathrooms. Loved the unique,delicious drinks. LOVED the music!! I can't believe they played reggae music in there, its so rare to hear that kind of music in las vegas, felt like i was in hawaii again. but i loved how i also felt like I was in san francisco at the same time.very classy place. and love how you dont need to pay 300+ dollars just to get a booth, you just sit anywhere :) def. coming back."
        }, 
        {
            "index": 212, 
            "rating": 5, 
            "review": "Good, original drinks and a decent price. Chill, intimate atmosphere. They have a good selection of original drinks, similar to speakeasy style. Close to Fremont, but a lot more classy."
        }, 
        {
            "index": 213, 
            "rating": 5, 
            "review": "Been here many times since my initial review and I must say, the place is still fantastic. \n\nServers are attentive. Drinks are great! Although I'm still sober (till my bday in August), I had the pleasure of ordering some of their \"mocktails\" which are sans da booze. They are delicious and prepared by the mixologists with special love and care for the beverage. I like that.\n\nBathrooms are still clean. House DJ is cool. \n\nI always bring my out-of-town guests to the DCR. They can form their own opinions about Vegas and the downtown vibe, rather than judging it by Fremont Street.\n\nThis place is legit. So legit that I'm having my birthday party here (see events section)."
        }, 
        {
            "index": 214, 
            "rating": 4, 
            "review": "Hidden gem just outside the madness that is The Fremont Street Experience."
        }, 
        {
            "index": 215, 
            "rating": 5, 
            "review": "Lovely staff. They have excellent cocktails and a range of absinthe that's killer. If you have any questions abut any drink ask for Alexis and she'll help you on whatever you need. The atmosphere is chill. Watching newbies find the entrance is pretty funny to see too."
        }, 
        {
            "index": 216, 
            "rating": 4, 
            "review": "Good luck finding the entrance.\n\nI always take first timers here and get a good laugh if they can't find the entrance. It's not that hard. It's to your left.\n\nEnough about the hidden door. This place is more about the drinks. They change their menu seasonally. But it's always a nice touch and makes me want to come back even more. Drinks are about $10-15. But who cares about the drinks? Get a punch bowl. $45-55. Enough for 4 people, or 2.\n\nThe ambiance is super trendy. Never been here just wearing a t-shirt. I would feel left out. Weekends are always busy, so expect your drinks to take a while. There's always a DJ spinnin' some tracks. \n\nBottom line: good place for hang outs, drinks, maybe music. And when you're peeing, expect to watch people."
        }, 
        {
            "index": 217, 
            "rating": 5, 
            "review": "This is one of my favorite places downtown.  A wondrous selections of creative concoctions that are always sure to please the taste buds. Jeremy makes some of my favorites. \nThe staff are friendly and quirky which adds to its charm. Be sure to visit, indulge, and tip well!"
        }, 
        {
            "index": 218, 
            "rating": 5, 
            "review": "Fantastic music and mixologists what more can you ask for.  As many have said before chill vibe."
        }, 
        {
            "index": 219, 
            "rating": 5, 
            "review": "I love everything about DCR.  I don't drink, so I don't know how the cocktails are, but the vibe and the service is awesome.  \n\nI have been here a handful of times.  A couple times they had some live music and a few times they just had a DJ playing mellow jams.  \n\nThe most recent experience on a Wednesday night was probably the worst I've experienced, but that was simply because some random drunk girl came and sat with us for an hour and told us her life story.  I just wish a security would have seen our discomfort and helped us out a little bit with her but on a Wednesday security is sparse.  \n\nThe staff is always friendly and extremely helpful in ordering, as far as what I've witnessed with my friends questions and drink orders.  My favorite thing to do is watch people try to get into the door.  If you don't know, you learn! \n\nI look forward to introducing more friends to DCR.  It really is a cool spot and I love hanging out there despite the fact that I don't drink."
        }, 
        {
            "index": 220, 
            "rating": 4, 
            "review": "Hard to believe that this cocktail lab faces the insanity of the Fremont Street Experience.  Don't get me wrong - I love Fremont.  But DCR is pure class next to one of the world's biggest mines for hokey-ness and over-the-topping.  If memory serves, the place is kitty-corner to the Heart Attack Grill, for Pete's sake (\"OVER 350 LBS EATS FREE!!!\")\n\nThe drink menu here is one that has been crafted by people who clearly love to experiment and have fun.  It rotates seasonally, and drinks are given a value based on their ABV (I think).  I'm sure there's some duds every season, but the sheer ambition makes up for it.  Not to mention the alcohol-to-dollar ratio.\n\nAll the other essentials are in order, too.  There's a decent amount of seating, and the music isn't super overpowering.  Bathrooms are clean."
        }, 
        {
            "index": 221, 
            "rating": 5, 
            "review": "Michael sure knows how to do a bar right. Everything about this place is neat! The decor features lots of deep burgundy, purple, and chocolate colors, cool chairs/couches, candles on the tables, and interesting wall art. The bathrooms have two-way glass that freaks you out at first. The drinks are truly handcrafted masterpieces of liquid awesomeness and, though more expensive than I normally go for, are very \"efficient.\" The bartenders are helpful and knowledgable; I've only ever had an issue with one waitress there being less-than-friendly, and I don't believe she works there anymore (good lookin' out, DCR management!). Some of the most fun you can have here is watching people who've never visited DCR before try to find and get in the front door (tee hee!) Out of all the downtown bars, this one has many fewer wannabe hipsters than most, which is why it's my favorite downtown bar."
        }, 
        {
            "index": 222, 
            "rating": 4, 
            "review": "The Sage Advice cocktail is so good! And only $7 during happy hour (4-8pm). The bartenders are super knowledgeable and I've never had bad service, although I've never been while it's super busy. Overall, I would suggest trying it out, really awesome cocktails!"
        }, 
        {
            "index": 223, 
            "rating": 5, 
            "review": "This place is amazing. I like to come on nights that it isn't so busy. \nIt is so much fun to watch one of the guys make a drink, because they are so elaborate; it's like watching a free show and having front row seats! The bartenders are super cool, super friendly and know how to make great drinks! I don't really like to hang out in the lounge area, so I can't speak to that experience. So yeah, if you come on a weekday, pull yourself up to the bar, and expect a great experience."
        }, 
        {
            "index": 224, 
            "rating": 5, 
            "review": "We finally made it down to the Downtown Cocktail Room after years of talking about it and I am glad we did .  The lounge has a very sexy, speakeasy feel to it starting with the entrance.  I guess I should have been more diligent in reading the reviews before going because that would have cleared up the confusion on HOW to actually get in.....but alas, we found our way inside and sat right next to the windows....where we mused at other first timers trying to find the door too.  There are also other secret doors and two way mirrors which is a fun touch.  Their specialty is the handcrafted cocktail and there is something for everyone.  We tried the Don't Fig with me, Pumpkin Spice and the Orthodox Caveman (all good).  I am not much of a sweet cocktail person, usually preferring Vodka on the rocks or a good martini....but I appreciated the art of their crafted cocktails and would try others on a return visit (especially since the cocktail menu changes seasonally).  The atmosphere is relaxing and the music was good, we will definitely be back."
        }, 
        {
            "index": 225, 
            "rating": 4, 
            "review": "So it's like a room, and they have cocktails, and it's like located downtown.  Pretty soon, they'll get creative and name a shoe store, The Store on Harmon on the East Side of the Strip Next to the Donut Shop that Sells Shoes.  I'm still trying to figure out THEhotel.  Really?  My sister tells me she's at the hotel, and I'm like what hotel?  She's like, do I have to spell it out?  THEhotel!  And I'm like, what is wrong with your smart phone it capitalized THE.  Now she just thinks I'm mentally challenged, which I am, but stuff like this doesn't help.  \n\nNice, dark, mellow joint with a very small bar area unfortunately, but a bartender who loves his cocktails and bitters and I got to taste a few.  This is what classic cocktail bartending is all about.  Bartenders who take pride in their ingredients and want to share and educate customers.  I was at this stupid Disney bar called Rx Boiler Room where they all dress steam punk and the bartenders are all like Disney animatronic characters serving you drinks like slow robots and walking away on their floor rails like Pirates of the Caribbean?  You get the point.  In fact, I bet you could program one of those pirates to mix your cocktail better AND give you faster, better service.  Unfortunate name.  My friend tells me he's going to take me to downtown cocktail room.  I'm like, what's it called?  He thinks I'm mentally challenged too."
        }, 
        {
            "index": 226, 
            "rating": 2, 
            "review": "I had two cocktails here on Feb. 6th. The first had arrack in it and was subtle and delicious. I didn't record what it was and my attempts to contact DCR via email, phone and fax have been in vain. They are as secretive as their door. The 2nd drink, called the apple of your eye, was too sweet, not apply enough for my tastes, and served in a sticky glass.  Wow, I thought only my country, Canada, had such bad service."
        }, 
        {
            "index": 227, 
            "rating": 5, 
            "review": "I plan vacations to Las Vegas around my ability to come to Downtown.  This place is a welcome respite from the typical Vegas scene, and for out of towners, a place to interact with \"real\" people in a totally non-touristy and non-fake environment.\n\nNot to mention the drinks are among the most innovative and well done that you can get anywhere in the country.  The staff clearly put extensive amounts of time and research into seasonally creating their menu and collaborating to put together a lineup of drinks they all stand behind and have made their own.  This kind of attention to detail and personal touch is something hard to find in Vegas, or anywhere else for that matter.\n\nKevin and Jeff have served me all of the times I've been there, and have been nothing short of outstanding.  Kevin spent an hour one night on a slow weekday talking about the history of absinthe and how it came to be.  Jeff has spent ample time discussing how they create their menu, the various forms of spirits they carry, including the local distillery they feature.  Not at all pretentious, very personable, and clearly very invested in what they do.  \n\nI've ordered many times off the menu from both of them, and the care they put in to taking the idea I give them and putting out a top quality drink is extraordinary.  Frankly, the look of concern on their face every time they hand me a drink is a show of just how much they want to get it right.  To date, they haven't missed once on creating exactly what I asked for and executing it flawlessly.\n\nI would strongly recommend coming here if you're a local, a tourist, a conventioneer, or whatever reason you have to be in Las Vegas.  If you're looking for a top of the line cocktail, in a relaxing and intimate setting away from the headache of the Strip or other Downtown bar settings, this is the place for you.  I've run into many a different kind of person here, from 20-something locals, to bartenders from other Downtown restaurants having drinks after work, to tourists, business people, and all were treated with the same level of respect and friendliness and respect, no matter how they appeared on the surface.  A top quality Vegas nightlife spot that doesn't judge you the minute you walk in the door based on what you're wearing and who you're with - a diamond in the rough for sure.\n\nI wish I didn't like 3,000 miles away from here, or I'd be in every weekend.  I won't tell you how to open the front door, that's for you to find out.  :)"
        }, 
        {
            "index": 228, 
            "rating": 5, 
            "review": "I love signature cocktails, especially when 1 gets the job done of erasing the last 8 hours of your work day.  Great place for a snooty happy hour.  You can't get these drinks anywhere else in town, they are truly memorable."
        }, 
        {
            "index": 229, 
            "rating": 4, 
            "review": "Loved it. So much more natural style than the places on Fremont Street. And with a much better playlist/DJ! My drink was excellent, and my server, Mona, was absolutely Stunning! Would definitely go back."
        }, 
        {
            "index": 230, 
            "rating": 2, 
            "review": "We stopped in for Happy Hour... We each had one drink, and the total was $17.  Thats happy hour price?  :-\\  My martini was pretty awesome, I'd come back for A drink... not a place I'd wanna drink all night...\n\nThey do have Absinthe.  We ordered one of the Lucid, and one of the Kublar.  The bartender gave it to us strait.... (definatly not the way to drink it! EW!)   She then told us that the Downtown cocktail room is one of the two ONLY places you can buy it in Vegas, and that we could buy a bottle there (to take home) for a mere $200 (i can't remember exactly.. it was around 200) ... So, we passed... as the shot of strait Absinthe was way too much to handle (maybe if it were served properly) \n\nLater the same day, we were over at another downtown bar ... which also had Absinthe (not one of the \"two\" bars in Vegas that supposedly have it.... ) \n\nAlso, before we left, we noticed it @ one of the gift stores. Lucid = $68, Kublar = $54....I would be pretty pissed if i had been drunk enough to buy the $200 Absinthe from the liar @ dcr... psh."
        }, 
        {
            "index": 231, 
            "rating": 3, 
            "review": "After 13 months living at The Ogden and participating in #VegasTech, I'd never once been here. Considering that it's a block away and practically the Downtown Project's office (hell, they even put a sign on the door), I figured I should rectify that.\n\nInside, it was a lot different than I imagined, walking by the completely blank façade. My wife and I went with, of all people, our parents while they were in for thanksgiving. The vibe was good (indie hip-hop helps) and the bathroom stalls were AWESOME. If you'll excuse my frankness, it's really freeing to be doing your business, able to see everyone else in the room without them seeing you!\n\nBut this is a cocktail bar, and the cocktails are where they falter. I was not impressed with what I had from the fall menu. The \"Rufus Xavier Sarsaparilla\" tastes like one would expect, but the Pumpkin Spice was heavy on the bourbon and skimpy on the pumpkin - pulling off such a drink is a delicate balance and in this case, the balance was out of whack.\n\nThe \"Don't Fig With Me\" was not as figgish as I expected, which is actually a good thing. There was one more drink we tried, but I can't remember what it was and the menu on the website is sorely out-of-date.\n\nI'll finish by saying that while the drinks are unbalanced, they definitely get the job done. I'll give DCR another shot when the winter menu is ready."
        }, 
        {
            "index": 232, 
            "rating": 5, 
            "review": "I love places that are so cool that just finding the door is difficult.  \n\nFirst a quick shout out to George....HI GEORGE!\n\nI came here just to have one drink and check out the place.  I ordered some Absinthe drink with cucumber and I have to say it was light and tasty.  George was bartending but he is actually a manager too.  He was very accommodating with some special requests.  If I lived in Vegas this would definitely be one of my regular spots."
        }, 
        {
            "index": 233, 
            "rating": 2, 
            "review": "I stopped here with a group of 6 last Saturday. I had read a raving review of the place in Sunset Magazine so my expectations were maybe a bit altered by what I had read. As promised, the venue offers a funky, dark atmosphere to imbibe some hand crafted cocktails. They had decent DJ music which everyone liked and was at a volume that allowed for conversation.  I didn't expect how dark the place was going to be. It was so dark in there we had to wait about 10 minutes for our eyes to adjust so that we could read the menu. The menu has several options, offering a rating system of for some of their cocktails. At first, I thought it was rating the potency of the cocktail, but after asking our server, she explained it rates the complexity of the drink. I had the Apple Bobbin, which I found light and refreshing.  The reason this place only gets 2 stars is because of the bathroom. The dark theme continues into the (very poorly ventilated) bathroom. It was pitch black in one of the stalls. There was absolutely NO light. I was too scared to use it so I waited until the other stall opened up. Once in the stall, you see that you are behind double sided mirror, allowing you to see everyone in the washroom while they are unable to see you. This bathroom just felt like horror movie waiting to happen. What an awkward experience. We had one drink and left, if we stayed longer we might have fallen asleep!"
        }, 
        {
            "index": 234, 
            "rating": 5, 
            "review": "My husband and I recently got married in Las Vegas and chose to have our reception at DCR. We first visited the bar maybe 2 years ago on a tip from another bartender. We LOVED it. Loved the drinks, loved the design of the room, we even loved the hidden front door.\n\nWe travel to Las Vegas two or three times a year to see family, and this has become a staple of our visits. When we first spoke to Michael and Jennifer about having our reception there they were extremely helpful and spent a good deal of time talking about our options. On each of our trips I've been excited to try the new cocktails they've crafted for their seasonal menu, and being in the service industry in Chicago this kind of attention to detail and ingredients never disappoints. The drink menu was one of the big selling points for our reception. \n\nThe reception itself was fantastic. The staff were incredible, they treated our guests with the perfect amount of enthusiasm, drink knowledge, and just simply exceptional service. We felt like they were a part of our party, and all of our guests (friends and family) were impressed with the drinks, the service, and the space itself. We brought our own ipod with a pre-made playlist and they hooked it up for us no problem. \n\nDowntown Cocktail Room has been one of my favorite places in Vegas since my first visit, and they went above and beyond to make sure our wedding reception was flawless."
        }, 
        {
            "index": 235, 
            "rating": 5, 
            "review": "This place is Vegas' best cocktail room, as far as I know. The drinks are delicious, authentic, and affordable. The staff is cool, calm, and friendly. See you there..."
        }, 
        {
            "index": 236, 
            "rating": 5, 
            "review": "Dark, intimate and amazing cocktail creations. I love this place!  You know what's crazy?  I don't even recall the type of music that was playing which is very weird since that's the industry I am in...it must have been overpowered by my amazement at the bar.  The bartender who served us was named Jeff, this guy is a rockstar.  The extra time to make these drinks is well worth the wait and he has pro bartending skills and personality."
        }, 
        {
            "index": 237, 
            "rating": 5, 
            "review": "This place is amazing! From their Summer menu, to their Fall must-drinks, every sip tells a story! I recently tried the Root Beer cocktail--strong and delicious at the same time. The liquors are artfully mixed and each drink packs a punch. If you're just looking for a drink, this is not the place. If you enjoy thoughtful mixology, knowledgable bartenders, and a low key ambiance with very cool music-- this is it."
        }, 
        {
            "index": 238, 
            "rating": 4, 
            "review": "Went to this place last night with some friends after hearing about it through some people i know. Its a very dark cocktail lounge. There is no dancefloor. So, if you're looking for a club this isnt it. It's a nice place to hang out and drink with friends. I was very pleasantly surprised to hear real underground house music too. Previously i had little to no expectation of ever hearing real house music in Vegas but low and behold the Downtown cocktail room...."
        }, 
        {
            "index": 239, 
            "rating": 5, 
            "review": "My friends and I found out about this place from a waiter at Mesa Grill in Cesaers...and I am SO glad we went!! This is a great place to go when you are downtown and just want to relax and drink.  I even tried the absinthe! \n\nThe atmosphere, the music, everything about it was wonderful! And the bathrooms were FANTASTIC! (Silly to mention I know..but just wait till you see them!)\n\nI cannot wait to go back here!!!"
        }, 
        {
            "index": 240, 
            "rating": 2, 
            "review": "Wow, total let down!\n\nThis place used to be happening, hip and the place to be.  Now, it was just mediocre.  You would think in Las Vegas you would get superior service, a knowledgable staff and great drinks; but no.  The cocktail server was disheveled and completely unknowledgeable.  The menu is intriguing with so many fun, unique drinks to try; but this girl was lost and knew nothing!  She mixed up our drinks, took forever to come around and was shy and timid.  She kept making excuses and appeared annoyed.  I couldn't stop thinking how she was unorganized and lazy.  This was so apparent in her dress and the way she portrays herself, with her glasses hanging off her nose.  \n\nITS VEGAS!!!  Who hires some timid messy person to slang drinks?  Seriously, I was completely let down.   \n\nAs for the food, I did not expect typical bar food; but at least they had something.  Its really not outstanding and just regular fried crap, nothing healthy to choose from.  There was no DJ and the music really lacked.  \n\nI've been here years ago and it really was the place to be. Now, with all the new development downtown this place can't keep up.  Its sad."
        }, 
        {
            "index": 241, 
            "rating": 3, 
            "review": "Time for an update...\n\nWithin the past month I've visited Downtown Cocktail Room three times.  And whether it was through my personal experience or the experience of others in my party, things have left a generally sour taste in my mouth as of late.  There are a few things that have stood out in my recent visits:\n\n-The audacity of a specific bartender.  I always welcome a bartender/mixologists opinion when it comes to recommendations for spirits and cocktails, but this individual comes across as arrogant and presumptuous.  He offers suggestions for DCR-original creations, and then openly admits that all of his recommendations are his own creation.  This came up after a customer had inquired about a drink on the Spring menu, and the bartender said that he wasn't the one who created the drink.  In addition, he ignored a customers request for a cocktail made with a specific spirit, stating that he doesn't work with it; he then waited for the customer to suggest a different spirit base for a cocktail.  As a side note, this bartender also rang up my bill incorrectly during this visit, over charging me for a drink.\n\n-Service.  Waitresses were not immediately willing to seat my party in the back area of DCR.  This was brought to my attention by another member of my party, as I arrived after they had.  They were told that there was no seating available, and we only ended up in the back area because a member of our party asked about it.  Am I to believe we would have been out of luck if we weren't aware of the back area?  Maybe.  After being seated, ordering our drinks, and then receiving our drinks, the waitress asked if we wanted to start a tab.  Standard procedure, that's cool.  Some individuals were done ordering and decided it would be easier on them to pay their portion of the bill now, instead of having their total added to a tab.  The waitress then proceeded to bring out the bill for everyone at the table.  Later in the night, when another party was seated in the back area, the waitress took an empty chair from our table without asking us if it was taken.\n\n-Did you know there was a $20 minimum if you're going to use a credit card/debit card?  I sure didn't.  After going here for the better part of two years, that issue has never come up; I know this because I often don't carry cash, and also usually order only two drinks (which will keep the bill below $20).  However, on a recent visit, I ordered one drink for myself and another drink for a friend, for a total bill of $19.  First of all, the bill was brought to us right after our drinks were delivered.  Really?  You want me out of there that bad?  After handing the bill back with my debit card, the waitress stated that there was a $20 minimum and that they would have to add $1 to my bill so that I could use my card.  My card is Visa; if this establishment accepts Visa, then they also accept all fees due upon Visa transactions from customers.\n\n-Responses to Yelp reviews:  Eight out of the ten lowest scored reviews have received a response from Michael C. of Downtown Cocktail Room.  Not one comment or response, however, was given to reviews over three stars.  It's one thing to step up and address concerns with reviews that you feel are not a valid representation of your business; however these responses avoid the overall commentary of the reviews, and a number of them end with something along the lines of, \"Come by DCR and form your own opinion.\"  Normally I wouldn't nitpick and pull out a statistic like I did above, but it surprised me to hear about the feedback that people had received for their reviews (three stars or lower), while I had not gotten any feedback for my review (five stars).  It's a little disheartening to see all the attention the negative reviews receive, while the glowing reviews from regular customers appear to go unnoticed (until their rating goes down, in which case the deduction of two stars in a review prompted a response that ended with, \"Thanks for all of the past support!\")\n\nThanks for all of the past support?  Well, your welcome for all of mine as well.  We'll see how things go from here, as I'm sure I'll end up here again; probably just not twice a month as I have in the past."
        }, 
        {
            "index": 242, 
            "rating": 4, 
            "review": "If you come with a group, I recommend a punch bowl.  Lots of fun and bound to get you drunk.  I've been here a million times and it always delivers.  Every drink I've ever had has been delicious.  The music is great and the bartenders are fantastic.  I just wish they had a little parking lot right in the front."
        }, 
        {
            "index": 243, 
            "rating": 5, 
            "review": "I walked in to enter the place and stood there...seriously had no idea how to enter...it was kinda gnarly.... You'll see what I'm talking about when you go ....My craft bartender Davey was amazing!  He presented the summer menu to me and I just told him surprise me...and every time he created a new cocktail it was better than the last....This is s must stop for Downtown Las Vegas visitors and locals.... Ask for Davey I'm sure you'll have a happy ending to your night!!"
        }, 
        {
            "index": 244, 
            "rating": 4, 
            "review": "It's very speak-easy and the door to the DCR could easily be missed. \n\nThe place has couches all over which I loved because it felt very comfortable.  This is a dim lit place, which gave it a more intimate feel. \n\nThey have a wide selection of different cocktails and I had the apple --? (cannot remember the name) it had caramel rum and was extremely strong. This is a place you def get your money's worth for cocktails, as they aren't watered down (like cocktails in a club on the strip)\n\nCocktail prices are about $10-15. \n\nTheir happy hour is from M-F 4pm-8pm where they actually offer some descent bites: hummus + pita, steak fries, buffalo wings, cheese plate, crab cakes, etc. \n\nHH drinks are: Cocktails $7 Well drinks $5 Wine $5 Import Beers $4 Domestic Beers $3\n\nNOT during the happy hour however, the selection of food isn't that great. They offer a 2 for $5 for some nibbles of honey sesame cashews, cinnamon almonds, etc-- nothin like the happy hour menu. Our group of friends considered leaving and going some place else for food. \n\nService was really good, could have been because the place was a little dead (it was a monday night)"
        }, 
        {
            "index": 245, 
            "rating": 4, 
            "review": "Loved it! Cozy, great chill music, wonderful drink menu.\n\nWould be 5 stars if -  the music was down just a tad - it was too loud for conversation.  And, the \"secret\" door almost kept us out.  I noticed a few other people walk away when they couldn't find the door either, and once I played doorman because I happened to see some people try to find their way in.\n\nI understand the feeling of exclusivity, but the place was still quiet around 10:00, and would have been better if the people who wanted to come in could figure out how to get in!\n\nI got a specialty drink, something with lemongrass - was  quite tasty.  Nice place to experiment with new drinks."
        }, 
        {
            "index": 246, 
            "rating": 5, 
            "review": "Always a great time.. There needs to be more places like this bar. Others take notice and see what your doing wrong..."
        }, 
        {
            "index": 247, 
            "rating": 4, 
            "review": "Wandered in here looking for a mellow night where we could have drinks and actually hold a conversation with some friends.  It was perfect for that.  The drinks are priced like Strip drinks, but they are admittedly very handmade.  Their seasonal menu didn't hold much appeal for me when we were there, but the drinks all looked like lovingly crafted recipes.  Service was really good, and it never got crowded enough to be uncomfortable."
        }, 
        {
            "index": 248, 
            "rating": 3, 
            "review": "I used to really like this place because it's totally chill mode and the drinks are creative and typically well-made. My last visit here was with a party of three on a busy night. Three of our five drinks were lackluster at best, including my old fashioned. If DCR can't even craft a good old fashioned any longer, then it's all over folks! My friend couldn't even drink one of his menu cocktails because it was just that bad. It tasted like a mélange of top shelf cough syrup. He sent it back in what he thought would be an exchange for something more palatable, but the drink ended up on the bill anyway. When you're charging these prices, especially right now, you should be more attentive to such things. Because I've been here many times, I may give the place another shot. But honestly, this experience leads me to believe this place may have jumped the shark in terms of consistency in quality..."
        }, 
        {
            "index": 249, 
            "rating": 5, 
            "review": "This place reminds me of a cleaner version of The Tunnel Top in SF. Great hideaway joint with NO GAMING! What a releif. Very sexy room with a back room with these booths that scream debauchery. Very well done Michael. They have a DJ most nights spinning some very sexy down tempo house. Definitely a must go!"
        }, 
        {
            "index": 250, 
            "rating": 3, 
            "review": "The new revitalization of downtown and Fremont St. is thrilling.  I went to high school downtown and that entire place holds so much magic for me.  It's really refreshing to have new destinations down there besides the Beauty Bar and Jillians.  I was tres excited to visit the new Downtown Cocktail Room.  Unfortunately, I was a little disappointed.\n\nFirst of all, it's hard to find the door; and it was the first place we went all evening so everyone still had their wits about them.  The DJ had to shine a light on it from the inside, and even then it still looked like a panel of plywood covering a broken window. \n\nThe interior is wonderful.  Dark, cozy, and intimate, reds and tans and chrome intermingle with candlelight and interesting art.  However, that first glimpse was about as much excitement as the venue offered.  I can definitely see this place being excellent for a two person chit-chat-a-thon - it just wasn't suitable to our 5 person strong group who felt like whooping it up for the evening.\n\nThe weirdest thing about this place are the stalls in the ladies' restroom.  I, of course, have no idea about the men's, but the treatment on the stalls gives them a slight two-way-mirror effect (you can see right out when you're inside) HOWEVER you can see right through them from the outside if you're close enough - and close enough is just where the sinks are located.  I feel close to all my sisters, but I don't know if I want to feel THAT close."
        }, 
        {
            "index": 251, 
            "rating": 5, 
            "review": "Went there on a Wednesday night with 3 friends.  We were all in town for a business conference at the Golden Nugget.  This place is located right at the end of the Fremont Street experience where it meets Las Vegas Blvd.\n\nThe current drink menu is the Winter version.  They also had a live acoustic band that played latin music this night.  The ambiance is chill and dark.  I especially liked that they were playing my favorite chill group Massive Attack while we waited for the band to set up.\n\nThe drinks were fabulous.  Our waitress, SAM had a great personality and was very attentive.  The bar tender, I don't remember her name, was not only a great mixologist but surprisingly knowledgeable about the history of Absinthe.\n\nThe drinks we had were:\n\nDeck the Halls\nGreen Fairy (an absinthe drink)\nPortydia\n\nWe all agreed we would be coming back to this cocktail room when we return to Vegas."
        }, 
        {
            "index": 252, 
            "rating": 5, 
            "review": "One of my favorite bars ever! I love the constantly changing menu (but that long-time customers can still get their favorite \"classics\"), the quality of the drinks, the laid-back vibe (unless it's 12-2 on a saturday, then it can be super-crowded).  \n\nThings you might not know:\n1.  VEGANS- beware! Some of the drinks contain eggwhites, honey, dairy, or Campari and are not necessarily listed on the menu.  When in doubt, ask the bartender.  They're usually cool about making you a vegan version.\n\n2.  Usually the first Monday of the month is \"Mixology Monday,\" which is a hot mess of a good time.  A guest mixologist makes 4 special cocktails to highlight the featured booze of the evening (I went for Veev Acai liqueur and .... some other stuff that I drank too much to remember what they were... but every time I've gone it's been excellent.)  \n\n3.  On weeknights, it's a great place to go with friends/ a date that you actually want to talk to because it's not too crowded, the music is not loud, and the ambiance is nice.\n\n4.  Expect to pay about $10/drink.  They also have a \"temperance menu\" of non-alcoholic drinks that are done mixology style.  Great for  DD's, preggo's, or Mormons!"
        }, 
        {
            "index": 253, 
            "rating": 5, 
            "review": "This place was exactly what I was hoping for and was exactly as yelpers described. I came here on a Monday night for happy hour, and looked for the sketchy looking outside. Watch out for the entrance, it's fairly deceiving if you don't know what you're looking for, but pull on the bread on the left and you'll be fine. Three place was empty enough that we were attended to perfectly quickly. I ordered a funky pear medina cocktail, and my dad got their fig cocktail, and both were ready before too long. I noticed that our bartender, Kristen, mixed our cocktails over on the side with what appeared to be regulars, but still made us feel welcome. After our cocktails, we had a chat about the different absinthes available, and she was really helpful and knowledgeable. I ended up taking her advice and trying a spanish absinthe as my first (obsello) and it was great. The atmosphere was dim, moody, and chill with smooth music and next time I'm in Vegas I'm definitely coming back. Thanks Kristen, I've finally got a yelp to make good on my word to praise this place, and my cocktail horizons have been expanded."
        }, 
        {
            "index": 254, 
            "rating": 4, 
            "review": "Cool place to have a drink.  Makes you feel like your not in Vegas.  This bar is something you would fine in a bigger city like NY or Chicago. They make really good cocktails and the service is great.  Definitely worth checking out."
        }, 
        {
            "index": 255, 
            "rating": 5, 
            "review": "Vegas' best kept secret for the absolute best cocktails. Kevin is awesome. The English dude.... Is annoying. But he still makes a good cocktail nonetheless. Ignore him and enjoy the drinks!"
        }, 
        {
            "index": 256, 
            "rating": 4, 
            "review": "After a prompt visit at Vegas Streats, a few friends and I went to Downtown Cocktail Room for some conversation and drinks. Being situated in the midst of the Downtown Vegas, DCR is definitely a change of pace - dimly lit, modern, swanky. I was shocked at the size of the bar as well; for there was an entire room in the back with more tables and chairs. \n\nService was fantastic - prompt and accommodating. Hearing the DCR was a gin master, I ordered the Barbieri Swizzle. What made it into my cocktail, I can't be too sure (a solid sign of a great cocktail, in my opinion). Fruity yet tart, I certainly didn't taste the gin, but half an hour later, I felt it - my kind of drink. \n\nThe first bar I went to since coming home to Vegas, I am certainly aware of what I am missing out now. DCR triumphs over any bar on the Strip. Low-key with a great atmosphere, drinks and service, I would come back again!"
        }, 
        {
            "index": 257, 
            "rating": 5, 
            "review": "So I've been to this place twice now, the first time was on a Tuesday night for birthday drinks.  I must say, the vibe on a Tuesday was pretty lame, BUT I tried the sangria punch bowl and it was delicious!  Knowing that the drinks were probably going to be tasty consistently, I returned last weekend with an out of town friend, and the crowd was an entertaining mix of downtown people, great people watching and the music was much better.  The real attraction are the cocktails though, WOW they were incredible.  There are stacks of fresh herbs and fruit behind the bar and their bar tenders are extremely talented.\nAfter our group ordered a couple of drinks off the menu, our bartender started making us custom cocktails.  We'd tell him we wanted to try a play off of a mojito styled drink and he was off, mixing up some tasty concoction.  \nYes it's a little pricey, but well worth it for some incredible drinks.  I'd say if you don't mind it being empty go anytime of the week, but if you want some decent people watching stick to the weekends."
        }, 
        {
            "index": 258, 
            "rating": 5, 
            "review": "Best bar/lounge in Las Vegas. Great music and excellent hand-crafted cocktails. My first time yelping but a devout custy."
        }, 
        {
            "index": 259, 
            "rating": 4, 
            "review": "This place is quite nice but the music can get too loud. The door is hidden. Psst...it's the copper colored one without a handle. Push to enter."
        }, 
        {
            "index": 260, 
            "rating": 4, 
            "review": "You know I've been hear a bunch of times and I gotta say i really do like it.  \n\nFrom the outside its this non discript brick wall with a tiny neon sign that reads \"Downtown\"...    Now moving to the front door...    if you dont know that the door is there...    it has a kind of \"Speak Easy\" vibe.     Once you find the door (and realize that people inside can see you looking for the door...   Funny)    you enter a very cool and surprising ultra lounge...    DJ in the corner... cool seating options with high top tables, a cool bar and plebty of low couches that you and your group can hang at for the night.     \n\nNow drinks....    Usually this happens...   Everyone orders whatever drink...    or a bottle of somthing...    and you go on with life...      Well do yourself a favor and get the \"punch Bowl\"    4 people get the small one...   more people get the large.   Its exactly  what it sounds like...    a bowl of (very tasty but really strong) punch...    like you would find at a high school dance in the 50's...      Fun.    Drop the ladle in and have fun with it...    not only is it a fun way to get tipsy with friends but it ads to the conversation.   \n\nOk somthing that not many people would talk about or even care about...    but the restrooms...     all the stalls are full length mirrors...     you can see you but others cant see in...    I hope you dont get stage fright...    yet another thing to have fun with...     well at least i thought so....   after a punch bowl or two.   \n\nI just wish the music wasnt quite as loud...    hard to have conversation...    but thats a small thing...     Fun place"
        }, 
        {
            "index": 261, 
            "rating": 5, 
            "review": "Ive been here 2x now.  I have a good time when I go.  I met friends here the last time that live downtown and know everywhere to go.  Since they frequent this bar, my girlfriend was pretty chummy with the bartender and he kept whipping us up these shots of ... well I dont know ! lol\nFun lil place, not inexpensive though."
        }, 
        {
            "index": 262, 
            "rating": 4, 
            "review": "Great drinks.  Let your bartender make some of her specialty concoctions.  You won't be disappointed.\n\nOnly complaint would be the music.  Mostly electronic house music.  I think it'd be more fun if they played some old school jazz.  Just a thought.\n\nBut hell, great drinks and a great place in downtown to hang with friends."
        }, 
        {
            "index": 263, 
            "rating": 3, 
            "review": "Great venue. Many cigar sites rate this as a top cigar bar, but they don't allow cigar smoking. :\\"
        }, 
        {
            "index": 264, 
            "rating": 4, 
            "review": "This place is classy. While the absinthe drinks aren't cheap, the rest is fair. The bouncer looks and sounds like Morgan Freeman."
        }, 
        {
            "index": 265, 
            "rating": 5, 
            "review": "dcr has got to be my favorite place to chill in downtown.  i've been coming here for a good 6-7 years, long before downtown became tony hsieh's \"project\".\n\nalthough a non-alcoholic, i've sampled many of their cocktails and i must say that they are some of the most well made drinks i've ever had.  they're thoughtful and inventive and most of all, made with real ingredients.\n\nthe atmosphere/ambiance is another huge factor.  when you walk into this dimly lit establishment, you get the sense of being in a swanky new york lounge like the stone rose.  you don't need to buy a bottle to have a seat. sit anywhere you'd like.  the service is always friendly but don't expect your drink to come out in 10 seconds especially when you're ordering something with fresh fruit or other fresh ingredients.  it takes time to craft a decent cocktail.  \n\ni love the music on thursdays, fridays and most saturdays.  deep house is my music of choice as it lends to friendly conversation and doesn't rape your ear holes.  i've been a huge fan of dcr for a long time and expect to be for a long time to come.  do yourself a favor, ditch the mega clubs on the strip and head on down to downtown cocktail room."
        }, 
        {
            "index": 266, 
            "rating": 3, 
            "review": "I got the Stop, Drop, & Roll cocktail since it sound like an intriguing scotchy drink with a kick. It had scotch, smoked rosemary, honey, and lemon. It was fun to watch the bartender light a fire under a sprig of rosemary, then gently place it into the wine glass. This is the first time ever drinking any scotch-based drink from a wine glass... but I think they did it this way so you get a whiff of the smokiness from the rosemary before you take a sip. Proportion for all the ingredients were a bit off... so it tasted more like a sweet honey lemonade (kind of watered down, too); not what I wanted at all. \n\nMy friend got some kind of whiskey on the rocks per recommendation from the bartender since he didn't know what he wanted. I liked this a lot more. It had a nice kick and left a little buzz in your nose as an after note. We ended up trading drinks haha.\n\nThe environment was great: positive vibes all around. I didn't feel that it was too crowded; it was easy to find a place to sit. The music subtly added to the atmosphere and I caught myself moving along to the beat without thinking about it. \n\nOverall, I was a little disappointed since their cocktails were heavily raved... but my cocktail fell short of expectations."
        }, 
        {
            "index": 267, 
            "rating": 2, 
            "review": "I had heard much about this place and had high expectations. I tried five different cocktails from the list only one was close to balanced. Everything was a bit too sweet or much too sweet. I had much better cocktails and at Noir Bar, Rhumbar and from Lucas at Carne Vida. Of the cocktails I had at Downtown Cocktail Room my favorite would be the Rob Rooigon. The worst was the 318 which was so impossibly sweet. It was pretty much undrinkable. They may have one of the only Kold Drafts in Vegas, but it won't make a bad cocktail good.\n\nI might give it a try again."
        }, 
        {
            "index": 268, 
            "rating": 5, 
            "review": "After all these years living in Vegas I finally made it here. Very chill! Loved it and will return SOON. Drinks were reasonable, DJ and percussion were amazing! The chairs were very worn but that doesn't warrant a negative!"
        }, 
        {
            "index": 269, 
            "rating": 5, 
            "review": "The Death in the Garden is the witch's knees, which is something I just made up to denote extreme tastiness."
        }, 
        {
            "index": 270, 
            "rating": 4, 
            "review": "Nice speakeasy vibe with a very knowledgable bartender who made a mean caipirinha and also knew the proper way to pronounce the Brazilian rum cachaca (unlike the fellow beside me who also ordered one and pronounced it like cha-cha-cha) as well as the subtle differences between the two he had at his disposal (Leblon and Cabana).  \n\nBonus points for having a table alongside the entrance watching newbies through the window fumble around trying to figure out how to enter through the elusive metal door with no handle or label (high unintentional comedy).\n\nMinus one star for having a \"Bartending for Dummies\" book in plain sight next to the liquor rack (pretty sure it was not intentionally placed there to be ironic)"
        }, 
        {
            "index": 271, 
            "rating": 5, 
            "review": "Update: SO amazingly good, I have absolutely no memory of writing this review! Haha.\n\nAwesome. Everything you're hoping for is here. Amazing respite from the tourist bars. True craft cocktails, on par with the best of New York City and Los Angeles. Tell the bartender what you like and watch him create magic for you."
        }, 
        {
            "index": 272, 
            "rating": 5, 
            "review": "Sometimes I get the notion that the real things in Las Vegas stand out so vividly in my mind based solely on their radical departure from the mediocre, flashy, corporate food and drink that dominates the Strip. But you know what, A bar like DCR could stand its own anywhere. Because the drinks here are legit. \n\nI am not a fan of pretense, but I am a fan of a well-made cocktail. And well-made cocktails abound here. Creative concoctions that range from classics to bar-specialties. Served up in well-balanced mixtures from proper glassware in a swank setting. \n\nThere's not a lot to say other than that if you want some truly great cocktails in a stepped up environment that's free from the ultra-flash of the fancy clubs, DCR is your place. Craft-cocktails for discerning palates. And a punchbowl option for groups!"
        }, 
        {
            "index": 273, 
            "rating": 4, 
            "review": "Most fun part about this place is finding the entrance.  This place is a cross between an old speakeasy and a carnival funhouse.  I almost fell over when I first entered the bathroom mirror maze....but it was a fun experience.\n\nThe drinks were good, but all of their drinks were Winter themed at the time I visited.  I would love to see their Spring and Summer menus.  With that said, I was able to lounge on a couch, next to a hidden DJ booth door, and drink out of a brandy snifter.\n\nI am not sure if this place was really cool, or kind of creepy..."
        }, 
        {
            "index": 274, 
            "rating": 4, 
            "review": "The Downtown Cocktail Room is the type of standalone lounge that a few years ago wouldn't have had a chance to thrive in Las Vegas, let alone the Fremont area.  With it's trapdoor entrance, hip young urban professional vibe, and experimental mixology menu, this bar would be much more comfortable in Chicago, NYC, or a number of other cities where places like these are more commonplace.  But perhaps it's the secret location on Las Vegas Blvd. south of Fremont St. that makes this the ultimate 21st Century Vegas speakeasy.  \n\nSelf-park for free at the El Cortez and walk the 2 blocks to D.C.R. and you'll pass some of the bar's equally progressive neighbors - Beauty Bar and The Griffin.  Be prepared for a triumvirate of local places replacing video poker with actual cocktails on the bar, and where being amongst the \"in crowd\" is not precluded by paying $400 for a bottle of vodka and a spot on a love seat.\n\nA collection of couches, chairs, and stools dot the various loose \"sections\" of the room, allowing you to be a part of the masses or in your own little world depending on your needs for the evening.  D.C.R. keeps the lights turned low and the groove & electro tunes turned up, often with live DJ's.  If only there were a hip restaurant in the area to pair this with, date night would be a done deal (Triple George Grill, close enough I guess,)."
        }, 
        {
            "index": 275, 
            "rating": 4, 
            "review": "I found the Downtown Cocktail Room to be a little gem in Downtown (old) Vegas.  Finding it was a little challenging and finding the entrance was even more so, however totally worth it.  \n\nThere are scattered couches and loungers scattered in this little space with minimalist décor.  They specialize in mixology, so have minimal drinks on their menu that change seasonally.  I love little places like this in general, so I was super exciting to try one of their combinations.  \n\nWe tried the Equality Elixir, Lemon punch, and PBR with Jamison.  I was excited about all of them because they are unique to the Downtown Cocktail Room.  They also give each drink a \"level\" which denotes its complexity (think wine complexity).  \n\nIn addition, their drinks were pretty reasonable, which surprised me.  The majority of our drinks were about $10, which for Vegas is cheep.  This is a great place to stop Downtown Vegas, for visitors this is a must."
        }, 
        {
            "index": 276, 
            "rating": 5, 
            "review": "I am excited to go back to DCR for The Chase, a new party hosted by DJ 88. If I hear correctly the music is a kind of disco/hip hop funky, sexy stlye. Although I have not heard DJ 88 yet I have read a short bio and sounds promising. I do love DJ Doug Mixer who dj's at DCR a lot so I am sure I can expect the same quality. Can't wait. I will be writing the review for The Chase soon, so check back."
        }, 
        {
            "index": 277, 
            "rating": 5, 
            "review": "I read about Downtown Cocktail Room on Yelp and just had to check it out. Full disclosure, we went on a Tuesday night and were looking for a chill place to enjoy some mixology over conversation. Our waitress was very helpful in recommending drinks, and everything we tried was delicious and interesting. I got a fruity drink that was almost like a snow cone topped with strawberry slices. I was skeptical at first but all I can say is Yum!  The music was super chill and perfect for a Tuesday night.  Special mention for the doorman who when he saw that my friend walked past the entrance ran out and helped him find the door. Well done sir! Overall I think this is a great place for a relaxing but interesting night out in downtown during a weeknight.  I would be interested in seeing what it's like during peek hours/days as well."
        }, 
        {
            "index": 278, 
            "rating": 5, 
            "review": "Hell yeah- might be the best bar I've ever sat at- droppers and beakers of various elixirs, potions and extracts sure to enhance any libation.  True love and craftsmanship went into each glass that left the bar- perfection.\nAwesome vibe\nChatty bartender\nHip style\nI'm bringing the gang next time.   \nDo yourself a favor and leave the casino bars to the gamblers and get some local flavor."
        }, 
        {
            "index": 279, 
            "rating": 4, 
            "review": "Great great hangout! The music just puts you in a chilled out mood. They have cuddle chaises! I can't wait to go when there DJ is there!"
        }, 
        {
            "index": 280, 
            "rating": 5, 
            "review": "I cannot believe this place exists just a couple of miles from the artifice of the Strip.  It's cool without trying too hard, swanky without pretense, and features a sultry decor just as suitable for cocktails with the girls (or boys) as it is for cuddling on a streamlined chocolate-brown couch and staring into the eyes of a hot date.\n\nIf you've been to Kitsch Bar in Orange County, DCR is like its larger cousin -- amazing cocktails, great music pumped out at a volume that actually encourages conversation, and comfy seating that encourages lingering.  I especially enjoyed the crowd, an eclectic grouping of 20- and 30somethings who appeared perfectly content with themselves rather than preening and posturing like the plastic people at the LAX-type places.  \n\nI almost didn't want to leave...ever...but on to the Griffin we went as our locals bar tour continued..."
        }, 
        {
            "index": 281, 
            "rating": 4, 
            "review": "In the words of George Zimmer: You're gonna like the way you look.  I guarantee it.\n\nEverything's right about this place. (gawd i love when i get to say that...)\nThe cocktails, the staff, the music, the ambiance, the clientele...I could go on...\n\nI'm ok now knowing I wasn't the only one who fumbled my entrance over the door thing...\nits a speakeasy after all..."
        }, 
        {
            "index": 282, 
            "rating": 4, 
            "review": "We stumbled upon this bar as we were walking around. Great decor, modern, chic, soft lighting, and a very friendly staff. They are true mixologist that will make you some pretty cool cocktails. We all ordered something different while I just wanted a good margarita. \n\nMy margarita was made with Patron and who knows what else he put in there but damn it was one of the best margarita's I have ever had. I only wish we could have stayed longer to enjoy the ambiance and reasonably priced drinks. This is where to go for good quality drinks at a good price. Vegas has gotten so high end with most places charging $15 plus for a cocktail. \n\nCheck this place out you will not regret it, we rushed out to get to a show but I would go back for sure."
        }, 
        {
            "index": 283, 
            "rating": 5, 
            "review": "On a night out on the town we began with this distinguished hole in the wall.  The door to Downtown has no handle and is seemingly disguised as an iron wall.  If that doesn't hint speakeasy than I don't know what one is?!  As you venture inside it is not a large venue yet they space it out fine enough.  Dim with a few nooks to intimitize your evening.  We sat at the bar.  Here you can appreciate the craftmanship of the barmen as they add spice, herb & essence with a healthy portion of heft to your specialty cocktail.  The decor is brooding and hip.  There are, at times, dj's playing usually electro house or ambient.  I have not witnessed any pop or hiphop here so it is definitely geared toward a mature late 20's and above crowd.  You find vintage and eclectic drinks here and don't expect to get a real bargain, but you do get what you pay for.  Absinthe in many varieties, refined spirits and a plethora of garnishes.  These bartenders can make you almost any drink and if they can't it isn't available in the city."
        }, 
        {
            "index": 284, 
            "rating": 3, 
            "review": "I work in the cocktail industry and am super impressed by the new spots downtown, it's a real scene and not just another area trying to grab tourist dollars.  \n\nThat being said, I like this bar, the vibe, the music, and the fact they are trying to make proper cocktails.  However, it has \"cocktail\" right there in the name.  Do you see it?  That means cocktails should be pretty extraordinary.\n\nUnfortunately, it's still missing something.  Most of the drinks are over-sweet (probably a side-effect of a town that gives you a big helping of sugar and rum inside of a large plastic yard),   Most of the drinks come off as poorly balanced with one of the ingredients sticking out way too far.\n\nThe real deal-breaker is the fact that they won't list their ingredients on their cocktails.  When I asked why this was, I was told it was because they didn't want their drinks stolen.  \n\nThe humor comes from the fact that the drinks on the menu are mostly fairly well known (such as The Last Word).  \n\nI have an idea, how about you create new drinks and continue to innovate rather than come up with a few cocktails and keep them secret so you can ride the menu for the next two years?  \n\nA true master is not measured on how many students he has, but by how many masters he has created.  Sharing recipes makes everyone better and keeps you innovating.  \n\nThis place is not good enough at drinks (yet) to be this high-and-mighty about their menu.  I look forward to coming back when they're a little more enlightened."
        }, 
        {
            "index": 285, 
            "rating": 4, 
            "review": "One of my faves!  I take people here who come to visit, I recommend it to everyone I know, and the location (right off of Fremont Street) is great fun.\n\nWhat sets this place apart from other lounges is the cocktail list.  You can get your regular old Jack and Coke or Cape Cod, but their cocktail menu changes seasonally.  They use fresh ingredients in their handcrafted cocktails, and I am always anxious to see what's on the newest menu.\n\nAnother cool thing about DCR is the punch bowls.  If you have a bigger party, you can order a punch bowl for about $40.  We went with a group of 5 and each got about 3 drinks out of it and were pretty buzzed!  A great deal and it comes with the cutest little punch cups.\n\nAlso, make sure you have to pee when you go there so that you can use the bathrooms.  The stalls are 2-sided mirrors so you can see everyone while you're in there, but they can't see you!  It's crazy!\n\nCouple of downsides: it's pretty dark in there.  I mean really dark.  Sometimes I wish they would turn up the lights just a little bit.  Also, the dress code isn't consistent.  We've gone in there wearing scruffy clothes and casual shoes before, but one time we were turned away because a friend was wearing sneakers.  Sometimes they let hats in, and sometimes they don't.\n\nAll in all, one of the hippest places in Vegas.  See if you can figure out how to get in the hidden door!"
        }, 
        {
            "index": 286, 
            "rating": 5, 
            "review": "The Downtown Cocktail Room is 100% my style.  I don't care what you want to call them: bar, club, lounge, speakeasy; when I go out to these places I want only a few things.  \n\n1. Good Drinks - DCR delivers a menu of signature cocktails and old favs that are rotated seasonally.\n\n2. Good music - DJ this Saturday was cranking them out the entire time, however, the music was low enough to hold a conversation over.\n\n3. Efficient Service - The waitresses were on top of our entire group throughout the evening.\n\nThe bottom line is the DCR delivered on all fronts and gives me a personal favorite hangout spot downtown.  Don't forget to check out the bathrooms as Suzie mentioned; they're neat."
        }, 
        {
            "index": 287, 
            "rating": 3, 
            "review": "Been here a couple times. The doorway is tricky if you've never been here. When you find the doorway, you have to push on the steel portion to get in. If you stand around, pushing and pulling all parts of the wall in confusion, you'll get in to find the bouncer laughing at your struggle. \n\nIt seems to try to fit into a more prohibition style speakeasy with the difficult entrance, but the interior looks pretty modern and with a pretty intimate setting, low lighting, lots of places to sit and just chill with some friends and drinks. The cocktails are fine, but nothing to write home about. I wouldn't mind coming back as a stop for a couple drinks, as it's a good environment and pretty low-key. But for good drinks, I'd probably stop at a couple bars elsewhere after. I hear the fish bowl is pretty fun though, which I'll probably have to come back and try."
        }, 
        {
            "index": 288, 
            "rating": 5, 
            "review": "OMG!!! Bobby is the BEST bartender downtown!! He's AWESOME! Custom drinks and AMAZING customer service!!! Mona, the server, is AMAZING too!! #ILOVETHISPLACE!!!"
        }, 
        {
            "index": 289, 
            "rating": 5, 
            "review": "I was recommended to this bar by friend at work. He pretty much described what others have said, nice place to bring a lady lol its nice and dark!!! Couches are comfy, its awesome. \n\nThe drinks are a bit expensive, unless you go on happy hour. Expect to pay from $8-$12 a cocktail. Other than that, I still give this place 5 stars :)\n\nI really don't recommend this place for groups..  unless its a group of women lol and if you are a group of guys, and you go in when there's a group of women, then you lucked out lol \n\nI see this place more of a laid back, chill place for a guy bringing that special someone. So that's my tip to the guys!!!"
        }, 
        {
            "index": 290, 
            "rating": 5, 
            "review": "Great drinks crafted perfectly. Only complaint is they allow smoking inside which kills the favors of a great cocktail."
        }, 
        {
            "index": 291, 
            "rating": 3, 
            "review": "Very cool. They have Fernet. However again downtown right off Fremont. I suppose they tried to keep the riffraff out by making the door appear secret however once inside it's pretty cool.\n\nOpen a location on the other side of town in Henderson!"
        }, 
        {
            "index": 292, 
            "rating": 3, 
            "review": "A true mixology bar where the cocktail menu is full of bold flavors to counteract the already bold base liquors like Genever, Mezcal, and Pisco. They even have a numerical scale indicating the wackiness of the ingredients. Of course, we ordered the craziest stuff they had to offer.\n\nAt a 3.5 on their 5 point scale, the \"Duke Silver\" with Scotch, bitters, and apricot wasn't that outrageous and was similar to a dark Manhattan. The \"Dill-iverence\" with aquavit, dill, Spanish vermouth, and pickled garlic garnish tasted like pickle juice. Combining Scandinavian influences to evoke a backwoods \"Deliverance\" was playful and completely deserved the 4.5 wacky rating. But down south, they'd say you're crazy to pay $11 for pickle juice. Both drinks were heavy which didn't inspire us to have a second round.\n\nThe atmosphere was dark and tacky like a strip club. With music supplied by a DJ, there wasn't much of a vibe."
        }, 
        {
            "index": 293, 
            "rating": 4, 
            "review": "Had the pleasure of coming back this past Friday and I absolutely adore this place. Everything about the  rich decor, music, and art give off a hip, but welcoming vibe. We took some friends there who had only experienced the Vegas dance clubs (aka stand in line for hours and pay too much for crappy drinks) and they also love it. Downtown plays the best house music, and it is definitely where the art of the cocktail and conversation rule."
        }, 
        {
            "index": 294, 
            "rating": 4, 
            "review": "My husband and I visited the Downtown Cocktail Room for the first time a couple of months ago.  Another great recommendation from my friend/Office Manager! We'd driven by the place several times and never knew what it was.  Well, it is an absolutely cool bar/lounge with awesome drinks, that's what!\n\nThe \"hidden\" door was hilarious and we shared a good laugh over it with the doorman. Inside, it is very dark, beautiful couches/lounge chairs, lovely bar.  We were seated in the lounge and our server was really fun (and cute).  She explained some of the drinks and answered our questions.  It was a little too dark to read the menu, so she  adjusted the lighting when she saw us struggling.  A DJ was spinning old R&B/neo soul when we arrived, then segwayed into deep house.  It wasn't so loud that we couldn't hold a conversation, and we enjoyed people-watching.\n\nAnd the drinks- yummy! I initially got some sort of strawberry concoction and was seriously trying to eat the fruit out of it after I finished. I then ordered a pineapple mojito (not on the menu), which was good, but not as good as my first drink. Next time, I'll stick to the menu- those guys know what they are doing.\n\nPrices were quite reasonable and less than Strip prices, around $10-$12 each.  I'd definitely go again; it was a fun spot to start the evening."
        }, 
        {
            "index": 295, 
            "rating": 5, 
            "review": "Drinks were strong and flavorful. Service was great. We enjoyed the music.\nSit by the glass windows for added entertainment."
        }, 
        {
            "index": 296, 
            "rating": 4, 
            "review": "We went on a Monday evening and I actually didn't have a problem opening the door. They were playing house music and it was almost empty. Nice dark decor and friendly staff. The drinks were good, I had the Grande Absente, an absinthe drink from France. They only had the front room open, there is additional space in the back."
        }, 
        {
            "index": 297, 
            "rating": 5, 
            "review": "I'm the first to admit that when it comes to Vegas, I usually just rely on the tried and true tourist locations. Confession: I've even eaten at Margaritaville, once. OK fine, several times. \n\nBut I'm trying to improve my ways and get to know the parts of Vegas that the locals frequent. My tour guide Drew A suggested this fantastic, dim little spot downtown where we could get reasonably priced (well, reasonable for Vegas) and beautiful cocktails. I hesitate to say craft cocktails or mixology or any of those other terms that are thrown around too often lately, but at its core these drinks are truly artisan, with interesting ingredients, no overly sweet fillers, and passionate bartenders creating each one. The drinks on the cocktail menu range from $9 to $11, and for about $55, 4-6 people can enjoy one of their punch bowls. Definitely something I'm going to suggest the next time I'm in town with a group! \n\nI'm a big fan of a place that doesn't feel the need to be overly flashy or gimmicky in a city that might be considered one of the flashiest in the world. Props to you guys  - keep up the good work!"
        }, 
        {
            "index": 298, 
            "rating": 4, 
            "review": "Cool little hidden gem close to Fremont street. \n\nTricky to get into, when facing the entry walk to your left and push on that metal thing.  Yup. That is the door. Looked empty from the outside, but there were a few couples inside and people at the bar. Very friendly bartender and waitress. Their drinks are complex and expensive, but worth it. There are numbers next to each drinks that describes it's complexity. I only got to about a 2.5. They have a drink with cheese in it that is a 4.5 so I wouldn't say I am too unadventurous.\n\nI had the Peruvian Starfish which was brandy, muddled blackberries, saffron and something else. It was very rich and complex. I was sad when it was over. It was probably the best drink I have had in a very long time. My husband ordered the Gin Fizz and it was also really yummy. \n\nThis is most definitely a date spot. There is a very sexy vibe going on in here. This combined with a few drinks could lead to a real fun time. Haha!"
        }, 
        {
            "index": 299, 
            "rating": 3, 
            "review": "Very cool place to hangout with friends and a few interesting and unique drinks. The service is great but the cocktails that my friends and I ordered didn't live up to my expectations. The menus are seasonal and at my visit they offered a couple drinks with absinthe...and I learned I am not a fan of absinthe.  And like  other reviews say the door is really one tricky obstacle."
        }, 
        {
            "index": 300, 
            "rating": 1, 
            "review": "My $175 leather jacket was stolen here last night off of my chair literally next to me as we were taking a picture. Management was no help and made no offer to cover my loss.    I would never expect that in a place that charges $15-20 for drinks. DTCR is sketchy, keep your belongings close to you or they might walk away."
        }, 
        {
            "index": 301, 
            "rating": 2, 
            "review": "Disappointed to have such a bad experience here.... It's such a cool spot and I love the ambience but the service is not there.\n\nWe came pretty early on a Friday to start our evening, around 9:30... There weren't too many people in the bar so we grabbed a table with no problems. It was about 10 minutes before someone came over to take our drink order. We ordered three drinks and spent the next 25 minutes waiting. With the amount of customers there, there's no way it should have taken that long for one beer and two cocktails. When our drinks finally came, our server said, \"sorry it took a minute. Your ticket got lost or something, I'm not sure.\" She was very nonchalant and the \"apology\" lacked sincerity. \n\nThat left me kind of annoyed... This place is actually really cool and the DJ was awesome and kept a really chill atmosphere going. But if you're going to make someone wait almost a half an hour for a drink, at least give a sincere apology."
        }, 
        {
            "index": 302, 
            "rating": 4, 
            "review": "The night I visited Downtown Cocktail Room was on the night of my friend's bachelorette party. We began with drinks at Vanguard (http://www.yelp.com/biz/vanguard-lounge-las-vegas-2#hrid:o9wbcXpWZ6Wmilt_zrqsSA) which led to drunken debauchery down Fremont Street with my girlfriends. Prior to that night, I had never set foot in Downtown Cocktail Room, so myself and another friend had to find its entrance -- try doing that in the dark while intoxicated. \n\nAfter a minute or two of pushing on walls and tapping on the windows, one of my friends discovers the entrance. The inside of Downtown Cocktail Room wasn't what I was expecting: Chic and sexy, this bar / lounge is something I'd expect to visit if I were in another major city like Los Angeles. It has a sophisticated air to it. With that being said, perhaps that's why my friend and I couldn't order certain drinks:\n\nMy friend and I: \"I want a B******!\"\nBartender: \"Sorry, we're not that kind of bar.\"\nMy friend and I: \"Uh....\"\n\nApologies for trying to trash up the place! But anyway, I ordered two beverages for myself and the bride-to-be. Unfortunately, I don't recall their names, but they were good, bubbly and sweet alcoholic drinks (that's saying a lot.). What I do recall is that I didn't have to shell out $20 on one drink, but on TWO drinks, and that's including tip. Aside from the reasonably priced drinks, I like how you can actually sit down on couches and have a conversation with friends. This typically isn't something that's easy to do if you're on The Strip, because there are few places that offer that luxury. \n\nWhy head down to The Strip to sip expensive drinks in swanky lounges or bars? Downtown Cocktail Room is much more chill, unpretentious, and the cost of the drinks won't put a huge dent in your wallet."
        }, 
        {
            "index": 303, 
            "rating": 5, 
            "review": "Simply: the best. If you visit town and you miss DCR you missed downtown, the heart of Las Vegas."
        }, 
        {
            "index": 304, 
            "rating": 4, 
            "review": "Checked out DCR for the first time last week before seeing Washed Out at the Beauty Bar.  Thanks to Yelp I was able to actually enter the building while only making a slight fool of myself.   Without this site I probably would have amused the patrons sitting inside for 10-15 minutes instead of the 30 seconds it still took me.   Once inside I had a seat at the bar with my companion and we ordered some fries off the happy hour menu (provided by Uncle Joe's Pizza) and some of the snacks the bar regularly has on hand (wasabi peas and Olives).   Since it was happy hour I decided to try some of their handcrafted original drinks since they're only $7 during HH.   The food showed up before our drinks (more on that later).   The fries were hot, seasoned well and cooked just right.   The Wasabi Peas and Olives tasted as expected but I liked the option of having those as snacks throughout the night.  \n\nI was a little disappointed that some of the drinks I'd seen on their website were seemingly not available as they are seasonal, but I settled for what they did have and started with the Irish Rain Barrel.   It was good but not really my thing (I dont like cucumber and it has cucumber in it, so my fault completely on being an idiot).   Next I had Hemingway Daiquiri, which I thought was very well made, strong and delicious.   I let the bartender know how much I enjoyed it and he recommended I try an Aviation.   I'm all about recommendations from professionals (and conversely, am not too fond of recommendations from nearly anyone else), so I tried it and sure enough found it to be very good.  \n\nAfter a while another friend showed up who was on a completely different wavelength that night and I ended up \"forced\" into a few $5 Jameson shots, which I thought was a fair price.  \n\nAbout the wait:  the bartender when we first arrived seemed a bit overwhelmed with the drink orders he had and was receiving and it did take a long time for him to make our 1st round of drinks (probably 10+ minutes).   He seemed very apologetic and it was clear that he was busy the entire time and not just playing Candy Crush Saga on his phone, so it didn't really bother me too much.   Had I stopped in just for a quick drink though and not planned to spend an hour+ there, I dont think I would have found it a 4-star experience.   Outside of that, I found the service to be extremely friendly and helpful and the drinks fairly priced and strong."
        }, 
        {
            "index": 305, 
            "rating": 5, 
            "review": "Went here and felt like a nerd trying to find where the door was, lol...but once I got in I felt relaxed and not uncomfortable like I would a regular bar or club.  The waitress suggested the Beekeeper and I loved it but the second one I ordered didn't have sugar on the rim and that made me a little sad.  All in all I enjoyed it."
        }, 
        {
            "index": 306, 
            "rating": 5, 
            "review": "Downtown Cocktail Room is THE SH*T; this is a great escape from all the BS associated from the strip and other whack venues in the city. DCR has given me another reason for being a frequent visitor of this part of Las Vegas. I'm quite impressed with the drinks and the atmosphere of DCR. \n\nI hate that I didn't know about DCR sooner! I'm guessing because it's tucked in the corner of Freemont and Las Vegas Blvd, that it didn't catch my eye. But, because of my love for chill lounges with cool atmospheres AND house music, I had to hit this place up. \n\nUpon entering DCR on a Saturday night, we are greeted by a bouncer, who made me feel welcomed right from the get go. While I jokingly tested his bouncer skills by challenging him to check my fiance's and my ID's at the same time, he was personable and sweet as he complimented my fiance and I for being a great pair. :)\n\nInside DCR is probably as dark as the outside night or even darker and the chill sound of jazzy lounge house awaits (think thievery corporation sounding music). I am relieved that they weren't playing the usual club house or electronic music you would find at the clubs on the strip! I am instantly excited and eager to grab a drink so I can settle down in one of their spacious seating areas. \n\nI take a look at their summer menu, which by the way, is very reasonably priced and quite a sophisticated selection, and decide to test a bartender's skills by ordering a drink off the menu. The drink I ordered is a mix of a bloody mary and a margarhita. The bartender asks me to take a sip off his creation and I let him know that I wanted something a bit more on the margarhita side. A little squeeze of the lime and bam! my perfect little drink. \n\nOur cocktail server was real sweet and made sure that we were doing well and that I wasn't too drunk :P. I feel it's rare to find a cocktail server who is not just attentive to the guests BUT at the same time cares about our well being and safety. \n\nAnyway, I love this place! It's so chic and classy that I have to remind myself that I'm in Vegas still because this is nothing like anything you will find on the strip or anywhere else in LV. I think this place is going to be my happy place in LV since lots of places in LV irritate me due to the high saturation of douchieness and whackness in which DCR lacks :)."
        }, 
        {
            "index": 307, 
            "rating": 5, 
            "review": "Good drinks. It appears that they rotate their menu per season. None of the drinks that we ordered are on the menu listed on their site. I just visited in August, maybe they haven't had a chance to update their menu online. It was very good. I like that this bar has some original ingredients that they add to commonly known drinks. They also have a few unique drinks that you will only find here. Another winner in Downtown Vegas."
        }, 
        {
            "index": 308, 
            "rating": 5, 
            "review": "Give Connie a concept and let her go. She can improvise and improve with each iteration. The cocktail menu is excellent; my wife lived the Enchanted Arrow, an original cocktail that comes with a piece if chocolate. Try the cocktail, then taste the chocolate and try the cocktail again. Delicious and dynamic. \n\nI let Connie play with a rye cocktail. The first had a little Campari and Fernet. Delicious, with a slightly bitter finish. I asked her to knock off the bitter finish, and she came back with rye, Benedictine, orange and Angostura bitters. Perfect!"
        }, 
        {
            "index": 309, 
            "rating": 5, 
            "review": "Mixology drinks? Yes please.\n\nSexy house music? Oh Damn.\n\nThis is the place to be. This was my fav place I went to this weekend. I got the pumpkin spice drink. Lord help! I wish there was whipped cream to go on top of that. So many different types of drinks. Good ambiance."
        }, 
        {
            "index": 310, 
            "rating": 5, 
            "review": "If you are a professional who works downtown, the Downtown is the place for you.  The atmophere is laid back.  The speciality drinks are delicious.  I recommend the beekeeper.  While they do not offer food, you can order food from a local place and they will go and get it for you.  They have special events there and don't close it down.  We went last Thursday and it was a mixer.  A gentleman came by and told us it was ladies night and all three of us were given a free drink.\n\nThe bathroom is a little off putting with the see through walls, BUT only for the inside.  I swear that people on the outside cannot see in!"
        }, 
        {
            "index": 311, 
            "rating": 3, 
            "review": "Maybe this place would be awesome if I could find the entrance door!\n\nNO STARS!\n\nUPDATE: \nI found the door! The cocktails were great. Anything that's cucumber flavored that'll get me buzzed has got me roped in for good!\n\nThe waitress was overly attentive, but nice.\n\nI hope you like peeing in front of other people! :D\n\n::update re: michael's note::\nYes, I realize they're two way mirrors, however, if there's any light whatsoever on the other side...you can see. I went in with friends...and you can see. it's weird. sorry."
        }, 
        {
            "index": 312, 
            "rating": 4, 
            "review": "The guys here know their cocktails, there's no doubt about it. Fresh ingredients,  ice crushed down at the bar and taking their time.  The result? A unique drink with a distinctive taste like no other.\n\nThe bar is dark and th music pretty loud at times (I'm gettin old).  It is so close to Freemont Street but you won't find any distressed tourists here, at least they blend in nicely (like me).  \n\nThey also make drinks based on what you like,  just ask em."
        }, 
        {
            "index": 313, 
            "rating": 5, 
            "review": "I loooove this place. Not love. But loooooove.\n\nHere are a few reasons why:\n-Lounge style seating with good music. None of that Rhianna shit.\n-The service is always awesome.\n-The menu has some of the most interesting, diverse, and fun cocktails (even appetizers) I've encountered. Especially in Vegas.\n-The bartenders/mixologists make a mean cocktail! Everything I've ever tried there has been absolutely delicious and aesthetically pleasing. Because who wants a crappy looking cocktail?\n\nThis gem of a bar is located in Downtown Las Vegas and every time I'm in town I stop by as much as possibly. Sometimes twice in one day. Super excited for our next trip!"
        }, 
        {
            "index": 314, 
            "rating": 4, 
            "review": "I finally found a home in Las Vegas away from the strip. \n\nI regularly go to Vegas to visit my folks but avoid going to the strip.\n\nThis place was dark. The music was great, deep house mixed in some classics which was refreshing to hear in the sea of noise(rock & hip hop) you find in every bar. Finally a place where i can relax and enjoy the night as I should be. Its a locals bar so dont expect to pick up on some tourist from Kansas. \n\nIt reminded me so much of the places i use to hang out at home. I cant even find places like it in LA. Great beer list could use a few micro brews or imported taps but im not complaining since they have Absinthe. \n\nBeer and cocktail price is good $5 Stella's and $8 cocktails.\n\nBartenders are friendly. I will definitely be back and bringing friends next time."
        }, 
        {
            "index": 315, 
            "rating": 4, 
            "review": "Love the feel.  Very chill and GREAT cocktails.  Our bartender really knew her cocktails and was a lot of fun to visit with.  This is an ideal location to sit with friends, have a cocktail and relax."
        }, 
        {
            "index": 316, 
            "rating": 5, 
            "review": "If you want an exceptional cocktail experience, head over to Downtown Cocktail Room. With a seasonal menu (they are on their 16th menu to date) DCR is constantly combining innovation, expertise, and passion into your each sipping experience. \n\nThe lounge is beautiful, intimate, and ideal for intimate get-togethers. As someone who takes ultimate appreciation in a well balanced drink, I've undoubtedly found a new place to sip on Pleasure. \n\n\nDowntown Cocktail Room set the bar, and now they are raising it. \nIncredible."
        }, 
        {
            "index": 317, 
            "rating": 2, 
            "review": "I was really excited to try DCL after reading such great reviews.  After going, it really didn't do it for us.  It all seems a little forced.  Too cool, too artsy, too chic...I wasn't a fan.  I had the Sticky Icky cocktail and it should be renamed the Fucking Disgusting because it is undrinkable.  And I'm a drinker! but this drink was SHIT!  My wife had some sort of watermelon/cucumber concoction that was very good however, wish I would have had that instead!  I won't be back to this place, even for happy hour."
        }, 
        {
            "index": 318, 
            "rating": 5, 
            "review": "OK, this is when I started to warm up to Vegas.  Got there right at 4pm as soon as they opened around 4 for their happy hour from 4-8.  The entrance was indeed tricky, you just gotta push the door in.  Found that to be a recurring them at this place, some intentional design mischief.  Loved the music, the decor, the vibe to this place.  It was nice to encounter some real hospitality and be shown a little friendliness.  Bartender is a real artist, takes great pride and care in her work, and the cocktail waitress was very considerate and patient with us and all our questions.  Man, them's some strong dranks son!  I had a Hemingway Daiquiri, then a Manhattan with Bulleit Bourbon and then another Manhattan with Bulleit Rye and gotta say, liked the Rye even better, smoother.  So, think for seven drinks, bill came to around 75 bucks and that's one hell of a bargain for the quality and lethality of them R drinks.  Some folks started rolling in, as we were leaving to hit Fremont Street.  Nice to get away from the polish and pace of the strip and check out another area.  Only bad thing was getting ripped off by the cab driver, folks always carry some change with you so that they don't tell you they can't make change for larger bills.  Umm hmm, that's how they get ya."
        }, 
        {
            "index": 319, 
            "rating": 4, 
            "review": "Dark, intimate, legit drinks without the snippy attitude. Happy hour is awesome...drink it up!"
        }, 
        {
            "index": 320, 
            "rating": 5, 
            "review": "This is the genesis of Downtown Las Vegas's revival and hipster buildout.   Michael Corthwaite the owner, was the visionary on Fremont east district and started the bar scene there. Great news is he has created an old fashion cocktail joint, with plush chairs, large group sitting areas and a happening little bar, its a small intimate place, but its perfect.  Perfect for drinks!  Its a cocktail room, get some!   Its delish, they know how to do some fancy cocktails there.  Warning: Watch the door, its a trick, can you figure it out?  Speak easy and drink easy downtown!  5 STAR STUFF"
        }, 
        {
            "index": 321, 
            "rating": 5, 
            "review": "Honestly I have been a bartender for a long time and been to lots of different cocktail bars and I have to say, Downtown Cocktail Room is instantly a new favorite of mine!! Once you walk in through the hidden entrance the whole speakeasy concept just sets the atmosphere right, then you sit at a bar that seems to be designed to beautifully highlight the bartender instead of a distraction of bottles piled high on the wall like most bars. The bartender we had was AMAZING!! I believe her name was Connie. It was like she took our hand and walked us through a night of amazing cocktails. Some off of the menu and others just off the top of her head that were incredible!! I highly recommend this bar and will definitely be visiting soon!! \n\nMatt"
        }, 
        {
            "index": 322, 
            "rating": 4, 
            "review": "I've been here a couple of times now and have enjoyed both experiences. This is a sort of hidden bar downtown. It's small, it's dark and they make specialty cocktails that take like 10 mins (totally exaggerating) to make and require a ton of ingredients.\n\nIt's a great place to start an evening out at. The cocktails I have tried have all been good. And compared to the strip, the price is great. Like fancy drinks for less than $20. Whaaa?!?! \n\nThe bartenders take the time to explain and recommend cocktails, and they seem to take pride in what they do. It's cool.\n\nOh, and I love the women's restroom. One-sided mirrors, so when you're sitting on the John you can watch the girls outside of your stall adjusting their hair and make-up. Haha... it's funny."
        }, 
        {
            "index": 323, 
            "rating": 5, 
            "review": "it really never disappoints. the prices are reasonable considering you are getting craft cocktail so it might be a few minutes. The drinks range from $9-$15 so defiantly worth it. They are tasty!\nthe menu changes each season! Music is not loud so you can carry a nice conversation. The seating is elegant and intimate. \nDefinitely a must go for a date."
        }, 
        {
            "index": 324, 
            "rating": 2, 
            "review": "Whiskey cocktail was good. Our other drink had several fruit flies in it. Sent it back. Second time around it had fruit flies again. I guess don't order anything with fruit in it and you'll be fine."
        }, 
        {
            "index": 325, 
            "rating": 5, 
            "review": "Downtown is always a must when on Fremont. The upscale feel, original drink concoctions, best staff, and the how do I get in here door separate this place from the rest. \n\nDo yourself a favor and order a punch bowl, the celebration punch (winter menu) is the best! Two options: small or large ranging from $54-104 but with enough people it comes down to maybe $10 a person and a priceless buzz! The small serves around 6-8 people generously and the large 10-15, sorry 9th person. \n\nThe main bar tender I always see is Jeff (ponytail, can't miss him) He's so friendly and takes pride in his art. I ordered a drink and he asked if I liked it, I said I didn't, my fault for not likening Guinness or tequila yet ordering it anyway, he remade the drink for me at no additional cost and was focused on every guest's experience. Also, Leeza is a great hostess! Tip her well! \n\n\nLive DJ plays Wednesday thru Saturday. If you want an idea of the chill music, look up plej pandora station and enjoy!"
        }, 
        {
            "index": 326, 
            "rating": 5, 
            "review": "Still the best bar in Vegas, 2 years later. Mixology, class, and good fucking times. If you come here later, during club time, maybe pass it up. But when it is slow, it is heaven. Kevin is bad ass."
        }, 
        {
            "index": 327, 
            "rating": 5, 
            "review": "This place is the bomb-diggity....makes you forget you're in Vegas. I would like to keep it to myself but i'm a sharing kinda gal. Always cool, vibe music and great drinks. The hard part is figuring how to get in the place!"
        }, 
        {
            "index": 328, 
            "rating": 5, 
            "review": "Great spot!!!!  I was shocked this was downtown, Ill be back here for certain.  Prices were a little steep but the cocktails were the best on the street"
        }, 
        {
            "index": 329, 
            "rating": 5, 
            "review": "If I had to choose a favorite bar in downtown Vegas, DCR would be it. Unique cocktails that you won't find anywhere else which change often with a few favorites available, Absinthe drinks, some craft beers, and your standard well drinks. \n\nThe entrance is hard to find. It's funny to see people who have never been here figure out how to enter, cool bathrooms where it gives the illusion people can see you on the toilet (they can't, I've tested it out with my friend), a small, intimate, sexy, dark lounge atmosphere with a DJ usually playing house music. It's a good spot for locals and your out-of-town friends.\n\nTip: Bring a jacket. It's always cold here!"
        }, 
        {
            "index": 330, 
            "rating": 5, 
            "review": "Still love it. The drink menu is kept fresh which is nice. There is nothing worse than going somewhere you really like but getting bored with the drinks. I like the creativity and imagination of the bartenders. Definitely growing in popularity."
        }, 
        {
            "index": 331, 
            "rating": 4, 
            "review": "Great local's spot for cool and interesting cocktails, and it's the perfect way to leave the madness of \"The Fremont Street Experience\" behind.  Plus, happy hour meant the drinks were only $7 each - woo hoo!  I had the Pumpkin Spice cocktail - a delicious bourbon beverage, and it was ridiculously good. My entire party were all raving about how tasty all their different cocktails were, also.\n\nFinal thought - PUSH the front door (which is located to the side) to get in, otherwise everyone inside will mock you. :)"
        }, 
        {
            "index": 332, 
            "rating": 5, 
            "review": "Davey has served us twice on our visits to the cocktail room and he has always met us with professionalism and expertise! on our second visit we tried absinthe for the first time and his recommendation was superb. as a fan of craft cocktails, he has exceeded our expectations every time. he is very knowledgeable of his menu as well as spirits outside of the establishments menu. we will definitely be back to see him because he has always provided exceptional service! the drinks are seasoned as we noticed a change in menu. however, their drinks are always eccentric so ordering seems to never be an issue (besides the fact that I would order almost every one! lol)!"
        }, 
        {
            "index": 333, 
            "rating": 5, 
            "review": "A welcome break from the Vegasiness of Vegas. Excellent, reasonably priced cocktails. Thank you for being a highlight of our vacation!"
        }, 
        {
            "index": 334, 
            "rating": 4, 
            "review": "Great vibe with a rotating cocktail list!\nVery attentive service staff and there wasn't much of a wait for the drinks at all. Very good impression, I'll have to stop by on all my Vegas trips!"
        }, 
        {
            "index": 335, 
            "rating": 4, 
            "review": "umm it was nice just not for me so much my wife wanted a nice coctail and she found this place via yelp and she had to try it ....so we came ....found the door(harder than it sounds) and had a few not bad priced drinks from the friendly staff!"
        }, 
        {
            "index": 336, 
            "rating": 5, 
            "review": "A wonderful rare gem in downtown Las Vegas, recommended by the staff at The Beat coffeehouse. Dark, warm. romantic ambiance with very talented bartender. Drinks are incredibly creative and tasty."
        }, 
        {
            "index": 337, 
            "rating": 4, 
            "review": "This a fairly new place, situated near East Fremont Street and Las Vegas Blvd., across the street from Hennessey's.  I went there during a recent First Friday, which is a big street festival in the Downtown Arts District.  \n\nIt's very nondescript on the outside, but this place was jammin' on the inside. Got busier as the night wore on.  Bartenders were friendly, and I tried one of their specialty cocktails from their menu...something that the bartender described as \"liquid pumpkin pie\" because it was pumpkin-flavored.  I liked it.\n\nThey had a DJ that night spinning r&b-type grooves; a sax player jammed along and walked through the crowd.  Lots of 20-somethings seem to like this place. I like it too.  I'll be back...\n\nOh yeah, and the doorman got a good laugh when we tried to get in through the \"hidden\" door."
        }, 
        {
            "index": 338, 
            "rating": 5, 
            "review": "The 5 star rating is not only based on this bar being comfortable and interesting but our bartender was maybe the best one I have met in Vegas. Kevin is incredibly knowledgable when it comes to specialty drinks and indulged our curiosity more than he needed to. Hands down one of the most informed Absinthe bartender in the US. He made this experience perfect."
        }, 
        {
            "index": 339, 
            "rating": 4, 
            "review": "I'm amazed to have found you considering how vague of a description I received. \n\n\"stand on the corner in downtown, and you will see a small sign that says cocktails.. I think.\"\n\nWell, I didn't find you. I gave up and proceeded with my entourage to enjoy the shenanigans found in DT LV. Then waiting for the light to turn green, I see the sign. Downtown. A neon lit picture of a cocktail. This MUST be the place!\n\nWe scope it out, and sure enough, craft cocktails have been found. I proceeded to order items not on the menu because I'm a pain in the ass like that. The bartender did a fair job of making all three drinks and we enjoyed the lounge area around the back. Next time, I will try some of your house cocktails - I promise!"
        }, 
        {
            "index": 340, 
            "rating": 4, 
            "review": "Part of the allure of the Downtown Cocktail Room is idea of finding your way into a semi-secret bar (which is well publicized by us on Yelp).  I just wish they hadn't put a neon cocktail sign out in front as a clue.  \n\nSince I'm a pretty crafty person (not in a paint by numbers kind of way, but in a Mission Impossible kind of way) it took about 2 seconds to bust my way into this cocktail joint.  Frankly, I wanted more of a challenge.  Downtown Cocktail Room, you made it too frickin easy.  Had you been a real speakeasy, the prohibition squad would have shut you down on day one.  You know how it would have went down ......\n\nSIRENS\nCHERRY TOPS\nBLUE SUITED FLAT FOOTS\nBILLY CLUBS, SAPS & CUFFS\nSOMEBODY SCREAMS\nSLAMMER TIME \n\nCut to:\n\nThe here and now -\n\nOnce inside, you find a cozy bar, which is dimly lit.  It's the kind of place where you could literally fade into the background if you just didn't move.  \"Boo! ... Sorry for being creepy and making you spill your drink\" ....  It also reminded me a lot of the Saints & Sinners Bar of Culver City, which is now closed (but the memory lives on courtesy of the Yelp archives).   \n\nSince this was our first stop on a Friday night, I was pleased to find the place relatively quiet (at 8:00 p.m.) and with available stools to land at the counter bar.  Known for their designer cocktails, the mixologist didn't disappoint.  Disclaimer:  For me, just breaking out the shaker, means I'm getting a fancy drink.  The prices were good and I was pleased with the vibe of the place.  Since it was a little early in the evening, there wasn't too much hustle and bustle.  \n\nAt the time, it was a nice respite from things to come on Fremont Street.  A place to get things started with a couple of drinks and get up to speed.  Yes, there's a system to the consumption of adult beverages, especially when you know you'll soon be switching to 40 ounce Modelo Especial beers and exchanging high fives with random homeless people watching an AC/DC tribute band play at the 3rd Street stage.\n\nEarly in the night, Downtown Cocktail Room is a nice place to chill and enjoy a couple of drinks.  Later on, I'm sure the place picks up the pace.  Stop here to test your orienteering skills (without cheating to research a point of entry online) and to enjoy a well crafted cocktail.\n\nTIP - If you make it out onto Fremont Street, DO exchange some enthusiastic high fives with strangers, but remember to generously apply hand sanitizer immediately afterward (but in a covert way).  Cheers!"
        }, 
        {
            "index": 341, 
            "rating": 5, 
            "review": "A W E S O M E little gem of a cocktail room here.  I loved their menu of original drinks, which I hear are changed seasonally.  We will definitely be visiting again on our next trip to Vegas!"
        }, 
        {
            "index": 342, 
            "rating": 3, 
            "review": "I had a blast here last week! Had a little too much to drink and most likely left my Debit card there... But I wouldn't know for sure because they haven't answered their phone once in the 15 times I have called. I have called every day, and even left a message..."
        }, 
        {
            "index": 343, 
            "rating": 5, 
            "review": "This is the most chill bar in vegas with the BEST drinks!!! so unique . every time i go out for some reason i find myself at this place. nothing else compares.  House music all night , nice atmosphere , dark , no pretentious losers . Dark and Stormy is amazing!"
        }, 
        {
            "index": 344, 
            "rating": 4, 
            "review": "DTC is about as hidden as a place can be on the corner of Fremont and the boulevard, but is definitely worth stopping in.  Hint:  the door isn't made of glass.  I actually thought the place was closed because I tried to open a glass door that didn't exist.\n\nI liked the feel of the place instantly ... not too cold, dark without being 70s cheesy, friendly bouncers and staff.  After finding out it wasn't pink or red, I had an Irish Rain Barrel (?).  Very nice drink, kind of tasted just the right amount of sour and cucumber (which sounds weird but it worked).\n\nBartenders weren't busy yet, it was still early, so they were attentive and fun to chat with, even offered helpful hints on mixing and stuff.  It's always cool to hear experts talk about what they're good at, especially if they're good people.\n\nOther clientele were interesting and fun.  Not too many women but again, it was early.\n\nCould only stay for one drink and it was only about 9:00 but I had to get up at 7:00 the next morning, but will definitely get back there soon on another cocktail tour!"
        }, 
        {
            "index": 345, 
            "rating": 5, 
            "review": "The girlfriend and I closed out our impromptu Tuesday night bar crawl at Downtown Cocktail Room.  We had been to DCR once before a year prior and had left thinking that the drinks were good and obviously well made by talented bartenders.  However, as enjoyable as our drinks were, my selections from the Fall cocktail menu were a bit sweeter than I prefer my drinks to be.  However, upon coming back to Vegas, it was a no-brainer to hit DCR again.  I was not disappointed.  \n\nStepping into the dimly lit, relaxed bar, if felt a bit like déjà vu in a good way as our very skilled bartender, Kevin, was the very same bartender who served us on our previous visit.  I started with the Orthodox Caveman ($11) made with Zucca Amaro, Cachaca, Scotch, and an unspecified apertif and unidentified bitters.  I should've asked.  It was boozy without any cloying sugariness, just a hint sweetness most likely from the amaro and apertif.  It was a balanced, complex and outstanding.  Next, I ordered the Black Widow ($10), although the Orthodox Caveman was a tough act to follow.  It consisted of Meletti Amaro, Cynar, Infused Vermouth, and Mole bitters, which combined in potent, tasty way.  Like the Orthodox Caveman, the Black Widow possessed only passing sweetness.  Most importantly, it was satisfying.  \n\nOn this night, I gained a much deeper appreciation for DCR's well-conceived, precisely executed cocktails.  DCR stands tall as perhaps Vegas' top purveyor of craft cocktails."
        }
    ]
}