{
    "category": "Las-Vegas", 
    "entity": "Sushi-Twister", 
    "avg_rating_stars": 4.1186868686868685, 
    "review_count": 396, 
    "reviews": [
        {
            "index": 1, 
            "rating": 5, 
            "review": "We are sushi twister regulars. This is one of the best sushi places in Las Vegas. We usually don't go anywhere else. \n\nI usually do the AYCE. I love the nigiri. Yellowtail, tuna, garlic tuna, salmon, eel, shrimp, white tuna and twister scallop. \n\nAYCE includes hot and cold appetizers, full or half rolls (you choose) and dessert. Make sure to get a stamp card! \n\nMust tries: Screaming Orgasm, Japanese lasagna, kill samurai.\n\nMy wife usually does the chicken dinner. It's a great a great value for the size. Comes with veggie and shrimp tempura, salad, rice, miso, California roll (you can upgrade to any other roll), miso, and of course Teri chicken."
        }, 
        {
            "index": 2, 
            "rating": 5, 
            "review": "Over-all this is the best sushi spot in vegas by all means!! My hubby and I will never change we love this place! Reason for it is that the quality and flavor is over the top. If you like sausy sushi like we do  then this is the place!! They have many different kindas and the japanese sauce is amazing!! This place I recommend to everyone to at least try it's worth the price!!"
        }, 
        {
            "index": 3, 
            "rating": 4, 
            "review": "I thought I was addicted to Sushi Mon\n\nI cheated and went here because it is closer to my apartment.\n\nAddict.\nSo good. \n\nThat is all."
        }, 
        {
            "index": 4, 
            "rating": 5, 
            "review": "We came here on a Saturday night, around 9ish, and ordered 2 AYCE for $68ish (dinner buffet is 28)\n\n- Next to starbucks. Near Eastside Cannery Casino.\n- Easy parking. Great timing. No wait. Seated right away. \n- Sit at bar for faster sushi service. \n- For appetizers, order from waitress. \n- Friendly waitress. She actually told us she doesn't mind if you don't eat all your rice. Just try your best. haha! \n- Amazing sushi chef! We had the legit old Japanese guy. \n- My method of attack:\n1. Get all the items with a happy face on it. That means that they are expensive and limit one per person.\n2. Get the items with the moon icon for dinner only. \n3. Look for the most expensive rolls. \n4. Save room for the mochi. \n- My recommendations unique to Twister \n1. Island tuna poki: good side with sushi\n2. Screaming orgasm: great appetizer\n3. Salmon loves lemon: for salmon sashimi lovers\n4. Spider-Man: for soft shell crab lovers\n5. Rum jungle: Great japanese salsa taste\n- Only AYCE that I've been to where you can get 1/2 a roll! Great for selection. \n- Compared to Goyemon, you can't get grilled fishes here. \n- Come for the unique sushi selection."
        }, 
        {
            "index": 5, 
            "rating": 3, 
            "review": "Everything was awesome except the food. It wasn't bad, it was just \"eh\"."
        }, 
        {
            "index": 6, 
            "rating": 2, 
            "review": "This place is close to home but I would still go out of my way to get better sushi. After reading reviews we thought this place would be a lot better quality than what we received. Granted everyone raves about their fresh fish that wasn't the case for us. \n\nWe weren't extremely hungry to do AYCE so we opted for a combo plate which had a lot of food on it. Large portion of Teri chicken, veggie tempura, salad and a California roll. For $9 this was a good deal for all the food we recieved. I ordered a San Francisco fire roll but asked for it to be tempura fries with eel sauce. My guy also ordered an order of smelt egg nigiri and I ordered an order of Garlic tuna nigiri. Both of which were not fresh. We alps recieved a salmon loves lemon roll which we did not order but we ate anyway and that was also pretty good. \n\nService was alright and the nigiri should have been fresh,but I would drive elsewhere for sushi even though it's convienently located close to my home. \n\nDon't forget that yelp hours are not correct. They close at 10 not 11!"
        }, 
        {
            "index": 7, 
            "rating": 5, 
            "review": "One of the top sushi places in town. I mostly like to eat their salmon and seared tuna nigiri. Love their red bean ice cream, too.\n\nFor big parties (since everytime I'm here, it's with a big party of 6+), they will do split checks. Ask for the stamp card so that you get a stamp for each person and get the 10th ayce free.\n\nUnlike some places, they will do half rolls, but not on everything. They only have two types of mochi ice cream (and it's one per person) of mango and strawberry. For their unlimited ice cream, they only have green tea and red bean. I wish they had chocolate of either :(.\n\nEach time, I'm pretty happy with their service so that's a plus. Pretty consistent, too. The only reason why I wouldn't come here as often would be because of its location. So far away from me :(. If you're in the area, DROP BY FOR SOME SUSHI!"
        }, 
        {
            "index": 8, 
            "rating": 4, 
            "review": "I can only comment on their takeout lunch specials.  I usually get the seafood poki bowl.  It is an assorted dish of fish such as salmon and tuna on a bed of rice and seaweed.  The types of fish they put in your bowl may vary, but I've always noticed salmon was always in my order.  \nThe portion is quite generous. Not bad for $8.38! I like the container it comes in. The presentation is pretty nice.\n\nThe beef lunch special is not bad either. It says on the menu it's a Kobe style filet mignon chip beef.  For $8.50 you can't go wrong.  \n\nService is great.  The waitresses always let you check your food before they bag it up.\n\nI have yet to try their AYCE!"
        }, 
        {
            "index": 9, 
            "rating": 5, 
            "review": "Fantastic AYCE, been here many times since moving to vegas. My favorite sushi place by far."
        }, 
        {
            "index": 10, 
            "rating": 4, 
            "review": "We got plans tonight, UH playing football and we are wanting some good food to enjoy while we watch the game.  So what better than some sushi!   We called ahead and ordered a tray of sushi.  When we arrived, the hostess notified the guys that we were there for the pick up and it took about ten minutes to complete.  \n\nOnce home, we looked it over and found they provided three big wallops of wasabi and pickled ginger.  And we loved the spicy tuna, the caterpillar roil and the dragon.  It was a great mix, the ahi was pink and fresh.  Definitely a good choice."
        }, 
        {
            "index": 11, 
            "rating": 4, 
            "review": "The service is great. The food is wonderful. I have been here many times and keep returning because it's all around a good experience."
        }, 
        {
            "index": 12, 
            "rating": 5, 
            "review": "Go to place on the eastside, i always sit at the bar. The sushi chefs always talk to us and staff always attentive. Oh my god roll is a must! I've never had a bad experience there..and water refills when i dont even ask for one"
        }, 
        {
            "index": 13, 
            "rating": 3, 
            "review": "Kind of disappointed with take out sushi order recently.  Ordered the 44 piece nigiri sushi and roll plate to go, pieces were very small, about the size of a child's thumb.  Looked like the plate was made for children, rather than adults.  Always have had the bento box when eating in and it is the best.  Buyer beware, I wouldn't order any more takeout, only eat in from now on."
        }, 
        {
            "index": 14, 
            "rating": 4, 
            "review": "This is the best sushi joint if you live east of Eastern or anywhere on the east side in Las Vegas.  I've ate here over 30 times, 3 stamp cards to prove it.  And every time I dine here it is fresh.  I almost always order all you can eat.  \n\nBut if I don't  then I'll order one of their lunch/dinner teriyaki plates (chicken, beef, salmon, etc.)  I like ordering the dish with the teriyaki on the side and adding it to my protein in the amount I want.  The staff has expanded since this place has become really popular.  They are all nice and friendly.  The bar and tables are always clean and the sushi masstttaasss behind the counter always bid you farewell.  If they're not busy making bomb diggity bomb sushi!\n\nI love any type of nigiri, they do have special sushi rolls too.  Crunchy Roll is one of my fav but I really love me a lot of nigiri.  They have specials too, just look up on a wooden board on the wall.  They have a projection screen, a wide screen but not necessary.  \n\nI wish this place had not gotten popular so I can keep it to myself!"
        }, 
        {
            "index": 15, 
            "rating": 4, 
            "review": "Went for  the first time today. If the food is bad, it sure fooled a lot of people because people kept coming and coming and eating lots. We had the AYCE and it worked out great because most of the rolls can be ordered as a \"half\" roll and it allows you to try more different orders. We did notice that each item had its own taste. Sometimes when eating sushi, everything ends up tasting the same. Chefs were great but had to remind the waitresses several times about things ordered thru them (. Eg: soup, salad, drinks) not a big issue!  It reminds me of the small eateries that you would find outside of the city. Like those small family places that you find In the country or provinces. Like Arnold said, I'LL BE BACK!"
        }, 
        {
            "index": 16, 
            "rating": 4, 
            "review": "i'm not that big of a sushi snob to know what is the best sushi place but all of the rolls i had here were very good. The service was outstanding. Our server was at the table evey couple of minutes either taking our order, filling our drinks or bringing more rolls. The AYCE was well worth the price. They had a Monday Night Football special that I overlooked but seemed like a great deal. I would definately return here. Very Friendly Staff, always helps your dinning experience!!"
        }, 
        {
            "index": 17, 
            "rating": 4, 
            "review": "Super fast service and yummy food.\nThey always can get you seated quickly \nand the house green salad is delicious!"
        }, 
        {
            "index": 18, 
            "rating": 2, 
            "review": "I have been coming to this place for over 6 years now and it used to be one of my top 3 favorite AYCE in town. A lot of them have lower quality fish but not twister, that combined with the fact that the sushi chefs are friendly and generous and their 13 meals and get one free promotion, they had me sold. I've eaten here for free many, many, times. Recently though, even I have to admit their standards are falling. Now they have added new items to the menu, superwhite comes to mind, (it was good) and the ninja and angry ninja are still superb, but we ordered the spiderman, and it was not right. Came out as a completely different roll than ever before.. weird, pretty good, but still weird. So we ordered another one to see if maybe they changed the recipe, this one was different than any roll we'd ever had before.. still pretty good but what the hell were they serving us. Not being nit-picky but its pretty bad if the customers know the rolls better than the staff.. One of my favorite things to eat there is the monkey ball, I usually order 3 or 4 to myself but the sauce on these tasted so burnt and not sweet at all that it made them horrible, we barely finished one between us. The service wasn't great this time either as there were more staff in the restaurant than customers and we still couldn't get served/our order taken in a timely fashion. This coupled with the fact that when the guy combined my stamps from different cards he took all 8 off of cards with very long expirations and put them all on a card that had one stamp with a very close expiration. When I returned a week and a half later to claim it they told me I was a week late and most of the cards that I had their expiration was over 6 months away. Looks like they are trying to cut some corners and save some money but I think all that it is doing is driving long term customers away. I mean their fryer wasn't even to temp and all the fried things took forever and came out almost white instead of Golden Brown like they should be. For many years I would have given this place a 5 stars rating but no longer unless they clean up their act they may be another Vegas sushi casualty, especially when there are many better places now that are closer than the 45 mins it takes to drive to twister. It breaks my heart to write this review but maybe it will inspire them to go back to the place they used to be, or head someone away from a bad experience and into a good one. I can hope at least.."
        }, 
        {
            "index": 19, 
            "rating": 5, 
            "review": "Ayce, amazing! Dead Dragon and Magic Mountain were awesome"
        }, 
        {
            "index": 20, 
            "rating": 4, 
            "review": "This place is great! I was kinda skeptical because of the location but it turned out to be one of best AYCE sushi places in town. Orders come out fast for how busy it usually is. They have a big menu so order half rolls if you want to try a bunch of different rolls. The ahi poke is a really good starter. Don't forget to get a stamp card if you plan on going back."
        }, 
        {
            "index": 21, 
            "rating": 4, 
            "review": "MhhHhhhh they have a sushi roll called OH MAH GOD! and LITERALLY your like OMG!!!"
        }, 
        {
            "index": 22, 
            "rating": 4, 
            "review": "I am fortunate to have this place near my house. I ordered three rolls for myself to go along with a Chicken Teriyaki bowl (ToGo special). San Francisco Fire was very tasty and costs less than a store bought California Roll. With the cut rolls at these great prices, I cannot see myself picking up any grocery store rolls any time soon. Even a simple roll like Spicy Crab had great irresistible flavor. Great food, lots of choices. I could eat there every day."
        }, 
        {
            "index": 23, 
            "rating": 3, 
            "review": "The sushi here is pretty decent, nothing amazing but nothing horrible.  It's a little pricey for what the quality is, and the 2 times i have been here the service has been horrible."
        }, 
        {
            "index": 24, 
            "rating": 5, 
            "review": "Great place for a meal rice,salad, miso, california rolls, kobe or salmon or tempura all fresh made and reasonably priced. And of course expertly made sushi."
        }, 
        {
            "index": 25, 
            "rating": 4, 
            "review": "This is our usual sushi place. We were trying to find a regular sushi place when we first moved here. We even went as far as the west side to try some places! (we live on the east side, near the AFB) \n\nWe love this place. Sometimes it will be pretty busy, but it's worth the wait. A few of the wait staff recognize us since we would come here almost every Friday. They have a good variety of rolls and it tastes good so I think it's fantastic. :) \n\nA big bonus to this restaurant is that you can order half rolls! I love LOVE that because sometimes I could eat more, but might not be able to finish a full roll. It also gives me a chance to try a new roll if I'm on the fence about it. \n\nI'm not familiar with the All You Can Eat. It'd be a waste of our money because we get full after one or two rolls. \n\nWe love this place and are glad that we found a good place not too far from our apt."
        }, 
        {
            "index": 26, 
            "rating": 3, 
            "review": "Havent been here..YET. just wanted to add it. I did eat some of their sushi while at a picnic...and it was good. I'll go in there, and update this review soon."
        }, 
        {
            "index": 27, 
            "rating": 4, 
            "review": "I came here last night for the first time and had all-you-can-eat.  First, it was pretty packed -- the wait was about 20-30 minutes around 9:00 PM for a group of 6 -- but the wait was worth it.\n\nI ordered the rainbow, volcano, and salmon loves lemon rolls and the screaming orgasm appetizer.  The screaming orgasm came out first, it was presented differently than I've seen at most sushi bars, but the \"ecstasy\" sauce was the best part of it.  There is a one-order limit on these, so I'd suggest if you're going with a big group and you want more than one to have everyone in the group order one, whether they want it or not to get the most out of it. \n\nThe rainbow and salmon loves lemon rolls came out together.  No complaints there.  The rainbow is a pretty generic roll, so it's hard to mess up, but the fish all tasted great and fresh.  The salmon loves lemon roll reminds me of a roll at Sushi Factory East (can't remember what it's called, maybe the LA Boxing roll?).  Anyway, I liked the thin slice of lemon on top, it added an interesting flavor to the salmon and california roll underneath. \n\nThe volcano roll came out last and it was pretty much perfect -- not too much yum yum sauce, but enough to get the flavor.  I also love the baked scallops on top.\n\nI also tried pieces of the Mexican and Rum Jungle rolls.  The Mexican roll was tasty and just the right amount of spicy; the Rum Jungle roll, on the other hand, was good, except for the Japanese \"salsa\" on top.  I'd probably get it without the salsa next time. \n\nFor dessert, I had the mango mochi, which was nothing special, but good.  There is a one-order limit on the mochi and only two flavors (mango and strawberry), but the green tea and red bean ice cream is unlimited.\n\nThe AYCE dinner was $26.95 and there was an automatic gratuity of 18% for our group of 6.  They also have a punch card, where if you eat there 10 times you get 1 free. \n\nThe service was better than most sushi places I've been to, so that was a plus.  They were pretty attentive and usually came by pretty frequently so that we could order more rolls on a steady basis.  Overall, I liked this place, but I most likely will not return unless I'm in the area."
        }, 
        {
            "index": 28, 
            "rating": 4, 
            "review": "New to the area, we sought out a sushi place on Yelp and we were very satisfied!  This place is small, like... 10 tables and a very long bar area.  Groovy music entertained us that we both enjoyed; they have a large projection TV going on one of the walls.  The tables are 2 top and 4 top, every other one.  Be prepared for shoulder to shoulder seating and the possibility of introductions!  They tried to place us at a 2 top table, but we insisted on the extra room for the 4.  Paul said it was the best sushi he's ever had!  Me not being a sushi fan, I found other delights and was very satisfied!  I loved the cooked salmon dinner and shrimp tempura!  In fact, I ordered two servings of the shrimp tempura!  Amazing...  Enjoy this great find!  We did!  I'm giving it 4 stars due to the lack of room.  Expand - give us some privacy while we eat your delicious food!"
        }, 
        {
            "index": 29, 
            "rating": 5, 
            "review": "My favorite sushi spot! I got here all the time. I even have a stamp card for all you can eat. Spiderman, boulder crunchy and angry ninja are my favorite rolls. Baked mussels, fired calamari, shrimp tempura and green tea Ice cream! Yum!"
        }, 
        {
            "index": 30, 
            "rating": 4, 
            "review": "Its not Nobu or Sushi + Sake or I Love Sushi but if you are looking for a great value, some fun, creative sushi rolls, AYCE, and a pretty cool atmoshere with a big screen TV and great music, this is a good find.   We stumbled upon this driving by Boulder Hwy one night and now we are there 1 -2 times monthly.   The service is great and the food is very good...even the cooked stuff is worth trying.   Glad to see it getting props on Yelp.  It's been more crowded lately.  I'm sure this is one of the reasons why."
        }, 
        {
            "index": 31, 
            "rating": 5, 
            "review": "This has been a consistently awesome eatery for years.  I have probably eaten here 30 or 40 times in the last 10 years and have yet to have anything to complain about.  The owners are very nice people and still work here.  I think I have always had the all you can eat lunch special.  The miso soup usually arrives in a minute or two after ordering.  I like the call a doctor roll that is shown as spicy level 5 but really it has the habanero and jalapeno sauce on the side so you can control the heat. The salmon love lemon roll is also a favorite item. The nigiri is always flawless with just the right amount of wasabi.\nI have tried a lot if sushi restaurants in this town and have not encountered the consistent goodness of Sushi Twister."
        }, 
        {
            "index": 32, 
            "rating": 4, 
            "review": "One of my regular go-to sushi places here in Vegas. The freshness and quality of the fish are consistent so I never worry about eating anything that's gone bad or too fishy tasting. Rolls are also great. There's a favorite that I get every visit, especially since I don't usually see it at other sushi places - the Cowgirl. It's a roll wrapped in seared beef, inside with cucumber and something else I can't remember, drizzled with sauce  - very good! \n\nLike other sushi places here, they've got all you can eat as well as a la carte. Can't go wrong here."
        }, 
        {
            "index": 33, 
            "rating": 4, 
            "review": "I think that all the (all you can eat sushi places) on yelp with 4+ stars tend to be good.  This was no exception. \n\nWe went to this place on saturday after trying to go to Yama Sushi to try something new and not wait 1.5 hours.  \n\nAfter the initial 15 min , we were seated and had drinks in our hands.  Our waiter was helpful and patient.  She came frequently to check on orders, after the intial difference in names.... I found all the tasty dishes I liked.  \n\nIf you have a chance to go, definately do it and try the firecracker, baked scallops and muscles!!"
        }, 
        {
            "index": 34, 
            "rating": 5, 
            "review": "One of the best sushi places I've ever been too. There all you can it is pretty reasonable at only $25 dollars for dinner service. I highly recommend there Tiger Yamisaki roll. Its my favorite."
        }, 
        {
            "index": 35, 
            "rating": 1, 
            "review": "Sushi Twister was very disappointing. The sushi was bland. The eel sauce was terrible. I won't assume it's usually like this, but it tasted burnt and wrong. The spicy rolls had no spice or kick to them. Two people in our group ordered mango mochi, then they proceeded to put the orders in the same plate; this is not the best way to serve to separate people. Service was good, but for the price of $27 the food was overpriced. Slash it by $5 and it'll be worth it. Go to Kaya or Yama, they are cheaper and have better food."
        }, 
        {
            "index": 36, 
            "rating": 1, 
            "review": "Had an all you can eat dinner and was so looking forward to Uni and it was slimy and not fresh at all. Very stingy on the amaebi sweet shrimp. Sushi is not fresh cooked rolls semi good. Overall very disappointed"
        }, 
        {
            "index": 37, 
            "rating": 4, 
            "review": "The sushi restaurant is a great place to eat if you're on this side of town. This place has a variety of food not just sushi for those of you who have people who do not eat raw fish. The atmosphere is small an intimate. And they have a sushi bar at the front of the restaurant which is great the reason why I only gave it 4 stars instead of 5 stars is because the seating is so close to each other you are pretty much part of another without realizing it. This should buy at the Starbucks or the smoke shop next door and expand their restaurant just my personal opinion"
        }, 
        {
            "index": 38, 
            "rating": 3, 
            "review": "We went here since Yama sushi was too busy. The food was good but service wasn't. Our party of 5 got the \"big\" table and it seemed it was an inconvenience to them because many people were waiting for that. Our wait between orders was long. Everything was a long wait even for a refill, a napkin or a glass of water. The our server even had the nerve to ask if we were actually gonna finish everything and didn't even wait for us to even finish ordering... she just left! I guess I understand that they were extremely busy but they shouldn't have made that our fault. We didn't ask for that table or to have our food take long to be served. I guess what matters is that the food was pretty good. I still prefer Yama for food and service!"
        }, 
        {
            "index": 39, 
            "rating": 5, 
            "review": "This is my favorite place for sushi in Las Vegas. The fish is fresh and service is decent. My favorite is the tempura lunch special (Tempura shrimp and vegetables, salad, steamed rice, and California roll) for $6.95. Can't beat that! Also love the green tea ice cream for desert."
        }, 
        {
            "index": 40, 
            "rating": 5, 
            "review": "Love this spot small but I usually only go during lunch so never had to wait for a seat. Ayce is great but I love the lunch specials!!"
        }, 
        {
            "index": 41, 
            "rating": 5, 
            "review": "Sushi Twister is my go to place for sushi in Las Vegas. Quality fish, excellent service and a fair price. What more could I ask for."
        }, 
        {
            "index": 42, 
            "rating": 5, 
            "review": "This place is a relatively short drive from work, which makes it work for my 1 hour time frame. \n\nI've eaten here a few times on my own, and most recently, I ate with a co-worker during our break. \n\nWe were seated quickly, our drink order taken immediately and brought out shortly after. \n\nI LOVE that they do half roll orders! I never feel like I get my money worth when doing AYCE because I try not to over-eat, so I am limited in the variety I get to choose. \n\nWe ordered off the AYVE menu and it was well worth it. With the half orders available, we were able to try 9 different styles and appetizers. It was the perfect amount of food between the 2 of us. We didn't feel like we needed to overeat to get to try more variety and we left feeling well fed but not overstuffed. \n\nThe service was amazing the whole time, with the owner(?) personally waiting on us and checking in on our experience. We had a great time and were not rushed to get back to the office. We had plenty of time to drive there, eat without rushing and drive back with a couple minutes to spare. \n\nThe prices are decent, though it's still a bit much for lunch. I can't complain as we still enjoyed AYCE with no issues. \n\nI will definitely be back, and hopefully we'll have the same experience."
        }, 
        {
            "index": 43, 
            "rating": 5, 
            "review": "absolutely delicious and totally worth it!!!\nthe food was good and i love how it's all you can eat although i dont eat much....but everything was just amazingggg!"
        }, 
        {
            "index": 44, 
            "rating": 5, 
            "review": "A few months ago, a friend who loves sushi had told me about this place. I believe the first time i tried this was around May 2010. Located on the east side of town at the intersection of Tropicana and Boulder Highway, it was clearly on the opposite side of town where i lived. Prices were average at $26.95/person for dinner, and $21.95/person for lunch. \n\nFirst impression? Upon entry, widely greeted by all the staff in japanese and was quickly shown to our table. According to my friend, the owner is one that stands closest to the entrance to the restaurant at the corner of the sushi bar. He used to be a chef at another restaurant, but later left and opened this place. This is when I first started to rate places i go to, so i didnt have a variety of tests to check the place out, but as of recently i had checked, they passed it all. Fish not presliced and covered with serand wrap in the refrigeration cabinet at the sushi bar. One thing people order initially is the tamago nigiri. It is to test the skill of the sushi chef as well as an initial test for the rice. Both very good. Egg was sweet and cut thick. Rice was a small amount and had a particular nice taste that complimented well. (pride of the sushi chef). \n\nWe had orders the 3 primary fish (tuna, salmon, yellowtail) for nigiri, enough to taste/see the quality before we order more. Small amount of rice, nice good size slice of fish. Rice flavor complimented the freshness and sweetness of each fish very nicely. And then, it was game over. 30+ orders of each salmon, tuna, and yellowtail. Best quality fish ever have tasted at a all-you-can-eat restaurant in las vegas. \n\nOn the side note, you are able to ask the chef what is the freshest fish they have that day is, and try that. Usually pretty good as well even if its not salmon, tuna, or yellowtail.\n\nThe waitresses and chefs are very open to custom orders of any kind (i mean almost any kind... oh man, my friend made a weird one - natto and squid topped with yum yum sauce... i shiver at the idea of natto... *shivers*) \n\nAnother note, try to remember to look at the special on the wall opposite of the sushi bar. Sometimes they have pretty good specials that you can order, that is included in the all-you-can-eat plan. Sometimes they have blue fin tuna or fatty tuna ! O_O YUMMY !\n\nHave tried a few of the rolls and they are pretty good too. None with sauces too overpowering but enough to produce a flavor from the sauce without covering the flavor of the ingredients\n\nAlso... desserts... all-you-can-eat ice cream and mochi... a plus for a lot of people =P esp since i love green tea ice cream =] \n \nQuality of this place is really good, though its far for some people, but in my opinion, definately worth it. \n\n--------------------------------------\n\nMy friends and I rate this place a 9.5 out of 10 with a minimum score of at least 7 from the several times we have ate at this restaurant."
        }, 
        {
            "index": 45, 
            "rating": 4, 
            "review": "just had to mention the scallop twister hand roll I tried last time. OMG Amazing!! i really dont know what all is in it... but whatever it is, its like heaven in my mouth =)"
        }, 
        {
            "index": 46, 
            "rating": 5, 
            "review": "I had a great experience here! I had a Hispanic sushi chef (don't remember his name) making my orders & he quickly made them. Everything was great. Will come again!"
        }, 
        {
            "index": 47, 
            "rating": 4, 
            "review": "Started out at Sushi twister with some hot appetizers such as jalapeno popper, the Aurora shrimp, fried calamari, and the chicken karage.  First was Nigiri Sushi of yellowtail, albacore, and eel.  My first roll the matsuri,is a shrimp tempura cucumber wrapped in spicy tuna and light tuna with very little sauce. The second order was of the signature Sushi twister which is shrimp tempura cucumber wrapped in tuna. The third was a rum jungle which is deep fried soft-shell crab crab meat and cucumber wrap with spicy tuna and Albacore. I made a point to order all the rolls with no sauce.  My second order of the hot chicken karage, I ordered with  sriracha sauce.  Almost forgot to order the much reviewed about salmon loves lemon roll, which is fresh salmon with lemon in a California roll.  As my stomach is filling up I just asked for a bit of a taste and that's when i ordered (see picture) of the salmon with a bit of avocado on top and lemon. That should have been my dessert. Creamy. Finished dinner with the green tea ice cream."
        }, 
        {
            "index": 48, 
            "rating": 4, 
            "review": "Solid sushi selection and a variety of creative rolls. It is the focal point of this establishment and got me to venture away from my normal nigiri fixation. In fact, my normal means of choice is lackluster at Sushi Twister. They offer many of the quintessential fishes, but nothing particularly unique.\n\nOn the other had, the rolls were not predominantly tempura shrimp based, so my two friends and I went crazy on them. The spice levels next to some rolls made for an exciting adventure, but sometimes falls short of what was promised. I did not find any of the level fives to be unbearable or even tongue tingly. Instead they had a controlled heat that went well with the other components. The Crunchy, Angry Ninja, Kill Samurai were all good. We were even surprised by how much we liked the Cowgirl. Normally we would not order a beef roll, but the meat was tender and cooked medium.\n\nThe appetizers comprised of many standard options and a few specials. The oysters are a must get if they are offered. One order per person is the limit, but the two large bivalves should not be passed up. The Monkey Ball is also becoming more common. The spicy tuna stuffed mushroom comes as a single ball, order more if there are multiple people."
        }, 
        {
            "index": 49, 
            "rating": 5, 
            "review": "Great sushi place. Easy to get to on Boulder Hwy.  Fried sushi firecracker roll is ono.  Spicy Kistler is greatvtoo. Staples like tempura and kat sure is good too. Try it, you'll like it!"
        }, 
        {
            "index": 50, 
            "rating": 3, 
            "review": "Its okay, not good and not bad.\n\nAYCE, I did this on a friday, \n\nThere nigiri is very good, and there fish is fresh\n\nThere miso soup is good,\n\nThere service is good,\n\nBasically there strength is the freshness of there fish, they have some Japanese staff, and they try to stick to traditional Japanese sushi. \n\nThe Bad: There is too much rice on there sushi, there rolls are not as good as there nigiri.\n\nThere appetizers suck, \n\nLocation of the place is a shitty area....\n\nIts an okay AYCE, but Kaya is still number one......"
        }, 
        {
            "index": 51, 
            "rating": 5, 
            "review": "I'm a visiter from Los Angeles and there are a lot of sushi places to eat there, but this place is way better than the ones I have been to. My sister took us here and I'm not disappointed at all. Thick fresh pieces of fish and I couldn't get enough. We ate here 2 days in a row. Great food and great sushi can't ask for more."
        }, 
        {
            "index": 52, 
            "rating": 5, 
            "review": "My boyfriend and I have been trying to expand our sushi wings and explore new sushi places. We read a bunch of positive reviews about Sushi Twister here on Yelp and figured it was worth a try. It isn't anywhere near our house, but we figured good sushi was worth the drive...and it was!\n\nWe went with the All You Can Eat and sat at the sushi bar, which was a great choice. We didn't wait more than 2-3 minutes after ordering each roll. The service was excellent and timely, and they were packed.\n\nOur favorite items included the albacore, garlic tuna, Kill Samurai, and Cowgirl. You can order 1/2 or full orders, which we loved. It allowed us to try more rolls without feeling too stuffed.\n\nMy only complaint would be the spicy rolls. They weren't as spicy as I would have preferred, but they were still delicious. I tried the Angry Ninja and Call a Doctor vs. Friday the 13th.\n\nOverall, we had an excellent dining experience, and we will definitely be back!"
        }, 
        {
            "index": 53, 
            "rating": 5, 
            "review": "There baked Alaskan summer is a fav. And the rum jungle roll is quite devine. And there saba Nigeria is pretty tasty if I do say so myself. I've been coming here for years and will continue to as long as I live in vegas! Anyone wish g to have sushi come here it won't let you down!!!"
        }, 
        {
            "index": 54, 
            "rating": 4, 
            "review": "When we come to this place we order the chicken teriyaki plate or the beef plate.\nComes with california roll rice meat and shrimp and vegetable tempura. Oh and miso soup and a green salad on the plate. \nGood taste food. And if your a big sushi eater they have all you can eat too."
        }, 
        {
            "index": 55, 
            "rating": 5, 
            "review": "First time I went...a pretty seedy part of town...but the sushi was on point.  I should have taken some pics!  The rice was not over bearing, the sushi was fresh, and just over all delicious...the price was even a few bucks less than most AYCE places! Just really delicious and worth the risk to go to \"tweekertown\" :)"
        }, 
        {
            "index": 56, 
            "rating": 5, 
            "review": "I  have been to Sushi Twister tons of times and I have NEVER EVER had a nad meal. I  have brought friends with me and they loved it too! I'm very picky about where I will eat sushi because if it's not fresh you can get really sick. \nI LOVE THIS PLACE!"
        }, 
        {
            "index": 57, 
            "rating": 5, 
            "review": "When I originally moved to Las Vegas, I HATED sushi. The texture of it, the taste, just wasn't my thing. A few times my friends brought me to Sushi Factory East (which is now closed, perfect timing since I just got a full stamp card...) a few times. One day I wanted sushi of my own for lunch and Twister was right down the road. I went in, ordered a Japanese Lasagna to go, and walked home.\n\nI have NEVER been blown away by food like this. The roll was simply the most delicious thing I have ever consumed and is now my usual favorite here. (I always get at LEAST half of a roll!)\n\nThe quality here is unparalleled. The service is quick and amazing. The ONLY thing I don't like about this place is how everyone there hawks you down when someone at your table doesn't have AYCE. Not everyone is a thief, and looking at customers constantly so they don't share is completely unnecessary. Have some faith in people. Especially people who are in there bi-weekly spending $40 on sushi.\n\nIf you have a group of 6+ you might have to wait since the establishment is quite small inside and they don't do reservations. Keep that in mind!\n\nFree Wi-Fi if you connect to \"attwifi\" from Starbucks next door during business hours!"
        }, 
        {
            "index": 58, 
            "rating": 5, 
            "review": "Love this place on Eastside of town, always welcomed and on target with great food and service.\nBento box for 2 has way more food than expected, delish and not a budget breaker either."
        }, 
        {
            "index": 59, 
            "rating": 4, 
            "review": "I have eaten here for both lunch and dinner. The food is always fresh and served relatively quickly no matter what time of day you visit. The staff has always been friendly and informative.\n\nTypical AYCE sushi rules apply (no sharing with non/AYCE guests, don't waste the rice, you have approximately an hour to eat, etc.)\n\nSome favorites: Crab roll, 911, Friday 13th v Jason, Spider roll, spiderman, cowgirl, japanese lasagna...there are so many to choose from\n\n\nThis is a small place so you could end up waiting for a table in the evening hours. The good thing is, the service remains at all time high because they can only serve so many people at once. If you can't get a table, order to-go! It's made fresh when you order it, unlike the cold dry sushi that you get at RA!"
        }, 
        {
            "index": 60, 
            "rating": 5, 
            "review": "Fantastic sushi...fresh and yummy.  Large portion and selection. Also offers all-you- can-eat for $26.95 for 60 minute dinner. Tempura very good, too."
        }, 
        {
            "index": 61, 
            "rating": 4, 
            "review": "Never ate at the restaurant. I get takeout but I love everything I've had. And I am one to try new rolls. They have great sauces with their specialty rolls."
        }, 
        {
            "index": 62, 
            "rating": 3, 
            "review": "This review is not based on the sushi as I am no fan of sushi but ate here because my family wanted to eat here.  I had their lunch special Teriyaki Bowl with Fillet Mignon.  I liked the teriyaki sauce and the meat was very tender and flavorful.  This also came with Miso Soup which was also very good.  The only thing that would have made the bowl better is if it came with some type of vegetables instead of just meat and rice.\n\nOur server was very nice and friendly, constantly refilling our drinks without us ever needing to ask (maybe because they automatically charge an 18% gratuity on parties of 6 or more).  I wouldn't mind coming back here in the future if my family wanted to eat here again."
        }, 
        {
            "index": 63, 
            "rating": 5, 
            "review": "Amazing Sushi at an unbeatable price. We've had sushi here for the first time about 3 weeks ago. Since then, we have came back at least 3 more times. I love the \"oh my god\" and \"tiger roll\" it is amazing! Great service, great food, fast turn around and best all you can eat prices. Sometimes the place gets crowded but the wait is well worth it! We absolutely love it here."
        }, 
        {
            "index": 64, 
            "rating": 5, 
            "review": "My favorite sushi place in Las Vegas. I live in San Francisco and we don't have any all-you can eat sushi place. Every time I come to Vegas I have dinner here. Fresh, yummy, and fun."
        }, 
        {
            "index": 65, 
            "rating": 4, 
            "review": "Great food,friendly staff,their quick to get your food out...   it's always people there,so that's a good sign.."
        }, 
        {
            "index": 66, 
            "rating": 4, 
            "review": "I love love love this place. the sushi is amazing. my favorite is the San fransico roll and also the magic mountain. very clean place. the fish is always fresh. the only thing I have with this place is that the soda can b really watery since they use pitchers to fill up the cups. other than that no complaints. servers are nice usually. not always too attentive to me when I go but they get super packed so I get it. as long as my sushi is good I'm good ;) probably the best sushi place in Vegas."
        }, 
        {
            "index": 67, 
            "rating": 5, 
            "review": "This is by far my favorite sushi place. Always super nice, the food is amazing I will always pick this one over any of the others. Must try! And great prices"
        }, 
        {
            "index": 68, 
            "rating": 5, 
            "review": "AYCE amazing. It's a small spot. Lots to choose from and all are yummy. Ordering half rolls is okay..some items you can't, but no worries they are so good you would have wanted more anyways. And if your dining partner is eating AYCE too..you can share. Time limit is 45 minutes for lunch I believe and 1 hour for dinner. What are you waiting for ...go now!!!"
        }, 
        {
            "index": 69, 
            "rating": 5, 
            "review": "Best nigiri that I've had in Vegas so far.  Wait staff is super friendly, and the fish always tastes super fresh."
        }, 
        {
            "index": 70, 
            "rating": 5, 
            "review": "I absolutely love Sushi Twisters AYCE menu! Everything is high quality from the soups to desserts. They have a great selection of all types of nigiri, rolls, soups, appetizers, etc. The baked mussels and baked scallops are absolutely amazing! I always regret eating sushi anywhere else as nothing compares!!!"
        }, 
        {
            "index": 71, 
            "rating": 4, 
            "review": "Pretty good food but nothing super special. Great lunch process. Decent service. I'd recommend lunch over dinner. They also have an all you can eat option. Update: get all you can eat and sit at the sushi bar. Chefs are cool."
        }, 
        {
            "index": 72, 
            "rating": 5, 
            "review": "Excellent service, great tasting and fresh fish for a good price!  I recommend this to everyone to try!"
        }, 
        {
            "index": 73, 
            "rating": 5, 
            "review": "I must admit this would be the best sushi place I have been to (well maybe second best sushi place: number one would be I love sushi (in anthem). WIth that being said,  I have been here a couple of times in the past and that was when I was starting to enjoy sushi and learning the whole all-you-can-eat-sushi. \nThen after several of years of knowing what types of sushi i liked and didnt like.  Also, been to dozens and dozens of sushi joints. Sushi Twister is a place I would say is a MUST GO! \n\nMy mom and I went here twice in one week and man their sushi and lunch/dinner specials is a great deal.  \n\nI ordered the Beef Lunch Special ($8.50) and it included a Kobe Style Filet mignon beef steak, & 4 pieces of California rolls. (Amazing!!!) I think the dinner special is about $12 which includes 8 pieces of California rolls, 2shrimps, & vegetable tempura.  Both the Dinner & lunch special is great.\nThe Kobe style beef steak is very tender,juicy, and very flavorful.  One of the best I have ever tasted.  The price for their lunch/dinner special is worth it.  \n\nOther things w ordered are:\nJapanese lasagna\nSpider Rolls\nIka (Squid)\n& Philadelphia with Twist\nAll I recommend trying, Im not a big raw sushi & i am more into the rolls. \n\nThe service is good and once you enter and leave they greet you in Japanese. The place can get pretty busy since it is a small sushi joint, but overall it is a wonderful place to enjoy some sushi!"
        }, 
        {
            "index": 74, 
            "rating": 5, 
            "review": "AYCE is well worth it. Fish has always been fresh. We dabble around the menu, but always make sure to get the spider and dragon rolls and finish the meal with the are you ready."
        }, 
        {
            "index": 75, 
            "rating": 5, 
            "review": "Wowowowowowow really good fresh sushi get the deluxe sashimi dinner choices hand picked by sushi chef :)"
        }, 
        {
            "index": 76, 
            "rating": 4, 
            "review": "U know, I haven't really been fortunate enough to find a really good sushi place in Vegas. Most places are what I would call imitation sushi. Sushi Twister, though is fairly authentic and now tops my list of \"reasonable\" sushi restaurants in Vegas.\n\nI went there for lunch April 2009 and had the Sushi lunch special for $8.50. This consisted of tuna, hamachi, salmon, tuna ponzu, albacore ponzu, 8 pc calif roll. ( Or spicy tuna roll) and miso soup.\n\nThe miso soup was good, using white miso and used dashi, with tofu and wakame. The only down side was it was a little luke warm.\n\nThe sushi was very good. Fish was fresh and appropriately fatty, and cut appropriately, to the right size. The rice was properly prepared, not too mushy, not too al dente, with the vinegar seasoning. It stuck enough until you put it it\nyour mouth when it fell apart... near perect. They, unlike the many fake sushi places, do put wasabi on the rice, as it should.\n\nI also ordered the amaebi. And they took the heads and made tempura out of them.  Just like at home in Japan.\n\nThe service was average.\n\nAll in all, this place is so far tops on my list.\n\nFor me, one annoyance was the constant trans music playing."
        }, 
        {
            "index": 77, 
            "rating": 4, 
            "review": "Craving all you can eat sushi? Well... if you're in the area, throw this place under your radar! Sushi Twister has the fastest service I have experienced at a sushi restaurant.\n\nI went here on a Saturday night with a party of three, after golfing in Tuscany.  I wasn't sure if there was going to be anything around for miles... but sure enough we came across this little sushi joint on yelp, so we decided to try it. \n\nIt's located in a pretty odd place... small building behind a 7-11 in the lot of an Albertsons... yeahhh weird. Building looked like it was cut out of a strip mall from chinatown... \n\nBut anyways, back to the story... as we were driving there I called ahead to make a reservation, the hostess had informed me that they only accept reservations after 9pm, but since I was calling ahead 10 minutes she put us down. As we got there we were seated promptly, there were a few tables still open. All of us chose all you can eat which cost $26.95 a person, same rules as anywhere else except you can only be seated for one hour for all you can eat. At first I was slightly offended by the rule, but it didn't seem like they enforced it much and the service definitely made up for it. \n\nWhat I found especially great about this place was the speed of service and sushi quality. I think we waited a total of 15 minutes from being seated to having our first roll delivered to our table. This was awesome and the rest of the rolls were no exception! Not only that but the portion sizes were great too, some rolls only had 5 pcs so if you didn't like the taste it was bearable and if you wanted me, heck that's why it's all you can eat, at least you wouldn't be stuck stuffing rolls in napkins. \n\nWhat I didn't like... the plating and atmosphere. The plating was a little disappointing in comparison to the presentation and quality of the sushi. It really bothers me when sushi restaurants use plastic or lightweight plates/bowls... it definitely had an effect on my perception of the overall experience. Also the music totally felt out of place and took away from the average sushi bar look and, it sounded like they were blasting Mix 94.1... I remember hearing a song by My Chemical Romance at one point. Not really sure how that gets you in the mood for sushi... but luckily I was in a group and able to tune it out... \n\nRecommendations:\n\nHands down the best roll for the night was the Angry Ninja, it had a bit of a kick to it but the warm crunchy goodness was delicious!\n\nThe Mango Moji had a very realistic flavor to it and tasted delicious as well!\n\n\nOverall, my expectations were definitely exceeded... I wasn't expecting to have quality sushi from a small joint behind a 7-11... I was very satisfied with the speed of service 5/5, the sushi quality was also a 4/5, however the plating and atmosphere/vibe of the place was off 3/5 for each...\n\nIf you want fast quality sushi then this place is for you!"
        }, 
        {
            "index": 78, 
            "rating": 4, 
            "review": "Bomb joint!!! One of my favorite sushi joint! About $27 buck for all you can eat during dinner time. You limit up to an hour but I've stayed over an hour many times here and haven't been asked to leave even when crowded! Great service!"
        }, 
        {
            "index": 79, 
            "rating": 5, 
            "review": "Down right the best of the AYCE Sushi places in town! This isn't my first time coming here and it certainly won't be the last. First time was for my birthday and this review will be for yesterday. We entered the restaurant just before a rush, so we got in right away and were seating. The Sushi chefs and waiters/waitress' were all very quick to respond to what we needed and were very friendly. \n\nRolls are very good here, though a lot of them contain fillers (Almost all had cucumber), highly recommend the Matsuri and Tiger Yamazaki rolls. I also had their Angry Ninja roll which was suppose to be one of the hottest rolls they had, sadly it wasn't hot enough for this man to burn, but hey the taste of the habanero sauce was hot, sweet, and just all around good for people who aren't more accustomed to hot foods like myself.\n\nBut for me with any Sushi place I go to, its all about the Nigiri. To me, if a place cannot do nigiri right then I don't have high hopes for anything else in the place. I had just about every type they had and all of them were very fresh, they actually season the rice unlike most places as well. \n\nWorth a drive and the price."
        }, 
        {
            "index": 80, 
            "rating": 3, 
            "review": "had the sushi twister combo.  there was a lot of food."
        }, 
        {
            "index": 81, 
            "rating": 4, 
            "review": "Auntie Em, Auntie Em! It's a twister! It's a twister!!\n\nI've been hearing a lot of people say to me that Sushi Twister makes some of the best sushi in town. Well,not quite. But, Sushi Twister is making some good sushi over on the east side of Vegas. \n\nFirst, for those living on the east side near boulder highway and Trop, and around that area, this might be your only option for AYCE sushi. And, it's not really such a bad option.\n\nAfter walking in and sitting down at the bar, I was later told by the sushi chef that  Sushi Twister is owned by the same people that own Ramen Sora in Chinatown. I was expecting a lot, and I think that they delivered nicely.\n\nOrdered too much to analyse bit by bit, but will try to give an overall impression. I thought the fish and seafood quality was good, but not great. I also thought that the rice was a tad bit on the slightly sour side. I also thought that their signature sauce that they put on many of the apps and nigiri, sort of a yuzu-type soy sauce, was too sour as well. As for the apps, I really liked the chicken karage, it was crispy, well seasoned, and cooked very nicely.\n\nSo, I like this spot, but it's a drive from me so i'll stick to my favoritos. But, for those that live in the area, this is a super solid option for those who don't wanna travel to Spring Mtn. Rd., but would still like some quality sushi."
        }, 
        {
            "index": 82, 
            "rating": 4, 
            "review": "The best mothers insist on taking their son out to eat, and what not to be the best of sons than to accept, right?! So I did just that;)\n\nOne thing i noticed right off the bat, was how spacious this spot was in compared to other Sushi joints. Of course you had the choice from booths, tables, or the bar. \nThe waitress taking care of us that afternoon was Wendy, who was very friendly and not to mention on point with our refills and additional orders. +1\nFor my technique of proper rating, i made sure to have one bite of each roll and cleared my pallet with a swish of sprite.\nStarting off with the Ninja, it was a solid 7. \nYellow Mango w/ Shrimp roll was a fresh change, although would taste better if they added some rice vinegar to it. 7 \nSpider Man had a lot of flavor hidden behind the deep fried mini crab legs. 8\nAnd the Alaskan Summer was really great at the beginning although after the third bite, became really fishy. 8.5\nTheir Mochi ice cream here is limited to 1 per customer and only serve the two flavors of mango and strawberry. \n\nIn comparison to their competitors, their fourth star didnt come from the food, but having such an evenly spaced out, clean, and comfortable dining area. \nYes! Another sushi joint down in my books. Still looking for that 5 star though! ;)"
        }, 
        {
            "index": 83, 
            "rating": 3, 
            "review": "The place was okay. Nothing to really jump out of my seat for.\nIt's on my side of town, but I'll definitely stick to other places."
        }, 
        {
            "index": 84, 
            "rating": 5, 
            "review": "Ok, over the course of the last few months my love affair with Sushi Twister has intensified. Like any relationship, we have had our ups and down, but managed to beat the odds and continue our romance. The food is consistently delicious and the fish is fresh. Their rice to fish ratio still bothers me a bit, but I'll let it slide. There are times when the services is spotty (an older female server will leave you hanging for quite some time), but there are times when the service is pretty flawless. This weekend we had a young gentleman as our server as he was on top of his game. \n\nTheir selection of nigiri is great and choices of baked and regular rolls vast. My favorites are Friday the 13th, Cowgirl, Oh My God, Ecstasy, and Rum Jungle. I also really enjoyed their baked mussels. I am two stamps away from a free AYCE meal...oooooh yeah!"
        }, 
        {
            "index": 85, 
            "rating": 4, 
            "review": "Very good! Small restaurant, but the quality is great. Lots of variety and friendly staff. Decent wait this time, but service was instant once we were seated. Will be back!"
        }, 
        {
            "index": 86, 
            "rating": 4, 
            "review": "Before my Seattle trip, a friend and I had a sushi craving. The wonderful think about living in Las Vegas is having the option to go to AYCE (All you can eat) sushi joints. I've heard some really great things about this place from friends and neighbors. The best thing is that it's located right up the street from my house. This meal was a brainer. \n\nThis joint is located on the southwest corner of a very busy strip mall. Walking into the restaurant, you'll notice that it's cozier inside than it looks outside. The joint has a few sushi bar top seating, a couple of high top tables and a few other table seating. Staying in place for a couple of hours, I've noticed that the servers do a good job turning out the tables so there's no wait. Speaking of our servers, they were very efficient. They always came by the table to see if we were alright and if we needed anything else. For the most part, good service. \n\nFor my meal, I decided to get the All You Can Eat option for $26.95 per person. If you're going to have a few rolls, this would be the best option. Keep in mind though, this is one of  the only places I've noticed that holds everyone to the 1 hour limit. Whenever I go with the AYCE option, I tend to chow down on a lot of Nigiri sushi as it's usually a lot ala carte. On this visit, I went with the salmon, ahi and tako nigiri. The serving size was good and the fish was fresh! For other options, I went with chicken katsu, baked mussels, mochiko chicken, shrimp tempura and gyoza. All dishes were good. The katsu used white meat but had a nice crunch to it. For my gyoza, I asked for it steamed. It was flavored nicely and cooked nicely. \n\nOverall, the food is definitely worth returning to. The food came out fast, the service was nice and everything was super filling. If you're willing to eat in an hour and then leave, come down and check them out!"
        }, 
        {
            "index": 87, 
            "rating": 1, 
            "review": "The staff and service was good.  The sushi was awful.  I tried five different items and they were all bad.  I did nt eat any more even though i was still hungry.  Felt sick after.  I have been eating sushi for 25 years I love it but not at this place"
        }, 
        {
            "index": 88, 
            "rating": 5, 
            "review": "Some of the freshest, best tasting sushi I've had here. My husband got an inside tip from a co-worker that knows that the owner purchases the fish the day it's flown in, so it was worth the drive to try it out. Now that we've made the trip & know that the quality of the fish they serve is top-notch, we will not hesitate to go back. Wish it was just a tad bit closer to home but that's my \"I don't want to get in my car & drive any further than I have to when it's 110 degrees\" side coming out. I will suck it up though & make the drive b/c it's that good! \n\nWe've been twice now & both times we have loved everything we've tried. I should preface this by saying that I am not a huge fan of all the \"fancy\" rolls that have become so popular over the last decade or so. I'm an old-school sushi eater, I like the simplicity of Sashimi & Nigiri. I like to taste the fish. When it's all wrapped up in a roll covered in sauces & tempura crunch, it can be very hard to tell if you're even getting a fresh piece of fish & that worries me a bit! \n\nThe 1st time we went, I had a hankering for Salmon terriyaki & was not really in the mood for sushi. Maybe only the 2nd time in my life that has ever happened! I did order the Poki appetizer & it was AH-mazing. The salmon terriyaki was good although the sauce was way too thick & there was too much of it covering the fish. If I order it again, I will definitely ask them to go easy on the sauce! Hubby ordered the AYCE & from what I could tell, he enjoyed every roll he had. \n\nThis last time we both had the AYCE & I will probably only do that from now on. It's a great value even if you don't eat very much & you can choose from hot & cold appetizers as well as all the sushi choices. I ordered the Poki again along with some Nigiri orders & even a couple of the \"fancy\" rolls, mainly b/c I already knew that their fish was fresh. I liked the Angry Ninja & the Sushi twister roll the best. I think I could eat that Japanese salsa all by itself.. yum!  \n\nI was slightly disappointed that they don't have fresh wasabi. Most of the better Sushi restaurants I've been to have it available for an extra charge so I was surprised they didn't have it. I have developed quite the affinity for it & can't really eat the stuff made from a powder anymore. I hope they consider making it available in the future & would be happy to pay an extra dollar or 2 to have some for my sushi. \n\nWe will be bringing the kids next time. Sushi gets very expensive when we go out as a family but the AYCE deal will make it much more reasonable & they will be thrilled.. \"anything we want?!\""
        }, 
        {
            "index": 89, 
            "rating": 4, 
            "review": "The food is very tasty and service is great!  Prices are moderate.  The restaurant is very clean as were the restrooms.  They have AYCE but we order off the menu.  It isn't a large place, but we have never had to wait for a seat; we always go for lunch.  We will go back!"
        }, 
        {
            "index": 90, 
            "rating": 5, 
            "review": "Today I unfortunately lost the money I needed to pay for my girlfriends and I food. We had no money as I felt quite embarrassed we had to call my girlfriends mother to come pay for the food. We also had to keep them waiting after the closing Time. And after all this the greeters still had a genuine smile and a positive attitude. They honestly seem like good people. We need more people like them in this world"
        }, 
        {
            "index": 91, 
            "rating": 3, 
            "review": "I was craving Sushi so my sweetheart said lets go have sushi so we decided to go to Sushi Twister since he has been before. We usually go to Oyshi Sushi on our side of town which never disappoints with the good quality and service.\n\nWe decided on the AYCE so we could get our fill of sushi in to satisfy our cravings.\n\nMy man had been craving a roll they have that is wrapped in a jalapeno wrapper and deep fried that he always talks about being so good. Well he orders it which is now listed on the appetizer section of the menu and it was not anything like he remembered. The way he described it and the way it tasted was nothing like he had described or had before. The size was tiny not a full sized roll as before, so that was a let down and it was so small I could not even sample it.\n\nHere are some of the rolls that we ordered, \nboulder crunchy roll\nspider roll\nscreaming for vengeance roll\necstasy roll\nshrimp tempura roll\nPhiladelphia roll\ndead dragon roll\nangry ninja roll\n\nFor some reason the cucumber in my rolls caused a burned taste as if it was char broiled or blackened so I asked them to omit any cucumber from my future rolls.\n\nThe rolls were OK, nothing that gives me the oral mouth orgasm that Oyshi gives me on every visit. The flavor was just not there as I was expecting or had hoped for.\n\nThis was across town, quite a drive to try a sushi joint that I had never been to however we are spontaneous like that. My sweetheart said the Sushi was good in last visits however it seems they have changed and the rolls that he liked are just not what they once were.\n\nOK so we gave it a shot and it disappointed unfortunately, and I am surprised because the reviews and star rating on Yelp are pretty good so?\n\nI do have to say the service was very good, we sat at the bar and they had our rolls whipped up in a jiffy and they kept up on our drink refills!"
        }, 
        {
            "index": 92, 
            "rating": 2, 
            "review": "We tried this place because we heard it was good. So here we are, trekking all the way from Sunmerlin (20 miles away.) \nTo be honest, the service was so so and the food was okay. The salmon sashimi was warmer than usual and the place smelled of wet rag. The rolls were loosely made and soaked in sauce. I'm giving this place 2 stars because I believe it has a chance of succeeding."
        }, 
        {
            "index": 93, 
            "rating": 3, 
            "review": "I had the seafood poke bowl lunch special for $9, and thought it was just okay.  There was apparently a variety of seafood in the dish, but I couldn't discern that as the marinade was so overpowering that it all seemed like the same fish to me.\n\nI'll try to go back for the AYCE next time I'm in Vegas."
        }, 
        {
            "index": 94, 
            "rating": 5, 
            "review": "This place is the BOMB! Since I work at the same shopping center at Sushi Twister for many years, if I want to eat something different, I come here. I usually order the Chicken Lunch Special to go. \n\nThe best part is that there's lots of portions of Teriyaki Chicken,  salad, and California Roll Sushi. I love the taste and flavor they put in the Teriyaki Chicken. Would be back for more!"
        }, 
        {
            "index": 95, 
            "rating": 4, 
            "review": "My family and I go here almost bi-weekly...well maybe once a week if we can't decide ( usually I want asian and my man wants steak)- we end up here cause he likes the beef teriyaki and another beef item on their appetizer menu.\nMy boyfriend only started eating \"ethnic\" foods when we started dating so anything raw is still a little new for him but he has moved up to ahi tuna but he likes a roll called \"kill samurai\" and always orders that with his beef dish.\nMy 11yr old daughter though, loves having amaebi with me and the shrimp heads deep fried.  They have a hand roll special for lunch- 3 hand rolls for about $8- her fave? Salmon Skin handroll and spicy tuna handroll!\nWe love coming here since we live in the neighborhood but what we love the most is that it reminds us of home, the funky music and the good food.....can't ask for more of a neighborhood sushi hangout."
        }, 
        {
            "index": 96, 
            "rating": 5, 
            "review": "Bomb dot com.   Every time I visit Vegas and I'm craving sushi this is the place!   The food quality is superb and the Uni!  Amaze balls!   Sweet shrimp and shrimp head even better!   Never disappoints and the dessert green tea ice cream and  mochi seals the deal"
        }, 
        {
            "index": 97, 
            "rating": 5, 
            "review": "This wasn't the first place I had sushi when I moved to Vegas but its now the only place I'll have it!! I started coming here a couple of years ago and now its tradition. I love the AYCE its totally worth every penny starting with the edamame and ending with the Mochi. Every time we come here we try a new roll and have all our favorites, I am a huge spicy fan and my boyfriend like the milder ones. My all time favorite is the Are You Ready? But he prefers the Tiger Yamazaki, they are always the first things we order and sometimes we end the meal with a second one each. I love the 911 and wish i could top all my rolls with that crunchy topping and eel sauce! now onto the service, We have a problem at most places we go because my boyfriend typically drinks 6-10 glasses of water with every meal and most servers are never on top of his refills but not here... They have someone that specifically is for refilling drinks and clearing plates so as soon as you pick up your last piece of sushi your plate is being picked up and our glasses never get under half full!! Sometimes the wait staff can be a little overwhelmed with tables but you never have to wait too long to order your next rolls!! It's a small restaurant but not as small as some sushi places I've been to in town, and defiantly worth the wait if you have to hang out for a few minutes before your table is ready. Plus you can't help to enter and leave with a smile since they greet everyone the second the door opens and say a farewell every time you exit!!"
        }, 
        {
            "index": 98, 
            "rating": 5, 
            "review": "**Summary**\n       - Sushi Rice - They use their own wooden sushi rice tub so their rice tastes a ton better than other places that just use a simple rice cooker. (http://www.yelp.com/biz_photos/MXC9pwIxovWUc9yu1F8OxA?select=Ibo4zWnSyIkQgruCj7ilVw)\n       - Freshness - Their salmon and ikura were especially fresh. \n       - Special Daily Fish - They have daily fish specials like fatty tuna. However, the day we went, they ran out.\n       - Service - Our chef was friendly and very quick. The place was packed so I understand why the waitresses were a bit laggy.\n**Price**\n       - $21.95 Lunch Open - 4pm.\n       - $26.95 Dinner 4pm - Close.\n**Ordered**\n       - Monkey Ball - Spicy Tuna and Mushroom in a tempura ball. The mushroom overpowered the rest of the dish, but it was an interesting idea.\n       - Aurora Shrimp - Fried shrimp with Japanese mayo on top.\n       - Dynamite - Scallops, onion, mushroom, and imitation crab meat on a big half shell. One of the best Dynamites I've had.\n       - Sushi-Twister - Shrimp Tempura and Tuna with Japanese Salsa (Ponzu sauce base with a spicy kick)\n       - Oh My God - Yum Yum scallops, imitation crab, and soft shell crab with eel sauce. Heavier roll, but delicious.\n       - Yellow Mango with Shrimp - Yellowtail, mango sauce, and shrimp. It was a light roll and the mango sauce added a sweet flavor.\n**Recommendations**\n       - I'd definitely recommend this place. The fish is fresh, the rolls are inventive, and the appetizers are delcious. It's a no brainer."
        }, 
        {
            "index": 99, 
            "rating": 3, 
            "review": "I've been coming here for years. Pretty reliable over all. However, this Memorial Day, it was as busy as I'd ever seen it. That increased wait times a bit, but didn't affect the quality of the food.\n\nThis was the first time I'd tried the island style poke. They mix the tuna with a lot of seaweed salad, so while you get a decent amount of fish, it doesn't look like it because of the seaweed."
        }, 
        {
            "index": 100, 
            "rating": 5, 
            "review": "If you haven't gone, give this place a try. We like them A LOT. The AYCE is great and gives a good variety of everything they serve, not just the fish. This is also a place you can bring \"newbies\" to sushi to - they have a lot of non sushi items on the menu. \nDon't miss the Bento Box for 2 deal. It's wonderful if you're craving sushi but a little light in the wallet. You get A LOT of sushi to try as well as tempura, teriyaki and grilled salmon. The staff is also very nice. Once when I ordered a la carte and my tab came up to more than the AYCE price, the manager told me about it and gave me the all you can eat price providing I finished what I was eating- really nice.\nAnother big bonus is that their health practices are CLEAN, I cannot believe how many sushi places I see in the LVRJ restaurant report, but NOT THEM thankfully."
        }, 
        {
            "index": 101, 
            "rating": 3, 
            "review": "We tried a lot of items on the menu and i must say that their chicken tonkatsu is the best! I recommend you to try San Francisco and Dragon if you prefer sushi. The salmon teriyaki is not so good and really pricey. Its an okay japanese restaurant. Nothing superb"
        }, 
        {
            "index": 102, 
            "rating": 3, 
            "review": "I live 3 mins away so it's very convenient and for the most part fish is always fresh. I usually eat nigiri rather than special rolls so this place works for me because their flavor profile on their rolls are not that great. Most drenched in sauce or as I like to say \"eel'd\" lol. Their eel sauce is ok.. Had better. \n\nService is hit or miss. I still go here since it's close and quality is good."
        }, 
        {
            "index": 103, 
            "rating": 5, 
            "review": "Sushi Twister has go it going on!\n\nI love this place because they have nigiri down to an art man. Their cuts of fish are just outstanding and the taste is like.. OMG WOW SUSHI YESSSS.\n\nI have a few friends that I go to when I want to know anything Sushi so when they said that this is the place, I took their word without question and I was not at all disappointed.\n\nThey have a wide variety of fish for nigiri and from my understanding (according to my sushi expert friends) Twister has probably got some of the freshest fish you can find on your nigiri in Vegas and not only that but apparently they know how to prepare the fish authentically.\n\nOn top of that their selection of specialty rolls is pretty massive and I definitely applaud them for their creativity. Going back to my sushi expert friends, they really only like nigiri but apparently the rolls here utilize the same great fish that's on the nigiri that they don't mind having a few specialty rolls as well.\n\nNow, I am by no means an expert on sushi but when the food is good.. the food is good and the food here is DAMN good.\n\nMy only real problem with this place is unlike Sushi-Mon and the newly opened Goyemon, Twister does not offer all you can eat dessert which is a real bummer since I would love to have like 4-5 pieces of mochi ice cream like I normally do at Sushi-Mon as opposed to the one piece that they cut in half to make two at Twister.\n\nFortunately for them, I won't remove a star because like I have been saying.. the food is f^&#ing good. :)\n\nFor out of towners. This is not within reasonable driving distance of the strip so unless you're staying for a while and you're with other locals.. I wouldn't suggest it. It would be worth the drive if you have the time though."
        }, 
        {
            "index": 104, 
            "rating": 4, 
            "review": "We love coming here! We've moved across the valley, and still make it to this East Vegas spot once a month. I love their infused rolls. Great customer service and excellent fresh food! \nThe only thing I wish they would change would be to give the children's menu more options (and not more microwaved options)."
        }, 
        {
            "index": 105, 
            "rating": 5, 
            "review": "The best and freshest sushi restaurant in Las Vegas!\n\nMy family have been loyal customers for many years and have never had a bad experience here.\n\nThe owner and chefs know us when we walk in.  In fact, I suspect they know us too well and when they see our car pull up, someone hits a switch that says \"RED ALERT!\" because as soon as we sit down, out food is already coming out since we order the same nigiri every time.\n\nTheir red snapper is my fav.  My husband loves their seared albacore.  They make us special order rolls.\n\nThey also have a frequent AYCE diner card so you get a free meal when you fill up the card.  Sign up for their birthday club and they mail you a discount postcard during your birthday month."
        }, 
        {
            "index": 106, 
            "rating": 5, 
            "review": "Best sushi in vegas....and not expensive. The  Fish is always fresh and the staff is great"
        }, 
        {
            "index": 107, 
            "rating": 5, 
            "review": "Some of the best sushi in town! The fish to rice ratio is perfect. The staff is friendly and you are always greeted upon arrival!"
        }, 
        {
            "index": 108, 
            "rating": 1, 
            "review": "I love sushi!! But the service is horrible!! There is one lady waiter that I asked three times for some hot sauce and some vinegar and was not brought after ten minutes after my wife almost had finished eating and I was waiting for two things. The manager did nothing about the situation!! Still wanted me to charge me for the all you can eat. Unbelievable!!! Nice place but horrible service!! Don't waste your money in this place!!"
        }, 
        {
            "index": 109, 
            "rating": 4, 
            "review": "The AYCE is very fairly priced and the sushi is absolutely delicious, though you're limited to an hour.  There are many interesting choices, not always the same old options.  What astounded me is that they allowed us to order Uni as a choice, though only permitted 2 orders for 2 people.  It was creamy and just luxurious!  Rolls were good, but fell apart easily.  The seafood salad also looked and smelled fresh and delicious.  Everything we had was good except the Japanese salsa.  So unless you like a sour taste, stay away from anything with that on it."
        }, 
        {
            "index": 110, 
            "rating": 4, 
            "review": "Amazing sushi, fast, and fresh we only ever do the AYCE it's about the same price as other Acye sushi spots they are simple you order it you eat it. Which makes sense just because it's all you can eat doesn't mean to waste food so I completely agree with their rules if you don't finish something you pay for it.. The only thing limited is the mochi ice cream it's one per person but if you are with other people that are just going to get ice cream you can get their mochi order... Really enjoyed this place will definitely be eating here again"
        }, 
        {
            "index": 111, 
            "rating": 2, 
            "review": "Another AYCE sushi place. I went here a year ago and remember it being better. The service was still good, they're fast and constantly checked on us. Here's a breakdown of the sushi we ate:\n\nVolcano - too much mayo tasting.  \n\nDragon - rice a little slushy. Eel sauce is good. Average everything else  \n\nBoulder crunch - could only really taste the avocado and the eel sauce. Would not recommend \n\nAre you ready - it really is spicy. And I can handle a good amount. That said, it's an ok roll. Can't really taste the roll through all the spicyness. \n\nLasagna - too mushy. Couldn't really taste the flavors\n\nHamachi (yellowtail) - tasty. Texture was alright.\n\nAlbacore (bincho) - a little salty. Texture was off. Would not order\n\nHalibut (hirame) - texture was terrible. Not a fan"
        }, 
        {
            "index": 112, 
            "rating": 5, 
            "review": "My favorite ayce sushi spot right now.   They have the most appetizers to choose from and they have a wide variety of rolls to choose from.  \n\nThe best thing is that you can actually order half-rolls here, unlike many other places.  This means you can try way more things!!  \n\nI liked the philly w/ a twist and angry ninja.  The salmon loves lemon was my absolute favorite though.   Those flavors were meant to be together.  \n\nJapanese lasagna is good here too but it doesnt (nothing does) beat the japanese lasagna from Kaizen next to hard rock hotel.  \n\nThe uni was fresh!    When the uni is good, the restaurant follow suit!  \n\nI've been here a few times, and this place never disappoints.  Worth the wait if you happen to go on a busy night."
        }, 
        {
            "index": 113, 
            "rating": 5, 
            "review": "I really love coming here! I usually get a combination plate and a roll. Really awesome prices and portions that really fill you up! It's tasty. The staff usually greets you with a warm welcome. Definitely recommend if you want a casual place to meet a friend for lunch."
        }, 
        {
            "index": 114, 
            "rating": 5, 
            "review": "My favorite sushi place when I come in to town! Clean, & always busy. Sushi is always so fresh!"
        }, 
        {
            "index": 115, 
            "rating": 5, 
            "review": "Best place in Vegas. Don't tell anyone. ;) I drive pretty far to go here. So so so so so so so so so so so so so so so so so so so so so so GOOD!"
        }, 
        {
            "index": 116, 
            "rating": 4, 
            "review": "I was impressed by Sushi Twister. I hadn't found a good east side sushi restaurant, but then we were invited here. We actually ended up eating here twice in a short period of time. \n\nThe first time, I had the tempura lunch plate. The veggies were hot and crispy and not too greasy. The miso was tasty. The salad was crisp. It was a weird time of day, so I didn't try any sushi, but it was a great lunch special and I wanted to go back. \n\nI got the opportunity just a week or so later. This time we went for the AYCE. We tried a little bit of everything & even my husband, who doesn't love sushi was happy. The fish was cold and fresh. The selection was wonderful. My only disappointment was the Rum Jungle. The flavors didn't do it for me. The spicy salsa on top completely overwhelmed the soft shell crab inside. \n\nEven though the place is tiny, it's great. The service is good, the food is fantastic. I will be back."
        }, 
        {
            "index": 117, 
            "rating": 5, 
            "review": "If there is something I like it's sushi! Me and my husband have been going here since our high school prom lol were regulars here once we get here our server automatically knows what we want. theyre very nice, fast and the sushi is so fresh and delicious! Def. recommend."
        }, 
        {
            "index": 118, 
            "rating": 3, 
            "review": "The rolls are back on point and the service got better . I will be returning once again to sushi twister . This place is one of the best sushi spots in this location . Ok so I returned and still love the rolls but I don't understand why they add gratuity to a 6 person table ?? Maybe because I we had three kids with us . BTW they charge 27.00 for kids too"
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "One of my favorite sushi places. Its small, but chefs are very fast and rolls ate perfect. They have a pretty big menu a lot of choices."
        }, 
        {
            "index": 120, 
            "rating": 5, 
            "review": "Best quality ayce in las vegas... very consistent. Best ama ebi with head ever. Far drive for most... but worth it"
        }, 
        {
            "index": 121, 
            "rating": 4, 
            "review": "I do enjoy Sushi Twister. There's a wide selection of choices on the AYCE menu, and they helpfully break them up by category (spicy, baked, fried, etc.), so that's cool. There's myriad appetizers to order, and they're all delicious. We come here at least monthly, sometimes more. The price is exactly right for what you get."
        }, 
        {
            "index": 122, 
            "rating": 5, 
            "review": "Definitely one of the top sushi places in town! It is located in a plaza on Tropicana and Boulder Highway, it's pretty far east compared to everything else I go to (which is usually somewhere on the west side of town). \n\nPlain and simple, they have one of the top quality fish in town with very good cuts. I would have to say they are on par with sushi restaurants I go to in Japan. Nothing is precut beforehand, they cut as they go. The fish are cut to the right thickness, not thin by any means, and the rice is minimal. \n\nDo be careful if you do not like wasabi, you must tell them to NOT put it in the sushi as they prepare it with a bit. \n\nI eat the same thing over and over usually which is ikura, tamago, and masago. I do have the ama ebi, ebi, tako, and sometimes salmon. I have yet to be disappointed by anything here. \n\nThe AYCE is the typical prices you see around town about $27 for dinner at $22 for lunch. Completely worth it, even if you don't like sushi, you can choose from a wide range of appetizers that are delicious! They do have rolls but I go for the nigiri sushi and some appetizers. \n\nThe UNLV Japanese Student Association uses Sushi Twister when they host their sushi nights at UNLV to enrich students in the culture of Japan and such. It is a big hit and good advertisement for them."
        }, 
        {
            "index": 123, 
            "rating": 5, 
            "review": "Love this place and turned on several of my friends to it as well.   Lunch special is just the right size for me but have done the AYCE sushi as well.  Haven't had a single bad meal there."
        }, 
        {
            "index": 124, 
            "rating": 5, 
            "review": "I'm so happy I have a QUALITY sushi resteraunt I can go to!  Food is awesome and staff is great!"
        }, 
        {
            "index": 125, 
            "rating": 5, 
            "review": "My husband and I have been coming here for the last couple of years, been to other places, but does not compare to Sushi Twister.  The staff and chefs are always friendly and the food is fresh and yummy.  The rolls are creative and unique.  We always do the all you can eat for dinner or monday night specials.  I have recommended to my friends and they still are coming back for more................"
        }, 
        {
            "index": 126, 
            "rating": 3, 
            "review": "The AYCE menu is full items you can only order once and most of the rolls are smothered in a sauce they call Japanese salsa.  It has ok flavor but in most cases it masks the taste of the fish.  The staff is amazing and very attentive!  It was a good experience but not my overall favorite in town."
        }, 
        {
            "index": 127, 
            "rating": 4, 
            "review": "This place is definitely my go to if I want to stay in my area. The staff is friendly and attentive. My cravings are definitely satisfied when I leave sushi twister. I think they have one of the best services for AYCE. \nThe only downside is the nigiri. I'm not sure what rice they use or the way they make it, but it always falls apart :( My plate is always a mess from all the rice falling apart so I only get to eat the fish.\nI would Still recommend it if you're short on time and you want great sushi."
        }, 
        {
            "index": 128, 
            "rating": 4, 
            "review": "I was a bit nervous to come here because the first reviews I looked at were more than a few months ago and I did not see a steady stream of timely reviews. However after reading Mike B's review, where he gave it a five star, I thought I should try this place out. Not bad for a non traditional or non authentic sushi restaurant.\n\na.  Location - 3 star - Near my office, located on Boulder and Trop across from Sam's Town.  I like it because there are not too many great places on this portion of town to go.  However, I cannot give this place higher as this place location is not run down, however, it does not feel totally safe. \n\nb.  Service - 4 star I rate the service first as this is what you first encounter.  When the service does not seem to be Japanese I actually get a bit confused and wonder what I am in for.  However, I will gtive the service 4 star as I am reviewing this restaurant and an AYCE style place and let's face it, if it has those complex rolls, it is a non-traditional sushi restaurant.\n\nc.  Food - 4 star.  My rating scale for any sushi restaurant is based on traditional foods and then I order all that big mac rolls that these places serve. Yep, I like those goofy rolls.\n\n- Amaiebi - Sweet Shrimp Nigiri Style sushi . Not bad, came out quickly and nice proportion of ebi and rice.  However, I have to seriously question this as they do NOT serve this dish traditionally where they cut off the shrimp heads and then deep fry the heads and serve them after. This means that where they are buying their shrimp is where the heads are not attached? Or perhaps not live?  Let's face it, if you are service LIVE shrimp it will have the heads on them.  It is a way traditionalists know how fresh the seafood is.  In this case, no head, not fresh.  THREE STAR!.\n\n- Maguro- Again, my standard is ordering fatty tuna nigiri style with a thin slice of lemon and jalapeno.  This is a great dish if the slices of lemon and jalapeno are thinly sliced and in this case, it was absolutely not only thinly sliced, it was the jalapeno was artistically done.  FIVE STAR. \n\n- Uni - The Sea Urchin was absolutely great, nice texture and flavorful.  FIVE STAR.\n\n- All the other westernized rolls - I ate a lot of these and enjoyed them for what they were.  Nothing really stood out for me, mainly due to the amount of flavors.  They have many that are \"level 4,5\" in spice index and I had these and they were not too spicy.  So I would recommend it. THREE STAR.\n\nAs the sister restaurant to Ramen Sora in Chinatown, i would say it is cool that they have a sushi place on the far east side of town. There must be great demand for it.   They have a 60 minute limit on AYCE, and mainly due to fact that they have limited seating and it does get busy.  Overall, nice place, I can absolutely recommend this place and it is somewhere I will come back to for sure."
        }, 
        {
            "index": 129, 
            "rating": 2, 
            "review": "As an AYCE Sushi \"connoisseur\" I thought I'd share my thoughts. I've been to close to a dozen AYCE Sushi joints in Vegas, over a hundred nationwide. This spot is at a convenient location off of Boulder Highway. Not the greatest part of town, but not particularly bad. \n\nThe price is basically inline with other sushi joints, a dollar or two more than others. However, $26.95 (which is precisely what I paid here) gives me a large sake and superior sushi at Jayde Fuzion inside the M Hotel. \n\nTHE GOOD:\n-The Screaming for Vengeance roll is a top 3 roll in Vegas. Excellent. (and I'm more of a nigiri/sashimi guy)\n-Server (owner, I believe) very attentive\n-Sushi Chefs were also very attentive, skilled\n-Booze was cheap. I paid $5 for a large Sapporo - $10 elsewhere. \n======================================================\nTHE SO-SO:\n-Music was constantly skipping throughout our meal. Very annoying. Also, half the songs were Cher remixes. I'm sorry, but no one wants to listen to Cher remixes.. I understand that technical issues can at times be out of your hands, but you should turn down the volume if the music is constantly skipping\n\n-Was very warm sitting at the bar. I was sweating. \n\n-Fairly bland fish - we ordered about ten flavors of Nigiri, most were less flavorful than competitors in town. Taste-wise, it was on par with my at home nigiri that I make from store bought fish. It just didn't taste very flavorful\n======================================================\nTHE BAD: \n-HOT PLATES- My NUMBER ONE pet peeve with sushi restaurants is serving sushi on hot plates. No no no. It ruins the flavor, the experience, and the build of the nigiri. Every dish I was served here was on hot plates. No one wants warm raw fish. \n\n-Nagged three times regarding the policy of finishing food. My girlfriend and I weigh 250lbs combined(she's at about 90lbs). We're thin. We know that this is an established rule at every AYCE joint, and we follow it 100% of the time. Never leave a morsel of food on our plate. We ordered a total of two rolls and ten (2pc) orders of Nigiri. If we had ordered those plates individually, it would have came out to less than we paid for the AYCE. And ON TOP OF THAT, we ate everything. She reminded us once when we sat, once mid-meal, and when I asked for the check with two pieces we were sitting on, she mentioned that we needed to finish them (we were already planning on it). It's printed on every menu and all over their signs at Sushi Twister. I thought it was excessive before she even said anything to us, let alone before she told us three times. No other Sushi joint needs to mention it. \n\nWe were certainly the smallest AYCE order on the day. More profitable than any other customers that walked through the door. But really, she shouldn't be mentioning it to anyone. It's on the menu. We get it."
        }, 
        {
            "index": 130, 
            "rating": 4, 
            "review": "We've been here twice for AYCE sushi.  They've been very positive experiences the price is fair and comparative to other AYCE in the valley  about 21 dollars for lunch and 25 for dinner. Our last visit was the most recent, before that was over a year ago but I remember being happy with the meal. I started with some Nigiri mackerel, red snapper, and seared tuna, all were fresh and tasty. I opted for the pan friend gyoza and mussels, they were both good. Had a buncha rolls, probably too many but that's AYCE right? I really liked the Spicy Ninja, and got a hand roll with Habanero and twister scallops very good! \n\n  I like Sushi Twister, good quality, fair price, friendly staff, and nice atmosphere.  Recommend if you're in the area."
        }, 
        {
            "index": 131, 
            "rating": 5, 
            "review": "I give this place five stars not only the service was good.  We had the owner as our server. Total bill for a family of 5 was just dirt cheap compared to other sushi restaurants where the bill was not worth the food but the food here was   spectacular!  Great atmosphere where you can enjoy ones company."
        }, 
        {
            "index": 132, 
            "rating": 5, 
            "review": "You would think their To Go portions would be small but in fact, they were perfect. Very delicious. It's in a sketchy neighborhood but its so good!!"
        }, 
        {
            "index": 133, 
            "rating": 2, 
            "review": "I would not recommend eating here. Nothing we had was very good and all of the rolls were falling apart when we tried picking them up. The only reason I gave it two stars is because they were attentive and fast. I would have preferred them taking their time instead of sending out half finished rolls. My friend ordered her toddler some teriyaki chicken that took a while to make but was the best thing we had here. Will not be coming back."
        }, 
        {
            "index": 134, 
            "rating": 5, 
            "review": "Best place, hands down. Its worth it, great range on the AYCE. Edamame, salads, rolls and dessert. Love it."
        }, 
        {
            "index": 135, 
            "rating": 5, 
            "review": "Cozy little spot. Nice location. Never too crowded. Service is always nice and friendly. AYCE sushi is at a great price. My families favorite spot. Great date restaurant."
        }, 
        {
            "index": 136, 
            "rating": 5, 
            "review": "So far my favorite sushi place! Everyone is so friendly and service is always on point! Their sushi is delicious I definitely recommend this place!"
        }, 
        {
            "index": 137, 
            "rating": 4, 
            "review": "Decent service, the sushi was delicious! \nMy favorite was \"Call the Doctor vs Friday the 13th\" it's spicy and super yummy!! \n\nOur server made sure my water glass was always full and tea was full, he didn't really add much more to the experience but he was nice, quiet and attentive.\n\nThe food is great, worth your money for AYCE. \nMy only complaint, is during the day the windows had no blinds and the sun was right in my face, also it's a very tiny space but that they cannot help. \nPut up some blinds next time and I'll be back for sure!"
        }, 
        {
            "index": 138, 
            "rating": 4, 
            "review": "I guess a review update is overdue after 3.5 years.\n\nSushi Twister is a very convenient all-you-can-eat sushi restaurant because I live so close to it, but it hasn't ever impressed me enough to avoid the long drives to my favorite AYCE sushi spots. It's next to Starbucks and is near the 7-Eleven gas station on Boulder and Tropicana. One of my friends wanted to eat here last night, and I agreed since I most likely haven't been back here in over a year.\n\nThe appetizers are pretty good. Aurora shrimp are fried and breaded shrimp with a mayo-based sauce, and they really hit the spot if you're into that sort of thing. Their version of baked mussels either has little or none of the creamy sauce, but instead draw flavor from a dark sweet sauce. The sea eel tempura, which I don't recall trying before, is tasty and has the eel flavor but without as much of the typical sweetness of eel sauce. The tuna poke could've used more tuna but was otherwise a decent rendition. The screaming orgasm was delicious and had extra crunch from the tobiko (flying fish roe) mixed into the ubiquitous sauce.\n\nThe nigiri options are solid, although I'm always disappointed that super white tuna is not a standard option. It did make an appearance last night a special, and it did taste nice in spite of being topped with a sauce. I wasn't able to try it prepared sauceless because they ran out, which wasn't that shocking since it was late. I was pleasantly surprised at how good the limited nigiri options were. The sweet shrimp were flavorful and didn't feel mushy (and the fried heads were also nice), and the uni was above average for AYCE. While it wasn't the best that I've tasted on an AYCE menu, it wasn't discolored and didn't have any off-putting flavors. I only recall tasting salmon and tako among the other nigiri options, and both were also good.\n\nI didn't have that much room left, so I kept myself to half rolls. I had to get my \"namesake\" Chris roll, which is shrimp tempura with eel on top. It was as good as I'd remembered. Sadly, I failed at reading comprehension and didn't enjoy my remaining choices. Mind you, they weren't bad in and of themselves, but the Cowgirl was entirely vegetarian inside and only had some seared beef on top, and the baked roll Alaskan Summer was not the best meal-ending option for me because it has a spicy yum yum sauce, rather than a standard yum yum sauce.\n\nOne reason that I've avoided returning is the limit of one dessert per person, and that hasn't changed. The mango mochi was an easy choice, and it's the standard mochi that you'll find anywhere. It was yummy, but I prefer having several desserts with AYCE sushi.\n\nI was happy with the flavor and quality (AYCE-wise) of all of my orders, so perhaps I'll be back to Sushi Twister more often than once a year. It's quite a solid restaurant, but for those who don't live nearby, it's not destination-worthy. I'd only recommend it if you're exploring all that Vegas has to offer or if you've somehow tired of all the other places."
        }, 
        {
            "index": 139, 
            "rating": 3, 
            "review": "I like sushi twister, I really do. But do you have to be such Nazis about the AYCE rules? \nYour are already one of the more expensive AYCE in town, I've been here 1000 x's, yes I know No SHARING , Eat RICE, No leftovers & you are going to swoop around my table checking my progress if you think I have ordered too much. \nThe fish is good quality, I give you that...but when nearly every roll is fully fried or involves SOMETHING fried, it isn't really fresh anymore anyway right? \nI like how the menu is set up with \n*baked rolls\n*fried rolls (even tho, again almost everything has shrimp tempura or crumb)\nBUT when ordering AYCE thu almost always immediately take away your menu & give you the paper one which does not show even HALF of the appetizers &\nEven some rolls available w AYCE! If you are on this side of town, go for it....but there are friendly, TASTIER AYCE places closer to town!"
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "Was here earlier in the week. First, I loved the fact that I didn't have to go far from home to find this  place. Second, it was not too big or too small of a place it was perfect. We both ordered the AYCE with half portions. Everything we tried was good we also had the baked mussels and a dessert.  We are both small girls but we found that we were able to taste many of the items without wasting anything.  The staff was fast, friendly and attentive despite how busy they were this day. \n\nWe were not disappointed and will definitely be back for another AYCE session here."
        }, 
        {
            "index": 141, 
            "rating": 4, 
            "review": "AYCE is the way to go.  The selections are great too, not just sushi rolls, lots of interesting things to try.\n\nI like that they have half-rolls so you can try different ones without filling up on just one item.\n\nWe go here every time we are in Vegas, it's worth getting off the strip to come here."
        }, 
        {
            "index": 142, 
            "rating": 5, 
            "review": "OMG All the chefs and dishwashers and servers and host or ess greet you at the same time as you walk in. They ask if its your 1st time here and i said yes because it was. They explained all that was included in AYCE sushi. I felt at home. The chefs constantly check up on you and the quality of the sushi. Which ya know before i really ate the good stuff. I thought the stuff they have at a buffet was decent. WELL NOT ANYMORE. PFFFT BUFFET SUSHI EWWWW ICK. Sushi Twister is great. I dont like scallops but I recommend trying Dynamite which is Baked scallops on a half shell and they still come out frying to your table. DELIC. And i love how most rolls come out in half portions if you request it so you can try more. There is one with Mango sauce on top OMG it was great. And they give you a stamp card. I think this one in my eyes tops them all. I shall be back. And i dont pass around 5 stars lightly but this one i think ill make my residence SUSHI DEN."
        }, 
        {
            "index": 143, 
            "rating": 1, 
            "review": "Okay so I decided to give this place a try again and was going often again. Again the owner pissed me off. I was there for lunch one day and I sat at the bar in front of the owner. Everything was going fine until his friend showed up with his own fish. The owner started to cut his friends fish and setting up sashimi plates right in front of me and decided to completely ignore all my orders after. He started to give my orders to the guy next to him. It sucked I left with great disappointment. So I decided to never sit in front of him again like I told myself last time. I went in there with my family and wanted to sit at the bar. We waited for about an hour for a spot at the bar because it appeared that again the owner was serving his friend and somebody who appeared to be his brother. I have spend thousands of dollars at this place and I do not get treated well there. We still did not get to sit at the bar and that was it. I am never going there again... I left and found another all you can eat spot that night. Sin city sushi is off of Eastern in Henderson just south of the 215. To my surprise when I walked in. JIMBO!! the old owner of Mandas that use to be on Sahara :) If any of know sushi in Vegas that was one of the most popular spots in Vegas.  The service was outstanding unlike twister and I recommend that everybody that goes to twister to try this place it is so much better and the service is great!"
        }, 
        {
            "index": 144, 
            "rating": 2, 
            "review": "Customer service was great! \nThe sushi unfortunately was not. \n\nIt was bad. The rice was bad. The fish was bad. The sauces were bad. Even the tea somehow was bad. \n\nI don't want to be mean and put a place down, but I want people to know and not make the mistake I did. I'm a Las Vegas local, and if you're looking for ayce sushi or sushi just in general, choose a different place.\n\nIn conclusion, everything tasted bad.\nBut the staff was very nice, fast, and happy to serve it to you."
        }, 
        {
            "index": 145, 
            "rating": 5, 
            "review": "Love this place.  Authentic.  Customer friendly.  Glad you're in the neighborhood!  Good food.  My go-to neighborhood Sushi restaurant."
        }, 
        {
            "index": 146, 
            "rating": 3, 
            "review": "We've eaten here many many times. Honestly, we mostly come here because it's close to where we live. Twister has its good points, but really only worth going to if you are hungry and close by.\n\nThe service is prompt and very friendly. The staff are great! The decor is comfortable.\n\nWe only ever come here to do the AYCE. The quality of the fish and preparation varies between good to mediocre. But it's mostly always good.\n\nSo if you want to fill up on enjoyable sushi, Twister will be good. If you want an exceptional sushi experience you may want to consider more expensive options."
        }, 
        {
            "index": 147, 
            "rating": 5, 
            "review": "I always have to visit Sushi Twister whenever I am in Las Vegas. Absolutely cheap prices for Japanese food and amazingly delicious! I love this place so much, on my second time eating there, I didn't know what the name of the restaurant was, where it was, but I drove around Las Vegas blindly for 2 hours until I finally found it. Absolutely worth the risk, you should of seen the look of joy on my face when I eventually found it! Can't wait to go back!"
        }, 
        {
            "index": 148, 
            "rating": 4, 
            "review": "I really like the all you can eat, it's close to the house and its an average price. The service is good and the ambiance is nice. I like the smaller space and the food is really good as well."
        }, 
        {
            "index": 149, 
            "rating": 5, 
            "review": "Bomb.com! It was 5 of us doing all you can eat, we sat at the bar and they were slanging rolls for us left and right. All of them were soooo fudging good! In love and will be back again and again."
        }, 
        {
            "index": 150, 
            "rating": 5, 
            "review": "I got the lunch special that day and I was one happy lady. A heaping bowl of rice with a good portion of teriyaki chicken plus a side salad, miso soup, and a hand roll, all for under $7 - mind-blown. You can't get good food like that for that price in Hawaii, so this is must while in Vegas!"
        }, 
        {
            "index": 151, 
            "rating": 1, 
            "review": "In June I had gone with a large party and it turns out someone had forgot to pay. I've gone about two more times since June. When I went yesterday 10/22 with some of the people who were in that party they were not serving us. The manager came to talk to us saying that one of the waitresses remembers us and she pulled out all the photo copy checks from June!! Four months ago!! She said she can't serve us unless we paid the bill. No one in my party did this on purpose someone just forgot since some people where paying for each other. She stayed there telling us it was the young woman who was with us and we need to pay if we want to eat. I've been coming to sushi twister for 5 years now and have never been treated this way! We told her take the card and charge it if that's what you want. It was only 30 dollars. We weren't arguing that we didn't want to pay she just approached us very unprofessionally! She literally kept our photo copy receipts in the front just waiting for us to come through the door! In the end we told her charge the card it was probably my friends mom who forgot and the manager was like \"no it wasn't her so I'm not gonna charge you then.\" She made us go through this whole ordeal and embarrass us and in the end didn't even want the payment. It's ridiculous!!!"
        }, 
        {
            "index": 152, 
            "rating": 5, 
            "review": "Okay usually trying a new place and scoring it 5 stars hardly ever happens to me .but last night I came in with my sister and her kids the food was so satisfying from the moment we walked in to the very end our experience was perfect so perfect I'm here again today for lunch . Wow I'm so happy I came back again I'm having a great meal. The sushi is great and so is the customer service they are all very attentive like filling up your cup.... Thanks for the awesome service and Food!"
        }, 
        {
            "index": 153, 
            "rating": 4, 
            "review": "Good sushi. Always clean and friendly.  Sometimes when i order the salmon nigiri it comes out warmer than expected. Cool atmosphere,  especially they have a projector that plays movies /tv on the wall. Neato"
        }, 
        {
            "index": 154, 
            "rating": 4, 
            "review": "I was skeptical because of the location but, boy, am I glad we tried it!  Great ambiance & great sushi!  We usually stick with nigiri-sushi b/c we aren't crazy about a lot of the sauces and other crap some places use in their rolls.  But we tried a few at Sushi Twister and they were winners - especially the Spider Man and the Boulder Crunch.  \nMMM!  Can't wait to go back.  They also had a two person dinner for $30 (the folks next to us ordered it) and it looked like a ridiculous amount of food.  Definitely going to try that next time.  AYCE was $26.95 for dinner, pricing it competitively with most other AYCE places.\n\nSomeone mentioned it wasn't kid friendly ...but when we were there on a Tuesday night (it was packed that night) there were tons of kids.  The kids menu was pretty darn cheap if you ask me so I'm definitely going to bring my 7 year old next time."
        }, 
        {
            "index": 155, 
            "rating": 5, 
            "review": "My favorite AYCE sushi spot.\n\nIf you go in the evening especially on the weekend expect a long wait for a table.  They don't take reservations and have a small dining area and average size sushi bar.  \n\nIt is worth the wait however - sushi chefs are great and will do custom rolls if you request it.  Wait staff is efficient and friendly.  Food comes out quick and I've never had our order wrong of tried a roll I didn't like.\n\nI would recommend this place to any sushi lover that doesn't want to pay al la carte prices.  \n\nMy favorite roll: salmon loves lemon"
        }, 
        {
            "index": 156, 
            "rating": 5, 
            "review": "Love this place and the staff!  Been coming here since it opened and love that they remember us, even if it has been awhile. Good food and great people!!"
        }, 
        {
            "index": 157, 
            "rating": 3, 
            "review": "Thought I'd try something new for AYCE sushi. I usually get simple rolls. Liked it but didn't feel it was quite as fresh as other Henderson spots. Nigiri yellowtail w jalapeño. Tuna. Seared tuna. YelloW mango roll. Salmon loves lemon roll. I'd come again but wouldn't likely go out of my way. Didn't love the seaweed salad. Movie screen w music videos and sports games above."
        }, 
        {
            "index": 158, 
            "rating": 4, 
            "review": "Wow, this place was goooooood. Very clean, big big plus. Friendly waitress, love it! The food was so good. The only negative, I couldnt find it in the plaza, lol. \nSo, I ordered the lunch special veggie tempura. It came with miso, salad, and 4 california rolls. The miso was good. Not too salty and it was flavorful. The salad was yum. It wasn't a typical ginger dressing, but it wasnt that sweet poppy stuff some places use. I would have liked a bit more but it was a lunch portion, so I can't complain. The rolls were good. I wish the crab wasn't the \"mush\" it was, but the rice was REAL good. The wasabi seemed \"muted\". I like it nice and spicy and when I put a big glob on my roll, my nose immediately opens up. It wasn't the case here but it was good. The tempura was delicious. Not greasy at all and I love love the pumpkin squash. LOVE IT! The carrot was perfect and so was the broccoli. I will definitely come back here when I am in the neighborhood. Very good! Oh, and the prices for 2 lunches was less than $15 for all that. I'd say that's pretty darn good!\nSo, good food, good service and good prices, right up my alley!"
        }, 
        {
            "index": 159, 
            "rating": 5, 
            "review": "I've been a regular for almost a year now. Sushi twister is by far my favorite sushi spot in Vegas. \n\nThe staff is excellent, they are very prompt and friendly. I've never had bad service even when they are super busy.\n\nAYCE is decently priced and they provide a good amount of special rolls to order from. I usually go a la carte if I'm there with only a couple of friends and their dinner and lunch specials are very cheap and the portions are satisfying. \n\nThe fish is fresh, the sake is cheap, everything there is amazing.\n\nI definitely recommend this place, this is one of the best sushi restaurants in Vegas. I'm all about first and second impressions, and they never fail to satisfy me. I will be a regular customer here."
        }, 
        {
            "index": 160, 
            "rating": 3, 
            "review": "Eat a lot of sushi.  This place was real average.  Did the all you can eat, they do a ton of fried type rolls.  Wasn't real impressed.  Go to Sushi Yama instead."
        }, 
        {
            "index": 161, 
            "rating": 4, 
            "review": "I've been back a couple of times since writing my first review of Sushi Twister.  The sushi lunch special that costs under $10 comes with a very generous amount of food.  I will definitely come here again if I am in the mood for sushi at lunch time.\n\nLast night my wife and I ordered the Deluxe Bento Box meal (or whatever it's called).  It supposedly serves 2 people, and it costs $30.  Well, after we had each eaten ourselves to an uncomfortable state of fullness, there was enough food leftover to have fed an additional person.  It came with 11 pieces of sashimi, a reasonably large plate of assorted rolls, and then the holy-crap-there's-more-food? final plate that consisted of grilled teriyaki beef, teriyaki chicken, a piece of grilled salmon, and several pieces of tempura.  For $3 more than the all-you-can-eat price for one person, my wife and I ate until we felt ill.\n\nThis isn't the best sushi restaurant in Las Vegas, but it has some terrific deals.  Nothing worth driving across the city for, but if you're nearby it's worth a visit.  Plus, it's in a nice and small room, so the service is usually pretty quick."
        }, 
        {
            "index": 162, 
            "rating": 3, 
            "review": "Tried this place for the first time and thought it was good. Services was good, food was good, and price was decent. Expected great based on previous reviews but at least I wasn't disappointed. Alaskan Summer was pretty satisfying... Cowgirl was also satisfying. Waiter did not miss a beat when it came to filling me up with soda, so that made me happy. Give this place three stars because I've had better, and I've had worse."
        }, 
        {
            "index": 163, 
            "rating": 5, 
            "review": "Absolutely amazing .. we tried the all you can eat lunch . Their rolls are delicious my favorites were the sushi twister the ninja and the cowgirl I can't wait to go back again it is definitely my new favorite place to eat AYCE sushi."
        }, 
        {
            "index": 164, 
            "rating": 5, 
            "review": "Don't let the location of this place fool you. It's very good sushi. The all you can eat deal includes almost all of their rolls and such."
        }, 
        {
            "index": 165, 
            "rating": 4, 
            "review": "This place is a good local place to eat. Prices are amazing. Lunch specials are great. Sushi is fresh and quick. I enjoy this place. Now service sometimes can be a little rough but most of the time great. I'd recommend this place as a casual night out for sushi"
        }, 
        {
            "index": 166, 
            "rating": 5, 
            "review": "This is our new \"go to\" sushi place. Reasonable price. Fast service. Tasty."
        }, 
        {
            "index": 167, 
            "rating": 4, 
            "review": "Sapporo on draft, saki in several flavors, and rolls that will make you slap yo mama."
        }, 
        {
            "index": 168, 
            "rating": 4, 
            "review": "My guy friend took me here for a belated birthday lunch, & I must say it was worth the drive since we live on the other side of town. Since it was my first time & my friend was bragging about how good the sushi is, we did mostly half rolls. This is probably the most sushi I've ever tried in one sitting :P Thank goodness for those half rolls! Anyway, the server was helpful & attentive. Right when you come in there is an anti-bacterial foam dispenser :) We were sitting in the middle of the restaurant at one of the higher tables. I don't remember them having a tv, but they did have a projector screen above the entry to the restrooms. They also have a Sushi Twister point card; after 10 all you can eat purchases you get one free~\n\nNigiri garlic tuna - it tastes just how it's described. delicious :P\n\nN.Z. Mussels - not big on mussels, but the eel sauce & cream cheese made it taste better for me!\n\nCall a doctor VS Friday the 13th - the sauces come on the side, but I really enjoyed this roll. it took me another 5 minutes to take another piece, but it was great. the habanera [isn't it habanerO? hm] is what got me\n\nEcstasy - I barely remember this roll because the Call a dr. was still burning my mouth. haha, but I know it was tasty! Spicy tuna with cucumber inside with more tuna on top\n\nSpider Man - soft shell crab, cucumber, crab meat thats deep fried with eel sauce always gets me ;) dont forget the shrimp on top!!\n\nAngry Ninja - this was new to the menu, same as the ninja roll but with habanera sauce on top. I dont know why, but that habanera sauce always felt like it was burning UNDER my tongue too. haha, weird\n\nMagic Mountain - super duper light. there was barely any rice in this roll, so if you wana take a break with the carbs, eat this!!\n\nCrispy Vacation - Most of the time I have soy sauce with my sushi, but this was the ONLY roll I dipped into soy sauce. Not as much flavor as I wanted, but then again those spicy rolls were probably still messing with my taste buds :/\n\nJapanese Lasagna - This was my friend's favorite roll & he always gets it when we eat sushi. Honestly, they taste the same to me cause there's so much going on. I'm not hating though! I prefer to eat the baked rolls when I'm juust about to get full\n\nSalmon Loves Lemon - I don't remember ever having a roll like this, but it was good! The sourness from the lemon was perfect since the lemon slice was super thin :9\n\nVolcano - same description as Japanese lasagna.. and I have never had these many rolls in one sitting! BLAH\n\nOh My God - having soft shell crab & eel sauce is cheats! haha, I enjoyed it & my friend said \"it lives up to it's name.. OMG!!\"\n\nFor dessert we had mango mochi ice cream & green tea ice cream. By this time I'm ready to explode from all the sushi. I went into the women's restroom [no, I did not #2 in the restroom! haha]. The signs on the door are so cute btw! But it was very clean & even had a nice floral scent in there. Sushi Twister, you had me at the foam hand sanitizer!! I will return with my boyfriend asap."
        }, 
        {
            "index": 169, 
            "rating": 4, 
            "review": "After many of our friends recommended it we finally decided to give the place a chance. I should say straight off, I don't like sushi, as such I stuck to the bigger dinner meal. The price point is low, most full meals under $10. I had the steak which was not bad, certainly good for the price, my wife had the teriyaki chicken, which for $8.95 is amazing value.\n\nSo the food is good, the price is more than right, so why only 4 stars. Simply the service wasn't good. For example, order a diet coke to drink, waitress bring iced tea, no big deal, but to have to remind her twice isn't good.\n\nAnd the biggee, a pet hate of mine, unlisted food items in a meal, not a big deal to most people, but to those with alergies it can be very dangerous, as such I asked what came on my dish, steak, rice, soup and salad (told you its good value) of course the part that wasn't mentioned just happens to be the dangerous food for me, onions, luckly they were in plain sight, so no issues, again an issue mainly for me, but still something that even McDonald's can get right."
        }, 
        {
            "index": 170, 
            "rating": 5, 
            "review": "My favorite sushi place in Las Vegas. The garlic tuna nigiri is so delicious. AYCE is a bit pricy, but totally worth it. I have no idea where they get their fish, but the quality is amazing. \n\nSomeone wrote that they prefer Xtreme Sushi, and made some comment about the plating here. I urge that yelper to go have a meal at Xtreme and enjoy the wasabi-less and ginger-less plates of sushi made with super warm over cooked rice (which isn't even short grain sushi rice), oh and the unidentifiable fish."
        }, 
        {
            "index": 171, 
            "rating": 5, 
            "review": "They all greet you with great energy! The place has high energetic music which is a great as it sets the fun atmosphere I always order the Spicy Crab cut roll along with the California Roll very delicious!\n\nThe Chicken Teriyaki is also great love their Miso Soup and Vegtable Tempura so if you are out to try somthing very casual with great sushi then try this place. \n\nOh by the way the whole staff shouts out I suppose Thank You when you leave in Japanese I guess this is their way of practicing good Feng Shui :)"
        }, 
        {
            "index": 172, 
            "rating": 5, 
            "review": "Had been going to sushi mon for a while... Last experience there was not good. I had been hearing about sushi twister. Food was great! Staff was awesome! Must of been my lucky day that we got seated right away!! Really loved the Alaskan summer roll!! Biggest perk... Close to home!!"
        }, 
        {
            "index": 173, 
            "rating": 1, 
            "review": "i had ONE piece of sushi left at the end of my meal. seriously, ONE! the lady server told me if i don't finish it i'd have to pay fir that whole sushi roll. so instead of arguing with her i just shoved that last piece in my mouth. so silly. what a way to lose a customer...over 1 piece of sushi lol"
        }, 
        {
            "index": 174, 
            "rating": 5, 
            "review": "Best sushi by far....tried others and keep coming back. \nNice atmosphere, best sushi and great service.\nOur go to for sushi!"
        }, 
        {
            "index": 175, 
            "rating": 4, 
            "review": "Mon-Thurs is happy hour after_9pm. The place is small. You are right next to strangers but if you don't mind that then its all good. Service is awesome. The staff is on top of it. The food is YUMMY. Children's menu is 8 and under which I think should be like 10 and under but the serving is worth the 3.99. Overall I'm happy I found a sushi place that is clean, close to home, affordable and delicious. I will be back for sure."
        }, 
        {
            "index": 176, 
            "rating": 2, 
            "review": "The atmosphere was good and the restaurant looked clean.  The staff was pleasant and attentive.  The menu selection was good with all of the normal items for AYCE and a good selection of unique rolls and appetizers.  Food was delivered quickly when ordered.\n\nI am only rating this as 2 stars because the quality of the fish from my experience was lower quality than what I expect from a sushi restaurant.  There were a couple of pieces of tuna and salmon that I didn't want to eat because it didn't look fresh.  We also had issues with one of our rolls falling apart."
        }, 
        {
            "index": 177, 
            "rating": 2, 
            "review": "Excellent food, but the service was far below their normal tonight. We brought a long-planned group of 10. As of this writing, we've been here for two hours and have only gotten about half of our sushi.\n\nThe restaurant has been quite crowded tonight, so I guess the delays are understandable, but we would have liked faster service."
        }, 
        {
            "index": 178, 
            "rating": 5, 
            "review": "Some of the best sushi I've had!! We enjoyed the all-you-can-eat deal and it was with every penny of the 26.95! The price included all you can eat appetizers, sushi and sushi rolls and dessert.  I really liked that they had an option for half rolls so you could try a variety and not fill up on just a couple rolls. Our sushi chef was so nice and accommodating and the entire staff was friendly.  Highly recommended!!"
        }, 
        {
            "index": 179, 
            "rating": 4, 
            "review": "nigga this sushi soooooo fire. I'm a nigga and you know we don't write comments but this was so bomb I had to. yall should go!"
        }, 
        {
            "index": 180, 
            "rating": 4, 
            "review": "We waited for 20 minutes on Saturday night and sat down at the counter. Sushi Chef in front of us was very friendly and gave us very quickly what we ordered such as Salmon handroll,etc.We also ordered from menu which come from the kitchen. Overall, you can feel the Traditional Izakaya ambience even though the building is new. Even after their closing of 11pm, I did not feel hustled to leave and we were very comfortable. We hope they are open till a little bit more late so that we can stop by after the Eastside Cannery concerts which usually finish around 10:30pm."
        }, 
        {
            "index": 181, 
            "rating": 2, 
            "review": "Used to be one of my favs in Vegas, been a loyal lover for years. Have been so disappointed in Sushi Twister last 6 months. Quality, service and atmosphere has changed enormously over the years but not for the better."
        }, 
        {
            "index": 182, 
            "rating": 4, 
            "review": "Try sushi rolls here! Miso soup with shrimp head in it. mmmmmm"
        }, 
        {
            "index": 183, 
            "rating": 4, 
            "review": "I wanted to eat Ramen today, but the Ramen world is just so complicated.  I can't go to Monta anymore because the tall Japanese girl who works there figured out who I am and she has been treating me real bad since I posted that bad review about the place. \nI can't go to Shuseki anymore because it turns out the psycho old man from Ichiza eats there every night, and he is still pissed off at me because a few months ago  I made a very unflattering impersonation of him. \nI don't want to go to Anime Ramen anymore because ever since Ryosuke went back to Japan, the service and food has been bad. I hope he comes back soon. \nSo, I was just about to go to Yagyu for Ramen when I remembered that SUSHI TWISTER is owned by the same dude who owns RAMEN SORA. So in my head I was like: \"Maybe Sushi Twister will have Miso Ramen since they are owned by the Sora people!\". The very thought of me eating AYCE Sushi and Sapporo Style Ramen at the same time overstimulated my brain. I was very disappointed when I arrived at TWISTER to see no Ramen on the menu. But, after ordering two pieces of Nigiri and having a great conversation with the Japanese sushi chefs, my disappointment left instantly. \n\nThis place actually has AYCE TORO! I have NEVER seen that before. But according to one of the workers, the AYCE TORO is like a random promotion. Some days when you show up they will have it, but most days they won't have it. So coming here for the AYCE TORO special is like gambling. \n\nThe Tuna nigiri has the highest quality Tuna I have seen in years. It wasn't even Toro but it had that fatty marbling. The fish was so shinny that the light reflected off it like a shard of glass. The Tuna literally just instantly melts inside your mouth. \n\nThe Eel Sauce with my Unagi was very strong. I don't know how they get the sauce to have that certain kind of deepness. \n\nI love places that make their own tempura sauce. Places that use that generic bottled stuff suck. SUSHI TWISTER has possibly the best Tempura sauce I have ever had. \n\nThey got the best Sushi Rice on the face of the earth. It's seasoned perfectly! Many people don't have the sophistication to notice small details like that, but because I am so awesome I can.\n\nMy personal favorite \"Ichiro Mashita\" roll is the Dead Dragon. You should try it! \n\nI also want to point out that this is the only AYCE Sushi place I have ever been to that puts wasabi in the nigri. Other AYCE Sushi places don't do this because they market their restaurant towards \"westerners\". \n\nI am actually really happy that I came here today. I had a very entertaining conversation with the a chef named Hiro. And all the workers were really great to me. \n\nWhen it comes to AYCE Sushi, Goyemon can't touch this place. Also, I rather come to small independent places like SUSHI TWISTER or SUSHI ON RAINBOW any day over one of Martin Kollefs multi-million dollar bankrolled hipster/douchebag sushi orgy places.\n\nUPDATE OCT- I've lowered the rating from 5 stars to 4 because one of the sushi chefs accused me of being \"HOOTO\". When I told him that I didn't know what that was, he began to describe the person. Eventually I figured out that he meant Hootie B.... I was like: Are you f*cking joking? Do I look like a middle aged man with a Korean wife? Apparently, he thought I was \"Hooto\" because I told him about how most people on Yelp want to kill me. Don't get me wrong. I am a big fan of Hooto reviews and his Sysco comments always have me rolling on the floor laughing, but how the hell do you confuse me as him?"
        }, 
        {
            "index": 184, 
            "rating": 2, 
            "review": "Okay went to sushi twister today due to the fact that my new sushi bar does not open for lunch on saturadays which is \"island sushi\" on eastern ave.  I went here because the yelp reviews were good. here's the low down.\n\n1. went for lunch  around 2pm today price $21.99 for all you can eat sushi.\n\n2. the selection was good including a wide a sortment of appetizers and rolls.\n\n3. Tried my favorite roll rainbow it was okay, too much rice so we stopped ordering rolls and went straight for the nigiri.\n\n4. the seared tuna and garlic tuna, halibut were great. The eel anago was good also.\n\n5. your all you can eat sushi includes dessert, red bean ice cream good stuff.\n\nWhy did i give them only 2 stars, it's service the wait staff who took your appetizer orders were good. but the sushi chef started out nice but kinda of ignored us seeing that we eat a lot. Last time I check I payed for all you can eat. We did'nt exceed the time limit which is 45 min for lunch. Also the fact that me and my friend were the only ones in the restaurant, there were two sushi chefs and they were extremely slow, like I said we felt like we were being ignored after few orders. It's like you bastards eat too much so it's time for you to go. Hint hint. The food is good but because of that factor I could not reccomend this place unless all options were closed.\nOnly bright thing the sushi chef did give us couple of blue fin tuna nigiri but so what, in the end its the service that keeps you coming back. You dont know how many friends i have that eat sushi that could pop up you business. \n\n\"\"\"I hope that the owners read this review and change their attitude because why advertise all you can eat in 45 min if your not gonna honor it, towards the end i felt like i had to beg the sushi chefs for more. Also island sushi lunch is 1.5 hours double the time of sushi twister and they were so nice and the food was unbelievable****\n\n\nHonestly I would have given this place 4 or 5 stars if it was'nt for the service. You advertise all you can eat, it better be all you can eat without the guilt."
        }, 
        {
            "index": 185, 
            "rating": 3, 
            "review": "I like the food here and I've been getting to-go orders for many years now (since this place opened). But recently, I've been finding myself WAITING for my to-go order. Before, I used to come, pay, and pick up my order (this is normally the process everywhere). Now, even though they tell me it'll be ready in 15min, I come at 30min and I STILL have to wait another 10min for this new guy to show me my order, in an snail-like manner, and watch him fumble through wrapping my order. I would greatly appreciate it if my orders were ready to go when I come (I'd even wait a few more minutes before leaving home to make sure it's ready). Please, re-train this kid! I'm usually very patient, but the to-go process has been upsetting me every time this kid is working."
        }, 
        {
            "index": 186, 
            "rating": 2, 
            "review": "Ok sushi but not worth going out of the way for. Wait staff is rude and pushy. On top of that, the location is one of the worst areas in the Las Vegas valley"
        }, 
        {
            "index": 187, 
            "rating": 1, 
            "review": "Spend 50 bucks on meals with salad and this is how much salad dressing they give you.  They used to fill it up.  The last few times it has looked like this.  If you ask them to fill it up now they charge you.  You guys needs to get back to basics and stop cheating us!"
        }, 
        {
            "index": 188, 
            "rating": 5, 
            "review": "My second favourite sushi place in town! I've been coming to this sushi place since the 1st day it opened! Years ago!\n\nLoved it then, love it now.\n\nGreat pricing, great food, and great service.\n\nMy only complaint is sometimes there's a long wait and the front area is really smaller and crammed."
        }, 
        {
            "index": 189, 
            "rating": 4, 
            "review": "The food was pretty good and the service was fantastic and fast.   It was a good value for the money."
        }, 
        {
            "index": 190, 
            "rating": 4, 
            "review": "5 stars for service. I'd give more if there was an option. 3.5 for food. But this IS based on a Togo order. \nI've been really craving sushi lately and since my bf doesn't eat it, I need a close solid take out option. I've had 2 personal friends rave about it, so I ran in (in slippers) and grabbed a menu. I decided on the Boulder Crunchy, the 9-1-1, and the jalapeño popper. The 9-1-1 was my favorite. Jalapeño was my least, BUT it wasn't that I didn't enjoy it. Just not my style, spicy tuna/crab mix inside a jalapeño like a popper. \nThe woman who took care of me was SO SWEET. She seemed shocked that I tipped her. (Step your game up non Togo tippers) \nAlso I didn't know this was Ramen Sora's sister place. Now I really can't wait to check them out, and also return here for the AYCE option. I will also be getting more Togo rolls as well!\nPS took pics but they didn't do my food justice so I will post next time :)"
        }, 
        {
            "index": 191, 
            "rating": 4, 
            "review": "Great service with friendly staff right from the start. We had the steak and a couple of rolls. Everything we had was fresh and yummy!"
        }, 
        {
            "index": 192, 
            "rating": 3, 
            "review": "Ok so first of all let me start off with this place gets super packed, people standing outside type of packed. Our wait time wasn't so bad so we stayed. The food was good and fresh but the customer service was shit! We had plates stacked up next to us waiting to be taken off the table, the only reason we even came here was because we just so happen to be on the east side so this place was convenient at the moment but my boyfriend and I will probably never come here again"
        }, 
        {
            "index": 193, 
            "rating": 5, 
            "review": "Jillsa and Yamasaki took care of our sushi needs! Both are recommended to the fullest. They are here dinner time off mon and tues....see you soon!"
        }, 
        {
            "index": 194, 
            "rating": 5, 
            "review": "Not the first time I've been here but great every time! Never wait in line for a table of two. I advise calling if you have a group for reservations.The AYCE menu is amazing,Friendly greetings always. Love going during lunch, you get what you pay for.  will definitely come again!"
        }, 
        {
            "index": 195, 
            "rating": 4, 
            "review": "Mmm..  4 stars .. sushi Volcano very yummy!!!!!! I'm recommend it! But not have herbal tea...  Not napkins on the table.. Sushi with Tuna very salt! ( (( I don't eating it......."
        }, 
        {
            "index": 196, 
            "rating": 5, 
            "review": "I hadn't been to this place for a few years due to living in Japan, so I was quite happy when I returned stateside and found myself moving into a place just down the street...proximity to good sushi is an important aspect of living a full and happy life to me, man. The quality has remained excellent, some of the chefs are extremely pleasant and the rest are still efficient, amicable enough fellows albeit more focused on creating the sushi at hand. All of the servers have been quite friendly and cheerful enough, so we've always felt welcomed when dining here. If you order the amaebi they may offer you the deep fried heads as well- I for one fully suggest consuming those crunchy little craniums, they're delicious! Their screaming orgasm wiz a twist is, naturally, tastegasmic, though if I'm going to be totally earnest I'm enamored with any dish that combines thin shreds of crunchy daikon with a savory soy and mayo sauce. Their baked mussels are fabulous, as is their sea eel tempura. The quality and flavor of the uni and ikura have yet to fail me, and their octopus and hokki are consistently fresh with appealing and appropriate mouthfeel. My boyfriend is quite fond of their ika tempura, which has a sweet chili sauce, while I very much enjoy their seaweed salad. \n\nYummy, consistently fresh food in a welcoming environment in an unexpected location.\n\nThey offer happy hour deals where some of their more popular menu items are available ala carte at discounted prices. \n\nYou can also opt for a LARGE beer, in a glass that's at least 10\" tall!\n\nGochisousama deshita!"
        }, 
        {
            "index": 197, 
            "rating": 5, 
            "review": "Wow! Great sushi in a totally unexpected part of town. I've been craving sushi and as such, didn't want to waste the craving on less-than-stellar sushi - and I was not disappointed in this place. Very friendly staff, attentive, pleasant. I ordered a spicy scallop handroll almost immediately after walking in the door, just to shut my yowling stomach up. It was fresh and tasty; next time, I'll ask for a bit more \"spicy,\" though, because it was more mild than spicy to me. Next I ordered hamachi (yellowtail) nigiri, and it was perfectly cold and melted in my mouth. I was intrigued by the Dead Dragon roll so finished my lunch with a half order - avocado, shrimp tempura and eel all wrapped up in a roll, tempura-battered and deep-fried, and drizzled with eel sauce. It was deliciously yummy! I'll definitely be back to this place."
        }, 
        {
            "index": 198, 
            "rating": 2, 
            "review": "We are regulars here. The San Francisco fire is amazing! All the rolls are amazing. The downside is their policies are rigid and tend to make the experience not so great. It's next to a sbux and you CANNOT bring in coffee, but they also don't offer coffee. Their iced tea is low quality and not good. The apple saki is amazing though! They are sticklers for the late night special. Everyone MUST buy a drink, even if 3 out of 4 are drinking alcohol, they will penny pinch you (we are talking the difference of a dollar!). We in fact love this place but management definitely needs to change their policies."
        }, 
        {
            "index": 199, 
            "rating": 5, 
            "review": "Favorite place here in town and great prices!!"
        }, 
        {
            "index": 200, 
            "rating": 1, 
            "review": "Wasn't the best quality sushi, the fish was extremely dry and smelly. None of my orders seemed fresh at all and my cup of water even smelled horrible. My rice was pretty hard on some of the rolls and this was more than one experience. I tried it a second time with a friend that wanted to try it so I gave it another shot and same bad experience. I was so upset because I was recommended this place and I would NEVER recommend this sushi spot to anyone. The lady we ordered from was hard to understand and I was trying to be polite as possible but she was getting irritated that I couldn't understand and was rude when I would ask her to repeat herself because her accent was too strong for me to understand."
        }, 
        {
            "index": 201, 
            "rating": 5, 
            "review": "Love this place. The service is always awesome and so is the food! Decently priced too!"
        }, 
        {
            "index": 202, 
            "rating": 4, 
            "review": "The selling point about Sushi Twister is the endless rows of items you can pick from that a regular customer could possibly spend a couple months eating here without ever needing to pick the same item. Can't think about which appetizer to choose? Bad news, folks. There's more than 20 appetizers to pick with not one option being any more than $7. Did another AYCE sushi not provide enough nigiri options? This one has another 20.\n\nI actually wasn't in the mood for rolls but just wanted some plain tasty raw seafood. I love how this place seems to understand me unlike other restaurants. I never understood the concept of wanting to buy 12 pieces of the same tuna, so they offer \"mini-bowls\" that provide half the portions so you can order another half of something else.\n\nI left with a lovely Chirashi bowl. Because I'm a slow eater and have odd eating hours, I ordered it to go. Holding true to visual presentation, the my to-go had the assortment of seafood so nicely done over the rice that eating and taking it apart was almost saddening. I never thought I would feel that way about a to-go order.\n\nFor those of you who either want to try a little bit of everything and not break the bank, Sushi Twister hits the spot."
        }, 
        {
            "index": 203, 
            "rating": 5, 
            "review": "A friend of mine told me about this place.  He said I can eat real Japanese food in Vegas.  He was so correct!  Japanese owned and run, the food is great.  We had a bit of everything.  Sushi, rolls, tempura and teriyaki.  All were great.  One of the best tempura I have had outside of Japan.  Great food and low prices!  This place is way off the strip, and well worth the drive. \nService was great!"
        }, 
        {
            "index": 204, 
            "rating": 2, 
            "review": "For the past few years we have loved this restaurant, however customer service has not been the best. Its time to find another sushi place. Not interested anymore. If the owner doesn't care about customer service why the sushi chefs care! BAD SERVICE!!"
        }, 
        {
            "index": 205, 
            "rating": 4, 
            "review": "This review is based solely off take out .. which is why only 4 stars because I have not had the chance to dine in yet.  With that bieng said I plan to do so very soon based off my two experiences so far with ordering sushi to go from here.  Placing my order each time over the phone . And it bieng ready when I arrived was nice . They greet you as soon as you walk in the door (which the place is a little small but in a cozy kinda way) the food itself was good.  I had shrimp tempura which the second time was so amazingly crisp I was very impressed.  The sauce is served on the side which helped in keeping it crisp until you bite into it. The prices are pretty good as well. And I noticed they have some decent lunch specials.  I definitely recommend."
        }, 
        {
            "index": 206, 
            "rating": 3, 
            "review": "The food was really good . Got a basic California and some green tea ice cream. The only reason they only get 3 stars is cause the customer service was terrible !! My friends decided to try a spicy tuna roll and they hated it which is not a big deal. But they wouldn't do anything about it, not even replace it with a regular California. So that was kind if dissappointing . Other than that the food was good. Don't come here expecting a1 customer service though!"
        }, 
        {
            "index": 207, 
            "rating": 5, 
            "review": "If you're looking for a good quality sushi place, then Sushi Twister is the place for you! They have delicious and savory sushi there. Here is a list of sushi that I recommend to everyone who is reading this:\n\n- Double Dragon (cooked eel sushi with cream cheese and eel sauce)\n- Magic Mountain (deep fried sushi with tempura, salmon, and cream cheese)\n- Caterpillar Roll  (eel with avocado and eel sauce)\n\nThe shrimp tempura is like heaven in your mouth! It's crispy, crunchy, and savory. When you first bite into the shrimp tempura, you'll be all like \"Wow! This is the best shrimp tempura ever!\" Me and my daughter go here about a few times a month. It's not that expensive. So if you're planning to go to a sushi place... GO HERE! If you don't you'll certainly regret it! ;D"
        }, 
        {
            "index": 208, 
            "rating": 5, 
            "review": "My friend introduced me to this place, and honestly it's worth the long drive from Mountain's Edge when I know that I will be eating fresh quality fish. \n\nWe did the AYCE, and it's totally worth the price! We added up how much we ate one night, and it was over $120, but with AYCE, it was only $60! That's half price people!\n\nThe halloween roll was super yummy. Spicy without being crazy mouth on fire spicy. The fresh salmon is buttery and soft. The seared tuna nigiri is also one of our favorites. The dynamite appetizer of baked scallops, onions and mushrooms is TO DIE FOR. Also the screaming orgasm of fresh raw fish chunks. Yum. My mouth is starting to water just thinking about the fish here. \n\nHonestly I have been to SO MANY AYCE sushi places, including the famous Sushi Mon in Silverado Ranch. This place is better. If it was closer to my house, I would be here at least once a week."
        }, 
        {
            "index": 209, 
            "rating": 2, 
            "review": "I went here again with my boyfriend a couple weeks ago. Waitress is very nice. We ordered a roll with mango. No taste, extremely bland. We ordered the first round of nigiri, it had no Wasabi in it. Then when we ordered the second round, they put Wasabi underneath the fish and rice like the traditional way. Then the third round, no wasabi. Kinda weird. Tuna was try, Hamachi was slimey. \nEverything was bland or tasted like sushi I could get at Smiths. There were also bugs on the wall and trash on the floor. I mean, it's right across the street from Crack castle. What did I expect, really. \nI'll stick to blue fin when I'm on the east side."
        }, 
        {
            "index": 210, 
            "rating": 5, 
            "review": "There aren't very many choices as far as sushi go on the east side of Vegas. Hidden in a slightly sketchy strip mall is Sushi Twister. Now don't be scared if someone hits you up for a cigarette or try to sell you fake flowers, but push beyond that to the sushi goodness! \n\nI haven't done the ayce here, but my love is the sashimi plate. They have beautiful cuts of fish. I also love that they have a small and large option when it comes to the sashimi plates. For you ayce lovers they also will do half rolls!! \nIf you are looking for something to accompany your sushi I suggest the Dynamite. It has scallops coupled with mushrooms and beautifully caramelized onions that totally add a sweetness to the dish. \nIf you are looking to kick back a couple cocktails they do offer many beers. They are super reasonably priced.\n I've had their house Plum Wine and their Plum champagne. I definitely prefer the champagne. It has a much lighter and fruitier taste. It does pair well with the sashimi in my opinion. \n\nThe staff! Omg nicest people ever. Plus, they definitely have a sense of humor. I've knocked over several of their plastic menu stands and they are always nice about it and joke with me. They are even kind to my father who tends to get messy with his soy sauce and wasabi mixing. Plus, their music selection is spot on!!!! Props on that. It's something that definitely sets the tone for a dining experience.\n\nI think this place is spot on with everything I've tried! I look forward to trying more."
        }, 
        {
            "index": 211, 
            "rating": 5, 
            "review": "My boyfriend and I really like sushi, and he is sort of a sushi guru, so we're rather picky.  I was hesitant when he dragged me out after 10 one night about a week ago to a late night sushi in a less-than-picturesque area of town.  I was extremely pleasantly surprised when we ordered our first bits from this sushi buffet.  Yummy food, very fresh seafood.  Friendly staff.  We've already been there a second time! \nBtw, he suggests the Angry Ninja :)"
        }, 
        {
            "index": 212, 
            "rating": 5, 
            "review": "Love this place! All you can eat, super fast service. Great customer service. We love Wendy! I have a 5 year old who is a super picky eater and would never eat sushi and they also serve French fries for kids! We thought that was awesome!"
        }, 
        {
            "index": 213, 
            "rating": 4, 
            "review": "Their fish looked really fresh!  Especially the salmon.  I like a nice orange marbleized piece of salmon.  I decided to try a couple of nigiri sushi and half a roll of Matsuri.\n\nSushi Twister is located on the corner of Tropicana and Boulder Highway.  It's next to the gas station and shares the building with Starbucks.  \n\nService was really fast.  The sushi chef was very friendly.  \n\nMy first two orders were the salmon nigiri and the garlic tuna nigiri.  Both really fresh pieces of fish.  What I really liked about the nigiris is how firm the fish and rice are (they did not fall apart) AND the small piece of wasabi they add in the middle of the nigiri!  If you eat it all in one piece, you are sure to clear your sinuses!  My favorite part of the nigiri experience is definitely the surprise piece of wasabi!\n\n\nLast, I got a half order of the Matsuri - four rolls of shrimp tempura, cucumber, tuna, drenched in Ecstasy sauce.  Ecstasy sauce contains fish eggs, mayo, ponzu, and I believe a little bit of chilli oil.  No need to dip it in soy sauce...the ecstasy sauce was amazing!  \n\nI really like how they offer both regular and half rolls, especially for times when I want to try more nigiri sushi than regular sized rolls."
        }, 
        {
            "index": 214, 
            "rating": 5, 
            "review": "I'm from South Orange County and if anyone resides in Orange County, then you know there are a LOT of Sushi Places and many are all you can eat. I frequent the Lake Las Vegas area often and HAVE to go to Sushi Twister everytime. The chefs are NICE, funny and quick to make your order. The staff is responsive and most importantly, the fish is REALLY fresh! What i like most is the variety of entrees and rolls you can order in addition to being able to order half-orders so you can try a wide-array of rolls.\n\nBest AYCE sushi joint in Nevada and I have tried a lot in Las Vegas area...not many come close to the Twister! Highly Recommend!!"
        }, 
        {
            "index": 215, 
            "rating": 4, 
            "review": "Dinner at this East side sushi spot is $26.95 per person. There were 2 of us and we sat at a half booth in the back. The service was fine. We ordered about 7 different things right away, and ordered more rolls after that. The server kept telling us we could order half rolls, as if he didnt think we could finish the full rolls. Ha! We sure showed him! But it is nice they have the half roll option. \n\nThe salmon loves lemon roll is deliciously refreshing, if you like lemon and salmon you must get this. The salmon nigiri and garlic tuna were my favorite of the evening, and I love that garlic sauce they use on top of the tuna. For dessert I had mango mochi and red bean ice cream. The red bean was super sweet and tasty. Just a note only one piece of mochi per person for AYCE, which I think is a little stingy. After all you are paying around $30 for dinner with tax.  I would recommend this place for sushi if you are in the area."
        }, 
        {
            "index": 216, 
            "rating": 5, 
            "review": "Amazing service!! Our server was josh. He was soooo tentative, always on it, asking if we needed anything and he had a lot of tables to serve too!! And they were so fast in getting out what we ordered! The specialty rolls were so different and the names were classic..\"call a doctor vs. Friday the 13th\". Too fun!!!!"
        }, 
        {
            "index": 217, 
            "rating": 4, 
            "review": "We went for all you can eat sushi lunch special. My husband and his sister eat meat so they loved the menu options and the rolls they got. It was quite a variety. And the service was very quick and good. The rolls were coming out so fast. I would just say they for veggie sushi it's not the best place because there isn't much variety. I have been to numerous sushi places in California New York and Florida and they have a good variety of veggie sushi, ones where they use fried eggplant, or flavored tofu, or veggie tempura sushi, they just use different varieties of veggies and make them very flavorful and I haven't found a place like that in Vegas yet."
        }, 
        {
            "index": 218, 
            "rating": 5, 
            "review": "My husband I have tried a lot of AYCE sushi places in Vegas and this is our all time favorite. They have a huge menu. My hubby likes the raw and spicy stuff and I am all about the cooked and non-spicy. It was hard to find a place with a large selection of both. But Sushi twister has it all. And the non-raw sushi is not just different versions of the California roll like a lot of sushi bars have. Lots of appetizers too. \n\nMy favs are scallop twister without hot sauce, spiderman and the OMG and my husband swears by the sushi twister, rum jungle and rainbow roll."
        }, 
        {
            "index": 219, 
            "rating": 5, 
            "review": "Yup.... This place is legit...all reviews on point.... \nWas in Las Vegas for a quick minute and needed a good sushi meal.\n\nWho did I call on for sushi assistance...?? Yelp Of course!\n\nYup all you can eat off the menu whatever you want fresh rolls made to order for 26 bucks! \n\nThis is a locals joint off the strip way off the strip, umm yumm is all I can say, and had my fill of all different types and styles of sushi! \n\nOne of my favorites of the night was the Salmon loves lemon roll..\nThis place serves Sapporo and Asahi beer as well...\n\nGood service and quick, it is small so we had to wait a bit to sit down.\n\nOh and the all you can eat menu includes any appetizers or desserts you want including mochis! \nI did the math, it's a good deal."
        }, 
        {
            "index": 220, 
            "rating": 4, 
            "review": "Brought five of us here after hiking Goldstrike all day, and everyone really enjoyed everything. I've been to many, many sushi restaurants in town, and this is one of the best (at the moment, since quality can change). The rolls are awesome and the nigiri is awesome."
        }, 
        {
            "index": 221, 
            "rating": 4, 
            "review": "Great sushi spot in a not so great neighborhood.  Staff is very friendly & aytentive. Great food & prices."
        }, 
        {
            "index": 222, 
            "rating": 5, 
            "review": "So I had this all you can eat certificate and I decided to give this place a try today. Hot tea, miso, appetizers and desert were included in the all you can eat option. When I entered, I was greeted with a warm welcome. It was my first time sitting at a sushi bar--and I'll tell you it's pleasant to be here. My server was super nice. I'm the type to be casual with my own kind, so not only he was nice, but he was fun to talk to. The service is an A+!!! As for the food, I ate until I felt dizzy from being full. Yeah, the sushi was super fresh and that amazing. I ate 80% of the nigiri section of the menu. As for the appetizers, I ate tempura. Their tempura was the best, crispy and well made. After all that, I chose strawberry mochi as an option for my desert. Overall, I had a great time. \n\nGonna come back soon!"
        }, 
        {
            "index": 223, 
            "rating": 3, 
            "review": "I'm giving this place three stars because my friends really love it. I'm not a sushi person by any means but my girlfriend loves it. Honestly I was wasn't terribly impressed. I had the chicken Katsu and it wasn't very good. Ok at best. The green tea wasn't great either. The next day I fell I'll with food poisoning and I'm pretty sure it was from this place. Service was good though :)"
        }, 
        {
            "index": 224, 
            "rating": 4, 
            "review": "Nice and fresh very tasty .Dang was our chef  and very friendly and professional. .great job !"
        }, 
        {
            "index": 225, 
            "rating": 4, 
            "review": "I did a take out order and the staff was really friendly, sushi was great too. :)"
        }, 
        {
            "index": 226, 
            "rating": 2, 
            "review": "Thought this place was grody. \nI hated the food, the service and location\nSorry but it's true"
        }, 
        {
            "index": 227, 
            "rating": 3, 
            "review": "Sushi, I'm sorry but I'm just not that into you.. Seaweed (yuck), raw fish (cringe), and huge bites at a time (gag).. but I digress.. \n\nMy other half has a deep love for sushi (and most things Asian for that matter, haha) so I like to be a good sport and attend these all you can eat feeding frenzies whenever the suggestion is made; it's me compromising ;) \n\nNot located in the greatest parts of town, we entered the somewhat warm establishment. We were greeted right away and sat with a quickness. The server took quite a while taking our drink order and didn't express much in the way of personality. \n\nThe music was quite eclectic, Asian techno, to indie music, to um..??? The decor was bland, much like the chicken dish I ordered but the cucumber salad was sort of redeeming really, how can you screw up cucumber salad anyway, right? \n\nThe other half enjoyed one roll (I forgot which one) out of (I lost count), several and stated that a return visit wouldn't necessary be in the cards. Not that the food or service was so terrible, but that there are plenty of other, \"better\" choices out there for sushi. \n\nI give this joint 3-stars because it wasn't terrible and it was about as fantastic as an inexpensive sushi place could be to a non-sushi lover. \n\nBest part: cucumber salad and price \n\nTry it, or don't..whatevs ;)"
        }, 
        {
            "index": 228, 
            "rating": 4, 
            "review": "This place is always packed! I really like their gyoza here and there are some awesome rolls on the menu. Best Sushi on the eastside!"
        }, 
        {
            "index": 229, 
            "rating": 5, 
            "review": "I actually really really like this place. And I'm glad it's down the street from my house.\n\nAnyways, service is awesome. Such nice servers and chefs. Really accommodating and friendly!\n\nThe food is really good. The fish is really fresh as well. The only problem I had was that the eel sauce was actually really bitter... So... Lol. Pass on that! But the menu is pretty vast and appealing to all. The cowgirl roll. OMG, that damn roll is the biz. The twister roll hella bomb too. Whatever that salsa is on top of it, oh man, it really compliments the dish.\n\nIf I could give them 10 stars, I totally would. I pass by here all the time on the way to work and I always stop by and get a sushi trio bowl or poke bowl to go. Under 10 bucks? Come on you really can't beat that..... Love this place, keep up the good work guys."
        }, 
        {
            "index": 230, 
            "rating": 4, 
            "review": "Visiting from out of town, looking for a sushi deal.  Not a large place, very little waiting room. Slight rotten egg smell coming from outside nearby wasn't pleasant.  Kitchen looks a bit chaotic/seedy but they did a good job of making the dining room pleasant (mainly paint the ceiling black and use minimal quality lighting.) \n\nWe had to wait twice as long as stated on a weekday evening about 7.  Got the AYCE (seems pretty standard around Vegas to have the $26.95 AYCE in many sushi places.)  Quality of fish was decent, about what I get for a middle of the road type place in Seattle.  I like that they didn't give you tons of rice in each piece.  Sat at the bar.  After I hit about $35 equivalent value, the chef was definitely not as attentive and you had to be more assertive about ordering more.  Could be he just got busy too.  Was impressed AYCE includes one order of sweet shrimp and Uni (if you want it.)  \n\nItems off the regular menu; scallop dynamite: NASTY - a pool of oil.  Green salad - way too much dressing, couldn't eat it, and it's the spring greens not the crisp iceberg lettuce I'm used to getting in most traditional Japanese places. Tempura Bowl, good, a little on the overdone side and the pour the sauce on instead of giving you a dipping bowl.  Agedashi tofu, good.  \n\nService, okay.  They were really busy.\n\nThis is a generous 4 stars."
        }, 
        {
            "index": 231, 
            "rating": 4, 
            "review": "Chicken Teriyaki &amp; Tempura Dinner Special w/ CA Roll, Mixed Green Salad, and Miso Soup\n- Tempura was lightly battered and not too oily\n- CA roll and Mixed Green Salad were both good\n- Miso Soup was slightly salty\n- Rice was too hard, not enough water when cooking\n\n1/2 Crispy Vacation\n- Roll was rather minuscule\n- Spicy Tuna wasn't very spicy\n\nService was friendly and prompt.\n\nfyi. All you can eat special isn't the best value. At ~$26.95, you are limited to merely 1 hour, ordering a little at a time, and will get charged if you don't finish all your food... including all the rice!\n\nDinner special and 1/2 roll totaled ~$20 after tax and tips and I was stuffed!"
        }, 
        {
            "index": 232, 
            "rating": 4, 
            "review": "Staff was friendly and patient \nGot everything we ordered and correctly\nLove that they have children AYCE price \nThey even have a separate children's me I in case they do not want sushi\nI had the seaweed salad\nEdamame\nNinja \nSpider- 2nd favorite\nSpider-Man\nFirecracker - my favorite\nMexico-  wasn't hot at all\nFried California roll \nAnd a few others but they all taste pretty good. \nWe loved the red bean and green tea ice cream\nWas most impressed with our servers,very nice people.\nOnly thing is the \"booth\" like seating was a bench seat along the wall it made it super awkward and too close for comfort to the people next to us. We say between two other people and we were almost touching elbows lol. Other than that it was a good experience and we'll be back."
        }, 
        {
            "index": 233, 
            "rating": 4, 
            "review": "Best all you can eat sushi in town? But \"Best\" is such a big word so let's settle for \"Great\".\n\nThe place has become a fail-safe dinner option ever since I moved into town. Service is great & very prompt, no matter what you pick off the all you can eat menu, its always pleasurable.\n\nThat being said my current tally of what I've  had (will continually update):\n-Kill Samurai\n-Crispy Vacation\n-Spider Roll\n-Rum Jungle\n-Dynamite\n\nWhile I'm not a big fan of my scallops (Dynamite) swimming in a bowl of grease & mayo, after you shake off all the grease its light on the palate & heavy on taste. \n\nJapanese salsa is such a wonderful food invention! Light, rich, mildly hot & extremely versatile that would I would prefer all my sushi be served with it! Or just pack it up in a jar for me to consume at home!\n\nIt seems that their menu has changed since my last visit before I started yelping."
        }, 
        {
            "index": 234, 
            "rating": 5, 
            "review": "I love that this place is away from the strip so you don't get a lot of tourists. This has been my favorite sushi place in Las Vegas for over 4 years. \n\nThe nigiri is the freshest in the valley. The sushi chefs take pride in their cuts so they cut from the meat when you order and they're not sloppily prepped earlier in the day.\nYou can even see sushi rice prepped through the day. \nThis sushi rice is perfect. Not soggy or overcooked like other sushi places. \n\nService is always consistent. Servers are nice and attentive. \n\nWhile I don't spend my time on specialty rolls, they are worth getting also. I particularly like the tiger yamazaki and spider man."
        }, 
        {
            "index": 235, 
            "rating": 5, 
            "review": "This place is so damn good.. they have actual Japanese sushi chefs every now and then which I was pleased to find out last time I came here. \n\nFirst time having the chef actually put wasabi on the nigiri at an AYCE place. I remember they usally dont here, but I ate at the bar and I think the chef knew I was a sushi snob since I was ordering only nigiri and not just basic tuna and salmon every time like most people around me were getting.\n\nThe Ikura is by far my favorite here, its just really fresh and the nori is always fresh and super crispy.\n\nThe service was great, and the girl there actually noticed I come here pretty often and gave me a stamp card for a free ayce on my 12th ayce. That was a nice gesture so thanks to her Ill be coming back asap, even though they owe me like 4 stamps in reality."
        }, 
        {
            "index": 236, 
            "rating": 4, 
            "review": "good food nice staff my only problem maybe is the exposed kitchen on the background when youre sitting on the bar coz its wierd when youre looking at dishes that needs to be cleaned.."
        }, 
        {
            "index": 237, 
            "rating": 5, 
            "review": "I'm loving the all you can eat sushi! Dead dragon is so good. And Philadelphia roll is also delicious."
        }, 
        {
            "index": 238, 
            "rating": 5, 
            "review": "First time there and I was blown away by the food and low price. Recommend and I'll be back soon."
        }, 
        {
            "index": 239, 
            "rating": 4, 
            "review": "Lunch time special can't go wrong, grilled salmon cooked to  perfection ., have eaten her more than 10x's"
        }, 
        {
            "index": 240, 
            "rating": 1, 
            "review": "They definitely need to work on customer service. I probably won't eat sushi for a year after dining here."
        }, 
        {
            "index": 241, 
            "rating": 5, 
            "review": "This place was fantastic. I ate here with some friends while we were visiting Vegas. It's a cab ride away from the strip but it was definitely worth it. High quality food, great service, & a great atmosphere."
        }, 
        {
            "index": 242, 
            "rating": 5, 
            "review": "I sat at the bar and ordered Asahi (regular) which cost five dollars but it is a delicious beer and well worth it.  To start I had two pieces of sear tuna which melted in my mouth the sweetest umami flavor imaginable. That cost 4.25 I ordered a half roll of spicy crab which could have been a little spiceier but overall was delicious. I finished that Asahi pretty quickly and ordered a sake bomb that coat 3.85. I guzzled it down and ordered a deep fried royal California. the whole meal was $21.02. I highly recommend this establishment."
        }, 
        {
            "index": 243, 
            "rating": 1, 
            "review": "Terrible service...wish I could give less stars but it won't let me. I walked in and they were moderately busy but all the servers continually ignored me for a good 5 minutes when there were several empty seats at both the bar and a few seats in the table area. They even walked by me multiple times while I stood there so I know they saw me waiting to be acknowledged as a customer. Then finally they sit me at the bar and there are 3 empty seats so I pick the one in the middle so I am not sandwiched in between two people and can enjoy my dinner more comfortable and both the server and chef make a big deal about it wanting me to sit on the left seat. So annoyed about it being a big deal I then asked to be sat at a table instead. So they sit me at a table and what I would like to drink so I order a coke. I look around the table and of course I have no menu so I wait for a server to come over so I can ask for one and they ignore me for several minutes giving me plenty time to write this review here. Finally they ask what I would like and I proceed to ask for my check, paid for the coke and told them I'll take my business elsewhere. I live near this sushi bar and had been going there frequently since I have lived over here and the service has continually gotten worse and worse each time. I refuse to go back there anymore there are way too many good sushi places and for the cost of AYCE you shouldn't have to be ok with terrible service like this I don't get why they have such good ratings on here."
        }, 
        {
            "index": 244, 
            "rating": 5, 
            "review": "They customer service is great. They refill drinks like crazy! They also greet everyone coming in and out. Oh and the food is amazing and cheap!!!!"
        }, 
        {
            "index": 245, 
            "rating": 4, 
            "review": "always yummy when I eat here... fresh and I like that they serve half rolls even if you are not AYCE"
        }, 
        {
            "index": 246, 
            "rating": 2, 
            "review": "We have been going here for over 2 years and quite a few loyalty cards  have been used, but today was the final time. We noticed that in the past it was \"hit and miss\" few times on the quality and customer service but we hung in there. Today we arrive at 3:30 so we decided to try something different. The place was quiet with two other couples already dining. My husband ordered a \"bowl \" and I ordered a combo lunch, chicken and tempura with 4 pieces of sushi,soup and salad.We both get our soup and a few minutes later my husband gets his bowl and starts to eat after 5 minutes we inquired about my lunch and was  told it was coming right out. After my husband finished his bowl and was done I was still waiting. The wait staff never approached us for any refills and never came with my lunch. After a 1/2 hour we got up paid the bill and told them we will never be back... And my lunch still wasn't done!"
        }, 
        {
            "index": 247, 
            "rating": 5, 
            "review": "Let's just say that I can eat here everyday during my trips to Vegas and I'd fly back to Hawaii completely satisfied. I am a tough critic when it comes to fish....whether it's raw or cooked, I can only eat it fresh. I will literally gag if I'm served previously frozen fish.\n\nWith that said, Sushi Twister is not only awesome for serving fresh fish, but the AYCE concept just blows my mind. How can they serve such great quality fish at such reasonable prices? I mean, $30 per person for AYCE sushi AND kitchen ala carte items?! What?\n\nAnyway, everything I ate was good. I especially liked the toro, uni, and amaebi nigiri sushi. I'm not into maki sushi but the oh my god roll which consisted of scallops, crab, and yum yum sauce was really delicious. And the agedashi tofu and hamachi kama from the kitchen menu was cooked to perfection!\n\nService was great, ambience is perfect, and always a good time at Sushi Twister."
        }, 
        {
            "index": 248, 
            "rating": 2, 
            "review": "Occasionally we order take out from here and get the ninja, spider, kill samurai, boulder crunch & tiger rolls and the salmon teriyaki dinner combo ONLY because its closer to home.  Generally we love to do AYCE and have tried a lot of them throughout the LV valley. So this time we decided to give Sushi Twister a try for AYCE since it was late and we didn't feel like driving too far.  The sushi was ok but none of which were fantastic; this time we also tried the Angry Ninja (new item) , ecstasy & Matsuri.  The place was very busy and at first the waitress seemed very nice but as the evening wore on, she forgot an order and wasn't as nice.. maybe it was because we had 3 toddlers with us. Well we were a party of 4 adults and 3 children all under 3yrs of age.  At the end of dinner, my husband gave his mochi ice cream to 2 of the toddlers and the waitress came over and yelled NO SHARING! you cannot share with the little kids!  My goodness that was just 1 little mochi ice cream ball and she made a big deal about it and embarrassed us at the restaurant.  Food wise we would rate them a 3 star because the sushi was ok but not outstanding.  The best place we love for AYCE or not is SIN SITY SUSHIi, I love Sushi is also very good but they do not offer AYCE.  We took off 1 star from our overall rating because we will not give this place our time or money anymore because of the incident with the mochi ice cream and also because they included the 3 kids in our party total and automatically added 18% gratuity.  I don't think this place is kid friendly.  From now on, I would rather spend my money on gas and drive 20 minutes for fresh and great tasting sushi as well as outstanding service other than Sushi Twister."
        }, 
        {
            "index": 249, 
            "rating": 5, 
            "review": "WOW this is the only place I can get the Salmon Loves Lemon Sushi Roll. It's my favorite!"
        }, 
        {
            "index": 250, 
            "rating": 5, 
            "review": "I've been coming here since I was a junior in high school and this place is always as satisfying as the first time I walked in ! Great environment and welcoming staff. Sushi is fresh and very tasty."
        }, 
        {
            "index": 251, 
            "rating": 3, 
            "review": "I was very excited to try this place as it had wonderful reviews and is very close to my new house. Unfortunately it didn't live up to the hype :(  it's about $3 more expensive than most other sushi places for ayce dinner and I wouldn't mind paying it if the food was better, b it it's not. I can easily think of 3 better places that are cheaper. Also, the ambiance just isn't there. Decor seems like more of an afterthought and thrown together, music was atrocious.  It was a variety station of crappy 90's and early 2000's music, and none of the songs you liked from then either, and the rap was edited to top it off.  I'll give them an A+ for service, our server was a total sweetheart and very on the ball. The sushi, was just missing something,  the fish was fresh enough but it seemed of a lower quality than somewhere like Yama ( too bad they have terrible service).  Sorry twister, won't be back. I'll drive across town to Daisho, they have good food and good service."
        }, 
        {
            "index": 252, 
            "rating": 5, 
            "review": "The night was young and the family was hungry. The family needed food fast. And I am not talking about plain restaurants, I was talking about delicious sushi chaos! So I knew the perfect place to tame the wild beasts of a family was the one and only, Sushi Twister!  It is also owned by Ramen Sora in Chinatown.\n\nThe trip was a little farther than our home. It was on the other side of town and in a sketchy area. As we got there, we were disappointed and excited because of the long wait in line. It took 20 minutes! But once we got inside, the waitress brought our drinks in a jiffy. Now comes the sushiness you've been waiting for!\n\nSo we started with a large order from the AYCE menu, the long wait had starved us. We got the usual rolls like caterpillar, dragon, and lots of salmon nigiri along with some of  their special rolls like the tiger yamazaki and the sushi-twister and ninja. The \"salmon loves lemon\" was slightly tart when eating with the slivers of lemon, but was oh so good! The crispy vacation roll was crunchy from the garlic flakes with a nice bit of spicy from the tuna.  The orders came so fast that we had to order MORE! \n\nWe ordered the yellow mango with shrimp though the yellow mango was a bit overpowering. The baked scallop appetizer was a little too burnt on top and a bit oily for our taste. Baked mussels were also pleasing. The ordered chicken skewers brought us accidentally to another dish called the pork katsu with a tasteful sauce. All the rolls had good consistency.  The overall experience with the dishes were outstanding, just like the staff's fast and friendly service! \n\nThe interior of the place was a tad bit tight, thus creating the long line. There was a projector screen which had the Sochi Olympics showing. It was a nice size for entertainment. The atmosphere was busy and the chef's were making those great rolls. The prices are comparable in town with kids 8 and under for half the adult prices.\n\nOverall the service and sushi overcame the long wait and trip so I gave them 5 stars. In the end we came home happy, stuffed, and satisfied!"
        }, 
        {
            "index": 253, 
            "rating": 5, 
            "review": "my favorite sushi place. nigiris are good and eveything is so delicious. the one thing i dont like is mussel. but alsakan summer is the best. i am coming here only for alaskan summer !!!!"
        }, 
        {
            "index": 254, 
            "rating": 5, 
            "review": "They have the best all you can eat sushi in Vegas! I love this place! When I think about sushi the 1st think that comes in my mind is Sushi Twister. My favorite is lasagne, Mexican n fire cracker. I wish they have domestic beer tho. Great job guys!!!"
        }, 
        {
            "index": 255, 
            "rating": 4, 
            "review": "here is all japan,very good sushi,i realy like this place specialy the Rice texture n flavor is all ways made to perfection Yama Sam always try to serve the fast is posible one thing i like here u order half rolls to few menu items i recomend let start the cucumber salad n the japonise dressing is excelent, best Dinamite,garlic abacord as well the Tuna was very good, spice Rainbow also the spice Tuna with Abacord on top krispy onion and the extacis dressing wow is good, overall yes go eat there is very good i think you will loved,"
        }, 
        {
            "index": 256, 
            "rating": 5, 
            "review": "A absolute love this place. My husband and I have been coming here for years now. Never a disappointment. Everyone I bring here with me becomes a lover. I always get the ll you can eat and the variety of sushi and appetizers is amazing. I recommend the tiger Yamasaki roll or the matsuri roll."
        }, 
        {
            "index": 257, 
            "rating": 5, 
            "review": "sushi twister all you can eat sushi baby! on point.  I love the all you can eat sushi because you really get your moneys worth. they have delicious fried sushi, baked sushi, and spicy sushi. great variety. i would list all my go to sushi dishes but i can't remember all of their names exactly. all you can eat lunch is 24$ (i think?) and dinner is like $26 or $28 a person. they also give you a stamp card, for every 10 all you can eat meals you get 1 free. \n\nif you don't want to do the all you can eat, you can get a bento box or whatever else you want. \n\ngreat food & service is nice. the space is not that big, so sometimes on the weekends it could get busy for dinner."
        }, 
        {
            "index": 258, 
            "rating": 5, 
            "review": "This place is awesome. The food is fantastic. The bento box is huge. Service was awesome,  this place was jumpin... will definitely return."
        }, 
        {
            "index": 259, 
            "rating": 5, 
            "review": "This place has awesome quality sushi, appetizers, entres you name it.. It is our favorite sushi spot. The sushi chefs/ servers are so awesome and friendly. They always greet you upon entering the door. I love the nigiri and there rolls. Nigiris have a quality taste of freshness and their rolls are unique and tasty. I would highly recommend you having an AYCE experience at this place."
        }, 
        {
            "index": 260, 
            "rating": 5, 
            "review": "I don't know why it took me so long to write a review for this place. This is our favorite sushi place to go to. Near our house and the best sushi around.  The service is great and the food is amazing. Good fish to rice ratio. They also have shiso which alot of sushi places don't have. You can order half rolls for all, except for the rolls that have soft shell crab. The menu is alphabetized and they also have the rolls by category (i.e. spicy, deep fried, baked, etc.). Dessert is included in the AYCE, limit of one for mochi ice cream. For the non sushi eaters, they have a full menu as well. If you are with a large group, this may not be the place for you as it is a tiny restaurant. Great date night place for couples and if you sit at the bar the chefs are all very entertaining. All in all a great place to come."
        }, 
        {
            "index": 261, 
            "rating": 5, 
            "review": "They really have a great value on their food.one of the best AYCE sushi in Vegas. Atmosphere is casual but nice. The people are nice and friendly. staff are friendly and remember your regular orders. there may be a time limit on \"eat all you can eat\" but the service is the fastest  i seen.the price is reasonable you can not go wrong.."
        }, 
        {
            "index": 262, 
            "rating": 5, 
            "review": "Great combos meals with a great value. Sushi was great. Even the boring \"California roll\" was nice. Special rolls are great! Loved their tampura as well."
        }, 
        {
            "index": 263, 
            "rating": 4, 
            "review": "Love, love, love this place. Customer service could use a little improving, depending on which server you get. I kind of miss the previous servers, they seemed more friendly than the ones now, but maybe because they're understaffed or something. I'm giving this place 5 stars because they always serve the freshest sushi and sashimi around. The other day they had oysters, not all you can eat though, sad to say, and that was soooo good, so fresh, you wonder where they got it from, seeing there's no large bodies of water for miles!! The prices are reasonable, both all you can eat ($21 lunch, $25 dinner) and menu items. Their lunch special is cheap ($8.95 for chicken teriyaki, soup, salad, California roll, and tempura) and the portion is good. A couple of  things I would like to request are: a changing table in the bathroom, since my girls' timings are always perfect! And another location in the west side or north side of town (Sushi Twister is located on the east side of town closer south) it is a bit of a drive for us to get to Sushi Twister, but we make the trip anyway just because it is well worth it."
        }, 
        {
            "index": 264, 
            "rating": 5, 
            "review": "Sushi was fresh, well made, and quite tasty. It's a real small place you would hardly notice driving by. But it's worth a stop. We didn't do the all you can eat special they offer. The rolls, nigiri, and sake were all exceptional."
        }, 
        {
            "index": 265, 
            "rating": 5, 
            "review": "We came here around 7ish. We were around the area and we were hungry and my husband was craving Japanese food. YELP suggested Sushi Twister. So, we tried it. \n\nIt was a small place though. I though it was a big restaurant. The lady greeted us and asked us to wait for our seat. It was kinda busy too. It was our first time for an eat-all-you-can Japanese food. \n\nThe price was reasonable. The server was japanese and she told us how it works. The service was okay. It was fast service. The sushi taste so GOOD! I mean SO GOOD! I ate almost everything in their menu. I love the salad and the miso soup. If I could go back here I would.\n\nI love the mochi ice cream too. We went home so FULL and we were really satisfied. However, the japanese lady (I think she is the owner) when she was taking our last order, I felt like she doesn't want to take it anymore because we had too much already. LOL! \n\nThanks to YELP reviews, we were able to find our favorite Japanese restaurant."
        }, 
        {
            "index": 266, 
            "rating": 4, 
            "review": "A solid sushi spot with lightening fast service. Our meal was pretty good, but there were some misses. \n\nPros: \n1. Super fast service and friendly servers.\n2. Thick cuts for the Nigiri.\n3. Rolls are super tasty and right amount of sauce.\n\nCons:\n1. Way too fast service for certain items. We ordered two orders of Hot shrimps and Jalapeno poppers and they came out way too fast. I like my fried food Hot and Crispy, and ones we got were lukewarm and Not Crispy!! \n2. Uni and Amaebi were not as fresh as I would like to be, but they were not spoiled or anything like that. \n3. Poki contained four pieces of tuna and 95% seaweed salad. I think I would have ordered seaweed salad, if I wanted to eat that much of seaweed. Haha!\n\nI think place is pretty amazing with many loyal customers and I would recommend it to fellow yelpers."
        }, 
        {
            "index": 267, 
            "rating": 4, 
            "review": "This place is probably my favorite sushi joint on the East side of town.  They have a great selection of rolls and have good quality fish.  For some reason, I find it hard to find spicy crab rolls, and this place has great ones.  The boulder crunchy, which is an avocado and tempura shrimp roll, is also great.  Their tempura is light and tasty, although, they are a bit skimpy on the order size (they give you two per order, another place I go to gives you three).\n\nMy only quibble with this place is the service.  While they are nice, as another reviewer said, after a few plates of sushi, one gets the feeling that the wait staff as well as the sushi chef is ignoring you while thinking, \"Stop eating!\".  Some servers are better than others about that, but this is the one place I go where I feel like this is almost always an issue, whereas it is not with other sushi places I've been to.  I think that for the price they charge for an ACYE dinner, and accounting for the frequency of which I dine there (and always tip well), this is a bit uncalled for."
        }, 
        {
            "index": 268, 
            "rating": 1, 
            "review": "Worst sushi restaurant I have ever been to. The fish looked discolored and didn't smell very fresh. I went there for dinner with a friend and we were both disappointed. That experience got me to avoid eating sushi altogether for a while...will not recommend this place to anyone!!"
        }, 
        {
            "index": 269, 
            "rating": 4, 
            "review": "The all you can eat choice is great if you can pack food into your stomach. It's not buffet style (pre-made and slowly rotting as the unwashed masses touch the food and put it back when they change their minds), and instead you order from the waitress. It's great that this isn't a buffet and there's no time limit to ordering, but the bad side is that you can't just get food when you want it. This encourages people to order *a lot* at once and invariably the you end up with more food than your stomach can handle.\n\nThe rolls themselves are quite tasty, each one a mix of the basic fish (tuna, salmon, yellowtail) with other maki standards such as crab, avocado, tempura, sweet and/or spicy sauces, etc. You'll definitely find a few that you'll like given that there seem to be about 20 rolls on the menu. \n\nOn top of rolls and sushi, the AYCE allows you to order anything else they serve as well, so you could really gorge yourself on dumplings and salad if that was your fancy. I believe the only thing with a limit are the mochi ice creams of which you're only allowed one.  No big deal since by the time dessert rolled around, I was so stuffed that I involuntarily gave our nice waitress the stinkeye when she asked me if I wanted mochi as well.\n\nSushi Twister is fun with some interesting decor choices (why are there two carpet dryers on a display area near the ceiling???). The wait staff is super nice and friendly if a bit overworked when I went for a saturday lunch; there was only one girl working the whole restaurant.  I really do like this place and have come back quite a few times when visiting Vegas.\n\nJust remember that as with any type of AYCE, be ready for eater's remorse."
        }, 
        {
            "index": 270, 
            "rating": 4, 
            "review": "Sushi is the type of food I can most comfortably say I frequent the most.  It almost seems like I am always trying to find the best sushi spots in Vegas and find out what they're all about.  Plus, I usually always target AYCE sushi joints because I am a big guy with a big appetite.  With that being said, whenever I prod anyone to come out and eat sushi with me I always hear the name \"Sushi Twister\" mentioned.  While there are a lot of people that rave about this place, I'm never quite in the same boat as they are.  Don't get me wrong.. the ambiance is great, the staff is friendly, and the location is awesome (about 15 minutes from my house and about 2 minutes away from my job) but the sushi doesn't cut it for me.  There are a few good rolls like the Freddy vs. Jason, Boulder Crunchy, and the Ecstasy roll but the majority of the rolls I didn't really find appealing.  I like the fact that they had low sodium soy sauce, good prices on Sake, and a giant screen projection for a movie or sporting event, but after going there a few times I'd rather stick to my usual hangouts.  On a side note, the chefs were pretty funny and just a tad bit obnoxious at times but that only added to the appeal of the Sushi Twister environment.  Not bad IMO but not enough to coax me back for another AYCE encounter with the \"Twister\"."
        }, 
        {
            "index": 271, 
            "rating": 5, 
            "review": "Sushi twister is one of my favorite sushi places! My boyfriend and I venture here at least 2x a month for the AYCE. It's quite a drive from where we live but completely worth it! Fish is always fresh, service is always really fast and they have such a great variety of rolls! Ecstasy roll and ninja roll are a must!  Baked green muscles are amazing as well!!"
        }, 
        {
            "index": 272, 
            "rating": 5, 
            "review": "wasn't expecting much, we were at Sam Boyd Stadium all day and my friends were in the mood for sushi and we saw this place when we stopped for gas.  it didn't look like much, a sushi restaurant in a strip mall next to StarBucks.  really?  how good could it be?  IT was the best value of sushi I have ever had.  \nwe had a party of 8, ordered the 'all you can eat' for $28 (I think), and the service was quick, friendly and helpful.  the food was great.  we left full.  how often do you actually leave a sushi bar full?  not often for me.  \nI will defineately eat there again when I am back in Vegas!"
        }, 
        {
            "index": 273, 
            "rating": 5, 
            "review": "I love this place and go here often.  The staff is pleasant and the price for all you can eat sushi is totally reasonable.  Do yourself a favor and try it!"
        }, 
        {
            "index": 274, 
            "rating": 5, 
            "review": "My fav AYCE in Las Vegas! Def have good quality and it's always busy but never too busy. Restaurant is always full but never a wait."
        }, 
        {
            "index": 275, 
            "rating": 4, 
            "review": "Amazing food good service only downfall is it's small and run down a bit uncomfortable sitting right up on the next tables guests"
        }, 
        {
            "index": 276, 
            "rating": 4, 
            "review": "It's just A-OK in terms of service. However, at the end of the day my heart tells me that I have to say: Yay! I'm a fan.\n\nI've been going to this place for a long, long, time. Years in fact. But like like all things, change is constant and Sushi Twister is not immune, \n\nWhile the food is always good, it's the service that has slowly become an issue. The primary reason for this, as I see it, is that they've simply outgrown their space. The place is too small. They need to expand (which is difficult given that they are on a shared pad with Starbucks with nowhere else to grow) or just plain move. I suppose moving would be a bad idea considering that they have a lock in this area as the only sushi place until you travel all the way down to Topaz and Tropicana or so.  \n\nRegardless, the place is simply too small. When it's busy, which is almost always nowadays, people are literally sitting on top of each other. In fact, I would almost call it communal seating. On my last visit I had a couple to my right that looked to be on their first date (I think they really hit it off!!) and a couple to my left that were an established pair. She was a straight shooter. He liked to tap his feet and hop up and down a little in his chair when the next plate of sushi showed up (he looked to be about 50 years old). He'd even hum a little ditty while he ate. Perhaps he did this for our mutual pleasure? I would have to assume so given that our shoulders were less than a foot apart.\n\nThe staff seems to be overcrowded, overworked and overwhelmed. They aren't nearly as chipper as they used to be. This might have to do with the lack of space and over capacity. Or perhaps it's something else. It might be that they've become so busy that a customers business is no longer appreciated, but expected? This is a mindset that seems to occur from time to time when an establishment become wildly popular. \n\nPurely speculation of course and I certainly hope I'm wrong. Overall the place is awesome and the food is fantastic. If they can work out these couple of kinks they'll be back to old form in a jiffy."
        }, 
        {
            "index": 277, 
            "rating": 3, 
            "review": "I am a regular at this place. My favorite is the dead dragon and the Japanese lasagna. The 'all you can eat' is worth it if you want to fill your belly & it's only $24. \n\nI would have given them a 4 star rating if it wasn't for a very ridiculous rule that you have to follow if you are dinning in. As I mentioned before I am a regular at this place for about 3 years now. I have a 5 year old little boy that does not eat  sushi so I took in a little snack for him in to the restaurant (grapes & cheese cubes and a chocolate milk carton) so he can enjoy it while my husband and I had our Sushi. About 15 minutes after we ordered the waitress informed us that we could not bring outside food or drinks in to the restaurant. I explained that our son does not eat anything on their menu but she insisted that it was a their restaurant rule. How INCONSIDERATE of their customers children!!! My husband had to take my son's snack to the car. We wanted to just get up & go but another waitress was already bringing our order to the table, we were hungry and we did not want to be rude and make a scene. I  was very disappointed of this place. They should have mentioned their stupid rule when we walked in the door or when the waitress took our drink order. But they waited until we ordered our food. We would visit often and I introduced many of my work buddies to this place. Since this incident I have only been back to this place about 3 times in the last 2 years & only because its the closest to my home. Before the incident we would eat here at least twice a month. But thanks to that I found another sushi place that is my new favorite and their staff is amazingly courteous and understanding, Kabuki in Town Square. A must try!!"
        }, 
        {
            "index": 278, 
            "rating": 5, 
            "review": "My favorite sushi place in all of Las Vegas, and I've tried quite a few.\n\nThis place is so out of the way from the Strip it's going to be all locals and no tourists. Great pricing for the all-you-can-eat at lunch or dinner. They will fill you up.\n\nI recommend the Salmon Loves Lemon, the Spiderman and the Oh My God! rolls.\n\nI just took a friend from LA/Iowa to the place a couple of days ago and he thought it was excellent."
        }, 
        {
            "index": 279, 
            "rating": 4, 
            "review": "Finally went into this place. Food is really good. The atmosphere is great and definitely family friendly. I had spicy tuna roll. Very good! Will return soon and hopefully bring others as well."
        }, 
        {
            "index": 280, 
            "rating": 5, 
            "review": "I moved here from Colorado. One of my good friend who passed away couple years ago love this place. They have the best customer service and great food now i see why this is her favorite. Now this is one of my favorite Sushi restaurant  in vegas. I tell people about this place."
        }, 
        {
            "index": 281, 
            "rating": 5, 
            "review": "This is easily one of the top places to get sushi in Las Vegas !  Best AYCE sushi places I've been so far. Love this place! Very friendly staff, personal attention to detail and great sushi!\n\nWe do the AYCE and get stuffed with some delicious food."
        }, 
        {
            "index": 282, 
            "rating": 4, 
            "review": "One of the best place and so clean. Will definitely come back here. Although some of the crews not really friendly  but hey we are here to eat good food right..."
        }, 
        {
            "index": 283, 
            "rating": 5, 
            "review": "have  been a  cust for  several years  food  is  awesome  , atmosphere alittle  loud at times, but  im probably just getting  old  , lol , never a complaint  about food  or  drinks  , ,my go to vice and  indulgence"
        }, 
        {
            "index": 284, 
            "rating": 5, 
            "review": "Great food great service beautiful food presentation great atmosphere took my girlfriend for her birthday she loved it!"
        }, 
        {
            "index": 285, 
            "rating": 4, 
            "review": "I'm in love with sushi twister, very clean and polite staff....and the red Dragon is a must try!"
        }, 
        {
            "index": 286, 
            "rating": 5, 
            "review": "Had a craving for sushi and this place is just up the road so it's convenient.\n\nAs always they greet you as you walk in, I didn't sit at the bar I opted  for a table which a couple were still available.\n\nI was hungry  so I went for the all you could inhale, I consider myself somewhat of adventurous when it comes to sushi so I tend to play it safe and order regular cut rolls. The Boulder Crunchy, Caterpillar, Tiger, Philadelphia. They don't use much sauces so I used a lot of soy sauce and wasabi.\n\nI had a the Green Tea ice cream and a Strawberry Mochi to finish it off, I walked off full and very satisfied."
        }, 
        {
            "index": 287, 
            "rating": 3, 
            "review": "Hmm. I am so biased because we love Xtreme sushi.\n\nDon't get me wrong, the place is cool, the food is good, and the service is excellent. But I do feel like the rolls should be rolled tighter, the serving should be more(quantity wise) and the plating should be prettier. IMO.\n\nBut do check it out. The atmosphere is chill, servers are very nice and efficient and it's a good deal for an AYCE."
        }, 
        {
            "index": 288, 
            "rating": 5, 
            "review": "The value is amazing. But the sushi quality and flavor is even more to be amazed by. For 2 people at dinner with adult beverages. Was less than I have paid for just myself at places. The quality was far better than those places as well."
        }, 
        {
            "index": 289, 
            "rating": 5, 
            "review": "Nothing but good things to say.  Phenomenal service and good fish.  Rolls not only taste good but show the attention to detail. Get the \"Screaming O\" and \"baked dynamite\" appitizer.  For nigiri the garlic tuna is very good and the seared tuna as well. My go to spot with the girlfriend."
        }, 
        {
            "index": 290, 
            "rating": 2, 
            "review": "All the rolls are deep Fried or a California roll with something else on top of it with a different name."
        }, 
        {
            "index": 291, 
            "rating": 5, 
            "review": "Best sushi place is town. I have been to several sushi places here in Vegas and this is the one I keep coming back too. My favorite is the Caterpillar Roll but that's just me. They serve flavored Sake (Raspberry and Apple) which I've come to see is not common."
        }, 
        {
            "index": 292, 
            "rating": 5, 
            "review": "Sushi is very very fresh \nBest All You Can Eat in Vegas so far \nBetter than Kaya No Offense\nPlace is little bit small for good sushi \nReal Japanese Sushi Man \nService is very fast One Hour Limit for AYCE \nSeems like they really do not care \nPrice : $26.95 per person \nKids are half price \nOrder little by little lol"
        }, 
        {
            "index": 293, 
            "rating": 4, 
            "review": "We eat here pretty often and the sushi is always good. Today, I tried the hot food the twister lunch special.  Grill salmon with teriyaki chicken twister special for $8.95 it came with miso soup rice and 1/2 cali roll. Ok, first the sushi chefs here are really good and I do not want everyone to confuse them with the hot food cooks.  My only complaint is please clean the bloodline out of the salmon before you cook it. Second, if you are going to leave the skin on the grilled salmon great. BUT, don't cover the Krispy skin with a glaze. \n\nAlso, the servers need to bus their tables more often.  We hate sitting for 25 min with empty plates in front of us. Advice, for the owner/manager hire a busser for your busy times, you will turn tables faster.  All in all its a great place for sushi, lunch and dinner we will continue to eat at sushi twister"
        }, 
        {
            "index": 294, 
            "rating": 1, 
            "review": "I was having lunch and half of my meal I found a hair I told the server and get a sorry and the worse thing is that I still pay for the whole check not even a discount"
        }, 
        {
            "index": 295, 
            "rating": 5, 
            "review": "My new sushi spot in Vegas. Been to many spots for sushi and this place is legit . Highly recommended"
        }, 
        {
            "index": 296, 
            "rating": 5, 
            "review": "thanks to yelp, I found this place, very good price for what you get.  We didn't have the All U can Eat.  But it was great.   We will definitely be back."
        }, 
        {
            "index": 297, 
            "rating": 2, 
            "review": "I love this place, orders come out fast and the fish is fresh. Though the downside is that they do pack on the rice on their nigiri pieces. You almost can't eat one without choking. The AYCE is awesome, but they do charge a lot if you leave ANY rice behind. \n\nUpdate: I almost choked on the rice. That's never happened before. It's way more rice on all their rolls and nigiri pieces. I don't think we'll be coming back."
        }, 
        {
            "index": 298, 
            "rating": 5, 
            "review": "The three of us sat up to the bar and watched our sushi be made.  The sushi chef was excellent and taught some as he went along.  He catered to our every whim and gave us full stomachs without repeating any dish until we had tried everything that sounded appealing to us (or twenty types).  Finally they rolled us out of the place, full, happy, and still enough money in our pockets to repeat the experience again another night."
        }, 
        {
            "index": 299, 
            "rating": 5, 
            "review": "Best sushi in las Vegas !!!!!! Call the doctor vs Friday the 13 is a killer super fresh the service is excellent and very clean"
        }, 
        {
            "index": 300, 
            "rating": 5, 
            "review": "Bento Box for 2 is a great deal! I have dined at Sushi Twister for long time, but never ever tried this bento deal. It is for two people, you have mix tempura, two miso soups, 4 different rolls, 4 kinds of sashimi plates. It is really fair and excellent quality. \n\nLast night, the restaurant was running lobster roll special for $14 dollars deal~ Need to try next time for sure"
        }, 
        {
            "index": 301, 
            "rating": 3, 
            "review": "This review is mainly about their customer service. Dined here with some friends on a Friday night. Unfortunately for us they close at 11, so coming late in the evening we were left with an hour or so to eat. When we were seated our waitress seemed a little annoyed, which was just really upsetting. She stressed that the kitchen would be closing in 45 minutes and that she would just rather have us acye-ers place all of our orders at once. We did just that. She made frequent visits to the table and occasionally threw in comments such as, \"Anything else? We all want to go home, you know.\"  No one at my table seemed to take offense, but I, however, found it very disrespectful. The restaurant was not yet closing so for her to just hate her life and take it out on poor, innocent customers was just rude.  \n\nIt's unfortunate because the food was pretty good. I just can't get over the fact that our server had such a foul attitude the whole evening. It's like: Relax and smile a little. Everything's going to be OK. They have set such low standards for customer service that I can't bring myself to rate them more than three stars. Regardless of how good their food was. Meh. Sorry, not sorry."
        }, 
        {
            "index": 302, 
            "rating": 5, 
            "review": "We tried the Twister lunch combo & the price is reasonable with a great meal portion and the food taste really good. Second time here & I'm still a satisfied patron."
        }, 
        {
            "index": 303, 
            "rating": 1, 
            "review": "This is the only restaurant that I have ever gotten up and left from before eating. \n\nBefore me and my fiancé even started eating, the waitress was very rude by sternly insisting that if I was ordering \"all you can eat\" and my fiancé wasn't, that there was \"NO SHARING.\" Now, granted, given the area of the restaurant,  I'm sure they have had people take advantage,  however, this didn't start us off well at all. I suggest you police this type of thing when you actually see people taking true advantage of it. \n\nWe ordered drinks, then I started off with some salmon nigiri. It came out with brown edges on every single piece.\n\nThat was all she wrote for us. I called the waitress over, told her our issues, and said we will pay for our drinks but we are leaving. They had one last chance to redeem themselves a bit, and cover our drinks. I was being nice to even offer. They should have apologized and covered the drinks for us, but no, we paid for them. \n\nWon't be back. I know good sushi. This wasn't it."
        }, 
        {
            "index": 304, 
            "rating": 3, 
            "review": "A-ok sushi place in the Boulder Highway area. Came here for lunch with coworkers. None of us tried the sushi (unless you count the 4 pieces of California rolls that came with our lunch).\n\nI ordered a lunch special of Tempura and Salmon, which came with miso soup, house salad, and the aforementioned California rolls. I was up-charged $1.00 for substituting house salad with seaweed salad. \n\nOverall the lunch special was not bad for roughly $12.00. But none of the items stood out for me. Just overall A-ok."
        }, 
        {
            "index": 305, 
            "rating": 1, 
            "review": "Hands down, the worst sushi I've ever had. I thought I already experienced the worst, but this place showed me how nasty sushi rolls could really be.  For the first time in my life, I actually snuck food into my napkin and went to the restroom to throw it out.  Like some other AYCE sushi places, Sushi Twister has a bunch of rules. They will charge you extra even if you leave a few grains of rice on your plate. \n\nFOOD\nThe rolls were horrendous.   One roll I ordered was the volcano roll, which is supposed to be topped with scallops.  However, I only found one tiny sliver of a scallop mixed in with tons of sauce and other mystery meat.  I'm shocked this place has gotten many good reviews. Big disappointment."
        }, 
        {
            "index": 306, 
            "rating": 5, 
            "review": "We live 1.1 miles away from Sushi Twister, which means we eat here constantly. The staff is fantastic and great with children. The price is good and their rolls are great. If you are even considering eating here, you should. I highly suggest the Cowgirl, Japanese Lasagna and red bean ice cream."
        }, 
        {
            "index": 307, 
            "rating": 5, 
            "review": "Love it you can taste the quality of the food and great service. I love going to all you can eat sushi restaurants and this one is in my top ten."
        }, 
        {
            "index": 308, 
            "rating": 5, 
            "review": "Sushi Twister has by far the best sushi in town, price is extremely reasonable considering that its all you can eat. The service there is awesome as well. I definitely give this place two thumbs up!!!"
        }, 
        {
            "index": 309, 
            "rating": 2, 
            "review": "Service was very good  food was ok,  a little pricey for dinner.  Cons- it was so hot in the restaurant it was very uncomfortable,  many customers were fanning themselves,  we asked about the AC,  they said it was on and they had two small ceiling fans going but they were up so high they made no difference.  Place could have been a lot cleaner.  I won't return."
        }, 
        {
            "index": 310, 
            "rating": 4, 
            "review": "Only giving 4 stars because if you didn't order the All You Can Eat, its like pulling teeth to get an order in. Other than that, the food was very good, especially the beef tataki, which is very hard to find. All in all, a good place. Price wasn't bad either. Would go again"
        }, 
        {
            "index": 311, 
            "rating": 5, 
            "review": "Decided to get the 2 person platter because of a review on here. Oh my wow! What a lot of food for so little! Including our drinks and mochi I had to be helped to my car! Could hardly finish what we ordered but were so very satisfied with everything. :) I was a pickup so I got to see only a small taste of the establishment but it felt very at home and authentic with the waiters interacting with guests at the bar, yelling out when I tipped, it was a great experience. :)"
        }, 
        {
            "index": 312, 
            "rating": 5, 
            "review": "I tend to write novel-reviews that could probably be turned into plays. But I can't say enough good things about this place. \n\nThis place deserves more than just a 5-pack of stars. They really deserve buckets and troughs of the things. Big, shiny, red, buckets of obese stars. Get you, your mouth, and your tummy over here immediately. You really cannot wait any longer. If you find yourself in Vegas doing the strip-thing, you need to make the ~10 minute drive to Sushi Twister.  \n\nThree initial must-dos: AYCE, sit at the bar, and come hungry. \n\nOne initial tip: Order carefully, they will charge you for any leftovers you cannot finish. (Great policy in my opinion). \n\nThe man-piece and I came here for lunch before our long road-trip back home to San Francisco. It was probably the best decision of our lives. For around $22, we sat at the bar and enjoyed gorgeously delicious waves of fresh, expertly prepared sushi, and other wonderfully unique dishes. \n\nWe mainly stuck to the nigiri menu. I'm not saying this is what you should do, but these little guys aren't your typical nigiri (and I live in San Francisco, a veritable sushi-snob space station). They really surpassed anything I have experienced. Expect fresh fish (weird, being in the middle of the desert), and really amazing flavors. They are garnished with the perfect amount of wasabi, sometimes green onions, and various soy-ish sauces that give your wee nigiri bites extra-excellent flavor. We probably tried 80% of the nigiri menu, but some must-haves include: \n\n- Garlic tuna (FAVORITE)\n- Seared ahi (OTHER FAVORITE) \n- Halibut (OTHER FAVORITE)\n- Sake (FAVORITE)\n- Saba (OTHER FAVORITE)\n- Red snapper (OTHER FAVORITE)\n\nBefore I continue to gush about the food, I must say that the service was spectacular. As soon as we walked in, we were taken aback by the 7-9 people enthusiastically declaring \"IRASSHAIMASE!!!\" I twitched a little at the loud enthusiasm, but we knew we were in for a treat. The servers always check up on you, the chefs are wonderfully receptive, seem to love their work, and also seem to have fortress-like memories considering the slew of orders being verbally submitted by the servers. Be comforted. \n\nBack to the food! \n\nThe roll menu is impressive and involves unique combinations that I'm not used to. They have a great array of cooked rolls, of which we liked the Dead Dragon, Fire Cracker, . Use caution here -- I can see it being easy to fill up on these delicious rolls and be too full to enjoy other areas of the glorious menu. \n\nI'm not usually one for appetizers mainly because they fill me up before I get to the good stuff, but these appetizers are cautiously portioned so you can enjoy a variety of dishes and flavors but still have room in your precious tummy-space for more. Favorites: \n\n- Monkey Balls: spicy tuna and mushroom encased in a satisfying tempura shell. Nothing like their Chimp Nad cousins. (I suck.)\n- Hot Shrimp: shrimp, spicy tuna, and cream cheese magicked with tempura to make a seriously delicious snack. You must try.\n\nNeedless to say, the man-piece and I were speechless after our meal here. It's both a gut-wrenching tragedy and a wallet-saving blessing that it's so far away from where we live. That said, I can't really complain much hailing from the sushi-space-station that is San Francisco. Sushi Twister should think about storming its way up to the Bay. You'd be welcomed with open arms and mouths. Thank you for a truly excellent and memorable meal!"
        }, 
        {
            "index": 313, 
            "rating": 5, 
            "review": "So so good! Must eat all you can eat place so good, good prices, nice staff!! \nThey give you an all you can eat paper plate so while you're eating you can choose and such also a separate all you can eat menu. I had the best time eating at the bar and the guy asking me what I want and making sure I'm ok and such. The prices are fair and don't forget to tip! Also after your all you can eat visit they give you a card they stamp every time you visit and I think it was after 9 visits you get to have all you can eat sushi for free!!"
        }, 
        {
            "index": 314, 
            "rating": 1, 
            "review": "Service needs some improvement.Sushi was terrible ! Lacked freshness and most of all flavor...they tasted the same or it was blasted with spice so you could not savor ask the different flavors. I eat sushi regularly....know good and promise me..save you're monies and go elsewhere. if you're an experienced sushi eater you will be disappointed"
        }, 
        {
            "index": 315, 
            "rating": 4, 
            "review": "The Boulder roll is heaven. Highly recommend this place. AYCE is $24/person and includes all the rolls on the menu. Good quality food and solid service."
        }, 
        {
            "index": 316, 
            "rating": 5, 
            "review": "SO GOOD. AYCE for 21+ tax (for lunch).  Fresh, quality sushi, tons of rolls, dessert! The options were endless.. and it was all GOOD. I like how they had a bit of everything for everyone.. it's great for big groups because they can cater to everyone across the spectrum w/ sushi, rolls, cooked japanese dishes if you arent into raw fish, ice cream desserts.. I really recommend yellowtail and hamachi. I wish there was a place like this in West LA.. Seriously, forget Todai..come here if you're ever in Vegas! UGH sushi cravings..!!"
        }, 
        {
            "index": 317, 
            "rating": 1, 
            "review": "They made my bf eat the last piece of sushi or they charge him for leftover. What a threat lol! Food wasn't too bad but we are never coming back here again."
        }, 
        {
            "index": 318, 
            "rating": 5, 
            "review": "First time here and I can see why its a near perfect rating.\n\nI typically dont like to review the atmosphere, but for a sushi place, its extremely upbeat. The music is like something you'd listen to on the radio. There's also a projector playing some kind of show like E! I like it. It's different. Kind of like watching a movie while eating sushi.\n\nAnyways, ordered three items. Twister Scallop Mix, Shrimp Tempura, and the Magic Mountain(?) I honestly forgot the name. LOL.\n\nI loved them all. The cucumber is extremely fresh, like it was picked right outside (I actually hope not literally). My girlfriend ordered the Sushi Dinner Plate(?) (Already forgetting names and we're sitting right on the tables...) Nigiri. So. Fresh. Enough said.\n\nThis'll probably be somewhere i'll be going frequently. It's about a 5 minute drive from me.\n\nAlso, prices are pretty standard. $27 for AYCE past 4PM. You can also get half rolls."
        }, 
        {
            "index": 319, 
            "rating": 4, 
            "review": "I love sushi.  Let me say it again...I LOVE SUSHI.  I love it in the morning, I love it in the afternoon, heck, I love it in the evening.  \n\nI stumbled upon Sushi Twister while meeting a friends' friend there for lunch.  From the location (trop and boulder) I thought that it would be ahem, ghetto.  Upon walking in you are immediately greeted and the staff is all smiles.  You get seated right on the spot, whether its the sushi bar or a table (we always opt for the table).  \n\nThe menu has some of the most intriguing and delicious rolls I've ever seen, as well as the favorites of any sushi restaurant.  Things like...  Rum Jungle roll?  Sure!  The Mexican roll?  Sure!   Also they are NEVER stuffed with too much rice...you get the amount of fish you pay for!\n\nFor price-wise, they have all you can eat for $27, which I think is a little pricey, but the rolls definitely make up for it.  So why do I only give it 4 stars?  Whenever you get all you can eat, there's usually a rule saying you have to eat everything you order.  The staff seem to be everywhere, looking at every roll that enters your mouth to make sure you do not share it with someone else (like me, who never orders all you can eat sushi since I can only handle 1.5 rolls).  \n\nBut hey, friendly staff, great sushi, drinks always filled, and not as expensive as other sushi restaurants.  Try it :)"
        }, 
        {
            "index": 320, 
            "rating": 5, 
            "review": "Finally I get to return here to yelp about this place. this place is great. I've tried everything on the menu except 2 items. I like the all you can eat. \nI have tried other places and nothing seems to compare, but I'll keep trying since I love Sushi.\n do you like Saki? try the raspberry Saki its devine."
        }, 
        {
            "index": 321, 
            "rating": 3, 
            "review": "Awesome sushi, I would give more stars but it's always hot in the resturant and the chef got a attitude because he hade to remake our sushi after we told him and our waiter my husband is allergic to cucumbers"
        }, 
        {
            "index": 322, 
            "rating": 5, 
            "review": "OK Sushi Twister hands down is the BEST all you can eat sushi establishment I have been to. From the moment you walk in the door you are greeted and immediately seated. There is no time wasted and the servers are already getting water and asking your beverage order. The ambiance was wonderful good natural light and very nice Asian Decor throughout. I sat at a high top table with my friends but the sushi bar looked very inviting, and all the sushi cooks were nice and well presented. Our server and busser were very prompt both bringing the sushi and clearing empty plates, our glasses were never empty. The owner came over towards the end of our meal and greeted us with a very warm smile and asked about our meal. I cannot praise this sushi restaurant enough from the staff, to the food and ambiance amazing and the very involved owner makes me give this place 5 stars! I appreciate seeing such customer service and integrity in an age where those simple traits are diminishing."
        }, 
        {
            "index": 323, 
            "rating": 4, 
            "review": "My wife and I came here for a quick dinner. We had the following:\n\nSalmon Teriyaki Combo $10.95\n\"AAA\" Sushi Quality Atlantic King salmon with Teriyaki, California Roll (8pc) Shrimp(2) & Vegetable Tempura(3). Including Rice, House Salad & Miso Soup\n\nRoyal California $3.57 (half)\nDeep-fried California roll with eel sauce.\n\nCowgirl $5.98 (half)\nAvocado & Cucumber inside, wrapped with slice of Beef Tenderloin. Topped with House Special Sauce and Green Onion\n\nBoulder Crunchy $5.75 (half)\nShrimp Tempura & Cucumber Captured with sliced avocado & splashed w/ tempura crumbs\n\nTiger $ 6.50 (half)\nShrimp Tempura, cucumber wrapped with spicy tuna & avocado\n\nThis resto is located in a small plaza on Tropicana. The resto is fairly small with a sushi bar and tv. Their sushi was pretty good. I particularly liked the Boulder Crunchy and the Cowgirl. My wife had the Salmon Teriyaki Combo which was a lot of food and can easily be shared with 2 people. I wouldn't order the Royal California again bc having a California roll deep fried did not really make it taste better. Overall, this is a good sushi place as they have cheap prices and I like that they have half portion options."
        }, 
        {
            "index": 324, 
            "rating": 3, 
            "review": "I come here once a week with my Mother on either a Saturday or Sunday for lunch. We usually get the Twister's Lunch Special, which gets me and my mom full and for 8 or 9 dollars it's really quite good.\n\nThe last couple of visits, we decided to have the AYCE sushi for lunch. for 23 or 24 dollars a person, it was A-OK. the menu they have here isn't so different from other Sushi places i've been to around Vegas excluding a small number of other special rolls. The quality is great and the taste is pretty good, but in my opinion not the best. Sometimes the rice is falling apart or not aligned correctly and evenly, that when i try to pick it up the rice slides out. Not too good but it doesn't really bother me too much.\n\nThe Service is good. Sometimes i have a feeling the waiter that serves us is in a rush and wants to get our order quickly so he can get on with another task. The Waitresses on the other hand are nice and keep a nice patient attitude which i prefer.\n\nMy mother and I will definitely go back as Sushi Twister is the closest Japanese Restaurant to us!"
        }, 
        {
            "index": 325, 
            "rating": 4, 
            "review": "Sushi Twister is consistently good! We are regulars that eat there probably every 6 weeks or so. My favorite roll is the Angry Ninja. It's a must try if you like spicy food!"
        }, 
        {
            "index": 326, 
            "rating": 3, 
            "review": "I live maybe 3 minutes away. Always satisfies the sushi cravings. Not amazing not bad either."
        }, 
        {
            "index": 327, 
            "rating": 5, 
            "review": "Wife found this place. Took us there for lunch. Terrific fresh tasty sushi. Had 3 large rolls and sampled a couple others. Excellant price and great staff. They had you can eat as well. Probably come real hungry next time... miso soup was really good too. Tucked away from the road Boulder Hwy, just past the \"other\" Vegas sign... A must if in the area... BTW, offered us a kids menu, but my boy was all about the sushi."
        }, 
        {
            "index": 328, 
            "rating": 5, 
            "review": "I must admit, I'm new to sushi, so I may not know much, but I do know that this place is awesome! I love their specialty rolls, especially the deep fried rolls and anything that's topped with their spicy mayo!\n\nI usually get a lunch special, and add a specialty roll.\n\nOne thing to note, they do have a late night menu, starting at 9PM on the weekday where they have a few of their specialty rolls at a discount, like under $4!!!"
        }, 
        {
            "index": 329, 
            "rating": 4, 
            "review": "This place was packed on a Sunday night. My friend and I had to wait for a seat at the bar for about 10min standing. I got an O my god roll and a Twister roll. They were freakn Delicious!  The sushi chef that made our food was very pleasant and looked excited to be there. I only gave it four stars though because i didnt try the actual sushi yet, but i definetly will be coming back."
        }, 
        {
            "index": 330, 
            "rating": 5, 
            "review": "I give this location 5 stars because the food, service and quality are always above average! I have been there several times because of the location and friendly service.  Very reasonable prices and an excellent lunch sushi special for under $10.  Can't beat it! I have told everyone I know and have a few friends who drive 30 min just to eat there. Small location, but perfect for what iss needed. You would never know this jewel by the location but once inside its all good!"
        }, 
        {
            "index": 331, 
            "rating": 3, 
            "review": "Mixed feelings about my experience at Sushi Twister. First off It's in a kind of seedy area. \n\nSecond, it's really small so there's always a wait and not really anywhere to stand. \n\nThe food was good but not great. They definitely have quality nigiri. The pieces are a nice size and fresh. \n\nOur server was really nice. \n\nBut everything else was just OK. The gyoza was so-so. The seaweed on all of the rolls was very tough and hard to chew which I can't stand. \n\nMy friend even got a crunchy piece of seaweed it was so dry. \n\nThe dessert selection was really limited in comparison to other AYCE places. \n\nI don't know if I'll bother driving 20 minutes back here again."
        }, 
        {
            "index": 332, 
            "rating": 5, 
            "review": "I've created a monster!\n\nAsk my husband what his favorite food is and he will immediately tell you SUSHI; hands down!  When we moved back to Las Vegas 2 years ago we did not know where to go in Henderson. When we lived out here the first time, we had a favorite place over on N. Rancho but we moved to Henderson this time. While visiting the Albertson's (in the same parking lot as Sushi Twister, my husband saw this place and we decided to try it. 2 years later we are still enjoying this place and visit them at least 1-2 times a month (sometimes more).\n\nEverything is fresh. Their Screaming O is to die for, their Spicy Tuna rolls are delicious, and their Japanese Lasagna is even better! Best place to eat sushi over on our side of town. The service is alright, could be improved a little it but nothing that needs a lot of complaining about. Even though we have visited them more than 50 times, they still ask us if we want the AYCE sushi and if we say yes, they tell us their \"rules\". Yes, Yes, trust me, I know them already.. but hey, they are doing their job.\n\nThe place is small and gets really busy on Fridays and Saturdays but it's cozy and quaint. The decor is good as well. We always sit at the bar because we like the interaction with the Sushi chefs and I like to see them make my sushi (I find it fascinating).\n\nWe will continue to visit Sushi Twister and we recommend them to anyone who says they like sushi."
        }, 
        {
            "index": 333, 
            "rating": 5, 
            "review": "Great food in a low key environment. The lunch combos have plenty of food at great prices. We were full from that and we're happy we did not go with the all-you-can-eat choice!"
        }, 
        {
            "index": 334, 
            "rating": 3, 
            "review": "Drove all the way across town to try this place. Service was great, selection was great but rolls were just ok nothing really stood out. Ended up ordering nigiri after so so rolls. Probably not going to comeback."
        }, 
        {
            "index": 335, 
            "rating": 5, 
            "review": "Magic Mountain and Japanese Lasagna are my favorites! This place is great. I personally love it cause it's close to my house. Very clean inside and friendly staff. They even give you a frequent diner card. Earn your stamps and when your card is full you get 1 free all you can eat. So worth it! Their lunch all you can eat is $22. Amazing!"
        }, 
        {
            "index": 336, 
            "rating": 4, 
            "review": "It was nice to find this local gem while stopping by in Vegas. I did the AYCE, which was about 22.50 for lunch and 26 for dinner. Totally worth it.. Filled up upon rolls and rolls and rolls and Nigiri. All the fish was fresh and the selection of different rolls were great as well. I also liked how you were able to order half rolls, this especially helps you are eating by yourself.\n\nDon't forget, free mochi ice cream at the end. Absolutely delicious way to end the meal. 4 Stars, Highly recommended."
        }, 
        {
            "index": 337, 
            "rating": 5, 
            "review": "This is the best AYCE sushi in Vegas. You have quite a bit to choose from outside of the strip for AYCE sushi. Some are good, some okay, some are barely edible. Do yourself a favor and try this when you're in the mood for spoiling yourself. Make sure you flip the menu over to see all the premium rolls. I actually only had their simple rolls, sashimi, and appetizers the first time I did AYCE here because I didn't bother to flip the menu over! lol\n\nAs a side note - the miso is great and actually somewhat unique. Service is always great and friendly, it's the type where you have your primary server but every server and busser that passes by your table is always happy to help when asked. They actually look at you passing by, they're not the type to avoid all eye contact with you in an effort to avoid helping their fellow teammate. Sushi chefs are just as nice and helpful."
        }, 
        {
            "index": 338, 
            "rating": 3, 
            "review": "Not quite the freshness I was hoping for.\n\nI really wanted to like this place because it's near my house and the sushi place I usually go to is VERY far away. I walked in hoping that Sushi Twister can be my new sushi home.\n\nThe plate that I was given had a piece of rice and smears all over. I didn't want to make a big deal out of it but it wasn't a great first impression. The sushi comes out relatively fast, and you can immediately tell why this is a four star venue because they are honest with the rice. In a roll or nigiri there is little rice and plenty of fish.\n\nHowever, a select few of the fish was not fresh. The hamachi was a troubling, dullish hue. I was so disappointed in the hamachi because it's one of my favorites. The shrimp tasted like it had been sitting for a while. I didn't DARE order sea urchin. On a positive note, I think my favorite were the salmon eggs. It wasn't as salty as others I've tried in other venues and it was the most enjoyable, surprisingly!\n\nI would come back because the chef are clearly skilled. I love the rice-to-fish ratio and I know that sushi places can get unlucky with the fish quality sometimes."
        }, 
        {
            "index": 339, 
            "rating": 4, 
            "review": "A Sushi joint next door to a Starbucks? A Seattle transplant's dream!\n\nTried the Angry Ninja (5 stars spicy!) right out of the gate. Good start. Fast, yummy, fresh. Overall, very impressed. We will be back to try every other roll on the menu!\n\nThis place doesn't quite have the charm as some others I've been to (sitting at the bar, you are staring straight into the kitchen), but the service is fabulous, and the chefs are artists. We got personal service and were on a first-name basis with one of the chefs by the third round. He was even kind enough to keep making me 1/2 sized rolls so I could try more variety."
        }, 
        {
            "index": 340, 
            "rating": 5, 
            "review": "Always amazing, every time. Well worth the wait on the busy nights. The Boulder Crunchy and Cowgirl rolls are a must!  The staff is super friendly and helpful, even at their busiest.  Regardless if I get their all you can eat, or take out, I'm always beyond happy (and full!) afterwards.  I highly recommend this place to anyone with a love of sushi."
        }, 
        {
            "index": 341, 
            "rating": 5, 
            "review": "This place was GREAT the sushi was very delicious and the food was wonderful.  I absolutely loved this place.  I will return to this place when i go back to vegas for sure ^__^"
        }, 
        {
            "index": 342, 
            "rating": 4, 
            "review": "3.5 stars would be more accurate I think, but I decided to round up. \n\nAYCE sushi that doesn't take me 20 minutes to drive to from my house. YAY! Location, for me, is a plus... \n\nSadly, I have only been to Sushi Twister twice. The lack of visits is certainly not related to the location, price or quality of the sushi though... The husband doesn't eat much seafood so sushi for dinner just isn't an option as often as I would like it to be!\n\nI have never had a problem with service here, and while there is a time limit for AYCE, it has never been an issue for me. The sushi is good, not mind blowingly amazing, just good."
        }, 
        {
            "index": 343, 
            "rating": 5, 
            "review": "My daughter advised me of this place. The place served excellent sushi (probably one of the best I've had). The AYCE was $27 which had a large variety of rolls on the menu. I definitely loved the fact that you can order half rolls instead of the full rolls, because this gives you an opportunity to try different rolls without getting full. A lot of california sushi restaurants do not adopt the half roll concept, which is irritating. \n\nThe interior is small, which is a negative aspect because of their large fan base. The interior is clean and the staff is very busy but attend to their customers in a timely manner. The bathrooms contain single person bathrooms. The surrounding area of the restaurant does contain transient stragglers here and there,  but for the most part, they won't bother anyone. \n\nOverall, I give this place a 5 based on their food, clean interior and staff. Great spot which people must try!!"
        }, 
        {
            "index": 344, 
            "rating": 4, 
            "review": "This is the closest sushi to my house so I come here quite a bit.  I mostly get takeout but have had AYCE and lunch specials a few times.  I love that you can get half rolls.  Food is fast and fresh.  Service is on point.  Prices are great.  What more can you ask for?  I have ordered sushi platters for a party and was very happy with them.  This is a solid neighborhood spot."
        }, 
        {
            "index": 345, 
            "rating": 4, 
            "review": "Sushi Twister is one of the few AYCE spots east of Green Valley Pkwy. We came here on a Saturday afternoon because it's usually crowded and on a wait during the dinner hours. I had AYCE ($22.95) and my wife had the teriyaki box ($8.95). \n\nMy AYCE strategy is that I normally order as much variety of nigiri as I can to try and then have a roll or two. I'll usually order two orders of each fish. But here, the cuts of fish on the nigiri were so large that I only ordered one order of each fish after the first round. The sushi is solid, nothing out of the ordinary as far as selection of fish. But I was filled up pretty fast on the nigiri and didn't have room to try any of the rolls. So rolls will be on the agenda for the next visit.\n\nIt was pretty busy for being the afternoon but the service was great because they had three servers working the dining area and they worked great as a team. We'll continue to come here when were on this side of town and want sushi during non peak hours."
        }, 
        {
            "index": 346, 
            "rating": 4, 
            "review": "i come here when im on the eastside of town and i believe this place is really underrated. They are great as far as service, food is also good and the prices are awesome. Only thing i will say is that the fish needs a little work. i believe a better quality fish could help this place shine. the sauces they use are also great and roll selection is good. dont pass this up because i think like most restaurants  serve their best qualities of fish on friday so ill try it then and maybe my review will change since i did come in on sunday."
        }, 
        {
            "index": 347, 
            "rating": 4, 
            "review": "At least once a month I eat her to get my sushi fix. Really I just dig the atmosphere and the Budda Bar CD they always got playing and there's a huge screen TV that's got some game on. The sushi is excellent for the price. I judge sushi by the amounts of rice that is used verses the portions of fish. Well balanced and fresh. It's not Nobu twisting so don't expect anything outside the usual sushi bar menu. The staff is warm and friendly. Sapporo draft and warm saki shots make it quite a night out. Not the cheapest sushi bar around nor is it too expensive. I do feel the food quality, atmosphere, and cute waitresses gives value to the menu price. I'm all about the Nigiri which is well done. the rolls are always done perfect."
        }, 
        {
            "index": 348, 
            "rating": 5, 
            "review": "I absolutely love this place! Really, I do. Did I already say that? \n\nI discovered this place on Yelp looking for a place that was open late. Plus, it is close to the hotel that I frequent while I'm on business. \n\nThe nigiri here is top notch, I have yet to order something that I was not happy with. The quality is fresh, the service is always amazing and quick. The place is small and so when it is busy, you may have to wait for a table. When there is a wait, I will order the seafood salad and it is just SO good! I can eat that everyday! \n\nThe place is right next to a Starbucks and across the street from a gas station, not quite what you would expect. Ample parking and easy to get to. \n\nI probably order take out from this place 3-4 times a week while I'm in town - it's that good! I don't always do the AYCE only because I don't have the time, but when I do, I do! I love the fact that they have half rolls because you get to try everything!"
        }, 
        {
            "index": 349, 
            "rating": 4, 
            "review": "The sushi was excellent, and the fish was very, very fresh, with wonderful texture and taste.  I graded Sushi Twister down a star because the rice kept falling apart (in both nigiri and rolls), and the Yellow Mango wiz Shrimp roll did not have much flavor.  Everything else was outstanding in taste, particularly the Vacation Roll.  \n\nIt's a new favorite sushi spot for us, and we won't hesitate to return."
        }, 
        {
            "index": 350, 
            "rating": 5, 
            "review": "Food is heavenly delicious, the new server Dayana it's amazing, Yumy it's a fabulous manager!!\nGreat place to come with friends and family:)\n2 thumps up!"
        }, 
        {
            "index": 351, 
            "rating": 5, 
            "review": "hands down my favorite place for sushi in Vegas ... and let me tell you I have tried a few! My bf and I eat there usually 1-2 times a week.\n Dang is my personal favorite sushi chef, he makes the best rolls and is always willing to explain what something is. The staff is always friendly and willing to make suggestions. All You Can Eat is well worth its weight in sushi, and they have a punch card so you can earn a free one. Most rolls you can order in half size so you can try new things without having to commit. I have yet to try something there I dont like. if you go you HAVE to try the monkey balls .... they are amazing! Oh and PS they make their own eel sauce which is killer on cali rolls \n\nLOVE LOVE LOVE SUSHI TWISTER!!!"
        }, 
        {
            "index": 352, 
            "rating": 4, 
            "review": "The service was friendly and prompt.  We didn't have to wait for our refills or our order to be taken. The food arrived and was well prepared and tasted delicious."
        }, 
        {
            "index": 353, 
            "rating": 2, 
            "review": "Great Sushi ... I had all u can eat ... However, I do have a compliant: ... I asks for a bowl of rice and miso soup for my 2 yrs old. They charge me $3 for it and $2.50 for a piece of Mochi ice cream, because they saw her eat it instead of me.  We spend over a hunded on the bill and they nickel and dime you. This is poor service on Management. ... The waiter service was good. Kids under 3 always eat for free.  How much can a 2 yrs old eat??\n\nI have a lot of friends who visit Vegas all the time. This is not a place I would recommend family w/kids to dine.\n\nThis is not a family friendly place. \n\nI took off 2 star for that."
        }, 
        {
            "index": 354, 
            "rating": 5, 
            "review": "5 star for location only right now as it is near me!!!!  I plan to go there for the first time Friday early evening and get some sushi to bring home for guests!!  I love sushi AND I'm a Yelper  I will keep ya posted on my opinion of their quality and service!!!"
        }, 
        {
            "index": 355, 
            "rating": 4, 
            "review": "I was at Sam Boyd stadium last weekend (with Tom C., apparently - go NZ rugby!), and went to this place because of the Yelp rating. I just pulled in, ordered 2 rolls to go, and then left with the rolls. Took about 15-20 mins to get the rolls. They have a pretty extensive selection with a whole menu section for fried/tempura maki (it's not just AYCE). The place was hopping, very busy for mid afternoon. I got an Caterpillar (eel avocado) roll that was good, and something called a Matsuri roll, shrimp tempura with tuna on top. For the take-out, they separated the sauces in little containers, which is a nice thought but it was tricky to eat in the car that way. \"Ecstasy sauce\" (on many of the maki rolls, including Matsuri) is a bit of eel sauce mixed with spicy mayo and some kind of roe. Matsuri roll was good, better than the eel roll.\n\nYou can find the sushi rolls on their Dinner Menu at sushitwister.com, and you can also find out that they use trans fat free tempura oil, \"BEST OIL FOR YOU WHO CARE FOR YOUR HEALTH\"."
        }, 
        {
            "index": 356, 
            "rating": 5, 
            "review": "I love this place!  I go there at least twice a weak.  My personal favorite is the Kill Samurai roll.  They got nice atmosphere.  The staff is friendly.  They got the best deal on th East side of town."
        }, 
        {
            "index": 357, 
            "rating": 5, 
            "review": "Date & Time: at least once a week\n\nExpect nothing but great service, I would say around dinner time the price for two people is about $60, they offer stamp cards if you are frequent customer.\n\nI been going to this place since it opened back in 2008ish. This is my go to place when it comes to sushi. They are super friendly and super fast service, I can't complain.\n\nFavorite Rolls:\n-Salmon loves lemon\n-Spiderman\n-Angry Ninja\n-& most of the nigiri :)"
        }, 
        {
            "index": 358, 
            "rating": 5, 
            "review": "I f***ing love this place:) Great AYCE price plus they are fast, sushi is fresh and the rolls are delicious. Must try the Poke Salad! So amazing :)) almost have my loyalty card completely stamped up."
        }, 
        {
            "index": 359, 
            "rating": 5, 
            "review": "Friendly staff, rolls are great, not that many places on the Eastside to go for AYCE..."
        }, 
        {
            "index": 360, 
            "rating": 5, 
            "review": "Seriously the best sushi place in town !! Prices are very reasonable and great service !"
        }, 
        {
            "index": 361, 
            "rating": 4, 
            "review": "Most of the menu is really fresh and delicious! I hated the \"hot shrimp\" but loved everything else! I highly recommend gyoza, eel nigiri, and baked mussels! I don't recommend going on a Saturday night because the wait times are over an hour. Service is a bit slow so order as much as you can when the server comes around."
        }, 
        {
            "index": 362, 
            "rating": 5, 
            "review": "OMG!!! Best all you can eat sushi in ALL of Vegas!!! They are VERY generous.... very very fresh , excellent quality and on Fridays they offer Toro in the all you can eat!!! CANT BEAT IT!!!! We went 2 times in 1 week...Yes...THAT GOOD!!!!"
        }, 
        {
            "index": 363, 
            "rating": 5, 
            "review": "Best sushi joints around, great selection always fresh. Salmon loves lemon roll is a must try."
        }, 
        {
            "index": 364, 
            "rating": 4, 
            "review": "Had AYCE for lunch with hubby today. Service was great. Sushi was good - especially the spicy rolls. We really liked the Angry Ninja and the Screaming for vengence. The spicy rolls were not too spicy and had flavor, not just heat. The seaweed salad wasn't so good though and we did not like the ecstacy sauce at all. I would definitely come back and will order the Angry Ninja again! I also wanted to mention that their plain iced tea was the really good - not too watered down."
        }, 
        {
            "index": 365, 
            "rating": 4, 
            "review": "Love this place.  You'd never would think that there is such a good sushi spot in such a ghetto area, but don't be fooled...there is!\n\nGo there on the weekdays after 9pm for some killer happy hour specials that are listed on the center table card.  They have some amazing take out deals as well!\n\nIt's not my absolute favorite spot, but it's my everyday go to spot. \n\nI wish they had better music.  That's for sure.  At the very least something traditional instead of elevator techno."
        }, 
        {
            "index": 366, 
            "rating": 5, 
            "review": "Yesterday was my first time here and it was delicious. I did a to go dinner ordered one roll called dragon and staff are very nice. CAME back the next day with my friend chez everything was good same thing everything was awesome."
        }, 
        {
            "index": 367, 
            "rating": 5, 
            "review": "Sushi Twister is one of my favorite sushi bars in town. The ambiance is delightful and the staff ALWAYS greets you with a warm welcome and sincere farewell, both important topics for me. \nAs a novice I used to enjoy the Todai's and Maikino's of the world, but now I know better. The sushi here is from a much better quality and their presentation is very resourceful. Although some people have raved about their all-you-can eat, I recommend their sushi box for two (around $29). You wil get a nice selection of susji, sashimi, teriyaki and tempura. The serving is more than enough for two people. \nSushi twiester also offers live jazz on some nights, but my grave yard shift prevents me from enjoying those."
        }, 
        {
            "index": 368, 
            "rating": 3, 
            "review": "Well I eat there and was pretty good until this jap lady i think she is the manager she works has a waitress i was surprise when i paid my bill she over charges me $10.00 dollars, only bec. my daughter take a bite from my roll , my daugther is 3 yrs old and she is very picky ,she was very rude standing behind me and were very uncomportable, instead telling me what to do she just smile on me she dont say nothing and charge me after.the food is excellent, and i love sushi, to bad that happen to me even i love sushi , i never go back bec. the service is no good."
        }, 
        {
            "index": 369, 
            "rating": 4, 
            "review": "I'm very particular about my sushi and so when my friend told me about this place I was skeptical as ..well... its on the complete opposite side of town as my usual sushi spots, but I sure am glad I gave it a try! The salmon was delicious and the sweet shrimp did not disappoint. Love it:) I'll be back for sure:))"
        }, 
        {
            "index": 370, 
            "rating": 5, 
            "review": "Great little spot! I really enjoyed the AYCE deal. The waitstaff was friendly and the sushi was tasty! Enjoy!!!"
        }, 
        {
            "index": 371, 
            "rating": 4, 
            "review": "Pros: \n1. The staff are friendly and attentive.\n2. The portions are just right considering the cost of each item.  \n3. The atmosphere is upbeat, and the restaurant is clean.\n\nCons:\n1. The chicken & beef teriyaki options are absolutely drowning in teriyaki sauce.  It would be better (and cheaper for the business) if the chef would hold back on the sauce a bit and allow the patron to ask for more sauce if necessary.\n2. The all-you-can-eat (AYCE) option is priced a little high (Lunch ~$23, Dinner ~$27), especially when you consider that the Bellagio buffet is only a couple dollars more.  The lunch price should probably be closer to $17-$19, and the dinner option somewhere around $23-$25 (at most).  \n\nSummary:\nThe AYCE menu has additional rules you need to know, such as a time limit and \"excess food\" charges.  Since these rules can change, I won't waste time writing them all here, but before you order, be aware of these rules.  Also, you may need to adjust your ordering strategy if necessary, such as ordering a lot of food right away because there's a time limit, and since your items are freshly prepared, you don't want to waste time waiting for your food to arrive.  \n\nThis place isn't cheap, but the quality and taste almost match the price.  I'm not convinced that this place is special enough to warrant a far commute, but if you're in the immediate area, I recommend a visit."
        }, 
        {
            "index": 372, 
            "rating": 5, 
            "review": "4 of us were on a mission for AYCE sushi and a friend recommended we go to Sushi Twister.  Started-off ordering all the nigiri sushi we could think of, since we didn't want to get too full on ordering the rolls (too much rice).  The quality of the fish was good and the service from our sushi chef Takashi was excellent.  Once we felt we got our money's worth, we started ordering the rolls.  Needless to say by the time we left, you could have rolled us out.  Some of my favorites were the white tuna, garlic tuna, unagi, sake and hamachi.  The Cowgirl, Monkey Balls, Screaming For Vengeance and Twisted Scallop were some awesome rolls.  To be honest, everything we ordered was fresh and delicious.  A must try if you're near Boulder Highway and Tropicana."
        }, 
        {
            "index": 373, 
            "rating": 5, 
            "review": "NOTORIETY:  All you can eat sushi buffet.  QUALITY sushi buffet.\n\nFOOD:\n    Lunch buffet (~$21):  Great selection & great tasting sushi.  The salmon was hands down the best, as it melts in your mouth.  They also let you customize the sushi, whether you want cut rolls, hand rolls or something else.  However, their level 5 spicy sushi wasn't very hot & some items are limited to 1 per person (i.e. mochi dessert).\n\nOVERALL:  Great hole in the wall joint I'll def. come back to. I prob shouldn't be telling you about this place since you might end up going here & causing me to have to wait for a table the next time I'm in town.\n\nTIPS:  \nThey have both a lunch buffet (excludes drink; 11am-4pm) & dinner buffet.\n\nI liked the yellow mango with shrimp, spider man"
        }, 
        {
            "index": 374, 
            "rating": 4, 
            "review": "I have never been disappointed when visiting this restaurant.  They have the best sushi in Las Vegas.  The Matsuri roll and the Ecstasy roll are the bomb.  The all you can eat prices are very reasonable.  The service is prompt and always polite.  So worth the drive from the other side of town.  All I can say is Yummy!!"
        }, 
        {
            "index": 375, 
            "rating": 5, 
            "review": "One of my two favorite places in Vegas. Nice, fast, friendly service with a good variety on the menu. Deep fried rolls are great because they are not soaked in batter. They are very light so they don't fill you up so fast. Magic Mountain and Ecstasy rolls are a must. Average price for all you can eat coming in at around $60 for 2 people with fountain drinks."
        }, 
        {
            "index": 376, 
            "rating": 5, 
            "review": "This is our second time here at the restaurant. Family brunch on a Sunday afternoon. One thing I loved is the half off the all you can eat price for kids. Our service was provided by Jacob and he was very friendly and fast. Highly recommend to sit in his section. For desserts I recommend the mochi."
        }, 
        {
            "index": 377, 
            "rating": 4, 
            "review": "I love sushi, and this place is good. Their a little heavy with the rice as some have said on their rolls, but not to a point that puts it out of proportion with the rest of the ingredients. The Dynamite is awesome, couldn't get enough. Had the Ninja, Matsuri, Tiger Yamazaki to name a few and all were very good."
        }, 
        {
            "index": 378, 
            "rating": 4, 
            "review": "Took both my uncles here for some good ol eating grub and they love this place. Sashimi bento and some miso soup. I ordered the kobe slices and tempura and Kolbe ordered the tempura. Good eating all around and the tempura was well done in a light batter and the steak was deelish. Wanted to try some sushi but I was craving meat like a t-rex at a buffet.......... great service and overall a great small establishment.\n\nOne thing I should point out....Both uncles were in the restaurant biz so if they HIGHly suggest this place, then who am I to argue? Go, you wont be disappointed and not only that, my uncles wont kick my ass for talking smack about this place.\n\nItadakimas!"
        }, 
        {
            "index": 379, 
            "rating": 4, 
            "review": "The service is terrific and the sushi is good. I have had better, but the service and atmosphere make it worthwhile. The Cowgirl and the Spiderman rolls are my favorites. My husband and daughter love the octopus. They have a good saki menu and the pan fried dumpling is the best in town. My husband originally told us that he would never eat sushi, but once he tried it it is his choice is sushi now."
        }, 
        {
            "index": 380, 
            "rating": 4, 
            "review": "This place was ok. Nothing bad, just wasn't as great as its hyped up to be. I will admit that they give a great range of options for the AYCE. The service was great, very friendly. I will try it again maybe during the day next time."
        }, 
        {
            "index": 381, 
            "rating": 3, 
            "review": "I've been here a few times years ago and remembered liking it but in my recent visit it started really good but ended so so. Enjoyed it to some point but not enough to give them the 4th star maybe 3.5 star \n\nThe good was definitely the nigiris, not a huge selection but the fish used tasted delicious and looked very fresh. The non-rice pieces were a lot larger then the size of the rice which is always great.  I basically worked my way down the list of nigiris they served. Enjoyed most of them with  the tamago and garlic tuna being just a couple of the ones I like. The one thing I didn't like about the nigiris was the rice didn't seem right or at least made to how I usually get them. They kept falling a part and tasted like it was missing something.  The uni and sweet shrimp is only offered on the dinner menu which for $4 more you can upgrade from your lunch price but I wouldn't recommend unless you really want them, what I was told, the only difference is one order of uni and sweet shrimp.\n\nThe Salmon Skin handroll wasn't that bad, two bites and it was gone. They had something called the Monkey Balls and I had to try it.  It was meh didn't care for them. It was something bitesized and fried but runny and taste so good .  I poured some of the liquids or sauce out after the 1st bite. The fried tofu is served hot so let it cool down and poke salad was a bunch of seaweed and little fish both were alright. The salmon and tuna kamas were both burnt, dry, and overcooked. The green mussles were also burnt and overcooked. The shrimp tempura were standard, ended up getting maybe 5 orders just cause I love shrimp tempura. I didn't see any oysters which are another item I love getting at sushi spots. I sampled some of the rolls not bad. I need to try more they had your usual regular, fried, and baked rolls. \n\nIts a small place and it got busy on Saturday between lunch and dinner. The service started great and got my first orders quickly but after that there was almost 10+ min gap between me finishing my plates and them checking on me. I even got the bill early as I was still a little hungry.\n\nWould I go back? Yes, it's still a pretty solid sushi spot for the area."
        }, 
        {
            "index": 382, 
            "rating": 3, 
            "review": "The food is amazing, me and my friends love going there for the all you can eat sushi. The only thing that I have a problem with this place is the poor cashier service. I am talking about the young latin chick in the front. Before her I use to love going there, now we have to go to  other places that we like but are very far away to go. But we would still make the drive to the other side of town rather than deal with her attitude and poor customer service. And I live right up the street from this place.  The waiters and cooks are great and very very friendly. If only they got rid of her it would be a much better place."
        }, 
        {
            "index": 383, 
            "rating": 5, 
            "review": "So far our favorite spot for sushi.  We've tried so many different places yet we find ourselves only wanting to come back to this one.\n\nIt's $26.95 for dinner and I believe $22.95 for lunch.  It's a little bit of a drive if you don't live on the East side of town but hot d*mn it's worth it!  The cool thing is that if you're into sports, sometimes they'll be playing basketball or football games on their projector.  If I had to dock them any points, however, it would only be for the amount of times you would have to eat there before you receive a free \"AYCE\" which is 12x.  I wish it were only 10 at the most.  For the record, we've already earned 3."
        }, 
        {
            "index": 384, 
            "rating": 4, 
            "review": "Great place for lunch. Loved the food. They have a great all you can eat special. Staff is very friendly. A lot of tasty choices to choose from."
        }, 
        {
            "index": 385, 
            "rating": 5, 
            "review": "A small place and families love going there. It feels real and the staff are friendly. The list of sushi to order is awesome. It fills out fast. A gem. The table or bar, either way the service is team and the food is great."
        }, 
        {
            "index": 386, 
            "rating": 5, 
            "review": "This is my go to sushi spot!  I love everything that I have tried there.  I always get the Volcano roll just because it is my favorite but I also like trying a new roll everytime too.   Here are some of my faves....\n\nMagic Mountain\nRainbow\nCowgirl\nand of course the namesake Sushi Twister\n\nStop by and enjoy some awesome fresh sushi!!"
        }, 
        {
            "index": 387, 
            "rating": 3, 
            "review": "solid sushi. nothing really stood out. service is good though."
        }, 
        {
            "index": 388, 
            "rating": 4, 
            "review": "I wanted to try out a AYCE place so after seeing the good reviews and because of the close distance I decided to try out Sushi Twister! \n\nIt's a pretty small place but we were seated right away on a Friday night. I recommend sitting at the bar for faster service. We were seated at a table first but moved because it was kind of hard to get the servers attention. At the bar you can order directly from the chefs. \n\nWe got mostly Nigiris which were all pretty good. Salmon was my favorite! They have a few items that you can only order once like Uni and sweet Ebi. The rice was a little dry so it kept falling apart but meh that's okay. For $27 I think it's an awesome deal and I'll definitely be going back!"
        }, 
        {
            "index": 389, 
            "rating": 4, 
            "review": "We love Sushi Twister for all  you can eat. Their party platter is good too. Best Sushi spot on the East side."
        }, 
        {
            "index": 390, 
            "rating": 5, 
            "review": "my mom (mom is Japanese and a critic on the Vegas Japanese establishments since moving from NY) took us here on a recent visit for the holidays. Food was excellent! we had lunch and the amount of food was so much we couldn't finish. Tempura, teriyaki chicken, sushi rolls, all were great lunch choices. Next time I visit I'd like to try AYCE menu. Definitely would recommend, also off the strip with lots of parking."
        }, 
        {
            "index": 391, 
            "rating": 1, 
            "review": "Would not accommodate in switching tables. My mom told the employee that she wanted a larger table and the worker told her no because it was their busy time and if a larger party comes, we would have to move. There were 2 empty tables and it was past 2PM. Are you kidding me? Go find another restaurant that would ease your dining experience. There's so many different sushi restaurants around the area that you can go to."
        }, 
        {
            "index": 392, 
            "rating": 2, 
            "review": "I can't give this more than 2 stars because the service last night absolutely STUNK.\n\nI was really bummed because my brother LOVES this place and has been bugging us to try it for months.  I couldn't wait to give it a shot. The AYCE sushi itself was good.  Pretty standard in my opinion, but nothing bad.  We really liked the Mexican roll and I thought the albacore and garlic tuna were really yummy.  None of the others really stood out.\n\nBut on to the part that drops it down to 2 stars (and ensures I'll never be back).  The service was unbelievably slow.  I mean REALLY slow.  Granted, they only had two sushi chefs and one waitress and the place was almost full... but hey that's not my fault.  Get some more staff!  And while you're at it... get some food servers with a decent personality!\n\nMeh... sorry Sushi Twister.  I know you have your fans, but I'm not one of them.  I'm going back to Sin City next time I have my AYCE craving!"
        }, 
        {
            "index": 393, 
            "rating": 5, 
            "review": "I like their all you can eat sushi better than their sushi lunch, but for that I like to go to Ninja 2 Go unless I can't go that far then this is a good choice. The food is fresh and well made and the service is great they always greet you when you come in and when you leave which I think it's nice. It's not too big or too small, if you decide to dine in during your lunch time you have to remember to tell them that you are limited in time or they take a little bit longer on their service but they work fast if you tell them when you arrive."
        }, 
        {
            "index": 394, 
            "rating": 3, 
            "review": "I would have given more stars because the food usually is very good and service is great. But I ate there just a few days ago with my boyfriend and both of us got food poisoning. Still sick as I write this. We are calling the manager today."
        }, 
        {
            "index": 395, 
            "rating": 5, 
            "review": "We stumbled across this AYCE sushi place thinking it would be terrible. My mistake! It's actually pretty good! We are primarily nigiri lovers so we always get the AYCE and order salmon, yellowtail, tuna, etc. All comes in time, fresh and delicious and flavorful. In addition they have a great appetizer menu and other regular rolls. Service was great and attentive.\nThis is a smaller place and you may have to wait awhile to get seated. The music played can be obnoxious. On one side of the wall is a projector showing some TV shows, it had CNN and food network the last time we were there. Kinda nice."
        }, 
        {
            "index": 396, 
            "rating": 4, 
            "review": "Sushi Twister is one of the most conveniently located sushi restaurants for people on the East side of town.  I go here for lunch or dinner at least once or twice a week.  Their menu has a great deal of variety.  There are even plenty of things to eat for friends who don't do \"raw fish.\"  The staff is very friendly.  They even know exactly what I will order, and always greet me with a smile.  The all you can eat is $20.95 for lunch, and $25.95 for dinner. Like other places in town, they have a stamp card.  I often get sushi to go as well, and the presentation is very nice on to-go orders too.  I definitely recommend this place for anyone on the East side of town."
        }
    ]
}