{
    "category": "Las-Vegas", 
    "entity": "Four-Kegs-Sports-Bar", 
    "avg_rating_stars": 3.8559782608695654, 
    "review_count": 368, 
    "reviews": [
        {
            "index": 1, 
            "rating": 4, 
            "review": "This was our fourth time to visit Four Kegs and it was just as good as ever.  We originally came after seeing it on TV.  Our favorite things to order are the original Stromboli (pepperoni, ham, sausage and cheese wrapped in the yummiest dough ever) and the Cajun fries.  A large strombolli easily feeds 2 people and only sets you back about 12 bux.  The fries are 3bux and are plenty for 2-4 people depending how much you want to stuff yourself.  Crazy good deal!! Very much a hole in the wall place with great food and people.  We tried the veggie strombolli this last time and it had great flavor.  The restaurant isn't in the greatest area but totally worth the short drive (about 8 miles west of the strip) especially if you go for lunch."
        }, 
        {
            "index": 2, 
            "rating": 3, 
            "review": "I used to live right around the corner so I enjoyed it as a good place to end the night with some cheap beer and cheap, good food. My favorite thing that I always order are the deep fried pickles with ranch and hot sauce. I've never actually had their stromboli, but its all pretty much good, classic bar food."
        }, 
        {
            "index": 3, 
            "rating": 5, 
            "review": "One of my favorite places to eat. Pizza is amazing. Stromboli is great. Cajun fries are my favorite. I've had the burgers, wings and fried pickles as well... All winners.  This is an old dive bar but don't let that stop you from trying it. Call in an order to go if you want."
        }, 
        {
            "index": 4, 
            "rating": 5, 
            "review": "Loved this place!  Me and my wife visit vegas alot! We were in town during football season and wanted to check out a new spot and we are glad we found this place! ! Pizza is amazing and you can't beat the prices during football games. Service was great also. We will be making this a regular spot to visit whenever we are in vegas! Highly recommended!"
        }, 
        {
            "index": 5, 
            "rating": 1, 
            "review": "Really.......4 stars???......Really.....???\nThe service is good; but the food is mediocre at best.\nEnough said."
        }, 
        {
            "index": 6, 
            "rating": 4, 
            "review": "Because of Guy Fieri, I came here to try their stromboli's and pizzas. The pizzas were great, and the stromboli's are good. \"Diners, Drive ins, and Dives\" got it right, this place is great."
        }, 
        {
            "index": 7, 
            "rating": 5, 
            "review": "I was basically raised in this bar.  I grew up down the street and i still live in the area.  i love this place.  it is def the best dive bar around.  The service is nice and the food is great.  i always order fingers plain with about 8,000 sides of hot sauce... they never charge for the extra sauce even though its absolutely ridiculous of me to order it.  During football season they offer half priced wings during games... I love how they cook their wings... they are always crispy and good.  I love that this place isn't a PTs or any other typical/ franchise bar... it is definitely a hidden gem... i always call and order food to go and it's always hot and delicious... after midnight they offer half priced pizza and strombolis... it's been on Diners, Drive Ins and Dives and since it has it has gotten a lot of visits... see the pin board to let them know where you're from... but it has never changed...always has my vote for go to bar food and cold beer!"
        }, 
        {
            "index": 8, 
            "rating": 5, 
            "review": "I saw this place on the Food Channel on Dinners, Drive-ins and Dives.  I had to try it.  From the first time, I tried the original Stromboli, I was hooked.  The original Stromboli is a solid 5 stars.  I make it a point to eat here every time I am in L.V.  \n\nAs for the place itself....  I have read other reviews about how seedy it is and awkward the building is.  But until you here what the owner did, one would not understand.  The Four Kegs was a bar that served food.  When Las Vegas passed the law that you could not smoke where food is served, the owner had two choices.  Either close the food section and keep the bar only or do what he did.  Thankfully, he came up with the unique design the encapsulate the bar in the center, which keeps the smoke in the center and completely away from the eating area.  Luckily for me, he came up with he design because I love the Stromboli."
        }, 
        {
            "index": 9, 
            "rating": 5, 
            "review": "I been coming here for about 2 years and I love coming to eat Stromboli at midnight when it's half off and the waitress Ashley is so amazing she works very hard and has excellent service she is the best waitress ever!!!"
        }, 
        {
            "index": 10, 
            "rating": 5, 
            "review": "They make a wonderful philly cheesesteak and also a chicken one if you don't like beef.  Great burgers and the Stromboli is awesome!!!"
        }, 
        {
            "index": 11, 
            "rating": 4, 
            "review": "Stromboli.......Stromboli........That all you need too know about Four Kegs. After three hundred plus reviews not sure what could add. Try I am..This was my second or third visit to Four Kegs. It not very often come but the few times made it been for some late night grubbing. I came for dinner celebrating a hana ho dinner with my old roommate that was in town visiting. \n\nOther friends joined us so talk about deep fried spread of munchies and naturally some Stromboli. The deep fried food aka chicken fingers, mozzarella sticks, and zucchini sticks. Nothing special just your normal bar food. If there is anything worth mentioning about them. I enjoyed that they were nice hot hot, not overcooked, and the hot sauce was good on the chicken fingers. Really the star of the show is the Stromboli. I ordered the full size Meatball Stromboli. Awesome! The size is ridiculous. Even the smaller size it can easily be for two and the large if one person can eat the whole thing GOD BLESS. Once you get the first bite never know just might finish the whole thing. I had two pieces left. The reason find it so addicting. The crust is perfect nice golden brown, the dough is awesome, nice moist and fluffy dough cooked even all around, and the tomato sauce inside is delicious. The filling can choose from few different ones but went with the meatballs. The fillings just as generous with the portions. In every bite had piece of meatball. Just solid solid Stromboli. The prices are super cheap under ten dollars for one. Other things on the menu but if come Four Kegs Stromboli the way too go!!!!\n\nThe place talk about personality. I have no idea the length of time but Four Kegs I know been around for long long time. It really shows in the inside. It truly defines hole in the wall. The bar area itself in super small. They have bunch of poker machines all around and even some separate away from the bar. The restaurant area is off to the side. Talk about hole in the wall. They give you plastic forks and knives. Paper plates. At the end of the day about the food for me. I just think you will find some of the best food in hole in the wall spots like Four Kegs. The Stromboli is one of them. If triple D think it worthy then worth checking out. Just don't expect to be blown away the minute you walk in."
        }, 
        {
            "index": 12, 
            "rating": 4, 
            "review": "One opportunity I wanted to take advantage of while on vacation in Las Vegas was trying one of the restaurants I saw on Diners, Drive -Ins and Dives. My wife and I decided on Four Kegs. \n\nDriving up to it at first glance and it's easy to see which category this place falls under: It's a dive. \n\nBut I mean that in the most positive sense of the word. \n\nUpon entry you are greeted with a smoke smelling bar / gaming room but to my surprise and delight, the dining area is sectioned off completely by windows and doors so the smoke doesn't seep into the dining area. \n\nYou can tell this place is proud to have been on Diners, Drive-Ins and Dives as there are multiple pieces of Guy Fieri memorabilia on the wall, but it added a little charm to the restaurant. \n\nAs we sat down we were promptly greeted by a waitress (older, friendly lady whom I suspect has been there for quite some time). She was ale to take our entire order without writing anything down and obviously remembered it perfectly. On top of our table there were at least five other groups of people she was attending to yet it didn't affect her attitude or pace in the slightest. \n\nWe started with the fried pickle spears and the cajun fries. Both appetizers were perfect. The breading on the pickle spears was near perfection and seasoned perfectly. It was obvious they use fresh ingredients and high quality pickles. The cajun fries were steak fries (I assume freshly cut) with buffalo wing sauce an seasoning on them. Again... perfect. \n\nI ordered the french dip. My only complaint was that the roast beef was SLIGHTLY dry but that was easily offset by the au jus. Not the best french dip but definitely in the upper echelon of french dips I have tried. \n\nMy wife ordered the fish and chips (Friday Special) and she said it was solid, but not spectacular. She still finished them off and I tried them. Good quality seasoning. \n\nMy step daughter had the wings and, on the kids menu, they wisely put the sauce on the side rather than completely dousing them. She took leftovers home and polished them off too. \n\nOverall, combining the service, freshness and quality of all the food,this is a good four stars. If I ever return I will have to try the stromboli, which seems to get a lot of praise."
        }, 
        {
            "index": 13, 
            "rating": 5, 
            "review": "Ah, the Four Kegs. I remember eating pizza here with my mom and dad in the late 70's and just like then, I still get excited when I walk thru those old doors and sit in one of those old booths!! This IS old style Vegas, most non Vegas natives can't handle places like this, maybe it's not fluffy enough like P.T.'s or Timbers. Well that's just fine, march your bootay right on down to those places and leave the best damn pizza, Stromboli and ice cold beers in those great old mugs to us that love places that have stayed true to us born in Las Vegas natives for so many years! Done with my rant, where's my Boli."
        }, 
        {
            "index": 14, 
            "rating": 5, 
            "review": "Was a great place! The food was awesome the steak was exactly what I asked for!  Definitely going to go back !"
        }, 
        {
            "index": 15, 
            "rating": 4, 
            "review": "(3.5 stars) Driving by, this place definitely wouldn't strike you as a dinner spot. I don't know if I would travel out of my way for it, but for bar food, this place is shockingly good. The prices are also reasonable and the portions huge. \n\nThe mac and cheese bites are awesome, a little heavy but perfect for sharing. The meatball stromboli is especially huge and surprisingly great for a non-Italian restaurant. The cajun fries are essentially just fries and buffalo sauce, which is obviously tasty but also disappointing. The burgers aren't the best but they're still pretty good and super filling."
        }, 
        {
            "index": 16, 
            "rating": 5, 
            "review": "My Uber driver said this place was recommended by a client. Great Stromboli which was large enough to share. Coors light tastes so much better in a frosty glass! Thanks go to our waitress for the fun visit."
        }, 
        {
            "index": 17, 
            "rating": 4, 
            "review": "Dive but in a good way.  Go w wings and Stromboli for the ultimate experience.   I'd prefer it at lunch but open 24 hours."
        }, 
        {
            "index": 18, 
            "rating": 4, 
            "review": "Waited along time to try this place out. It's a dive bar but not a bad thing. If after 12:00am you have to ring a buzzer but you'll figure out. Location is a bit past Fremont if you take I-15 n. \n\nTo set the stage I live in Hawaii and a good Stromboli is harder to find then a cure for cancer. I'm literally drooling from anticipation, the sauces, cheese, a nirvana of favors, a gooey paradise. \n\nIt was ungodly good maybe because it's been so long. Not the best Stromboli but one of the best I ever had. Sauce not as spicy maybe watered down a bit and the dough although very good, was separating from the cheese like it was previously frozen.  I'm guessing they have to since place is so busy. Place was packed at 930pm at night. Overall worth a trip from the strip. \n\nPros- fiancé loved it, her first Stromboli. Beer cold, lemonade good, very inexpensive. 21 for 2. \n\nCons- .99 for marinara sauce to come with the Stromboli are you kidding me, should always be standard. this nickel and dime thing with charging for everything not a fan.\n\nHighly recommend for a one time visit but still on quest to find the best Stromboli,"
        }, 
        {
            "index": 19, 
            "rating": 5, 
            "review": "The food here is amazing! Everything we've ever ordered has been delicious. Every time my bf and I are in Vegas, we just have to eat here at least once during our trip. They also have some good lunch specials. Prices are decent and portions are big. \n\nPROS:\n-Pizza: It's so yummy and has a good sauce to cheese ratio. I always get it with pepperoni and jalapenos and I love that their jalapenos are spicy, not like many other places where they taste tangy but have no kick at all.\n\n-Stromboli: Generously stuffed, pretty big in size and delicious.\n\n-Buffalo wings: Perfectly cooked, crispy and covered in awesome buffalo sauce. Nothing worse than dry buffalo wings, but you won't have that problem here!\n\n-Philly Cheesesteak: Another hit. Big with plenty of meat and lots of melted cheese.\n\n-Fries: Thick, hot and crispy. Perfect!\n\nCONS:\n-It's a little out of the way and in a weird neighborhood.\n\n-They don't have a hostess stand so when you walk in it can be somewhat confusing if it's your first time. It's worse if it's busy because the waitresses are occupied so you end up just standing in the middle of the dining room or walking around not really sure where to sit or who to ask for a table. Once they notice you though, they're pretty good at seating you right away, it's just awkward for the first few minutes. Just thought I'd mention that. haha!"
        }, 
        {
            "index": 20, 
            "rating": 2, 
            "review": "Four Kegs used to be such a great place to go. When you walked in everybody knew who you were the servers were super friendly, the food was always fantastic, and the beer was consistently ice cold. Can't say the same anymore. I started going to four kegs more than 20 years ago and I just don't enjoy it anymore. The food is crap at best and inconsistent all the time. The servers with the exception of one older lady who works in the back dining room the servers have no personality whatsoever and you feel like you're going into an old time coffee shop most of the time. I've been in there when there's games on you can't get them to change the channel to put on a good game for the most part but golf is always on. not liking it anymore."
        }, 
        {
            "index": 21, 
            "rating": 4, 
            "review": "This is not too far from me, I typically hit this palace up with my cousin during games of all sorts. This place has been here for quite some time as the rest of the shopping center has died due to the highway expansion this place still thrives. I love the Southern Spicy wings here, they are hot and spicy without any sauce since its a dry rub of sorts. The Stromboli are good but its not a favorite of mine. Service has always been friendly and refills quick no matter how packed the place gets during games. I didn't know Guy Fieri came here for his TV show but what ever."
        }, 
        {
            "index": 22, 
            "rating": 3, 
            "review": "I would give Four Kegs a solid 3.5.\nService was consistant for a group of us there in the early afternoon. We ordered a bunch of items for the group.\n-Chicken wings were good, nice and crispy with good flavors.\n-Not a fan of the pizza, reminded of something from pizza hut with too much sauce\n-THE STROMBOLI- the best i have had since moving west but still not that go to staple i grew up on back east. The outside was nice and crispy but there was alot of dough. I wish there was more meat inside. What was there was good. Not a fan of the sauce on the inside but that's how it was ordered. I will give it another try with sauce on the side.\nThere is a very selective menu with many items that i will go back to try. Prices are very reasonable!"
        }, 
        {
            "index": 23, 
            "rating": 2, 
            "review": "So we were looking for somewhere to have dinner Friday night and decided to check this place out.  I have never stepped foot in the place but have heard good things about it.  Walked in and just a wierd setup for the bar and resturant.  We walked around to the dining room and found a seat right away.  Our waitress was nice, attentive, yet somewhat odd.  Thats normal in some of those dive bars/resturants so no deduct for that.  \n\nBoth of us ordered beer and my friend got his in the mug.  The waitress said it was suppose to be more frosty than it was but as long as its cold beer its good.  So much stuff to order on the menu but I was craving a burger so I ordered the western bacon cheeseburger.  My friend ordered the meatball sandwhich.  Everyone around us seem to be enjoying the food so we were excited to eat it up!!  Lets just say it was pure disappointment.  My burger was suppose to be medium, well it was well done.  It was so dry and flavorless.  The bbq sauce and cheese was the only good stuff on it.  My friends meatball sandwhich was cold.  He only ate half of it because of that reason.  We paid for our food and headed out.\n\nI probably wouldnt check this place out again.  It just didn't leave a good taste in our mouths.  I am all about some good dive, grease food, but this just wasn't the place."
        }, 
        {
            "index": 24, 
            "rating": 5, 
            "review": "Stromboli - Calzone - sausage roll -- whatever you call it -- it was wonderful.  Thanks Guy Fieri!  Priscilla our waitress from Memphis gave this place the fifth star!"
        }, 
        {
            "index": 25, 
            "rating": 1, 
            "review": "Pretty disgusting.  It smelled like an ash tray, the air conditioning was on minus 10 degrees, and the Stromboli?  Well, let's just say I gagged in my mouth while I was eating it.  Will never return."
        }, 
        {
            "index": 26, 
            "rating": 5, 
            "review": "This place holds a special place in my heart, ive been coming here since I was a little boy. My parents used to come here when they were teenagers! There pizza is great, its ky second favorite spot for beer and pizza. But my favorite place to drink in general. Good prices, great place to meet up with old friends and grub on some wings, pizza, stromboli!"
        }, 
        {
            "index": 27, 
            "rating": 5, 
            "review": "The original is the best boli I've ever had! Sat at the bar, great service. Justin took great care of us. So glad I ate here. Ps. Cold glasses for the beer are a huge plus!! Great place to watch football."
        }, 
        {
            "index": 28, 
            "rating": 3, 
            "review": "Ever since we discovered this place from watching Diners, Drive-In, and Dives, my husband requires a stop here while we are in Vegas. We always get the stromboli--my husband loves it, I just like it. I personally have had better but thats because I remain loyal to my hometown Italian joint, Three Brothers, in MD."
        }, 
        {
            "index": 29, 
            "rating": 4, 
            "review": "This place never disappoints, awesome stromboli's. This is my 3rd time here since moving here. Always a favorite anytime..."
        }, 
        {
            "index": 30, 
            "rating": 4, 
            "review": "Guy was right.  The 'boli's are awesome.  We got a large veggie and a meatball and that was enough for the 4 of us (granted, one is a 14 year old girl...).  The beer was extra cold and went down really smooth after the 4 hour flight into the 105 degree afternoon.  The place is truly a dive, but worth the trip off to the north side.  If you're on the south half of the strip it might not be worth the cab fare, but if you have a rental like us it is worth the drive."
        }, 
        {
            "index": 31, 
            "rating": 5, 
            "review": "I was one of the many people that wanted to come to Four Kegs because I seen it on \"Diners, Drive-Ins, and Dives\" on Food Network. When I seen the episode, I didn't live in Vegas, but upon moving here, this was one of the first places I had to eat at. Needless to say, I fell in love with it. Every time my husband and I go there, we have to order their Hot Wings.\n\nTheir Hot Wings are the \"perfect\" spiciness, in that they have a bite to them but not so much as to numb your lips. Their Pizza is amazing and they usually have some deal going on where it is 1/2 off during Nascar or NFL season. Stromboli there is amazing. Enough said. I also like the fact that you can come and eat there after midnight and get 1/2 off of both Pizza AND Stromboli, which is good if you are a night owl or a clubber. \n\nI live in Henderson, but gladly drive up to the Summerlin area when I'm in the mood for Pizza, Wings, or Stromboli, just for this place. Props to you guys, you're doing it right!"
        }, 
        {
            "index": 32, 
            "rating": 5, 
            "review": "The stromboli as everyon knows by now is spectacular. What gets overlooked is the rest of the menu. No frills standard barr fare, but done perfectly. Staff is excellent as well.\n\nThe mushroom swiss burger was cooked to perfection and smotgered in sauteed mushrooms. \n\nThe fried pickles are seasoned better than any Ive ever had. \n\nMust try for the locals."
        }, 
        {
            "index": 33, 
            "rating": 5, 
            "review": "There's nothing good to say about the location or the decor but I give the Four Kegs 5 stars on the original stromboli alone.  I've been there probably 10 times since it appeared on DDD and the original boli is so delicious that I order it every time.  The only other thing I've tried are the cajun fries (fries tossed in buffalo wing sauce).  They were tasty but nothing to write home about."
        }, 
        {
            "index": 34, 
            "rating": 5, 
            "review": "Coldest beer around. Crispy wings were great and stromboli was awesome. A must stop every Vegas visit"
        }, 
        {
            "index": 35, 
            "rating": 5, 
            "review": "i love four kegs! saw this place on diners drive ins and dives. guy was actually right this time, the food is so good! every time we go to Vegas, which is quite often, we have to stop in at four kegs! i recommend the bolis, the pizza and the wings! The boli (stromboli) is so delicious, its like a calzone filled with yummy goodness! You can split it though which makes it nice because then you can try more things on the menu! I highly recommend this place! Each time we have been, we never have to wait to sit down, and the staff is nice! It's a little ways from the strip but worth the drive!!"
        }, 
        {
            "index": 36, 
            "rating": 4, 
            "review": "We heard about 4 Kegs on Diners, Drive In's and Dives. We had a Stromboli and it was very good. Our friend had fingers and fries and both were very good. The place was busy and all the food looked good. It's not in the best area of town. I would recommend it because the food is good and reasonably priced."
        }, 
        {
            "index": 37, 
            "rating": 1, 
            "review": "Dive with a capital DIVE (in fact it might be the dive that the dive took).  Don't be rolling over there with your Bling-Bling, Prada Purse or Gucci Sunglasses matter o' fact if you have some yard work, gotta change the transmission on your ride, replace the roof on your crib or clean out your pig pen might wanna do that first, then without showering or changing you should roll over to the 4 kegs for your boli - trust me you'll fit right in, an instant regular.\nI love Diners, Drive Inns and Dives the show so on Guy's advise I put it on the bucket list.  On my last trip to L.V. I made the venture, SADLY, Guy must inhaled too many bleach fumes the last time he got his wig done up.  I ordered the one of O.G. boli's, one meatball boli, a pizza and some wings.  Certainly smelled good when it arrived at the table and they looked perfectly cooked, nice and golden brown on the outside with cheese oozing out the sides - AWESOME! is what I thought.  I was so disappointed after the frist few bites so I tried the other boli, the pizza and the wings it was confirmed - BUST! (WAH, WAH, WAAAAAAAAAAH).  The Marinara sauce that Guy proclaimed to be \"off the hook\" tasted like it was straight form a can (BTW, the cook looks like he just got out the joint, charged me extra for the marinara sauce - thanks buddy!) The dough which I feel is the most important, was bland and too \"doughy\", meaning it was thick/heavy and fills you up fast.  Pizza I've had better from the freezer section of the supermarket and the wings - NOTHING special.\nSeriously, I don't mean to be a buzz kill and I for sure don't understand why most of the reviews are beyond 2 stars but I supposed we all have different taste buds.  With that said maybe you should give it a try and judge for yourself, my humble advise plz re-read the first paragraph and roll with a buddy (preferably Vin Diesel).  Paz!"
        }, 
        {
            "index": 38, 
            "rating": 5, 
            "review": "Love this place. I used to come here all the time when I lived here. When I come in to town I always make a point stop in for wings. Best wings ever!"
        }, 
        {
            "index": 39, 
            "rating": 4, 
            "review": "Totally dig the atmosphere ! The ladies working the dining area were great and I had a great time ! Matter of fact this was the quickest turn over time for a pizza ! The pizza was fantastic , the sauce was great and the crust was light & airy . Definitely a spot in Vegas I will return to !"
        }, 
        {
            "index": 40, 
            "rating": 4, 
            "review": "Came here for their famous Stromboli and definitely did not disappoint. I ordered the full size meatball but was only able to eat half. It's huge! Not sure about their other menu choices but I'm sure it's all good. The service was fast and the staff was friendly. FYI, the stromboli is half off after midnight."
        }, 
        {
            "index": 41, 
            "rating": 5, 
            "review": "If you know me, you know I love Diners, Drive ins and Dives. I'm actually watching it right now. And I've seen this episode before. More than once. Obviously, I have to go to 4 kegs when in Vegas. \n\nHmmm, let's see. Deep fried everything, cold beer, delicious strombolis, no sunlight, sassy lady servers......\n\nWe had macaroni and cheese fried things, cajun fries, wings, strombolis, mini corn dogs.......\n\nSuper duper."
        }, 
        {
            "index": 42, 
            "rating": 2, 
            "review": "So I take my pursuit of Diners, Drive-in and Drives pretty seriously.   I think this place is one of the iconic places featured in the first season of DDD. \nWhile attending a large business convention, I convinced my wingman, the crown prince of auto accessories to visit Four Kegs for lunch. \nThere is a bar in front, and a small dining room with booths in the back ( access through a glass door).\nThe Stromboli was decent, but not earth-shattering. it did not live up to the hype and expectations. 2 stars\nService was courteous and prompt. 3 stars\nThen there's the smell.  The aroma of stale spilled beer.  That smell is earned at places like McSorleys in the village (Manhattan- one of the oldest continuously operating bars in America), but not here. I don't think they have re-invested any of the profits they have generated from DDD back into their facility or business.  \nPlenty of parking in front. \nThe siren-song of the DDD fame drew me in, but unless I hear of improvements, I will not come back."
        }, 
        {
            "index": 43, 
            "rating": 5, 
            "review": "We had Stromboli and Fish & Chips.  Both delicious;  the fish was fresh, not oily, tasted great; and the Stromboli was Massive, Loaded, Delicious. We did not have the pizza, but it looked Great!!  Do go to Four Kegs."
        }, 
        {
            "index": 44, 
            "rating": 5, 
            "review": "OUTSTANDING Pizza in this place. Servers are always nice, and PIZZA is HALF OFF after midnight. A friend turned me on to this little place and I am so grateful he did. FANTASTIC. They load you up on the pizza toppings btw, its heavy. Been here 10 times now, never a bad visit. Keep it up FOUR KEGS!"
        }, 
        {
            "index": 45, 
            "rating": 1, 
            "review": "Perhaps other menu items are edible but their veggie Stromboli is disgusting. The mushrooms are from a can, not chopped fresh. Only some of the veggies were actually cooked. So there were partially raw onions in the mix.  I was surprised that the veggies weren't sautéed prior to baking into Stromboli.  Waitress was fine, not overly friendly or helpful.  We are from NJ, home to amazing Italian food made by real Italians. This place doesn't even come close. Lousy atmosphere and sketchy cooks. We will never come again and certainly not recommend."
        }, 
        {
            "index": 46, 
            "rating": 2, 
            "review": "I'm not a drinker, but my guilty pleasure is bar food. So, anytime Diners Drive-ins and Dives features a local spot, then I'm obligated to give it a try. \n\nMy first visit was a few years back and I was not impressed. A few of my friends frequent Four Kegs, so I decided to give them another chance to redeem themselves.\n\nThe place was still as smokey as I remember. For my to go order, you pay at the bar then proceed to a room that should be limited to employees only. \n\nThe Sicilian pizza was hard and disgusting. I even tried to improve it's flavor with ranch. Ranch usually makes everything taste better.Their cajun fries were recommended, so we had that too. It seemed like they took soggy fries and dumped hot sauce all over. Their chicken fingers and fried zucchini are the only reasonable options. \n\nI know this place is a local institution, but it's not for me. Everything is not for everybody."
        }, 
        {
            "index": 47, 
            "rating": 1, 
            "review": "I had my last review for Four Kegs removed and received the following message:\n\nWe wanted to let you know that we've removed your review of Four Kegs Sports Bar.  Your review was flagged by the Yelp community, and our Support team has determined that it falls outside our Content Guidelines (http://www.yelp.com/guidelines) because it lacks a substantive first-hand experience. When reviewing, please describe your actual experience with a business.\n\nMy first review said,  \"Guy Fieri's full of shit\"\n\nSo let me clarify: Guy Fieri's full of shit...Because, he said this place is the best stromboli he's ever had and unless he eats stromboli stuffed with shit than he is full of shit for making such a brash statement.\n\nMy first hand experience is as follows. The place smells like stale beer, stromboli is gross, jalepeno poppers are gross, paper plates?\n\nOne star because I am unable to give no stars and because my server was nice."
        }, 
        {
            "index": 48, 
            "rating": 1, 
            "review": "Guy Fieri owes me a huge apology. He owes everyone an apology. He is an ahole, and this place is the worst restaurant / bar I have ever been to. Its not that it is a dive. I like dives. It is a sh&^%t hole. The fact that you have to be buzzed in after midnight doesn't bother me. The disgusting food and poor service bothers me.\n\nThe bartender will not take your food order. He has to call in some senile, toothless woman to take your order. She will come back to you several times, asking you what you ordered, as she didn't remember. Then, she served it in styrofoam containers. She should have just thrown the crap away before she gave it to me. The stromboli is disgusting. The whole thing is disgusting. If you want to clean up Vegas, start here and shut this place down."
        }, 
        {
            "index": 49, 
            "rating": 4, 
            "review": "update! We went here again because we wanted our friends to try it and they've seen it on food network too.\n\nIt was as good as the first time I had it... Even better actually. There were 4 of us and we shared a LARGE original stramboli which has sausage, pepperoni and ham with marinara sauce in their amazing soft bread. The bread is so good I can eat it by itself. Along with that stramboli we had mac and cheese wedges which is fried mac n cheese, hot chicken wings and mini corndogs..all with ranch dressing. So unhealthy but so good. \nWe are going to try to pay a visit every time we are in vegas."
        }, 
        {
            "index": 50, 
            "rating": 5, 
            "review": "I have been to Four Kegs before, but tonight was the first time I had the stromboli. I am SOLD! The crust was the best Italian dough I have ever eaten, the veggies were fresh, and the sausage in the original was excellent! \n\nThe wait staff has probably been there as long as the restaurant, and our adorable Noriko in all her mismatched glory was as sweet as could be and incredibly attentive without ever being annoying.\n\nI will be back, especially since the beer is so cold it ices the outside of the mug - and it's only $2.50 per draft! Good food and cold beer - what a great dive!"
        }, 
        {
            "index": 51, 
            "rating": 5, 
            "review": "The stromboli, hot wings and Cajun fries were amazing! Service was tentative and extremely polite. Looking forward to my return."
        }, 
        {
            "index": 52, 
            "rating": 4, 
            "review": "I had the stromboli to go and I bet its better inside. By the time I got it home and around to eating it just wasn't crisp anymore. Not a good to go food but they quickly took my order and had my food prepared. I will go back."
        }, 
        {
            "index": 53, 
            "rating": 4, 
            "review": "Great strombolli!!!  A must go to for kitchy, divey, tasty comfort food.  If you don't mind the styrofoam plates and plastic utensils.  Sticky tables, smokey air and dark decor.\nBut the food is fantastic!!! and affordable!!! If you're in vegas and have a car, put on your big girl panties and go here.  Bring friends b/c the portions are big. \nWe had the regular and the cheesesteak one.  YUM!!!!!"
        }, 
        {
            "index": 54, 
            "rating": 5, 
            "review": "Love it!  Food is really good and service has always been good for us. Stromboli?  Heck ya!    More please...."
        }, 
        {
            "index": 55, 
            "rating": 5, 
            "review": "Just ate @ Four Kegs for the first time and it was amazing, had the turkey & swiss boli it was amazing!!! Also there hot wings were really good too. The waitress Lucy was awesome too. DEFINTELY will be back not an everyday thing but 4 a nice cheat meal, its the place to be."
        }, 
        {
            "index": 56, 
            "rating": 4, 
            "review": "OK - I was in Vegas for about a week and I wanted to try all of the triple D locations in town.\n\nI skipped John Mull's because it was 105+F the whole week and they only have outside seating.  I had eaten at a different restaurant every night all week and was getting ready to get on the plane and get out of town.  I had Four Kegs on my list and was determined to get in one last DDD before I left town.\n\nI used GPS to find my way here. It is definitely a dive type bar.  It is on the side of a strip mall.  There are no windows, and there is a sign saying \"over 21 only\" and \"after midnight, ring bell for entry\".  Shady.\n\nUpon entering, you are in a typical looking bar with (because it's in Vegas) some video gaming machines.  It smells of smoke.  Off to the left, there is a glassed off area where you can go through a door and be in a small dining room area (with no smoke).  \n\nSince I had to get on a plane in 3 hours, I didn't want to overdo it, so I just got the meatball stromboli as recommended by others on Yelp.\n\nIt was very good, but I can see why people complain.  Northeastern folks are used to a certain kind of stromboli (and Italian food in general).  Midwest and west coast people really don't know anything about the East coast pizzerias and subshops so they have no preconceptions going in.  \n\nThe bolis here have a very buttery crust, almost like a pizza hut pizza.  The fillings are home made and the meatballs are salty but good.\n\nIf you are from NY/NJ, please forget about your preconceived notions of what a stromboli should be and just enjoy it for what it is,.  I liked mine a lot and finished the whole thing.\n\nNote that they don't call the sauce \"marinara\", they just call it a red sauce, so just order that if you want to add an additional dimension to the boli.  I ended up not using half of it, but it wasn't bad.\n\nI would come back with friends to hang out here, it's a very laid-back place.\n\nThe parking lot was full, if that means anything."
        }, 
        {
            "index": 57, 
            "rating": 5, 
            "review": "I've been going here since I could walk! My family are regulars! I love this place! It will forever be one of the best places to get food and drinks!"
        }, 
        {
            "index": 58, 
            "rating": 4, 
            "review": "I love their meatball stromboli.. Just make sure you ask you it cooked a lil longer, it tends to be cokd in the center...This is the best place for late night pizza or stromboli tho"
        }, 
        {
            "index": 59, 
            "rating": 1, 
            "review": "If I could give it no stars I would. Guy Fieri must have been on a nostalgic journey at this dive! The service was beyond poor and the Stromboli was a total disappointment. They refused to make a combination pizza style Stromboli and insisted we only order one of their premade ones. It was undercooked in places, lacked cheese and flavor!!! \nBeyond that...it was a TOTAL dive. Stay away!!!"
        }, 
        {
            "index": 60, 
            "rating": 4, 
            "review": "Great dive bar. Super friendly service and good food. Not overpriced. Good place to have a couple beers with some friends."
        }, 
        {
            "index": 61, 
            "rating": 3, 
            "review": "I want to give them more stars but they are almost a classic case of restaurant impossible, When i go in there i feel like its outdated but that the worst thing i can say because the bolis are bomb, pizza is bomb, they have great lunch specials, the service staff aren't the most personable but they are funny as shit. If you need a quick bite or are craving a great boli or pizza, don't be afraid."
        }, 
        {
            "index": 62, 
            "rating": 4, 
            "review": "Yes, we are like most of the out of town folks who come to Vegas and eat at the Four Kegs.    We saw it on Diners, Drive Ins and Dives.   This definitely fits the bill of a Dive.   Wifey and I have driven past this place countless times and kept telling ourselves, yeah, we need to check that place out.   Well, we finally did a few weeks ago after attending Big Dog's Winterfest.   \nThe place is very easy to find.   it is right off the Jones exit.   You can't miss it.   We found a place to park pretty easily.   The place wasn't that busy for around 8 pm on a Saturday night.   We walked in and went past the bar area, through the interior doors to the dining room in back.   \nWe we quickly greeted by an older friendly Asian lady.   We grabbed a seat and she took our drink orders pretty quickly.   We looked over the menu, but we were on a mission for one thing, Stromboli.   Our waitress brought out the drinks very quickly and we placed our orders.   I got the meatball 'boli and wifey got the standard 'boli.   Both came out in about 10 minutes which was pretty quick.   And yeah, they were awesome.   We totally enjoyed ours.   It may not look like a lot of food, but it is.   We both got to go boxes.   \nOverall:\nFood - Excellent Stromboli. \nService - Terrific\nVibe - Divey\nDrink - it's called four kegs because they only have 4 beers on tap.   So you get what you can.  \n\nWill I be back?   Heck yeah I will."
        }, 
        {
            "index": 63, 
            "rating": 4, 
            "review": "Stromboli = delish! Pizza (cheese,  peperoni and jalapeño) was great!  Beer (coors light on tap) was ice cold thank you, I had a great meal. My family has been going to this place for 10 + years. Its right of the Jones exit from the 95. So worth a shot if you haven't tried this place yet. I come here for a late lunch and dinner,  sit at the bar or in dinning to watch the big screen TV.  The service and food are just great. Great for kids, my nephews always love coming here. The only thing I would change is they need pitchers of beer.."
        }, 
        {
            "index": 64, 
            "rating": 3, 
            "review": "Come here everytime Im in town.  Sadly it seems like the food has lost something each visit.   Original Strombolli again.  Probably 3 stars for bar food and a half a star for a place where quarters still come out of a slot machine."
        }, 
        {
            "index": 65, 
            "rating": 1, 
            "review": "My ex boy friend and I have been coming to this place for 4 plus years. A few positive things I will say is that we have always loved the food and the pizza. We come there late because we both work late.The staff usually is always friendly and they have really nice specials for a late crowd.The neighborhood is a little iffy, but I have always pretty much felt safe because they usually keep the riff raff out.That being said you can imagine my shock and dismay when we went there last night and was treated like complete trash by one of their staff members.I believe the guys name is Shane but I'm not certain.I don't personally know this one particular guy because we usually get the heavier set guy, Rob, who is nothing but nice.I believe I have seen this guy a few times on our way to the back to enjoy their pizza when I don't want to sit at the bar.So anyway at first my ex jokingly rang the boor bell more than once with a smile cause he and the bartender are usually cool...he was thinking he'd at least get a laugh.So someone comes on the speaker and says: \"you two wont be getting in here ringing the bell like that.\" So we patiently wait a few seconds with smiles and we still aren't being let in.I then ring the bell once again and then the door opens by this other bartender we don't normally see....he then looks at my ex and says you aren't allowed in here anymore.At first we think its a joke cause you just never know with guys and we know we have never done anything except act silly with the bell...then when my ex says, \"Really? Why not?\" the guy just unleashed in this angry fury with the foulest language I have ever heard from any employee ever telling him why he wasn't allowed in there anymore. Every other word was the f word and any and all other variation of the f word along with some other belligerent and ignorant things he could say. Apparently he was pissed off that the last time my ex was there that he only gambled 50 cents per hand or something......he accused him of scamming and on and on and on...so the two start arguing because my boyfriend then speaks up to defend himself and it keeps escalating and escalating.....I then finally try and intervene and I'm say \"Why are you speaking to him like that? And asked him who he thought he was talking to like that.  He then says it again but now putting me in it...yous aren't allowed in here anymore.  I was like, \"Dude I don't even f'ing know you, dude\".  I then go on to say that we always come there and sit in the back and order pizza...he then goes, \"Yeah, yous come in here and order your cheap f'ing pizza.\"...and blah blah blah....this of course makes zero sense to me 'cause why offer a special if you are going to accuse your patrons of being cheap when they order it....then I asked if he was the manager...he then lied and said yes....my ex after giving him the finger several times in his face and saying \"F*** off\" asked, \"Are you the owner?\" Again he lied and said yes. I know one of the the owner's names is Mario. So, without warning this guy then starts shutting the door with me standing in the doorway. I mean he is literally hitting me with this door to close it. I could have been injured and for what? I am seriously considering pressing battery charges against this guy because of it.You don't go and behave this way and then you try and assault me with a door? Here's the thing: you have the right to tell us we are banned from your property and for what reasons, but you certainly don't come off talking to people in such a belligerent way unprovoked. We just came there for pizza after working, and if there was a problem then you address it in a calm matter, not like that. And to go as far as trying to close me in a door. It wasn't as if we were trying to force our way in. I was just standing there during the argument this guy started from the moment he opened the door and went off. All of this should be on camera if the establishment tapes what goes on. I can't imagine having an employee that talks to and treats patrons this way. Now I can understand if we came in there messing with other patrons and acting like complete fools, but we didn't. To be that mad cause someone didn't play $1.25 per hand the last time they were in there?  Wow...and oh, one last thing. He tried to involve the other bartender by yelling \"Such and such, doesn't he always bring his cheap ass in here and do this?\"  Well, the bartender who knows us and is always friendly wouldn't even answer. He just looked over and you could tell he wanted no parts of this behavior. Anyway, of course, I will never set foot in that place ever again and I'll be sure to let all of my friends and family about this. Why spend your money at a place where employees are allowed to behave in such a way?  As far as battery charges.I don't know. I'm still seriously considering it.  I don't take too kindly to being assaulted by doors."
        }, 
        {
            "index": 66, 
            "rating": 5, 
            "review": "You get exactly what you would expect and MORE! Super friendly service in a hole in the wall bar with the best pizza and strombolis EVER seriously worth the hype! Yum yum yum yum!"
        }, 
        {
            "index": 67, 
            "rating": 3, 
            "review": "Four Kegs is a complete dive bar with a separate restaurant area.  This place has character!  The stromboli is amazing here and the service is warm and friendly.\n\nThe stromboli dough is on par with the best I've had anywhere.  Inside you'll find tasty, fresh cheese, delicious marinara, and good ham and sausage.  \n\nNOTE: If two of you are getting a boli then be sure to save $ and split a large instead of getting two smalls (you'll end up with the same amount of stromboli).  \n\nAnd please say hi to Noriko, she usually serves us and she is the nicest little Japanese lady you can imagine."
        }, 
        {
            "index": 68, 
            "rating": 5, 
            "review": "Guy Fieri did not steer me wrong!  The atmosphere is exactly what you'd expect from a bar, but the food surpassed all expectations.  The pizza is amazing, and the stromboli is perfection.  Unlike a lot of people on here, I didn't have to wait more than 10-15 minutes to get my food, so no complaints there.  Will definitely go back next time in Vegas."
        }, 
        {
            "index": 69, 
            "rating": 5, 
            "review": "As a person from the east coast I feel I can say this is amazing pizza and Stromboli it most def did not disappoint. The bartender was amazing and the company was great. This is an amazing after hours bar"
        }, 
        {
            "index": 70, 
            "rating": 5, 
            "review": "We watched this place on triple D and let me tell you, the food is great for bar food. We had the Fried mac and cheese and the best stromboli you have ever had! They also have great specials, like half price 'boli during football games, 5 of us went in to watch a Cowboys game, each drank 8 beers(at $2.25), so 40 beers total, then we ordered 3 'boli's and 2 orders of wings and the bill was like $130 for all that(gratuity included). The service was great and this place is a great place to watch sports in a laid back atmosphe!"
        }, 
        {
            "index": 71, 
            "rating": 2, 
            "review": "Went because of Guy's show DDD and these ratings...  it was fun but NOTHING outstanding that 4 or 5 stars should indicate.  Good Service locally owned BAR with bar food. MUCH BETTER places to eat in Vegus  so spend your time at those."
        }, 
        {
            "index": 72, 
            "rating": 5, 
            "review": "While in Vegas we wanted to try something different not on the strip.  We looked up restaurants from the Food Network's Diners, Drive-Ins and Dives.  They are known for their strombolies.  I have to say this was one of the best stromboli's I have had.  It wasn't so much the ingredients, but the taste of the dough. The dough was really tasty and soft.  Love it and would definatley recommend it to anyone that wants good food for a CHEAP price!\n\nFriends had the wings and said they were very good as well!"
        }, 
        {
            "index": 73, 
            "rating": 5, 
            "review": "BEST STOMBOLI OF MY LIFE!!! Went because I'm a fan of Diners, Drive-ins And Dives.  It is truly a dive bar.  Went on a Tuesday to avoid weekend crowds.  Saw the Stromboli on tv and thought I'd give it a try.  I'm Italian and have eaten a few in my day.  Was in Vegas for a conference.  BEST STROMBOLI OF MY LIFE! I got the meatball and hubby got beef& cheddar.  Prefer the meatball but the crust!! OMG!  flaky, buttery even.  Sauce good and meatballs was homemade and fluffy, as if out of my grandmother's kitchen.  Glad we found it."
        }, 
        {
            "index": 74, 
            "rating": 3, 
            "review": "Yeah, yeah, I went there because of the tv show.  The place would fit in the \"dive\" category.   I went there at lunch time on a Monday.  The bar area is very smokey and unpleasant.  Luckily you are just in there for a second before you head into the restaurant.  The restaurant is dark and nicely ac'd.  Actually it's kind of cold in there.  There was a nice older lady working there and she was very pleasant.  She didn't got our order right and she was the only one working.  I ordered the stromboli.   It was loaded with cheese and the dough was crunchy but had a texture of good bread.  I would like it slightly less cheasy but that's personal prefference.  The sauce had good flavor and it's huge.  I ordered the large and I'll definitely get two meals and I'm a big eater.   I would stick with stromboli.  My friend ordered the club sandwich and it was not what I expected.  The bread was good but the ham was not the best.  I would give it a four if you stick with the stromboli and value for dollar.  I'll try some other stuff and re-review."
        }, 
        {
            "index": 75, 
            "rating": 5, 
            "review": "This is a little dive bar that has amazing pizza.  The best!!"
        }, 
        {
            "index": 76, 
            "rating": 4, 
            "review": "We walked in and it's this place divided into many sections. Bar to the left and sit down tables to the right. It took a few minutes to get our drinks which is normal. We ordered but our roommates food came before ours. We saw the waiter bringing our food after theirs, look down at my boyfriends plate then walk away. It's obvious that the kitchen made a mistake. It took 20 minutes for us to get our food. It wasn't that bad tbh. At least she made sure it was correct! She apologized many times and even comped us on some drinks! She was really great and helpful! I was mad but then I realized it wasn't her fault. The food was so good! The wings stayed crispy and the burger was amazing! Will come back!"
        }, 
        {
            "index": 77, 
            "rating": 4, 
            "review": "The best crispy naked chicken wings ever been going there for thirty years!! I must say the Caesar salad with grilled chicken is yummy!!! For those that like pizza with lots of cheese it's a must"
        }, 
        {
            "index": 78, 
            "rating": 2, 
            "review": "Okay, I love Guy Fieri's Diners, Drive-In's and Dives but this restaurant was a little disappointing to us.  This was definitely a dive and I don't care about that but an italian restaurant that uses canned mushrooms???????????  Thank God I didn't get the vegie \"boli\" and my sister in law did, I couldn't have handled that.  Our  original \"boli\" was okay; it didn't have a lot of meat but a lot of bread which had a great taste.  Not at all like E. Coast \"boli's\".  My niece (2 y.o.) got \"fried\" mac-n-cheese that was just Kraft.  Would I go back??  I don't think so!.  Sorry Guy."
        }, 
        {
            "index": 79, 
            "rating": 3, 
            "review": "Pros: ranch, bread dough recipe, marinara, alcohol prices, multiple flat screens for sports\nCons: turkey meat, atmosphere\nRecommend to friends and family: NO\n\nI heard about this place on the show Diners, Driveins, and Dives.  This establishment is definitely a DIVE and the food I tried was on par for that category.  My girlfriend and I ate at the bar (there is seating seperate from the bar with booths).  We asked the bartender what patrons ordered the most and what she recommended.  Which led is to try the turkey and swiss stromboli with a side of marinara sauce, macaroni and cheese potato wedges (came with a side of ranch) and the BBQ chicken tenders (came with 2 celery sticks and a side of ranch).  \nBest item to worst: ranch dressing, macaroni and cheese wedges, chicken tenders, and turkey swiss stromboli. \nStromboli: The stromboli bread was tasty, the swiss cheese good, but the turkey meat was horrible.  The turkey tasted like the cheap Budig sandwich meat.  The pizza bread dough and marinara was so good which leads me to believe that the Sicilian pizza would be a better choice or the original stromboli (I do not eat pork so that was a no go to try.)\nMacaroni and cheese potato wedges: palatable bar food\nChicken fingers: typical frozen flat style bar chicken tender.\nRanch and celery: the ranch was \"on point\" above average (better than Buffalo Wild Wings' ranch) and at least the celery was fresh.\nAtmosphere: We sat at the bar which was enclosed with glass partitions (smokey fish bowl) separate from the \"family friendly\" dining area and banquet room.  There is non gaming bar seating available and a separate area to the side of the bar for gaming customers.  The staff was  attentive and pleasant in typical dive bar fashion (By pleasant I mean authentic but not an over the top artificial attempt to be nice)\nHonestly, I would not recommend this bar to friends or family unless they happen to be on that side of town and want to watch a football game (Dallas Cowboy Fan Bar according to a decal on the bar mirror) or want a moderately priced drink for around $6 (grey goose and cranberry) The local dive bar that I frequent is Rum Runner.  In comparison it was on par.  Dive bars are described as an informal, unglamorous, bar for local residents to drink and decompress with the convenience of mediocre food.   This fits the bill.\n\n\n***Disclaimer: I went here on my low carb cheat day for a snack and had high dive bar food expectations since Guy Fieri reviewed this place."
        }, 
        {
            "index": 80, 
            "rating": 4, 
            "review": "Every once in awhile, someone's cooking will remind of me of back east authenticity and Four Kegs did just that! They make the Stromboli EVER! I'm talking about a legitimate Stromboli here, not just a bar food re-make. It was quite impressive."
        }, 
        {
            "index": 81, 
            "rating": 5, 
            "review": "I have only eaten inside here 1 time, but I order take out all the time. Their calzones are possibly the best thing i have ever eaten. They are perfect! Also, the service is pretty good, even for the hour that we went in"
        }, 
        {
            "index": 82, 
            "rating": 2, 
            "review": "Was ready to go spend my money on a bunch of wings and pizza but called and found out there not doing half off wings n pizza on wildcard sat ??? Guess our group  of 6 will just go spend it all at bww where there's nicer tvs and way less 2nd hand smoke ..... Till next yrs mon night games I guess ...."
        }, 
        {
            "index": 83, 
            "rating": 4, 
            "review": "The best Stromboli on the menu is the \"ORIGINAL\".   We tried three others and they all kinda tasted the same, but the ORIGINAL stood out in flavor and satisfaction. \n\nThe Deadzone Special is also another great incentive (1am-6am) half off!!!\n\nNow, I'm not quite sure what the fascination is with Strombolis.  To me, they are just folded over Pizzas, BUT for a folded over pizza Four Kegs does it right!\n\nThis is #2 on my quest to eat at all the Diners, Drive-ins, & Dives in America (or at least in So Cal)."
        }, 
        {
            "index": 84, 
            "rating": 4, 
            "review": "Decided to visit this place because I saw it on Diners Drive Inns and Dives. The Stromboli was big and tasty. The service was good. Nice place."
        }, 
        {
            "index": 85, 
            "rating": 5, 
            "review": "Come late at night/early morning when you can meet the coolest bartender Justin, and happen to come across an old timer named John......Justin is informative of the menu, makes you feel at home, and just nice as hell! The food is super good (we had the fish minus the chips) and a \"Boli\".......YUM!!!! But look for John, he has a story or two! Seriously going back just to see these two guys!"
        }, 
        {
            "index": 86, 
            "rating": 3, 
            "review": "Things I like: \n* There are no fucking yuppies here; \n* It is older than I am; and\n* Portion sizes are ridiculously preposterous (big).\n\nThings I do not like: \n- Ventilation. Or lack thereof. Smells smokey. (Maybe I am a yuppie); \n- Nickle and dime. A buck for marinara sauce? Fifty cents for ranch? I mean come on. The fucking stromboli costs 12.99$; can I get anything to wet it with besides ketchup that I won't be surprised with on the check; and\n- Dr. Guy Fieri's dumb hair.\n\nNow I am obviously no stromboli expert. If you are, educate me on how the fuck am I supposed to eat this thing sans marinara sauce. \n\nSo, instead of asking one what sauce one would like (none is offered free), the question is framed as such: \"Want any extra sauce.\" Emphasis being added by the waiter on the word: Extra. \n\nExtra means in addition to. At least that is what I think it means. (I am no English major, as you can tell.) So what the fuck is extra about it? Where is the fucking sauce inclusive with my purchases? I mean, if I am being asked for my preference for \"extra\" sauce and all. Do they mean extra than what is inside the stromboli? What the fuck is going on here?\n\nFuck, man. The rent is too damn high. This place is just \"A-OK.\" - E"
        }, 
        {
            "index": 87, 
            "rating": 5, 
            "review": "Excellent service from my favorite waitress Ashley Handley,she is there with our drinks before we sit down.thank you."
        }, 
        {
            "index": 88, 
            "rating": 3, 
            "review": "For starters, the original Stromboli is awesome. But, do yourself a favor and order it to go. \nI love a good dive bar, but this is pushing it. The 3 decade old carpet saves all of the years past odors. We were served but an absolutely charming older Asian woman. We loved her. But as the place got busier, the charm level fell. Took a good 10 min to pick up my card to pay the bill. That's really one of my biggest pet peeves while dining. \nAnd the beer selection....I get it, it's a hole in the wall. But can you at least carry Sierra Nevada? Heineken is never an acceptable \"good\" beer option. \nThe food is great though. Too bad they share any association with Guy Fieri. That dude is beyond irritating."
        }, 
        {
            "index": 89, 
            "rating": 4, 
            "review": "Shaddy dive of a bar but the stromboli is good.  Order a stromboli with a side of marinara sauce and you're all good.  The large stromboli is huge. It's definitely enough for two normal size eaters to share. I have no idea how anything else taste here so the 4 stars are strictly for the stromboli alone."
        }, 
        {
            "index": 90, 
            "rating": 4, 
            "review": "I wanted to swing by Four-Kegs after watching the episode on Diners, Drive-Ins and Dives.  I finally had my chance to visit Four-Kegs as I went to Las Vegas on a business trip.  I think they are open 24 hours, but I'm not positive.\nI GPS'ed my way to this hole in the wall dive bar settled in the corner of a shopping center.  The front part is a old school bar and in the back there is the restaurant.  \nI was greeted by a really nice waitress and the owner Mario, who chatted to me about the filming of his restaurant on Triple D. \nTime for the food.  I had to order the large original Stromboli, since that was what they are famous for.   Yumm it was good.  The crust was crunchy and the inside cheese, sauce, pepperoni and sausage hit the spot.  The large was huge!   I'll be back."
        }, 
        {
            "index": 91, 
            "rating": 5, 
            "review": "This place is awesome.  Do not be afraid of the neighborhood or the outside appearance.  Actually, dont be afraid of the inside.  This place rocks.  We go to Vegas every year for a fantasy football draft.  We always try to find out of the way \"gems\" and saw The Four Kegs on Diners, Drive-In's, and Dives.  This was a real find.  Stromboli was amazing, wings were excellent, in fact all 21 people that we brought loved their food.  Service was as attentive as possible with 2 servers constantly making us feel at home.  Now check this out, 21 people,  some drinking beer, all big eaters and the bill was 218.00.  The best value ive ever had in Vegas.  The owner is Mario and is as geuine as nice guy as you can find.  Thanks for a great time and we will be back."
        }, 
        {
            "index": 92, 
            "rating": 2, 
            "review": "First off, this place gave me food poisoning, and it was the type of food poisoning that makes you uncomfortable while still at the restaurant and almost makes you pull over on the road to vomit as you drive away.  So anything said about this place will be tainted by that fact.\n\nIt's a sports bar and it's most definitely a dive bar.  I like sports bars and I like dive bars, so it would stand to reason I would like this place.  Nope, not even remotely.  \n\nI will give kudos to the service as the server was really attentive and gave out recommendations.  Though the constant reference to \"Diners, Drive-Ins, and Dives\" was kind of annoying.  Also, kudos for having the Cowboys' game on the TV (this was preseason football 2011) for me as the lonely Cowboys' fan.  \n\nThe food... Hmm... Eh... Bleck. I recall having a pepperoni and mushroom pizza that was mostly grease and dough.  I then recall getting sick, and I've already elaborated on that."
        }, 
        {
            "index": 93, 
            "rating": 4, 
            "review": "I haven't seen the episode of Diners Drive Ins and Dives featuring Four Kegs, but I would love to.  This place has great bar food, not to mention some of the best pizza I have ever had!  I haven't tried the Stromboli, but I definitely will the next time I am in there.  I can't say the service is the best every day, but definitely not the worst, and the food is worth it.\n\nIt is true that the bartender will not, and legally can't take your order.  Nevada passed a ban on smoking in places that serve food.  Some of the more popular bars in town have had to figure out ways to still serve their loyal patrons food, while having a smoker friendly bar environment."
        }, 
        {
            "index": 94, 
            "rating": 5, 
            "review": "Best Stromboli in all the land!  Found this place after I saw it on Diners, Drive-Ins, and Dives and it's now become a favorite for the hubby and I. Four Kegs is definitely a dive but don't judge a book by it's cover as the old adage goes - this Vegas local secret is to die for.  The Original Stromboli with on tap Shiner gets five stars every time for me.  Guy Fieri never should have let this secret out...but then again I might not have ever found it.  A must go when you're in Vegas...local or not."
        }, 
        {
            "index": 95, 
            "rating": 4, 
            "review": "Pizza and stromboli are some of the best in town. Bar staff is very friendly and the draft beer is usually on sale. The back of the bar (the restaurant section) is blocked off by glass and is smoke free. Nothing fancy but a great place for pizza and a beer. If you want to avoid the crowds during football season this is your place."
        }, 
        {
            "index": 96, 
            "rating": 4, 
            "review": "This place is great....separated from smoking, big screen TV for football, okay wings and great service"
        }, 
        {
            "index": 97, 
            "rating": 5, 
            "review": "Unique- is the right word for 4 Kegs - the menu on the wall makes you feel like a drive through - everything after that changes your impression - Fantastic food - Stromboli to die for and the Wings r even better -Top it off a killer Cheese Cake - it's the Staff that makes it all happen - A GREAT PLACE"
        }, 
        {
            "index": 98, 
            "rating": 4, 
            "review": "I know this is a bit off of the Strip, but you know, it's only a little further than the Premium Outlets North, so it's doable. We came for the stromboli and it's almost a tradition now to order a couple of larges and bring them back home to California to enjoy the following week. The portion is HUGE and it's freaking awesome. What's good to order? We've tried the BC Boli - Beef & Cheddar, Turkey & Swiss Boli, and the Meatball Boli so far. You can't go wrong with any of those choices."
        }, 
        {
            "index": 99, 
            "rating": 1, 
            "review": "We saw this place on the Food Network and went there because \"Guy\" said the stromboli was great!  Well, I can't say that we had the same opinion.  The place is greasy and gross and the smoke comes through the walls from the bar area.  The stromboli was just not good."
        }, 
        {
            "index": 100, 
            "rating": 1, 
            "review": "I was told this place had the best pizza. First of all, that was not true. The pizzas dough was very soggy and under cooked. They used canned mushrooms, which are gross. The wings had little to almost no sauce. The service took a while, but she worked very hard to accommodate our party. I would never eat here again. I'm not sure why people love it so much. The area is less than desirable. The decor and condition on the interior is dated."
        }, 
        {
            "index": 101, 
            "rating": 5, 
            "review": "Holy Macaroni Wedges, Batman. Don't be dissuaded by the front bar area. The back is super cozy and the yums are the perfect comfort food. \n\nBut, the BEST part of the night, hands down, was our fabulous server, Ashley. Great recommendations. Wonderful personality. Let's just say Ashley is the bomb dot com. We will be back to see her soon."
        }, 
        {
            "index": 102, 
            "rating": 4, 
            "review": "This review is for 4.5 stars. I would classify this place as really good bar food (I used to think PT's was good bar food, now it's just OK). Some people would call this a dive bar (it's a little dated, but isn't that part of the charm?), others would call this a locals place (like Cheers), and others might call this a sports bar/video poker bar (front smoky part). It might be all of these things, but what matters most here is the food. \n\nMy husband said he ate here 10 years ago and that it was really good. I looked this up here, and saw that Guy Fieri had this place featured on his show DDD- LOVE, LOVE, LOVE, that show! After checking out the menu and seeing the reviews (STROMBOLI was mentioned many, many times), but having questions, I had almost made up my mind (hee hee).\n\nAfter passing up the smoking section (the bar part) and entering the Dining Room (there are 2 parts, the bathroom is in between both parts, in the hallway, next to the big red sign reading \"DINING ROOM\"), we chose a table, except the table was reserved at 6:30, so we moved against the wall, with the trophies- there were a ton of them. Looked like there were several other groups here, and a party was taking place. There was a cake and other supplies set up underneath the TV, which had sports on. \n\nWe all ordered different items. My husband ordered the medium square pepperoni pizza, I ordered the chicken philly with mushrooms, onions, and peppers, came with steak fries, my husband's uncle ordered the steak sandwich came with steak fries, one friend ordered the chicken wings, but she didn't want fries, one friend ordered the original stromboli (this is what I wanted to order, but this one had assorted meats and I'm sure the sodium content is extremely high. WIsh they had a ham and cheese one alone). The bill was a little over $55, so the prices were reasonable. (We mostly had soft drinks and one friend had a couple beers.) \n\nI've been craving (I'm pregnant) a really good sandwich lately, and this chicken philly was extremely satisfying. The chicken pieces (good quality) were seasoned, the cheese was melted- ooey and gooey (yum), the fixings made it a good sized sub sandwich. I only ate half because it was very filling- it was stuffed! Everyone said that my philly looked good, and I admit it was one of the best philly's I've ever had. The steak fries were ok, weren't crispy (I love crispy skin-on fries), but weren't greasy, either. I'm not too crazy about thick steak fries, probably my least favorite. What I ate, I peppered and ate with ketchup, but I had alot left over (seems like lots of restaurants give a ton of fries these days). \n\nMy husband's pizza was pretty big for an individual sized pizza, and the crust was kinda on the thick side (I prefer thin), but it looked good. I don't like pepperoni and being pregnant, I'm not supposed to have too many things with nitrates, anyway. I had a small bite of the corner of the slice, which had cheese- it was good. Because it's thick, I probably would've only eaten two slices of it. He only orders the pizza when he comes here (took some slices home). My husband's uncle's steak sandwich looked good, too, and he wasn't talking much, so I think he enjoyed it. The friend who ordered the wings, said that she only orders this whenever she comes here, and she's been coming here since she was a little girl, with her family (she also said that it looks the same just like it always did). The friend who ordered the stromboli (the 4 pc. order), said that it was good, but could've been more seasoned with herbs, and that the marinara sauce could've been warmed, it was cold. She finished it, though. She also said she'd order the chicken philly next time.\n\nThe service was pretty good- our server was nice and attentive. The server checked on us several times and offered us refills and brought us boxes, too. \n\nWould I come here again? Heck ya! It's all about the food. Sometimes, ambiance doesn't matter, because the whole point of going out, is dining (the food, baby). I've always found that casual places are more laidback. Inexpensive really good bar food- you can't lose here. If you're a local, try it, you'll like it. If you're a tourist, come here, because it was on DDD (we found some really good places from watching the show) and then realize you'll come again the next time you are in Vegas."
        }, 
        {
            "index": 103, 
            "rating": 5, 
            "review": "Well, the other reviews were correct.  Everyone else in the party tried the stromboli.  Had to mix it up and try the Western Burger.  Excellent.  That is the one word needed to describe it!!!   Coleslaw was amazing as well!!!  We will be back!!!"
        }, 
        {
            "index": 104, 
            "rating": 5, 
            "review": "I was in vegas for work this week and knew about 4 Kegs and decided to take my brother and a buddy with me...lucky for us we have good friends in town and they made a call to the owner Mario and let him know we were coming.  We showed up not really knowing what to expect and were greeted with a small bar where everybody knew eachother.  there were 3 stools open and we sat down.  Rich the bartender immediately greeted us and asked what we wanted.  we had 3 ice cold(and i mean ice cold!) coors lights within seconds.  we told him we had a reservation at 7 and he asked if i was Bryan.  i said yes and he said he'd just serve us at the bar.  2 hoops games on tv, ice cold coors lights and the recommendations of Rich for food was what was on tap for the next couple hours.  along with our 30 ice cold coors lights we crushed lumpias(a fillipino combo of an eggroll and taquito), wings and of course 2 original and 1 beef n cheddar stromboli and an epic pizza with everything on it.  the food was awesome.  the Stromboli was incredible.  good enough for us to ask if they could make a couple to go.  i took it home the 5 hour drive the next day to LA and rebaked it for my wife and kid and it was just like being back at the 4K.  \n\nWhat an experience!  I will be back everytime i go to vegas.  Rich, Marilynn, Mario....THANKS FOR THE GREAT TIME!  \n\nBryan, John and Rob"
        }, 
        {
            "index": 105, 
            "rating": 4, 
            "review": "This place was featured on Diners, drive-Ins, & Dives and Guy is not wrong about this place! The Stromboli is very good, and the sucker is huge! Bring someone to share it with you!  And if you're looking for a place to eat after midnight the Stromboli is half price!"
        }, 
        {
            "index": 106, 
            "rating": 5, 
            "review": "This place is the best.  Great food and cold beer at reasonable prices. Try the Stromboli!  Just a great place."
        }, 
        {
            "index": 107, 
            "rating": 3, 
            "review": "i ain't gonna lie, even though the blowhard sold out ( TGIF ) i still like Guy \" in it to win it / bananas/ blah blah blah \" fieri , especially his Diners, Drive-in's and Dive's show.\n\nSo i finally hit his vegas college hang, 4-Kegs to try the stromboli.  This place is definitely a hole-in-the-wall.  the dining area definitely needs a tune-up but it's all about the food !\n\nShared an order of buffalo sliders ( thought it would be buffalo style chicken - nope, it was actual buffalo meat ) - $4.50 and a small meatball stromboli - $7.99\n\nthe sliders - the meat was decent with some grilled onion - some damn cheap-o american cheese slapped on top and i don't like that they put it on a french roll then cut up into 3 pieces - not very slider-like to me.\n\nthe stromboli - not bad.  it's pretty basic - coulda used a side of marinara for dipping.  the crust was good.\n\nwould i go out of my way to return - no  in the area and hungry - yes."
        }, 
        {
            "index": 108, 
            "rating": 5, 
            "review": "We were regulars at the Four Kegs on Maryland Parkway for years until they closed down.  Now we drive across town to this location.  Their Stromboli and Cajun fries are to die for.  Hands down the best boli we have ever had.  Team that up with frosty mugs of your favorite beer and walaaa, Great Times.\nNow the location isn't the safest in town but just don't hang outside of this place.\nIf you haven't tried Four Kegs you're definitely missing out !!"
        }, 
        {
            "index": 109, 
            "rating": 5, 
            "review": "Pizza and bolli are awesome ice cold beer and friendly service always a high point to my day."
        }, 
        {
            "index": 110, 
            "rating": 2, 
            "review": "The food is great.  The Philly cheesesteak is awesome.  That's about it.  The place reeks of smoke, nauseating in fact.  Absolutely no ventilation.  The bartender is obviously on something.  The other night we stopped in and she was stumbling around behind the bar and couldn't even put a sentence together.  Kind of sad.  A middle aged woman who is obviously high or drunk (or both) should not be handling drinks and serving food.   She spent more time smoking and texting than she did serving.  Great tip, get your grub to go and avoid the circus behind the bar.  Food is a 5.  Atmosphere is a 1.  Bartender is less than zero."
        }, 
        {
            "index": 111, 
            "rating": 5, 
            "review": "A little late writing the review, but we were on vacation...and in vacation mode.\nWe were there on Sunday, May 29th, late afternoon.\nWe were early for dinner (or late for lunch) so the place only had a couple of people in the restaurant section.  Service was friendly and prompt.  We placed our drink order and got those right away, then placed our dinner order;  we had the original Stromboli and the fully loaded pizza.  As we were ordering, our server also told us that we got 1/2 off the pizza because the Nascar race had just come on...excellent!  Food came out in a timely manner...relative to what we ordered.  The Stromboli was excellent, and the pizza was very good also.  Their crust is very good...I'll assume it's the same for both items.  Stromboli was filled with just the right amount of ingredients...not too few, not so many that it's overwhelming.  We have been to a few Triple D places but kept missing this one in Vegas, but we're very happy we finally got there!."
        }, 
        {
            "index": 112, 
            "rating": 1, 
            "review": "Went here because Guy said it was good. Big MISTAKE!\n\nHere's what we had:\n\n$1.75 dinner salad - all wet half head iceberg ($.50 extra for ranch)\n$12.99 steak and shrimp - massacred new york steak, ordered medium, came out rare and was still dry. Sent it back and they microwaved it to well done. Beer battered shrimp. Everything tasteless.\n$15.99 large pizza - pretty good, nice sauce, good amount of toppings, overall acceptable.\n$7.99 chicken wings - basic order wings, hot sauce, ranch. Okay.\n$16.99 bbq ribs - sold as hickory smoked but there was nothing smoked about them (unless the cigarette smoking line cook counts?) They're baked and slathered with salty sauce. Side of cajun fries, not what you think, fries coated in hot sauce, huh? Weird thought, tastes yuck. \n$3.99 kids grilled cheese and fries - better than the steak. \n\nNow, you walk into this place in a desolate area of north vegas, about fifteen minutes on freeway from strip, and the smell of old grease is over powering. The place reminded me of county jail with glass walls separating the \"dining room\" from the bar. You would think with all the good publicity from Guy that they would have made some improvements, but, no. \n\nI wouldn't eat here again\n\nThink nostalgia went more into the triple d pick than the food."
        }, 
        {
            "index": 113, 
            "rating": 5, 
            "review": "Ok, been back twice now and ordered their traditional Stromboli during my second visit. The Stromboli would be the perfect child if pizza and calzones had a baby. The Stromboli is not very greasy nor is the breaking heavy. Every single bite was dreamy. I also had a taste of my friend's Philly cheesesteak and AGAIN amazing! I love this place!!!"
        }, 
        {
            "index": 114, 
            "rating": 5, 
            "review": "Dive bar, sports, good beer and GREAT food.\nAfter seeing all the food network shows- we decided to stop in!\nAwesome selection of beer, great environment... no guys this isn't a spot for date night unless both of you like coming to dives.  \nThe stromboli... I could have eaten another one!\n\nHands down, cheesy, meaty, crispy, yummy goodness!"
        }, 
        {
            "index": 115, 
            "rating": 5, 
            "review": "So there isn't anything \"magical\" about this place.. however, I can't find anything to fault it on! Atmosphere.. ok, dingy, but hell this is a dive! Service was AMAZING.. very friendly and very prompt.. can't say enough on that. Also, from watching the other 2 waitresses in action it appears all the waitstaff here is friendly and prompt..\n\nOk, now on to to the food. We tried the fried mac and cheese, mini corndogs, and of course the original stromboli. Fried mac and cheese... very very good. I've had this dish in chicago many times, but this is the best one I've had. It's fried in egg batter rather than just breaded, and the pieces are small and manageable. Mini corndogs.. well they were just mini corndogs. Stromboli was so good! I'd also like to add that they make these from Scatch so you can add/take out things to your hearts desire. \n\nLastly... the price... amazingly cold draft Coors light set us back $2 each (on a Saturday nigh no less), and 4 beers + our food came up to only $28 with tax.. not bad at all. \n\nIt is just bar food, but it's bar food done right! Great service, prices, and quality will make me a regular here!"
        }, 
        {
            "index": 116, 
            "rating": 5, 
            "review": "This place was another location I had to see and taste to believe! Amazing Strombolis! Period!"
        }, 
        {
            "index": 117, 
            "rating": 4, 
            "review": "I have been going to this hole in the wall for years. The are is a little on the questionable side but the food here is worth it. We had an older lady serving us, reminded me of my Granny. We had the Stromboli and fried mushrooms. The mushrooms weren't really anything spectacular, but the Stromboli was nothing short of amazing. I will brave the smoke filled bar to get to this gem any day."
        }, 
        {
            "index": 118, 
            "rating": 4, 
            "review": "OK.\n\nI finally got back here during the day for lunch.\n\nThe restaurant isn't the nicest and neither is the daytime clientele.\n\nHowever, I must say the stromboli is solid.  Four star solid.\n\nMy earlier review still holds...don't come here during the graveyard shift.  \n\nJust don't."
        }, 
        {
            "index": 119, 
            "rating": 4, 
            "review": "Meatball stromboli! Best in Vegas! In addition $5 Jack and Cokes need i say more. More of a bar than restaurant but seating is available\n\nEDITED: Stromboli just not the same."
        }, 
        {
            "index": 120, 
            "rating": 5, 
            "review": "I have eaten at this dive\n\nCan't beat the NFl specials 1/2 price Pizza's and wings during all Sunday and Monday NFL games.  Draft Beer $2.75-$3.25 Ice cold and delicious."
        }, 
        {
            "index": 121, 
            "rating": 5, 
            "review": "YOU MUST EAT HERE!  You will leave stuffed and ready for hanging!  lol  The food is AWESOME, and the service is excellent.   Some describe the interior as a \"dive\", but that's not the impression I got--it's not lap of luxury, but it's clean, and the environment is friendly.\n\nPlus, unlike how the Strip rapes your wallet, the prices here are great.  This is easily one of the best values in all of Las Vegas!"
        }, 
        {
            "index": 122, 
            "rating": 4, 
            "review": "Usually pull in here for a few drinks with an old friend, service was good at the bar. Recently took the family in to the dining area, they loved it great food, and waitress was very good!"
        }, 
        {
            "index": 123, 
            "rating": 2, 
            "review": "We came here on an eating mission. I had seen this place on Triple D years ago, and it was finally time that we gave it a try, and when we give a place a try, we order quite a bit. \n\nFirst, we ordered the cajun fries and the mac and cheese bites. Both of these were the highlights to my evening. The mac and cheese bites could be bigger, so they are less greasy overall, but I enjoyed how piping hot and melty the cheese was. The cajun fries are just fries tossed in buffalo sauce. I love buffalo sauce, so this is a win for me, but it should probably be more aptly named. \n\nOn to the entrees: we then ordered a meatball stromboli, and original stromboli, a pepperoni pizza, and an order of chicken fingers with fries. The chicken fingers were typical frozen chicken. I would not order these. The strombolis and pizza were okay. I did not like the sauce. It was like a canned tomato with some sweetness. It needed herbs and spices and less sugar. The doughs are good, but the sauce needs some serious work.\n\nOverall, I won't be back."
        }, 
        {
            "index": 124, 
            "rating": 5, 
            "review": "WOW...so glad I found this place and thanks to Yelp! \n\nUpon the review of good comments from fellow Yelpers, me and the fiancé wanted to try something new, and decided on this place. After finding our way to the back thru the odd layout of the place, we ordered the original Stromboli, hot wings, and a couple Shiner Bocks...Everything was on point! \n\nThe Stromboli was amazing! I have been trying to find a place that could compare to a home fav, and this is it! Accompanied by extra sauce to \"dunk\" with, and the extra cold beers made it better.\n\nThe wings were good, but their sauce just taste like the bottled stuff you get at the store, no additions. \n\nService was good and the waitress was on top of our drinks, which is a big plus in my book.\n\nOverall, we plan on being back within the next couple weeks : )"
        }, 
        {
            "index": 125, 
            "rating": 1, 
            "review": "This was my first time being misled by a Yelp rating.\n\nLook. I know how local bars outside of the Strip are , but this is ridiculous. Four Kegs gives you the impression someone stopped caring about the business 35 years ago. Robert Irvine would flip out.\n\nPrimo, I'm not a fan of carpets where you serve food. They make a joint have a murky smell, especially if you have a typical deep-fried menu. \nSecundo, the place is cramped and feels smaller because it's very strangely divided. And tertio, I didn't know where to look! The kitsch carpet pattern, the overly decorated walls, the 60s PepsiCo lit menu boards or the giant screen tv's?\n\nI ordered a Tom Collins and my hubby a Killian's on draft. It wasn't bad, but very basic. The Killian's came in a chilled glass, but it was a strange half-wine, half beer-mug type, which made no sense.\n\nWhile on my way to the bathroom, I did notice a Guy Fieri autograph. After taking a closer look, I saw this place was actually on his show, \"Diners, Drive-Ins and Dives\". I wish I had seen that episode, as I would have remembered to not go there.\n\nIt's no surprise I won't be back at the Four Kegs Sports Bar, nor will I ever recommend it. However, may people know why I give it one star: I hope no one ever makes the mistake I did while looking it over on Yelp as a 4-star."
        }, 
        {
            "index": 126, 
            "rating": 4, 
            "review": "Restaurant rating is a 3. \n\nAs for it's dive bar rating, it's a solid 5. Hence the overall 4 rating. Ice cold schooners of beer on tap for $2.25, if you can get a seat at the bar. Almost got in a fist fight there arguing the merits of my favorite American Idol contestant one night. Another time a chick drunk-dialed everyone she knew in her addrress book and then fainted. Enjoyed a few free coldies while the paramedics revived her....  Cigarette stench is quite strong, and the assorted collection of waitstaff and bartenders is straight out of a sitcom. Watch for derelicts coming out of the laundromat next store looking for change on the bar.\n\nAs for the famous stromboli- skip it and get the deep dish pizza instead. Guy Fiore doesn't know shit."
        }, 
        {
            "index": 127, 
            "rating": 4, 
            "review": "Stromboli half price during NASCAR and football! Cheap booze and friendly atmosphere of locals! What else is there?  Was also featured on diners drive ins and dives"
        }, 
        {
            "index": 128, 
            "rating": 4, 
            "review": "The Stromboli is great but there is some truth the to complaints about the quantity of the fillings. I'm from just outside of Philly, and their cheese steak is way legit. I probably prefer the cheese steak to the 'boli.\n\nI had a Reuben there, a new offering for Four Kegs, and it was great as well.\n\nSuper cold draft beer in chilled goblets is a big plus, and the servers are genuine, down to earth, friendly and competent.\n\nAll in all, a great place to eat and drink casually and inexpensively."
        }, 
        {
            "index": 129, 
            "rating": 4, 
            "review": "Eat here it's really good!!! \nOur server Mary Beth was so nice to us. \n\nI was hungry that's how  I got  past the fear of being assaulted/robbed/killed in the parking lot and went in. With over 200 reviews, starving and risking our lives to walk in here I had to try it. \n\nMary Elizabeth greeted us ( our server) she's nice. It's very bright in here (I prefer dark dingy seedy dive bars) and it STINKS like cigarettes.... Gross kinda want to leave but, we r hungry. I started reading the reviews. I changed my order from a meatball sub to the meatball boli... (Ty yelpers for your tips) it was soo freaking good. Also ordered wings. They  are good & I know my wings I grew up in a pizza joint. \n\nMy daughter and I ate it all. Don't judge me... There aren't a lot of places to eat after 10p.  The dining room is separated  by glass. Every time they open the door the cigarette smell is thick. I quit smoking a lil over a year ago. If it bothers you take it to go. I probably will next time too. It's a weird set up but, I don't care. I'll eat here again...During the day when 3 weird guys aren't standing in front if the door LOL and I'll take it to go.  It really smells bad. I have worked in casinos 15 years it's not this bad. \nBesides that it all good."
        }, 
        {
            "index": 130, 
            "rating": 5, 
            "review": "5 STARS for sure!!\n\nIf you are in vegas and have a car, this place is worth the drive. This was actually a food network find... the pizza, stromboli, and calzone, absolutely to die for!!!  And cheap!! \n\nTook my friends here when we were craving pizza, i was alittle unsure since i had never been there, but i took the chance. We pulled up and i was kinda nervous, i dont like being the one that reccomends a bad restaurant. THe parking lot was pretty empty the place looked run down... but i was positive... And foodnetwork did not let me down!! My friends and i could not stop talking about how good and cheap the food was!!  \n\nDefinitely reccomend to make the short drive, bout 10 minutes from the strip right off the freeway!"
        }, 
        {
            "index": 131, 
            "rating": 4, 
            "review": "Read the reviews. Watched the Triple D episode and finally got the opportunity to come here.  I was not dissapointed.  The Stromboli was as good as promised with the crispiest crust I have ever had on a stromboli.  The Meatballs inside were light and fluffy and plentiful.   The fried mac and cheese was the best ever. Small bite sized pieces allow you to indulge in a guilty pleasure without totally destroying your diet.  With sports everywhere, this place gets my seal of approval.  However, the smoky bar area and the smallish drinks were the only drawbacks.  The wait staff was very attentive and chatty making the customers feel at home.\n\nTry it. It is worth the trip."
        }, 
        {
            "index": 132, 
            "rating": 5, 
            "review": "I saw this place on diners drive-ins and dives so I went to see what it's all about. On the show, they were showcasing what the place is known for. Strombolis! It was this massive looking piece of dough stuffed with pizza toppings. I ordered the Stromboli and when it came out my jaw hit the table! This thing was huge! 4lbs! It had sausage and pepperoni and mozzarella. But what set this Stromboli aside from others that I have tried, was the dough! This Stromboli crust was damn good! It was flaky and buttery and crisp! You bite into it and you have that little crunch from the outside but then the inside is moist and flaky! I'm not even talking about the filling part yet! I'm just so in love with this crust! But with everything together it made for the best Stromboli I ever ate...highly recommend you give it a try"
        }, 
        {
            "index": 133, 
            "rating": 5, 
            "review": "Awesome place, a must stop while I am in Vegas.  The star is the Stromboli, had it many times and it is always good.  Tried something new this time, a Sicilian style pizza, good but I will stick with the Stromboli.  Mac and cheese bites were tasty appetizer that I would recommend to others."
        }, 
        {
            "index": 134, 
            "rating": 5, 
            "review": "OMG, THIS PLACE IS amazing. I'm super happy with my services and the server is really nice. My food looks amazing, the little corner dogs on POINT.!!!!!!\nI'm coming back here next week. Leana (hopefully I spelled it right) she is just wonderful. Always on top of what we order, very specific, honest, and professional. \nThe energy in this place became a chill spot and fun, loved their candy machine; felt like a child again."
        }, 
        {
            "index": 135, 
            "rating": 5, 
            "review": "The best philly in town in my opinion.  I wish I could say something about another dish, but I only ever get the philly.  Service is always really good. Awesome atmosphere. I love coming here!"
        }, 
        {
            "index": 136, 
            "rating": 5, 
            "review": "This is one of my favorite dive bars in town. They have a limited selection of draft beers , hints the name, yet their service and food makes up for it."
        }, 
        {
            "index": 137, 
            "rating": 4, 
            "review": "Ordered the original Stromboli not too bad...boyfriend got the meatball which was amazing! We also got mozzarella sticks that were cold and a dinner salad that was not impressive with white iceberg lettuce...I wanted some greens!! Our waitress wasn't very friendly but the Stromboli was good enough we would go back."
        }, 
        {
            "index": 138, 
            "rating": 5, 
            "review": "One of my favorite spots to eat in Vegas. Usually get the pizza or philly cheesesteak, and I have yet to be disappointed. Been going here for 7-ish years now. Kind of run down, but it's a good laid back atmosphere that my family and I love."
        }, 
        {
            "index": 139, 
            "rating": 3, 
            "review": "Ok.  Not the greatest...but good food at a decent price.  I did a carry out but everyone was super friendly.  The place was packed and it is definitely a dive bar.  I wouldn't tell anyone to go out of their way to check it out, but i myself would go back.\n\nSidenote: \"Cajun fries\"  = buffalo sauce on fries with blue cheese on the side.  I don't really see why people think they are the best thing ever.  I was a little disappointed."
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "Best italian I've had in a long time"
        }, 
        {
            "index": 141, 
            "rating": 4, 
            "review": "Not bad. Went here because of the food network. It didn't WOW me, but its a good place to try."
        }, 
        {
            "index": 142, 
            "rating": 5, 
            "review": "late night cheap food and killians irish red in a goblet!"
        }, 
        {
            "index": 143, 
            "rating": 4, 
            "review": "So my sister recommended trying their stromboli since her classmates have said nothing but good things about it, plus Guy Fieri made the trip out there for his Diners, Drive-Ins, and Dives show. Turns out Mr. Fieri knew what was up with that place. \n\nLet me start off by saying that if you're trying to eat here and you think its close to the strip, you couldn't be more wrong haha. It's allllllll the way toward north Las Vegas out in the cuts. It's right off the freeway though, if that helps. If you can get past the appearance of the place, then you're good to go.\n\nWhen you walk in, its basically a small casino and bar with a few TVs blaring different sports games. Yep, total dive bar status. The dining area is in the back, and surprisingly the staff here are pretty nice. The dining room was close to empty, even though we showed up at 10 in the evening. My sister and I split a large classic stromboli while my cousin got the half turkey and swiss stromboli. It actually took awhile for our food to come out, but it was worth the damn wait. Something about the bread/crust made the stromboli delicious, beside the fact that the ham, cheese, pepperoni, and sausage made it good enough as is. Yeah, the bread was definitely what made the stromboli. Word of advice: ask for a side of ranch to go with your stromboli and you won't regret it. Well maybe you will because you may feel more gross afterwards, but the combination of those two are amazing. \n\nWorth the drive, worth the wait. Like I said, just try to get over the appearance of the place and it'll be fine."
        }, 
        {
            "index": 144, 
            "rating": 4, 
            "review": "Everyone is all caught up on the strombolis which are good don't get me wrong but I must say the Cajun fires is what brought me back to this place just get extra ranch and enjoy!"
        }, 
        {
            "index": 145, 
            "rating": 5, 
            "review": "Love, love, LOVE this place!!! From the Cajun fries to the pizza & the chicken fingers to their burgers..omg. everything is so good. And the staff is super friendly. My family and my friend always come here."
        }, 
        {
            "index": 146, 
            "rating": 5, 
            "review": "Found this hidden gem via other yelp reviews and it lived up to the expectations and more! The bolis are as delicious as promised and the lunch cheese steak special was a fantastic deal (Included a soad/tea and fries for about 7 bucks) . The dough on the bolis is just heaven. You can taste the homemade authenticity and care that goes into the preparation of each boli. Four Kegs is a bit of a dive, with only about ten tables but with food like this you will definitely want to venture away from the buffets and pricey fare of the Strip.\n\nEqually as amazing as the food was the cheery and friendly service we received from Kelly. She was sweet, knowledgeable,  helpful and fun! She made the experience even better by cracking jokes and just being relatable and friendly.  We left feeling like friends and definitely will be back next time we're visiting Vegas. I couldn't recommend this joint any more highly if you're looking for great food, reasonable prices, amazing service and a Cheers-like feeling in the heart of Sin City.  Kelly rocks!! Go visit her and enjoy some amazing food while you're at it! \n\nSide note: a lot of people have been confused by the directions/location. We saw a sign for Four Kegs near a vacant McDonald's building and were a bit confused at first but with just a quick spin around the parking lot we found it with no problems."
        }, 
        {
            "index": 147, 
            "rating": 3, 
            "review": "I've been coming here all of my life. My whole family has, in fact. I'm glad it's still around and it's just a great bar to have a drink or two. The food has had it's good moments. Not everyone is perfect. I say this because only once, because when we got home with our pizza and bolis, they were all bread and not enough sauce, chz and meat. Maybe the cook was busy, who knows? We have been back, several times after, and everything is, and has been, as expected. I enjoy the heck out of the ham and Swiss boli, the Cajun fries and a red beer. If I'm really hungry, hot wings are delicious an hit the spot. The meatball boli gets ordered, also. Guy Fiari aenjoys, since he's been back. That makes twice!"
        }, 
        {
            "index": 148, 
            "rating": 5, 
            "review": "the Stromboli is insane good true its a dive bar but staff is always super friendly and quick service. i will go there many more times!"
        }, 
        {
            "index": 149, 
            "rating": 4, 
            "review": "We've been going there when in Vegas ever since we saw them on Diners, Drive Ins and Dives. At first,  they were great. But,  the last 2 times, the pizza and stromboli were burnt. Nor enough to send back but enough to notice it. Still over all, it's good stuff."
        }, 
        {
            "index": 150, 
            "rating": 4, 
            "review": "Diners Drives and Dives did this place justice because it was everything i thought it was going to be. The stromboli was huge and tasty, just the way it looked. Get the meatball or original and save half or finish it if you can. The gf and I started out with the macaroni wedges and hot wings. I would suggest getting the macaroni wedges they are like odering chicken nuggets but with mac and cheese inside very good! Beer is only 250 on tap i mean for vegas yea!!!!!"
        }, 
        {
            "index": 151, 
            "rating": 4, 
            "review": "On my list of Dive Bars to visit when in Las Vegas . . . and so we stopped for a quick one before heading back to our hotel.  Best part . . . I drank for free . . . because I was playing video poker.\n\nNot a bad set-up . . . but will all the glass doors . . . you get a feeling that it is kind or small.  Though we did not eat any thing, the food smelled wonderful.\n\nI will most likely be back on another trip to try this place for lunch . . . only because when I am in Las Vegas . . . I like to dinner out at nicer restaurants . . . and this place has more of that homey atmosphere."
        }, 
        {
            "index": 152, 
            "rating": 5, 
            "review": "Best stromboli I ever ate!  The staff is very friendly and happy to have you there.  Everything we had was great!  The decor is a bit Dive-ish and outdated, but the food is fabulous.  Go!!!!  Your gonna love it too."
        }, 
        {
            "index": 153, 
            "rating": 2, 
            "review": "i am at a loss on why people like to come here.  First and foremost, patrons are required to walk through the bar which has cigarette smells that have been here for 40 years.  it is disgusting.  I've been there twice and there were several old worn out bar patrons that probably occupy a stool every day.  That is the biggest turnoff for me  Once behind the door to the small restaurant, it's quirky to say the lest.  The service was very good and friendly.  The food was good and arrived quickly. i had a patty melt and it was delicious and juicy and served on marble rye.   I am a loss to figure out whey when there are so may choices in LV for restaurant and folks would choose to go to Four Kegs.  This confirms that there is a lid for every pot an it takes all kinds of places to make the world happy.    I'd never chose to go here, but if a group wanted to go I would hold my nose to get into the restaurant and have some good food.  This is certainly not a place fork people who want to eat healthy."
        }, 
        {
            "index": 154, 
            "rating": 3, 
            "review": "3 stars with a caution.  don't order salads or anything fancy like that.  stick to the boli's and the pizza.  if you order a boli, ask that they use one of the old pans to cook it in.  i swear it makes a difference.  beer is cold. serivice is warm.  always a good thing."
        }, 
        {
            "index": 155, 
            "rating": 3, 
            "review": "After seeing it on Diner's Drive-In's and Dives, this place became a must try on my list of places to eat. My wife and I both had the Stromboli. Which was okay. I have had better. The marinara sauce however was awesome."
        }, 
        {
            "index": 156, 
            "rating": 3, 
            "review": "Went here because I saw this on diners drive-ins and dives and I have to say it was just okay. Not the best not the worst. I think it gets by mostly by reputation and being open all the time. Tried the calzones, the buffalo shrimp on many other dishes and didn't find any to be that remarkable or original. Worth a one-time experience just to say you have gone and that's about it."
        }, 
        {
            "index": 157, 
            "rating": 4, 
            "review": "We make this our last stop out of town, a hit-the-road must as far as we are concerned! Straight up for their Stromboli! They are as good as others have mentioned, including that Guy guy. I will not rate any of their other foods, because the first time we went there was for that Stromboli and since it is the only time we go in (once or twice a year) it is the only thing we will order. Simply DELICIOUS!\n\nWhy do so many people seem to base their reviews on strictly the ambiance, or lack of in THEIR opinion, like Emilie? So the place, in some people's minds, is a dump. Who cares, if you are looking for good eats? Sure, I would probably not go there late at night unarmed, mainly because it seems like a ghetto surrounds the place (must be why I heard they lock the doors then and let you in after they size you up), but I feel fairly safe during the daylight hours - LOL. I just don't get it...\n\nOh, and BTW (if it matters) - we think the staff is friendly and probably proud of their interior motif! In \"my world\" I would call this place \"edgy (aka trendy)\" - HAHAHAHAHAHAHA..."
        }, 
        {
            "index": 158, 
            "rating": 5, 
            "review": "Best cheesesteak subs and Strombolis in all of LV!!..Great bar that has cold tap beer served in iced mugs which are a nice touch. Friendly bartenders and servers make this a fun place to visit!"
        }, 
        {
            "index": 159, 
            "rating": 4, 
            "review": "This is the first stop on diners drive ins and dives. The Stromboli is great ice cold beer and friendly staff. The only thing is they only have 1 draft beer coors, hey guys bud or miller would probably sell more\nStill one of my faves. Enjoy"
        }, 
        {
            "index": 160, 
            "rating": 2, 
            "review": "I thought it was ok. The decor was kinda out dated. We thought Guy Fieri putting his name on it, it would have been great. The food came out fast and we were hungry so that's great. We had the Cajun onion rings and mozzarella sticks. The onion rings were kind of mushy and the mozzarella sticks were definitely the frozen type. For drinks we had captain and cokes and I'm pretty sure they used Pepsi lol. They were just ok. The bartender was very nice and attentive. The crowd that was in there was kind of weird but that's something you can't avoid on Jones and the 95."
        }, 
        {
            "index": 161, 
            "rating": 4, 
            "review": "\"The original sports bar and restaurant\"? If by \"original\" you mean old, this sports bar fits the bill. Located in a nondescript part of town off the strip, we weren't sure until we actually walked through the door whether this spot was actually still in business. Once we entered, we were confronted with a rather uncomely and smoky bar area; taking our chances, we proceeded to walk through a narrow passageway that opened into a back seating area with tables and booths. Very quiet. Strange layout, I must say.\n\nBeer is cheap (e.g. Shiner Bock for $2.50). We happened to come in during a game, so pizzas were half off. However, we wanted to try the famous STROMBOLI, so we ordered a small original one to share ($8.49). It was pretty good! I was expecting something dry and tasteless, but the dough was soft, crisp, and perfectly baked. CHICKEN WINGS ($3.55) were cheap and decent.\n\nOverall, having had low expectations for this dive bar, we were quite satisfied. There was an elderly couple across the room who ordered a large pizza (remember, it was 50% off). I think they only ate one piece between the two of them and packed up the rest to go. Smart idea if you don't want to cook dinner! The booth behind us consisted of a middle aged woman and her elderly mother: they enthusiastically ordered a TABLE FULL of dishes as if they were a gang of college jocks. I just saw the waitress bring them dish after dish. I think it was the mother's birthday or something. Or maybe just the daughter's annual visit. In any case, as we left, satisfied with our snack, we were somehow cheered and warmed by the memory of two grown women pigging out on some good ol' comfort food."
        }, 
        {
            "index": 162, 
            "rating": 5, 
            "review": "If looking for a dive bar with great food, THIS IS IT.  Try the Stromboli.  Mmmmm Good.  The pans that they use have been around forever and really give it flavor.  Ask for Marinara sauce.  \n\nIf you don't like smoke, come in through the dining room as the bar is very smokey.  You will smell like smoke even if there is no one smoking.  The pizza and wings are great, but come for the Boli.  They have a large TV in the main room and several smaller ones, so they are always showing some sport.  \n\nAs a side note, they have Shiner Bock on tap."
        }, 
        {
            "index": 163, 
            "rating": 5, 
            "review": "I have been looking forward to going to Four Kegs every time I come to LV.  I even sacrificed not going and telling the party I was with to go while I was stuck in travel traffic and miss the occasion.  Luckily I told them to go to Four Aces (Freudian slip) so they could not find it, Ha ha.  \n\nWe went and it was dark and old and reminded me of a few places in Fresno, where I grew up.  As I ventured in we were greeted in a real friendly manner and the place lightened up!  \n\nThe optimum word \"Stromboli\" don't leave without ordering it.  What is a Stromboli?  A luscious dough baked to perfection with a filling of choice inside.  I recommend the original or the turkey and cheese.  the original has 3 types of meat cheese and sauce.  There are sides you can get which are same ole stuff.  OK my mouth is watering writing about it, so I need not go into more of a description.  Go and try it they are open 24/7 except Christmas and I think there is a half of eat in the wee morning hours.\n\nThe Owner is very friendly and hospitable!  CHECK IT OUT!"
        }, 
        {
            "index": 164, 
            "rating": 4, 
            "review": "Great Stromboli! Great neighbourhood joint. smoking at the bar is sectioned off by glass walls so the dining room is smoke free. fried pickle spears are good as well."
        }, 
        {
            "index": 165, 
            "rating": 3, 
            "review": "We loved the philly cheese steak for years here, lately the philly cheese steak has no flavor and is nothing special, Until they get it right we wont be back"
        }, 
        {
            "index": 166, 
            "rating": 4, 
            "review": "Have to love this place for what it is.  Don't be scared when you walk in because it does not look like a place to eat until you go to the back room past the bar. Good heavy greasy Stromboli and pizza to soak up last night's toxins.  Pay attention to happy hour times. They have great prices on everything. Also, they serve beers in big goblets. Perfect!"
        }, 
        {
            "index": 167, 
            "rating": 4, 
            "review": "This place is a low key Vegas institution. It's filled with regulars and newcomers alike, and created a really cool atmosphere to be a part of. Most of the food is pretty good, but most especially the Stromboli. The turkey and Swiss, as well as the beef and cheddar are my favorites. The chicken wings are also amazing there. I'm not a huge fan of a lot of the sandwiches that I've tried, which is why I've knocked it down to four stars. I pretty much only order Stromboli or wings, despite having tried other things on the menu."
        }, 
        {
            "index": 168, 
            "rating": 2, 
            "review": "Wasnt impressed this time cheese burger overcooked and dry, fries cold. Said its a new cook and sorry paid full price for the dry half I ate didn't touch the fries."
        }, 
        {
            "index": 169, 
            "rating": 3, 
            "review": "Heard about this divey little joint located on the outskirts of the Vegas strip from a friend of mine. Anticipating what he described as fried mac and cheese goodness we made our way over to ole Four Kegs. As a vegetarian, this is probably not the best place to eat.\n\nThe atmosphere here is definitely diner-y and very dive-y, but not a problem. Although, smoking is permitted in one section of the bar, giving it that extra touch of dive. A plus is that the bathrooms were super clean. The women's anyway, the men's apparently had a floater.\n\nThe vegetarian options were slim, though I was grateful for them actually having vegetarian options. I got the veggie stromboli and shared the fried mac and cheese wedges with a friend. The rest of the bunch had pizza, various other strombolis and hot wings. I think the biggest hit was the mac and cheese wedges. Although not what I had expected (the wedges were filled with good ole blue box mac n cheese :/) they were still appetizing. My veggie stromboli on the other hand was not good. It was full of raw ass onions, FULL. There was no sauce, and when I asked for marinara poor Marge (what we felt the waitress should be named) was too busy to grab it. Bummer.\n\nId come back here for the unique atmosphere and maybe for those four dollar mac n cheese things, but otherwise..meh."
        }, 
        {
            "index": 170, 
            "rating": 5, 
            "review": "I love this place!! And it's a family vibe which I love. The calzone is thee best and the pizza is to die for , this will forever be my #1 pizza place"
        }, 
        {
            "index": 171, 
            "rating": 5, 
            "review": "Off the beaten track but well worth it. My GF and I split a Stromboli and a Philly steak sandwich. Both where to die for. Four cocktails and our two food selections for less than 40.00! It would be a regular stop for me if I lived in Vegas. Get away from the strip. You will not be disappointed! And do not let the wrapper scare you away. Press on!"
        }, 
        {
            "index": 172, 
            "rating": 4, 
            "review": "We met some friends from out of town last night because some of us are fans of Diners, Drive-Ins, and Dives on the Food Network.  This was a place that Guy Fieri used to patronize when he was a student at UNLV.  What more do you need to give it a try?\n\nWe got there at 5 and soon two of our friends arrived and 10 minutes later the last got there.  I point that out because there's one table in the dining room that has a sign saying it's reserved for parties of 5 or more.  The waitress knew we were expecting 3 more guests and she brought us drinks.\n\nWhen everyone was there, we ordered 2 original strombolis and one of the group got a chicken salad but he did try the stromboli.  It's been a lot of years since I ate stromboli in Upstate NY so I was glad when friends from NY suggested eating here.\n\nThe stromboli was very good.  It had a thin dough which is something few places do.  I like it the way it was made because you're not eating so much bread.  The filling was ham, cheese, pepperoni, and tomato sauce.  We also got a side of extra tomato sauce.  The taste was exactly what I was used to from my past life in NY.  \n\nService was very good.  Our server was quite friendly and she had a good wit with our salad friend.  I was so pleased that the smoking bar area is glassed off from the eating area.  The Clean Indoor Act really has helped a lot of us.  I'm a fan of the Four Kegs and I'll be back."
        }, 
        {
            "index": 173, 
            "rating": 4, 
            "review": "Stromboli is to die for along with  fried Mac N Cheese ....Yummy!\nBeen here at least 5 times.The place it self is very chill, lots of locals. Just a few selection of beers.  Service is slow on very busy days. There is a waitress that is always complaining on how busy they are. when we first heard her it felt uncomfortable to ask for anything."
        }, 
        {
            "index": 174, 
            "rating": 5, 
            "review": "We went there with a couple that live nearby and I had seen it on triple D so had to go. First off beer was so cold I almost got brain freeze and the stromboli's are great.Our waitress was no slouch either, friendly and new the menu. I'll definately go back when I'm in Vegas."
        }, 
        {
            "index": 175, 
            "rating": 3, 
            "review": "This isn't far from my MIL's place so we picked up some food. It's famous, it's close by and I haven't had a stromboli in years. \n\nSo inside it is definitely old school. It looks like it hasn't changed in decades, but not in a bad way, more like this place is a no frills institution. The one thing that did change is the barrier of the front bar is smoking and the dining is completely glassed in so no need to avoid it if you're smoke sensitive! \n\nWe were a bit confused how this place kinda works for to-go so we get a ticket at the window and pay at the bar, but once we figured that out we got out there fast. \n\nMeatball Stromboli - definitely good, the meatball was tender and definitely homemade. The actual dough had some crunch on the outside, but was chewy inside. I enjoyed it enough. \n\nTurkey, Ham and Swiss Stromboli - this was just okay. The BF didn't like the type of turkey slices they used in this. I felt it needed something, I say go for strombolis with red sauce in it. \n\nWe didn't know how filling these will be so we got a large meatball and a small turkey and that was way more than enough. We had left overs. \n\nWe also got some chicken tenders and fries. These are typical bar tenders and taste like many bars so definitely premade, but alright anyways. Their medium sauce is more vinegary than spicy. \n\nI'll probably be back for a meat and red sauce based stromboli and probably won't mess with anything else."
        }, 
        {
            "index": 176, 
            "rating": 4, 
            "review": "The one thing I miss about Vegas, my hometown, is the various neighborhood bars and grills.  Four Kegs was my neighborhood bar and grill when I was in my early 20's.  When me and a friend had a hankering for some late night noshing, we went to the Four Kegs specifically for the strombolis.  The original is like a Meat Lovers pizza turned inside out.  My personal favorite is the turkey and swiss stromboli.  Another option includes a beef and cheddar boli.  No veggie option as of yet - sorry vegetarians of the world.  \n\nThere's also no doubt that the service can some times be lacking, especially around 2 am.  I even wrote a poem about our fascinating blonde hair black roots waitress because her customer service was straight out of a John Waters' movie.  Yes, I have a special place in my heart for the Four Kegs.\n\nIt's a greasy, crude, smokey (doesn't matter if they partioned off the dining area from the smokey gaming area at the bar - it's in the walls forever!), loud like your obnoxious drunk friends kind of place.  But the food they serve will satisfy your drunken needs for sure.  The Cajun fries are great, hot chicken fingers and wings fan fare, hamburgers, and ribs.  Definitely not a place for \"dive bar\" seeking hipsters - stay in Silverlake if that's the case!"
        }, 
        {
            "index": 177, 
            "rating": 4, 
            "review": "A delicious sh*thole off the strip. Only tried the original Stromboli which was excellent. A true dive worth visiting!"
        }, 
        {
            "index": 178, 
            "rating": 5, 
            "review": "Stopped by here years ago after I saw it on Diners, Drive-ins and Dives, and decided to go back for a second time this past Saturday.  It was as good as I remember.  We split a stromboli and an order of wings.  First of all the stromboli was excellent. The dough is crispy on the outside but tender and pillow soft on the inside.  We order the original which came with a variety of Italian meats.  The meats and sauce are fine, but the dough is what makes this stromboli the best I've ever had.  Once it cooled down from molten hot we devoured it in about 5 minutes.\n\nThe wings were also fried to a crispy golden brown and tossed with their wing sauce.  The sauce was a basic buffalo sauce you can find at just about any place serving wings.  The sauce was good, but we ordered medium since the wife does not like her wings too spicy.  Next time I'm there, I'll have to try out their hotter sauces. Overall the wings are good and I'd recommend them to anyone that is at Four Kegs and in the mood for wings.  However, the stromboli is something I would go out of my way to get."
        }, 
        {
            "index": 179, 
            "rating": 3, 
            "review": "Above average stromboli. Not the nicest part of town or the best decor, but if you're looking for good eats at a great price, its definitely worth a try !!"
        }, 
        {
            "index": 180, 
            "rating": 2, 
            "review": "This is a dive bar in a rough neighborhood. Good strombolli sandwiches and tall drinks/shots.  Cheap.  Filled with locals.  Can't smoke in the restaurant side. Aging waitresses who have seen it all, yet deliver decent service.\n\n2 TVs on sports channels and some video poker inside."
        }, 
        {
            "index": 181, 
            "rating": 5, 
            "review": "I'm from SoCal and it this is on my to-do list every time I'm in Vegas. Hands down, best bar food I've ever had. Their fried macaroni bites, mozarella sticks, wings and pizza are all incredible; fresh tasting, their own recipes, and unique. \n\nAs many have said, the must-have is their Stromboli. Never seen the episode, but apparently it was featured on \"Diners, Drive-Ins and Dives\" and Guy Fieri was very impressed with its quality. I've gotten the \"Original Boli\" many times (marinara sauce, pepperoni, sausage, mozarella) and it really needs to be tried once for anyone visiting Vegas. Ask for extra marinara sauce and dip your way to 'Boli heaven. \n\nIt's about 15 mins off the strip, and incredibly unassuming (very, very divey looking inside & out) but trust me; it's worth it."
        }, 
        {
            "index": 182, 
            "rating": 4, 
            "review": "Great pizza and wings, old Vegas favorite. Wish they would open another in summerlin, but it would take the character of the place away.  Probably better for adults if you dine in."
        }, 
        {
            "index": 183, 
            "rating": 3, 
            "review": "More like 3.5 stars.  Went here to check out Guy's best Boli he has ever had.  I have had a few myself being an East Coaster....  \n\nThis place is definitely a dive, the decor looks like it hasn't changed much since it opened in 77.  But it is a dive, by definition.  It is an odd layout too, bar up front and a few doors leading to what looks like the back dining room.  Note that there is smoking in the bar, this being Vegas and all plus various video type slot games...\n\nWanted to watch Rutgers dominate Iowa St. in the bowl game Friday so sat at the bar.  Owner Mario was behind the bar and was speaking to everyone (except me, newbie here) by their first name.  Definitely the dive bar now, almost Cheers like. :)\n\nReviewed Stromboli options with Mario.  Went with the original, small.  More than enough for me since I didn't have a fridge in my hotel room for a Large, double sized, for only $4 more.  Must say that it is nicely crispy on the outside.  Was maybe just a little too much dough thickness than what I like but the crispiness was a big plus.  Downside was that it doesn't normally come with extra dipping sauce, extra charge is what I recall on the menu, should have asked for that anyway even though there was sauce inside already.\n\nIt was a good 'boli for sure overall.  Not my personal best 'boli but very good.  And I also liked owner Mario, mostly because how he was genuine and how I saw him treating everyone, including me.  On the way out he asked to check in with him gain next time I am in town.  Looking forward to trying another option and increase my rating..."
        }, 
        {
            "index": 184, 
            "rating": 3, 
            "review": "This place had some really good food, although at first glance the front part of the restaurant is a bit sketchy."
        }, 
        {
            "index": 185, 
            "rating": 4, 
            "review": "Yes, this place is a dive. Yes its kind of scary; but OMG. If you are brave enough to come down here the Stromboli is killer. If your a fan of hot wings do yourself a favor and place an order. The are the size of small baby arms and the flavor is amazing. \n\nThe locals are nice and even the scary bikers were very engaging. There were three families here with children so it cant be too bad! \n\nStop in and spoil your taste buds. They will thank you!"
        }, 
        {
            "index": 186, 
            "rating": 4, 
            "review": "Four Kegs is probably the best deal you're ever going to get in Vegas. Stromboli, pizzas and more are less than $10, and are all of surprisingly good quality.\n\nThe main draw here is the stromboli - it's not too greasy and you get a lot of bang for your buck. Awesome place to hang out."
        }, 
        {
            "index": 187, 
            "rating": 3, 
            "review": "After watching football at a locals bar in Las Vegas, we decided to try another local bar we found on Yelp. This bar was on the show Diner's, Drive-ins and Dives. \n\nFrom the outside, the sports bar looks huge! I was really disappointed with the lack of big TV's here and the way they were laid out.\n\nUpon entering there was a small bar area with limited seating. There was also an area which seemed like restaurant seating and then another room that you could call the banquet room. Anyway, the bar area was packed. So the hostess took us to the banquet room area which had about 4 TV's (I think). We couldn't see all the games so the hostess said she could take us to a different area. It had the same issues, you couldn't view all the TV's and they were small TV's\n\nAfter reading the reviews on Yelp, I decided to try the fried pickles and original stromboli. The pickles and stromboli were good but nothing that would give you that \"wow\" factor. My friends ordered the wings that were on special. Those too were good but nothing spectacular.\n\nI must say that we did see the pizzas here and they looked really good!\n\nHaving the words \"Sport Bar\" in your restaurant name, one would  think they would have tons of big flat screens. Not Here! Won't come back for that reason."
        }, 
        {
            "index": 188, 
            "rating": 5, 
            "review": "The Philly cheese steak is amazing. I know it wasn't the menu item that was highlighted on Diners Drive-Ins and Dives but it's the best I've had in decades. I am not a fan of their fries and the salads could use work, but the cheese steak is big enough to be a meal in itself"
        }, 
        {
            "index": 189, 
            "rating": 4, 
            "review": "I decided to go here because I saw it featured on the television show Diners, Drive-ins, and Dives. Everyone talks about the Stromboli. I thought it was just okay. What impressed me was the pizza. Some of the best I have had in Vegas. The wings were top notch too. My review is based on going after midnight where they have half price happy hour and a scary looking waitress. My friend had a bad experience due to the service. To me it is one of the typical bar joints in town. So, I didn't expect much. I will definitely be going back when it is almost dawn and have a craving for pizza."
        }, 
        {
            "index": 190, 
            "rating": 3, 
            "review": "The food at this place used to be fantastic.\n\nNow, something seems to of happened and I'm not sure what it might be.\nThe pizza used to be almost decadent; fluffy yet crispy crust, delicious gooey cheese and scrumptious tomato sauce. The last time I visited, things seem to have taken a change for the worst. The crust was dense, the tomato sauce flavorless, and the cheese almost tasted like a cheap imitation. Even the mozzarella sticks (which were always my favorite) seemed off. I really hope it was a one-time fluke and that the next time I visit the food will be restored to its former self."
        }, 
        {
            "index": 191, 
            "rating": 3, 
            "review": "Diner's, Drive In's, and Dives is so hit or miss on their recommendations.  The Four Kegs seems to fit the pattern.  The original stromboli that everyone raves about- didn't impress us that much.  If you live in a major city, you can find a stromboli in your home town just like it and in many cases - better.  We did like the dough, which is a huge part of any stromboli.  It's nice and browned, with a buttery flavor to it.  Other than that we were not impressed with the fillings here.  It was mostly an average quality black forrest ham, although there were supposed to be pepperoni and salami in there as well.  No other flavor really stood out.  Black Forrest ham isn't an italian meat, not sure why they are using it here when you have so many great Italian cold cuts to chose from.  The stromboli also could have had more cheese and marinara sauce.  Only 3 stars. http://www.yelp.com/biz_photos/four-kegs-sports-bar-las-vegas?select=dJ5C1t4So4ZeWE3FDocWKQ#aHBeyIiUwWA0g3ATNPnR5g\n\nIf you are going to come here make sure you get the Meatball Boli.  Four Kegs meatballs are very tasty.  Surrounded by the excellent golden buttery crust, this one was a winner.  We ordered a side of marinara sauce to dip in and I suggest you do as well.  It's not an amazing sauce, but I found a little dip went a long way.  It could have used a few more meatballs in this boil as well, especially since we were sharing.  4.5 stars for the Meatball Stromboli.  http://www.yelp.com/biz_photos/four-kegs-sports-bar-las-vegas?select=dJ5C1t4So4ZeWE3FDocWKQ#xhW180LRrXist_kfJBrl-Q\n\nMy wife rocked the boat and got the Chicken Philly.  I wanted to try the Philly cheese steak since a few people have raved about it on yelp.  But she loves a good a chicken philly, unfortunately this one was just kind of average with green peppers and onions.  Nothing too remarkable about it and it made her wonder why we drove here.  Also the potato salad was very sweet and blah. 3 stars.  http://www.yelp.com/biz_photos/four-kegs-sports-bar-las-vegas?select=dJ5C1t4So4ZeWE3FDocWKQ#m47QUO5PiUWFKIVpjdKciA\n\nMy daughter had some kind of fried mac 'n cheese nuggets.  Yuck!  If I never ate one of those again it would be ok with me.   It was clearly Kraft Mac -n Cheese balled up, breaded and deep fried.  Her fries were very uninspired as well.  Based on what we tried, I found Four Kegs to be a one trick pony with the Meatball Boli.  Perhaps pizza is good here, since they have a good dough and seem to know what to do with it.  I'd say Four Kegs is best for locals only."
        }, 
        {
            "index": 192, 
            "rating": 4, 
            "review": "I had the \"original stromboli\" and the Philly cheese\nsteak with baked beans and french fries.  The stromboli was good. I like the crust on this slightly like a deep dish dough buttery, crispy and delicious.  Stuffed with ham, pepperoni, salami, sausage and mozzarella. I recommend getting the marinara on the side for an up charge. You will not be disappointed if you order this dish. Come after midnight until 8am and you get big discounts.\n\nThe Philly cheese steak was awesome!. Loaded with thin sliced beef griddle with just the right amount char to add great flavor, and peppers, onions, mushrooms, and provolone. The bread really made this sandwich a homerun. The fries were good, but a little underdone. A nice thick steak cut but could have been a little crispier.  The beans tasted like baked out of can style. I don't think Guy Fieri came here for this dish. \n\nEnjoy!"
        }, 
        {
            "index": 193, 
            "rating": 3, 
            "review": "I go back and forth between giving this place 3 or 4 stars. They have been around Vegas as long as I can remember, and got famous a few years back after being featured on Triple D. It's a small bar with a small dining area in the back. They are pretty welcoming, but you can tell they have their regulars. They are known for their pizza and strombolis. Pizza is thick buffalo style, pretty good. Not too doughy. I prefer it with less toppings to enjoy the actual pizza. The strombolis are made with fresh ingredients but to me seem pretty average. I ordered the Cajun fries, buffalo spicy with a smell of vinegar. Yum. All of their salad dressings are home made and the blue cheese is thick and has red wine vinegar in it. I'm still undecided about it. \nThe burgers are good, salad was average. Chili seemed like it was straight from a can with fresh cheese and onions on top. Hot link was a good quality meat. \nNot everything here is fresh, for sure some frozen appetizers and a few corners cut, but OVERALL you'll get decent food if you know what to order. \nOh and it was fun pissing off the cowboys fans during the game too :) gotta love a place that you can watch the game at!"
        }, 
        {
            "index": 194, 
            "rating": 5, 
            "review": "A great Vegas dive bar with delicious pizza and Stromboli! Their signature Sicilian pizza is thick, doughy and delicious. It's not a typical Italian style, but it's very tasty and definitely worth the stop. The Stromboli is also delicious. The original is stuffed with a variety of meats and cheese.They also have video poker and dining area. Definitely a place for great dive bar food!"
        }, 
        {
            "index": 195, 
            "rating": 4, 
            "review": "My wife and I visited the Four Kegs while in Las Vegas over the weekend. I found out about it from Diners, Drive-ins and Dives. This place is definitely a Dive. There's a bar in the front and the restaurant in the back. \n\nWe got there around 5 PM on a Saturday. There was one other table when we got there,  They left and one other table came in after we ordered.  The service was pretty good, but that might have been because the place was empty. There seemed to be a little confusion in the kitchen, but our order came out fairly quickly and it was correct. \n\nWe split a order of mac-'n-cheese wedges and a larger originlal Stromboli.  The mac-'n-cheese wedges were ok. It tasted like out of the box mac-'n-cheese, coated in batter and deep fried. It was interesting, but probably something i would not order again.  \n\nThe star of the show was the Stromboli. The dough/crust was excellent. Definitely fresh and made from scratch.  The large was perfect for my wife and I. This was my first Stromboli, so I wouldn't know a good one from a bad one.  I don't know how this stacks up to other, but I will say it was very good. If we lived in the area, we would probably go back."
        }, 
        {
            "index": 196, 
            "rating": 5, 
            "review": "Checked it out while on a business trip, based on a personal recommendation and the facts that it was featured in Food Network's \"Diners, Drive-Ins & Dives\". LOVED IT. We ordered, burgers, pizza, stromboli, chili-cheese fries and shrimp scampi. All DELICIOUS!"
        }, 
        {
            "index": 197, 
            "rating": 5, 
            "review": "My wife and I love watching all the food shows, especially Diners, Drive Ins, and Dives.\n\nWe were going on vacation, and had to go through Vegas. We both agreed, had to stop and try this place out.\n\nWe were very glad we did. I ordered a large original stromboli. It was awesome. I usually eat quite a bit, and I didn't finish it all. The wife got a meatball sub, and loved it. Really liked their fries and ranch as well.\n\nWe thought we had a microwave in our hotel, but somehow we didn't. Placed the leftovers in the fridge, and ate them cold the next morning. Both the sub and stromboli were just as good cold.\n\nWe liked the place so much, a week later(yesterday), we stopped in on our return trip. \n\nThe only way it would've it been better is if I was staying in Vegas, and could've had some drinks with the food. Still amazing considering the situation. \n\nA must next time you drive through Vegas, or are staying in Vegas."
        }, 
        {
            "index": 198, 
            "rating": 4, 
            "review": "I came here for the Sicilian pizza. It's a huge part of the pizza scene in northeast PA, where I moved from. I didn't think I would find it at all out west so when I came across this place on Yelp, I HAD to go and try the pizza.\n\nIt's super easy to get to from 95. It's in a plaza and there's plenty of parking. If you happen to go during the day, expect to see nothing for a few seconds when you walk in because it's pretty dark. It's dated and homey looking inside, as is typical of most dive bars. However, for me personally, this felt like the kind of bar that would be attached to someone's house. I dug the inside and the vibe.\n\nI was directed to order from the kitchen counter; a 10 minute wait. Not bad. I've waited longer at some places. Paid at the bar and the bartender asked if I wanted a drink (declined.)\n\nGot home and finally got to taste it. The smell was spot on what I'm accustomed to. The taste is very similar, but it's not exact. I think it's the cheese. I ordered extra cheese so I won't next time. I also think they might use American cheese? (Shame on you, if that's the case.) The cheese takes away from the flavor but overall, I would definitely have it again. And I recommend getting it WITH onions. The sauce, I expected to be too sweet but it was actually pretty spot on.\n\nEveryone else is reviewing the stromboli, which I'm sure is good but more needs to be said about the Sicilian pizza."
        }, 
        {
            "index": 199, 
            "rating": 4, 
            "review": "The Stromboli is everything it was cracked up to be but the Philly cheese steak was the best on the menu."
        }, 
        {
            "index": 200, 
            "rating": 5, 
            "review": "Every word I have heard about these infamous stomboli's have been true! I never realized that I live only 7 minutes away, and now that I know, I can't stay away. Every friend or family member who comes to town for a visit we take because if you're gonna come to Vegas it's a MUST on the list of to-do's!"
        }, 
        {
            "index": 201, 
            "rating": 5, 
            "review": "Amazing food... just had the chicken fingers for my first time probably the best i have ever had. Lightly breaded pure lean white meat. You know how most fingers have a layer of fat between the breading and the meat, not here! I suggest get them plain and hot sauce on the side. The atmosphere is great friendly nieighborhood folk out for a cold beer. They also have the MLB package."
        }, 
        {
            "index": 202, 
            "rating": 3, 
            "review": "Four Kegs is located on the Westside of the Strip, right next to Summerlin.  Second time visiting this place.  It is kind of small, but quaint.  It has a separated bar area from the dining area.  Were seated immediately and watched a little March Madness.  Our waitress was a little older but very sweet.  And a great memory.  We ordered and she didn't even bother to write anything down.  We kid her about it and she said she understood what we wanted.  Everybody ordered stromboli's, as they are the specialty and the recommended choice of Guy Fieri.  My order was a veggie stromboli, hold the onions.  When the food arrived, everyone was pleased and the order was right except for one thing: our waitress noticed that they cooks had added onions to mine.  She immediately noticed this and went back and replaced my order.  i told her she could take the one back with onions, but she said they would just toss it and I could take it.  Great, my friends said they would eat it later.  So my order came right the next time, it was pretty good (not amazing, though) and we were four happy dudes.  It is worth the detour from the Strip to come here to try something different.  Nice people, decent food and ballgames on the screen.  What else could a guy want?  Oh, except that!  We are in Vegas!!!"
        }, 
        {
            "index": 203, 
            "rating": 5, 
            "review": "I'm just like Patrick, when I was in Vegas we had to go to Four Kegs.  We saw it on the Food Network and we went.  It was good.  The food was cheap and huge portions.  We split an original Stromboli and fried mac and cheese.  The Stromboli was a bit overwhelming for me but my boyfriend loved it.  The crust on it was out of this world fantastic.  The fried mac and cheese was also super good.  My boyfriend's cousin go the grilled chicken sandwich with fries and that was also huge.  She seemed to like it and the fries were the yummy steak cut ones.  \n\nI'll go back if I'm in Vegas again for longer then 2 days and/or if I start going back on a more regular basis.  Definitely a great local dive."
        }, 
        {
            "index": 204, 
            "rating": 5, 
            "review": "Absolutely love this place. Been going for years, since I was a kid. Cheap, great food after midnight. Everyone who works there is so nice and really helpful. Never had a bad experience."
        }, 
        {
            "index": 205, 
            "rating": 5, 
            "review": "Best Strombolli in Tha World!!!!! Featured Nationwide on the Food Channel!!!! Also Half-Price on Graveyard!!! They have awesome flavors like Roast Beef & Cheddar, Ham & Turkey, Broccoli & Chedder & Original Pizza!!!! Be sure to bring a friend cuz you can't eat this all by yourself!!!! Also Famous for their Sicicilian Rectangular Pizza, & Their Chicken Wings, & Steaks!!!!!! Right off US 95 At the Jones Exit behind Del Taco!!! Coincendentally tha Last Place I hit a Royal Flush!!!! 14 Years ago and it was Dealt to Me!!!! Cole is a Great Bartender too!!!"
        }, 
        {
            "index": 206, 
            "rating": 1, 
            "review": "1/2 way through my wings I found a piece of the metal sponges they use in the kitchen. Our waiter apologized yet only because she felt she had too it was not a genuine apology, she took the piece back to the kitchen to ask the cook and or the dishwasher and they confirmed its what they use to scrub pots as if I was lying and that's when she apologized in monotone and gave my fiancé attitude & walked away before he was done speaking RUDE!! That was the braking point for us, NEVER going back!"
        }, 
        {
            "index": 207, 
            "rating": 4, 
            "review": "GF: (Saturday afternoon) I'm hungry, lets grab something to eat.\nME: k, what do feel like?\nGF: How about 4 kegs? they were featured on blah blah blah.\nME: what do they have there?\nGF: Strombolis and other staff.\nME: Ok fine (thinking...how bad can it be?)\nwalking in I noticed that they went around the smoking law quite smartly, its like having 2 dives in one, cute.walked into the bar, sat down and I'm looking at the taps and all the sudden it hits me, there is a ram on one of them...its like deja vu all over again, called the bar tender...Q:you got shiner? ..A: yes we do!!!!!!!!!!, Q: how? (i'm still convinced its a bad dream) A: yep, had it for over 10 years now..\nOMG  I found a bar in Vegas that serves Shiner on drapht. .simply unbelievable! .\nThose who are not from Texas and have no clue what shiner bock is need to head over to the 4 kegs and try it, words alone can not explain my enthusiasm.\nAnyway, Yes, the place is old, located in not the best neighborhood but all that is to be overlooked, the food is not bad at all, very traditional, prices are good to fair, and most important, shiner on tap, I thing I just found my new favorite dive."
        }, 
        {
            "index": 208, 
            "rating": 1, 
            "review": "No no no! Terrible food & bad service. We stopped here because it had been featured on Diners, Drive-Ins & Dives and we were thoroughly disappointed. A table that got seated after us got their appetizers before us. We had to ask again for our appetizers after we got our food. I ordered The Kegs Club w/ fries. The fries were cold, as was the bacon on my sandwich, which makes me assume the bacon sits pre-cooked in kitchen. They used american cheese, no option for cheddar, swiss, etc. Didn't even bother to stick the sandwich in the microwave to melt the cheese. My boyfriend ordered a stromboli, it was comparable to a calzone you would buy in a high school cafeteria. We took one bite each, & asked for boxes. We decided to get a quality meal elsewhere, and & at the very least save that food for a 2nd rate lunch for work tomorrow. The waitress brought us boxes & a plastic bag. She had trouble opening the bag up, gave up, & tossed it in my general direction while walking away.  The place was not particularly busy when we went in, I can't think of any reason other than low standards for why the food was so bad and we received barely any attention from waitress. Dont let the tv show or the other good reviews draw you in, thats how we were fooled, and led us to waste money & some of our last few hours in las vegas."
        }, 
        {
            "index": 209, 
            "rating": 4, 
            "review": "The Stromboli was awesome! I had a taste of my wife's and it was gooood! My father and I had the Philly Cheese steak which was also awesome! Beers were $2 that's a deal even if you are in Vegas. This place is definitely worth driving out to next time your visiting Las Vegas."
        }, 
        {
            "index": 210, 
            "rating": 4, 
            "review": "This place has been around for as long as I can remember. It's in a pretty bare shopping center on Jones/95. A dive bar in the front, with a restaurant in the back. I like that there is a door that separates the smoky bar from the dining room. I have tried a lot of food here, what I like the most is definitely the pizza. The pizza's are sicilian style, with a thick, buttery crust that's cut into 8 squares. One of the pizza's they offer has 7 toppings of your choice, so we usually double up on all the ones we like, and ask for the pizza well done. It comes out excellent every time. Don't forget to ask for a few sides of their delicious homemade ranch for dipping. I also like the cajun fries, which are just fries tossed in hot sauce, but they are pretty tasty. Pro tip: All pizza's are 1/2 price after midnight. If you haven't been here yet, do yourself a favor and check it out."
        }, 
        {
            "index": 211, 
            "rating": 4, 
            "review": "Good food. I've been coming here for a few years now. Staff is nice but sometimes slow. They have great lunch specials."
        }, 
        {
            "index": 212, 
            "rating": 4, 
            "review": "Went here with my parents as a throwback since they moved away from Vegas ages ago. My dad used to play for a softball team sponsored by Four Kegs so they had fond memories. \n\nWe asked for a pitcher of beer but you can only get one of their special glasses. Fried Mac n cheese was yummy, the Stromboli was huge and packed with meat. I liked their pizza the best. Supreme with tons of toppings and very doughy Sicilian style. That is how my momma made pizza growing up. \n\nI appreciate that they section off the non-smoking area. The waitress made us feel right at home and completely rolled with the \"dad jokes\" my father likes to spout off. The place also is much smaller on the inside than it looks from the outside, probably due to the layout. Lots of charm, great food, and even better service."
        }, 
        {
            "index": 213, 
            "rating": 2, 
            "review": "Dirty dining!!!!!!!!!!\nCame here today after hearing about it on Guys show DDD.\nAnd when looking it up for the menu on google I came across they were shut down for unsanitary conditions in the kitchen just figured I would put that out there. \nI ordered a half rack of ribs 3/10 the price was good but the ribs was nothing special at all. They also can use a better bbq sauce for it.\nI also had a med pizza with 7 topping add pineapple and that was 4/10 didn't care for it much felt like it was a little soggy as well.\nLast but not least the famous strombolli which was a 7/10 it's was actually pretty good I wish I got just a few of these and not the rest.\nSo pretty much I recommend if you go to get that for sure.\nNow back to the dirty dining situation this place could use some love. It is pretty dirty and old for sure. The bathrooms were dirty as well with the booth that we were sitting in because the seats were not wiped throughly. Now for the kitchen I couldn't see much but just seeing the back steel panels on the wall you can see layers of build up of dirt. The best part is that it had finger print streaks so it made it more noticeable.\nNow for the environment it's not my kind of environment especially if I was to come for the tvs because they had these little 20 inch Vizio tvs in the corners that I didn't even realize was there and there was only a few of them. But hey the prices were pretty awesome and the drinks were only $6 each overall I don't think I would come back just because it could use a cleaning and touching up on some food and environment."
        }, 
        {
            "index": 214, 
            "rating": 3, 
            "review": "this place is not scary, as some yelp reviews stated.  my one year old daughter had a blast running around and dancing in the booth.  the waitresses we had were all very nice.  i loved the wings, crispy goodness,  and the original boli was tasty.  it must be the dough they make daily.  very good.  my daughter loved the fried mac n cheese wedges :)  i would def. go back, next time i want to try the pizza, it looked awesome!"
        }, 
        {
            "index": 215, 
            "rating": 5, 
            "review": "This hole in the wall is still amazing! Great food, specials Stromboli and pizza,wings are voted the best on the west side of town' Thanks Four Kegs for keeping it real  All these years!"
        }, 
        {
            "index": 216, 
            "rating": 5, 
            "review": "OMG-THE BEST PIZZA EVER!!!!!\nWe saw this location on the Food Network and we had to try it. When we arrived the place looked like a hole in the wall. But inside was pretty dark and totally awesome. The beer at the bar was so cold and made the beer taste so much better. \nOk back to the food- we order the wings and pizza. Wings are a must!!!! We got \"hot\" flavor and they were seriously the best wings ever. Then we got \"the guinea\" pizza as shown on TV. Let me tell you,  I travel all over the U.S. and this is the absolute BEST pizza we ever had. Even better than Chicago and NYC . we got the not so wee size and it was a big pizza. Good for 4 people or maybe 6 if you are not that hungry. But the pizza is so good, you can't stop at two slices."
        }, 
        {
            "index": 217, 
            "rating": 4, 
            "review": "I can check this restaurant off my \"have to check out\" list. If you get tired of Vegas buffets then Four Kegs Sports Bar is definitely worth the 6 mi. drive off the strip. Judging from the outside it doesn't seem very family friendly since we had some kids with us...the group walked in apprehensively but were warmly welcomed by the staff. The staff directed us to the dinning area,  it's not the prettiest of places but once you eat their stromboli you forget all about the look. As a group we decided to try the stromboli, hot wings, pizza, antipasto and several children menu selections.  The hot wings are beyond hot..if you like crying you should try them. The antipasto dressing was delish..next time we will order two antipasto's. All in all...we enjoyed the food, no left overs which is a good sign. Staff is really friendly even though the place was packed, the waitress attended us very well."
        }, 
        {
            "index": 218, 
            "rating": 4, 
            "review": "Great place, last day in Vegas was told about this place by a local.. Stromboli is the way to go.. takes a good 25-30 mins to get to the table but beers are only 3-4 bucks unlike the beer prices in downtown Vegas(8-10 bucks a beer)  ps: the fried zucchini is awesome!\nEnjoy this hidden gem!"
        }, 
        {
            "index": 219, 
            "rating": 4, 
            "review": "How could you not love a place known for strombolis? This place is a hidden gem outside of the strip that I've been wanting to go since they were on DDD.\n\nThey have a few different kinds of stromboli (and even a breakfast one!!!!). Between me and a few other people we tried a 3 of them and I have to say the meatball one is by far my favorite. We tried the beef and cheese one (or something like that) and the original one (or something like that) and the meatball was really just perfect. The small size is good for a normal person, but if you're like me, the large will do. Actually splitting a large stromboli between 2 people is the best deal. If I remember correctly, the small was around $8.95 and the large was $11.95. \n\nService was pretty decent here and the food was prompt. We got a couple appetizers including cajun fries, which were basically fries in buffalo sauce...I don't really recommend this. Just get the regular fries. We also got the fried mac and cheese or whatever it was. That was awesome. I would get those if I went again.\n\nAlso if you get a beer, it comes in this ice cold mug that makes it one of the most refreshing beers. Or if you're like my sexually confused friend and want a bloody mary, they have those too. It was actually my first time trying a bloody mary and it was pretty good...note to self: don't get \"buffalo-ed\" when you're having one...it's not a fun drink to chug. If you don't know what \"buffalo game\" is, look it up.\n\nIn conclusion:\nGet a large stromboli for 2 people.\nGet the fried mac and cheese or whatever it was\nGet a beer.\nGet the meatball stromboli"
        }, 
        {
            "index": 220, 
            "rating": 5, 
            "review": "The best Stromboli I ever had in my life.  I keep going back for these.  Meatball and Original are spectacular.  The place is a dive bar, but the Stromboli are so awesome that it makes up for the atmosphere.  There is a bar and separate dining area.  I've eaten in and gotten food to go.  Everyone is super friendly.  The service is really great."
        }, 
        {
            "index": 221, 
            "rating": 4, 
            "review": "HAD to check this place out as it's the only DDD in the area and the Mrs loves some strombolis.  WOW it was great, next time we'll be trying a pizza too even if we have to get something to go!  Mr got some wings the hottest they have the 'flamers' and well he wasn't as impressed with the hotness as he hoped none the less they were warm just really vinegary which isn't on his fav list for wings.  We also had an appetizer of motz sticks, your standard frozen drop in the fryer, and three of them came out to us looking like blobs needless to say we'd skip them next time."
        }, 
        {
            "index": 222, 
            "rating": 5, 
            "review": "Excellent service!!! The fingers and Stromboli were excellent!! Plus one of the coldest beer on tap. Only down side is they have4 kegs, if they were to ADD a local IPA or three this place would be THE best bar food. Bar"
        }, 
        {
            "index": 223, 
            "rating": 5, 
            "review": "Love the half price after midnight menu foods always great n Robs a friendly waiter ....."
        }, 
        {
            "index": 224, 
            "rating": 2, 
            "review": "Items Selected:\nFried Vegetable Basket - Mushrooms, Zucchini Chips and Cauliflower with Cheese Sauce and Ranch\nCajun Fries with Ranch\nSmall Pepperoni and Cheese Sicilian Pizza\nSmall Original Stromboli with Pepperoni, Sausage, Ham, Cheese, Marinara\nSpumoni Cake\nChocolate Cake\n\nSelf proclaimed as Las Vegas \"Original Sports Bar and Restaurant,\" an appearance on Guy Fieri's Diners, Drive-Ins and Dives making the space at 276 North Jones Boulevard more famous than it might be otherwise, The Four Kegs...or Four Kegs Sports Bar...or Four Kegs Sports Pub is one of those old-school spots that has maintained a steady clientele in a city built on transiency, some business in the area spontaneously providing an impetus to stop in and find out why.\n \nServing consistently since 1977 and one of a handful of 24/7 Gaming Joints with the foresight to partition off the dining room from Cigarettes and Video Poker to preserve the lungs of diners including those under 21-years of age, The Four Kegs features several sections including a large group area as well as tables along a narrow hallway, the area designated as \"Dining Room\" juxtaposing the kitchen featuring several televisions tuned to sports plus some comfy, broken-in booths.\n\nPleasant in service, a few Four Kegs veterans coaching a younger woman who was clearly new but handling several tables of regulars like an old pro, it was from a menu of Bar Food classics that decisions were debated, an eventual order of six items and a Soft Drink tallying $50 after tax and tip - not cheap, but not a bad value considering the portions served.\n\nNot upscale in any way, the overhead soundtrack dating back to Ace of Base and Journey as the NBA captured the attention of many, it was with a basket of Fried Vegetable plus Fries rolled in Hot Sauce that the meal got started, the latter a thick Steak-cut that was unfortunately somewhat flaccid while the not-technically-a-vegetable Mushrooms highlighted a basket that was mostly an oily delivery mechanism for bottled Ranch.\n\nEdible, though not inspired, course two was perhaps a better way to see what the Sports Bar kitchen was capable of, a six-slice rectangle of \"Sicilian\" Pizza well-topped but falling short in terms of Crust as a lack of leavening left all but the outside edge soggy, the DDD-revered Original Stromboli a much better use for the Dough as a slighter amount of Mozzarella and tangy Marinara allowed the $9.95 'Sandwich' to bake up crispy and golden brown.\n\nNot making any of their Desserts in-house, the waitress keeping cards close to her chest when asked which local Bakery supplies the goods, thin slices of two Cakes were chosen with Cheesecake saved for another time, the Chocolate actually incredibly rich beneath thick Ganache while the four-layer Spumoni went all-in with a thin layer of Frosting plus a robust Graham Cracker surrounding three lightly sweetened Ice Creams plus a layer of Chocolate.\n\n*** Fair-to-Middling in a city with no lack of 24/7 dining, sports and gambling, The Four Kegs is a worthwhile visit for those in the area looking for something to eat at any hour of the day, though with the development of places like Naked City Tavern or even The Sporting Life and Born and Raised it most certainly is not any sort of 'destination.'"
        }, 
        {
            "index": 225, 
            "rating": 4, 
            "review": "Order the stromboli and you'll leave happy. We got both the original and the vegetarian---both were delish. Doughy (but not undercooked), slightly crispy on the outside, and filled with the softest, most delicious cheese you will ever find in a stromboli. \nWe also ordered the Jalitos which were not so good to be honest (Arby's has better ones). Definitely stick with the stromboli!"
        }, 
        {
            "index": 226, 
            "rating": 5, 
            "review": "Throwback to 60s Las Vegas\n\nIt's in a dilapidated shopping center, and when you open the door the smell of old beer and smoke rushes past.  But isn't this how you want to be greeted by a dive bar?  \n\nThe restaurant is separated from the bar to protect the diners--Did I say diners?  Eaters...--from the smokers in the bar.  It's down and dirty good food at a cheap price and take-home proportions.  And if you're there during an NFL game, pizza, stromboli, wings, etc. are half price thereby making the place twice as good.\n\nMy office is just across the freeway and my business power lunches are at places familiar to most, but when I go to lunch with a friend, we go here.  Check your upscale image at the door."
        }, 
        {
            "index": 227, 
            "rating": 2, 
            "review": "I went to lunch with some coworkers.\n\nI ordered the french dip sandwich, it was pathetic. The meat was so dry, even the dipping au jus, couldn't resurrect it. If they had left the meat out an hour longer, they could had sold it as jerky.\n\nTo be fair, the others in the group had Philly steak sandwiches and one had a Stromboli.  The Philly's looked great and everyone liked them (I wish they would have used that meat in the french dip, it looked moist). The Stromboli was also liked by the person having it.\n\nThe service was good, staff very attentive. Two stars for that, they owe me stars for the  sandwich.\n\nIf I go there again I will definitely order something else, I can't get over how bad the french dip was. But, I doubt I will go there again."
        }, 
        {
            "index": 228, 
            "rating": 5, 
            "review": "Great Food!!! Excellent service!  Have been going for years!  A must try if your visiting and of course an old favorite for me!"
        }, 
        {
            "index": 229, 
            "rating": 1, 
            "review": "The wait staff and bartenders are rude. I heard so many good things about the Stromboli, but what I got was a total abortion. They didn't even cook it all the way. Cold in the center with unmelted cheese. The kitchen staff clearly doesn't give a fuck. I've had hot pockets that tasted better."
        }, 
        {
            "index": 230, 
            "rating": 5, 
            "review": "Amazing food and service!\nThe 'boli was awesome and the beer was\nice cold.\nSaw this place on Triple D and Guy was bang\non!\nThe ladies in the lounge were great and\nvery helpful.\nWe will be back!"
        }, 
        {
            "index": 231, 
            "rating": 4, 
            "review": "Good Stromboli! And my Dad really liked his Calzone. That said, it's pretty much a dive bar. Had our waitress not been so nice and attentive this might have been a 3 star review. The place is clean enough, but it is old and needs and update. The layout is kinda weird with the glassed-in bar area seperating the dining room. But then again you're not here for the ambience, you're here for the really good and inexpensive pizza pockets!"
        }, 
        {
            "index": 232, 
            "rating": 2, 
            "review": "Came here with my brother and his fiance and I really did not like this place.  We kept hearing about the stromboli, so we decided to give it a whirl.  The table where we sat had tiny puddles on it from the staff not wiping it down properly.   The person taking our order did not seem to thrilled to be serving us.  Then came the food.  I really can't put my finger on what was wrong with it, but the only thing that jumps out at me when I think about it is that I really did not like the cheese inside the stromboli.  The whole experience was unsavory."
        }, 
        {
            "index": 233, 
            "rating": 5, 
            "review": "Loved the pizza and our server! Best pepperoni pizza I've had in Vegas. Great atmosphere. I'm definitely coming back"
        }, 
        {
            "index": 234, 
            "rating": 1, 
            "review": "Their stuff is usually good but I just got food poisoning from their Kegs Club. Didn't taste right, and now I'm suffering for it. How do I know it's from this place? It's the only meal I had today and started feeling sick later tonight that I couldn't attempt to eat anything else. Thanks a lot. I better not spend the rest of the week in the bathroom puking my brains out. A health inspector should visit you guys soon."
        }, 
        {
            "index": 235, 
            "rating": 4, 
            "review": "I can't comment much on the atmosphere because we were the only ones there as it was mid-morning on Dec. 30th.\n\nStopped in with my family before the long drive home to San Diego. The stromboli was excellent. Opted to go for the large one which is a bargain, and you can just take home what  you can't eat.\n\nThe best is the original, but the beef & cheese and the breakfast stromboli were also very tasty. \n\nIt's a little out of the way from the strip, but if you have access to a car and are looking for something that isn't a buffet or a very expensive celebrity chef restaurant experience that most meals in Vegas tend to gravitate towards, it might be worth a stop. The staff is also very friendly. Even met the owner, who I saw on Diners, Drive-ins and Dives (how I found out about the place) on our way out."
        }, 
        {
            "index": 236, 
            "rating": 1, 
            "review": "This place was on DDD. After years of saying i need to try this place, I obviously go! Chose it as a little date night for me and my guy. \n\nAs we walk in it smells dingy. Smells like an old cigarette butt actually. I don't smoke so that was a big negative to me! So we take a couple seats at the bar. Bartender was a dick. Didn't ask us if we wanted anything to drink. Just slapped some menus in front of us and said Holler when we are ready to order. Um, we didn't say we were gonna eat here and we really wanted a drink. Bartenders there must read minds! So we order our food. Bf had the wings and fries and I had the turkey club. Food was a 7 out of 10 for both of us. I really dislike that they serve food on paper plates. It's just tacky to me. I had to take off the lettuce and tomato because it was very very soggy! Other than that my food was fine. Bf liked his wings. But he said they were really salty. So maybe they can scale back on the salt next time and bf will be happy! \n\nNow the staff... Like I said, bartender was a prick. We had to flag his rude ass down because he did 3 that is THREE trips around the bar and never 1 time asked us if we wanted a drink or even water for gosh sakes! Nope! When we did get drinks there was no syrup in my Sprite. It was all carbonated water. YUK! I took a big drink too :( but after 15 mins I finally got another Sprite! So then my bf puts in a $20 bill into the machine in front of him. The bartender looked at us and said, \"if ur gonna gamble, don't expect me to be at your beck and call when u want to cash out after you win $10 bucks! What is this dudes problem? So my bf had already put the cash in when I reached over and pressed cash out. Screw this jerk. I'm not giving this place my money with him working there. 8 long minutes go by and the bartender is staying on the other side of the bar on purpose. So I waited to the 10 min mark and I got up and told him I want my money, we need to go, and please! He said he will be there in a min. Another 6 mins go by and I got up again. I told him I needed my money so I can leave and get home to my child. So he said \"oh ur one of those huh?\" I'm one of what I asked. \"Oh never mind lady, I'll get ur money!\" Well, not wanting to get the bartenders ass beat and my bf thrown in jail, I didn't tell my bf what the asshole said until we got home. We tried to ask his name a couple times before we left and he kept saying his name was jack then whispers his last name is meoff. So he was saying his name was jack me off. Class act buddy. I know damn well he didn't think of that all alone in his pea size brain! \n\nSo the 2nd time I came in I asked to be seated in the dining room far away from that bastard bartender. I ordered my food to go. That was a much better experience because I didn't stay there very long. So word to the wise!!!... Go in, or call in would be way better! Order your food and don't stay there 1 min longer than u have to. Oh, don't u dare gamble either  because they clearly don't want people to. They'll treat you like shit if you do! \n\n1 last thing that is actually positive and I'm so grateful for! The 2nd time we went in, there was this man who was waaaayyyyy too drunk. Bartender should of cut him off 10 drinks ago but didnt. Not surprised! The man was sitting in the bar area when I got there and came to dining room after about 10 mins. He told the waitress that he went to the bathroom and lost his seat and there's no place to sit in the bar anymore so he had to come to the dining area. So he ordered another beer and 2 shots. Waitress came back with 1 beer and a big glass of ice water and a glass of Coca Cola. Told him to finish his LAST beer, drink some water or soda and she is calling a cab right now. He was angry when she said last beer and was even more mad that she wouldn't give him shots of hard alcohol. She told him point blank, \"be as mad as u want pal but you are not killing someone I love because u are not adult enough to know when to quit!\" There were only 7 people in the dining area and we all started clapping and thanking her. She probably saved a lot of lives when she did that. She got a $20 tip from me on a $9 tab. And I know the other patrons did the same. I wish I could remember her name. I'll stop in one day after work and see if I can get it and I'll update my review with her name. Oh, the man finished his beer and 3 glasses of water. Handed over his keys to the waitress and said he would be by tomorrow morning to get his car. Thank god! \n\nI've been living in Las Vegas for 15 years. I've seen the inside of bars/diners probably 1000 times no exaggeration. I've also seen probably 2-4 thousand idiots go stumbling to their cars to drive. And never once have I seen a bartender, waiters or security try to stop them. Never cut them off and don't give a flat f&@k! But she did and for that I am internally grateful! Karma will be good to her! \n\nFor whoever has gotten this far on this review, I hope  you found this useful."
        }, 
        {
            "index": 237, 
            "rating": 5, 
            "review": "THE STROMBOLI IS REALLY GOOD HERE!\n\nOk, we saw the Food Channel show, \"Diners, Drive-ins and Dives\" episode that showed this place, so when we were in Vegas, we had to make the trip. Its a total dive, in the back of a strip-mall casino/bar. Its open 24 hours, seats are uncomfortable, the menus are older than dirt, but the food is really cheap and really good. \n\nWe split an original stromboli, a small or medium pepperoni pizza and some buffalo chicken strips. Everything was good, but the stromboli is  excellent, best I ever tasted."
        }, 
        {
            "index": 238, 
            "rating": 5, 
            "review": "Thank you Triple D for yet another great find. Would have never gone here were it not for your great program...\n\nAnyway, coming here was a lot of fun. There is no hoopla or marching bands. Just a large strip mall in the middle of the desert with a lot of other businesses trying to get by. Park in front and see that there are no windows and like three doors to choose from. Pick the middle one and enter right into the bar and wondering if I am in the right place... Anyway, make my way around back and get seated. This is a tiny place and a bit of a maze but all the more charming i guess...\n\nService here was incredible and the food even better. Had great help in choosing wasn't disappointed in the Original and the Beef and Cheddar. Wish I could have sampled everything but this alone was worth the trek in the hot Las Vegas sun...\n\nThere is nothing else to add except that their stromboli is perfection or to quote Guy... \"money.\""
        }, 
        {
            "index": 239, 
            "rating": 1, 
            "review": "Comments: Spent $16.74 on a take out today of ribs, coleslaw and baked beans. The ribs was extremely dry. The baked beans was sour and my stomach rejected it at first taste. The only thing that tasted good was the coleslaw. I drove 1/2 hour from Henderson to try their food since it was featured on TV. Disappointed."
        }, 
        {
            "index": 240, 
            "rating": 5, 
            "review": "We spent a week in Vegas and the food on the Strip is fine once in a while, but not every meal.  We were looking for something different.\n\nWe google searched Drive-ins Diners and Dives to see if there were any restaurant visits in Vegas, and we found Four Kegs.  It was about 10 miles from where we were on the strip, and the drive was worth it.\n\nOur waitress was very nice and sweet.  She recommended the Stromboli and the Philly Cheese steak.  Coming from Chicago, its very hard to find anyone else's pizza-like food to be great.  While I will say the Stromboli was very very good, I think their Philly was very memorable, and enough for two people to eat.\n\nWe went back a second time w/ family who live locally and we all had a great time and great meal."
        }, 
        {
            "index": 241, 
            "rating": 5, 
            "review": "ALWAYS A MUST. half off pizza during football and after midnight. Amazing strombolis, fried mac n cheese bites, cajun fries, great service. Will always have my business"
        }, 
        {
            "index": 242, 
            "rating": 1, 
            "review": "I saw this place on Triple Ds and since I am a fan of strombolis I was looking forward to trying this when I was in the area.  I talked some coworkers into going and a group of 8 of us hit it.  When we walked in the restaurant side we were promptly ignored even though the waitresses looked right at us.  We walked around a few minutes looking for an open table large enough and since we were in her way she decided to split us into two smaller tables instead of scooting them together.\n\nThe menu selection was good, but our food took forever to get.  The waitress eventually said one of the two cooks didn't show up, so we relaxed and continued watching the Masters.  Once the strombolis started arriving they all looked good.  Unfortunately, 3 were undercooked (raw dough) and 3 were barely warmed through, but at least the dough was cooked.  I think the other 2 guys were too hungry to notice anything wrong.  When we started complaining, there was not much of an apology from either waitress.  One didn't say anything when she took one back to the kitchen and the other just said something to the affect of \"not sure why, they were cooked long enough...\"  Obviously not!\n\nThis place is a bit far from where we usually stay when we visit Vegas each year, so when we are back in town again I doubt we will take the time to try it again due to the uncooked food and waitresses that don't care enough to apologize."
        }, 
        {
            "index": 243, 
            "rating": 4, 
            "review": "Definitely a local place.  Not pretty on the outside.  I had the Original Stromboli.  It's like a calzone.  The crust was the best part.  Has a nice crisp texture and soft inside.  The other food I saw being served looks good too."
        }, 
        {
            "index": 244, 
            "rating": 4, 
            "review": "Fun little dive bar. The Stromboli was amazing. Service was as expected. Not too crowded."
        }, 
        {
            "index": 245, 
            "rating": 3, 
            "review": "We went to this place specifically for the Stromboli. My husband is from the east coast and has been missing some of his east coast favorites, Stromboli, pizza etc. Saw an episode on diners, drive ins and dives and had to go. It is an odd little place, bar in the front, dining in the back and on the side lounge areas. Wait staff is very friendly, totally makes the place...the food was good, however if you ask my husband, he thinks the Stromboli is the best in town. I gave it 4 stars for hubby's sake but to me I think 3 stars is sufficient. I think for a late night bar run with some eats it is a perfect spot ...It is good bar food."
        }, 
        {
            "index": 246, 
            "rating": 5, 
            "review": "I went here based on seeing it on Diners, Drive inns, and Dives.  I was not disappointed, the stromboli was amazing with generous amounts of filling and the hot chicken wings were large and cooked perfectly.  Though the \"hot\" wings could have been a little hotter.  Good prices and great service too, I will be back next time I am in Vegas!"
        }, 
        {
            "index": 247, 
            "rating": 4, 
            "review": "I am no expert in Strombolyism, but I am rather versed in good tasting food, and the Stromboli here is on hit!\n\nI learned about this place from the homie visiting from Hawaii.  I was surprised that he found this little divey spot amongst all the other bujee places LV has to offer (...and I don't ALWAYS mean that in a negative sense, at times I do).  I believe that he discovered it on the show, \"Diners, Drive-Ins and Dives,\" hosted by none other than Las Vegas' own, Guy Fieri. \n\nWhat was shocking was how close this place is to my office too.  I totally overlooked this place thinking that it was just a local watering hole for neighborhood.  Once you enter the establishment, you will notice the bar area.  To the right, you will see the walkway toward the rear where the dining area is.  \n\nBe aware that if you are the type that can't eat around cigarette smoke, this may not be the place for you.  There is a non smoking area, but the smells tend to linger through the vents.  Still, once you taste the Stromboli here, it may be more than worth the health hazards.\n\nI have to say that although I am an avid fan of the original Stromboli (large of course), there are tons of other dishes that is offered at 4Kegs, I just haven't tried them first hand but seen some friends order it and vouched its legitimacy.  \n\nThe large Stromboli could be shared by two unless you are really hungry.  I tend to put in a phone order and just swing by to take it back to the office.  But one thing to note is get extra marinara sauce (a little up-charge is included tho).\n\nAlthough, the joint is a pretty run down local spot in dire need of a make over, to some, that may just be what many patrons respect, an official 702 mainstay.  Definitely divey but worth it."
        }, 
        {
            "index": 248, 
            "rating": 4, 
            "review": "This is the definitive Vegas, off-strip joint! Plexi-glass nclosed smoking bar in front and funky eats in back. We had the Stromboli's and oh man were they great!!"
        }, 
        {
            "index": 249, 
            "rating": 5, 
            "review": "Today was my first encounter with the infamous Four Kegs and the stromboli (original). I always wanted to check the place out and try the stromboli since seeing it on Triple D. After multiple times visiting Vegas, I finally tried it. However, my experience would be as a take out order. I must say, the stromboli did not disappoint. I loved how it tasted, nice crisp, crunchy buttery crust and gooey cheese melted with the sauce and meats. Next time I need to experience Four Kegs as a whole, dining, eating and drinking. Till the next time.."
        }, 
        {
            "index": 250, 
            "rating": 4, 
            "review": "Super stinky to get past the bar into the restraunt but so worth it.  Best deep fried cauliflower since Aunt Pauline passed away."
        }, 
        {
            "index": 251, 
            "rating": 2, 
            "review": "This place has a good history... Sadly it's a distant memory... They could really use an upgrade In their menu...just had worst chef salad ever.... Seriously how do you screw up a salad.... Stromboli 's are great.... New menu new look  new food needed...new degreaser would be a bad idea either....."
        }, 
        {
            "index": 252, 
            "rating": 4, 
            "review": "In Guy Fieri we trust...have been to a couple of his recommendations on DDD and so far so good. Since we were in the LV area, we couldn't resist but to stop here for their original Stromboli. It tasted just as Guy described it...the crust was crisp on the outside and moist and chewy on the inside. Add ham, pepp, mozarella cheese, and marinara sauce and it's like a match made in heaven. SO GOOD!!! \n\nThis place is probably the last D on DDD...it was a total DIVE! About 10 mins from the strip, this \"sports bar\" sits in a partially desolate shopping center in a very questionable area. Luckily, it is right off the freeway for a quick getaway...if needed! :) The layout of this place is a trip...it kind of reminded me of a cul de sac of a street. You enter and you are at the cul de sac which is their bar area...on both ends there are doors leading you into their dining area which I can describe as being on the outskirts of that cul de sac. They are divided by half of a wood paneling wall on the bottom and the other half is plexi glass where you can see from either side...imagine a bank with bulletproof windows????!!! I know very strange. \n\nThe staff is really friendly and the service is A+. Our waitress said, \"Guy must have sent y'all cuz I've never seen you in my life!\" LOL! The menu was pretty extensive...pizzas, pastas, burgers, sandwiches, chili fries, pitchers of BEER, etc. The prices were very cheap for the amount of food that they serve. Overall, I would definitely come back when in the area to try the rest of their food, esp the pizza!!!"
        }, 
        {
            "index": 253, 
            "rating": 5, 
            "review": "The best of the best \"dive bar\".  You'll realize immediately that you aren't a regular and nobody knows your name ... and it's ok.  The veggie stromboli is ooey-gooey with cheese and, because are waitress said the ribs were her favorite, we had those too.  Amazing."
        }, 
        {
            "index": 254, 
            "rating": 4, 
            "review": "Hubby and I stopped by during our yearly beauty convention visit and made a point to drive over and try the stromboli and wings.  We were very pleased!!!  \n\nWe were starving and excited to taste the food all these reviewers recommended AND.....YES Four Kegs is worth the visit!!  The 'boli was great, the cheese was nicely melted over all the meat of the original boli and the wings were perfect,, juicy and hot!!!  \n\nThe waitress suggested a side of marinara for dipping the boli and it was fantastic!!  We will be back on out next trip to Vegas.  Thanks for serving up good food!!"
        }, 
        {
            "index": 255, 
            "rating": 4, 
            "review": "My boyfriend discovered this place on Diners, Drive-ins and Dives and we had to visit the place during our Vegas trip. I think it was our first meal in Vegas and it was so good we just had to have it again at the end of our trip.\n\nTaste:  I got the Turkey and Swiss Stromboli.  It was so good!  I couldn't finish all of it because it was so big.  Super tasty and super cheesy.  \n\nService: Pretty good for being at a dive bar.\n\nAtmosphere:  Typical dive bar.  It looks pretty old inside, but who cares, the strombolis are delicious!\n\nReturn visit?: Hell yeah! Don't leave Vegas without going here!"
        }, 
        {
            "index": 256, 
            "rating": 4, 
            "review": "The Four Kegs rocked!  Friendly people and the meatball boli was awesome!  The dough was super-fresh, tastey and cooked just right!  A good place to find...  Shiner Bock on tap, another plus!  Watched the Lakers game as we plowed through the Spicy BBQ wings, that hit the spot!"
        }, 
        {
            "index": 257, 
            "rating": 4, 
            "review": "Just happened to visit this place due to work...and I'm glad I did. This place is a true blue dive bar. It has loyal locals and a core staff that has been there for a long long time. You must try the stromboli and the Philly....both the best I've ever had! We ordered a stromboli plate and Philly plate both with fries and one soda....$17! We were stuffed. Hands down, I will be back to this place with friends in tow. Ask for Mario, he's the man."
        }, 
        {
            "index": 258, 
            "rating": 1, 
            "review": "Guy Fieri needs a slap in the face! \n\nThe Four Kegs has the worst customer service I have ever seen. The waitress we had was slooowww and very forgetful. It was as if she was on medication or something worse. We arrived during off peak hours for dinner, 9 pm. \n\nAfter a 45 minute wait the first  of five strombolis  made it to our table--all the strombolis arrived at different times (5-10 minutes apart). Very uncomfortable to watch other folks eat. One stromboli never made it to the table, we had to flag down our medicated waitress to check on the order (which she forgot to put in). Our waitress also forgot to put in our appetizer order--we reminded her and it came after the meal. \n\nThe one forgotten stromboli finally made it to our table AFTER everyone completed their meals, and it was ICE-COLD in the middle. \n\nThe manager never compensated us or apologized for THEIR screw-ups. Very disappointing.\n\nGuy Fieri should be ashamed of himself for highlighting this dive on TV, he lost a lot of credibility with all of us.\n\nOh, and the stromboli and appetizer (fried mac and cheese) was just average, nothing to brag about."
        }, 
        {
            "index": 259, 
            "rating": 5, 
            "review": "Been coming to this place since my parents did when I was young. Place hasn't changed. Pizza, calzones, and everything else is great! This is a Gem in Vegas. Must try out."
        }, 
        {
            "index": 260, 
            "rating": 5, 
            "review": "True definition of hole in the wall dive bar, but OMG, the food is amazing!!! The Stromboli is delicious, the fried pickles are the best I've ever had--they are spears, not slices--and the hot wings have a spicy, vinegar-y sauce with lots of flavor. Don't forget the Mac & Cheese wedges, and the awesome hamburgers that were featured on Diners, Drive-Ins & Dives. You can't go wrong with anything on the menu at this gem of a dive."
        }, 
        {
            "index": 261, 
            "rating": 4, 
            "review": "I did not know Four Kegs had been featured on Guy Fieri's Diner, Drive-Ins and dives.  I had been in hear once in the early 2000's, and several times when I used to work in the area.  It's been around since the 70's.  \n\nThe popular choice is the Stromboli.  There are a few different variations of stromboli's to choose from such as original, beef & cheddar, and meatball.\n\nThe bar is separated from the dining area, and there is a larger banquet area for private affairs.\n\nThe service was friendly and the beer was ice cold,"
        }, 
        {
            "index": 262, 
            "rating": 3, 
            "review": "I came here for one reason and one reason only, the stromboli. I have to say, it did not disappoint. I had the original. It was like a delicious meaty pizza surrounded by even more delicious crust. \n\nI did not really care for the place itself. It was located in a seedy area of Vegas, and its kinda divey. But, like I said I came for the boli, which was delicious! \n\nThe food is not only delicious but inexpensive too!"
        }, 
        {
            "index": 263, 
            "rating": 5, 
            "review": "So get this, my parents are in Lost Wages on a brief vacation.  I'm up here in Seattle watch'n TV.  While flipping through the channels the good old Food Network pops up and I see my favorite show, Diners, Drive-ins, & Dives, while half watching the show and checking up on e-mail I hear something about Las Vegas and a place where the host spent many a moon at during his youth.  So as I'm watch'n them make up a Stromboli my mouth is totally watering, once the show is over, I picked up the cell phone to give my parent's a jingle.\n\nAfter getting all the details on directions and address and my explanation that this place could be a total \"dive\", I mean it's located in a strip-mall, they trekked over to see what this place was all about.  As they walked in the door they were greeted by a happy-go-lucky gentleman who said right away, \"Oh, you must have seen us on the Food Channel!\"  They nodded in agreement and their new best friend Mario led them to the small-ish dinning room toward the back of the \"casinodivebarrestaurant\" much to their delight the \"back\" of the bar was packed with people, an old wives tale my mom believes that if there are plenty of \"locals\" the food must be good.  As Mario cleared a small table for my parent's he continued to entertain/chat with them, he even cut off the football game on the TV's to turn on a VCR recording of the Food Channel episode where they were featured!  Much to the chagrin of some of the \"regulars\".\n\nMy mom had the buffalo wings, I'll preface to say she often drinks Tabasco instead of coffee sometimes in the AM.   Well, after munch'n on the wings, even she had to admit to my dad they were a bit \"zippy\".  My dad got worked over by some kind of sandwich to which he mentioned it was HUGE and very tasty.  Strangely there were no leftovers....\n\nSo, you might be wondering why I'm Yelp'n a place I've never stepped foot into.... Instead of getting some lame t-shirt from Vegas, I got a STROMBOLI!!!  WOW!!  Nice move parental units!!!  Even reheated in the toaster oven this bad-boy was out freaking standing!!  A very nice crust, plenty of goodies inside and it was re-born, via toaster oven, nicely even after a 2-3 hour flight from Vegas!!\n\nThe place is open 24hrs, whew, needless to say, it's on my \"todo\" list the next time I'm in town!!"
        }, 
        {
            "index": 264, 
            "rating": 5, 
            "review": "This a review for they're take out pizza/wings. I haven't dined there yet.\n\nLet's begin with.. this is the shit!\n\nNo, im not saying it tastes like shit.. im saying this is the best pizza i've ever had in Las Vegas, shoot this is the best pizza I think i've ever had in the young 21 years of my life.. and believe me i've had alot of pizza! :)\n\nThe pizza had a delicious thick crust. It tasted very buttery & had a hint of garlic in it. Mmm, mmm. The marinara was perfect. I like my pizza's with a litle extra marinara to go along with those awesome toppings and this had the correct combination. We went with the pepperoni pizza since no one could really agree on the toppings. The pepperoni was very good. not tiny slices but medium sized ones. They weren't chintzy with it which i liked. next, the wings were so unique. They we're like chicken patties, which i thought i wasn't going to like.. but actually [to my surprise] i loved them. It really tasted as if i was eating them off the bone. couldn't believe it. \n\nSadly everyone loved the pizza so we ran out & i still wanted more :/\n\nWill come back for the wings and pizza!"
        }, 
        {
            "index": 265, 
            "rating": 4, 
            "review": "I have eaten alot of stomboli in my day but mostly back east.  This is some good boli.  I try to hit this place up every time I'm in Vegas.  A word to the wise this place looks nothing like it did on TV.  I saw the show.  It is in a run down shopping center but worth the trip if you are in town."
        }, 
        {
            "index": 266, 
            "rating": 3, 
            "review": "Looked this place up on Guys website since I was in Vegas and wanted a good place to eat at. It was a cool little spot. My fiancé and I walked into the the bar area and we were so confused as to how to get to the dinning area but we found it. We were seated and our waitress was sweet but at the end of our order we wanted separate checks because of our group and she said it was too complicated. Really? So we paid half cash and half card and she just charged everything on one card because she didn't want to deal with it. It was disappointing. I ordered the chili cheese fries and they were pretty good. Not the best I've ever had but it was a yummy snack. My friend ordered the bbq chicken and rice. It didn't look like they put effort into making it. I could have cooked a better piece of bbq chicken. My fiancé ordered a pastrami sandwich with potato salad and he enjoyed his meal. Would we come back to this spot? Idk I think I would look for another spot on Vegas to try out next."
        }, 
        {
            "index": 267, 
            "rating": 4, 
            "review": "I've only been here once but it was a good experience. Kind of a hit or miss with these TRIPLE D / Diners Drive ins and dives places. This didn't disappoint.\n\nWe went late on a Thursday night JUST for food for take out. We entered the separate dining area and then we placed our order. It's really tight like a hall way to get by but it has a handful of booths to sit at. \n\nThey have a \"typical pizzeria\" menu. No offense at all, but the typical burgers, pizza, wings, ect. We were after the Stromboli! The menu was placed on the wall but they also have menus. After ordering we were nicely informed that the two Stromboli and wings would take about 20 minutes because of baking. No problem! Oh btw the place is definitely a bit \"dive-like\". It isn't the most modern and definitely not all trendy and stuff. \n\nAlso you pay the bar tender just FYI. Kind of weird but makes sense to me. \n\nAfter that a couple of servers tried to seat us so we just sat down and waited. There's also this really friendly lady kind of roaming to make sure people are being helped and doing okay. \n\nAfter about 15 minutes the cook walked to our table to let us know the food was ready.\n\nThe Stromboli were 12.99, I believe, each. The wings were 8 for $10.00 I believe. \n\nWe paid, took it to go, and then we were nicely thanked as we left.\n\nIt was a standard and nice interaction done with smiles and that definitely went a long way for me. I appreciated the overall friendliness. \n\nWe got back to the house and dug in. I didn't read the whole get marinara thing until after I got home. Fortunately the Stromboli were still amazing without the extra sauce. The dough was what made it for me. Definitely different than a calzone. We got the original which was like typical three meat pizza ingredients and then a beef and cheese one. Both of the choices were spot on. Each is about the size of HALF of a pizza but they are stuffed. They both fit in one pizza box. The wings looked unassuming and standard but were nicely done. They were not breaded and slightly crisp. They were good but nothing to rave about. \n\nI honestly don't have any complaints. The only tiny minor gripe is that the end pieces virtually had no toppings stuffed into it. The dough was so good I didn't mind too much.\n\nI'll definitely be back for some Stromboli."
        }, 
        {
            "index": 268, 
            "rating": 4, 
            "review": "saw this place on \"Diners, Drive-ins, and Dives\" and thanks to Guy Fieri, love strombolis and the Four Kegs now!!!\n\nif you have seen this place on t.v.they deffinately do not show you the closed off video poker area when you first walk in. level 5 dive to be exact lol\n\nanyways, you walk in, see that and feel discouraged, then a large room almost for parties also gets you worrysome, we asked ourselves where do we sit or orde. anyway, continue down the hall and theres the main dining hall, maybe 7 or 8 booths and a long center tables lined up. and all over the walls are notes, and pics, and maps of Guy and just visitors from all over!\n\nonce we settled in, we just laughed and thought how cool this place was!\nthe two watresses (a younger white girl and older asian woman) were extremely nice and served us with ease. \nwe ordered the Cajun fries to start off, which unfortunately, came out cold and damp; its a shame b/c the flavor was great, just poor quality.\n\nthen we ordered the philly cheesesteak sandwhich and the original stromboli. the cheesesteak was simple, with cheese of course, peppers, onions, and mushrooms. cant go wrong and no complaint there.\nthen the stromboli; the crust/dough is crsipy, soft, warm, and amazing; the meats and loads of cheese splurge out in tastefullness and surely fill you up!\n\noverall, a great new place to enjoy and if in vegas, go there!"
        }, 
        {
            "index": 269, 
            "rating": 4, 
            "review": "Great philly cheesesteak. Definitely a dive with good bar food."
        }, 
        {
            "index": 270, 
            "rating": 5, 
            "review": "Went here with a friend last night for dinner. All I can say is the food is Amazing! Had the original stromboli with ranch and marinara on the side, pepperoni pizza, and zucchini chips. Everything was delicious! So much food and it was all around $35. We even had enough for left overs for the both of us. We sat in the dining area and bypassed the bar part of it. When I first walked in I wasnt so sure of the place. It looked like a small smokey bar. Once we went thru the dining area and saw families and others packed sitting enjoying their meals I was like ok they're busy. What brought me here though was the fact that its down the street around the corner for my house and my friend mentioned Guy Fieri recommended it on Diners Drive Ins and Dives so of course being a foodie I had to check it out. I cant wait to tell everyone about it and come back! By the way the hostess was super attentive, kind, etc. I cant say enough about this place!"
        }, 
        {
            "index": 271, 
            "rating": 1, 
            "review": "Okay, I love Guy Fieri's Diners, Drive-In's and Dives but this restaurant was quite disappointing.  This was definitely a dive and I don't care about that but an italian restaurant that uses canned mushrooms???????????  Thank God I didn't get the vegie \"boli\" and my sister in law did because I couldn't have handled any canned vegies.  Our original \"boli\" was okay; it didn't have a lot of meat but a lot of bread.  Not at all like E. Coast \"boli's\".  My niece (2 y.o.) got \"fried\" mac-n-cheese that was just Kraft Mac-N-Cheese fried.  Would I go back??  I don't think so!.  Sorry Guy."
        }, 
        {
            "index": 272, 
            "rating": 4, 
            "review": "June 30, 2012 Saturday - dinner 6:30 PM\n4 adults & a kid\n\nAtmosphere - 4 stars\nFood - 4 stars\nService - 5 stars\n\nBackground - Been here before, but that was before my Yelping days. I loved it last time I was hear\n\nAtmosphere - Yeah it is bar which serves food.  We sat on the right side when you come in.  They have three TVs with sporting events on, we watched the Mets dominate the Dodgers.  I did not even notice the smoke, like some reviewers commented, but I think the new laws (probably three plus years now) prohibit the smoking in a place that serves food.  I think that is why they have glass walls around the bar, but these walls made for a strange feel to the place.\n\nFood\n  Appetizer - Onion rings, nothing special they were just there. \n\n  Main Course - Went with the original Stromboli again, so did my parents.  We all loved it.  I should have ordered one to go.  I wish I could get this rolled up pizza in Reno!\n\n  Dessert - I was stuffed after eating that Stromboli!\n\nService - Our waitress changed the channel on the one TV no one was watching to Fox Sports so we could see the Mets Dodgers game.  Mary Beth was great, fast and funny.  What more can you ask for from your server. \n\nFuture - Sure, I love the Stromboli."
        }, 
        {
            "index": 273, 
            "rating": 4, 
            "review": "We usually stop at Emma Jeans in Victorville on our way to Vegas but we thought we change this up a bit and try another Triple D place. We always wanted to try this place but once you get settled in Henderson you just seem to stay put. We stopped here as soon as we got into the city. Super easy to find. We ordered the Original Stromboli and the veggie appetizer that had cauliflower, mushrooms, and zucchini. The appetizers were good but the Stromboli was fantastic. I don't like beer batter too much but they do stuff right. The crust was great. We shared. I even asked for a to-go container just for the crust I didn't want to leave behind. Not crazy about the Ice T but who cares.........It's all about the Stromboli!!!!  Just looking at the picture above I could taste it and I hate that I'm so far away now.   If you tasted this.....then you know what I'm going through.........Especially if your a carb whore."
        }, 
        {
            "index": 274, 
            "rating": 2, 
            "review": "Ok ok, so I saw this place on Diners Drive ins and Dives and I thought \"Hey\" I want to try this place out. When we arrived I noticed a few homeless men sitting infront of the bar. Whwn I walked in I was not even greeted by the bar tender. I had to read a sign to get directions to the restaurant seating area which by the way is in the very back of the bar. The seating was very small. The waitress looked at me and my wife standing there waiting to be sat down. After about 5 minutes she stated \"You know its seat yourself right\" WOW! My wife and I sat down and we ordered. I had the house stromboli and my wife had chicken wings and fries. My wife ordered her wings naked with no sauce. Her order came out great. My stromboli was OK. It was very bland and lacked flavor. I was really dissappointed. The waitress asked me what was wrong and I explained to her the situation. She then left my table and returned with a pizza sauce for the stromboli. She said this was what was missing. I then asked for a re-fill on my water and it came 12 minutes later. The stromboli still was just OK nothing great as I had herd and wanted it to be. The customer service sucked. Thumbs down to Diners Drive Ins and Dives for this recomendation."
        }, 
        {
            "index": 275, 
            "rating": 5, 
            "review": "This place has the best babe food I have ever had. Also, it has the best strombolis and deep dish pizza you can handle it Las Vegas. You will not be disappointed with not only the food, but the friendly service as well. Great hospitality, and ICE COLD BEER. Such an excellent place close to the strip."
        }, 
        {
            "index": 276, 
            "rating": 4, 
            "review": "We visited this place for the frist time food was pretty good wasn't really what I expected orange Chicken  a little over cooked.and Spicy noodles kinda of salty. Will try again."
        }, 
        {
            "index": 277, 
            "rating": 4, 
            "review": "I love this place and I have been a bunch of times and I still wish that I went more.  I moved to town about 4 years ago and this was one of my first stops.  Since then, this is a place I take my brothers to when they visit.  The Stromboli's are amazing!  My personal fave is the Turkey and Swiss.  That cheesy swiss is so good I can't enough so I like to order one to go so I have some the next day.  There are two other things that are a 'must have' when I go to Four Kegs, besides beer. The Cajun Fries (which seem more like Buffalo Wing Fries) and the Fried Mac n' Cheese.  I know that Fried Mac n' Cheese is more of a thing these days but this was the first place I had ever tried it and in my mind, it is the best!  Those little triangles are perfectly fried and the Mac n' Cheese is so cheesy and delicious I could eat a couple of orders by myself.  It's perfection (when I'm not counting calories)!  The drive from my house to Four Kegs is a bit of a distance but it is always worth it.  I have never been disappointed nor has anyone I have taken there."
        }, 
        {
            "index": 278, 
            "rating": 4, 
            "review": "If you're coming for a few beers and some sports it's awesome. Beer for $2.75 can't be beat.  Definitely dive-y but clean. Weird smell upon entering. Kind of oily, cardboard smell - you'd think it would smell like Stromboli but there is no food smell at all. Kind of strange. \n\nWe tried the original Stromboli. It was good. Not sure what all the fuss is about though. It's a meat-lovers pizza in calzone form.  The monthly appetizer was fried ravioli. Pretty tasty. \n\nIf you want to experience a restaurant featured by Guy Fieri, it's fun to see."
        }, 
        {
            "index": 279, 
            "rating": 5, 
            "review": "Wings and pizza. Very cool Maralyn and Kimmy were great bartenders. We all love hole in the wall bars. Mike the chef was great too. Ashley was excellent, and smokin' hot."
        }, 
        {
            "index": 280, 
            "rating": 4, 
            "review": "The original stromboli was really good and the ladies working there were friendly.  It's worth a stop if you're in the area."
        }, 
        {
            "index": 281, 
            "rating": 4, 
            "review": "I know a lot of places get a bad wrap (at least on yelp) after being on DDD, but honestly?  The stromboli at this little dive is a gem.  Located about 15 minutes off the strip, this little restaurant/bar is a true dive.  One door puts you in the middle of a smoke-filled bar, and another leads you to the dining area.  I was a little skeptical at first, but glad I decided to stay.\n\nHusband and I (well more like I) couldn't decide, so we ordered two small bolis.  We went with the Original Boli and the Turkey and Swiss Boli.  Holy freaking yum!  I don't know which I prefer, so in the few times we've been back, we order both.  There's always a little leftover to take back to the hotel for a snack later.  I definitely think this place is worth the drive off strip.\n\nPS..the old ladies working there are super nice as well."
        }, 
        {
            "index": 282, 
            "rating": 5, 
            "review": "I just casually searched yelp for bars nearby where I'm visiting family and I noticed this place had a ton of reviews (thanks to Diners Drive-Ins, and Dives). \nWe gave it a shot. Came with a 13 year old and sat in the area partitioned from glass. We all tried the strombolis, two originals and a beef and cheddar.\n\nBeer was cheap, with $3 Killians on tap. Our food was a little slow getting to us, but there was a wedding reception that day (what a novel idea). \nStrombolis had a nice crusty exterior and tasted great with the sauces they provided: marinara for the originals and barbecue for the BnC. \nI would definitely come again to try out more varieties of strombolis and the pizza."
        }, 
        {
            "index": 283, 
            "rating": 2, 
            "review": "Like others, I went check out the stromboli that Guy Fieri had a foodgasm over. It's okay.  Nothing to write home about. Mostly ham with a little spiced meat. Could use more herbs.  As it stand the stromboli is bland. Not a place you go to for atmosphere."
        }, 
        {
            "index": 284, 
            "rating": 3, 
            "review": "Made it a point to go here knowing that it was on Triple D, with Guy's suggestion to try the stromboli. We ordered the veggie regular-sized and the antipasto salad. Both were pretty eh. I guess you can't expect much at a true dive bar with a smokey mini-casino area to boot. \n\nThe antipasto salad was all ice berg lettuce, canned olives and mushrooms, shredded part-skim mozzarella, celery sticks and pepperoncini. Nothing memorable at all. The stromboli was a little better, but not by much. It had marinara sauce, green bell peppers, onions, olives, mushrooms and cheese. The crust was sorta that oily, crispy dough from pizza hut, which I kinda liked since I haven't had pizza hut in maybe 10+ years. The filling was mediocre. Maybe we woulda done better with a meat-filled stromboli. I'm definitely not impressed."
        }, 
        {
            "index": 285, 
            "rating": 1, 
            "review": "I love the show Triple D as much as the next girl, but Guy owes everyone an apology and refund! LOL \nI ordered the original boli, mushrooms and cheese sticks to go. My boyfriend really gets irritated when we eat somewhere smoky. *and from reading others reviews we didn't miss much as far as customer service. \n\nThe original boli was ummmm not really satisfying. It was crispy in some places and soggy in the rest. We ordered the large (11.00) \nThe cheese sticks were undercooked (5.00), the fried mushrooms were wet (5.00). Super greasy and WET. :( Now i understand why from other peoples reviews, that the mushrooms are canned. :( \nI think i can find better Italian food at fazoli's fast food.\n\nSorry guy this one was thumbs downnnnnnn"
        }, 
        {
            "index": 286, 
            "rating": 1, 
            "review": "The Service is pretty bad!! We never had a chance to try the food.The waitress was not very friendly and couldn't accommodate a group of 8. We offered to to break up the party and she just wasn't interested. So we just left. She is clearly in the wrong business. I'll bet if the owner had been around we would have seen a little more hospitality? place is smokey (cigarettes).\nyea, I would pass on this place.\n\nThe recent recommendation of this establishment needs to be revised."
        }, 
        {
            "index": 287, 
            "rating": 3, 
            "review": "Julius Caesar said \"No one is so brave that he is not disturbed by something unexpected.\"  Expect to be disturbed by your visit to Four Kegs but, if you are brave enough, you will be rewarded with the treasure of Stromboli.  \n\nThe first unexpected/disturbing experience is arriving at the Four Kegs sign you saw from the freeway and discovering an abandoned building next to the sign enclosed in a chain link fence in a scary neighborhood.  Not to worry, the Four Kegs is just on the other side of the parking lot.  There tend to be disturbing (or disturbed) individuals in the parking lot so hurry inside.  \n\nOnce inside, you will be instantly disoriented by the odd shape of the room, an overpowering smell of cigarette smoke, and a dozen or so of the individuals your mother warned you about.  Hang a quick left and go through the glass door by the takeout counter.  You will instantly be comforted by the fresh air and friendly wait staff.    You'll find yourself in another odd shaped dining room reminiscent of Talladega Nights.  Strap on a Ricky Bobby smile and order one of the 4 draft beer choices - thus the name Four Kegs.  Finally order your Strombolli, enjoy your beer, be thankful for the safety of the dining room and plan your eventually escape back through the bar and parking lot.  One thing you will not be disturbed by is the Strombolli - delicious.  Some may be surprised that you will be eating it off of styrofoam plates but at least the utensils are metal.\n\nIn the words of Nelson Mandella, \"I learned that courage was not the absence of fear, but the triumph over it. The brave man is not he who does not feel afraid, but he who conquers that fear.\". I'm guessing Mr. Mandela would be down for a Boli."
        }, 
        {
            "index": 288, 
            "rating": 4, 
            "review": "Pizza was amazing good service! Healthy SHOTS. The bartender was very friendly never uptight like alot can be. My Monday night is complete."
        }, 
        {
            "index": 289, 
            "rating": 1, 
            "review": "We recently moved to Vegas and started looking for good places to eat.  Saw this place on Food Network D, D, & Dives... Decided to tvisit as it was hyped as SOOOOOOO GOOOOOO!!!!  We were SOOOOO DISSAPPOINTED!!!! ordered a large pep pizza, chicken tenders, and chilli fries.  Oh and two beers.  The beer was about the best thing although it was served in a tiny, what appeared to be, the smallest beer mug I have ever seen.  Not worth the money no matter how cold it was.  \n\nThe pizza was bland and most of the pepperoni were burned , the chicken tenders were frozen and deep fried as hard as rocks (no joke, really couldnt cut them with a knife). The chili fries were basic fries from a bag, and chili beans from a can.  Ordered with onions and they came plain.  Simply had no good taste of flair at all.  \n\nWe'll never go back.  Simply a complete waste of money..."
        }, 
        {
            "index": 290, 
            "rating": 3, 
            "review": "The only reason why I give four kegs a 3 star rating is because;\n\n 1. I ordered the fried mushrooms and when I bit into one, it was still frozen in the middle. I'm not a professional chef but I do know you never freeze mushrooms.\n\n2. The waitress did not apologize about the mushrooms. I know it's not her fault but she could have stopped by our table and apologize on behalf of the chef. Also, there was no follow up to check if we have liked the food or if we needed anything else.\nI myself have worked in the restaurant industry for some years so maybe I'm being a bit to harsh but at the end of the day I loved their food and I'll be coming back."
        }, 
        {
            "index": 291, 
            "rating": 5, 
            "review": "This is an update to my previous review.  I've been back to Four Kegs many times. Every time has been excellent. If I keep coming back almost every time I'm  in town and I love the food, they have to be 5 stars!\n\nI ALWAYS get the Stromboli. I've had other things like the Wings, which were excellent. But, I can't not get the Stromboli too .  The Original is my favorite. The crust is always perfect, crisp on the outside, soft on the inside. The filling is bursting with balanced flavor.   I really like the meatball too, but the Original has the most complex flavors. \n\nAnd, the service and people are great. Last time I was in for take-out, I sat at the bar, had a Killian's Irish Red in an ice cold mug, and talked with the owner Mario until my Stromboli was ready. He's a great guy!  \n\nI'll be back. See you in January, Mario!  I'm sure you'll be behind the bar making customers happy."
        }, 
        {
            "index": 292, 
            "rating": 4, 
            "review": "We went to Four Kegs after seeing it on DDD. Guy recommended the stromboli so thats what we ordered, it lived up to the hype. it was fresh and delicious and made from scratch. The beer was cold and our waitress was awesome..It was worth the 10 minute drive from the strip."
        }, 
        {
            "index": 293, 
            "rating": 5, 
            "review": "Very skeptical as we pulled up....was not sure on the area or if it was even safe. Definitely a dive type place.\nBut.......\nAn amazing dive. Good prices, good food, and good service!!!\nThe Sicilian pizza so yummy, fried mac and cheese the bomb, and Stromboli heavenly!!\nKids meal prices are so good too!!\nWe were in Vegas 5 days and ate here twice! \nEven got some Stromboli for the road!\n\nIf ever back in town we will be eating at 4Kegs!!!"
        }, 
        {
            "index": 294, 
            "rating": 5, 
            "review": "this was our last place we ate at while in vegas this time around......and the best!  yes this place is a dive bar, and yes the food is great!  the stromboli is great, pizza and wings as well.  very, very, very great bar pizza! and very good wings too!  all this great tasting food, coupled with cheap beer (shiner bock in vegas!!) and an overall cheap tab, equals perfection in my book! will always go back here.....until they screw it up!!  a hit or miss atmosphere, with them hitting it outta the ball park!! anyone who likes a hometown joint that hasn't changed much, if at all, in the past decades....and is looking for great affordable food (also featured on food network) shall look no further!!   do yourself a fave, and check it out!"
        }, 
        {
            "index": 295, 
            "rating": 5, 
            "review": "This Las Vegas classic has been serving excellent food for over 35 years. The appetizer section of the menu is something to behold. Fried pickles? Check. Breaded cauliflower? Check. Zucchini chips? Yup, they have those too. It looks like a dive bar with bar-top gaming, but don't be bashful - walk right in and pick any table because the service is always excellent and the food is fantastic. The Strombolis are the signature dish and are even on the lunch special every Wednesday. We love to sneak away for a lunch break, or take out-of-towners to a real local Vegas experience, or stop here during a weekend motorcycle ride. Make any excuse you need, just grab some friends and head over to Four Kegs for some of the valley's best food and service."
        }, 
        {
            "index": 296, 
            "rating": 2, 
            "review": "Not so much for me. I don't know why I don't like this place that much it is old dingy and just blah the two times I have tried food here it was nothing to write home about. Come to think of it, I think that a chain restaurant like IHOP would have this place beat. I usually like the places that have been in diners drive ins and dives but this one is a total failure."
        }, 
        {
            "index": 297, 
            "rating": 4, 
            "review": "Best Stromboli in Vegas.  Always friendly service.  Mario the owner usually there and does an outstanding job taking care of his guests.  The crust for both Stromboli and pizza is outstanding."
        }, 
        {
            "index": 298, 
            "rating": 5, 
            "review": "Best stromboli in Vegas period. Eat there if you haven't already. Beers come in goblets and their pizza is nothing short of excellent."
        }, 
        {
            "index": 299, 
            "rating": 5, 
            "review": "This is always the first place we go when we get to Vegas! You've gotta love the strombolli! Nothing beats the atmosphere at the Four Kegs!"
        }, 
        {
            "index": 300, 
            "rating": 5, 
            "review": "Best place to eat in Vegas. Whenever we visit Vegas the first place we go to is the Four Kegs. Great food. Neighborhood is getting a little rough but they have the best Stromboli I ever ate. Bartenders are hardworking and friendly."
        }, 
        {
            "index": 301, 
            "rating": 2, 
            "review": "I was recommended here by a co-worker i was told it was very good i usually would never be caught in a place like this but i figured id have an open mind and try it out since it has such great reviews and i was recommended..... when i arrived i was immediately given a bad taste in my mouth as they gave my 3yr old son used crayons all that was going on in my head is really who's kids mouths have those crayons been in and your giving my son that crayon.....then our menus had rips all over them then i thought for a place that was on food network they couldn't at least renovate the menus or get new 3pc packaged crayons.....the food was pretty good but i just don't think i could return to a place that seems to not really care about the overall guest experience regardless of the food. i gave it a 2 star solely based on the food I will not knock the servers they were all good smiles and good refills just the over all environment is a big hole in the wall not to pleasant to be in or around....."
        }, 
        {
            "index": 302, 
            "rating": 4, 
            "review": "Divey sports bar with awesome Philly steak sandwiches and Stromboli.  Greasy, delicious messy goodness.  It's a no frills bar with the restaurant in the back.  Huge sandwiches overflowing with gooey artery clogging yumminess.  Lots of thinly sliced steak on my Philly sandwich.  My mom got the Italian Stromboli and took half home (I ate it for her later lol).  I hear the Sicilian style pizza is great so that's on my list for next time."
        }, 
        {
            "index": 303, 
            "rating": 3, 
            "review": "I can't think of a more Americanized version of an Italian dish than stromboli, so it is only appropriate that the Four Kegs, a humble sports bar, would have the best version in Vegas. After hearing about these strombolis on one of our favorite Food Network shows, 'Diners, Drive-ins, and Dives,' my husband and I decided to visit this hole in the wall. Upon entering this particular dive we were shocked at the popularity, but upon discovering that draft beer was only $2.50/pint we immediately solved the first part of the puzzle.\n\nNext came the salad ($1.75). It was a watery mess of iceberg and iceberg, which was so bad I couldn't bring myself to finish it (and I always finish my salad). At least it was fresh? At this point, we were hoping that something redeeming could come out of the kitchen. We were then hit with the Cajun fries ($2.95), which, seeing how there was nothing Cajun about them, should have been described as vegetarian chicken wings. I love Frank's Red Hot and ranch dressing just as much as the next Mid-Westerner (I feel I can pass judgement on the use of these ingredients because my husband is from Missouri and I've spent ample time perfecting my Velveeta cheese dip making abilities) but soggy fries just don't cut the mustard.\n\nFinally the stromboli ($8.49) arrived. Stroboli, believe it or not, is also the name of an island off the coast of Sicily, which is a noteworthy place because of its continuous and patterned volcanic eruptions over the last 20,000 years. The stromboli at the Four Kegs isn't quite as miraculous, but was an explosion of tastiness nonetheless. The exterior was crispy and browned, and the filling was appropriately cheesy, meaty, and saucy. Is it hard to make something taste good with these components? Not really, but the expertly constructed crust and price makes this dish a winner. The technique of Mario is to be commended, because he is able to thoroughly cook every bit of the crust without burning it  or leaving a trace of doughiness. This is a feat most bakers in the States would have a hard time accomplishing. We only finished half of it, but I give it a solid thumbs up.\n\nOverall, I will label the Four Kegs as a cheap place to get a filling and above average meal, but stick with the Stromboli and beer. I promise you'll leave happy if you follow those words of advice."
        }, 
        {
            "index": 304, 
            "rating": 2, 
            "review": "Just say NO!  While the server was nice and polite the food was horrible. Gave it two stars instead of one because the waitress was nice. Maybe it's \"good\" when you are on a moderate to heavy state of lubrication. The boli came out and the cheese was not melted and the dough was doughy. Sent it back and they just threw it under the salamander, which if you know how these work, it basically burned the top and didn't really do anything else, like solve the problem of unmelted cheese and uncooked dough. Ordered a side of ranch to help choke it down and they charged $0.50. That in and of itself is perry. Since the boli didn't come with marinara the least they can do is not charge for the ranch unless I'm asking for 20 of them or something. I now remember why I haven't been here for a couple years. I wish yelp would have a personal memo section for restaurants so I can make notes for places I like and dislike."
        }, 
        {
            "index": 305, 
            "rating": 5, 
            "review": "I was in town for a 2 day golf tourney ( i Won!!)and  i had to try a good place out. I took my parents and aunt here and we split an original stromboli and a meatball stromboli. Meatball is my favorite and i dont really care for the cold cut strombolis but this cold cut or orginal sromboli was great but of course i thought the meatball was better. I could eat that everyday. Great service. Dont let the outside of the building fool you or the people you bring. just tell them to trust you. I will go back everytime im in Vegas."
        }, 
        {
            "index": 306, 
            "rating": 5, 
            "review": "You no how you watch cartoons or movies growing up and the characters eating pizza with stringy cheese oozing everywere!!?? Omg well i found that here for the first time! The chili cheese fries are great too..and the workers are always very kind..."
        }, 
        {
            "index": 307, 
            "rating": 3, 
            "review": "We saw this place on Diner's Drive-Ins & Dives long time ago and have lived in Vegas 3 years now. We saw the triple D episode for this place again a few day's before New Year's 2011 and decided to go on New Year's Eve Eve.....big mistake since it was just on TV and it was the night before a holiday. Being that we never been we didn't know how everything worked, like seat yourself. We finally found a table (we were told the place had been busy since 11am and here it was 5:30pm) waited about 20 minute's just for someone to come get our drink order. There was only 2 waitress' working and you could tell they were not used to it being as busy as it was. We finally ordered our food and it took a hour to get our food. Good thing they gave us cracker's to munch on while we waited. \nWe ordered a large original Stromboli, basket of fries and salad to share between myself, my husband, our 3 year old daughter and my mother in law. It was enough for all of us and had a slice of Stromboli and fries left over to bring home. To be honest it didn't WHOA us and it wasn't horrible but hard to say if we were just so starved from waiting that we didn't care. \nNext to us was our waitress' family and they informed us that it's never that crazy and doesn't take so long to get food. We might go back to try them again before we move this summer to another state to really say if the food was good or if we were just so STARVED that anything tasted good. \nBeing the situation at hand is why I gave 3 stars. If it hadn't just aired right before a holiday and it was this crazy busy and under staffed I would have only given 1 star but since it was this way in hope's I gave them the benefit of the doubt."
        }, 
        {
            "index": 308, 
            "rating": 4, 
            "review": "A great spot that is away from the strip. This place used to have 2 locations but one of them closed. This place has gotten really popular due to being on Diners Drive Ins and Dives. Does it live up to the hype? Absolutely. \n\nThey are known for the Stromboli here. I cant recommend these things enough. They are cooked to perfection and have a great flavor and some amazing crust. I like the Original Boli but my wife loves the Meatball Boli. So we always get two smalls and split them up. Meatball is actually starting to become my fav but again both are really good. \n\nThe fried mac and cheese here is another staple that we get. Pair those with a ice cold Killians Irish Red and you got a great meal on your hands. The prices here are really reasonable and the portions are great. There wings are decent but I'm kinda of a wing snob....so I'm tough to please. \n\nIf you wanna get away from the madness of the strip and enjoy some great food and some good beers with a nice local feel. Get to Four Kegs. One thing I will warn you about is that if UNLV is playing this place can get packed. Next time I go I think I am gonna try the pizza. Get in here throw some money into a machine order a ice cold beer and relax....CHEERS"
        }, 
        {
            "index": 309, 
            "rating": 4, 
            "review": "I would give this place 4.5 stars but that's not an option.\n\nFew things you should know. When I first started going here, I asked \"When does the kitchen close?\" \"Christmas!\" was the reply. So get your grub on here 24/7. 364 days a year. I've read some comments about the smell when you walk in... It smells like smoke, beer and floor cleaner... Up front. In the dining room, it nice and clean. The bar is partitioned from the restaurant to allow smoking. There is a second entrance to the right if you want to avoid the bar all together.\n\nNow, I won't knit-pick the menu. It's all pretty good taken in perspective. The Stromboli is aces, especially after a few beers. I like to get the chicken nachos at the bar sometimes. You cant complain about the portion size on those nachos. Burgers are pretty good too. Only odd thing is they put red wine in the blue cheese dressing and some servings have a little more wine then others. I'd rather just have plain old blue cheese.\n\nI have literally sat at the bar for several hours with 2 or 3 friends. Eaten, had 3 or 4 drinks a piece and been handed a bill for under $60.00... Beat that.\n\nOkay, here's the hipster deterrent portion of my review. No valet, no PBR (I don't think) no hookah bar, no safe space or trigger warning alert system. Just a decent little local public house that is chill and affordable."
        }, 
        {
            "index": 310, 
            "rating": 4, 
            "review": "Great service, food, and prices. Why not 5 stars? Too much smoke in a small environment. Cleanliness could be better, however, not the worst. Great spot for food after midnight.\n\nTip: A nice tip goes along way here."
        }, 
        {
            "index": 311, 
            "rating": 4, 
            "review": "Very small bar. The Bud Light on tap was ice cold and the bartender was friendly and introduced himself as Rich. I had the Original Stromboli since this place is known for it and it was AMAZING! I will definitely be back, again!"
        }, 
        {
            "index": 312, 
            "rating": 3, 
            "review": "Went to Four Kegs after I saw it on Triple D.  Was a dive, but the Stromboli sandwich was very good.  I had the small sandwich and couldn't eat it all.  Good value for what you pay.  Atmosphere wise, there's nothing to write home about.  I'd go again though, just to try other menu items!"
        }, 
        {
            "index": 313, 
            "rating": 5, 
            "review": "As good as it gets for comfort food!\n\nThis was one of the first Diners, Drive-Ins & Dives places we went to and we are glad we did.  It's a bit of a trek from the strip if you are visiting, but if you have a car (or don't mind an expensive cab ride), it's well worth it.  Definitely get the pizza or stromboli; it's cheesy goodness all the way.  And the ambience...well it's no Mastro's, but that's what I loved: it was exactly what you would expect a Vegas sports bar to be."
        }, 
        {
            "index": 314, 
            "rating": 5, 
            "review": "Been coming here since 1977. The Wings and Stromboli are the best on the planet! Mario and Team are tremendous."
        }, 
        {
            "index": 315, 
            "rating": 3, 
            "review": "Went here because of DDD. Definitely a hole in the wall. I would recommend this place if you are hungry and thirsty. I imagine their drinks are very strong. The food though is definitely bar fair, so do not come here expecting a culinary adventure. If you come here starved then the food and portions will definitely satisfy.\n\nI ordered the Boli like I was supposed to, ordered the turkey and cheese one. I was a little disappointed because although the dough was delicious the filling of just cheese and turkey did not satisfy me...maybe some spinach or something?"
        }, 
        {
            "index": 316, 
            "rating": 2, 
            "review": "We went here after watching Guy Fieri's show on the Food Network and came specifically for the stromboli.\n\nWhen we got there, there was 1 waitress managing the whole restaurant...after waiting about 10 minutes (after being seated), we were given menus and a  different waitress who goes by the nickname \"Hot Rod\" took our orders.  1 small stromboli and 1 antipasto salad please.  2 waters.  Not that difficult, right?\n\nNot only did she get our order wrong, but she FORGOT TO PUT IT IN.  We waited about 45 minutes and when we asked about our order the other waitress checked on it and said, \"I'm SO sorry...we'll get that right out.\"  Hot Rod walks by 5 minutes later and asks, \"Did I take your order?  Where are y'all from?\"  I'm thinking...didn't we have this conversation AN HOUR AGO?  We were given saltines and croutons about 50 minutes after being seated...we were so hungry we chomped on packets of saltines to whet our appetites.  How sad is that?\n\nIf it weren't for the incompetent wait staff, I'd go back a second time when I'm in Vegas.  The stromboli was delicious (even though she brought out the wrong size) and the salad was nothing to boast about, though the portion was large."
        }, 
        {
            "index": 317, 
            "rating": 4, 
            "review": "Service was good, pie was too- we had half pep- half ham pizza & , fries  they were cooked good as well & the beer is very cold. It is a good pizza/wing joint to. Lots of local UNLV crowd which is good."
        }, 
        {
            "index": 318, 
            "rating": 4, 
            "review": "After hearing about this place from a friend and DDD, I finally went there to check it out! needless to say, it is a pizza joint in a bar or vice versa! Let's get that straight, it is not going to be the cleanest, fanciest, nor is it going to appeal everybody! What it lacks in these things, is the character of the bar and FOOD! \n\nLike everybody says, the Stromboli here is one of the better ones around! Even better is that it's 50% off after midnight! Beers are ice cold! The Boli's are hot, crispy, flavorful! And the staff is pretty cool! \n\nThe downside is, it is in BFE in terms of people who don't live around in immediate area! But oh well! A small price to pay for a damn good Stromboli! \n\nCheers!"
        }, 
        {
            "index": 319, 
            "rating": 1, 
            "review": "COME ON PEOPLE! SERIOUSLY? This place is mediocre at it's very best. Have any of you actually had a stromboli before? Don't get me wrong, I love a good dive bar but I would NEVER call this a sweet dive bar. If I could give it 1 1/2 stars I might but I couldn't bring myself around to giving this 2 stars. Maybe if the bar was cool I may be a bit more generous but the bar's a dump, the dining area's a dump and the food sucks. Here's my story..,\n\nYes, Vegas, baby, indeed. I LOVE eating at nice places but I make shit money, so after eating at a couple more expensive places my gf and I found this place that Guy 'The Tool' Fierio or whatever his name is featured on Diners, Drive-ins and Dives... WHY? Did he pick this out of a hat? I imagine it wasn't his decision but who the hell's decision was it?\n\nWe decided to sit in the trashy dining area because the bar was full of dirty old men. I couldn't decide between the meatball boli or the classic boli so I asked if I could get a side of meatballs. They don't do that. I have no idea why. I want to buy more things from you but I can't because it's not on the menu. You have meatballs but I can't buy them unless they're in a stromboli. Whatever. I'll go with the classic and I will live to fight another day. My sexy ass, hot chihauha momma got a club sandy with fries and we got stuffed jalepeno poppers. After 15 mins we started to wonder if our poppers fell victim to an incompetent waitress. She was nice but brought out 'entrees' out after 20 mins then told us that she didn't remember that we ordered poppers. Oh...there they are...sitting in the window. At least we got them, I guess?\n\nMy gf's fries were cold, the meat in her sandy was dry and the poppers were whatever. I took one bite of my boli and asked for a box. It was piss poor. They cut it weird, the bread was hard, not crispy but hard for some reason, the cheese was.., weird? And the marinara was bland and tasteless. We packed it up, left a couple bucks tip and headed east to try Lotus of Siam. We're literally waiting in the parking lot for them to open now so we can get a real meal. Review to come. Stay tuned you fat ol' fattys."
        }, 
        {
            "index": 320, 
            "rating": 3, 
            "review": "$20 will get you a small Stromboli and an order of hot wings- enough for one with a few leftovers or for two who aren't really hungry. \n\n'Boli is okay- surprised this made Triple D, but considering it's inside of a bar, quality and flavor are a lot better than expected. Wings were ordered hot but tasted mild, didn't like that the side of ranch was oddly chunky and inside the takeout box, which made it warm and more unappealing.\n\nService was quick. Order by phone, ready in 15 minutes, take your order receipt to the bar to pay, any tip you leave on card is given to you cash to take directly to kitchen staff when you pick up your meal.\n\nI don't think I've had better food in a dive casino, and appreciate that they're open and take phone-in orders 24/7, but this isn't a place I'm likely to seek out."
        }, 
        {
            "index": 321, 
            "rating": 3, 
            "review": "Come on Monday & you won't have a wait. It was what Guy Fieri used to do... DINERS, DRIVE INS & DIVES. Nothing foo foo here. Just a good Boli. Get the original & enjoy!"
        }, 
        {
            "index": 322, 
            "rating": 5, 
            "review": "As a party of 8, we strolled in about 2:00 pm on A Wednesday. We were seated right away and of course ordered two large Strombolis and two orders of wings which was shared between five of us. Three members of our party had a Red Neck Turkey burger and a Philly Cheese Steak sandwich, one had the Nachos,All of which were off the hook! You gotta try the Shiner Bock beer in their frosted glass which makes it a plus. All for less than $90.00! We will definitely be back!"
        }, 
        {
            "index": 323, 
            "rating": 5, 
            "review": "Yummy - Yummy - Yummy! \nI come for the fried pickle spears. Almost as good as Aunt Gloria's back home in Alabama. The stromboli is too yummy as well."
        }, 
        {
            "index": 324, 
            "rating": 4, 
            "review": "It was our last day in Vegas and we decided to come here before heading back to Orange County.  \n\nThis place is pretty dive-y, but it's clean and the bathrooms are super clean.  A+ for that!\n\nOur server was so attentive and sweet, and she didn't charge for the coke my girlfriend ordered.\n\nIt took a while for our stromboli to come out!  Must have been 20-30 minutes and it wasn't crowded at all.  \n\nThe stromboli definitely lives up to its rave reviews.  My girlfriend ordered the Veggie Boli and it was equally delicious.  She loved the bread. \n\nMinus one star because I thought $9 for a small stromboli was a little steep.  Aren't dives supposed to be dirt cheap?\n\nNevertheless, I'm sure I will go back there whenever I'm in Vegas again."
        }, 
        {
            "index": 325, 
            "rating": 4, 
            "review": "My cousin found out about this place on Guy Fieri's show.  This place is about 10 miles from the Strip in a very random place off the freeway.  First of all, the Stromboli's are off the hook.  I didn't get the chance to try anything else since our party mostly got the Original Stromboli because that's what it's known for.  Next time, I'm sure i'll have more of a variety The small is still pretty big so I don't know how someone can finish a large.  I should have ordered some of the buffalo wings because when the waitress was passing by with a tray of wings to serve to another table, my mouth started to water.  \n\nI don't think they see too many minorities because when we walked in, all the patrons looked up and stared.  What's worse was that the final game of the Little League World Series (Chula Vista, CA vs. Taiwan) was playing on the projector and they might have thought we were going to route against the US.  But once we started cheering for Chula Vista, they warmed up to us, haha."
        }, 
        {
            "index": 326, 
            "rating": 4, 
            "review": "Fast, friendly service. Food was pretty good. Down home, Mom n Pops kind of feel. I absolutely loved the Phili cheese steak sanwhich! We also ordered th spiganoli, the steak sandwhich, and th mac n cheese appetizer. We heard about this place on Dinners, Drivins n Dives. This place lived up to yummy!"
        }, 
        {
            "index": 327, 
            "rating": 3, 
            "review": "My fiance and I ate here for the first time last night, and it was really good! I had the Original Stromboli, and my fiance had the Combo Boli (ham, turkey and Swiss). She liked hers more than I liked mine, but that's probably because I ordered a large and couldn't finish it!  LOL  We had their Italian Spumoni Cheesecake for dessert, and that was decadent! Easily one of the Top 10 desserts I've ever had! We showed up after midnight, so the bolis were half price! Can't beat a deal like that!"
        }, 
        {
            "index": 328, 
            "rating": 4, 
            "review": "A group of us were in Las Vegas for a convention earlier this week, and nine of us took a cab ride from Mandalay Bay to 4 Kegs for lunch (10 minute ride - about $40).  I sampled stromboli, deep dish pizza, and chicken tenders.  The stromboli is deserving of its stellar reputation - it certainly stood out as a fantastic dish!  The deep dish pizza and chicken tenders were also very good.  The food is definitely 5-star, but the ambience is only 3-star, so I give it a total of 4 stars."
        }, 
        {
            "index": 329, 
            "rating": 1, 
            "review": "Yuck. Did not enjoy it here AT ALL. My Stromboli came with canned mushrooms instead of fresh and the onions tasted rancid. Our fried macaroni and cheese appetizer came out still frozen in the center. The waitress asked if we would like marinara to accompany our strombolis without bothering to mention they were an additional cost each. I would NEVER come back here."
        }, 
        {
            "index": 330, 
            "rating": 4, 
            "review": "Getting late night snack on..always order a 1/2 off 7item Sicilian pizza no onions...tonight included chicken wings and fries...decent service not your buffalo wild wings or pizza hut. Its great value and good bar food. Unlimited soft drinks. Ranch dressing homemade and works with fries and wings. Stromboli is good I heard.  Only been coming here for a year. My friend got me hooked."
        }, 
        {
            "index": 331, 
            "rating": 5, 
            "review": "Awesome food nothing like I expected! 1/2 price pizza after midnight. Service is great!"
        }, 
        {
            "index": 332, 
            "rating": 3, 
            "review": "Go here! Try the stromboli, its fantastic.. Get a cheap beer to wash it down.. Order nothing else... run out  the door and get some fresh air.. \nDive bar is the better description.  Sports bar?? Maybe in the 80's but this place hasnt upgraded to what we now call a sports bar..  Service was slow and misdirected (clueless, but caring people) and wrong two times. Marinara dipping sauce was added to the bill with out asking if we wanted it.. (you \"have to\" have it by the way) but some at our table dont like marinara so that was a little surprise.  Bolted down rock hard booths and chairs had that old strip club feel to it.. Impressive?? Not in the least.. return visit??  Take out only for one item only...  Good food??  only one impressive item   Your call.. it served my purpose"
        }, 
        {
            "index": 333, 
            "rating": 4, 
            "review": "What can say, I saw this place on TV and it lived up to the hype.  The place is in strip mall and it is a little dumpy, but that's part of the charm.  \n\nI went to watch a game and ate the Stromboli and drank beers.  The best boli I have ever had.  \n\nKeep it simple, go in, watch a game, drink and eat Stromboli.  \n\nOne of all time favorite dives.  Enjoy\n\nThanks"
        }, 
        {
            "index": 334, 
            "rating": 3, 
            "review": "I have lived in Las Vegas for 15 years and have been to Four Kegs countless times, but this is the first time that I can remember ordering anything other than stromboli.\n\n(Back story: We planned to go to lunch at Triple Play, which had the best club sandwich in town, but when we pulled up, IT WAS CLOSED! Like, fencing around the perimeter closed! I am still reeling over it...)\n\nThat said, my heart was set on a club sandwich, so we headed over to Four Kegs, which is not too far away. Pretty crowded for a Friday afternoon, and it seemed like a good mix of locals and tourists, the latter of whom were all dining on the aforementioned stromboli. After ordering our usual beverages (Killian's for him, Shiner Bock for me -- both ice cold on tap), we took a look at the rest of the menu.\n\nMy husband had the daily special, fish and chips, which was not much more than three frozen filets dropped in the deep fryer along with a side of fries. Nothing to write home (or here) about. \n\nI, of course, had the club sandwich. Although it's unfair to compare this club with the heavenly (and now defunct) club from Triple Play, this still wasn't quite what I had envisioned. All the usual suspects were there -- ham, turkey, cheese, lettuce, and tomato on rye -- but the bread wasn't toasted, it was cut in half (instead of quartered), and there were only two pieces of bread instead of the traditional (IMHO) three. Don't get me wrong; this was still a tasty sandwich. And I may be knocking it down a grade because I am still in mourning for my Triple Play fave. But while I will now be on the lookout for a place with a great club sandwich, I already know that THIS is the place for a great stromboli. And that's what we'll both be ordering next time. (My tip on that: Order one original and one beef/cheddar, and split them.)"
        }, 
        {
            "index": 335, 
            "rating": 3, 
            "review": "This bar and restaurant is located in a seedy area of Las Vegas. (OK, most of Vegas is seedy...but in comparison this is seedier.) The building is rundown just like the neighborhood. As you enter, you walk into the bar. The \"dining room\" is in the back. It looks tired. Again, that's the feeling of the neighborhood. Everything is worn and past its prime...and its prime wasn't so good either. The wait staff are ladies who have probably been working for 40 years or more. They are efficient and friendly, and I'm sure they have seen and heard it all. The food is simple but good. My friend and I had stromboli. They were good and I'd say worth the trip from the strip."
        }, 
        {
            "index": 336, 
            "rating": 5, 
            "review": "I was in town for UFC 200 and saw \"Four Kegs\" on a recent episode of \"Dana White Looking For a Fight\" so I thought it'd be fitting to check it out.  I'd never had a Stromboli before, but do to all the rave reviews online I made sure to order the Original Stromboli with a marinara dipping sauce and a side salad.  It was great!  It wasn't too greasy but was packed with various meats (salami, ham, sausage, pepperoni, etc). Our waitress was very friendly and the prices were very low for the quality of the food we were receiving.  I'll be back!"
        }, 
        {
            "index": 337, 
            "rating": 5, 
            "review": "The best stromboli I've ever had. Period. I've been going here for years and I can't get enough of the stromboli. I think it's the dough that sets it apart from every other stromboli.\n\nThe best deal is when you get the stromboli with a Wednesday lunch special. For $7.99 you get a small stromboli, french fries, and a drink. A small stromboli by itself is usually $9.49, so the lunch special is a steal."
        }, 
        {
            "index": 338, 
            "rating": 3, 
            "review": "Environment was ok. Dining area was very tight and table was sticky. Waitress didn't write our order down and came back to the table 3 times to repeat the order. Then we had to call her back to get refills on our drinks. Booths need to be re cushioned they were really worn out."
        }, 
        {
            "index": 339, 
            "rating": 3, 
            "review": "Food is good, nothing to complain about that but decor is very outdated.   I have a feeling if they remodeled the place they would get more buisness."
        }, 
        {
            "index": 340, 
            "rating": 5, 
            "review": "Really friendly staff, good drinks and food. Good prices. Mario set up a soccer game for us in the big screen after we had searched everywhere to watch it.\n\nDefinitely worth a visit if you wanna find an honest local bar, without all the pose of the Strip."
        }, 
        {
            "index": 341, 
            "rating": 3, 
            "review": "Definitely don't judge a book by its cover - and don't judge this shithole by the people who frequent here. Sketchy people drink here. I don't know what rock these people crawled out from under. Many (not all) are nasty looking with stained clothing and missing teeth. But friendly, really friendly, so if you can get past their appearance you'll be fine.\n\nUpon entering Four Kegs you walk into a dingy bar, and entering another set of doors leads you to a dining room straight out of the 70's (or maybe 60's, what do I know?). It's separate from the bar so you can bring kids in here. The furniture is old and rickety, booths need to be reupholstered and this place definitely needs a facelift. Hell it's probably been around longer than most of you reading this have been alive. \n\nThe food - typical bar menu with lots of fried food, finger foods, burgers and sandwiches. Over the years, our kids have ordered pretty much everything off the menu, including breakfast, Overall the food is very average - nothing spectacular.\n\nThe crown jewel of this shithole is their Stromboli and square Sicilian pizza. The pizza isn't the best, but I think it's a step above the chains. I really like the crust, which compares to the crust at BJ's or Numero Uno. Not as good, but trying to be.  I'd take this over a pizza hut any day, but Broadway Pizza is way better. I've been eating it for almost 20 years now and it hasn't changed one bit. \n\nPapa D has been eating the Stromboli here for over 30 years and swears by them. Actually I believe this was one of his hangouts in the 70's! I don't think it's all that, but he loves it so I go to keep him happy. I prefer the pizza. \n\nYou'll always have lunch available the next day as the portions are huge - the small stromboli is big enough for two people.\n\nDiner Beware - this place is a DIVE. I've been eating here for 20 years, I'm a fan,  and yet I still cringe when I walk in the door."
        }, 
        {
            "index": 342, 
            "rating": 5, 
            "review": "This is the second time I've been here. The first time my dad wanted to come because he's a huge Diners Drive-Ins & Dives fan. \nIt was good the first time and just he same the second go around. \nIt's a great dive bar/Italian restaurant outside the Vegas strip. \nFunny thing was we sat besides a group of people from the same area of Ohio as myself. \nThis time I had a straight cheese pizza and it was awesome! Thick style served on a wooden pan. \nThe server was great as well. \n\nSitting here for a few minutes you see right away they have a lot of regulars cause it seems everyone knows each other. I think that a good trait for a place like this cause it feels like home. A great Italian home!"
        }, 
        {
            "index": 343, 
            "rating": 4, 
            "review": "Yes it is definite dive! But just a short freeway drive from the Strip and worth it! Seriously yummy! Stromboli Golden brown tender crispy bread on the outside cheesy, tasty, meaty, saucy on the inside! Daughter had the ribs, nothing left when she was done. Coleslaw was fine nothing to rave about."
        }, 
        {
            "index": 344, 
            "rating": 4, 
            "review": "This place is a total dive but who cares, the Stromboli is awesome. Don't mess with it, just get the original full order, after 12 midnight it's half price which great when your out and about in Vegas. Highly recommended\nIGNORE some of these reviews, from the outside this place looks bunk and yes the inside needs a remodel ASAP, but the foodworks. Good service and great food."
        }, 
        {
            "index": 345, 
            "rating": 4, 
            "review": "after bragging about this place and hyping it up, my brother wanted to come here since we and give it a try.  we ordered the a boli and that was as good as ever....i recently had a stromboli at don antonios, and it just wasnt up to par with Four Kegs. its is soooo baked here.  not doughy or undercooked..its the way its meant to be eaten. And we had kids with us.  i was surprised when the waitress (same as before), gave the kids menus with a cup of crayons, and a 20 questions game...FUN!  the kids had more fun with their simple, color the picture, tic tac toe menu here than they do at places like i hop, olive garden, etc.  those menus are BUSY beyond recognition, if you ask me.\n\nwe did order other things, but i have to warn  you that the appetizer of that day were scallop skewers.  please pass on that.  it was ok, but evidently this isnt the place for seafood. \n\nand i came here the same time i did as my other visit, only a different day, but the prices were not half off..can someone PLEASE clarify when the happy hour is...well, maybe ill just call and ask myself. \n\nso with the minor scallop debacle, i still rate this 4 star..."
        }, 
        {
            "index": 346, 
            "rating": 5, 
            "review": "As you're driving by, and see this place, you're probably thinking, \"This looks like a dump. I'm not eating here.\" Well, don't judge a restaurant by it's exterior. Come in, walk all the way towards the back. That's the \"restaurant\" area. Towards the front is the bar.\n\nThere's really one thing worth getting, and it's the stromboli, as featured on Diners, Drive-Ins, and Dives. You may be thinking, \"Isn't that just like a Hot Pocket?\" Shut your mouth, because you are WRONG. These strombolis are amazing. Perfectly crispy crust, and flavorful delicious filling of cheese, meats, and veggies. Every time I go to Vegas, this is my go-to place."
        }, 
        {
            "index": 347, 
            "rating": 3, 
            "review": "Ordered the calzone it was very tasty.  The beers were ice cold.  Not a bad place to go and watch a game."
        }, 
        {
            "index": 348, 
            "rating": 5, 
            "review": "What to say about Four Kegs that Guy Fieri from Food Network and everyone else hasn't lol. Its a cool little hole in the wall bar. Its pretty laid back and jamming with people. When you go in, you have to walk around through glass doors and back around the bar to get to the little dining room. The decorations is typical bar trend, and kinda ghetto Its what makes it shine. The menu has a vast array of appetizers and sandwiches, and entrees. We had to go in for the \"Boli\" which what they are famous for. They even have vegetarian Boli for the non meat eaters. We went for the Original and it was off the GOT DAMN CHAIN!!! The crust was light, crispy, and absolutely delicious. I never had a crust like that. Crispy, and just salty enough. The sauce inside was outstanding. Just the perfect amount and not over flowing so you can pick it up. The cheese was fresh and tangy and the Salami, ham, and suasage were just flavor explosions. Also we had the wings. Crispy and sauced just right. The sauce had the right balance of heat and buttery goodness, Also weren't drenched in the sauce so it was easier to eat. All the food looked great, as we were watching the crowded dining room get served. SO many things to try so you won't be dissapointed. They definetly have something for everyone. Can't wait to go again with the homies and have a a few drinks and some outstanding food. Until next time, Let's Eat!!"
        }, 
        {
            "index": 349, 
            "rating": 3, 
            "review": "I know it's all about the stromboli here, but we were following a hot tip on hot wings from a  man who declared wings his favorite food. You've got to follow a tip of that caliber, right?\n\nFrom the moment you walk in, it is clear that this place is a Vegas institution, the grandmama of video poker joints. Everyone appears to know everyone else. When we arrived, they were all coordinating a trip to Calico Jack's to see one of their regulars perform karaoke. Now, that's family. \n\nThey have a separate area for non-smokers and kids, which thrilled me, as I had entered expecting to leave laden with smoke. The non-smoking room features a huge screen for watching a game. We were greeted promptly, and service was friendly and attentive during our entire wing trip.\n\nWe ordered the fried veggie basket and an order of spicy BBQ wings, and neither were particularly noteworthy. The veggies were deeply breaded and served with ranch and a spicy honey mustard. The wings were big. I'll give them that, but the meat was not super tender. I also didn't love the sauce. \n\nBased on my experience, I would echo the oft repeated sentiment in other reviews: stick with beer and stromboli!"
        }, 
        {
            "index": 350, 
            "rating": 5, 
            "review": "We came here after seeing it on triple D. The food and service was awesome! We had a Stromboli and a meatball sub. Both has amazing flavor and were relatively cheap. The two of us ate with an appetizer for and beer for 25 bucks. Also, we took home left overs. The place is a definite dive bar, but well worth the 10 minute drive off the strip."
        }, 
        {
            "index": 351, 
            "rating": 4, 
            "review": "Great \"Old Vegas\" restaurant .  A total dice with excellent food and service. We loved it!"
        }, 
        {
            "index": 352, 
            "rating": 4, 
            "review": "Like most others we saw this place on Triple D and had to check it out. Unfortunately we thought the abandoned building under the sign by Summerlin Pkwy was it so we thought it was closed for about a year....but it's not! It's actually around the side on Jones. Anyways...the Stromboli was off the hook!!! It was so good we ordered another to go!!! Ok so the place could definitely use a remodel, but we have no problem stopping in for a 'Boli. We went around 1100 AM on a Friday and there was only a couple other tables in use."
        }, 
        {
            "index": 353, 
            "rating": 5, 
            "review": "I love this place. I found this little gem years ago during my partying stage. And I've always come back. The stromboli's are amazing. The customer is always good and I will always come here when I'm visiting for one of my meals. Hands down, no question. See y'all next time!!"
        }, 
        {
            "index": 354, 
            "rating": 5, 
            "review": "4 &1/2 stars for this great dive. We drove up from San Diego and got here at 1am and by then, we had to push a buzzer for them to open the door- a little ghetto. The Stromboli and the pizza was soo good, but minus 1/2 a star for the waitress who wouldn't leave us alone and who was hovering on top of me as I was trying to figure out how much to tip her. Pizza and strombolis were half price when we were there, so it was cheap!"
        }, 
        {
            "index": 355, 
            "rating": 3, 
            "review": "I admit it.....came here because of diners drive in & dives.......this is the 3rd DDD place I've been toon Vegas.......Imbeginning to think that Guy Fieri is too easily excitable. Don't get me wrong, the Stromboli was very good.......I just have to temper my review with other factors:\n\n1) you have to walk through a smokey bar to get to the dining room.\n\n2) definitely wouldn't want to be in this neighborhood at night.\n\n3) $9 for a small = really pushing it\n\n\nI enjoyed my meal, but given the other factors, I probably doubt I'd return. I'll just go get a pizza which would scratch the same craving."
        }, 
        {
            "index": 356, 
            "rating": 5, 
            "review": "WHAT A  DIVE !!! exactly what I was looking for !!  The waitress was fun and the food was good. The strombolis are the star of the menu but the mac and cheese wedges are the ultimate white trash gold, a MUST HAVE. Cant wait to go back"
        }, 
        {
            "index": 357, 
            "rating": 3, 
            "review": "This is the second time I have been to Four Kegs. Both times I have went the food has been great. I have had the Stromboli both times. I will always try to make a stop here when I am in Vegas. Can't say much for the service. The 1st time it was mediocre and the second time not so great either. I will say the second time I went was late night.(after 1am).  I didn't realize you could still sit in the restaurant area still. My fault. We sat in the bar area which reeks of smoke. (side not they have 1/2 price specials after midnight) During my meal the bartender lights up right in front of me smoking up the air around me. I love the food here but the service is spotty. This is definitely a local dive. Almost everything here screams we liked the 70's and we are staying there. I would recommend this if you are in Vegas and trying to find great Italian and not wanting to do the tourist thing. This is definitely a locals secret. If you are hoping for a nice place to eat. I wouldn't stop here. If you are looking for quality food and don't care about the ambiance. I would say this is a most. Three stars only for service but 4 stars for the food. That's how it averages out. I say get of the strip and go get you a boli at Four Kegs."
        }, 
        {
            "index": 358, 
            "rating": 4, 
            "review": "so I heard this is where guy went to on one of his shows. we checks it out bc a friend told us they have the best Stromboli's in Vegas. we got the traditional with sausage and red sauce and then a ham and cheese. I normally don't like ham and cheese at restaurants but hot damn I'm coming back for more, they give you a side of bbq sauce with it, which just completes the whole Stromboli. def coming back to try other ones."
        }, 
        {
            "index": 359, 
            "rating": 5, 
            "review": "what can i say other than i LOVE four kegs!! after seeing them on diners, drive ins, and dives we had to check it out for ourselves. my boyfriend and i always split a boli(stromboli), an order of hot wings, and a few coors lights to top it off! the pizza is delicious but then again everything on the menu ive had has  been DELICIOUS! MMM mmm MMM!!! i love this place!!"
        }, 
        {
            "index": 360, 
            "rating": 2, 
            "review": "Update - 10/2/13 - Last time I ordered from here, I was NOT impressed.  Their food really went downhill.  Very disappointing  :(\n\nPrevious review -The place is kinda smoky and ghetto but once in the restaurant part the food is good and the prices are even better.  I *LOVE* their pizza!"
        }, 
        {
            "index": 361, 
            "rating": 3, 
            "review": "The Stromboli was good. Service was very pleasant. The place was dark and old, having to walk through the smoke filled bar to get to the glass partitioned dining room was disappointing....hold your breathe!  Would I go back, probably not. Once and done."
        }, 
        {
            "index": 362, 
            "rating": 4, 
            "review": "I have three words. Stromboli...Stromboli...Stromboli. It was awesome. The crust is amazing. Crispy yet soft and fully cooked on the inside. It is well worth the trip from the strip. Don't be scared off by the dated decor... Sit back relax and enjoy. The large is plenty for one person. We had the original and the beef/cheddar. Both were great, but I lean a bit to the old school flavor of the original. \n\nOur service was great. The map of people that had been there was shocking. This place is far from a secret and permanently on my list in Vegas."
        }, 
        {
            "index": 363, 
            "rating": 4, 
            "review": "Only went there after seeing it on Diners, Drive-Ins and Dives, must admit Guy Fieri was right, the Stromboli was great. Even though the appearance wasn't what I'd imagined the food our party of four had was good all around. Our waitress was also a kick in the pants."
        }, 
        {
            "index": 364, 
            "rating": 4, 
            "review": "So basically we went like everyone else because we saw on DDD. \n\nIt is way the hell out of the way and looks creepy as hell, but the food was excellent! We got the Stromboli and the Sicilian pizza... they were both amazingly yummy :) \n\nwe also got the Cajun fries... ummm, not really my thing... just fries covered in Buffalo sauce. And my ex got a salad and... it was really not that good. \n\nAlso, the waitress was kind of rude and... slow? I mean, she was nice, but we had to repeat our order like 5 times and go over it with her... and she just seemed to get frustrated and annoyed. All we wanted was half the pizza with one thing and half with another... but yeah. Other than that... awesome food and would definitely go back :)"
        }, 
        {
            "index": 365, 
            "rating": 4, 
            "review": "This was a featured restaurant on DDD so we had to venture out in the wilds of Vegas to find this spot.  We were there for the Stromboli, which did not disappoint.  It was so good we took 2 along for the ride back to LA to enjoy later.  The service was friendly and attentive.  It is a dive bar but the dining area is separated from the bar so its good for the kids."
        }, 
        {
            "index": 366, 
            "rating": 1, 
            "review": "What happened to customer service????\n\nHeard good and bad about this place, plus it was on  TV so I thought I would try it for myself.  \n\nSome friends and I walk in and my first impression is it is a dump.  But I don't judge a book by its cover.  We sat at the bar and ordered a few beers.  Then it went down hill.\n\nIt was like pulling teeth to get any service there.  The bartenders acted like it was a problem to get some beers.  After waiting 10 minutes with empty mugs my buddy had to speak up to get another round.  Then the bartender came over and told us \"bartenders do  not like to be yelled at.\"  Sorry dude, but how about doing your job!!  This bartender really had a bad vibe.  Not welcoming at all.  \n\nWe were talking to the couple next to us, they left with out leaving a tip.  He said the service is terrible, the waitres was rude.  Bad service equals no tip!  I can't blame them either.\n\n\nIn the mean time, we had ordered wings and a stromboli.   We waited for over an hour for the food.  After waiting for the food, and after  the poor service at the bar we just decided to leave.  \n\nWhy was this place on Diners Drive-in and Dives?  This place is way over hyped.  You can go to any decent pizza joit and get a stromboli.  Its a pizza pocket folks.  \n\nBar food in a dirty run down place.  Rude bartenders.  Poor service.  Guy Fieri had one thing right...this place is a dive!"
        }, 
        {
            "index": 367, 
            "rating": 2, 
            "review": "Just ok.  Not anything special.  Got a \"boli\" and fingers.  The fingers are straight from the box to the fryer and are not anything special.  Soaked in hot sauce and served on foam plates.  Most any large chain restaurant will have much better food and served on real plates.  The \"boli\" was undercooked and plain.  Tasted a little bitter/sour.  Pizza hut or any national chain has better pizza based fare than this place.\nSave yourself the trouble and avoid this experience."
        }, 
        {
            "index": 368, 
            "rating": 5, 
            "review": "best pizza ever.  i would drive from california just to eat it and go home! !!!!\nthe crust is amazing! !!!!!!!\nloved the prices and our bartender rick was so nice.  owner was a cool guy also from our area in cali. \nwell be hitting that place every time we go to vegas!!!\nthanks for the experience"
        }
    ]
}