{
    "category": "Las-Vegas", 
    "entity": "Ohjah-Japanese-Steakhouse-Sushi-&-Hibachi", 
    "avg_rating_stars": 4.139949109414759, 
    "review_count": 393, 
    "reviews": [
        {
            "index": 1, 
            "rating": 4, 
            "review": "Not bad for a new restaurant! Steak teriyaki portion was pretty generous."
        }, 
        {
            "index": 2, 
            "rating": 5, 
            "review": "This has been my spot for years. They are so friendly. The food is super good, they cook it in front of you. And the sushi is to die for. And an amazing variety of sake. Try this place out. It's great, and not to expensive."
        }, 
        {
            "index": 3, 
            "rating": 5, 
            "review": "Went to ohjahs tonight. It was our first time there. Outside it smells AMAZING so you instantly float your way in. The lighting was perfect which set the mood. My girlfriend and I spilt some sushi which was splendid! Very fresh. If your in the area def stop at this spot to try it out."
        }, 
        {
            "index": 4, 
            "rating": 3, 
            "review": "3.5 stars\n\nOhjah doesn't rise nor sinks when compared to other Japanese restaurants, they just provide decent food with good service. Their sushi reflected that mayonaise, rice, and raw fish do not bode well together. Our party ordered three rolls but it was difficult to distinguish which was which. Each was slammed with 10 lbs. of spicy mayo and sweet eel sauce over flavorless spicy tuna, shrimp tempura, avocado, and/or cream cheese. Maybe we ordered the wrong things, but the phrase, \"Which roll is this again?\" was spouted during the course of the meal. \n\nIf there was a shining light in the meal, it was my hot entree. I actually enjoyed my spicy chicken. They were generous with their meat, the veggies were cooked perfectly, and it came with soup and salad. However, they should omit spicy from the description. It was more sweet and salty. I asked for extra spice but instead got an extra layer of red sauce. Other parts of the meal included a well excuted tempura. In the end, they gave pre-packaged hand cloths to wipe away all the grime and residue of your greasy claws. They have a hibachi grill if you want entertainment and flames. The atmosphere evokes dark and romantic but the clienteles are big-ass families with waistlines that match."
        }, 
        {
            "index": 5, 
            "rating": 5, 
            "review": "Ohjah is amazing! Better than benihanas and much cheaper! $40 for two people, when its nearly 80-100 at benihanas. I love their fried rice so much flavor, I honestly love everything about this place and I recommend it to everyone. \n\nI go here about 2-4 times a week which is ridiculous!!! STOP CONTEMPLATING JUST GO!"
        }, 
        {
            "index": 6, 
            "rating": 4, 
            "review": "DELICIOUS!!  Really great meal here that started with the sparkling sake with white peach. Yum!! It could have easily been too sweet but it wasn't.  \n\nWe started with a spicy tuna roll and that was also really good. And of course the hibachi - perfection. Filet, shrimp, scallops - all great. \n\nWe loved it and will be back the next time we're in Vegas!"
        }, 
        {
            "index": 7, 
            "rating": 4, 
            "review": "we tried this place out and loved it!  The hibrachi chef was really good and funny!  The staff was great with our kids.  The food was great especially the sushi!  The portions we good sized and there was enough to take home! Definetly will be eating here again!"
        }, 
        {
            "index": 8, 
            "rating": 5, 
            "review": "First time finally trying this place out and I regret not coming here sooner, I'm so impressed! We ordered Beef Negimaki for our appetizer which was incredibly tender and full of flavor. I would come back just for this alone. I ordered the hibachi noodles with Filet mignon, which I was please to surprised it included the hibachi veggies, and salad and soup. Soup was so-so but the salad... Wow so simple yet so wonderful, something about the dressing you can't find anywhere else. My steak was cooked medium TO PERFECTION! I've been to fine dining steak houses that weren't as good and tender as this! My husband orders the fried rice (which I kept steeling, the scallops, and the chicken. The chicken was probably my least favorite, flavorful but a tad over cooked... I'll stick to my filet mignon. Great place to bring out of town guests, This place is great for birthdays too. We will be back!"
        }, 
        {
            "index": 9, 
            "rating": 5, 
            "review": "Our family loves this restaurant , they serve great food and very entertaining."
        }, 
        {
            "index": 10, 
            "rating": 5, 
            "review": "Such an awesome place! \nWe got a hibachi table, and the show was on,. The kids had a great time watching the tricks, the food was delicious (and not expensive!) and the whole experience was great. We'll be back!"
        }, 
        {
            "index": 11, 
            "rating": 3, 
            "review": "Made a reservation and when my family of 4 showed up they told us they had no room for us. Very poor customer service skills!\n\n....Since my initial post, the owner has reached out to us and apologized for the incident. We are going to give the restaurant another try. I have increased the star rating to a 3 and will readjust again once we dine at the restaurant."
        }, 
        {
            "index": 12, 
            "rating": 4, 
            "review": "The combination fried rice was amazing.....three roll combo for $25...all in all a really great meal for the price.  Rolls could be a little bigger, but the quality and taste makes up for it. The restaurant was clean and the staff friendly, although the service was a bit slow. Overall I really liked the place and will definately be back."
        }, 
        {
            "index": 13, 
            "rating": 5, 
            "review": "Each time I come here it reminds me of why I keep coming back. Great edamame, great teriyaki scallops!"
        }, 
        {
            "index": 14, 
            "rating": 1, 
            "review": "Ordered sashimi salad, teriyaki chicken, roll and kimchi soup.\nSashimi smelled like fish even with strong sauce, teriyaki chicken meat was dry, the rice inside roll had old smell.\nAlso waitress we had was no smile with princess attitude.\nOverall,would not recommend to go there!"
        }, 
        {
            "index": 15, 
            "rating": 2, 
            "review": "I was excited that I was able to to talk my hubby into ANYWHERE I could get a bite of sushi so we decided to try out this new Hibachi spot in our area. \n\nOur friend met us there and hubby and I got there it was about 5pm and upon opening the door, there was no one there. No one. Customers or hostess. \nUmmmmmm......so I walked to the left a little and realized that the hibachi area was around the corner in a different room.\n\nWe walked ourselves around the room then found hibachi area.\nI posted several pics.\n\nHonestly it reminded me of the \"ol'school\" Benihana.......I just was not impressed. You have zero servers and if you get water or a drink you are lucky. The grill master Ven was suppose to be the best but just acted like he did not care that night.\n\nI got the Sushi Fiji and hubby got the Prime hibachi. Mine was just a pile of unfrozen bay scallop looking fried madness and hubby kept telling Ven \"NO I'M ALLERGIC TO SHELLFISH\" when he kept trying to throw shrimp in his mouth.\n\nOur friend order a roll and saki......he was also not impressed.\n\nIt is next to a new Lee's Liquor's that has craft beers.....that's another ball of GOOD YELP wax :)"
        }, 
        {
            "index": 16, 
            "rating": 5, 
            "review": "Love this place! My husband and I ordered their sushi boat and it was the perfect amount of sushi. We were both full when we left and the people were extremely friendly. Will definitely be back!"
        }, 
        {
            "index": 17, 
            "rating": 4, 
            "review": "I always have to order the King Salmon roll, probably one of the best rolls I've tasted in years!  Everything else is pretty good, but this roll to me is magic."
        }, 
        {
            "index": 18, 
            "rating": 4, 
            "review": "Ohjah is always a great time. If you want to go on a date and liven it up a little then ohjah is the spot. I have the scallops, filet, and chicken. Everything was super tender and juicy. \n\nI would recommend this spot for a local over a tourist though. It has a great atmosphere and can be a really good time. Chefs keep te table in a good mood!"
        }, 
        {
            "index": 19, 
            "rating": 5, 
            "review": "Love Ohjah! Every time I come the guy at the front is very welcoming and accommodating he must be the owner or manager very sweet guy!  I just walked in and ordered a to go order and they were so fast! It only took a few minutes. Highly recommend Ohjah! Food, atmosphere and employees are all five star!"
        }, 
        {
            "index": 20, 
            "rating": 4, 
            "review": "I'm a fan of Japanese steakhouses so I was excited to try this place. Dinner started with soup and salad which comes with every teppanyaki meal. The salad dressing is amazing!!!! I am not a fan of salad, but I loved this!! It is really sweet and doesn't taste like any other dressing I've ever had. Each order comes with soup, salad, vegetables, and the choice of fried rice, noodles, or steamed rice.\n\nThe basic entree is $8.95 with the items listed above, then you add whatever else you want. For example, I ordered Filet Mignon and Shrimp Teppanyaki which added $13 to the basic price. I like the menu style because it is  \"Mix & Match\" so you can create the perfect meal.\n\nThe steak was delicious and very good quality. The shrimp however had a very strong shrimp taste which I don't like. (I am very picky about shrimp!) After dipping them in one of the sauces provided it was better. Finally, the fried rice was delicious!!\n\nOverall: Delicious and inexpensive teppanyaki dinner! I would say they are in the top 3 :)"
        }, 
        {
            "index": 21, 
            "rating": 4, 
            "review": "I've been here once, so maybe it's too soon to write a rave review and if our next few trips are as good as this one - they'll probably get bumped to a 5 star review. Picked up dinner here on the way home. Had Chicken and Steak Teriyaki dinners - both were really good, love the soup - nice to get an onion broth rather than miso, salad dressing... what is in this stuff??? I'm in love - like typical habachi ginger/garlic dressing only creamier... also there was one little crab ragoon with the dinner that was super tasty. Steak was tender - chicken good too. Sushi was good, only tried a California roll to test them out - so can't really comment too much on the sushi. Husband had a couple hand rolls he liked. So all in all, pretty satisfied. They do seem to be a little pricy - but I was pleasantly surprised with the meal."
        }, 
        {
            "index": 22, 
            "rating": 5, 
            "review": "I'm a first time sushi eater and all the things I heard about sushi joints is that they smell like fish and are a bit dodgy. This place smelled great and it was very clean. Next, went to the bathroom to check the cleanliness - spotless! \n\nThen the staff was so friendly. From the way they spoke to you to the way they cleared our table, great service. \n\nYou gotta see MANDY! She was so patient, understanding and funny. She made me ver comfortable for my first time. I will come back again. I went to \"I Love Sushi\" and I didn't enjoy my experience there and so I haven't been back to a sushi place in years because I didn't enjoy my experience - until today! \n\nCome to this place and bring your friends!"
        }, 
        {
            "index": 23, 
            "rating": 4, 
            "review": "Fresh sashimi clean presentations. \n\nCame here with a $20 certificate so we decided to go big and order the boat. This was a pretty good deal as it included 3 specialty rolls, salmon, ahi tuna, and hamachi sashimi, seaweed salad, and three types tobico for only $45. Just the specialty rolls were $10 - $12 each so it was well worth it. We also ordered the lychee Saki, they had a few different kinds of flavored Saki which are good for those don't like the original flavor of Saki. We were told the boat would take about 15 min but they served us each an order of the house salad as we wait. \n\nWhen the boat came out I was very impressed by the presentation. The specialty rolls were OK, but what put the boat over the top was the slices of sashimi. Each slice was about half and inch thick with about 3-4 slices each. The quality of the fish was superb and with each bite you certainly can taste the freshness. In my mind what differentiates a lot of these sushi restaurants is the quality and freshness of their fish. Ohjah certainly displays fresh quality ingredients. \n\nI would love to come back and try their Hibachi. But would definitely come back for their sashimi."
        }, 
        {
            "index": 24, 
            "rating": 2, 
            "review": "I just left there... I use to love that place but my mom came from Brazil and it's her birthday today and we thought would be so nice but the chef wasn't nice and he asked me what I wanted him to do to dance in the table? I said no just be nice at least... I never had a bad experience there but today was the worst! The rest of the crew was very nice but I felt really bad because my mom that doesn't speak the language notice how rude he was with us!"
        }, 
        {
            "index": 25, 
            "rating": 5, 
            "review": "Stopped in for a family Valentines Dinner. We had dinner at the hibachi grill additionally we ordered a sushi roll, the pink lady. So very good. Service received from all was excellent. We were in and out in an hour. Not that we were in a hurry, we were just hungry! My new fav Vegas restaurant"
        }, 
        {
            "index": 26, 
            "rating": 3, 
            "review": "It was ok but nothing special. I had the New York steak which had a lot of fat in it. My friend had the chicken and said it was really good.  My water was empty for some time and I saw the server in the corner chatting with another server. I finally gave up and refilled the water on my own.  I won't be back."
        }, 
        {
            "index": 27, 
            "rating": 4, 
            "review": "This is my favorite teppenyaki place in Vegas. They have great prices, delicious sushi selection and fantastic, attentive service. We used to frequent ohjah about once a week, but it got pricey. \n\nYou can order the main teppenyaki dish for $8.95 and then add on your meat selection, whether it is filet or shrimp or both. \n\nThe salad dressing is to die for... I wish I could just drink it. Their sushi is so fresh And they have a great assortment of rolls. \n\nDefinitely will be back soon!"
        }, 
        {
            "index": 28, 
            "rating": 4, 
            "review": "we visited ohjah for the first time on my bf's bday. we got to the restaurant at around 6:30pm and there was not a lot of people at the place so we were seated right away. our waitress was polite and friendly. since it was our first time at the place, she explained to us how hibachi works. she is very knowledgeable about everything on the menu and answered all our questions. she suggested which was good to try, and we did, and they were really good and tasty. overall, the food was great, the services was perfect. the chefs are funny and very entertaining. they know their way on knives and food. the price was very reasonable. the place was also clean and neat."
        }, 
        {
            "index": 29, 
            "rating": 4, 
            "review": "This restaurant is a great alternative to other higher priced hibachi chains. The service was friendly, our on-stage chef was entertaining, and the food was well-seasoned and cooked just right. \n\nIf you're looking for a family-friendly, fun Japanese dinner out in the Vegas area, I would recommend Ohjah's!"
        }, 
        {
            "index": 30, 
            "rating": 4, 
            "review": "I love this place, the food is great and servers are friendly. I had my birthday dinner here and ordered their boat.....which I have to admit is worth the price. The sushi chef was also really cool he made us a  small dish of one of his specials for us to taste which was awesome. I highly recommend this place and will be here more often."
        }, 
        {
            "index": 31, 
            "rating": 5, 
            "review": "Amazing for what you get for the money,been back 3 times since first trying it.Great staff and great food.\n\nNice strong drinks too!"
        }, 
        {
            "index": 32, 
            "rating": 3, 
            "review": "Went a few weeks ago and the service was nice. Went in for tepanyaki, but the food was a salty overload. Although we enjoyed the atmosphere, it was a different change from our usual Musashi dinners. Service 3 stars. Food 2."
        }, 
        {
            "index": 33, 
            "rating": 5, 
            "review": "I come to Ohjah pretty frequently and leave completely satisfied each time. Each visit we are greeted with a smile by the friendly staff. Whether it's hibachi or just regular dining, the food never disappoints. I typically enjoy ordering the 3 roll special or the Ohjah boat. They also have an amazing selection of sake, some of which are not on the menu. Service and management are top notch! All the servers I've had are so kind and attentive. It's always packed at this location, so make reservations!"
        }, 
        {
            "index": 34, 
            "rating": 4, 
            "review": "The food is always fresh and good quality!  The only complaint I have, is there are \"surprise\" ingredients in things that I wouldn't expect.   A dish my boyfriend orders all the time suddenly had mushrooms in it.   The Tom Yum had an INSANE amount of bamboo and no other ingredients except for mushrooms and the shrimp (I ordered Shrimp Tom Yum).  BUT the sushi is fantastic and the teppanyaki is very good."
        }, 
        {
            "index": 35, 
            "rating": 5, 
            "review": "My family and I love this place. We usually sit in the hibachi grill. I think over time we've ordered everything on the hibachi menu and I have never once been disappointed. The restaurant is always full and it's definitely because the food is good and the hibachi chef's are very funny and definitely give you a good show. The price is extremely reasonable and the service is phenomenal. Try the salmon, it's amazing."
        }, 
        {
            "index": 36, 
            "rating": 4, 
            "review": "Love the hibachi grill service...however at times the additional parties you are sat with can be ignorant or have no class --- causing the experience not to be a pleasant one, but overall I have dined here several times and will be back. \nBring your own group if possible"
        }, 
        {
            "index": 37, 
            "rating": 5, 
            "review": "Service is incredibly friendly. I tried both the hibachi and the regular sushi/sashimi dinner. A+ quality food, especially for the price. I would recommend to family and friends."
        }, 
        {
            "index": 38, 
            "rating": 5, 
            "review": "These folks are very nice and accomodating. We came late at 1030 and we were taken care of in a very professional manner. The food is delicious and portions are substantial. We will definitely return and try other menu items. I had the sushi special and the nigiri and sashimi were really fresh and the rolls tasty. Hats off! A winner on Blue Diamond and Decatur."
        }, 
        {
            "index": 39, 
            "rating": 5, 
            "review": "We went for hibachi dinner last night and it was great. We had reservations for 5 and were seated as soon as we got there. Waiter was very attentive, immediately taking drink, then food orders. Soup and salad came out quickly. Small wait for the hibachi chef, but not too bad. He was very entertaining and I really enjoyed watching the show. I ordered the pick 3 special, got New York Steak, Shrimp and Salmon. It was all fabulous!!! Husband got Sukiaki Beef and really enjoyed it as well. It's not a cheap dinner, but a great value for all the food you get. We will definitely be back!"
        }, 
        {
            "index": 40, 
            "rating": 5, 
            "review": "We pretty much have tried most stuff here and everything is just oh so yummy! Our favorite Japanese restaurant in Vegas! Service is fast and the servers are friendly. Their sashimi platters are to die for, always fresh and big slices too!"
        }, 
        {
            "index": 41, 
            "rating": 5, 
            "review": "I arrived an hour before closing and the service was EXCELLENT. The food is superb if you are in Las Vegas you must stop by."
        }, 
        {
            "index": 42, 
            "rating": 3, 
            "review": "We come here quite a bit, I would say once or twice a month. We used to frequent more often than now, so we hadn't been in some time, but I have been to this location well over fifteen times.\n\nLet me start off by saying the food here is definitely good. I cannot comment on the sushi, as I have never had it but the hibachi is always solid. Tonight we went and things seemed weird. \n\nIt seems like Ohjah is getting cheap with their product. First, the chef told me he wasn't allowed to use extra garlic on my shrimp (or really use any garlic at all) because it is not procedure and he would get in trouble. Apparently management/ownership was getting annoyed with people asking for extra items and not paying. I would gladly pay for extra rice, veggie, etc. But garlic?! How expensive can a tablespoon of garlic really be. I would have paid for it had he said \"garlic is extra\" but he didn't; he just made it clear he wasn't allowed to use any garlic on ANY meat item other than steak..... Okay. \n\nSecond, I have never counted the shrimp I get on my plate, but I would say they used to give you 8-10 shrimp per order. Today I got 5. Once again, okay. \n\nThis was not the chefs fault by any means. I just feel as though ohjah is getting a little skimpy on their food. Hibachi is not cheap, so I will likely take my business elsewhere next time where they will gladly add garlic to my food."
        }, 
        {
            "index": 43, 
            "rating": 5, 
            "review": "This place never disappoints.  The teppanyaki rice and noodles are soooooo good! I always get steak and shrimp, delicious. :)"
        }, 
        {
            "index": 44, 
            "rating": 5, 
            "review": "We've been driving past this for over and finally decided to give it a go. Soo glad we did. Very nice interior and atmosphere. Excellent quick and friendly service. Food was great and the price was incredibly reasonable. Family friendly as well. Overall a great experience and will return often."
        }, 
        {
            "index": 45, 
            "rating": 4, 
            "review": "Had to eat here twice to fully encompass the whole experience. The first visit was the plain old sushi lunch.  Food was good but nothing spectacular, but spicy tuna rolls, tempura, and edamame all seem to taste the same everywhere after 3 or 4 tall asahis.\n\nSecond time I came for the tepanyaki.  The chef was very polite and friendly.  Engaged us but wasn't intrusive in our dinner in any way.  Had the filet and shrimp (both cooked perfectly)\n\nOverall this place is clean, food is above average compared to other sushi establishments, service is great, and it's up the street from where I lay my head.  Only reason I can't give 5 stars is I still have to pay for the food."
        }, 
        {
            "index": 46, 
            "rating": 4, 
            "review": "First time here and looks like it will NOT be my last.. Sorry Spicy Tuna, they have a killer tasty Garlic edamame!!! Not to mention they are much closer to my house. Need to try the sake and the beer. Their rolls were also very tasty!! ;)"
        }, 
        {
            "index": 47, 
            "rating": 4, 
            "review": "The first time I ate here we did the hibachi which is a lot of fun...especially if you have a big group or kids with you.\n\nTonight I went for sushi and it was really good. The spider roll had crab meat in it and of course that paired perfectly with the soft shelled crab, but I've never had it prepared that way.\n\nThe highlight was a sushi rolled called \"Captain\" that was one of the more delightful rolls I've ever had. It had crispy fried onion rings on top of spicy tuna and some kind of garlic sauce. Serious yum and kudos to the sushi chef who came up with the idea!\n\nI will definitely be back.\n\nThanks, Ohjah!"
        }, 
        {
            "index": 48, 
            "rating": 5, 
            "review": "I love this place! It's down the street from the house and the prices are very reasonable. We almost always do the hibachi every time. Can go wrong with this place. Service is usually on point as well."
        }, 
        {
            "index": 49, 
            "rating": 1, 
            "review": "This is the second time I have tried this place and it's horrible....... The rolls have no sauce in them and when u ask for side sauce they are stingy about it. My \" garlic edemame was so dry with no garlic flavor at all....when I told the waitress she laughed and walked away to get the manager .... He cooked up a new one with \" more garlic and sauce\" and it came back burnt to a crisp tasting like burn..... She was super rude most of all. And not to mention the sushi here is super super bland !!!!! NEVER COMMING HERE AGAIN ....sushi fever is the BEST this place is a piece of shit"
        }, 
        {
            "index": 50, 
            "rating": 4, 
            "review": "Very good !  We ate the sushi boat.. it was so fun.  The manager was nice.  The building has great lighting.. in all the right places... everything was great!"
        }, 
        {
            "index": 51, 
            "rating": 5, 
            "review": "This is a very good hibachi place and the prices are cheap! Just for chicken it is $13.25 and for shrimp it is $13.95. Service is nice and even the sushi is good.\n\nPROS: Food, Price, Service\nCONS: Gets packed on weekends (long waits)"
        }, 
        {
            "index": 52, 
            "rating": 2, 
            "review": "The entertainment was awesome with the chefs cooking in front of you. Flavor of the food honestly wasn't anything too special though. Definitely a fun atmosphere but wish the flavor was better."
        }, 
        {
            "index": 53, 
            "rating": 4, 
            "review": "Better than the Osaka, Hamada, or Benihana at much more affordable price.  Nothing fancy, but a neighborhood Hibachi/Sushi restaurant shouldn't be overly fancy or overly priced.  The sushi is good, and the 23.95 for any 3 specialty sushi items make it even tastier. \n\nDefinitely worth a trip if you are considering eating Hibachi anywhere in Las Vegas."
        }, 
        {
            "index": 54, 
            "rating": 5, 
            "review": "Food is always good!! Awesome value!! Price doesn't reflect how good the quality of food is!! No skimping here!!"
        }, 
        {
            "index": 55, 
            "rating": 5, 
            "review": "Ninja roll is amazing. So is their tuna tataki. I have never been disappointed at this location."
        }, 
        {
            "index": 56, 
            "rating": 4, 
            "review": "Food is very good and priced reasonably, large portions, the 3 combo is the best value, we got the filet and ny steak with scallops"
        }, 
        {
            "index": 57, 
            "rating": 5, 
            "review": "Wonderful food and very good service. My husband and I have tried the Habachi grill which is superb, the regular menu is varied and everything we have ordered has been tasty. There is never a wait for a table or a place at the grill. I have not tried the sushi but it looks good."
        }, 
        {
            "index": 58, 
            "rating": 5, 
            "review": "First timer & cannot wait to go back! Fresh sashimi, flavorful white tuna, addicting fried rice and a great selection of drinks! Was so incredibly full when I left, but now have been craving everything I had when I was there! Quiet, quaint, not very fancy, but fantastic and friendly service!"
        }, 
        {
            "index": 59, 
            "rating": 4, 
            "review": "My love and I heard good things about other Ohjah locations so one night we decided to check out the newest location on Blue Diamond, close to our home. We love sushi and hibachi and have ate at many hibachi type restaurants in and out of Las Vegas. So I was excited and had high hopes of a new restaurant close to home. When we first arrived I noticed the interior, it's beautiful, classy and not the typical Japanese decor that so many other places in town aim for. We were seated and I immediately noticed not only the wonderful smell of others already enjoying their meals, but the menu. Every item is al a cart, reasonable and inexpensive. Considering that we have spent well over $100 at like restaurants in the past for a party of two, I was presently surprised and already liking this place. But let's be honest, if the food is crap.....the prices really are irrelevant right? \n\nSo, we both ordered different meats to try more of the menu. Me chicken, he steak. The chef came out and was fantastically funny, sweet and incredibly skillful while cooking. It still blows my mind the cracking and throwing of eggs lol. Anyways, back to the food. It was great! The rice was fluffy, the vegetables were tasty and the meat was cooked to perfection. We have since ate here many times and we have never been let down, I have tried all of the meat/fish items on the hibachi menu and they're all equally delicious. Did I mention I don't think our bill has ever been over $60 including tip? I haven't tried the sushi because the hibachi is so very good it's hard to try something else, when we usually only go there because that's exactly what were craving. I recommend everyone check out Ohjah on Decatur and Blue Diamond."
        }, 
        {
            "index": 60, 
            "rating": 4, 
            "review": "Great affordable hibachi for locals! My boyfriend and I enjoy coming here for dinner! Very friendly chefs and staff!  I usually get the filet and scallops with fried rice- the portions are filling and included with your main dish you also receive- onion soup, house salad and grilled veggies. Fun and delicious dinner choice!"
        }, 
        {
            "index": 61, 
            "rating": 5, 
            "review": "This is the closest hibachi to my house and I love it! I went here back in February for my birthday and the portions are excellent and the chef did his normal routine of crazy knife flipping, shrimp tossing and creating volcanoes out of a stack of onions and oil. \n\nI also like the regular restaurant area because the regular rolls are decent. the sesame dressing in their house salad in phenomenal (a small detail I look for in Japanese/hibachi restaurants), the baked mussels are tasty and I loved the size of the glass when I ordered an oyster shooter. Surprisingly I also liked the portion of the pad Thai they serve here (yes, they have Thai on the menu at this place). I don't believe they do AYCE but it's still not a bad establishment to go to once every other month."
        }, 
        {
            "index": 62, 
            "rating": 5, 
            "review": "Love love love this place!! The food is so good and it's so affordable you just can't beat it!! It's a perfect place for celebrations or dates!  My family and I go often!"
        }, 
        {
            "index": 63, 
            "rating": 5, 
            "review": "We had pot stickers, chicken teriyaki / rice , onion soup, salad,Tuna Poke, and green tea mochi everything was very beautiful & delicious, each dish was a generous amount, staff were friendly. Looking forward on trying something different next visit."
        }, 
        {
            "index": 64, 
            "rating": 4, 
            "review": "We went here for lunch on Sunday. The lunch box specials include Miso soup, salad, pot stickers, California roll, rice, and your \"entree\". My chicken teriyaki lunch box was under $7.00 so I expected the lunch box to be small. (I spend more at taco bell for a combo meal.) By the time I was finished with my meal, you had to roll me out of there! It was plenty of food! The decor is beautiful, the food tasted fresh and it came out relatively fast. I would have given it 5 stars but I had to ask each time I wanted my drink refilled and that was a little irritating because the server didn't come around at all once the food was out."
        }, 
        {
            "index": 65, 
            "rating": 4, 
            "review": "Great, fun place. Good food. Nice atmosphere. Very reasonable prices. Good-sized portions. Highly recommend on a first date, spouse date or for a big birthday celebration."
        }, 
        {
            "index": 66, 
            "rating": 3, 
            "review": "Good Prices, Okay Dishes, Excellent Service\n\nIn terms of the food, the sushi dishes were somewhat tasty, but an overall fail compared to some of Ohjah's competitors.  I ordered a variety of sushi dishes.  I enjoyed the rolls, but just found that the execution didn't match Soho (or Nobu - but that's fair) for the yellowtail jalapeno dish.  As to the short ribs, they were essentially Korean galbi, which were bland and tough.  I would definitely not order that dish again, although I would go back to try the other dishes because the price point and service were good."
        }, 
        {
            "index": 67, 
            "rating": 5, 
            "review": "Food was amazing, service was great as well! Loved it the sexy mama roll, and the  Teppan was really good too! I thought the fried rice with some of the best fried rice I've ever had! The salad was okay due to the ginger dressing being different...all in all we will definitely eat there again!"
        }, 
        {
            "index": 68, 
            "rating": 5, 
            "review": "I been before and thought it was under priced, so today i'm taking a few friends with me. yeay"
        }, 
        {
            "index": 69, 
            "rating": 5, 
            "review": "My fiancée and I went in on a whim tonight for the hibachi side. It's pretty roomy inside and we got to a table where four friends were already at. Not too crowded, nice. The waitress came over right away, Fiona I believe, and she was very nice, attentive, and friendly. We never waited for anything. The chef came and he was AMAZING, older gentleman, Devon or David we believe we heard his name was, had 30 years under his belt and his skill showed that yet he still acted like it was just as fun as day 2. So funny and jokes were everywhere, such a good time. The manager was incredibly nice as well having come over to check on us after we were served food. \n\nReally, no complaints. However, it is very different from other hibachi places we've been, taste wise. Different, not bad. And the prices were awesome, $40 for just the two of us. We'll definitely be back."
        }, 
        {
            "index": 70, 
            "rating": 5, 
            "review": "Tonight's dinner at the Sushi bar was INCREDIBLE. We had California Roll, Dragon Roll, Rock and Roll and Lobster Roll. It was positively sex on a plate. I will eat here 100 times more. The sushi here will leave you begging for mercy!"
        }, 
        {
            "index": 71, 
            "rating": 5, 
            "review": "I took my brother in law here for his 21st birthday. I was a couple days late, I couldn't get off work during week.\n\nBut we called on way to restaurant and made quick reservations. We get there and instantly seated. I been waiting to try the hibachi for 1st and 2nd time here and our timing was off, but this time we were in.\n\nSo we started with some sake, our salad and onion soup which are both very good! The salad is my favorite. I gave up rice for lent so fried noodles it is. The fried noodle was very good!\n\nI got the combo with 3 choices. I got scallops, filet mignon, and shrimp. I got this the very first time we can here but no hibachi show, it was lunch time. Food was 5 stars on its own. \n\nNext our show, I forgot his name we had a couple bottles of sake. I guess we were waiting for more people for our table and they were very late and gave us complimentary edamame on the house while we waited. Very nice of them. Our show was the very fun! We all caught shrimp in our mouth. We had a blast, the price was right. Great food, service, fun. We will back soon, thank you Ohjah."
        }, 
        {
            "index": 72, 
            "rating": 4, 
            "review": "Get the boat.  Seriously.  Get the boat. \n\nI cannot push this more unless I were to kidnap you and take you to the restaurant and forcefeed you sushi.  And that's just wrong, and requires way too much effort. \n\nSo get the boat. \n\nIt's a platter (shaped like a ship) with all sorts of nom-nom-nom nigiri, sashimi, and your choice of three specialty rolls.  So, so good.  This is a shared plate, and you need at least two people (who are especially hungry) or, more wisely, four people.  \n\nI am a fan of the caterpillar roll, so inevitably this was one of my choices.  Tender eel, firm avocado, nicely packed rice, and tasty sauce - nom.  \n\nThe service here was great too!  The server was a pleasant woman who was always ready with water refills (why ruin the tastiness of sushi with a competing flavor from soda?), and the sushi chef was ready to answer questions. \n\nOh yeah, bathrooms were spotless! \n\nI will have to go back and investigate the hibachi side of the restaurant at a later date, as this review is only about the sushi. \n\nBut yeah, get the boat."
        }, 
        {
            "index": 73, 
            "rating": 5, 
            "review": "This place was great. The hibachi was pretty decent for my first time. Customer service was awesome there are some pretty cool people that worked there. Food was amazing and I had the fried ice cream for the first time too ughh melted in my mouth lol the price actually isn't too bad either. You'd think it would be more expensive than it is. I wanna go atleast once a month definitely would recommend it."
        }, 
        {
            "index": 74, 
            "rating": 5, 
            "review": "By far my favorite Japanese Steakhouse! The rice is perfect, not too salty. Everything here is just right. Prices are reasonable, too. Skip Geisha and Benihana, Ohjah is the place to go!"
        }, 
        {
            "index": 75, 
            "rating": 5, 
            "review": "Goodbye dinner for Hiroki had to include sushi! Awesome night. Awesome friends. Awesome food. Sorry we couldn't get oysters. Next time, and there will definitely be one!"
        }, 
        {
            "index": 76, 
            "rating": 4, 
            "review": "We went here for late lunch. The hibachi lunch was delicious and very reasonably priced. It was empty when we got there so it felt a bit more intimate. The chef was skilled and had a likeable personality. The staff was also nice and went out of their way to chat us up when they found out we were local. I had the chicken and shrimp and my friend had beef and chicken. Along with that were the regular sides of fried rice and veggies (mushrooms, zucchini and onion). The meal also included miso soup and ginger dressing salad. Everything was delicious and reasonably priced. I plan on returning, but during off hours because it sounds like this place gets packed on weekend nights."
        }, 
        {
            "index": 77, 
            "rating": 1, 
            "review": "Absolutely disgusting! \n\nI got the worst food poisoning from their disgusting fucking fish and they charged my credit card twice! Their prices are high for shitty sushi, and the ambience is depressing on top of that.\n\nIf you like fishy underhanded staff and fish that will make you vomit, eat here. Otherwise I suggest you don't touch it with a 10 foot pole."
        }, 
        {
            "index": 78, 
            "rating": 3, 
            "review": "The food is okay. I mean this wasn't our first choice everything was closed so it had to do lol. But it was extremely salty and okay sushi. I've had better"
        }, 
        {
            "index": 79, 
            "rating": 4, 
            "review": "Overall we had a good experience- the hibachi experience was fun and the food was great for the price! However, we did feel like they were rushing us out and it wasn't even that crowded! Before our whole table was seated we had already been served soup and salad. The poor people next to us seated after had to eat all the appetizers while eating their dinner! During the hibachi cooking they brought us our check so we were unable to order anything additional and as soon as we finished our plates they were ready to walk us to the door.\n\nWill probably be back at some point, but will be trying some other places around the area as well!"
        }, 
        {
            "index": 80, 
            "rating": 5, 
            "review": "Love this place. We dine here about once a month or so. My little grandsons love the food and the chefs. Typical Tepanyaki, but always fun and the staff is friendly. They really make you feel like they are happy that you came in."
        }, 
        {
            "index": 81, 
            "rating": 5, 
            "review": "Their teppanyaki is awesome and the service is good. Our chef was also very entertaining."
        }, 
        {
            "index": 82, 
            "rating": 4, 
            "review": "Came in last minute and they accommodated us at a hibachi table. Food was good. Service and chef were great. A little can be said about the cleanliness.  Under the table was dirty but despite that we enjoyed our time. We will probably come back"
        }, 
        {
            "index": 83, 
            "rating": 4, 
            "review": "Our group of 6 red heads gathered around, We had a lovely dinner and each of our special dietary needs were catered to. \n\nThe chef was awesome, he was fun and entertaining with every one of us. The chicken, steak and shrimp was all cooked to perfection, and our one girl who had sushi all raved about what they ate. \n\nI would most certainly go back!"
        }, 
        {
            "index": 84, 
            "rating": 5, 
            "review": "Love this place. Best price hibachi around. Excellent quality food. Great service. Very good atmosphere. I could eat here at least once a week. As for their sushi bar. Not bad. I would prefer my sushimi sliced a little thinner but still good quality for Vegas. Much better than Osaka or Hamada."
        }, 
        {
            "index": 85, 
            "rating": 4, 
            "review": "Teppanyaki grill is like sex... Even when it's bad, it's still good! Haha. Good food, pretty good service and was cheaper than most teppanyaki spots."
        }, 
        {
            "index": 86, 
            "rating": 4, 
            "review": "\"Japanese Vegas!\"\n\nI never thought about trying this place until a liquor store opened up beside it. Since then I've been eating here about twice a month. Once my meal is through I go next door to the booze joint, buy a bottle of dessert, then slam it once I get home. It's win-win, baby.\n\nWhen you walk in through the single tinted door the seating area is to your right and the sushi bar straight ahead. I always sit at the bar so I can watch sports on TV. To the left of the sushi bar is the hibachi room. Dark, friendly and kind of exciting if the patrons' behavior is any indication.\n\nSince I'm in a Japanese eatery I always start with a flask of cold sake, usually Kurosawa. (They have several different sakes, domestic and imported beers, wines, and well drinks. There is no full bar or bartender, however. The server assembles/retrieves your cocktail.) While sipping from the tiny glass that is kindly refilled by one of the very attentive and fawning Asian lassies, I peruse the appetizer list. To date, I've had fried oysters, shrimp/vegetable tempura, fried pork and a few others. Many things to choose from. As for entrees I usually stick with sushi and have had most of the offerings listed on their extensive menu to which I've provided a link. I can honestly say I've never had bad sushi rolls here. I steer clear of the ones that come with cream cheese but have had most of the others. Those with salmon or crab are my favorites. The plates are always artfully arranged and very prompt in arrival.\n\nOhjah is kind of my new hangout and only minutes from home. See you there soon."
        }, 
        {
            "index": 87, 
            "rating": 4, 
            "review": "Took my niece nephew and son here. The kids liked it. Food was pretty good, up to par with the rest of these type of places. The staff was extremely friendly and helpful. I'd like to come here with friends next time have some drinks and a fun night. I would recommend this place."
        }, 
        {
            "index": 88, 
            "rating": 5, 
            "review": "WOO HOO for Habachi!!! Yo I have had my fair share of teppanyaki and Ohjah serves up a pretty good one. Now I know some of you might not find this too exciting but forget all that if you would to have a go to local habachi or sushi steak house here it is. I have to say this location didn't seem or look like it has a big enough space inside for this but it did. Located next to Lee's Liquor and Papa Murphy pizza it also doesn't look like there is much parking. But have no fear there is plenty on the side and in back. \n\nUpon entering you will find yourself in the restaurant/sushi bar side. They have a completely separate room for habachi next door. Our service girl was nice and the chef was really entertaining, I was very stoke we got the guy we did because the cook before him didn't look like he wasn't having such a great night. We came here for my Birthday celebration and everyone got a mix plate and I ordered the Ohjah Boat with sashimi, special sushi rolls, nigiri and seaweed salad.\n\nThe lobster, filet and shrimp teppanyaki was cooked and seasoned so perfectly. Meat was tender...not dried and tough like (Benihana's) and the shrimp and lobsters had great texture as well not chewy or fishy. The fried rice was yummy very garlicy just how I like it. I also got the Sushi and Shashimi boat for myself. Which is pretty awesome and more then enough food! come with 3 specialty sushi rolls of your choice and 10 pcs of nigeri 6 pcs of shashimi and a side of seaweed salad. BOMB!\n\nAll in all I loved this place and will be back and how cool is getting your sushi served on a freaking Boat Man?!?!.....Super cool!"
        }, 
        {
            "index": 89, 
            "rating": 4, 
            "review": "Visited this place, which I recently noticed off of Blue Diamond Rd, and I was sure glad I did. Although I was not very hungry when I visited, the service was very friendly and food was fresh. I came here with my fellow yelper Al, and our gyoza, california roll and chicken katsu was worth returning for. \n\nTheir menu includes other dishes besides sushi, and they also offer a hibachi grill side of the restaurant which looks very nice....and very affordable. I will certainly visit them again."
        }, 
        {
            "index": 90, 
            "rating": 2, 
            "review": "Came here when it was about 30 minutes before closing. We told the host stand we'll just get it for togo but the manager insisted we stayed. We knew we were gonna get mediocre to okay service.. BUT NO! we got a horrible service. never coming back again."
        }, 
        {
            "index": 91, 
            "rating": 4, 
            "review": "Pretty good hibachi place. It's your basic/standard hibachi restaurant, nothing really special lol. They are open late which is great. The hibachi prices are fairly reasonable and the service is great. I feel like the chicken and steak could use a little more flavor, but other than that pretty standard."
        }, 
        {
            "index": 92, 
            "rating": 5, 
            "review": "Super bomb! Ordered the whole menu! Good prices too! Steak, filet mignonette, scallops, shrimp! Me and my friend ordered 5 items each and 2 sakes and the bill was $100. Not bad at all. They had to roll me out of there"
        }, 
        {
            "index": 93, 
            "rating": 4, 
            "review": "REVIEW for SUSHI not HIBACHI.\n\nThis place was really good. I wanted to make sure I wrote a review because it's somewhat off the beaten path in a small \"strip mall\" area next to a liquor store. Place could be easily missed.\n\n Tried several items on the menu (some lunch special). For 2 people, 2 apps., 2 miso soups, and 3 sushi orders - came to about $40 w/tax. For apps, had the chicken skewers. It wasn't that bad, but it was bland. I knew to stick to seafood.  The miso was good not too salty. The only roll I can recall the name of is the \"Valintine\" (sp?)\n\nI'm not certain if it's because they're new, but having a website would be helpful, especially because they deliver. Overall, the place was clean, service was quick, and food was tasty."
        }, 
        {
            "index": 94, 
            "rating": 5, 
            "review": "well i must say, there food and service was excellent. its really nice to go to somewhere nearby to eat.  its a place you must try. better than geisha and benihana"
        }, 
        {
            "index": 95, 
            "rating": 4, 
            "review": "**Summary**\n       - Ambiance - A little noisy, but the decor was nice. It was romantically lit with big screens over the sushi bar. A little something for both genders.\n       - Owners - First Japanese restaurant that I've been to that had Chinese music playing. You usually see them owned by Japanese or Korean in Vegas. \n       - Soup - They said the soup was onion soup, but I'm pretty sure it was winter melon. It's a pretty traditional Chinese soup. They said they also had miso.\n**Ordered**\n       - $12.50 Unagi Don - A decent sized piece of eel as far as eels go. A tad dry, but not bad. It comes with soup and salad. Good for those who don't want a big meal.\n       - $14.95 New York Steak Teriyaki - A fairly large steak cooked to your liking covered in teriyaki sauce. It also came with a crab rangoon, salad, and a soup. Definitely worth trying if you like steak teriyaki (http://www.yelp.com/biz_photos/sYfHxCqHpIX2HnDhw0JRAA?select=KW4CtKWK4DPBM0uOuXgjFQ).\n**Recommendations**\n       - I'd recommend this place if you live near Blue Diamond. It's a nice place to eat without having to drive too far."
        }, 
        {
            "index": 96, 
            "rating": 5, 
            "review": "I pass by this restaurant all the time without giving it a second look. I wish I would've found this sooner. The food is great and the service is even better. Definitely coming back."
        }, 
        {
            "index": 97, 
            "rating": 4, 
            "review": "brand new hibachi/sushi joint at reasonable prices!\n\nwe've been to ohjah (or king of the ninjas so the hibachi chef tells us!) on multiple occasions since its just around the corner from our house.  at first, i thought this place wasn't going to do well since the location is kind of weird (off blue diamond and decatur, but in a tiny side shopping center thats pretty much empty).  but right when this place opened, we've noticed its been packed... all the time!\n\nthe sushi... awesome!  very fresh and the flavors are great.  they have a ton of variety too.  prices are pretty sushi normal (expect about 10ish bucks for a specialty roll, 5ish for the standard rolls).  we got the volcano roll, tiger roll, and a bunch of nigiri (white fish nigiri... sooo good!).  all the sushi, excellent.  the volcano roll was covered in this interesting mix of scallops and sauce.  my kind of roll!\n\nthe hibachi was cool too.  i love the prices... its a lot cheaper than most hibachi places i've tried before.  you pay $8.95 for the hibachi basics then add on your meats for around 6 bucks (more expensive for better meats of course).  the food was pretty good and the chef was truly entertaining.  he was super ninja with his tricks and we all were able to catch the shrimp in our mouths.  boom!\n\nthe place is stylish and the service is nice.  their only fault i think is that the waitresses always try to up sell you to more things at the beginning (but it doesn't bother me that much).  \n\ndefinitely a must try!"
        }, 
        {
            "index": 98, 
            "rating": 5, 
            "review": "The service by our waitress Sally was amazing. She was friendly, efficient and made us feel like we were the most important people in the place.  Food came out fast and it was delicious. We will be back for sure...a lot"
        }, 
        {
            "index": 99, 
            "rating": 4, 
            "review": "Precios decentes ambiente agradable y buena comida, lo recomiendo, solo hay que hacer reservacion."
        }, 
        {
            "index": 100, 
            "rating": 5, 
            "review": "Well, honestly we would have followed Larry the sushi chef anywhere.... however, this place is pretty cool. Sushi on point, waitress was nice, the place is very clean and inviting. Not having a all you can eat kinda sucks, but ive been to alot of GOOD places that dont need that anyway to fill the seats. We will be back!"
        }, 
        {
            "index": 101, 
            "rating": 4, 
            "review": "Scrump!!  And mother of god...the \"Show me the love\" roll. Allow me to drool ok the keyboard...okay I'm done. KAMPAI!"
        }, 
        {
            "index": 102, 
            "rating": 1, 
            "review": "Service was horribly slow and not very friendly.... Would NOT suggest eating here.. 50 minutes and still not cooking and no refil!"
        }, 
        {
            "index": 103, 
            "rating": 4, 
            "review": "This was our second time here. We went in when they first opened. \nWe were not impressed then. \nBut tonight we wanted to get out & after checking Yelp we decided to give it another try. \nThey are located within walking distance of our house. \nWOW! I'm so glad we went back! Fantastic food. Ambiance was great. Service was very good. We had Hibachi style. Sat with a blended family with 4 kids. We had a ball. Entertained by these kids. \nBack to the food. I had Filet Mignon & hubby had a Lobster Tail. We shared. Fried rice & veggies. Yum! Yum!\nAll I can say is go. Inexpensive, good service & Fantastic food!!!\nWe will be back!"
        }, 
        {
            "index": 104, 
            "rating": 5, 
            "review": "Great new dinner option for people in the Southern Highlands area. Great sushi but there is no all you can eat. The hibachi is super affordable compared to some other local places and just as good if not better."
        }, 
        {
            "index": 105, 
            "rating": 3, 
            "review": "Not a bad place just not the best.  Lobster roll was okay.  The rice was bland.  The experience was fun but not the most talented chefs."
        }, 
        {
            "index": 106, 
            "rating": 5, 
            "review": "Our little girls (6 and 8) love hibachi. It is their favorite dinner request. We eat sushi or hibachi at least once or twice a month so we were excited when we heard about Ohjah. The atmosphere is fun and exciting. The staff is extremely attentive and quick with any request. I would recommend this restaurant just for the service. \n\nNow on to the food. All of us ordered the hibachi with the starter (soup and salad). It was delicious. The girls offered off the kids menu and we ordered off the adult menu. The portions and price are perfect for our family. Reasonable for the amount of fun that we had and the food was delicious. \n\nThe girls already asked to have their birthday celebration here. The staff does a little something special for the birthday boy or girl. We witnessed 4 birthdays during our dining experience. Fun times!"
        }, 
        {
            "index": 107, 
            "rating": 5, 
            "review": "Fantastic!  That's all I can say.  Will be back for sure.  Close to home. So no fighting The Strip traffic. Good, better, great, awesome.  Everything was super for sure."
        }, 
        {
            "index": 108, 
            "rating": 4, 
            "review": "I think this place is better than Benihana or Tokyo Waco. Good food for a Teppan place. I only tried one roll, but will def come back."
        }, 
        {
            "index": 109, 
            "rating": 4, 
            "review": "Celebrated birthday here. Great value and dinner was great. Filet was tender and salmon was well prepared with great flavoring. Good choice of noodles or rice with the dinner- different than most Japanese steakhouses that I've experienced. Will plan to go again!"
        }, 
        {
            "index": 110, 
            "rating": 4, 
            "review": "Great food, love he a la carte options for hibachi. Sushi is good. Chefs have a few tricks and food is always cooked correctly. Friendly staff make an enjoyable dining experience. Must say that the salad dressing is wonderful. The quality of the ingredients is very good. I wish the chefs would make more sauces to go with your food."
        }, 
        {
            "index": 111, 
            "rating": 4, 
            "review": "I've been multiple times since they opened and will probably keep coming back. The people who work here are really friendly and that's always a positive!\nTheir menu is really large so you're bound to find something you like.  I, myself like their sushi combos because you can choose 2-4 rolls from the menu (a deal on it's own), plus you get some pieces of nigiri sushi and some selected sashimi.  The price is decent also!  However if you do order one of these sushi combo platters and also plan to eat regular food off the menu (that's lots of food by the way), you should probably put in your sushi order first because they do tend to take a little longer to make these combos for some reason.\nI never tried the hibachi, but there's always lots of people in there so I assume it's pretty good.  \n\nAll-in-all, this is a good neighborhood family restaurant and it's worth a try."
        }, 
        {
            "index": 112, 
            "rating": 4, 
            "review": "I'll tell you I was nervous to have sushi in Vegas but it was as good as any I've had in Seattle. Clean, friendly and yummy! Get the boat! Its beautiful and deliciously fresh! Worth every penny!"
        }, 
        {
            "index": 113, 
            "rating": 5, 
            "review": "This place rocks! I stumbled to this location because I was buying some liquor from Lee's which is just next door. So I decided. To come back.\n\nThe ambiance is great! I actually would rate this as a great place to bring someone on a first date! The lights are dimmed at the restaurant area and the hibachi side was full of energy. They serve sushi and other Asian dishes. \n\nThe hibachi is my favorite area.  What's good about it is that you can still order from items from the menu. The chefs are very entertaining.  They joke around with your table and do all the fancy tricks such as making the volcano onion, making the shrimp bunny, etc.  \n\nThe food is cooked exactly the way your ordered it.  It's very tasteful and the sauce they provide work perfectly with the items you order (fish vs meat vs chicken).  \n\nDon't forget to check in because you get a free small sake bottle which was awesome! \n\nThe price is very decent compared to other places such as Benihana.  It's about 40% less than the other hibachi restaurants.  \n\nI ordered there house combo which was to pick any 3 items for your dish.  It was a surprise that the filet mignon was able to be part of your 3 items.  \n\nThe staff are super friendly and never has disappointed me.  I've been going at least 1 once month to treat myself and family.\n\nThis place is awesome! Stop reading and just go and experience it for yourself!!!"
        }, 
        {
            "index": 114, 
            "rating": 3, 
            "review": "After a genuine message from the owner after my review - we decided to give this place one more chance.  \n\nCame in last night and opted for the dining area instead of the hibachi room.  Service was a HUGE improvement from my last visit.  \n\nOnly Downfalls:\n\n- they charged us for an extra order of edamame - not going to complain over $3 \n- they charge $1 extra per roll to sub. soy paper\n\n\nWe will be back thanks to Saly & Peter to give the Hibachi room another shot as well."
        }, 
        {
            "index": 115, 
            "rating": 2, 
            "review": "Another place I thought I write/wrote an extended review but then, poof ! Nowhere to be seen then I get a little note from yelp saying, hey, you took some pics, how about writing a review.\n\nWell, I am frustrated by the lost lengthy review so I will keep this one brief.  \n\nWent in for late lunch with the gf.  Mistaken impression that hibachi meant it was bbq'ing meats on a lil hibachi either self serve or cooked to order.  Told it was basically teppan style AND not available until evening.   Not happy.  Went ahead and ordered some sushi, soup and a few other unremarkable items.  Nothing stood out for either of us.\n\nNo plans to return \n\npics posted ages ago"
        }, 
        {
            "index": 116, 
            "rating": 4, 
            "review": "My review is on the Hibachi dinner, as we did not have sushi when we went. I do want to say that I become more and more dismayed at the number of sushi establishments that don't even offer a simple Spice Crab roll muchless a specialty roll with spicy crab in it. It seems when I ask for this 'unheard' of ingredient they look at me as if I have a third eye or something and unfortunately their answer to spicy crab = \"a california roll with siracha rolled into it\" is unacceptable. For those who do not know how to make spicy crab it is merely imitation crab stick chopped up just like they do for the crab salad with a tad bit of siracha and japanese mayo. The sad thing is that the easy way would be to just chop up a crabstick and mix it with the already available Spicy Mayo.... just sayin' \n\nBut I digress - the hibachi menu requires that you order the 8.95 base selection which is just your soup, salad, veggies and rice. Scroll down the menu a bit and it gives you the selection of meats and fishes that they serve Hibachi style. Kobe beef runs 48.95. We chose to have the Hibachi combo which allows you to choose 3 selections (excluding Lobster, Halibut and Kobe) but is a nice plethora of flavors that you can try as your meal.\n\nThe chefs are very entertaining, the meal is exciting to watch and the final outcome was really delicious. We didn't want for drinks until after the show was over and then we had to flag someone down a couple of times. Not terrible but they had spoiled us during the show serving us every time the glass became half empty.\n\nI would definitely like to go back and see if they can do better with their response for Spicy Crab :-)"
        }, 
        {
            "index": 117, 
            "rating": 4, 
            "review": "This a great neighborhood Japanese joint.  Not the best, not the worst, but always solid.  I've been here enough that I found certain staples that I always get:  Garlic Edamame, Japanese Spring Rolls, Soft Shell Crab, SOB roll...There is also very delicious Hibachi here."
        }, 
        {
            "index": 118, 
            "rating": 2, 
            "review": "Don't expect much.  I regret coming here.  I think what pretty much set the tone for my meal is when our server seemed like she was trying to convince us not to order our food when we were giving her our list of what we wanted.  She said it was a lot and when I said yes it is-she stood there like I was going to change my mind.  \nSpecialty and signature rolls are ok, but pork katsu dinner was very dry.  \nI give credit to the sushi chefs but other than that I will not be coming back here.  I don't want to be offended when I order the food I want-like I don't know what just came out of my mouth.  Yes I'm hungry and yes I eat a lot."
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "We come here often and love the consistency of our rolls. They serve the best non filtered sake. The staff is friendly and very attentive."
        }, 
        {
            "index": 120, 
            "rating": 5, 
            "review": "One of the better sushi joints in the area. I've been here a few times and try to come by whenever I'm in Vegas. The fishes are fresh, so right on !! They've got a great selection of appetizers and sushi on the menu. If you don't like raw fish they serve a large variety of cooked food as well such as chicken terriyaki or noodles. This place never seems to disappoint. I'm always a satisfied customer !!!! Plus, I love the service and the attentive servers. \n\nNote - I usually order the sashimi salad, its spicy here though. I love that b/c it gives the salad an extra kick. Most sashimi salad I've tried aren't spicy at all, so this place makes it extra special. Different !! The baked green mussel are delish and a must order !! Needless to say, the sushi of course is off the hook !!"
        }, 
        {
            "index": 121, 
            "rating": 5, 
            "review": "Went for the first time and did the hibachi and it was amazing! I'm a really picky eater and thought it was soooo good! The onion soup is so yummy and so was the fried rice, chicken teriyaki, and filet minion! Delicious!! Definitely recommend (even if you don't eat sushi like myself)"
        }, 
        {
            "index": 122, 
            "rating": 3, 
            "review": "We've been here a few times now and it's a consistent 3 1/2 stars. It is an easy and comfortable environment for a sushi dinner with the family."
        }, 
        {
            "index": 123, 
            "rating": 4, 
            "review": "Service was excellent and the prices are great....but the food quality was lacking a little. Went here to celebrate a friend's birthday dinner and my salmon was over cooked. Also the rice wasn't as fluffy as it should be. Maybe next time we will just sit at the sushi bar..."
        }, 
        {
            "index": 124, 
            "rating": 5, 
            "review": "I typically come here for my coworkers get togethers but last month I had one of my birthday celebrations here. It was so nice because the Hibachi is not only delicious but the prices are really reasonable. They are also very accommodating because one of my friends brought me a cake and they were nice enough to keep it in their fridge till after our meal. When our meal was finished the waiter cut the cake and served it. They were busy that night but they didn't rush us out. The service and food is excellent! I can't wait till they open the one on Hualapai and Flamingo!"
        }, 
        {
            "index": 125, 
            "rating": 5, 
            "review": "The restaurant staff is amazing here! I came here recently with my family and they were extremely friendly and accommodating. They were constantly checking on us and making sure the food and drinks were ok. Not to mention the food is awesome! Great sushi and Thai food. Definitely want to go back and try other items on the menu. Our server Felicia was amazing and she was super sweet! All in all... Highly recommend this place!"
        }, 
        {
            "index": 126, 
            "rating": 5, 
            "review": "I absolutely love this place. We've tried many sushi places around the area and this is the best. Best service best food best everything. Yall gotta come here!"
        }, 
        {
            "index": 127, 
            "rating": 5, 
            "review": "This is the best hibachi place!!! It is totally reasonable in price! Awesome food, great service-drink never went empty! We are totally coming back!!!"
        }, 
        {
            "index": 128, 
            "rating": 2, 
            "review": "Whenever I call Ohjah for takeout, they're short on the phone and act like it's an utter inconvenience, even though they advertise takeout. I live right around the corner and tip every time i pick up food, so i don't understand the problem. Tonight was no different and when I picked my food up, I finally asked the man (the same curt person on the phone) if he didn't like takeout orders bc he wasn't very nice. He actually answered that it was a pain when they're busy!! He didn't even apologize and just continued to be rude. The food here is quite good, I order takeout several times per week, and it's one of the better sushi places in town, but they're so rude and clearly don't appreciate my business, so I won't bother with this restaurant again. Many more sushi places that are delicious and make me feel welcome."
        }, 
        {
            "index": 129, 
            "rating": 4, 
            "review": "By the far the cheapest tappenyaki/hibachi around town. You can seriously get by dinner here for $15 while other places charge $50-80 per plate. Ridiculous!! I was really surprised when I saw the menu on how cheap it was. Especially with the great quality of the food here.\n\nI can only rate on the hibachi section (where they cook your food in front of you) since that's the only part I've experienced. You first start out with a small soup and salad. Veggies are already included in your cooked meal. You choose between fried rice and fried noodle (basically chow mein). Then you pick your meat. They have a pretty good range including chicken, NY steam, filet minion, shrimp, calamari, kobe, etc. They really slab a lot of the food with butter, but I assume that's why it all taste so good.\n\nChefs are very entertaining. They do all sorts of tricks with their knives and try to entertain you with the food. \n\nThe only reason why I am taking off one star is because I encountered 1 chef that was a bit rude. Usually when I come here, all the chefs are pleasant and funny. Recently when I came, the chef asked how I like my steak cooked. So I said \"well done.\" He gave me a nasty look and said \"really? Why bother get filet minion then?\" It caught me off guard as he came off like that. In my head, I thought why does it matter? He should of just cooked it the way I requested. I felt like he was complaining because he was impatient and didn't wanna keep standing there just to cook mine. It shouldn't matter how one likes their steak...just cook it. I wanted to complain to the manager, but I didn't wanna make that big of a deal of it. \n\nSo I'm sorry if you encounter a douchebag chef, but most of them are really nice. Just hope it doesn't offset or ruin your night. \n\nPraying that y'all get a decent chef next time. ~"
        }, 
        {
            "index": 130, 
            "rating": 4, 
            "review": "Today was their grand opening day and I couldn't have been any more excited! I pass by this place everyday and was anxious to try this new restaurant on Decatur and Blue Diamond. On my way home from work, I saw their \"Open\" sign lit up so I called my husband right away and told him to meet me there for dinner.\n\nWe were greeted warmly when we walked in and were asked if we wanted to sit at the bar, a booth or if we wanted hibachi. We opted for hibachi. The hibachi room was huge and there were eight cooking stations. \n\nMy husband ordered the Special Rolls Combo for $23.95 and got the Dragon Roll, Spider Man Roll and Kamikaze. I ordered the Filet Mignon hibachi which came with vegetable teppanyaki, house salad, miso soup and your choice of fried rice, fried noodle or steamed rice for $16.50.\n\nThe sushi was pretty good... Normally my husband and I like raw fish but since I'm pregnant, he ordered all cooked rolls. I especially liked the Dragon Roll because the salmon was cooked with a nice charred taste. I think I may be used to AYCE sushi so I don't think I sushi would be my first choice when I come back.\n\nI enjoyed my hibachi meal and our chef was entertaining. I watched three different hibachi chefs and it looked like they all had their own tricks up their sleeves. The house salad was good but they were a little too liberal with the dressing. I enjoyed the Filet Mignon very much because the meat was tender and flavorful and cooked to my preference.\n\nI was too full to order dessert but I want to try the tempura ice cream next time. The only three dessert items are ice cream, mochi ice cream and tempura ice cream.\n\nThe service was top notch even though they had a lot of patrons. We were checked on regularly and we didn't have to wait long for our food or our check. The service was surprisingly good for a restaurant's opening day!  \n\nI will be back again since this place is super close to home. I'm so glad this place that I have been keeping tabs on is finally open! Ohjah was definitely worth the wait!"
        }, 
        {
            "index": 131, 
            "rating": 4, 
            "review": "Had the Special Rolls Combo: Tiger, Sweet Heart, and Crispy Tuna, more than enough food. CRISPY TUNA absolutely loved! It has all my favorites spicy tuna, tempura seaweed, eel sauce, & more. Delish!"
        }, 
        {
            "index": 132, 
            "rating": 4, 
            "review": "Amazing, delicious, tasty, love love it. Service is fast - as in 'breakneck speed fast'...a bit difficult to relax but if you're eating before a movie you'll for sure make it on time! This is a small place. I'd love to just order a large verson of the dinner salad, it's DELICIOUS. Next trip we'll go w/friends and order that huge gondola of sushi. Have been there twice so far, no complaints. Haven't tried the hibachi rooms yet."
        }, 
        {
            "index": 133, 
            "rating": 5, 
            "review": "This is our go to place for sushi. Place is always neat and the servers are pleasant. I recommend you to try pink lady sushi. So delish!"
        }, 
        {
            "index": 134, 
            "rating": 5, 
            "review": "Wow! Service was awesome.  Food was great.   Most importantly, kids loved it.\n\nFree hot sake with a yelp check in so i had to pair that with a draft Sapporo which was literally ice cold!\n\nI had the sashimi salad - fish was fresh topped with roe and amazing dressing with just the right kick of spiciness.  \n\nKids had the chicken teriyaki,  beef yakisoba.  Quality was great.  \n\nMy lover had spicy beef -adorned with shrooms, peppers, and carrots.  The beef were chunks of steak.\n\nPricing is reasonable and we left with to-go boxes.\n\nOh and they had good boba."
        }, 
        {
            "index": 135, 
            "rating": 5, 
            "review": "My favorite Japanese restaurant in Las Vegas . \n   Their food is some of the best I have ever had . The staff here is very friendly and helpful. The service is always on point.\n    For fun day. Try Habachi grill ! Also sushi is very good quality too.\n    I love here and for sure I will come back again and again ."
        }, 
        {
            "index": 136, 
            "rating": 5, 
            "review": "One of my favorite restaurants in Vegas and its close by! The staff is really nice and excited to see my family and I every time we walk in.\n\nThe teriyaki salmon is my favorite from the lunch menu. I crave it and its greatly priced. Also the shrimp tempura, must get. \n\nI love taking friends from out of town to hibachi, they feel like we are really going all out at a fancy Vegas restaurant. I'm like a kid watching them cook in front of me. \n\nMy mom tells me i need to stop telling people about her favorite restaurant. Lol :)"
        }, 
        {
            "index": 137, 
            "rating": 5, 
            "review": "Head off the strip a few miles for the best hibachi in Vegas and for an amazing price. Make a reservation on weekends and don't forgot to check in on Yelp for a free small sake."
        }, 
        {
            "index": 138, 
            "rating": 4, 
            "review": "More like a 4.5 rating!\nSecond time back with a $20 off and ordered the right thing...ohjah boat!  It was definitely a winning boat.  We received 3 specialty rolls (our choice), 12 pcs of sashimi (4 salmon, 4 ahi tuna, and 4 hamachi, all were 1/2 inches thick, biggest slice of sahimi that I have seen), 10 pcs of nigiri, and a seaweed salad.  The fish was very fresh.  \n\nWe also had the lychee sake and I thought it was very refreshing, even for a non-drinker like myself.\n\nOur waitress was very attentive and friendly.\n\nOverall, I enjoyed it very much, and will definitely return to try the hibachi."
        }, 
        {
            "index": 139, 
            "rating": 5, 
            "review": "Oyishi ( meaning very good in japanese) for Ohjah!! I freaking love this place! My friend and I decided to give this place a try, she had told me this place had so many good reviews and the pictures made us drool!!! YELP REVIEWS did not lie! This was so gooooooood!!\n\nWe started witht he Edame and the wontons.. Very delicious not that pricey about $3.95 each for appetizers..\n\nThen for our entree we ordered the Ohjah boat which consisted of 3 rolls of your choice along with sashimi and seaweed salad for $49\n\nAnd also we ordered the New York Steak Teriyaki..$14.99\n\nFrom the moment they served the food we were in awe., Loved the presentation and love how the Boat full of sushi was huge! Loved the detail with the food presentation as well. The sushi was amazing! It melted in your mouth and you can tell the sashimi was fresh with the correct temperature without the VEINS popping in your mouth! As for the teriyaki steak it was to die for!\n\nSo in the end we couldnt finish everything.. we didnt even need to order appetizers we were so full we had so much left overs from the sushi and the steaks..\n\nBut of course we still made room for their famous tempura icecream which was so good!\n\nI must say you can tell a huge difference when ordering from an all you can eat sushi place.. \n\nOhjah is one of my top 5 japanese place and I will of course return  and will be a loyal customer!\n\n\nP.S. they also have the hibachi tables if you are into that.."
        }, 
        {
            "index": 140, 
            "rating": 3, 
            "review": "Currently at ohjah. My girlfriend and j have been waiting 50 minutes and barely ordered 10 minutes ago. Food was good but wait was terrible. Probably Would revisit \n\n\nEdit:the owner got back to me and that is very professional on his part! Due to this I will change my rating and I will continue to be a customer. Hopefully it's just a little faster next time\n\nI would recommend the garlic edemame, shrimp tempanaki, and the shrimp tempura, best parts of my meal."
        }, 
        {
            "index": 141, 
            "rating": 4, 
            "review": "Staff is beyond friendly, everyone will thank you - all smiles.  This is my 2nd time eating here: salad and entree was delish, however the soup was pretty much water. The 4 in our group sent it back; we agreed it was like watered down canned broth. It was all liquid and some wonton strips... No scallions or mushrooms. Three filets were ordered and cooked perfectly, I ordered salmon which was a bit dry but I used a dipping sauce which satisfied my taste buds. Serving portion is huge - no need to order any appetizers if choosing hibachi. We also ordered a bottle of Fuji apple sake, only 8% alcohol so it's very weak.  You need to like apple juice because it tastes exactly the same and just as sweet."
        }, 
        {
            "index": 142, 
            "rating": 3, 
            "review": "Great food and fun atmosphere. My husband and I actually love this place and think the price is reasonable. The reason for my three star instead of five star rating is because of the \"extra charges\" they put on our last bill. We spent almost $200 on food, so to be charged for something like refills on the iced tea was very annoying! We were celebrating a birthday and anniversary, we asked the waitress if they would sing happy birthday. They sang and brought out a small piece of cheesecake, then charged us for the cheesecake! I have never been charged for a \"birthday\" dessert! I'm sorry but if I just spent almost $200 on food the least you could do is throw in the slice of birthday cake. I really like this place but charging us for those silly things will make me think twice about going there next time. In fact, the next time I have a craving I will try the hibachi place closer to my house."
        }, 
        {
            "index": 143, 
            "rating": 5, 
            "review": "A friend took me to dinner to this new place ,just open about  few month.\nSo far, the 1st impression that it gave me was expensive dinning,but after my dinning experience I realized that I was totally wrong. \nIt was by for the best Dianne I EVEN HAD.very reasonable price for an excellent quality of food and service. I think that's why the parking lot is always packed~!!!\nI'd recommend make reservation B4 you come spcielly on weekends(sushi chef told me)\nI set at the bar coz the hibachi was full~(it was an hour wait time on that side) we tried the sushi.The fish was super fresh ,Chef was friendly and funny at some point.If they have a little of time they even make some special dishes not listed on the menu and I got the wahoo, so yum~!!\nThe manager was keep asking us how's everything and told us about hibachi,such a nice and funny guy~\nI'm coming back next time to try the hibachi table,seems that is really good.no regrets, I had a wonderful sushi and enforgettable dinning experience!!!!"
        }, 
        {
            "index": 144, 
            "rating": 1, 
            "review": "Itook my daughter for her 8th birthday with her 6 friends. Very well behaved children keep in mind. I choose this resturant as we had been several times in the past. Unfortunately  the day of the party showed me why it'll be the last time I'll never give them my business again. First we arrived 20 min early for our reservation, we were seated 10 min early and 1 guest hadn't arrived. They sat us down and said they wanted order before last guest arrived even though we were early. The habachi was by far the worst we've ever had the chef was an older gentlemen who was grumpy and not into it. My kids were more into the other chefs serving other people. I've never in my life been so rushed to finish dinner, without asking me the waitress brought out cupcakes while the kids were still eating their dinner. They did not ask me if I was ready, she lit the candles and came out singing off tune with just herself. Because there was 8 of us my tip was not my choice then the owner came up and said is there something wrong? In the same sentence he told me he didn't need the table but then said if you want to relax and eat come at a less busy time. I was once a loyal company and do were the other 7 parents of the other children, now all 8 couples will not return and we'll make sure to tell others about our experience. I held my tounge until the owner passive aggressively approached me. We sat in the front lobby for 20 minutes  after that waiting  for parents to come. It was raining like crazy and I wasn't going to  have 7 8year old standing outside and I wasn't about to stay after the owner said his piece."
        }, 
        {
            "index": 145, 
            "rating": 5, 
            "review": "This was my first experience at a Hibachi restaurant. Loved it, super good. You get a salad and soup with your meal and it's perfect. \nChef Ken was our chef he was fun and very nice. \nMy only tiny complaint was that I should have ordered another protein, the amount of shrimp you get isn't a lot. \n\nIf you check in here you get a free small sake too which is a cool thing for this place to do."
        }, 
        {
            "index": 146, 
            "rating": 5, 
            "review": "This place is amazing. I have been to the 215 and Flamingo place and the menu is the same, interior very different here. The nigiri hamachi is melt-in-your-mouth fantastic. Excellent menu, fast friendly service. Reasonably priced drinks and appetizers. The sushi is fresh and delicious. The only drawback is it is not open until 3pm, I tried coming here for lunch on a Saturday and it was not open. But dinner is terrific, check this place out!!"
        }, 
        {
            "index": 147, 
            "rating": 2, 
            "review": "Ordered the beef yakisoba lunch box. Yakisoba lacked flavor."
        }, 
        {
            "index": 148, 
            "rating": 5, 
            "review": "My wife and I joined friends at Ohjah Japanese Steakhouse (Blue Diamond and Decatur) recently. I was a little hesitant about the restaurant choice because I've never had a taste for sushi, but the majority rules, so I agreed. It was the night before New Year's Eve, and the restaurant was pretty much filled. Chefs were putting on shows at many tables. Patrons were clearly enjoying themselves; the restaurant was buzzing with laughter and excited chatter. Our service started off a little slow, but soon we had our appetizers. Everyone in our group had sushi; mine, thankfully, was cooked. And it was very good! Between the delicious appetizers and the salad, I was enjoying myself in spite of my earlier reservations about going to a restaurant known for its sushi. I could have left at the point and been very satisfied. \n\nBut then the chef - I believe his name is Van - came over to our end of the table and started an amazing display of acrobatic and culinary showmanship that was a joy to watch. He introduced each element to us and was soon flipping things into the air and even flipped a cup into his hat all the while keeping a fast beat with his cooking tools. Fascinating to watch! The scallops and shrimp were excellent, and the vegetables were cooked and seasoned to perfection. But the standout was the steak. The most tender and flavorful steak I've had in years. Melt-in-your-mouth with no fat or waste at all. And we had more than enough to take home for leftovers. \n\nWe left late, and as the chef and then the waiter cleaned the table, we asked what they were cleaning with. Lemon juice, they said - no chemicals. That impressed us. And he said they would clean it again the next morning. Overall, we were very impressed. Delicious food, very clean restaurant (even the restrooms were immaculate), friendly service and a terrific show, too. The Ohjah at Blue Diamond and Decatur is definitely worth revisiting."
        }, 
        {
            "index": 149, 
            "rating": 4, 
            "review": "Awesome, our family loves coming here. Our 2 year old enjoys the little show they put on and he eats well every time! They were very accommodating with my infant in the car seat. The fried rice is so yummy. Sashimi is awesome! \n\nMinus 1 star because every time we come the server/host(ess) seems to always rush us in ordering our food. I understand there are other families in the group and of course we don't want to keep them waiting but both times, the others have barely ordered their appetizers and with two littles ones..we have to get ourselves situated and be able to read the menu while fighting with usual \"kid\" stuff at the table. This time, it seemed like she was already frustrated that we needed 5 minutes to decide what we wanted. \n\nAnyway, we ordered 2 hibachi dinners, one with NY Steak & the other with Teriyaki Chicken, a Rainbow Roll, Calamari, 2 orders of Tuna Sashimi, a large Sapporo beer, and Apple juice = ~$90 with tip. Not bad - will definitely come again."
        }, 
        {
            "index": 150, 
            "rating": 4, 
            "review": "Great service. Very attentive staff.\n\nVeggie egg rolls very tasty and it seems they give good attention to the main dishes.\n\nTypical fare.\n\nWarning: \n\nThe plum wine is VERY sweet....like Moscato on steroids - and I enjoy Moscato. Sure, I expected sweetness but had to dilute it with water and ice to drink it as I don't sip wine. Did I say VERY sweet...almost syrupy. Guess I should have known better...my bad.\n\nHad the green tea ice cream. Will not try that again.  The \"crust\" in which the ice cream is wrapped was not to my taste so I mostly ate the green ice cream...not bad on it's own but not a fav.\n\nNonetheless, they pulled out 4 stars for an overall grade to be fair.\n\nBTW...\n\nIt was March and they had a fully decorated and lit Christmas tree up.  Jokingly, ask the waitress about it and she had no idea other than to say \"...no room to store it.\"  Now that was funny. The tree was right by our booth. Pleasantly unexpected."
        }, 
        {
            "index": 151, 
            "rating": 5, 
            "review": "My 2nd time eating here and food and service is amazing.  Plus super clean.  Love it"
        }, 
        {
            "index": 152, 
            "rating": 5, 
            "review": "We ordered appetizers, sushi, beef sukiyaki and teriyaki chicken and fried rice.  Everything was delicious.  Very flavorful.  Will come back for sure !"
        }, 
        {
            "index": 153, 
            "rating": 5, 
            "review": "7 of us went on a Sunday afternoon about 4:30 to the hibachi grill. Within a half hour, they were full so just a heads up you can make a reservation. When you do, request Van for your chef. His excellent skills provide lots of entertainment and the dishes were excellent. We had filet, New York steak, chicken teriyaki. I requested my filet be cooked rare which is somewhat difficult to do when they cut it up on a grill, but it was cooked perfectly. Very tender and juicy. The others enjoyed their meals as well. The onion soup is delicious and even the kids ate it although we didn't tell them it was onion. Loved the fried rice and the crisp tasty vegetables. Looking forward to the opening of their new restaurant November 15 as it will be a bit closer to home."
        }, 
        {
            "index": 154, 
            "rating": 5, 
            "review": "My husband and I have been here at least 6 times in the last five months. We have never disliked anything we have ordered. The waitresses are always very sweet and accommodating. We tend to sit in the main part of the restaurant for sushi and chicken teriyaki (basic, I know) and it is always soooo good! We did try the hibachi side once when company was in town and it was tasty. We always take advantage of whatever YELP deal they have going, especially the free Sake"
        }, 
        {
            "index": 155, 
            "rating": 4, 
            "review": "I tried the filet mignonette hibachi.  The beef was very tender and cooked just right.  Clear soup and house salad were standard offerings and tasted good.  The only criticism was the fried rice was a little hard, so it needed some more cooking.  The service was excellent.  Overall, a very good meal.\n\nHUGE UPS for seating me at the hibachi grill, even though I was the only one ready to eat.  I have never understood why so many Japanese steakhouses won't fire up the hibachi for only one person, but Ohjah did for me and I appreciated that."
        }, 
        {
            "index": 156, 
            "rating": 5, 
            "review": "Had a very nice meal here; Unagi nigiri, mixed tempura, miso.  I lived in Japan awhile and I was very impressed with the authenticity and quality.   They also have teppanyaki.  Of course watching the Cubbies win while dining helped!"
        }, 
        {
            "index": 157, 
            "rating": 4, 
            "review": "Good time here at this location. The service, the food and the decor are all great. The only drawback is that the main door to the men and women's restroom (not the door to the restroom itself) is located right next to one of the hibachi stations.\n\nOne other bit of information. When you the chef is cooking all the food, listen to what other people are requesting to be done to the food. For example, someone requested well seasoned food, but you don't want well seasoned. Make sure the chef understands that request of both of you."
        }, 
        {
            "index": 158, 
            "rating": 5, 
            "review": "Went there for their Hibachi and enjoyed the show & food. Returned there today for their regular menu and we were not disappointed. Good food and service with avg prices. \n\nIf your looking looking for a nice Japanese restaurant or a good Hibachi show this is the place to go. This is going to be a regular spot for us."
        }, 
        {
            "index": 159, 
            "rating": 5, 
            "review": "We were seated very quickly and a server was there to take our order.   We did the 3 rolls special.   The summer breeze roll was one of my choices.   That was the lightest and best tasting roll I've had.  That's ideal for a quick lunch or a light dinner.  Very refreshing!  Definitely a will go back and I highly recommend trying that roll.    All the sushi is very fresh and great."
        }, 
        {
            "index": 160, 
            "rating": 2, 
            "review": "Excited and drove far out because it's opening 5 minutes by our house. Expectations weren't met:( so sad about about it. Fried rice lacks flavor does not compare to Hokkaido, Hamada, Benihana and Hikari. Do not order halibut, came with 5 bones:(((... And chef over cooked:( concept of add on good but failed to execute and quite pricey after all. Service not great but not worth coming back."
        }, 
        {
            "index": 161, 
            "rating": 5, 
            "review": "Great food. I eat here at least 1 or 2 or more a month. Do the hibachi. And also get to go food about the same amount of time a month. Hibachi side The chefs are amazing. Some are funnier than others. To go you always have amazing service."
        }, 
        {
            "index": 162, 
            "rating": 4, 
            "review": "I brought my cousins that were visiting from California to this location. The prices were incredible and the food was great!! However, the service for the Hibachi grill was a little slow because they couldn't get our grill to heat up. We were sitting there for a good 20 mins before our server explained to us what was going on. Luckily...the food made up for the delay and I will definitely come back to give them another try."
        }, 
        {
            "index": 163, 
            "rating": 4, 
            "review": "We went for the first time for their lunch special. I go the the stores next door often and always smell something good coming from this place. \n\nThere were only a few people in the restaurant as it had just opened. We were seated right away and our server was very friendly and polite. \n\nWe got the lunch special that was actually a really good deal! This place doesn't do AYCE and most of the places we go to do. The special included 3 pieces of sashimi (chef's choice) 3 piece nigiri, and a roll for around $15. The quality of the sushi was excellent. Everything tasted fresh. I can't remember the name of the roll I got, but it had a mango salsa on top. It paired really well!\n\nI want to come back to this place for more sushi and to try the hibachi! Definitely recommend it!"
        }, 
        {
            "index": 164, 
            "rating": 4, 
            "review": "It's so funny, that I couldn't remember eating here! It took me a bit to remember which is sad because I did enjoy the meal!\nI came here with friends, Erika T and Aileen, after a day of shopping at Primm.\nI ordered the tako (octopus) and it was delicious. The lobster roll tasted nice but it fell apart. (I think it was too drowned in sauce). The salad was ok, I prefer a ginger dressing that tastes like ginger.\nThe service was good, the prices are good too. I'll come back for sure, if I am in the area. It's alittle far from where I live for me to be a regular."
        }, 
        {
            "index": 165, 
            "rating": 4, 
            "review": "We came here for the hibachi for our 6th wedding anniversary, and had a great time! Fun, friendly, good food, and entertaining. Friendly staff and fun filled atmosphere. We will be coming back again!"
        }, 
        {
            "index": 166, 
            "rating": 5, 
            "review": "My husband and I have been coming here for years now. We absolutely love Ohjahs!! The food and service is always amazing. \n\nDo yourself a big favor - skip Benihanas and go to Ohjah!"
        }, 
        {
            "index": 167, 
            "rating": 4, 
            "review": "For the best experience sit at the sushi bar and get to know the chefs.  They offer great sushi rolls with many to choose from.  The sushi boat is a great value and comes with so much stuff.  Staff is friendly and it's always clean.   The boba tea is very good here too.  Awesome uni when it's available."
        }, 
        {
            "index": 168, 
            "rating": 3, 
            "review": "Service: Outstanding! Everyone in the restaurant wore a smile and had a great positive attitude! I give 5 STARs just on the service.\n\nAppetizer:  Fried Oysters.  I am from Eastern NC, so I typically like my fried oysters in a light batter.  The fried oysters batter was very thick and greasy.  It was also served with BBQ sauce.  \n\nDinner: The salad dressing that they serve is different.  It's almost like a mayo based ginger salad dressing.  It was not my favorite. I like that the portions are not HUGE, so you could actually finish it.  I like that the chef was VERY accommodating of how I wanted my food to be cooked.  He was very happy to cook my food separately."
        }, 
        {
            "index": 169, 
            "rating": 3, 
            "review": "The service was good... the food was fresh and tasty. I had sushi not teppanyaki so I can't review on that. Nothing memorable but it's pretty close to my house so I will be going again."
        }, 
        {
            "index": 170, 
            "rating": 5, 
            "review": "The prices might be deceiving but it's all worth it! The hibachi was awesome! I recommend getting the hibachi combination it comes with, salad, onion soup, rice or noodles, and 3 entrees for only $30! As an awesome bonus the chefs put on a show for you while they cook! This place is defiantly worth a visit."
        }, 
        {
            "index": 171, 
            "rating": 2, 
            "review": "Not impressed with this place.  Chicken is way over cooked, wait staff doesn't know the menu, and the prices seem a bit hi for the quality..  Not a fan at all.."
        }, 
        {
            "index": 172, 
            "rating": 4, 
            "review": "I love this place. It is fairly new and serve sushi and hibachi mostly. I have been there for both lunch and dinner (hibachi and regular dining) with my husband. The garlic edamame sets this place apart for me. The food is fresh and tasty. The hibachi chefs are fun and entertaining. The servers are pretty good, but have had just a couple issues. Ordered an appetizer once and it never came. When I mentioned to the waiter to just cancel it because our food was just showing up, the appetizer then came. They ended up comp'ing it because of the mix up and I quickly forgave them. Great, clean atmosphere. Other dishes available for those who do not like sushi as well. I highly recommend it for the cautious and daring alike."
        }, 
        {
            "index": 173, 
            "rating": 5, 
            "review": "I usually go there have sushi.\nI went there to have late lunch with my friend.\nWe had ohjah boat with my favorite rolls(dark cycle, cowboy, gentlemen's club).\nVery good price, 3 rolls were very tasty and sashimi was fresh. Service is always good.\nI always go there to have sushi. Haven't tried hibachi yet... Hibachi area is always busy. I will try hibachi next time for sure."
        }, 
        {
            "index": 174, 
            "rating": 3, 
            "review": "I have been here twice already, and it was okay.  Not sure if I would drive to that side of town again to go there.  We saw this place when we would eat at Cafe Rio which was across the street.  \n\nThe servers were nice.  The menu had a lot of selections.  They also served Chinese and Thai food.  Both times I have been there it was for sushi and not the hibachi, so I can't speak for that.  Thinking back, I can't even remember the name of the roll I tried and remembered if it was good.  Which goes to show it was probably just alright.  The restaurant is nice; and it is dark inside.\n\nThe funny thing, I do remember is that every time they brought out a dessert for a guest's birthday, the old school 'happy birthday' song (kids singing) would go on their sound system, haha"
        }, 
        {
            "index": 175, 
            "rating": 4, 
            "review": "We went to dinner here last night with our two small children, ages 3 and 5, and were pleasantly surprised. They treated the children great, and they loved the little chopstick holder that made it possible for them to eat with. The food was great and very reasonable. The only complaint is their onion soup is so-so, but all the other food and service made up for that. We will back very soon"
        }, 
        {
            "index": 176, 
            "rating": 5, 
            "review": "My 3.5 year old daughter loves to eat here.  We have only done the cooking tables and each time we go she has a better time then before.  At first the tricks scared her - but now she totally gets into it.  Typically she doesn't each much, but here she eats everything we put in front of her.  One day maybe we will get to the other menu items - but it is too much fun to watch her interact with the cooking table chefs and even more fun to watch her clean her plate."
        }, 
        {
            "index": 177, 
            "rating": 1, 
            "review": "Cook is awesome so is the food however the waiter was a joke!!! I am a regular every 3 weeks but after that customers service I will no lo get be a regular amazing! !"
        }, 
        {
            "index": 178, 
            "rating": 5, 
            "review": "Came here w my family and had hibachi. We were seated promptly and everyone was friendly. The menu had lots of choices for sushi and hibachi. They even surprised my mom with a happy birthday dessert. It was great food, great service, & a great time.  It was nice that we could go somewhere as a family.  My brother has a 4 year old son and things can get loud as we all talk with him & play with him.\n\nOhjah gets 5 stars for the accommodations, friendliness, clean restaurant, professionalism of the staff, quality of food, & prices.\n\nWe were seated promptly but we did arrive at 6:00pm. When we left at 7:00-7:30, there was a wait and small crowd at the door."
        }, 
        {
            "index": 179, 
            "rating": 5, 
            "review": "Fast and friendly service.  \nOur first meal in Vegas! Woohoooo!! \nWaiting for our food nomnom. I'll update what the food taste"
        }, 
        {
            "index": 180, 
            "rating": 5, 
            "review": "We decided to give this place another chance after a not so pleasant experience with one of the chefs last time. The owner was very understanding and set up a reservation for us to come back. We came for a late lunch around 3:30pm before the rush. The manager greeted and sat us on the hibachi side and the staff was very accommodating. We had Keith as our chef (aka \"Hello Keithy\" he said, which was pretty catchy) and he remembered us from a previous time. He's always very nice, friendly, and in a happy mood which is always a good sign. I do think that the staff's mood is a big part of setting a guest's experience. He was able to add extra garlic to my meal without acting like it was a hassle (which the previous chef was not happy about when I asked last time). My friend and I both had the shrimp and NY steak and it was very flavorful and well prepared. Next time I come in I'll definitely request Keith again."
        }, 
        {
            "index": 181, 
            "rating": 4, 
            "review": "Great experience! A friend of mine came in town for the holidays and we found this spot on Yelp. The restaurant was clean, comfortably tempered, and well lit. The front dining area has tables, as well as seating along the bar. We sat in the side room at the hibachi grill. \n\nThe food was great..I ordered the shrimp & chicken hibachi with fried noodles. My friend ordered shrimp and filet mignon with fried rice..everything was cooked to perfection. The hibachi chef, waitress, and bartender were all friendly and accommodating. \n\nI only gave 4 stars because the price to have Seabass as an add on in your habachi was higher than I would have expected. I would absolutely go back and recommend to others."
        }, 
        {
            "index": 182, 
            "rating": 5, 
            "review": "Fantastic hibachi! You have to order the basic first - which comes with onion soup, salad, and your choice of fried rice, steamed rice or noodles. That in itself runs about $8.95. Next you add on your choice of meat, fish, shrimp, scallops or lobster - these prices vary from $4.95 - $49. I ordered the teriyaki steak and it was phenomenal! My friend ordered the New York steak and he thought it was amazing as well. We also ordered saki with our meal, 2 large Saporo's and for dessert mango mochi. It was a ton of food and drinks, and I think we spent about $80 with tip for the chef and waiter. Our chef was funny and entertaining. Great experience and we will definitely be going back! Next time I will try the sushi and review."
        }, 
        {
            "index": 183, 
            "rating": 5, 
            "review": "You won't be disappointed here...good food and great service.  Friendly atmosphere with fair prices. We'll be back and will recommend them to others...thanks!"
        }, 
        {
            "index": 184, 
            "rating": 5, 
            "review": "Amazing food, amazing service.... You can't go wrong with hibachi. Bar only has beer, wine and Japanese drinks."
        }, 
        {
            "index": 185, 
            "rating": 5, 
            "review": "I love this place! It's right next to my house! I brought so many friends and family over here! I order rolls to go almost every week! Stuff is always nice and happy to see you:) I recommend to check it out! It's good for 2 or big party!!!!"
        }, 
        {
            "index": 186, 
            "rating": 5, 
            "review": "I think this could be the best bargain for quality hibachi food there is in Vegas! The staff is friendly and fun loving, the food is outstanding, the portions are great, and it is overall my favorite place for this type of dining!"
        }, 
        {
            "index": 187, 
            "rating": 2, 
            "review": "Picture this - Sea World and the dolphins are doing funny things to the sound of a whistle. Now flash forward to this eatery - minus the dolphins...it is the same thing. A group of people are seated around a grill in which the \"trainer\" or chef makes noises with utensils and then flips food into mouths of the people that pay $30 each to be treated like a sea lion and clap after being tossed a piece of shrimp. \n\nExcitement level - crazy weird. Not my thing, I would rather head to the real Sea World and laugh at the goofy dolphins and sea lions doing tricks for food than the Vegas elite...\n\nDecent food though..."
        }, 
        {
            "index": 188, 
            "rating": 5, 
            "review": "Love this place!!!\nI have eaten here several times with friends and always had excellent service and great food. I always do the hibachi and my favorite is the Steak and Shrimp. The choices are excellent and they fix it to your preference."
        }, 
        {
            "index": 189, 
            "rating": 4, 
            "review": "We came here with a crave for hibachi. We don't crave for hibachi very often but it happened to be one of those day, so we decided to give Ohjah a try. \n\nWe came here on a Sunday 6 pm but hibachi table was all full. Have to wait at least an hour. They do not serve hibachi food if you sit at regular table. So I highly recommend making a reservation or call ahead if you're going for hibachi. \n\nThe service was great, the manager was very friendly and polite explained to us about the wait. Our chef was also fun and engaging. We get to see lots of cool tricks as usual. \n\nFood was just alright. The crave for hibachi is all about that buttery garlic soy sauce fried rice! But it was kind of tasteless and missing the rich butter and garlic taste. Disappoint.. but the shrimp and filet mignon was good. I recommend adding garlic butter with your steak - Yum! \n\nOverall experience - not impressed. It's just what you can expect at an average hibachi restaurant. If we're craving for hibachi next time, we'll probably go for Benihana since now it's open in Vegas!"
        }, 
        {
            "index": 190, 
            "rating": 1, 
            "review": "I wanted to like this place, the one time I went the food was good, price was great, and hibachi is always fun (however the service was terrible, the waitress didn't speak english, seemed miserable, and came by to refill our drinks MAYBE once.)  However, I thought it would be a neat place to have my bday and bring 7 of my friends.  The day of my bday I called and asked if I could make a reservation for 9 pm.  They told me no, the only time they could fit me in was 8 pm.  A little too early, but I make my friends rush and we get there at 8 pm on the dot.  The employee at the front was SO RUDE, said there was no way i made a reservation because he was working   the phone all day and I didn't call, and then DEMANDS to see my phone as proof that I  called and made a reservation.  After I show him my phone, he says \"Was this today\"... umm it clearly is timestamped saying today. Then he says \"Well we have no room, you can come back at 9\". WHAT?! that was the original time I wanted and you said I couldn't have!?!?  Needless to say, he totally ruined my bday!"
        }, 
        {
            "index": 191, 
            "rating": 5, 
            "review": "The best Japanese and hibachi we've found in the Valley so far. Excellent for take-out, and the sushi is top notch."
        }, 
        {
            "index": 192, 
            "rating": 5, 
            "review": "We really liked this place. Nothing too fancy. The chefs were really great! We had hibachi. The salad and soup were delicious as were the vegetables, rice, and noodles. Very fast and pleasant service."
        }, 
        {
            "index": 193, 
            "rating": 5, 
            "review": "I came here with my family and my 4 year old daughter. We all had a blast and so did my daughter. The chef was hilarious and  the food was AMAZING. I got the chicken, filet, scallops, and a sushi roll which were all great. The prices aren't bad at all and they have a nice selection of sake.  Definitely coming back!"
        }, 
        {
            "index": 194, 
            "rating": 4, 
            "review": "Another quality meal from the team behind Ohjah. This is my second time at the restaurant and first at this location and the meal lived up to my prior recollections. Great service, lively cook, and a fun time all around. This time I went with the NY Strip and tried some filet from the person I dined with. This is actually very quality meat considering the price. Cooked exactly how I asked (medium rare) and seasoned tremendously. I am a true fan of the Ohjah experience.  For about $20 each you can really experience a hibachi themed meal here."
        }, 
        {
            "index": 195, 
            "rating": 5, 
            "review": "Always fast service here!\nThe seafood yakisoba and the lasagna roll is my favorite!\nFor a fun date , try the hibachi grill!"
        }, 
        {
            "index": 196, 
            "rating": 4, 
            "review": "Some great Hibachi! \n\nWent with some dear friends for a celebrated event. Service was moderate (we waited quite a bit, but we were a party of 15+). Hibachi was pretty damn fine Hibachi. Meat portions on the metal grill were scant so definitely get two upgrades.\n\nGlorious Oddity: The Thai Curry was the best Thai Curry I've ever had. Better than Pin Kaow. It was amazing. AMAZING.\n\nThe place is an excellent value."
        }, 
        {
            "index": 197, 
            "rating": 4, 
            "review": "I like coming here for their Sashimi. I'm so used to AYCE sushi that I compare it to Ohjah. So i only come when I crave Sashimi.Yum! They have Hibachi which I don't care for so the dining area is less busy."
        }, 
        {
            "index": 198, 
            "rating": 5, 
            "review": "I really enjoyed the food here. We ate hibachi. My lobster tail was amazing! The scallops were really good too. I'm craving it now haha! Was a very good first experience. I always see this place driving blue diamond. Glad that I gave it a try. Will have to do sushi next time!"
        }, 
        {
            "index": 199, 
            "rating": 4, 
            "review": "Came here for sushi last night, did not know what to really expect but to our surprise it was quite pleasant. My g/f and I split a blue diamond special, the sashimi and nigiri were good in a generic way. I suggest to get the white tiger roll it is fantastic and the spider man roll was good too. Onion soup was not hot and was kind of disappointing according to my g/f and the chicken fried rice was also so-so. Overall it was a good evening, the Sushi Chef that was serving us was super friendly and helpful."
        }, 
        {
            "index": 200, 
            "rating": 5, 
            "review": "We had a wonderful anniversary dinner at Ohjah Steakhouse. The food was very good and the service was top notch. This place is just as good or better than the other expensive Japanese Steakhouse restaurants but Ohjah is a much better value. We will be coming back here for sure. I highly recommend this place to anyone looking for a nice restaurant.\n\nThe menu has many tempting choices for you to choose from. We had the Hibachi dinner with New York steak, lobster tail, shrimp, and chicken. They were all perfectly cooked and delicious.  Next time i plan to try the sushi too. \n\n\nAlso, we met some very nice people at our table which made the experience even better."
        }, 
        {
            "index": 201, 
            "rating": 1, 
            "review": "Had gone many times with my children and had pleasant experiences. Even plugged them on Facebook videos and all. However last week we decided to go a little early for dinner around four for hibachi and it was empty we were literally the only ones there we asked to sit facing the grill not on the side because my kids get excited to catch the food in there mouth. The lady seating us told us no there may be another party coming in and she would have to move us. I couldn't believe it  there was literally no one else there and even if there was that was just rude. She also took the liberty of taking my cocktail menu. I decided to leave before we ordered it was obvious they were not interested in happy customers this day at least not us. I don't think we will be patronizing them again Luckily Vegas has a lot more options."
        }, 
        {
            "index": 202, 
            "rating": 5, 
            "review": "Last night was my 2nd time there and once again the food and the atmosphere was amazing. The two chefs I've had we're phenomenal and hilarious. Would definitely recommend this to friends."
        }, 
        {
            "index": 203, 
            "rating": 5, 
            "review": "Hubby took me here for mother's day, because I love Japanese food! It was great!\nNo wait (tho we went at I think 9pm) we didn't do the hibachi.\nEverything we ordered was great, fresh and delicious. And less expensive then we were expecting. And we got a free small sake!\nHighly recommend this place, we will be coming back for sure!"
        }, 
        {
            "index": 204, 
            "rating": 2, 
            "review": "Yoooo! Ohjah gets a big fat noooojah from me! I wanted to order the hibachi steak with fried rice but i was informed you can only get hibachi steak at the hibachi grill side. Fair enough, i was seated at a table so i just ordered their dinner ny steak that came with all parts of a hibachi steak minus fried rice and minus the hibachi. What my server brought out( i dont know his name but he was asian and skinny, so ill call him Chad) was this abysmal excuse of a ny steak. It was thin as hell, like it just got done fasting for 48 hrs and THEN ran a marathon. The taste was non-existant. For $17, you would expect a decent steak, lets just say that memo was not given to ohjah. The meso soup that came with it was awful. The salad that came with it was very good because of their dressing. So if you want a tasty salad, try ohjah. But If you want a good steak come to my backyard and ill whip one up on the barbie! Nooojah is a no go but Chad was the shit!:)"
        }, 
        {
            "index": 205, 
            "rating": 5, 
            "review": "I really love this place, and am sad I didn't know it existed until a couple of months ago. It's got everything going for it. The ambiance is beautiful, the waitstaff is friendly and eager to please, and the food it amazing. It's also very reasonably priced for the quality of food they offer. Ever since Nagoya closed down I've been looking for a good replacement. This place is even better than Nagoya in my opinion. I haven't tried the hibachi portion of this yet, I've only sat down for dinner but I'm willing to bet it's a positive experience."
        }, 
        {
            "index": 206, 
            "rating": 5, 
            "review": "We try to go to this restaurant about every other month.  Everything is wonderful - food, service, atmosphere and the show they put on the Hibachi grill in front of you.  Keep up the good work."
        }, 
        {
            "index": 207, 
            "rating": 4, 
            "review": "Great little place in Southwest Vegas off Blue Diamond.  Great hibachi.  Think, juicy meat sauteed just perfectly.  Real good sushi rolls as well.  Can't go wrong with this place either way whether you choose hibachi, japanese entrees, or sushi."
        }, 
        {
            "index": 208, 
            "rating": 3, 
            "review": "I've been here about 5 times in the past year since I've known about this joint. I've had their chicken katsu dish and I've had their chicken teriyaki bento box that comes with gyoza, white rice, california rolls and side salad and they did not disappoint.\n\nI like the fact that you get a good sized meal for a fair price and the staff is always friendly and attentive. I would like this place even more if they carried brown rice, but unfortunately they don't.\n\nI highly recommend this joint If your in the area looking for a quick bite and don't want to spend more than $15 on a meal."
        }, 
        {
            "index": 209, 
            "rating": 5, 
            "review": "We tried the Hibachi Grill!\n\nWe came in on a Friday night with a party of 11 for a birthday party but they seated us in less then 5 minutes (reservations helped). All the seats at all 6 hibachi stations were maxed out.  Really impressed with how fast we got in there.  Most places even with reservations you still have to wait a little.\n\nAll of us ordered the three choice option at the grill which was a lot of food for under $32.  I did shrimp, calamari, and chicken with noodles!  Oh wee it hit the spot!\n\nThe ambience is fairly quiet until the chefs do their thing to entertain then the sound level spikes up, but that's the whole experience it's part of the fun.  My kids (8, 6, 5) haven't had a hibachi experience since they were babies so they finally got to enjoy it.\n\nI checked in and got a free Sake!  Thank you for a great Friday Night!"
        }, 
        {
            "index": 210, 
            "rating": 4, 
            "review": "Great sushi.  Though not all you can eat.  The Holy Moly appetizer is AWESOME"
        }, 
        {
            "index": 211, 
            "rating": 5, 
            "review": "In my opinon this is the best Hibachi grill for the price in town. The food is always fresh and my g/f loves the cheap Sake! Enough said! I always tell everybody that they should make reservations because they are always busy. In fact I just made one just now for 7pm!"
        }, 
        {
            "index": 212, 
            "rating": 4, 
            "review": "This is one of our staple restaurants. There isn't usually a wait, but it does get busy and lively. We haven't tried the hibachi yet, but are looking forward to it. \n\nThe miso soup is good, and because I'm pregnant I haven't tried too much sushi. I did get a tempura shrimp roll once and was disappointed that the batter was soggy instead of crunchy. However, I recently had the shrimp tempura entree, and it was dynamite, so they clearly can make a mean tempura if they want. The tempura dipping sauce was a little bland. Many of their sushi specialty rolls tend to be on the hot side rather than sweet. I usually don't eat California rolls, but my husband did the other day, and it was the best CA roll I've ever had. It left me scratching my head wondering how a CA roll could be so good.\n\nTheir teriyaki is pretty good. Sometimes the chicken is dry, but the New York steak is consistently good, and tender for NY. They reportedly make their own teriyaki sauce, and do not use MSG, huge plus.\n\nAs for sides, their rice can be inconsistent, but their salads have good dressing and are pretty darn good for iceberg lettuce.\n\nThe service is decent, but there are some new servers who do things like put the food on the middle or end of the table instead of in front of the person who ordered it. Usually not a biggie, unless its hot soup they put in front of a young child...\n\nThat aside, it's one of our favorite \"regular\" places."
        }, 
        {
            "index": 213, 
            "rating": 4, 
            "review": "Our meals were very good. Atmosphere was a little loud to be able to have a conversation but very fun. Very good service."
        }, 
        {
            "index": 214, 
            "rating": 5, 
            "review": "I love this little local restaurant. I have been to another location and this one multiple times and have not left disappointed. They offer sushi at the sushi bar or anywhere in the restaurant and I find it to be of great value and excellent quality.  The rolls are large and filling, definitely worth grabbing if you stop in.  I also recommend the teppanyaki style dining, it is extremely affordable and is of much better quality and appeal than any of the large competitors like Benihana's or other teppan style restaurants in town. If you want to avoid the teppan, you can just grab an entree off the regular menu. We have tried many of the different options and all of them are greatly priced and extremely filling. Many times me and my wife will just split an entree and some rolls and leave their over filled with left overs. If you're ever looking for some good Japanese, I highly recommend it."
        }, 
        {
            "index": 215, 
            "rating": 5, 
            "review": "One of the top meals I've ever eaten!\n\nAlong with outstandingly fresh sushi, authentic yakisoba, perfect vegetable tempura, and melt-in-your-mouth mochi, the service there was the absolute best I've ever experienced. I don't write many reviews but felt this place needed my mentioning. \n\nNormally I research my restaurant options but yesterday we were starving and happened on this place so decided to chance it. \n\nAs soon as we walked in the door the staff rushed to greet us and then got down on the kids level and talked to them for a minute. Awesome! They were also very helpful and patient with our many questions about menu items and didn't seem irritated by our indecisivness. \n\nWe made our order and our rainbow roll was on the table within, not kidding, 3 minutes and was so SO fresh. As each dish was brought out and tasted, I was increasingly impressed. I wayyy overdid it on eating but the food was so worth it. The staff was very attentive and observant and when one of my girls started crying, they brought her over a small candy and talked to her. \n\nThey were very polite and rushed to the door to bid us goodbye as well. \n\nWe will be back for sure."
        }, 
        {
            "index": 216, 
            "rating": 5, 
            "review": "This place was so great! The service was amazing, food was delicious, atmosphere is fun and inviting, plus it has the best mochi I have ever eaten! We will definitely be coming back. My husband hates driving far to get good food, this place is definitely worth the drive."
        }, 
        {
            "index": 217, 
            "rating": 4, 
            "review": "As a sushi fan on a budget, this place hit the spot. Attentive but not overbearing staff turn out plates of sushi faster than you can fill your sake cup. Pages of special rolls that go beyond the typical Philly Roll and Spider Roll. \n\nWe ordered the Bonsai Dinner which included: \n\n*2 Special Rolls - Thumbs up for the Widow and Kamikaze Roll (smoked salmon? heavenly.)\n*TEN! pieces of Nigiri- no substitutions from the menu but the chef gave us top notch fishies\n*Seaweed Salad \n\nAlong with a large Asahi and hot sake our bill was under $60. A much better deal than the ever increasing prices of All-You-Can-Eat on every corner of this sinful city."
        }, 
        {
            "index": 218, 
            "rating": 4, 
            "review": "I like the atmosphere and their prices!! specially the 3 rolls specials for only $25. It kids friendly and very wellcoming people."
        }, 
        {
            "index": 219, 
            "rating": 4, 
            "review": "We ventured off the Vegas strip for this one. My friends kept asking me \"WHERE ARE WE GOING? IT'S SO FAR.\" In reality - a $30 cab ride split between 4 of us was WELL worth it. \n\nDelicious food. Our waitress was very attentive. Our chef was hilarious, easygoing, fun, and obviously a great cook.\n\nDefinitely try the shrimp tempura roll... one of the best I've had. And for Hibachi I recommend the shrimp, any of the steaks, and the fried rice. I wasn't really a fan of the chicken though... a bit dry for my liking.\n\nLove, love, love this place."
        }, 
        {
            "index": 220, 
            "rating": 1, 
            "review": "I give this place one star because of the food. We ordered the deluxe sashimi, The fish was not fresh n not cold. ordered beers, beers were almost at warm at my sake (seriously). Told the waitress,she changed it for us. Rt when we finish our sake, my bf said why do I have tea in my cup? the waitress was rt there when he pour the sake n a piece of brown cucumber fell out of the sake bottle, she took that bottle n ran off so fast. It was so gross I threw up! The service was great, definitely not coming back to this place."
        }, 
        {
            "index": 221, 
            "rating": 5, 
            "review": "This place is in our neighborhood and is very delcious! They have a special it's buy 2 rolls get one free! Rocky is so funny and nice he's one of the guys who creates the delicious rolls! Whenever I need a quick bite I come here!"
        }, 
        {
            "index": 222, 
            "rating": 5, 
            "review": "SERIOUSLY great service. The hibachi space has adequate seating so you don't feel cramped. Plus I got free saki just for yelping.\n\nThe hostess was really nice. When I showed her my YELP check in, I think she got just as excited as I was. With the press of a button *poof* just like that free hot saki. \n\nThe chefs are great here. They are not just entertaining but they have a certain swagger when rocking those knives and spices. The entertainment factor alone made the night cool. The food was super good. All of the other reviews are 100% accurate. Everything just melts in your mouth. I was a little hesitant about getting the shrimp because previous reviews said it tasted too fishy or something like that. Im not sure if they made some changes or what, but it tasted fine to me. The 5 star factor here are the employees. We went here to celebrate a birthday and they made it really special. It wasn't just about the song or the dessert. They made the entire experience memorable. Ohjah ill definitely be back."
        }, 
        {
            "index": 223, 
            "rating": 5, 
            "review": "I didn't get the young lady's name the last time I was here but I saw her today and had to shout her out!  Her name is Alice and she is really friendly.\n\nI pretty much got the same thing except this time I asked for extra garlic for the fried rice and veggies.  The vegetables were cooked just right--flavorful and delicious.  \n\nMaybe it was my driving, maybe not, but half of the rolls came apart by the time I got home but that didn't affect the taste one bit :)\n\nIf you are vegan be sure to ask for the ginger dressing with the salad.  I forgot this time and ended up with the mayo-based dressing.  \n\nStill good service.  Didn't have to wait long."
        }, 
        {
            "index": 224, 
            "rating": 3, 
            "review": "Went in for sushi with the family. Ordered 4 rolls, the squid appetizer (can't remember the name, kushi something), and the chicken yakisoba. The rolls came out right away. The kushi took about 45 minutes, and the yakisoba over an hour. The rolls were good and so was the kushi, but unfortunately when the yakisoba finally came, I couldn't eat it, it came with the paper from a straw in it. Had it come from my straw, I would've eaten it, but I was unsure where it came from, as it didn't come from our table.  We received a discount and the dish was removed from our check, but after an hour I was really looking forward to trying it. May not be returning..\nAs for the service, saw waiter a few times in the hour and 45 minutes we were there, but only received one update on the length of time for the yakisoba and kushi."
        }, 
        {
            "index": 225, 
            "rating": 1, 
            "review": "The food is great but the service as usual sucks the owner stopped us Rightaway and said for us to sit at the table and did not want to let us sit at the Hamachi table because there was an enough people had one table. (There was six of us)\nSit at the sushi bar you get the best service from the chefs in the back."
        }, 
        {
            "index": 226, 
            "rating": 2, 
            "review": "How did this place receive 4 stars?? I came in on a Thursday night after work at the Blue diamond location  and the service I can say was great but was totally subpar food. I enjoyed my Sapporo bottled beer but the filet and subsequent rice and vegetables sucked!!! The dipping sauces were watery and not flavorful so I couldn't remedy my overdone medium rare filet which was medium to medium well now at best. I have reviewed many restaurants on yelp fairly- and tonite this place was horrible. I hate giving bad reviews but ohjah please do something with your hibachi grill food!!! It is marginal at best!!"
        }, 
        {
            "index": 227, 
            "rating": 5, 
            "review": "This place is divided into two different Japanese restaurants, you can dine on the tappanyaki side or the regular menu side. Both are very delicious. There are so many tappanyaki restaurant and Ohjah has the best. The price is reasonable and the food is very good quality. The chefs are super fun and they definitely bring their unique tricks to grill. As for the regular menu side, it's a little more pricy but the food does not disappoint. I wish they offered All You Can Eat sushi, but they don't so getting the sushi platter or sushi boat would be the next best option. I love their sashimi and nigiri because their fish is really fresh. However, if someone your party doesn't eat sushi, they may not enjoy the selection on the regular menu and it would be more ideal to eat on the tappanyaki side of the restaurant. Lastly, I would have to say that the service is a little better on the regular menu side than the tappayaki side. It seems as though the waiters are a little slower and distracted on the tappayaki side. But on the regular menu side, I have to give two thumbs up to the waiters. Often times you order sushi at restaurants and there seems to be a language barrier or something, but here at Ohjah they usually understand what you're ordering and they rarely get orders wrong. I give the waiters a lot of credit for knowing their menu well."
        }, 
        {
            "index": 228, 
            "rating": 3, 
            "review": "Love the atmosphere, love the staff and the chef who put on an adequate show with his cooking skills in front of the patrons.\n\nFor appetizers, ordered the seaweed salad which was on par with typical sushi spots.\n\nOrdered the $48.95 dollar sushi boat + hibachi for our main entree. Presentation of the boat was good, except the sushi tasted just a-ok, nothing special compared to other sushi places we have gone to. The sashimi wasn't bad either, but didn't rise to the top. The tuna & salmon --- just okay.\n\nThe biggest upside is the hibachi. Having the chef cook in front of you never gets old to me. The hibachi basic + add-ons were all very tasty, although we noticed the cook did add A LOT of butter when he cooked.\n\nOverall, you should have a good time here. But if you want better tasting sushi in Las Vegas, you're better off at Oyshi, Sushi Tower or Nobu (on the strip)."
        }, 
        {
            "index": 229, 
            "rating": 5, 
            "review": "Great Atmosphere, fun for families as well as couples, service and crowd pleasing performance, the steak and sushi are high quality"
        }, 
        {
            "index": 230, 
            "rating": 3, 
            "review": "The food was whatever. If you don't like teriyaki make sure to tell them. The tricks were cool though and they did a couple I never saw before. If you really want to go to hibachi, it's an easy neighborhood choice."
        }, 
        {
            "index": 231, 
            "rating": 5, 
            "review": "I don't know what it is about their combination fried rice, but every time I order it, the planets seem to align and all seems right in the world."
        }, 
        {
            "index": 232, 
            "rating": 5, 
            "review": "Phenomenal food!! The sushi was amazing & so was the teriyaki beef wrapped around cream cheese with green onions!!! Yummy!!! The service was wonderful & the restaurant was so clean!!"
        }, 
        {
            "index": 233, 
            "rating": 5, 
            "review": "This place lives up to the hype!!  Excellent, really fresh food.  Great service and super reasonable.  Not like the overpriced hibachi restaurants near and on the strip. My family and I will be regulars for sure!"
        }, 
        {
            "index": 234, 
            "rating": 5, 
            "review": "Always busy on a Friday night. Staff is great and attentive. Food is really healthy and fresh will go back again."
        }, 
        {
            "index": 235, 
            "rating": 4, 
            "review": "The sushi and service are consistently very good.\n\nI always order the rainbow roll when I get sushi - for two reasons: it's my favorite and it allows me to compares restaurants. Their rainbow roll ranks well.\n\nThey just need a happy hour, or at least specials on Sake!"
        }, 
        {
            "index": 236, 
            "rating": 4, 
            "review": "This used to be my favorite restaurant. Still pretty good but I miss there lunch time specials."
        }, 
        {
            "index": 237, 
            "rating": 5, 
            "review": "Soo good and great laid back atmosphere."
        }, 
        {
            "index": 238, 
            "rating": 5, 
            "review": "The entire staff was very pleasant and friendly. Food was amazingly delicious! I loved the pomegranate sake, just yummy. Not only did our waitress check back with us more than once, but the waiter and manager did as well. The lighting was great, music was at perfect level, and they were even showing The World Cup on TV. I am impressed with the entire experience. I highly recommend them. People that know me, know I am not one to give 5 stars, be today, it was well deserved!"
        }, 
        {
            "index": 239, 
            "rating": 5, 
            "review": "Nice place clean and my favorite Sushi Chef Larry now works here Yah! So happy they have a huge menu."
        }, 
        {
            "index": 240, 
            "rating": 1, 
            "review": "We couldn't even eat here.... I mean really!! The guy at the front said that since we didn't make reservations we couldn't eat there. Maybe we didn't understand his broken English..... He said \"to eat you need reservation\"..... I didn't know I was going to be off work tonight.... It was a spur of the moment date night with the husband.... And we were refused service!!!! I won't be going back!!"
        }, 
        {
            "index": 241, 
            "rating": 4, 
            "review": "awesome food and CHEF! there are local spots that a tourist must try in las vegas... and this is one of them! great and entertaining chef :)"
        }, 
        {
            "index": 242, 
            "rating": 4, 
            "review": "Didn't get five because we come here weekly but it doesn't feel like we are appreciated!\n\nThe food is great and service pretty good.\n\nThe poke is what we get every time but now it's less and less poke!\n\nThey need to treat repeated customers better"
        }, 
        {
            "index": 243, 
            "rating": 5, 
            "review": "Went here Feb 27th, 2016. It was awesome. My mom was out for a visit from Ohio and want to take my niece and I out for dinner. They have great prices, great service, & great entertainment. Food was so good. I will be back."
        }, 
        {
            "index": 244, 
            "rating": 5, 
            "review": "This is our third time here. So far so good. Food is fresh.  well-prepared. quality is very good. price is average for sushi.  Service was excellent."
        }, 
        {
            "index": 245, 
            "rating": 5, 
            "review": "Food was awesome!  All five of our kids (2-12) loved it.  We ate in the dinning room this time and had sushi, chicken teriyaki, curry, edamame, mussels.  Everything was amazing. Our third visit to this location and we will definitely be back."
        }, 
        {
            "index": 246, 
            "rating": 5, 
            "review": "Best locals hibachi place Ive been to in vegas. Great prices service and food."
        }, 
        {
            "index": 247, 
            "rating": 4, 
            "review": "Want great sushi? Eat here. The presentation and service are great and their prices are reasonable. I love this place!"
        }, 
        {
            "index": 248, 
            "rating": 4, 
            "review": "The garlic edamame is my favorite here than the rest of the restaurants in Vegas.  The crazy jalapeno is delicious.  This are my top 2 dishes here.  I like the choices in wine and the yelp free sake is great to have.  The option of hibachi, sushi, or both is terrific.  Come try this location or any of the other Ohjah properties"
        }, 
        {
            "index": 249, 
            "rating": 2, 
            "review": "I'm not sure why the reviews are so high of this place, it's pricey and the sushi was mediocre at best. I had the special sushi dinner which was 3 choices of special sushi for $25.95. We also had the chicken teriyaki it's was OK as well. It just wasn't that good, we won't be back."
        }, 
        {
            "index": 250, 
            "rating": 5, 
            "review": "My boyfriend and I came out to Las Vegas for fun. I searched for hibachi grill and this was one of the first to pop up. We had to drive a little ways since we were staying at Treasure Island but it was definitely worth it. The sushi was very decently priced and yummy. Our hibachi cook was very good. The filet mignon was so juicy, tender and flavorful. I thoroughly enjoyed this place and highly recommend it. :) Would love to go back again."
        }, 
        {
            "index": 251, 
            "rating": 5, 
            "review": "This is our third time here but first time trying their teppanyaki. The a la carte menu has pretty good items including sushi rolls. Before tonight this was just a safe place to try decent Japanese near our home. Having the teppanyaki was the best decision! The cook also puts on a show, like the flaming onion ring volcano plus he launches shrimp from the grill into the patrons mouths. Now on to the food... we got the sukiyaki beef and NY steak (both prepared medium) as well as scallops, shrimp and salmon. For group of five, we just got 2 orders each of the above to share and it proved plenty. Totally loved everything we were served! I finished it all but the rest of the family had to get take out boxes. Also included were a cup of onion soup, salad with ginger dressing and grilled vegetables, which was also pretty good. The service is excellent! We'll definitely be back."
        }, 
        {
            "index": 252, 
            "rating": 5, 
            "review": "First time here tonight and everything was so wonderful. Came as a party of 8 and didn't know what to expect. I was confused to how to order at first but the waitress explained how the habachi worked.\n\nThe chef we had that cooked our food was hilarious and joked with me a lot. \n\nFood was just delicious. And the service we got from all the staff was amazing. I believe the manager even came around to see if everyone was happy and doing good.\n\nThey even brought out a cake for the birthday girl that was with us."
        }, 
        {
            "index": 253, 
            "rating": 5, 
            "review": "One of my favorite sushi restaurants! The food is great, prices are fair and the service is always on.\n\nChef David at the sushi bar is amazing! He is very creative and always has a smile. The sushi is always fresh and never disappoints. They have Sapporo and Kirin on tap, which is a nice compliment to the fresh sushi. They also have a habachi room that puts on a great show, fills you up and is very reasonably priced (the fried rice in there is awesome!)."
        }, 
        {
            "index": 254, 
            "rating": 5, 
            "review": "Order the sushi boat! its amazing! really filled us up! the hostess was really great as well, she kept checking up on us and was really nice. \n\nwe first had a small table, and when a slightly bigger table opened up, they we able to move us to accomodate as we wanted some elbow room which was good :)\n\nim very picky on my sushi places, so this place gives the thumbs up to me!"
        }, 
        {
            "index": 255, 
            "rating": 2, 
            "review": "I LOVE the food here, especially the buttery fried rice at the hibachi grill.  Everything I've had there is good and service is good.  Though I would like to give them 5 stars, I'm giving only 2 because they were shut down by the health department and featured on channel 13 news Dirty Dining recently.  I'm going to wait until I'm not grossed out anymore before I go back.  But I'm guessing I will be back."
        }, 
        {
            "index": 256, 
            "rating": 5, 
            "review": "Best Japanese Steakhouse in town! Prices are fair, service is excellent."
        }, 
        {
            "index": 257, 
            "rating": 5, 
            "review": "bomb..bomb.. .always great food, funny chefs, one of my favorite spots..i always get 3 item filet, shimp, and scallops..yumm.."
        }, 
        {
            "index": 258, 
            "rating": 5, 
            "review": "We come here every week and never disappointed with the quality and service.  I also like the flexibility from the chef, always willing to make anything you want.  Check it out, great sushi!!!"
        }, 
        {
            "index": 259, 
            "rating": 4, 
            "review": "I really enjoyed this place. Its very typical of what i expect from a Japanese Steakhouse and Hibachi room. They also had sushi and a limited thai menu making it great for a large group with varying tastes. They didnt do Hibachi at the normal tables which I found a bit shortsided. Many friends like Hibachi but they dont like the smell their clothes take on. Overall, the service was very on point, prices were very reasonable, food quality was very good. The filet I had was good, but not the highest quality. The chef cooking was alot of fun. Had a few new tricks I haven't seen. Another must visit destination."
        }, 
        {
            "index": 260, 
            "rating": 5, 
            "review": "Dynamite roll is just that-dynamite!\nThe Sushi was off the charts delicious and the service was terrific also.\nI was also happy to see that Hibachi dining was available which is always a plus when you've got kids (I don't, but my friends do).\nI've been here twice-once at the Sushi Bar and once at the Hibachi table; both offered great food, good service and a reason to come back."
        }, 
        {
            "index": 261, 
            "rating": 4, 
            "review": "I can only speak for the hibachi side. I LOVED IT. We each ordered the combination with filet mignon, shrimp, scallop and calamari. My boyfriend had the fried rice and I had the fried noodle (chow mein).  I would just like to say it was so delicious and melts on your mouth!  We loved our chef and our food, but whilst eating dinner a check gets dropped off then 5 minutes later the manager checked if we paid.\n\n Although I understand that maybe as hibachi tables stand, there's another group of people coming in, we still felt rushed and needed to get out. We were there to celebrate and to drink with really great food, but we were cut short. I hate feeling like we're being rushed out, especially when dessert wasn't offered. Because we felt like we needed to clear out, we didn't even get to look at the dessert menu again, and I wanted dessert! I mean, we were celebrating. We would've ordered another round of drinks with dessert, but wasn't given the chance and that is the only complaint."
        }, 
        {
            "index": 262, 
            "rating": 4, 
            "review": "Note: Can't comment on the hibachi because we did not choose that option.\n\nCame here for a dinner with the family as a first-timer and I was pleasantly surprised. The food is great. I recommend trying the Holy Moly and Gyu-Ishiyaki for starters.\n\nService was great as well. We were served by a really nice young lady (I forgot her name, sorry) who was extremely polite.\n\nA great place to try if you're undecided on a Japanese restaurant. :)"
        }, 
        {
            "index": 263, 
            "rating": 5, 
            "review": "I have eaten here on multiple occasions always Hibachi which is awesome and great fun as well."
        }, 
        {
            "index": 264, 
            "rating": 3, 
            "review": "Went with my colleagues (8 people) around 5PM and was seated right away. It took some time for the chef to show up but we didn't mind since we had our drinks and the free sake after checking in Yelp. I had the New York steak hibachi which was ok. Service was great but their sake menu was very limited. \n\nBottom line: great service, inexpensive, average food and limited sake options."
        }, 
        {
            "index": 265, 
            "rating": 5, 
            "review": "My husband and I decided to check out Oojah the other night for a late lunch/early dinner. I loved the decor of the restaurant. Very nice looking! The staff was all very friendly and accommodating as well. \n\nWe made it in time to enjoy their lunch box specials, which were smaller and cheaper versions of their dinner boxes. I got the chicken katsu box while my husband got the beef teriyaki box. I couldn't believe the size of the boxes when they were brought to our table! Not only was my portion of the chicken katsu huge, but it also came with miso soup, salad, pork dumplings, and three California rolls (perfect because I am pregnant and can't have traditional sushi). The food was great and very filling! \n\nI felt the prices were fair for what we ordered and even looking at the menu, the sushi prices I felt were reasonable as well. \n\nWe'll definitely be visiting Oojah again and I can't wait until I am able to try out their sushi!"
        }, 
        {
            "index": 266, 
            "rating": 3, 
            "review": "Nice show,but I like my food to all come at once.I didn't like that the vegtables came out way before the meat was cooked??I think this type of food should all be cooked at the same time.The meat and vegtables were good,but the portions were small.\n  I think with a few upgrades this could be 5 stars."
        }, 
        {
            "index": 267, 
            "rating": 5, 
            "review": "Overall, great food! I ordered the chicken teriyaki, and yes I have had it before, but not prepared the way it's done here. My dad ordered the chicken fried rice and raved about it all night. Again, great food, and I would definitely recommend this spot to anyone looking for great sushi and great Japanese food."
        }, 
        {
            "index": 268, 
            "rating": 5, 
            "review": "Had another wonderful dinner with great friendly service. Will be coming back to try out some of their other delicious baked sushi next time!\n\nThis was the best Japanese restaurant we ever ate.\nOur waitress  was the most wonderful"
        }, 
        {
            "index": 269, 
            "rating": 4, 
            "review": "The sushi rolls here are to die for, so elegantly decorated and every bite wants to you to have more. I thought cream cheese in the middle was a bit odd but now \"Dark Cycle\" is my favorite roll. The ambiance was great and they had a large TV to watch last nights NBA game which was nice. The reason why I'm giving a 4 star is b/c of the service. Our waitress had to be called over four times to get more water, the check, etc. We even had to get a different guy to get some of those things. I would definitely come back with my handy groupon."
        }, 
        {
            "index": 270, 
            "rating": 5, 
            "review": "Oh man...great teppanyaki and at a great price! I came for dinner for Father's Day and tried out the teppanyaki. I love how they do their offerings. They separate the meats by section and individual price so that you can mix and match your plate however you want. I chose the NY strip steak and the shrimp. My sister tried the scallops and NY steak. MY father tried the sukiyaki beef and NY steak, and my brother in law tried the Salmon and chicken. \n\nYou start with the $8.95 basics which includes the the option of fried rice, steamed rice, or noodles, soup, and salad. This is MANDATORY for teppanyaki. Then you pick from the list of meats you'd like and you just mix and match. They also offer kobe beef at $50 and lobster tail also at $15. The dishes and offerings are typically what you'd expect for teppanyaki. Same quality and flavor. Next time I would love to try the filet minon instead as I wasn't too fond of the NY strip steak. It was tougher and less flavoring. The sukiyaki beef is A GOOD CHOICE. They're full of flavor, tender, and juicy! \n\nOur chef was great, He was funny, and very patient with obnoxious children. So big ups to him. For a total of 4 people plus an order of a glass of reisling and tempura ice cream we spent a good $100.00. Woohoo! What a deal! That's compared to my tab at Musashi which was $160.00 for 2 people! Same quality of food. Same service. Cheaper price. Call me a fan! I'll be back soon!"
        }, 
        {
            "index": 271, 
            "rating": 5, 
            "review": "Really good sushi great presentation came in a boat great family atmosphere 3 rolls for $25 so it's not quite all you can eat but still got filled up for under $100 family of 4"
        }, 
        {
            "index": 272, 
            "rating": 4, 
            "review": "First time coming here, my mom recommended this spot. Sushi was served really quick, Danny made me a special roll.\n\nI gave them 4 stars just because the rolls are super tiny, they are still good tho."
        }, 
        {
            "index": 273, 
            "rating": 2, 
            "review": "The last time we ate at Ojhah in Las Vegas was in 2014.  They impressed us so much that we came to try their Hibachi this time.  TIP:  Apparently you need reservations for the Hibachi.  We didn't have any so we had to wait 30 minutes.  Luckily there is a drug store next door you can pass the time in.  We were seated with a lovely family of 6.  All together there were 4 kids under 10 years old, our 2 teens (14 & 16 years old) and 4 parents.  The other Hibachi got the more enthusiastic chef.  Ours was just meh.  The fried rice made via Hibachi is always good but the meat (chicken) was kind of dry and tasteless.  I guess that's why they give you sauce.  What they did not give me was my free sake for checking in via Yelp.  I did order a salmon skin hand roll which was excellent.  I think they do better with their sushi than their Hibachi.  I'd probably return for their sushi, but I was not at all impressed with the Hibachi."
        }, 
        {
            "index": 274, 
            "rating": 2, 
            "review": "The rolls we ordered were cold and the sushi was small . The rice was really sticky. It was a little on the high side when it came to the price,the sauce in the rolls was too sweet.  The waitress was hard to communicate with but she was nice. I don't think I will becoming back here again there are other sushi joints in the area that are better when it comes to food service & prices."
        }, 
        {
            "index": 275, 
            "rating": 1, 
            "review": "The service was the worst we have had iin years. My wife and I ate there tonite. We live near by and have been waiting for it to open.  We were seated right away. The waitress got our drinks took our order for an appetizer that came in 10 minutes. We then ordered a 3 roll  sushi special. That took 25 minutes to come. Way to long. We never were asked if we needed a refill on are drinks even when mine was empty. Then it took 20 minutes just to get the waitresses attention to get the check. After she brings the check she says do want a refill. ( ya right after I'm done eating) I said no that might take another 20 min. It took us an 1 hour and 20 minutes to get out of there on a single order. We will never go there again. Oh, and the people at the next table complained the the manager to. He gave them a free desert wow. Food was good but not worth the bad service and long wait time. We were there at 6pm"
        }, 
        {
            "index": 276, 
            "rating": 4, 
            "review": "The food was pretty good and very reasonably priced. We had a couple sushi rolls with some chicken curry. Everything was solid and I'll be going back for sure."
        }, 
        {
            "index": 277, 
            "rating": 5, 
            "review": "I wasn't so excited to go to this restaurant. I was pleasantly surprised!  Everything was very clean and fresh. I am picky and I was able to trust the chef. He cooked everything perfect and flavored to my liking without my making any special requests.  The service was excellent!  I have never been in and out of teppanyaki so fast! I was hungry, and I was fed!  I've been going to the same teppan restaurants for years, I think I have a new favorite =)"
        }, 
        {
            "index": 278, 
            "rating": 3, 
            "review": "Not a good experience tonight. Usually everything is great but tonight was pretty bad. We took our friends and their 11-year-old son for the first time to experience the restaurant.  Our chef was very nice but was boring. He did the volcano trick and the eggroll trick but that was it. Our friends son was really looking forward to the shrimp tossing but we never got it. Also, my husband ordered the Seabass and it was absolutely disgusting!!! It was a very bad piece of fish that smelled AWFUL!!!! He didn't eat it. And when we let the chef know, he said he would let the manager know. But then we had a remind the waitress, who came back and took it off the bill. But he was never asked if he was still hungry or wanted anything else. They brought out the check and were never offered dessert. Looking forward to the Pecos and windmill restaurant opening up. We'll be back, because we've always had a good time here."
        }, 
        {
            "index": 279, 
            "rating": 3, 
            "review": "Service was good, our rolls came out extremely quickly. The rolls had too much rice for my taste but it was decent 3/5 stars."
        }, 
        {
            "index": 280, 
            "rating": 5, 
            "review": "Ohjah is the type of place you feel compelled to open a Yelp account for just to tell people how much you love it. \n\nBy far the best hibachi in town. The prices are right, the service and cooks are awesome - genuinely nice people there. \n\nOn a couple occasions if we found ourselves waiting for a bit for a few other people to join our cooking area, they've offered a free appetizer or a free drink. Not sure if that is official policy but it definitely was nice. \n\nThe food is amazing. My girlfriend regularly gets the Salmon. I get Lobster and Filet.\n\nOnly have had a couple of the sushi rolls, mainly go there for hibachi, but they were great!\n\nAlways a fun atmosphere, always someone's birthday. \n\nIf they could fix ANYTHING it would be to get a better birthday song for their iPod. Man. It's bad. And you'll hear it 1-5 times during your visit. \n\nBeyond that, excellent place. Absolutely try it."
        }, 
        {
            "index": 281, 
            "rating": 5, 
            "review": "We come here at least once a month to once every couple of months. We especially enjoy eating at the Hibachi side and we always, always request for VAN when we make reservations here. \n\nSince Ohjah first opened here, we've had many other chefs. My whole family agrees that Van has been our best chef there. \n\nFor take out days, we love ordering their sushi rolls specials which is 3 orders of rolls for about $25. Such a great deal and all the rolls we've had here so far have been delicious."
        }, 
        {
            "index": 282, 
            "rating": 5, 
            "review": "Great Hibachi and Pad Thai! Staff is friendly, nice, and quick.  Great neighborhood atmosphere.  Live hibachi style seating or just sit in the front for a quick bite.  Food is always fresh and delicious.  I completely recommend this little hideaway.  It has become one of our favorite places to eat.  Thank you!"
        }, 
        {
            "index": 283, 
            "rating": 5, 
            "review": "Weeks of enduring the heavenly aromas of teriyaki goodness sizzling away on hearty grills, wafting across the road every time I drove by this restaurant, are what brought me to Ohjah.\n\nAs the restaurant was being built, and when it finally opened, I remember thinking (with a raised eyebrow), \"Another restaurant in a strip mall... hmm.\"  I'm very glad for the overly enticing smells coming from this place, otherwise, I may not have found one of my new favorite restaurants, and a true hidden gem.\n\nLet me just say, right off the bat, that a prerequisite for working at this restaurant is to be one of the most genuinely nice and polite people on the face of the earth; I have never seen such friendly service... EVER.  We are greeted promptly and warmly every time we dine here.  The servers are always very attentive, and extra dishes are removed right away.\n\nThe restaurant is divided into two sections: the hibachi grill side, and the regular restaurant side (which includes a large sushi bar, booths, and tables).  Although I have only ever eaten on the regular restaurant side, I must say I will definitely try the hibachi side one day because of the sounds, smells, and action coming from that room are incredible! \n\nThe food is also incredible.  Some of the items we have had are: teriyaki scallops, tempura (vegetables and shrimp), numerous sushi rolls (the Black Widow is amazing!), nigiri, sashimi, miso soup, and the house salad.  All were equally delicious (and I'm finding myself strangely addicted to the house salad dressing -- it is mayo based and surprisingly light).  I did find the teriyaki scallops to have a bit too much of the \"char\" bits on them, but other than that, they were cooked perfectly, and the sauce complimented the flavor of the scallops very well.  The food is always fresh and delivered in a timely manner, and the plating is intricate, balanced, and inviting.  The prices are affordably appropriate as well.\n\nI read in another review that this restaurant would be a great \"first date\" place to go, and I wholeheartedly agree (for the hibachi or the regular restaurant side).  The ambiance is very pleasant with simple and beautiful artwork on the walls, and low lighting, giving it a romantic feel.  At the same time, it is definitely a very family-friendly restaurant, and a great place to come with friends (especially with $2.50 sake bombs!).\n\nDefinitely give this restaurant a try when in Vegas, you won't be disappointed.  And if you live here in Vegas, and don't live close to this particular location, there are a few other locations in town (I have been to the Flamingo location recently, and if I were to review it, I would literally copy and paste this review in for that one as well)."
        }, 
        {
            "index": 284, 
            "rating": 5, 
            "review": "This is our favorite Japanese Hibachi Grill and Restaurant in Vegas. We found it by accident a few years ago and come here for lunch or dinner every time we are in town. They never disappoint. Today was the first time we couldn't get seating at the grill without waiting an hour so we decided to stay and try the regular menu. Again, they didn't disappoint. The waitress kept apologize for the wait (they got slammed all at once) but it really didn't feel like a long wait. We had the chicken teriyaki and filet minion teriyaki.  Absolutely delicious!!"
        }, 
        {
            "index": 285, 
            "rating": 5, 
            "review": "Been to the hibachi twice, so I can't comment on the sushi bar. \nThe service is great and the food is even better. Try the scallops, they are excellent."
        }, 
        {
            "index": 286, 
            "rating": 4, 
            "review": "If you enjoy tepan grills this place is worth checking out. Food is always delicious and servers always entertain, regardless of age. Their sushi is fresh and tasty. There are certain rolls I love (like the Blue Diamond Roll, YUM!) and others I'm not particularly a fan of, but that's more a matter of taste rather than quality. The tepanyaki is delicious. I've had the chicken, steak, and shrimp with fried rice --- SO GOOD! I also appreciate that when I come here with a group of friends or just my boyfriend they'll allow me to sit at the grill if I only wish to order sushi. Granted, most of my visits have been during their slower times but I still very much appreciate that they offer it. My only complaint is that every time I visit, slow or busy, I have a very difficult time getting a second refill from my server. This only really bothers me because I can be with one or two others who get three or four refills and I will have to flag them down to ask for one. Nonetheless I always come back because their prices are really competitive and the food is phenomenal."
        }, 
        {
            "index": 287, 
            "rating": 5, 
            "review": "PROS:\n-I haven't been to the steakhouse side, but I heard its super awesome!\n-Efficient & nice service :)\n-Great sashimi\n-I love how they options in their menu that saids \"chefs choice\" because we don't need to stress about ordering certain food\n\nFOOD 5/5:\n-Blue Diamond Dinner Special ($23.95): 2 special rolls + 8 pieces of sashimi & nigiri\n-Blue Diamond Roll: shrimp tempura, crab, avocado & sliced lemon on top = amazing!\n-Yellowtail nigiri: Personal favorite. I love how juicy & thick the fish slices were\n-Tuna nigiri: BOMB\n-Salmon nigiri: BOMB\n\nI can't wait to come back and try more food options :)"
        }, 
        {
            "index": 288, 
            "rating": 5, 
            "review": "Such good service they are amazing!! Food is delicious especially the hibachi!!! If you are around this area come and eat some delicious food!"
        }, 
        {
            "index": 289, 
            "rating": 5, 
            "review": "Too good, plain and simple.  I've been going to Benihana for as long as I can remember and Ohjah is right up there with the big boys without the high ticket price tag.  The hibachi is freaking awesome, not to mention they have great sushi deals too...must try \"The Boat\", still haven't gotten a chance but it is a sushi display of pure beauty.  The service is always so friendly and quick, they always make sure you have what you need and they encourage that you check-in for your free house sake.  I absolutely love that Ohjah opened up five minutes away from where I live and that I don't need to get dressed to the nines to go there.  Love it!"
        }, 
        {
            "index": 290, 
            "rating": 1, 
            "review": "I'm not one for giving 1 star but I have to say today my family and I came in for my wife and brother in-law birthdays. Our server was Alice, and I have to say I have never felt so disrespected the way she was speaking to my family. She had the worst attitude she made us feel like we were dumb. This is the second time we have been to this location so we were very familiar how to order but she felt otherwise. We requested for a manager and he was very cool and came back to check on us and refilled our drinks. If you visit this location and you get Alice make sure you know how to order off the menu or you might get laughed at. We won't be back! OHJAH make sure Alice takes a crash course on customer service."
        }, 
        {
            "index": 291, 
            "rating": 5, 
            "review": "Great food, great service.  \n\nThe staff is fantastic -- they remember you and what you like.  I've come to the point where I usually dont even bother looking at the menu.  I just tell them \"Surprise me\"\n\nAlthough it does not look \"kid friendly,\" they are extremely so.  We bring our 3 year old and 1 year old in all the time, and the kids destroy the place (sorry!).  They are always accommodating and friendly about it, and I can say that I would not have such patience if I were them.  \n\nOf course, we also go here for business lunches all the time -- this is my place of choice for business lunches."
        }, 
        {
            "index": 292, 
            "rating": 1, 
            "review": "this place is the absolute worst. me and my friend wen there, shes from fort lauderdale fl and i decided i would take her somewhere nice but inexpensive since i've been there before and it was okay... but after tonight i will never step feet int hat place again. first the chef was sloppy, unhappy, and catch an attitude with the lady that was sitting across from us because the waitress forgot one of the fried rice she ordered so she brought it to his attention(the chef) and he said \"i have nothing to do with that, ask her for another one\". the chef didnt make it fun while all the other hibachi tables was excited and making noises we were the most quite table ever. so then after he cooked the fried rice which wasnt good, it was mushy(since when are fried rice mushy?) no seasoning what so ever, to make it worst, i found freaking multiple pieces of tissue cooked in to my rice\"SO DISGUSTING\" like i was literally chewing paper, gross! i brought it to the chef attention and he didnt even apologize, he walked away and got the manager(a male) and guess what he said \"its from my straw, sure because i am a 3 year old baby who would take paper from a straw and mixed it in to my rice then try to eat it, are you kidding me? he didn't even offer to do anything about it so we just asked for the check and i attempted to search the rice again, guess what? more paper. when the lady brought the check, i said \"do you still think i put straw paper in there (showing her other pieces of napkin) lol this is funny, she said \"ITS JUST PAPER, ITS OKAY\" i guess shes used to eating paper at home so i basically payed for food that i didnt not eat.... never again."
        }, 
        {
            "index": 293, 
            "rating": 5, 
            "review": "The hardest thing to achieve in a restaurant is consistency.  Often we go somewhere and LOVE it, then the next time its blah.  Not the case with Ohjah!  We go there about every 2 weeks and its ALWAYS AWESOME.   Sometimes the company is better than others,  some chefs are more skilled with the knives than others, but the FOOD is Always PERFECT.   You won't hear me say that too often, so trust me when I do. \nThe pricing of the menu is more competitive than other Japanese steak houses.  Its $8,95 base price for the rice veggies and soup, then you ad your meats.  We usually have the Filet Mignon plus either shrimp, scallops, chicken or halibut.  The filet is like meat flavored butter, melts in your mouth.   Actually I wish they used a little more butter in the prep, but its always flavorful and healthy. \n\nWe do usually get a tuna sashimi but I will say this.  the fish is fresh and yummy, BUT its cut in too large of chunks.  I prefer a smaller cut for a more delicate taste and feel.  We ate at the sushi bar once and all the fish was cut too large. \n\nNevertheless,  the The steakhouse, hibachi grill is the BEST in town for the BEST price.  I highly recommend it any day."
        }, 
        {
            "index": 294, 
            "rating": 5, 
            "review": "great food. great prices. great ambiance. away from the las vegas strip congestion!"
        }, 
        {
            "index": 295, 
            "rating": 4, 
            "review": "Giant sushi boat! It was wayyy too much food for 2 people. The 3 rolls (dynamite-sort and 2 simpler options) were great, sea weed salad was delish, but sashimi was not fresh and wayyy too thickly cut. Nice, attentive service."
        }, 
        {
            "index": 296, 
            "rating": 4, 
            "review": "Happily surprised! Clean, and nice set up! We did not eat on hibachi side, rather ordered off the menu. We had for appetizer the lasagna and Cali rolls, tempura dinner, chicken teriyaki dinner. Dinners came with miso soup and salad. Food was nice serving and try even had brown rice at not extra charge (nice)!   We will def come back! I got a gift card after for my parents...."
        }, 
        {
            "index": 297, 
            "rating": 3, 
            "review": "I have been here several times for hibachi dinner and I can tell you that your dining experience here will depend on which chef perform/cook your meal. One chef will give you a 5 stars experience while the other one will make you question yourself for why the hell you're spending a lot of money for a lousy meal.\n\nMy regular and favorite chef is the tall skinny (Viet) chef who always does an excellent job entertaining guests and also make a good meal. When you go to a hibachi dinner, you expect entertainment in addition to good food. As for the other chef who cooked one of my meals, granted he was very nice, he basically just focused on cooking the food and not very entertaining at all. Even worse, the food was salty and just overall not good.\n\nSince you are sharing the hibachi cooking table with other guests, I'm not sure if you can choose which chef will cook your dinner. Due to this reason, I am now less likely to take my guests here for dinner, which is too bad since this experience is unique and could be a lot of fun compared to strip buffet.\n\nIf you plan to come here for hibachi dinner, make sure you understand the rule of roulette. Your dining experience could land on red or black, and sometimes green :-)"
        }, 
        {
            "index": 298, 
            "rating": 5, 
            "review": "Left another sushi bar not far away. Had some of the best sushi ever. The chef is a master. The food is phenomenal. Had The freshest largest Uni I've ever seen. Great food both in the Hibachi grill and now at the sushi bar. I have never gone to the same restaurant twice in 1 trip. Awesome place. Don't bother going anywhere else in Vegas."
        }, 
        {
            "index": 299, 
            "rating": 5, 
            "review": "This was the best meal I've had in a while and we eat out a lot!! The food was amazing!! The service was great! All around we were greatly entertained!!\n\nFirst of we opted for the Hibachi and I am so glad we did! My fiancé loves sashimi so he ordered the blue fin tuna, I do not really care for the raw stuff only in Miami and LA did I actually enjoy it!! Well I am addicted, that blue fin tuna was so so yummy. He ended up ordering another. For six dollars you get two healthy servings and it melted in my mouth with deliciousness! I am sold that is something  that  I will order again and again!\nMy fiancé got the trio Hibachi he chose the filet, the scallops and sole!! I ordered the lobster tail. The star for both of us was the sole! It was all delicious but we are still dreaming about that sole!! The filet was yummy and so were the scallops and the lobster but that sole was so memorable and unexpected because I love lobster but the sole was so freaking amazing! By the way my fiancé thought the lobster was awesome, too!\nI was not in the mood for sake bombs but my girlfriend that was with us never had one so we decided to get some beer and sake to have sake bombs but the Hibachi chef told us they offer  sake bomb individually which is perfect! Well after the first round we got about 4 more rounds! It was so entertaining the way they do it! We had a blast! The noodles, the soup, the rice, the veggies all so delicious and tasty I had to control myself. Jack was our Hibachi chef and was awesome!! They made us feel so welcomed. My fiancé can chug like no other so they kept giving bigger glasses of beer to try to beat him in the sake bomb challenge, they failed!! Super super night definitely be back again and again! I have already recommended this place to so many! I am so glad to have this place so close to my home Southern Highlands. We like to stay close and anything like that is xtreme sushi! We never feel comfortable and welcomed there and they have some good but a lot mediocre. So this will be our regular spot hope they stay because they are so great and in this economy where people are usually staying home it helps if you treat people right, plus I'd be heart broken if the service was bad because the food was so outstanding!! The whole combo works hope they keep it up and last!"
        }, 
        {
            "index": 300, 
            "rating": 2, 
            "review": "Not your authentic japanese food. Shrimp tempura crunch roll...not fresh and not good. Veggie fried rice was bland....who ever had the bright idea of throwing bean sprouts in them??? A bit too overpowering. Never order it again!!! Korean kalbee...very fatty. Service was fast but not attentive.  If I come back, which is slim to none...I think their hibachi food is what their known for."
        }, 
        {
            "index": 301, 
            "rating": 1, 
            "review": "I live close to this place and have been there a couple times now. The food is just ok. The service is terrible!!!! Some of the worst service I have ever encountered in Las Vegas. The employees are clueless. Even the manager seems like he doesn't even know what his doing. I will never go here again and don't recommend anyone to do so if you want to have a pleasant lunch/dinner."
        }, 
        {
            "index": 302, 
            "rating": 4, 
            "review": "So delicious and amazing prices! Half the price of Geisha House.\nThe music is extremely soothing. Love the place and will go back often."
        }, 
        {
            "index": 303, 
            "rating": 4, 
            "review": "Unexpected dinner with out of town family, and I was very impressed with quality of food. We had two 'real' sushi eaters and two 'just need to be cooked' sushi eaters, and everyone was happy with their selections. Good service too, despite being busy, waitress always checked on us."
        }, 
        {
            "index": 304, 
            "rating": 3, 
            "review": "I highly recommend that you pick the restaurant instead of the tepankayi where they put on a show and cook infront of you. The quality ofmthe food on the restaurant side is amazing and very delicious. The other side , on other note, tasted like it was smothered with MSG. You pay for the entertainment thats why it's so expensive. The servers were very nice except for the manager. It was the third time I ate there and it was a little busy than usual. I saw the manager cussing and giving attitude at the servers and COSTUMERS! He was so unprofessional! Other than that, food is great!"
        }, 
        {
            "index": 305, 
            "rating": 4, 
            "review": "Great affordable hibachi for locals. I've been to Ohjah several times and thoroughly enjoy this place!\n\nThe grillmasters are entertaining as always (I still can never catch the shrimps in my mouth for the life of me) and the service hasn't disappointed yet. \n\nI have tried the filet mignon, Sukiyaki beef, salmon teriyaki, and the scallops. The filet mignon is my absolute favorite, it MELTS in your mouth. Filet would definitely be my recommendation for first timers and meat lovers.\n\nThe portions are filling as with your main hibachi dish you also receive: onion soup (I request for miso soup instead), house salad, grilled veggies, and your choice of fried rice or noodles.\n\nFor those who live southwest or nearby, I definitely recommend trying out Ohjah if you're in the mood for hibachi!"
        }, 
        {
            "index": 306, 
            "rating": 3, 
            "review": "I've been to several tepinyaki places and there is nothing that stands out about this place so much. Everything is al a carte which kinda threw me off at first, but actually it works out for me. I don't eat the veggies and soup so I'm just interested in the fried rice and meat. It was good, but not the best I've had. The service was great though."
        }, 
        {
            "index": 307, 
            "rating": 5, 
            "review": "Great place I gotta remember that when we come to Vegas we always make a stop here five star ...love it...."
        }, 
        {
            "index": 308, 
            "rating": 4, 
            "review": "Very yummy and affordable !! The food and service was great !! Tons of great items to choose from . Will definitely be back!!"
        }, 
        {
            "index": 309, 
            "rating": 5, 
            "review": "Love love love this place! My new go to when I hit Vegas. These sushi bar sheds are awesome!"
        }, 
        {
            "index": 310, 
            "rating": 5, 
            "review": "I went here with my family (party of 11) for my birthday dinner and I am really glad that we opted to go here. Everything about this place was perfect, from the ambience and service to the food itself. Definitely try the Hibachi combo if you're going here, it's a really good value for the quality and quantity of food that you receive. On top of that, the hibachi chef was incredibly talented and passionate about what he was doing. We arrived late for our reservation (sorry :( ) but the waiter was very understanding about it and didn't even rush us even with another reservation for our table only an hour from the time we arrived. Overall, it was a great experience and I will be back next time I visit Vegas! 100% recommended."
        }, 
        {
            "index": 311, 
            "rating": 4, 
            "review": "Ohjah is the perfect sushi spot for us in the southwest. They have a great selection of rolls and lots of options for those who prefer their meals fish free. The main dining room is always fairly quiet and dark which sets up for a nice little romantic dinner. I prefer to go a little bit later to miss the crowd. We haven't had their hibachi yet but we have been dying to try because every time we're there, it sounds like they're having a great time!"
        }, 
        {
            "index": 312, 
            "rating": 5, 
            "review": "A bunch of bad ass including me go to this Ohjah restaurant, we sit at sushi bar , and we order 3 Ohjah boat for each person , I gonna tell you this is the best fucking sushi in Vegas, you can order the chef special only for you man, the chef got good skill to create some special for yourself, and after that we order sake boom , drink about 5 round , high to  die,  and this Ohjah have 4 different location, and you want eat some best sushi and fantastic hibachi I think you should  come here check out."
        }, 
        {
            "index": 313, 
            "rating": 5, 
            "review": "I love this place! We live close by decided to stop in and wow in looks small but it is really big! Sushi bar, private booths, and a hibachi dining area. I am always iffy when it comes to sushi and the quality but this place is outstanding! The hibachi style dining is delicious and GREAT prices! The filet was so tender! You cant beat the prices here and you will always leave full and satisfied! Probably my top 3 fav restaurants in Vegas!"
        }, 
        {
            "index": 314, 
            "rating": 5, 
            "review": "Ok so I've been to some prrrreeeeeetttttyy good Hibachi grills but this one was by far the best. This place was amazing and the food and service was great. My favorite thing here is the hibachi and sushi. The interaction with the chefs were amazing as well. I loved this place and I'm glad we went for my birthday. It was a blast."
        }, 
        {
            "index": 315, 
            "rating": 4, 
            "review": "I don't think of hibachi places as big draws, especially for the foodie crowd. So, I was surprised to walk into Ohjah on a Friday night and see the place packed. It's also a sushi joint, but that side of the restaurant had a few open tables. The hibachi side was filled. That's impressive considering they had six cooking stations.\n\nThe basic hibachi dinner ($8.95) consists of standard fare -- vegetables, salad, soup, and fried or steamed rice or noodles. I added shrimp ($5.75) and a 5 oz. filet ($7.55) to the mix. The shrimp was pretty good and the filet was cooked medium rare, as ordered, and was tender, as expected.\n\nThe best way to judge any hibachi place, though, is the entertainment factor. Our chef -- an older guy -- was ok. He was friendly enough, but all the tricks he did were the same standard ones you see at any hibachi place -- tossing the egg shell in the hat, the onion volcano, etc. He also tossed shrimp to some of the guests (again, a standard hibachi trick) but only to the guys, which disappointed some of the women at the table.\n\nIf you like hibachi places, you'll like this. If you don't, you probably won't be a fan. While it's similar to many others I've been to, I'd recommend this place for a fun night out whether or not it's with a date or a family."
        }, 
        {
            "index": 316, 
            "rating": 4, 
            "review": "Great little place. Sushi is fresh and delicious. Love the Hibachi room. Fun atmosphere for the family. Well priced for a Japanese restaurant."
        }, 
        {
            "index": 317, 
            "rating": 4, 
            "review": "I had heard a lot of good things about Ohjah an wanted to try it for my birthday. We had made an appointment for a regular table but changed it to the hibachi when we got there. They were nice and were able to fit us into a table.  \n\nThe chef we got was really good at cooking, but he had ZERO interaction with our table at all. He went through the motions and while it was all very impressive, he never smiled or laughed or acknowledged us. It was a bit strange.  \n\nThe food was delicious!  We shared the Hibachi combo, with one basic to share, and it was the perfect amount. The scallops were cooked perfectly, as was the steak and shrimp.  I really wanted the oysters on the half shell or oyster shooters, but they didn't have any so ended up getting a \"screaming orgasm\" and that was okay. It was a very small portion compared to other places. \n\nWhen most everyone at our table was done eating, the servers seemed in a rush to get us out, but we wanted to linger and try some dessert and drink more wine. It was a bit uncomfortable. They kept bringing our check and we kept asking for more things so they'd have to take it back. We were the only ones left at the table and I felt bad - I wanted to ask if we could move to a normal table since we weren't ready to leave yet, but the server told us we were fine, even though they kept bringing us our check lol.  \n\nAll in all, the food was great, the service was fast, and it was a great birthday dinner."
        }, 
        {
            "index": 318, 
            "rating": 4, 
            "review": "I come here often for the Snow White sushi roll and garlic edamame.  I have also been on the hibachi side, and had the calamari, which was excellent.,  The food and price are very reasonable. Usually not a long wait for dining in, if any.  The only trouble I have ever had is when I order by phone for take out, there have been a couple times I called 20 minutes prior to arriving, and still had to wait another 15, even though they said it would be ready in 15 minutes from the time I called.  Not sure where the issue lies with that one.  Still, they are apologetic through the waiting process, but it has happened more than once.  On the other hand, no complaints about dining in."
        }, 
        {
            "index": 319, 
            "rating": 5, 
            "review": "We love this place!!! We are always greeted with friendly amazing customer service. The seating times are structured to ensure your group or even just yourself is promptly taken care of. The quality of the food matches it's service. Great place to take relatives visiting or to celebrate birthdays !! We love Fiona!!"
        }, 
        {
            "index": 320, 
            "rating": 4, 
            "review": "Very friendly service and management. Hibachi is ok, but sushi was great. Prices are very reasonable. $9 for the hibachi add-ons and from there you choose the meat (filet was an additional 8.5 so it would be 17.5 for filet)."
        }, 
        {
            "index": 321, 
            "rating": 5, 
            "review": "AMAZING!!!  Went with friends and the kids and my girlfriend couldn't get enough!!  Will DEFINITELY be back next time in Vegas!!"
        }, 
        {
            "index": 322, 
            "rating": 5, 
            "review": "Great food good ambiance. Will definitely be back when I'm craving habachi & sushi rolls!!! I had the Blue Diamond sushi combo my husband had the hibachi combo with steak, scallop & shrimp. Our friends had Kobe beef and everything was great but $48 on top of the $8.95 is pretty stiff especially when the Kobe was such a thin slice! All n all it was pretty good!"
        }, 
        {
            "index": 323, 
            "rating": 5, 
            "review": "Glad we tried this place, and it's right in our 'hood! Calamari tempura and filet mignon hibachi we're excellent!"
        }, 
        {
            "index": 324, 
            "rating": 4, 
            "review": "Luckily we made reservations as the hibachi side was packed. We enjoyed the free check in item. I appreciated the ample staff and their service. Our chef wasn't as animated as some of my previous hibachi experiences but he was on point. The lobster was very good and the filet was perfectly cooked and very tasty. One of my kids decided against hibachi and there was plenty on the menu for her to choose. I would recommend them and will return."
        }, 
        {
            "index": 325, 
            "rating": 4, 
            "review": "This place is pretty new in our area.  It's pretty wicked to have a Japanese spot with in walking distance from our house.  I watched this place being built and couldn't wait for the day the doors were open.  My wife and I finally went here for dinner when we had a visitor from Cali.  I would like to think of myself as a sushi purist and typically I don't consider eating hibachi.  Call me stuck up but, I always felt that hibachi was a bit \"touristy\" and more like Japanese for the \"newbie\".  \n\nAnyhow, this visit made me cheat on my first love, sushi.  I loved this place and the prices were super competitive.  We started with sake bombs that were only $2, cheap!  I got the strip steak dinner and it was only about $15 - $16.  The steak and fried rice were delicious.  That week we actually went there 3 times!  \n\nThe staff is super friendly.  Every time we went the chef's were always personable and a little sarcastic, in a good way.  We actually found out that Ohjah means, King of the Ninjas.  Cool!  Also, if you just want to try out there menu a good time to go is during lunch cause the prices are a bit lower.  I would go again and I do recommend going as a group for the hibachi dinner."
        }, 
        {
            "index": 326, 
            "rating": 2, 
            "review": "I give this two stars because our experience was horrible. We were a table of 8. We all ordered together and the server brought my friends food when the rest of us were done! When approaching the manager he just said it's coming it's coming. Horrible experience and the sushi wasn't even that good either."
        }, 
        {
            "index": 327, 
            "rating": 4, 
            "review": "I've ordered take out and sat in and have always enjoyed myself. Of course I didn't add the extra star because of the wait, sometimes. But that's how good this place is."
        }, 
        {
            "index": 328, 
            "rating": 4, 
            "review": "My uncle picked this up to go for my mom and i. We really enjoyed the sashimi plate of 20 pieces. All of the pieces were very think and very fresh. The fish practically just melted in my mouth. The 20 pieces were not enough for all three of us, so we ended up going back and getting two rolls, Ohjah roll and the Las Vegas roll. I would definitely say stick with the sashimi. I will come back when I'm back in town most definitely"
        }, 
        {
            "index": 329, 
            "rating": 4, 
            "review": "I've been here for lunch and the food was good. Now the Hibatchi grill is something else. That food is amazing. Our cook could've been more flashy but the food was just delicious. The servers were great. Very attentive. Had a couple different kinds of sushi as well. All were great."
        }, 
        {
            "index": 330, 
            "rating": 5, 
            "review": "Location is just perfect! The food are great and inexpensive. They have fast and friendly service from the moment you walk in til you leave you're greeted with a smile. \nOverall I highly recommend this place for everyone."
        }, 
        {
            "index": 331, 
            "rating": 5, 
            "review": "My husband and I love this sushi place so yummy!!! \nExcellent customer service and kind people work here ;)"
        }, 
        {
            "index": 332, 
            "rating": 5, 
            "review": "This place is amazing. The staff is always so accommodating and since we come here quite often they always acknowledge us. \nThe space isn't much to look at from the outside but as my mother always says, it's what's inside that counts!\nThere are 3 types of seating..the Sushi Bar, regular dining off the menu and hibachi dining. We generally always go to hibachi. \nThe menu consists of the usual steak, chicken and shrimp but the also offer Kobe beef, lobster, salmon and scallops. You get your choice of fried rice or noodles and you start with onion soup and ginger salad. The salad dressing they use is amazing and unique. \nWe always each order a steak and split the lobster. Make sure to have them cook with garlic and give you a side of teriyaki sauce for your rice, you won't regret it!  \nWe come here at least once every other month and it still feels like a treat. Can't wait to go back!"
        }, 
        {
            "index": 333, 
            "rating": 4, 
            "review": "Great service and amazing hibachi. Went there last night for dinner and was really surprised with this place. The food were so yummy and the chef really funny and skilled. I had a fried sushi and it was not good. So, I cannot judge on it once I had only one kind of sushi, i wouldn't order any other sushi. But would go back 1000ish times just for the hibachi. I had salmon, my hubby had the steak+chic OMG so tasty!!!"
        }, 
        {
            "index": 334, 
            "rating": 4, 
            "review": "Sushi was good & so was the food. Decent pricing. Not my number 1 sushi place but heck of a lot better than any more easy of Nevada!"
        }, 
        {
            "index": 335, 
            "rating": 4, 
            "review": "What a great place to eat in SW Las Vegas!  We live in the area and decided to visit the place once it opened.  We are very fond of the Hibachi style Japanese restaurants, and we were floored at the more-than-reasonable pricing!  Salad, soup, fried rice, vegetables and my shrimp all came out to less than $20!  It was tasty and the atmosphere is classy but fun.  I would highly recommend!"
        }, 
        {
            "index": 336, 
            "rating": 4, 
            "review": "Just finished our dinner here and made this one of faves for taking out of town friends and family to.  We were warmly greeted by the host and seated immediately in the teppan grill room, which appears to seat about 60-70 at six different stations.  They call it a \"hibachi\" dinner. \n\nIf anyone has ever eaten at Benihana's or the Nijo Castle (Newark, CA), I recall paying about $25-30 per Teppan entree.  Here, you pay $8.95 for the Hibachi basics: soup, salad, rice (steamed or fried) or fried noodles.  Then you choose your add ons or what they call \"mix or match\" which is your proteins.  Chicken teriyaki is $4.95, NY steak is $5.95, filet mignon is $7.55, shrimp $5.75 and so on,  There is also salmon, $5.75 scallops ($7.55),  Lobster tail (6 oz.) for $15.95, Kobe beef $48.95.  They also offer 3 basic entree items (not included is the lobster tail, Kobe beef or Halibut) + the Hibachi basics for $28.95. \n\nI ordered the scallops and chicken, the wife, steak and it is still cheaper than other similar restaurants.  The quality of the food is good. Portions were decent.  The soup was mild in flavor, the salad though was disappointing. The dressing was watery and you could tell the salads were pre-made earlier in the day. \n\nPre-tip for our family of four with 2 kid's hibachi entrees (steak & chicken) with sodas and  a large Sapporo was $76.\n\nThey do offer lunch. sushi, sashimi, nigiri, and a good selection of Japanese entrees in their regular dining room, which has a sushi bar.\n\nWe're hoping this restaurant stands the test of time and continues to flourish at its location since there is no other restaurant like this in the SW part of town,  They also have a location in Pahrump."
        }, 
        {
            "index": 337, 
            "rating": 4, 
            "review": "After a day losing money at the casinos, it was time to pause and celebrate my sister's belated birthday with some dinner...she wanted Japanese and this was one of the closest Japanese restaurants from Silverton and Yelp had some favorable reviews. \n\nWe opted for the hibachi/teppanyaki and were seated promptly, drinks served, orders taken and ready to dine and be entertained by our teppan chef. Our chef was engaging and entertaining. Sitting with two locals who frequented the place further bolstered our confidence that we made the right choice for dinner...well, they were pretty drunk with multiple sake bombs by the time they started eating so maybe anything will taste good after that. Food turned out to be good and my steak was tender and yummy. Pleasantly surprised by the quality and flavor of the food...it wasn't too salty as is the case with most teppan style cooking. A good find!\n\nI guess drunkenness doesn't really dull one's taste buds after all."
        }, 
        {
            "index": 338, 
            "rating": 5, 
            "review": "Great quality with great price.  Their dishes are more fusion Japanese than traditional, but I enjoyed it.  Sashimi grades are excellent"
        }, 
        {
            "index": 339, 
            "rating": 5, 
            "review": "I'm never disappointed with food here, and as long as you call in advance to see if there's a wait for teppanyaki... then you'll love it!\n\nThe menu looks a la carte for teppanyaki, but it's really a build on price. If you're not good at math, you can rack those prices up quickly! The chef was great and friendly, which is needed when you basically have dinner with strangers! Lmao \n\nI'm not a fan of sake, but you'll get a free shot when you check in!\n\nTiger roll- spicy, of course, and you can taste the freshness!!!!\n\nYellowtail sashimi- fresh! I asked for jalapeño on mines and it was perfect"
        }, 
        {
            "index": 340, 
            "rating": 4, 
            "review": "Customer service was very good.  The staff is super friendly - almost too friendly.  Every time someone passed our table, they would ask how everything is and then thank us.  Each one probably asked us 3x during our meal.  Never had to wave them down, because they frequently ask if we need anything.  They also say thank you when they bring your food, refill your drink, bring the check, etc.\n\nThe food itself was okay.  The salad dressing was refreshing, and the soup was flavorful.  I really liked the \"nachos\", which were two deep-fried wonton wrappers with imitation crab and avocado on top. \n\nThe cucumber salad was too salty,  the fried calamari was bland and the sauce it came with tasted like it was watered down.  The sukiyaki was good, but a little too sweet.  I ended up using the cucumbers as a condiment and put slices on top of everything to balance out the flavors."
        }, 
        {
            "index": 341, 
            "rating": 5, 
            "review": "The best sushi place in Vegas! We like to get the ohjah boat. It's amazing! $50 with three rolls, sashimi, and nigiri. The fish is always fresh. Service is excellent! We will definitely be back again and again!"
        }, 
        {
            "index": 342, 
            "rating": 2, 
            "review": "Staff is very friendly which is why they get 2 stars.  I ordered 3 sushi rolls, fried oysters, spicy beef dinner and some saki.  The sushi rolls were very bland, and the pieces were very small,especially for the price.  The fried oysters were basic and the batter is standard, not different that stands out.  Spicy beef did not have spice but did have some flavor, asked the server if it had green peppers and he did not seem to understand due to language barrier, but I'm not a fan of green peppers.  Overall food was bland, atmosphere and service is nice.  Better sushi joints out there"
        }, 
        {
            "index": 343, 
            "rating": 5, 
            "review": "I don't usually give 5 star ratings but in this case, I have no problem doing so. the staff are friendly and very attentive to the customer. the hibachi chef (tom) was a riot and a real entertainer. He made the whole experience one to remember so ask for him when you go. the food is top notch and I recommend the filet and shrimp. the food was fresh. the filet Mignon literally melts in your mouth. the appetizers of shrimp/calamari/vegetable tempura was fantastic and not too heavy. I have been there twice now and plan to make it one of my regular spots to eat. Both my dinners were just wonderful and the staff are top notch and have a way of making you feel at home. just a wonderful place to dine. Oh, I almost forgot, the prices are extremely reasonable for what you get. I cant think of one thing I would change about Ohjah except that I wish one were in Henderson so I wouldn't have to drive as far to get to it. But hey, one cant have it all. Its well worth the travel though. A must dine experience that one will not forget."
        }, 
        {
            "index": 344, 
            "rating": 4, 
            "review": "I like this place cause it's very close to the place i'm staying at. Word to the wise, if you order carryout sushi, and you order a baked roll, it's pretty gross once you get home. I had those same baked rolls when I actually sat down, and it was pretty good. 15 min of driving ruins baked sushi, i guess. lol. Service is great."
        }, 
        {
            "index": 345, 
            "rating": 5, 
            "review": "I think this is my favorite place to get japanned food,  but ironically they have the best Thai Beef Curry I have ever eaten.  The staff is always very friendly and pleasant.  My daughter is like a the Cookie Monster when it comes to sushi and says it is bomb.  She is 14 hahahha.  I highly recommended the place for sushi Thai and hibachi style dining."
        }, 
        {
            "index": 346, 
            "rating": 4, 
            "review": "Very excellent food for a great price. I had the combination teppanyaki with filet mignon, teriyaki chicken, and shrimp, the fried rice and vegetables were included and delicious. All for the price of $30. The chef was hilarious...that's only if you can take a joke. \n\nThe only thing could've done better was to have more tricks while cooking. But everything was great."
        }, 
        {
            "index": 347, 
            "rating": 5, 
            "review": "This is my new favorite restaurant! The food is incredible. They seriously know what they are doing here. Everything is cooked to perfection and they plate beautifully- even the TO GO BOX was plated with care and finesse. I appreciate that level of detail. I have eaten hibachi in and gotten food to go and every time is great. Salmon Teriyaki is divine. The veggies are perfect and even the soup broth is amazing, deep rich flavor. Hibachi is really fun and would be a great place to take a group. Prices are so reasonable for what you get. The interior is really cozy & romantic even though you can't tell from outside.  Just go- GO!"
        }, 
        {
            "index": 348, 
            "rating": 1, 
            "review": "I can just now stomach writing this review, from the food I ate here on 12/25/2015. We have been to Ohjah a handful of times for their hibachi room. It has always been ok... Nothing great, and very greasy. The kids love the hibachi experience though, so we've gone for a couple of special occasions, because it's a bit pricy for what you get.\n\nChristmas night, we finished family get togethers early, and thought it would be nice to grab a bite to eat. The places that were open were packed, so we eventually found ourselves here. We ate in the regular dining room. I ordered the salmon teriyaki. It was horrible. It tasted very fishy, and was so over cooked, that it was actually a challenge to chew.  Needless to say, I didn't eat it all.\n\nFour hours later, I barely made it to the bathroom, and basically stayed there for the next two days. I was SO sick. My friend who is an ICU nurse had to come over and give me Zofran... This is the only thing that kept me out of the hospital, as I literally could not keep anything in me for a little over 48 hours. Merry Christmas to me! UGH.\n\nDo NOT trust the food here. There's no need to pay for overpriced food, that can possibly send you to the hospital."
        }, 
        {
            "index": 349, 
            "rating": 4, 
            "review": "Hibachi is the Medieval Time's of Japanese cuisine. Dinner AND a show? ok.\n\nSo this review is only based off the hibachi part of the restaurant.  We have to go back and try the standard menu.\n\nThe chefs are funny and engaging! Catch a shrimp in your mouth flipped with the spatula right off the grill! I was the only one on our table to try, everyone else just had it flipped on their plate; When in Rome! err Japan?\n\nAs part of the Hibachi grill menu you get: \n1. Onion soup (nice little starter with light onion flavor). \n2. Salad with ginger dressing (warning: they drown the salad in dressing, so maybe ask for it on the side; but I love the dressing so no complaints here)\n3. Sauteed veggies.\n4. Fried rice or noodles.\n5. Your choice of protein. I recommend to spend a little extra and getting the Filet  over  the other steak cuts.  Even though I ordered my NY strip medium, because it was then sliced before plating it kept cooking more and came closer to well done.  The Filet was more tender and ordered medium-rare came to your plate closer to medium but Delicious! I enjoy a good surf & Turf so I also had the calamari which was just ok, Someone in our table ordered lobster and scallops.  The scallops looked amazing so I will try that next time, Lobster looked a little small but what can you expect from a Hibachi grill.\n\nThe rice was flavorful and the veggies were delicious, I love me some mushrooms.  (why was the mushroom invited to the party? Cause he was a Fun-gi!).\n\n \nWe definitely will return. The bill ran about $40-$50 for two. Not bad for a date night (don't worry, it was an impromptu date night, I'm no cheap date giver). The sig-other definitely enjoyed the experience and the food.\n\nDid i like it? Oh-jah (oh-yea) I definitely did.  Horrible attempt of a pun. Sorry."
        }, 
        {
            "index": 350, 
            "rating": 3, 
            "review": "I will bump this restaurant up to a 3-star rating just for the fact that the owners care enough to read the reviews of their restaurant and ask for feedback regarding any negative comments.  Kudos for truly caring about customer feedback!"
        }, 
        {
            "index": 351, 
            "rating": 5, 
            "review": "Best Japanese food I have tasted in my life. It is extremely authentic and I love the garlic tuna sushi and shrimp tempura."
        }, 
        {
            "index": 352, 
            "rating": 5, 
            "review": "We sat at the hibachi table and had a fantastic meal. There were 5 of us including a teen. We had chicken, a filet, salmon, shrimp and lobster. We also ordered a couple of sushi rolls. The food was delicious and we did not go home hungry. The staff was friendly and happy to help. Plus, the price was just right. There are so many menu options, I will definitely return."
        }, 
        {
            "index": 353, 
            "rating": 5, 
            "review": "Amazing! I've been here many times with my friends. They always keep up with their standards. Their sashimi is fresh no matter what time I go. Their servers are attentive and are always ready to serve you. My fiends love going here and even bring their kids. I would recommend this place to anyone who's looking for a good place to eat!"
        }, 
        {
            "index": 354, 
            "rating": 4, 
            "review": "Pretty good food. Portions were a decent size. My only wish is that the dinner plates came with a small side of tempura to have a balanced meal (rice and chicken otherwise- salad and soup as a starter. \n\nThe only odd thing was happy birthday played twice during dinner with no indication of it being someone's birthday. Is that a quirk?"
        }, 
        {
            "index": 355, 
            "rating": 4, 
            "review": "I live within a minute from this place. And I couldn't be happier to have a Japanese Restaurant near me. But I wish they had bento box options (like most Japanese Restaurants do), which they could revenue from those who don't eat seafood, or for the children.."
        }, 
        {
            "index": 356, 
            "rating": 1, 
            "review": "OHJAH has there way of ripping people off BIG TIME! Ok, so they have a online menu \nWITH PRICES!! which that means if a family,couple, work staff or just a single person wants to check out what they offer on there online menu and prices ... SO you decide to order u call in for pick-up & off top first they rush you through your whole order and sum of the staff have thick accents.. So u try to let them no your substitutes this because Im allergic, or it's just to strong or to much .. That's when they act like they don't understand English at all which is extremely rude... because now their doing this on purpose ... and and that they don't wanna give u YOUR total over the phone also( they'll put you on straight hold for a few) ...they just rush u off the phone and say \"B ready n twenty minuh\"...So\nI get up there and have me for 3 sushi special for almost $30(online it said $25.95 for the special but tax was skyyyyyy high it's there tax not NV's tax) or over which I didn't get any extra mind you its in this little box which they put 4 less rolls for what I counted from the previous time I was there months prior...ok THEN I GET MY STEAK FRIED RICE WHICH ONLINE IT SAYS $8.95 but they said In Resturant it $12.00 almost $5 more on the fried rice I'm like wow are you serious this is the prices that are on YIUR BUSINESS WEBSITE ... they look at me and say that menu is 2.5-3 years old .. So why won't you guys have the Courtesy enough to,switch the prices to the correct ones  instead of extorting money from your customers with having several different prices ...u know the sushi which was $25.95 and the fried rice $9 and sum tax... but no for like 8 rolls I paid over $30 including tax and for fried rice including tax dang near $20.. they are such rip offs... they run that lil scam because ppl think they are so fancy when they are eating sushi n sh**! They need to correct there online menu or give the customer what was quoted online out of courtesy... but they are so darn greedy they can't do that ... and the quality of the food has went down so bad since my last visit sum MONTHSSSSS  ago...they just cook with hella oil and pack on grease (had to take Pepcid it was greasy).... I'll never be going to this selfish-BIG TIME RIP-OFF location again ....\n\n\n\nALSO WHICH IS SO GROSS AND UNSANITARY THEY PUT YOUR STRAWS IN YOUR BOBA YOU PAY FOR...PPL ARE SICK ALL THE TIME OUT HERE IN VEGAS NOR DO THEY WASH THERE HANDS EVERYTIME THEY ARE DEALING MONEY...THEY SMOKE CIGARETTES OUTSIDE BECAUSE IM ALWAYS SEEING A STAFF MEMEBER LIGHTEN UP WHEN IM ON MY WAY TO WAL-GREENS ... THATS JUST TOTALLY GROSS PEOPLE SHOULD BE ABLE TO PUT THEIR OWN STRAYS FORKS IN THERE DRINK AND FOOD WE DONT NEED U PUTTING UR DIRTY HANDS ON PPLS STRAWS, WE DONT KNOW IF YOU WASHED UR HANDS OR NOT..IM JUST OVER THIS \"DIRTY DINING\" PLACE DEF. NEEDS BIG A** UPGRADES! Just gross.."
        }, 
        {
            "index": 357, 
            "rating": 5, 
            "review": "There are many places like this in Los Angeles but I rather come back here. Not only is the food priced great it is also very pleasing. Van was our cook and I couldn't have been any happier with his skill of cooking."
        }, 
        {
            "index": 358, 
            "rating": 4, 
            "review": "Ate here for the first time and i gotta say the hibachi is definitely well worth the price. the only thing that is lacking is the flavor. i  had the filet mignon and scallops and chicken. Now their scallops and filet mignon were cooked perfectly. Now for a new place its always packed and thats a good thing, but if you were to compare to Geisha House i would pick Geisha House for food quality and Ohjah for the price. We also tried this albacore and fried onion sushi roll which was delicious. But the hibachi was lacking good sauces and their cooks were not that entertaining and the fried rice was ok.i will come back just dont know when i will say OHJAH is what im craving today."
        }, 
        {
            "index": 359, 
            "rating": 3, 
            "review": "Enjoyed my meal, the food was great and the staff was friendly. Ordered two hibachis - shrimp and salmon - both were prepared well and quickly. Also ordered the gyoza which was great. I gave them 3 stars because I felt rushed the whole meal. Halfway through eating they presented us the bill. I wanted to order dessert but was kind of taken aback of how quickly they wanted us to leave. I noticed they were getting busier and seats were getting limited but I would have liked to relax a little more. Overall I was happy to find this place as they did have a good variety on the menu with reasonable prices, next time I will try a less busy time."
        }, 
        {
            "index": 360, 
            "rating": 4, 
            "review": "Family and I tried this restaurant for the first time! It was nearby and decided to try. Comforting atmosphere, great server(PETER) plus he also ordered for us since we didn't know what to try first. Great sushi! I am definitely going back!"
        }, 
        {
            "index": 361, 
            "rating": 5, 
            "review": "man this place is awesome. first time coming here, didnt know what to expect. first off, theyre appetizer serving is a lottttt. theres more meat than the breading. really pleasing. entre was great. poooowerfuul flavor. cant say anything else, but you have to give this place a try."
        }, 
        {
            "index": 362, 
            "rating": 4, 
            "review": "We LOVE hibachi and this is so conveniently close to home for us! Good service, good food, good drinks I would totally recommend this spot for their hibachi. I have yet to try their sushi but I am interested in going to that side of the restaurant to test it out soon! OH! And they give LVAC discounts woohoo :-)"
        }, 
        {
            "index": 363, 
            "rating": 5, 
            "review": "Food was fresh, hot, & delicious! First time here & everything was great. I would like to try the hibachi next time!"
        }, 
        {
            "index": 364, 
            "rating": 4, 
            "review": "There's a teppanyaki area and a regular dining area to eat sushi, Thai dishes, and other non-teppanyaki Japanese dinner entrees. I usually go to the teppanyaki side where you start with a basic hibachi entree which includes onion soup, house salad with ginger dressing, rice (brown, fried, or steamed) OR fried noodles, and veggies (carrots, onions, broccoli, and zucchini) for $8.95. The house salad with ginger dressing is good but the onion soup is a little bland and boring. Then you pick your choice of meat. I went with the NY steak (5 oz) for an additional $7.95. My steak was cooked perfectly. You also get two dipping sauces. The brown sauce is for the meat and the yellow sauce is for your vegetables. The prices are reasonable compared to overpriced Benihana.\n\nNo issues with service from the several times that I have went. I would only come here for the teppanyaki. I ordered the Ohjah Boat (rolls, sushi, and sashimi served on a wooden boat) on a previous visit. The sushi was meh and a bit on the warm side so I will just stick to the teppanyaki here. This is pretty much Benihana's but a lot cheaper where the chefs do their show with the flaming onion volcano, throw an egg in the chef's hat and split it with a spatula trick, & the chef throwing shrimp in your mouth act, etc. I'm not coordinated when it comes to that so I always decline politely. There are a lot of families with kids who like to come here so if you're one of those diners who hate kids, stay away or if you have kids, they would probably enjoy dinner with a show."
        }, 
        {
            "index": 365, 
            "rating": 5, 
            "review": "My husband and I went for dinner for the first time there and it was incredible.  The food the atmosphere everything was just all around delicious.  We will definitely be going back."
        }, 
        {
            "index": 366, 
            "rating": 1, 
            "review": "Worst teppan I've ever had. We had the older gentleman cooking our food. The stove was too hot and he was slow. He burned it all. vegetables were horrible burnt and mushy. The fried rice was over cooked and chewy. The chicken was extremely over done and chewy. I have never had crispy salmon before but it was alright. The steak was the only thing that was cooked right. I will never go here again for Teppan. Very disappointed since it had such high reviews."
        }, 
        {
            "index": 367, 
            "rating": 3, 
            "review": "Like most of the reviews, the Southern Highlands area really needed a good Japanese restaurant as the area is pretty barren for choice.  Luckily Ohjah opened up in the discreet and empty strip mall across from Albertsons.  The first thing I noticed while entering the place with my wife was the Chinese conversation going on between the hostess and a chef.  Being from Hong Kong, it was a bit of a downer considering we were aching for some quality Japanese food, and seeing the place was ran by Chinese, our expectations immediately dropped.  \n    The decor inside is very nice, the lighting is very good, and the staff very polite.  We ordered two lunch sets, the steak teriyaki for myself, and the wife had a steak stir fry.  The waitress tried selling us sushi ( she counted six times throughout our lunch), which seemed ok if we were the least bit interested.  The salad was cold to the point of almost too cold to eat, they need to keep it out of the fridge before serving, but the dressing was decent and could have been worse.  The miso soup is mundane, which probably came in packages you could get at Albertsons or Whole Foods.  The steak teriyaki and stir fry were pretty good, although the tray they brought the food out with smelled of bleach...  Yeah\n\nAll in all, it's a decent place.  We just had too high of expectations, thinking a nice Japanese family was setting up shop, only to see frozen to fryer type food.  The real biter is the price, which makes sure we won't be visiting again.\n\nI want to love this place, because it's so close and it's Japanese, however I can't.  I would say to try it though, it's something different in the Highlands area, and it's at least worth a shot."
        }, 
        {
            "index": 368, 
            "rating": 4, 
            "review": "The caterpillar roll is my favorite. The hot edamames are great to start :) \nThe first time I was here it was a great experience! My friends and I ordered their boat special- which was so filling we didn't even eat all the sushi. \nYou choose three different sushi rolls and it comes with sashimi as well for $45- which I think is cheap compared to other places. \nTheir Rock N Roll roll was a refreshing taste, it had salmon, tuna, avocado, and yellowtail wrapped in cucumber (a big roll but still tasty). \nTheir baked mussels are juicy and tender. \nThe service here is amazing. They're very attentive and always remember you whenever you visit :)"
        }, 
        {
            "index": 369, 
            "rating": 5, 
            "review": "I went there to celebrate my friend's couple who will marry soon this time:)\nWe sit at hibachi this time and order some signature rolls (ocean view, rock and roll)\nIt was first time to try ocean view roll! It was very good! Fresh scallop and asparagus was fantastic combination! Must try!!\nTheir ginger dressing for house salad is always good :) hibachi combination is very good price!"
        }, 
        {
            "index": 370, 
            "rating": 5, 
            "review": "Terrific hibachi, among the best I've ever had.  Or maybe I was just really, really hungry.  Either way, I'll definitely be going back sometime."
        }, 
        {
            "index": 371, 
            "rating": 5, 
            "review": "Cody was hands down the best server we have encountered here. \nWe will come back if he is working \nUnassuming \nAttentive \nPolite\nPerfect Xmas"
        }, 
        {
            "index": 372, 
            "rating": 5, 
            "review": "There are places here that is hard to find awesome customer service and I finally found it here!  I came here for my birthday with my 2 young daughters age 8 and 4.  We did the Hibachi and we all had a great time.  My kids eyes were glued staring at the chef thats how good and fun he was!  They didnt know it was my birthday until the guest on the side of us asked if it was my birthday and then my waiter heard about it and asked me if it was bday?  Next thing you know, the lights dimmed and flickered and a birthday song came on and they also sang Happy Birthday!  The food, the service and the atmosphere is absolutely amazing! This is now my new spot because the number one reason:  The Service was beyond A+!  Thank you Ohjah Japanese Steakhouse and Hibachi!!!  And the food was excellent!!!"
        }, 
        {
            "index": 373, 
            "rating": 4, 
            "review": "love this place. cheap sushi, great deal, and FREE sake all this month. They have a groupon deal running right now 20 for 40$\nfriendly staff :]"
        }, 
        {
            "index": 374, 
            "rating": 5, 
            "review": "LOVE Ohjah. Staff is extraordinary and chefs amazing. We come here as often as we can to take advantage of the deliciousness. The wait staff even recognizes my 4-year-old daughter whenever we are here, which makes her experience even better."
        }, 
        {
            "index": 375, 
            "rating": 4, 
            "review": "They have the best beef yakisoba here! I would definitely come back and try their Hibachi dinner."
        }, 
        {
            "index": 376, 
            "rating": 5, 
            "review": "My wife and I absolutely love this place!  The hibachi is one of the best in Vegas and the prices are so affordable for the quality of food you receive. From the delicious soup and unique but delicious salad to incredible cuts of meat this place  rocks! Good luck finding a better filet mignon for anywhere near the price. The sushi has got to be my favorite that I've had. It is quite a bit more expensive than some of the more mainstream sushi spots, but too compare them to places like sushi mon would be an insult. They use super fresh cuts of fish and not even the seaweed has that nasty typical sushi flavor. It's really a demonstration on how sushi SHOULD be done. Another thing to keep in mind is the fact you are getting more than food at this hibachi and the show is always amazing no matter which chef you get. Some are funnier than others, but I enjoy getting a different routine every now and then. If you choose to eat the hibachi I strongly encourage to buy a round of sake bombs! It's a blast for you and your friends and surprisingly smooth. I eat here whenever I have an opportunity and it comes highly recommended. I'm currently trying to convince myself to spend the money and get the Kobe beef! Looks delicious!"
        }, 
        {
            "index": 377, 
            "rating": 5, 
            "review": "Our new sushi spot finally!!!! We the service was awesome and sushi was AMAZING!!! We sat at the bar and so glad we did, the chef made us different rolls and we loved them all! \n\nI can't wait to come back and bring my family & friends. I wish the drinks were a little stronger, sweetest long Island ever but I'm here to mainly eat not get drunk LOL"
        }, 
        {
            "index": 378, 
            "rating": 4, 
            "review": "New japanese restaurant in the southwest part of LV. Bf and I came out here and were very pleased. Since it newly opened, they had a special going on. 3 specialty rolls for $54 bucks. Overall, rolls were decent. Decor is very zen, and a lot bigger than most sushi restaurants located in this part of town. You also have the option to do hibachi, which we still ave yet to do."
        }, 
        {
            "index": 379, 
            "rating": 4, 
            "review": "Was visiting Vegas and was in the mood for some sushi. We found this place and all I can say is wow. We got there before the dinner crowd arrived and was swayed right away. \n\nStaff was friendly and even met the manager.\n\nNow the food. Big portions, i got a Spicy Tuna roll  that was made to perfection. Also ordered another spicy  steak platter that was delicious. \n\nYou will not be disappointed at all. Next time i go I'm gonna try and eat the boat platter, yup its a giant boat full of sushi.\n\nThanks"
        }, 
        {
            "index": 380, 
            "rating": 4, 
            "review": "My boyfriend and I decided to try this place on a limb from yelp recommendations and I'm so glad that we did! The food is delicious! And is very reasonably priced. Im a huge lover of miso soup, so if the miso is no good I'll never return. Luckily they passed the test! We ordered the holy moly; which if you're a crab lover like me you can't go wrong! I was surprised at how large the potion was and it came with scallops which was a pleasant surprise because I also love scallops. We ordered the golden gate roll which was also very tasty. From just those three items I was so full we had to take home leftovers! I would recommend this place to anyone who is craving sushi and would like high quality food without spending a lot of money. Not to mention we got seated right away!"
        }, 
        {
            "index": 381, 
            "rating": 1, 
            "review": "We will never come back to this place. After being regulars for over 3 months . Our server tonight was Tiffany. I think she needs more training. She continuously leaned over my husbands plate so she can pick up the dirty ones. So not right!!! I was also using the edamame bowl for my ginger she didn't even ask if we were done with it, before I could open my mouth to tell her that I was using it , she told me that there is nothing in there ....when it was time for us to pay she took the cc but when she dropped off the check she just threw it on the table and left . So sad how horrible their customer service is...."
        }, 
        {
            "index": 382, 
            "rating": 1, 
            "review": "What can I say..., I was excepting something great..\nEverything but great. A total disaster from start to finish. Maybe I should try again."
        }, 
        {
            "index": 383, 
            "rating": 5, 
            "review": "Great food! Family friendly and service was awesome! Get off the strip and come here!"
        }, 
        {
            "index": 384, 
            "rating": 4, 
            "review": "Oh, HELLOOOOOOO! Sail away with me...on their sushi boat!!!!!!!!!!!!!!!!!!!!\n\n3 kinds of sashimi (sake, maguro, Hamachi) x 4 kinds of nigiri x 3 specialty rolls.\nWe chose the Ohjah roll, Show Me the Love roll, and Cowboys roll. We tried to choose the most expensive rolls. OBVI. \n\nJust having a boat full of sushi come out to you is (almost) like love at 1st sight.\nEspecially when it's $40!"
        }, 
        {
            "index": 385, 
            "rating": 5, 
            "review": "This is one of our favorite places!  The atmosphere is casual and there is a wide variety of items to choose from.   Kid friendly as well as a great place for an adult dinner. The prices are very reasonable and you get plenty of food.  The seafood is as good as their steak and I highly recommend this restaurant and location!"
        }, 
        {
            "index": 386, 
            "rating": 5, 
            "review": "Absolutely delicious!! Great prices, great food, friendly service!! Went in around 6 on a Friday night, no reservations but we were seated immediately!! On the opposite side of town from where we live, but, well worth the drive! We will be back!!!"
        }, 
        {
            "index": 387, 
            "rating": 4, 
            "review": "Been here several times already and I love the Sushi.  When I grow tired of the AYCE quality and I am craving some nice high quality Sushi this is my new haunt.\n\nI can only comment on the Sushi Bar since I have not tried the Teppan. I am a Nigiri Sushi addict. I am a big fan of everything in the refrigerated case in font of me at this sushi bar. So if you ask me what I like, I can just point to the general area of the fish and say \"all of that.\" The only thing that I have found that doesn't blow me away, and this is strictly a personal preference, was the cure on the Saba. Still better than many others though. The daily specials on the board are well worth the price and I have not been anything but satisfied with anything I have ordered from it. I usually order an appetizer, a meal, and whatever fancies me from the specials board and I am happy.\n\nThey have great deals to fit whatever mood you are in. The service is always friendly and attentive.  The restaurant is always clean. The last time I visited it sounded like a party in the Teppan area. I have to try that next visit."
        }, 
        {
            "index": 388, 
            "rating": 5, 
            "review": "The chef's are great the food is great and you can't beat the price.  There's nothing like having your food cooked in front of you and prepared the way you want it.  I love this place"
        }, 
        {
            "index": 389, 
            "rating": 5, 
            "review": "The ambiance is beautiful! The server, Doson, was absolutely polite, efficient, attentive and friendly! Thechef was funny and cooked our dinner in record time. Our 8 year old son was very entertained and enjoyed his filet meal!!\n\nWould suggest filet with shrimp from the tempanyaki grill. Love this place!!"
        }, 
        {
            "index": 390, 
            "rating": 1, 
            "review": "I've been coming to ohjahs for about 2 years and tonight has by far been my worst experience. I usually get the hibachi fillet mignion which is around $10. They refused to accommodate because I wanted to order that and was sitting in the restaurant area. (Perfect amount of food.) I don't really care where it's cooked. So I asked if I could get the kids mean which is TINY, $14 dollars and doesn't even come with noodles. So I had to order noodles on the side which was another $3. I don't mind paying for what I want because I know they're a bit expensive, But they didn't want to change anything! The service ungodly awful. Refills took 10 minutes, horribly rude... I won't be back. I don't even want to give one star... TAKE YOUR MONEY ELSEWHERE!"
        }, 
        {
            "index": 391, 
            "rating": 5, 
            "review": "This place is always good and the hibachi is such a good deal. \n\nChefs are always friendly and entertaining"
        }, 
        {
            "index": 392, 
            "rating": 5, 
            "review": "This is a very fun place to enjoy a nice dinner. We sat at the teppanyaki area and the food was prepared very well and we got some great entertainment as well. Our chef was a bit of a comedian (in a good way) and me made our experience a very pleasant one. This location is pretty empty during weekdays so I've never needed a reservation."
        }, 
        {
            "index": 393, 
            "rating": 1, 
            "review": "Christmas Eve dinner. Yippee.Food was just OK. No return. Had Tempura. It was cold and greasy. Dip was gross. Husband had chicken and beefskewers of some sort. He eats anything and wasn't happy. Service weird and no one in regular restaurant. Teppanyaki was busy. This is our punishment for going somewhere weird on Christmas."
        }
    ]
}