{
    "category": "Las-Vegas", 
    "entity": "Origin-India-Restaurant-&-Bar", 
    "avg_rating_stars": 3.616, 
    "review_count": 375, 
    "reviews": [
        {
            "index": 1, 
            "rating": 5, 
            "review": "We were trying to order out on a Wednesday night and decided to try this place out after Mint didn't answer their phone for about ten minutes. After confirming that they had some of the dishes we were intending to order at Mint (even though they weren't listed on the menu), we placed the order and they had it ready within 25 minutes. Inside there were only two other tables having dinner, but it was around 9:30 at night. Everything came out perfect and they took a lot of time and effort in wrapping our dishes for take out. We ordered the paneer tikka masala, rogan josh, chicken vindaloo, chicken biryani, and garlic naan. All delicious but my favorite was probably the biryani and rogan josh. Highly recommended for dinner."
        }, 
        {
            "index": 2, 
            "rating": 4, 
            "review": "I have to admit I am a Food Network fan so when I saw Rachel Ray review Origin India so highly I got the idea to treat my wife to a nice dinner a bit out of our usual price range. She loves Indian food and it was her B-day so we splurged. \n\nI made online reservations but they were not needed at all, the place was all but empty. We had to wait while the manager interviewed a prospective employee but that turned out bad, voices were raised and we were caught in the middle. Oh well.\n\nThe ambiance was nice, the lighting was low but not like dining in the dark like some places I have gone. As we were seated we were given the wine and drink menu and the dinner menus. A quick note: the menus were dirty and stained from drinks or whatever. This was immediately off-putting because in a place with as high a Zagat Rating of 26/21/21 I would have expected more. OK, maybe I expect too much.\n\nSo, the option, bottled or LV tap for water. Let me say up front, I am not paying $8.00 for a bottle of Pellegrino (price not listed, so I am assuming)  that is $2.00 in the store. Local is fine thank you. Am I cheap? No, I am in this restaurant, but I am thrifty, no need to be hosed. Then it took 5 minutes just for water to be served and another 10 minutes for Iced Tea. The tea was a black tea, refreshing, but not unusually so.\n\nI think the staff had to be bored as we had like three different waiters. I was not certain who was serving what and that felt a little odd. We went on to order the Raisin and Apricot Naan which was delicious and an appetizer of Chicken Tikka that was very good. I am not sure it was actually Chicken Tikka, it was not spicy at all except for what looked and tasted like spice grape leaves holding the appetizer to the plate, but it was good.\n\nThe entree for me was a Moulard duck leg confit coated in ginger, garlic, cinnamon, honey and orange zest, served with butter poached potato and sweet and sour kumquat marmalade and my wife had Southern Indian style diced lamb stir fry diced lamb stir fry with curry leaves, black mustard seeds, whole Kashmiri chilli and coconut, served with lemon rice. Here is where Origin India shined. Both plates were wonderful to look at and the taste was marvelous. They have earned the 26 Zagat Food Rating (should be 27 in my book).\n\nFor dessert we tried the \"Indian Donut Holes\" and while tasty, a bit of a disappointment. Oh well.\n\nThe atmosphere was disturbed while we were there by a guy yelling into his cell phone. If I had my way cell phones would be discouraged in a fine dining establishment, they are so annoying. But management just let this guy yammer away even when they saw the dirty looks we and others in the restaurant were giving him.\n\nIn all our dining experience was about two hours and that was expected. I have to admit that although the food was superb, they overall experience lacked polish that for the prices charged I would have expected. They attempted to provide a high dining atmosphere but fell short on the details like not replacing silver in a timely manner and by letting drinks to be emptied before refilling. I did not expect the classic \"crumbing the table\" but the little things seemed to add up.\n\nIf the prices were a little more reasonable for the experience I would be a frequent diner, but the tab was a bit too steep to make it a regular thing."
        }, 
        {
            "index": 3, 
            "rating": 5, 
            "review": "In terms of authentic taste and service this is by far the best Indian restaurant I have been to. It was very clean and had a soothing atmosphere.\n\nThe lamb was perfect, highly recommended. More then enough food too and makes a great lunch the next day. \n\nMost menu items are on the $16 to $25 dollar range which is very reasonable for dinner and the quality.\n\nI will be back to check on the weekend brunch."
        }, 
        {
            "index": 4, 
            "rating": 3, 
            "review": "Indian food is one of my favorite types of food! We have been coming to this place in the last 5 years.   I must say food and service get a bit worse every time we visit.  This used to be our first spot to suggest when we have visitors from out of town.   But these days I am hesitant as I am not sure what the experience will be that particular day.  Portions used to be larger and prices were lower.  Also hotness of the food seems to be very inconsistent.  I have ordered hot before and did not think it was spicy enough and on other occasions we ordered medium to hot but it was so spicy no one could even eat.  It was a bit embarrassing as we were there with friends and we had hyped up the place so much to them.  \nNan bread has always been good!  5 stars on the Nan bread!\nI agree with some of the other reviewers services is a hit or miss, and yes, the staff is not the friendliest!\nHope they improve and I would love to continue coming to this restaurant!"
        }, 
        {
            "index": 5, 
            "rating": 1, 
            "review": "Terribly rude waiters that seemed impatient and ignorant of what to do. One waitress got upset when my young cousin moved her fork from the appropriate side of the plate.\n\nFood wasn't too great either, especially considering a particular amazing Indian place in Las Vegas. \n\nOrigin India is to good Indian food, as Taco Bell is to good Mexican food."
        }, 
        {
            "index": 6, 
            "rating": 5, 
            "review": "My favorite Indian Restaurant in the whole wide world!\nEvery time I go to Vegas, I make sure to stop by there to grab a lunch, yes, lunch not dinner. Lunch is almost half the price of dinner and and they serve the same portion of food. \n\nMy favorite is chicken Mak Markani. I love spicy food so I always ask for INDIAN spicy not AMERICAN spicy when it comes to spice level. \n\nThe decor is just OK. too much brown which makes it gloomy but staff is really nice. Ask to be seated in Abel's section."
        }, 
        {
            "index": 7, 
            "rating": 3, 
            "review": "First time trying Indian food, this place is dark inside, a bit too dark. Once seated we noticed there was only 3 other tables occupied inside the restaurant, a bit slow for dinner time. The food is expensive, especially considering that you have to pay separately for rice or bread. We ordered a chicken mukhani, a lamb nihari and a bowl of steamed rice. The chicken was flavorful and spicy, to my liking but the lamb was a bit plain that it made the lamb overwhelm the dish. Portions were a bit small for such an expensive dish that does not come with rice or bread. Service however was well. We had a living social coupon here, and even with that in our bill it was not all that worth it. Good for an experience but not worthy enough to come back. I would give it a 2.5 but bumped it to 3 because with a yelp check in I got a free manga lassi. This place might be more worth it during lunch or brunch buffet."
        }, 
        {
            "index": 8, 
            "rating": 5, 
            "review": "Chicken Tika Masala was amazing, the manager was very helpful and attentive. Love this place."
        }, 
        {
            "index": 9, 
            "rating": 4, 
            "review": "We had dinner there last night with the Groupon.  \n\nAppetizer: paneer cheese tikka - this was OK. \nEntrees: The black cod was cooked perfectly and the lamb curry was delicious.  \nDessert: poached pear - our waiter recommend it to us, totally amazing!\n\nSupposedly the waiter thought my friend looked like his brother... He was pretty funny and gave HONEST recommendations.  Don't ever get the Indian ice cream..."
        }, 
        {
            "index": 10, 
            "rating": 1, 
            "review": "The service was dubious. Very over priced $5 for rice $3 for side of sauce, entrees $14 for veggie and upwards of $35 for meat.  Indian food should not be anywhere close to this much especially when served with a frown."
        }, 
        {
            "index": 11, 
            "rating": 4, 
            "review": "My sister and I used the \"$20 for $40\" promotion last night at Origin India. It was my second time eating there but my first time since going vegan (my sister is vegan, too). We had pretty much decided on what we were going to order when my sister asked our server, Senad, a few questions about butter, meat broth, etc. He said, \"You're vegan? We have a vegan menu,\" and took our menus and returned with a comprehensive two-page all vegan menu. My sister and I were pumped! The only problem with the vegan menu is THERE ARE NO PRICES! That really annoyed me. We asked Senad what the prices were and he said something along the lines of, \"oh the prices are just like the regular menu.\" Not good enough. It seems so strange to go to the trouble of making up a whole vegan menu and then not provide prices. \n\nThe food came out quickly. We ordered 3 vegan samosas ($7) and they were fantastic. The rest of the food came out shortly thereafter. We ordered Baingan Bhartha ($11), Aloo Gobi ($11), and Bhindi Masala ($11). Since none of those dishes come with rice we ordered Pulao Rice ($4), which is basmati rice with saffron. We also ordered Roti ($2). Everything was delicious. The Bhindi Masala (an orka dish) was my favorite (I think my sister's, too). It had a lot of different, intense flavors. The Baingan Bartha (eggplant) was really good, too. It had a little bit of a spicy kick. The Aloo Gobi (curried potatoes and cauliflower) was also really good. I am a sucker for potatoes. \n\nOver all it was a great meal. The priceless menu was annoying, and Senad was an overbearing server, but the food and the rest of the wait staff made up for the shortcomings. Excellent food! Vegan friendly. Make sure to ask for the vegan menu."
        }, 
        {
            "index": 12, 
            "rating": 5, 
            "review": "Best Indian food I have eaten in Las Vegas"
        }, 
        {
            "index": 13, 
            "rating": 3, 
            "review": "Indian food is definitely one of my favorites, so I'm very picky when it comes to it. While Origin isn't one of my favorite Indian restaurants, it's pretty good. They have great garlic naan bread and their veggie samosas are good as well. I'm not a huge fan of their entrees, however, their desserts are pretty tasty. I really enjoyed their Gulab Jamun, Mango Kulfe and this poached pear dessert they serve with ice cream. I can't remember the name, but it was on the menu when I was there last week. If you like pears, try it!"
        }, 
        {
            "index": 14, 
            "rating": 5, 
            "review": "Best Indian I've ever eaten! Sauces are so rich and flavorful, it's almost like a fusion with French food!"
        }, 
        {
            "index": 15, 
            "rating": 1, 
            "review": "I WALKED IN WEARING A 3 PC ARMANI SUIT, WALKED OUT WITH ONLY MY UNDERWEAR...........Did not pay much attention to the prices on the menu, ordered several items, including drinks.  Noticed that the portions were TINY....so being hungry I ordered more food and more drinks......so when the bill came, I almost fainted...THE PRICES THEY CHARGE FOR A STRIP CENTER RESTAURANT ARE EQUAL TO A KING S RANSOM.....I would not pay this much at a five star restaurant at the Bellagio, or the Venetian.   The owners have a typical Indian mentality...get rich quick with high prices, small portions, lousy service.  The one arm bandits are not only in the casinos  but are alive and well at Origins India. Don't go here unless you have money to burn. I want my suit back."
        }, 
        {
            "index": 16, 
            "rating": 4, 
            "review": "This was a very good experience.   The waiter , Abel, was very informative on the food and beer.   His recommendations were very excellent.  All the entrees were fresh and tasty.  Abel recommended the new variation  of Bryan is and it was so good.  A fourth person was late, but he made her feel welcome.  He reheated and added more sauce to the chicken tilkka Masada.  Ask for Abel!"
        }, 
        {
            "index": 17, 
            "rating": 5, 
            "review": "Great taste, nice atmosphere, okay prices."
        }, 
        {
            "index": 18, 
            "rating": 5, 
            "review": "All of my foodie friends from all major luxury resorts and VIP guests from all over rave about Origin India. Those with a sophisticated and well travelled palates recognize the freshness and quality of the ingredients on a daily basis. I dare anyone to leave disappointed as they only employee Indian chefs. Hats off to an amazing venue & team."
        }, 
        {
            "index": 19, 
            "rating": 4, 
            "review": "Been here a handful of times and it's never a disappointment. The food is extremely flavorful and it's some of the best Indian food in Vegas, not bland like other places. True flavor. Some of the appetizers are not that great flavor wise. Every experience here is delightful and the service is always great."
        }, 
        {
            "index": 20, 
            "rating": 3, 
            "review": "Good food and service. A bit pricy - 85 for two with tip included shared app and food. Food is authentic and presentation was unique. Although you can't get too unique with Indian food. \n\nPlace was packed on Thursday night which became our decision factor to enter and eat."
        }, 
        {
            "index": 21, 
            "rating": 2, 
            "review": "I was in Vegas with my family and grandfather had come with us as well, so we were looking to take him to an Indian food place for lunch. This place had a 4 star rating on yelp so we thought we should give it a try for lunch.\n\nWe walked in and the first thing I said to myself was, \"wow, this is nice.\" The decorations were very well done, and it looked upscale unlike your typical Indian restaurant. \n\nUnfortunately, the lunch buffet was atrocious. There were very few choices for vegetarians, a rarity in Indian restaurants. The only vegetarian appetizer was the vegetable pakoras, which they had ran out of when we got there. They eventually made more, but we were already half way through our meal. To their credit, the pakoras were good. They had a half-ass salad along with some kidney beans. \n\nBoth vegetarian sabzis were potato based: aloo matter and aloo gobi. Wouldn't you think not to make two very simialar dishes? It seemed like they forgot to put salt in the aloo matter while the aloo gobi tasted like there was twice as much salt as needed. The quality of the ingredients were good, but the taste was totally lacking.\n\nAlso, they had rice, but there was no form of dhal. Who eats plain rice? I understand non-Indians will just mix one of the sabzis, but if you are an Indian restaurant, please make the effort and don't cheap out. \n\nFinally, there was no dessert at all. What kind of lunch buffet doesn't have a dessert dish?\n\nThe service was bad as well. They clearly paid more attention to those customers ordering off the menu. I had to wait about 10 minutes to get my glass of water refilled, and there were only 3 other parties there at the time. \n\nThe other good thing they had was their naan. It was delivered hot and fresh to your table, and it was done perfectly. The only  two things that were good were the naan and pakora.\n\nThis place maybe different for dinner or if you order off the menu, but don't even think about going here for the lunch buffet, especially if you are vegetarian."
        }, 
        {
            "index": 22, 
            "rating": 3, 
            "review": "If there is a single phrase to describe this place it's \"a bit too\" : dimly lit, much vinegar in the chicken tikka \"caesar\" salad dressing, expensive. \n\nThe service is gracious, my curry lamb stir fry entree was excellent, and it was served with rice - the poppy seeds are a nice touch. The actual chicken in the salad was delicious and tender, but the \"caesar\" part is taken too literally, and definitely more than a \"take\"- note: nobody actually wants to pay good money for a standard caesar salad.   Although, I would have liked some naan bread to go with it but I did not think it too fitting to pay for an additional item for a meal that already totaled more than $30 when my purpose is to dine, catch up on the news in the paper, and go.  On that note, it's probably a decent place for a date what with the mood lighting, attentive service, and attractive setting."
        }, 
        {
            "index": 23, 
            "rating": 3, 
            "review": "I love Indian food, but this was just ok.  To me it seemed like they were trying to hard to be fancy and 'cool'.  I'd have been happier with decent amounts of good quality food that just tastes good, and doesn't trey too hard to impress.  With that said, the location and service was good, the place also looked very clean and well maintained, and the staff were very pleasant."
        }, 
        {
            "index": 24, 
            "rating": 5, 
            "review": "The food here was fantastic - authentic Indian, not extensively \"Americanized\" like many others. I have several food allergies and the staff made sure I made appropriate food choices. I also liked the \"a la carte\" features as I can't eat grains and it was perfect that I could order meat and vegetable dish and not worry about having more rice on the plate than anything."
        }, 
        {
            "index": 25, 
            "rating": 1, 
            "review": "DISGUSTING!! WORST INDIAN FOOD EVER!!!! And I eat a lot of Indian food.....Don't let the ambiance and the friendly service fool you. When you get down to it and have questions about the details of items on the menu..... they don't care to answer questions about their food and I soon learned why. I ordered veggie dishes, my partner the typical tika masala. I inspected my food and it had the weirdest smell......After asking questions, we found out this place does not specialize in making fresh food with quality ingredients. Much of the food is processed and comes from cans and containers. I was told directly by my server that the eggplant in the baingan bharta was from a can! I have heard it all. Who the heck uses eggplant from a can in an Indian restaurant? Oh the people at Origin India. Who would have THUNK a fresh dish like baingan bharta could stand up with such yuckiness with someone who knows better?  OMG it was so digsusting. It looked like vomit on a plate. And it smelled like some dangerous chemical which prompted my questions to begin with.....Origin India should be ashamed of themselves for serving this garbage and having the nerve to say this food was prepared by anyone claiming themselves to be a \"Chef\".  AND the prices are outlandish! It's close to the strip and seems to be a tourist trap. I would not risk my health eating here. And that's no laughing matter."
        }, 
        {
            "index": 26, 
            "rating": 2, 
            "review": "I consider myself to be a curry aficionado. I grew up in Vancouver, which with its large Indian community, has amazing curries. I lived in London for several years, which has some of the best curry houses out there. I know what good curry is, and Origin just doesn't have it.\n\nPerhaps the fusion menu is somewhat better than the traditional menu, but I was in the mood for curry so I stuck with the traditional. We ordered 4 different dishes, 2 mains and 2 sides. We had a curried lamb shank, a prawn dish, mutter paneer and dal mahkani. \n\nLet me be clear, the curry was not necessarily bad, it just wasn't that good. Each of the dishes tasted exactly the same, and looked much the same. The food was bathed in some sort of bitter tasting dark-colored gravy. It would have been fine as a stand alone dish, but getting 4 plates of exactly the same flavor/texture just didn't do it for me. \n\nThe other off putting thing about the place was the turn and burn type service. It was rushed even though we had reservations, and it wasn't that busy. The server didn't come back once except to bring the check. Also, the bus boy came to take our plates away 2 mins after being served, and before we had even started on the food! Oh, and it's overpriced too.\n\nI have to say, I am disappointed. I had high hopes after reading my fellow yelpers' reviews. My search for good curry in Vegas continues..."
        }, 
        {
            "index": 27, 
            "rating": 5, 
            "review": "Amazing food at a good price. I highly recommend the Chicken Tikka Marsala....it was really tasty. Their lunchtime buffet is really good too."
        }, 
        {
            "index": 28, 
            "rating": 4, 
            "review": "I ate here with a few Germans of whom were vegans. It was like the blind leading the blind. They didn't know what to order and neither did I. I only knew about curry, tandoori chicken and nan. Unfortunately, they didn't have curry, which I found strange for an Indian restaurant, but I learned it depends on what region they're from as to whether they eat curry or not. Anyway, I called my Indian friend and she made one recommendation that her mother-n-law made for me before. Then we ordered some other things with nan and it was all pretty good. I have no idea what any of them were. I'm looking forward to returning to try the same things, but that will be a challenge because I don't know the names of the dishes I tried."
        }, 
        {
            "index": 29, 
            "rating": 5, 
            "review": "The absolute best Indian food in Las Vegas.  The best appetizer is the lamb seekh kebab.  So tender (I recommend getting extra mint sauce)\nI love this restaurant, because I can take first timers as well as friends that love Indian food.  \n\nSome of my favorite entrees are Chana Massala (vegetarian) Chick peas cooked with tomatoes and various indian spices.  DELICIOUS.  I prefer it pretty spicy, but I hear it's also tasty when mild.\n\nThe New Zealand Lamb shank is absolutely amazing.  The chicken Tikka Makhani is probably the most popular, and best dish for beginners.  If it's your first time, I suggest getting a few family style dishes to share, so that you can sample some of everything.  ."
        }, 
        {
            "index": 30, 
            "rating": 5, 
            "review": "Origin India is the reason my wife and I now constantly crave Indian food.  They have the best masala in Nevada. Plus the service and ambience are perfect.  This is the only place we will go. Plus the lunch buffet for $15 is once of the best deals in town"
        }, 
        {
            "index": 31, 
            "rating": 5, 
            "review": "This is the second time we visited Origin India.  The first in 2012 and enjoyed the tasting menu.  The second time was April 2014 with only a vague recollection of where the restaurant was located but enough memory to seek it out we enjoyed it so much the first time.  We were not able to indulge in the tasting menu this time but enjoyed our selections as much as we did in 2012.  The restaurant was fearfully dead the night we went so hopefully other Yelp readers will give them chance.  You will find it worth your time."
        }, 
        {
            "index": 32, 
            "rating": 5, 
            "review": "Goat biryani, butter chicken was amazing. Probably one of the best that I have had! Mango lassi was good too! Service was not too bad. Great overall food! Definitely would go again!"
        }, 
        {
            "index": 33, 
            "rating": 3, 
            "review": "I really enjoyed the service and their effort to help educate us on Indian food. I have to say that I've always been skeptical of this type of food and its hard to win me over. So I gave an extra star just in case I'm being unfair on the food. I liked the ambiance, the location, the service, and the food tasted good. My only real complaint is the price. It just seemed steep for what we got. $116 for two people is not a big deal but for what we got, I think that was the real challenge. But overall a good meal and service."
        }, 
        {
            "index": 34, 
            "rating": 5, 
            "review": "Great food! Amazing service!  Great vibe. Reasonable prices!  We're staying at the Hard Rock hotel and walked by. We're so glad we stopped here."
        }, 
        {
            "index": 35, 
            "rating": 1, 
            "review": "AWFUL.  I am sorry I come from Edison, New Jersey where you have a lot of indian restaurants that are amazing including buffets with restaurant quality food.  I travel a lot and have to admit this is one of the worst Indian restaurants I have ever eaten.   Honestly I have had better Indian food in Kansas City. The food had no flavour.  I think my mom could cook better than this.  The buffet has no rhyme or reason to it,  there are choices like Fried fish and then you have paneer with some weird sauce and vegetables.  I eat Indian food twice a week and was really disappointed.  As I spoke to a few people in the restaurant, most were tourists so you get the impression that they probably do not have a lot of repeat clientele.  Would not recommend and will not go back."
        }, 
        {
            "index": 36, 
            "rating": 4, 
            "review": "Good flavorful food! The price fixed selection is probably the way to go. Ordering items individually can get expensive. This was my second time eating here and both times the food was good as well as the service!"
        }, 
        {
            "index": 37, 
            "rating": 1, 
            "review": "This place offers so many specials and coupons, yet they seem to be very picky about using them and redeeming them. We had gotten a groupon deal but when we were paying they said they couldn't accept the groupon because wasn't in their database yet and we would just have to pay and they would email us another one... never got that email of course! :-/ \nAlthough this did happen we went during the lunch buffet and it was pretty good, but $16 for an indian lunch buffet is way too high and there's a lot of competition in this town. We only went here because we had the coupon and it ended up costing us extra in the long run! Super annoying! Rarely complain about places, but I won't be going back there..."
        }, 
        {
            "index": 38, 
            "rating": 3, 
            "review": "We had a groupon that we needed to use so we came here for dinner. We ordered the garlic naan, samosa, chicken marsala, and the origin India platter that came w paneer cheese, lamb sausage, chicken, prawn and some lentil/bean type of soup. \n\nPros:\n- Can never go wrong w chicken Marsala and naan. \n- Samosa was yummy\n\nCons:\n- Seemed like there was only 1 waiter and so it took awhile to get his attention\n- By the time I got my platter, my food was not hot so eating it semi warm made it gross. The prawns didn't seem like they were well cooked or over cooked. Rubbery on the outside and a bit mushy on the inside. \n- Menu was too complex. Like most high end places I guess. I hate reading. Lol. Not a lot of choices\n\nOverall, I felt out of place there. I prefer to go back to India Palace. The environment is just more friendly and more welcoming. The waiters and waitresses there are more attentive."
        }, 
        {
            "index": 39, 
            "rating": 1, 
            "review": "Terrible service. Everyone in our party was forced to order their own entre, even though some of them were not hungry. The entre come with nan. The waiter refused to substitute them with similar priced roti because \"the chef was unwilling\"."
        }, 
        {
            "index": 40, 
            "rating": 1, 
            "review": "THE CHEF WENT TO THE BATHROOM AND BURNT MY LAMB CHOPS....I have never seen such pathetic lamb chops in my entire life...for 24 dollars, I got 4 tiny chops, 50% of them were burnt...BLACK in color...had to cut off 50% of the meat so that I could eat them.  Hey guys, if you don't want to go out of business, increase your portion size..charge what you want, but at least give us our moneys worth. You only have one chance to impress your customers..if you don't, they won't come back. We paid 10 bucks for a Taj Mahal Beer...the highest price in the United States..have had this beer in many restaurants all over the US....never paid more than 7.00 for a large bottle...the salty lassi was more water than lassi...the prices are ridiculous..i honestly think you guys won't last long...but good luck to you."
        }, 
        {
            "index": 41, 
            "rating": 5, 
            "review": "Long over due review- a year old but I can still remember the food was delicious. Nice and clean restaurant."
        }, 
        {
            "index": 42, 
            "rating": 3, 
            "review": "We went to origin with a groupon.  Though the food was good the service needs a lot of improvement. We don't go out to Indian food very often because it is soooooo overpriced in vegas and we often make our own instead.   We tried it because of the groupon.  The service was disorganized and not the friendliest.  I think only one guy actually smiled.  Our child has a lactose allergy and the waiter told us they could separate out the cheese naan.  They forgot.  There was confusion about where they put the groupon and our bill had to be redone.  Nothing too big a deal but the lack of friendly attentive service was surprising considering the expense.  The food itself was some of the best we have had in vegas.  There are not that many good Indian places here.  Don't know if I would go back considering the prices and mediocre service.  BTW if a decent Indian place ever opened with significantly lower prices like they have in other cities, we would be there EVERY week.  I don't know whats up with the jacked up prices for Indian food.  We end up going out for Malaysian or Aftican food as an alternative that is more affordable.\nAlso, I am married to an Indian and so we know our Indian food."
        }, 
        {
            "index": 43, 
            "rating": 4, 
            "review": "This was a good deal. got a sweet yelp deal and the food was pretty authentic. The place was more uppity than i thought but who cares. food was great!"
        }, 
        {
            "index": 44, 
            "rating": 5, 
            "review": "Very good customer service. I've came here with my family and we're fasting the waiter had given us dates to break our fast. Our prophet Mohammad had broke his fast with a dates. Very hospitable people and educated staff."
        }, 
        {
            "index": 45, 
            "rating": 4, 
            "review": "Being that this was my first time actually going to an Indian restaurant, I really have no place reviewing Origin India.  I picked this place to go to with some out of town family because they took reservations on opentable.com and they had gift certificates for sale on restaurant.com.  We all enjoyed the food, but I was told the menu was unusual for an Indian restaurant by the rest of my party.  Once the food arrived, however, we were all very happy with our meal.  Not much in the way of atmosphere, but a very nice staff and delicious food... what more can you ask for?"
        }, 
        {
            "index": 46, 
            "rating": 3, 
            "review": "After hamburgers galore, I was craving hole-in-the-wall ethnic fare. This was a solid Indian buffet; it's no Lahore Karahi, but what is? The best dish - by far - was the fried paneer - like mozzarella sticks but better. They weren't afraid of spice. Also, the free naan was quite nice - with a perfect crisp to pillowy ratio. We liked our 19 year old waitress and hope she gets out of Vegas. For Vegas, a steal at $15 a person. The space was clean and modern. Service was relatively good."
        }, 
        {
            "index": 47, 
            "rating": 4, 
            "review": "I had never eaten Indian food before but it was a great place to dip my toes into the complexity of the Indian cuisine. Both times I've gone was for their lunch buffet and I qualified for a discount on it for being UNLV student which was great. \nAttentive staff, lovely atmosphere, and delicious food!"
        }, 
        {
            "index": 48, 
            "rating": 5, 
            "review": "every time i go to las vegas (for work not pleasure) i go to this place, right by  the hardrock hotel. it's  great and they make these indian sandwiches that are finger licking good! friendly staff and clean atmosphere. i great find!"
        }, 
        {
            "index": 49, 
            "rating": 3, 
            "review": "I came here for lunch with my girlfriend because we had Groupons. We chose the buffet option because we thought it would give us the better deal. The food was alright but there was not much of a selection. Also,  almost all of the food was super spicy which is fine if there were other options but there were not. The music was good though!"
        }, 
        {
            "index": 50, 
            "rating": 5, 
            "review": "Great Buffet for lunch. I definitely want to come back for dinner. We stopped in yesterday since we were in the area. It did not disappoint. All the food was fresh, refilled continuously and plentiful for our small party. There are enough tables to get seated right away. Here you won't have to wait like other food joints. This is important when you only have an hour for lunch. \n\nI have had them at the convention center before and by all means, this buffet was the best deal off the strip. At $10.95 for the lunch buffet from 11:30am-2:00pm, I got enough to eat I skipped dinner. \n\nThe service was impeccable. The wait staff was courteous and always refilling our drinks, bringing over more Nan and asking if we needed anything else. Right now, you get a free Mango Lassi (Mango Smoothie) when you check in. Lassi is a yogurt smoothie with fresh fruit and spices. It's thick and creamy and helps cool your palate if you are eating something spicy.  \n\nThe buffet had many choices, from traditional Pulao rice to 5 different curries and 3 choices of chicken dishes, salads, vegan dishes, and plenty of veggies to get your daily requirement. It was very filling. With our food came a large basket of 3 different kinds of Nan to dip in your food sauces. Nan is Indian flat bread used to eat your food (like a tortilla). All 3 kinds were delicious, Apricot and raisin filled, cheese filled and garlic & coriander topped. My favorite was the garlic. It added an extra kick to every savory bite of Chicken Mahkani I ate. I also tried the house salad, which is your traditional restaurant house salad for those watching their figure. The vegetable samosa has a little kick but tastes like a party in your mouth. It's too good not to try at least once. The Chicken Curry, Lamb Tikka Masala, and Palak Paneer were authentic and fresh. Hard to come by at a buffet. \n\nDessert, where to we begin? (Yes I had dessert at lunch, YOLO!). To try something different beyond the typical chocolate lava cake you find at every restaurant (gag!), we went for the Almond Kulfi (thick creamy almond ice cream) and the Gajar Ka Halwa (Carrots with raisins and slivered almonds cooked in cream, served warm). It was delicious! You have to try it during your visit. \n\nOrigin India is the spot for Indian food near the strip. You have to give it a try."
        }, 
        {
            "index": 51, 
            "rating": 4, 
            "review": "I bought yelp $20 deal for $40 and went w/ 2 coworkers for their $15 for 3 course meals - choice of appetizer, entree, and dessert.. I love their appetizer - chicken fries.. the portion of it is great, not small, and the sweet and chilli (jst a bit) sauce enhanced the chicken fries' taste! Then I chose the chicken tandoori, which is a bit sweet and not spicy at all.. It comes with garlic naan, which is my FAVORITE! Love it.. Then I chose the rice pudding as dessert.. Everything was great and elegant. The restaurant is classy and clean, service was great.. definitely will go again.."
        }, 
        {
            "index": 52, 
            "rating": 4, 
            "review": "I've been to OI several times over the years, and it seems they get better each time.  I think they move back and forth between old school and noveau, but each time it's been delicious.  Their staff is well trained  to interpret customer nuances and are very knowledgeable in their craft.  Last meal? Veg samosas ( non-traditional but tasty wrap, scrumptuous filling) and chicken tikka (perfectly grilled, seasoned and juicy).  Followed with delicious saag paneer (cheese quality was phenomenal, wonder if they actually make it in house or they buy it) and the kabob platter, scooped with plain naan.  I was not that impressed with the lamb, but still good...and the tikka this time around was just a bit dry.  Those two details and the slightly higher prices (with a la carte breads & rice) may take away a bit, but not a full star.  Great meal, great service, very comfortable and tasteful ambiance (definitely Indian, yet with a very crisp feel).  Every meal? Maybe not...but definitely perfect for a night out or special hangout.  Well done OI!"
        }, 
        {
            "index": 53, 
            "rating": 4, 
            "review": "Amazing food.. Loved their Old Delhi style Chicken Makhani & Garlic Naan.. Yes, pricey but then it's Vegas and I dont mind paying more as long as the food is good! Went twice.. Will definitely go again..and again!"
        }, 
        {
            "index": 54, 
            "rating": 4, 
            "review": "I rather hate Las Vegas. I mean, if I have to go to a conference for work, I guess I would rather it be in Las Vegas than say Dallas. But for the most part, I'm not a fan of the crowds, of the gambling, or really of the mind-numbing lack of choices in things to do and see. My food experiences in Vegas have been pretty sub-par. Until Origin India, that is.\n\nI first found this place about 4 years ago, when I was last in town for a conference. And short of eating in homes in India (which, yes, I have done), it was the best Indian food in my life. I was introduced to the glories of beet and carrot halwa -- a dairy dessert made of beets and/or carrots. Sounds disgusting, right? It's not. It's delicious. And, I have dreamed of their halwa (occasionally I have literally dreamed of it) since then.\n\nSo I am back in town on business. And rather than eating at one of the places on the Strip, I hurry back to Origin India as soon as I can.\n\nIt's still delicious. But, it's not the same. I see from another post that there is a new chef. Perhaps that's the issue. I feared it simply suffered from too much exposure -- upon my arrival, I saw that so-called \"chef\" Rachel Ray had discovered the place, and that it subsequently enjoyed a rise in popularity. And, as so often happens with small places that get discovered, they sometimes rest on their laurels.\n\nDon't get me wrong -- some of the things were still excellent. Their naan was fantastic, for example. And the channa was top-notch. But, serving the potato soup in a tall shot glass made for nice presentation, but didn't cover for the fact that it was kind of bland. And, it didn't really help the diner, as it never allowed the soup to cool to a low enough temperature to comfortable eat/drink it.\n\nI ordered the tasting menu. And my main course -- the channa - was delicious. But other things just felt a bit sub-par. The sherbet served between courses felt good to the palate, but it was from the grocery. And the complimentary dumplings were just pakoras in a sauce.\n\nSo, Origin India, I still heart you. And I'm hoping you get your groove back, because I used to tout you as the best Indian restaurant in the country. And now, all I can say is that you are a great alternative to the poor choices on the strip."
        }, 
        {
            "index": 55, 
            "rating": 4, 
            "review": "So I've eaten at Origin India a handful of times and have had wildly different experiences.  If I were to have judged based solely on the time I came for a lunch during the week, I might have gone with two stars.  They didn't want to serve me off the menu, the server was rude and unhelpful, and the food wasn't anything special.  Or there was the time I came on a late Sunday afternoon and I didn't have anyone even talk to me for the first 20 minutes after I had been seated.... \n\nSo, why am I going with four stars?  Well, when this place is good, it's five-star good.  The servers are friendly and attentive, the food is tasty and flavorful, and you can usually find a deal to help on the cost.  The restaurant itself is beautiful and makes a great date spot.\n\nWe are always seated quickly even when the place is packed.  Usually we have someone ready to get our drink orders asap (except on super busy Sunday afternoons) and they are pretty good about refills.\n\nMy husband and I always order the same items at every Indian restaurant: a mango lassi, garlic naan, vegetable samosas, saag paneer, and vegetable korma.  All of these are done well here.  I wish the mango lassi was a little bigger and the garlic naan a little more doughy, but overall everything is great.  This is the place where I found enormous chunks of cheese in my saag paneer and that put a big grin on my face.\n\nJust a few fyi's: sign up for their frequent diner card and get $15 off every time you spend $100, find coupons through yelp/restaurant.com/etc, I've noticed their food is a tad spicier than other Indian places so be careful if you don't like heat, I don't really recommend coming at lunch considering the difference in service I've had at dinner time, their food is a little more upscale so they may have some different items than other Indian restaurants.\n\nAll that being said, the majority of the time Origin India is great.  Just please don't hate on me if you catch them on a crazy Sunday afternoon."
        }, 
        {
            "index": 56, 
            "rating": 4, 
            "review": "Staying at The Hard Rock Hotel. Wanted something close by for dinner.  Walked outside and saw a strip mall.  There were a few choices. This restaurant looked like a good option. So glad we tried it.  While the service was a bit slow, the food made up for it. We tried the Tandoori Chicken, Chicken Tikka Marsala, Lemon Rice and Garlic Naan.  It was all very delicious.   The chicken in both dishes was tender and so flavorful and not dried out. The rice was delicious.  The Naan was excellent.   They were great about filling the water.  Just a bit slow coming to take our order and to bring the check.   We would definitely come back again.   Wish I had a Tandoor Oven at home.    \nYou will be very happy with your meal.   You need to try this nice clean restaurant."
        }, 
        {
            "index": 57, 
            "rating": 5, 
            "review": "My favorite place to eat Indian food in Las Vegas. Selection is very good and its always a good experience to eat at this restaurant. It is tad expensive but I will any day pay that premium to have top quality Indian food. Perhaps addition of a few vegetarian items will make it even more attractive. Will always recommend to anyone who wants to have top quality Indian food and wouldn't mind paying a bit of a premium for that. We recently had a group dinner as well and again the experience was just fabulous."
        }, 
        {
            "index": 58, 
            "rating": 5, 
            "review": "Origin India is my favorite Indian restaurant in Las Vegas.  Although you will pay a bit more for the food here than many of the other Indian places, it is well worth it.  The atmosphere is serene and the restaurant definitely is well kept and clean.  \n\nThe food is always fresh, ingredients are top notch, and the presentation is amazing.  The service is very attentive also.\n\nSome of the items that are exceptional include:  chana massala, kebob platter, samosa, chicken tikka makhani, and of course the garlic naan."
        }, 
        {
            "index": 59, 
            "rating": 4, 
            "review": "Delicious appetizers. Entrees are served a la carte, and a bit spendy, and we weren't super hungry so we skipped them and got a couple of apps and mango lesi free for checkin on Yelp. But the staff was friendly, attentive and setvice"
        }, 
        {
            "index": 60, 
            "rating": 1, 
            "review": "Bait and switch on the groupon!  This place says that Dec 29 is a holiday.  I was reimbursed from groupon because I cancelled within 3 days of buying the deal, but wouldn't bother trying them again."
        }, 
        {
            "index": 61, 
            "rating": 3, 
            "review": "It was a little over priced for me, I used the yelp deal, but I dont think i would return without it. The food was good, but not any better than the lower priced Indian restaurants I've been to."
        }, 
        {
            "index": 62, 
            "rating": 5, 
            "review": "Origin India is one of my favorite places to eat in Las Vegas!!! I always come back for the great food and the great service:) I can never remember what I order, but they always remember me and what I love to eat!!! Thanks guys!!!"
        }, 
        {
            "index": 63, 
            "rating": 5, 
            "review": "All I can say is \"YUMMIE\"...My husband and I eat here all of the time and always enjoy it.  Everything is so fresh and delightful.  It's a short cab ride from the strip and worth every penny!"
        }, 
        {
            "index": 64, 
            "rating": 5, 
            "review": "After reading the reviews I was really hesitant to eat here but I'm so glad I came. The food was extremely tasty. Service was great and I used the yelp coupon. Check in and get a free mango lassi! I will definitely be coming back here!"
        }, 
        {
            "index": 65, 
            "rating": 4, 
            "review": "The 4-star rating is mainly because the food in this place is excellent, less homey Indian food, and more of a modern take, a posh date place perhaps, but I still think it's some of the best Indian you can find in Vegas. \n\nIt is a bit pricey and they seem to have raised the prices more the last time we went. My other complaint is that the last 2-3 times we've gone, the waiter has been a bit pushy with trying to get us to buy bottled water or a more expensive bottle of wine, this isn't the sort of vibe I go for. But definitely check it out once, and try the tasting menus, they are a good value for this place."
        }, 
        {
            "index": 66, 
            "rating": 3, 
            "review": "YELP COUPON USERS BEWARE!\nWe read all the fine print on the coupon before purchasing the $20 for $40. When we arrived for lunch, a buffet was our only option. We presented the coupon and were told that we couldn't use it for lunch, nor could we use it for a buffet.\n\nIT DOES NOT SAY THIS ANYWHERE ON THE COUPON.\n\nAfter a bit of arguing, the waiter reluctantly said he'd accept the coupon and off we went to the buffet.\nThe food here is excellent. Everything we tried was of good quality and well spiced. We have eaten at many Indian restaurants, all over the world, and this is one of the better ones.\n\nPersonally, we don't love using coupons, even if we purchase them. Dunno, they just make us feel cheap. But way to make us feel even crappier about using the coupon...That we bought!\n\nAfter we ate, we presented the coupon to another waiter who argued with us again and gave us an attitude when we explained the other waiter said he'd accept it.\n\nBottom line is: If you have restrictions on your coupons, put it in the freaking coupon fine print! We noticed after the fact that the coupon actually states: \"Business owner: Deal must be honored according to terms on certificate. No additional restrictions may be added at time of redemption.\"\n\nSo why make the customer feel like crap?!?! \n\nIt's really too bad because the food was delicious but the attitude turned us off."
        }, 
        {
            "index": 67, 
            "rating": 4, 
            "review": "I love this place. I have been looking for a good Indian place for awhile and finally went today. This is my second time having Indian food and this was just as good as the first. We ordered the lamb meatballs as a starter and it was delicious! My friend who went with me LOVED the sauce that it came in. I had the chicken vindaloo SPICY and it was PERFECT! I didn't feel the heat right away but after awhile I found myself sweating just a little bit. My friend had the lamb dish which he liked as well. We also had a side dish of lemon rice which was good as well. \n\nI would really recommend this place to anyone who likes Indian food. \n\nThe ambiance is really nice too. Very cozy!"
        }, 
        {
            "index": 68, 
            "rating": 4, 
            "review": "As you might notice, I'm currently living in Yuma, AZ (and probably will be here for at least another four years until the kids graduate high school--and then, it will be \"Hello, the Northwest!\" time finally). Anyway, our our-of-town trips happen pretty frequently, and most of the time, has to involve a hunt for good Indian food.\n\nI mean, any Indian restaurant for that matter, because in Yuma, we only got one. So, we are, obviously, locked in one that just one.\n\nORIGIN was so close to our hotel, right by Hard Rock Cafe, on Paradise Road. There were several restaurants flanking this place, so the parking lot was packed. But we lucked out and saw somebody pulling out of their spot.\n\nHubby has a \"great food radar\" it seems, because he suggested we tried the Tasting Menu for dinner. Our server recommended half meat and half vegetarian dishes (to accomodate my dietary needs). It was $45/pp. For a five-course meal. Yup--not exactly cheap. \n\nThe pureed mixed vegetable was served in what looked like a shot glass--slightly taller. I thoroughly enjoyed it even when I kept scalding my fingers just trying to pick the glass up. \n\nThe Naan basket was full of awesome goodness. We couldn't believe the amount of bread we got. \n\nThen we had a serving of three types of meat--all seasoned and grilled to just the right state of done-ness. The shrimp was fine, but the lamb was heavenly.\n\nMy favorite dish, of course, was the vegetarian curry. I almost forgot about the other vegetarian dishes that came with the curry. I tried to look for their names on the web but somehow, none of the items on the menu rang a bell, so perhaps, the Chef came up with some extemporaneous selections for that night. And we were the happier for it.\n\nNow, the true GEM of the evening dinner, was Joseph, the bartender. But to call him that is truly inaccurate. I call him The Alchemist. \n\nI'm not even fond of martinis (never liked it), but Joseph's original concoctions, from fresh juices, herbs, spices, really intrigued me. He said that a good martini comes from a mixture of several types of vodkas or gins. He also said that Bombay gin makes a fine martini because of its herbal composition. I tend to agree with him, based on how magnificent the martinis he made for me turned out. \n\nSo, for final thoughts--may be too pricey for the dinner portions, or for the tasting menu (but I'm charging it to experience). But a strong 4+ Stars for \"The Alchemist\"."
        }, 
        {
            "index": 69, 
            "rating": 4, 
            "review": "Went to this place during my trip to Vegas. It was on the list of places I got a discount on for the bite card thing they gave me through booking my trip to casablanca express.\nThe food was so yummy! I ordered...you know what, I don't know what I ordered, but it was a veggie dish, vegetable dumplings with like yogurt sauce or something....my hubby ordered the chicken stuffed with prunes and mushrooms....it was good! We also ordered a plain naan and got a free appetizer for checking in (stuffed mushrooms). I wasn't really a fan of the stuffed mushrooms, but the rest of the food was delicious. I thought the food wouldn't be enough, but the food was actually too much for us in one sitting. Just the right amount of flavor, and our food didn't smell like it would be seeping out of someone's armpits later on in the Vegas heat. \n\nThe atmosphere was calm and dark and romantic, lots of candles....and people slowly began to trickle in as evening wore on."
        }, 
        {
            "index": 70, 
            "rating": 5, 
            "review": "I was getting married in Vegas, and wanted some Indian food catered for our reception. Our initial menu tasting at Origin India was so delicious. We had the Saag Paneer, Butter Chicken, rice and naan. It was really tasty. I also loved the ambiance of the place! We ended up getting lunch and dinner catered for our big day. Everyone absolutely loved the food! We got rave reviews for how great Indian food was. We are definitely gonna go back to eat at Origin India when we visit Vegas next. None of our guests were disappointed."
        }, 
        {
            "index": 71, 
            "rating": 4, 
            "review": "The food was fresh and delivered to our table promptly. The service was excellent and my overall experience was four stars. I did find that the prices were a little expensive for Indian food however it was worth the trip."
        }, 
        {
            "index": 72, 
            "rating": 4, 
            "review": "When eating at a restaurant most Americans would classify as \"ethnic\", I judge it firstly by the patrons.  If the people dining there are of the same national origin as the food, I know it is going to be authentic.  This was the case at Origin India last night.  The majority of diners were indeed Indian.  \n\nMy roommate and I went last night.  As we walked in we were greeted by a lovely hostess who was very friendly and seemed surprised that I had made a reservation.  Hey, I saw the option on the site and gave it a shot.  A reservation really was not necessary though.  There were plenty of open tables in a restaurant that, from the outside, looks small.  Just because there were plenty of tables available does not mean there were no diners.  There were several tables being used.  As we were seated towards the back of the restaurant I looked around and quickly felt relaxed.  It was dimly lit and I could hear Indian music playing softly in the background.  On the table was very heavy silverware and giant fancy folded cloth napkins.\n\nOur server was very attentive.  He came by frequently to ask if we were ready to order and again to check if we were enjoying our dining experience.  We were.  I ordered the chicken tikka makhani in the entree size (smaller portion served with rice).  My roommate ordered the family size home style chicken curry.  We both ordered naan.  I got the wild mushroom naan with truffle oil while he ordered the fresh garlic naan.  It was not unlike a good fresh pizza crust.  It was fluffy with a slight chew.  Very good for sopping up the left over sauce from the meal.  My makhani was good.  The chicken was very tender.  The sauce has a great spice.  The basmati rice was light and airy.  Amazing.  The chicken curry was good as well.  The sauce had a strong tomato flavor.  It was not quite like spaghetti sauce but reminiscent of though it had a curry taste to it as well.  What made the curry good was the fresh cilantro added on top.  It was refreshing.\n\nI am going to give Origin India four stars today though 3.5 would be most accurate.  The service could not have been better.  The food was very.  I enjoyed it thoroughly.  It is , however, priced high for the amount of food you receive.  I was not starving when I got home but I was not full either.  For $20 a person I expect to be full upon leaving and have leftovers to take home as well.  This was not the case.  Had it not been for my Groupon offer I would not have eaten here.  For this I must demote them to a 3.5 star rating."
        }, 
        {
            "index": 73, 
            "rating": 4, 
            "review": "Actually was really good. It's in the shopping plaza across from the HardRock hotel tucked in the corner.\n\nDecor was really cool. Music--and I like music--eclectic from Frank Sinatra to Indian Techno it was all over the board.\n\nThey have a small bar that sits maybe 5, IF you should encounter a wait but I'd be surprised on that one. \n\nI will say it's pricey. They have a $15, 3-course prix fixie for lunch but you have to ask for it.  If not you are looking at $25+ entree for lunch which is no $5 foot long.\n\nAppetizers were delicious, food was great actually.  I would go back but make sure you bring your wallet  :)"
        }, 
        {
            "index": 74, 
            "rating": 2, 
            "review": "First off, food was decent.  So if I were around the area and was craving some Indian cuisine, I may consider going again.\n\nBut, our server totally ruined our experience.\n\nI went with two of my friends.  We were asking our server some questions about different dishes.  When we asked our server how big a dish was (we were trying to decide whether to order three or four different dishes), he made it sound like it was so little that it would be small for even one person.  He thought that we were going to order just one dish to share.  Once he realized that we were ordering multiple dishes, then and only then he gestured that the dish was bigger than what he had initially told us.\n\nWhen the food started coming out, we looked at each other incredulous because that particular dish we asked our server about was so big that two people could have eaten it and left the restaurant full.  It wasn't that we didn't want to order more dishes, we were just amazed how the server tried to manipulate his answer so that he would get us to order more.  Moreover, once the food came, the server never even bothered to come to our table again.  We left the restaurant shaking our heads."
        }, 
        {
            "index": 75, 
            "rating": 5, 
            "review": "The food here is just awesome! We have been here twice and not been less than impressed. The tasting menus are a great deal. The service here is really amazing! Our server both times was Ahmed. He is a fine gentleman and a great server. Ask for him."
        }, 
        {
            "index": 76, 
            "rating": 3, 
            "review": "Let me first start with the menu. As I looked down the menu, almost everything sounded great. I had to choose from 5 items that I really wanted! I ended up getting the lamb stir-fry with lemon rice. It was only ok though. Don't get me wrong, I would order it again, But the description seemed better than the dish. My wife got the stripped bass. It came as a whole fish with the head and tail removed. Skin on and bone in tact. The flavor was amazing, just a little tough to chow down on 'cause you had to be careful about the bones. We also ordered two appetizers (waiters recommendation cause of 2-for-1 apps during happy hour). First we had scallops, which came tempura style. all I can say is YUM! And then we ordered an item called lamb kebabs. Instead what came out wasn't your traditional kebab. it was lamb meat with all the veggies rolled together in a spring roll looking dish. Not fried, (i don't think) and spicy! For me it was on the border of being too spicy, my wife LOVED them. We also ordered a wild mushroom and truffle oil bread. Now that was just plain good. \n\nResult: Food 5 Stars\n\nAs for our waiter, I would have to give him 3 stars. The reason we came in was because Origin India sent my wife a coupon for a free entree which we showed him at the beginning of the meal. He told us that was could order only one of the entrees as the free one, none of the family style selections, ok thats fine. He left to allow us to look over the menu. We knew our appitizer order. He recommended us to get two even though we only wanted one cause it was still happy hour. Well when the check came both appitizers were charged for and when I asked why he said that we could only use one discount at a time! WTF! You told us to get two! We ended up having it taken off. Also, after more review of the check they charged me an extra doller than what was listed on the menu for my beer. \n\nThe waiter was really insistent about selling my wife a cocktail. It got to the point of it being a little weird. She kept declining but he really pushed it. I understand up selling but after the customer declining at least 4-5 times, it was obnoxious.   \n\nOver all I liked it. I wasn't going to this restaurant for human interaction and great service, I was going to eat here. and the food was great. If you do go, just review the prices and the check very carefully!"
        }, 
        {
            "index": 77, 
            "rating": 4, 
            "review": "Yes, I made it back before leaving Vegas: this time, we did the tasting menu, and I am still gushing!  After our first dinner at Origin, we mentioned how much we enjoyed the experience to some Indian colleagues. When we returned a few nights later, we were very pleasantly surprised to see them there, as well. And they, too, absolutely loved their dinner. \n\nMy recommendation remains firm - come on an empty stomach, ready to eat: excellent food, fine presentations, super service,  attractive decor and overall an extremely enjoyable evening."
        }, 
        {
            "index": 78, 
            "rating": 5, 
            "review": "I stopped by for dinner while in Las Vegas.  The restaurant was decorated nicely, it was clean, the service was great and the food tasted good.  My tab came to $27.00 for mango lassi, chicken makni (sp?) and rice.  It was expensive."
        }, 
        {
            "index": 79, 
            "rating": 4, 
            "review": "This was our first visit to Origin India, and we were here for a charity event.  The restaurant is very attractive, modern, and upscale, and there isn't much in the decor to identify its ethnicity.  The lighting is soft and just right.  Our group filled most of the restaurant, but it's a testament to the very good service and attentiveness of management and staff that they were able to accommodate walk-in diners as well.\n\nOur group was served a buffet that was set up on a large, round table covered with a tablecloth.  It was an elegant change to the usual steam table lineup.  All of the dishes available to us were vegetarian, most likely chosen by the organization for religious-ish reasons.  There were vegetarian samosas, first bite-sized, later replaced with standard ones, and they were very tasty.  There were potato fritters, naan, vegetable biryani, and a scrumptious paneer dish that was spicy, but not enough to induce fire-breathing.  Bowls of raita, and the standard coriander and tamarind sauces also graced the serving table.\n\nServers removed plates promptly and were constantly refilling water glasses, and the manager was present and hands-on.\n\nOur dinner included a drink, but we had only a few choices.  I had a mango martini, small but delicious.  The restaurant has a full bar.\n\nI looked at the menu for the purpose of writing a concise review.  Many of the dishes are unique to Origin India.  I've been to many, many Indian restaurants, and there were more than a few that I've never seen anywhere.  The descriptions were very enticing.  On the down side, the menu is considerably smaller than most others, and the prices are high.  We will definitely be returning, though probably for special occasions because of those prices.  But I am giving Origin India a definite high-four!"
        }, 
        {
            "index": 80, 
            "rating": 5, 
            "review": "This was the best Indian restaurant I have ever been to. I have had indian food in various states from IL, MI, and now Vegas. They had the most beautiful decor,classy atmosphere,wonderful staff, and the most freshest and purest ingredients ever. Not one thing was drenced in oil. Nothing left me feeling heavy or guilty. I had the chicken makani,aloo gobi, (yes I was sharing with someone else lol) and this spinach and paner dish.....can't exactly remember but we ordered it as a side dish.  Oh and the mango lassi was to die for. Their rice is super fragrent and the whole cloves you could smell a mile away. Best indian restaurant ever. And being in love with Indian food and trying over 2 dozen trying to find the best one......is not at home in michigan its her in vegas. (Aunt lives her....so I will DEF be back) try it! You wont regret it\n\nP.s. my waitress was from sri lanka, I forgot her name....but she was amazing!"
        }, 
        {
            "index": 81, 
            "rating": 1, 
            "review": "Food was Ok but the staff was rude. I called a day earlier to check if they'll accept a gift certificate that I had. The person on call checked with someone and confirmed that they will, but they flat-out refused to accept it the next day! And to top it, they were rude. Would never be back there. If you call the restaurant, take down the name of the person you talk to, else they'll just deny that you called them."
        }, 
        {
            "index": 82, 
            "rating": 1, 
            "review": "I just don't know how this place managed to served the blandest food I have ever eaten when they are preparing Indian cuisine. To clarify, not the blandest Indian food that I have ever eaten. The blandest food period.\n\nI appreciate them trying to serve healthful Indian food, but there is no excuse not to use all those wonderful Indian spices. \n\nNothing was good about the food. My husband and I eat a lot of Indian food, and we couldn't believe how void of flavor everything was. I think this place is why we stopped bothering to find a good Indian place when we visit Vegas."
        }, 
        {
            "index": 83, 
            "rating": 1, 
            "review": "Avoid Avoid and Avoid this place, I hope I could select NO Stars for this restaurant. \nCons : 1) Absolutely Bad Mannered Staff\n              2) Small proportions \n              3) Very Over Priced, Not worth the money\n              4) Food is NOT Authentic Indian\nPros : NONE\nIf you are hungry and looking for an Indian Restaurant, This will not even be my last place to go, I will simply go to any Fast Food chain rather.\n\nWe were a group of 4(hungry to eat only Indian food) who ended up paying $100 + , for something that was not up to mark in taste and also not filling. Guess What, We ended up eating again in an hour at a fast food giant. What a pity on us.\n\nI would have given the restaurant at least a 2 star if the Manager spoke nicely with us. He was so rude , I never had such a bad experience. \n\nIf someone gives this place a rating more than 2 , I would say he doesnt know what indian food is and how nicely Indians behave.\n\nI dont know any other Indian restaurants in LV, I googled Indian Restaurants in Las Vegas and saw that Yelp ratings were pretty high and I ended up here having a very high expectation. I am back to the same Yelp to reveal the reality ! \n\nPpl who end up eating here after reading my review - God Help You !"
        }, 
        {
            "index": 84, 
            "rating": 2, 
            "review": "Something happened here.  Menu changed.  Food just OK, but expensive for OK.  After reading other Yelpers recent reviews, won't be chancing it again by going to this place."
        }, 
        {
            "index": 85, 
            "rating": 1, 
            "review": "Eek! Methinks not. The restuarant was nice but that's it. The proportions are small for the price.All the dishes tasted the same- over flavored. I ordered my lamb to be a 9 spicy (with 10 being the most spicy) , there was not spicy at all in the dish. The $10 Coronas were too pricey. For two people we spent $70 and were not full or satisfied. Overpriced."
        }, 
        {
            "index": 86, 
            "rating": 3, 
            "review": "Curiosity got me in the door the first time, a coupon and a vaguely pleasant memory brought me back, but I just can't give Origin India the cumin-scented bear hug that I want to give most Indian places.\n\nThe staff is very polite, and - if their demos at Whole Foods are any indication (thanks for turning me on to the expensive pink Himalayan rock salt that tastes like regular salt but looks so cool that I still lust after it, SIGH!) - the chefs are genuinely thoughtful about the menu and not just trying to be different for the sake of it.\n\nAlas, I've failed to get an \"ooohhhhh YEAH\" out of anything I've eaten at Origin.\n\nThe paneer \"in creamy tomato sauce\" was quite tasty the first time I had it, before I'd eaten a *lot* of paneer dishes, but on the second visit it was just \"nice.\" Not decadent, not lapping at my tongue in flavor waves, just nice.\n\nPaneer tikka as an appetizer was wonderfully described on the menu, but what was set before us was just kind of dry and tasteless. Samosas were beautifully presented on both visit, but not especially aromatic or unusual.\n\n(For the prices, compared to other Indian places in Las Vegas, I want a little extra dazzle, you see.)\n\nI avoided the vegetable dumplings on the second visit because when I had them before I found them very heavy and dull. But the baked baby eggplant I had instead didn't really deliver the variety and complexity promised by the menu description. It was, well, also kind of heavy and dull.\n\nMaybe I'm ordering \"wrong,\" but it's so easy to please me with Indian cuisine and any attempt at innovation that not finding a reason to go back to Origin makes me genuinely sad. The menu still looks so delicious! And, although service was slow and a bit inattentive on the busy night when we visited for dinner, the staff do seem so nice. (Note: the middle of the dining room can feel claustrophobic in the small space if it's busy. Hold out for an edge table.)\n\nBut the taste just doesn't deliver for me, and the cost doesn't justify a third chance, even with a coupon. (And these days there's always a coupon.) Maybe it's just the vegetarian items, but unless you're staying at the Hard Rock across the street without means of transportation, I'd try a few other places before going to Origin."
        }, 
        {
            "index": 87, 
            "rating": 5, 
            "review": "I love Origin India Restaurant! This place has the most amazing Indian Food I have ever had and im Indian! They have great fine dining service, and Josef the bartender has these delicious cocktales that are very different and pair perfectly with Indian food. I would recommend the lamb shank and lamb seekh kebabs. If you love Indian food this is the place to go."
        }, 
        {
            "index": 88, 
            "rating": 5, 
            "review": "Excellent dinner on Friday night. Great wait staff and food was delicious. Different that India Palace and Ghandi's. More \"fusion\" maybe? Nice mix of northern and southern Indian cuisine. Reasonably priced. Great location for us locals who like to avoid the strip. Right across from Hard Rock Hotel, on east side of Paradise."
        }, 
        {
            "index": 89, 
            "rating": 4, 
            "review": "Really good and hot food. Lamb was tender and the sauce wasn't heavy or too rich. Basket of bread was wonderful and fresh. Even the rice was delicious. The service was alright for a fancy establishment, but I'm docking off the one star for the wait. If it wasn't for my yelp coupon, I wouldn't of come here. But I think if someone else paid, or I felt like splurging I would definitely come back here. It is worth it."
        }, 
        {
            "index": 90, 
            "rating": 2, 
            "review": "Situated in an old but accessible part of Las Vegas east of The Strip, this restaurant is a short cab ride away from anywhere. Buffet was about twelve dollars plus drink, tax, and tip. Full bar available. Awkward entering the restaurant... the signage is good outside but when you enter it's like they have construction occurring in the foyer. Anyway, the interior is nicely appointed. They spent some money on chairs and tables for sure. The buffet was decently built up with my favorites: lamb curry, sag paneer, tandoori chicken, fresh-cut red onion, and mixed pickle (achaar). In fact, the food (especially the remarkable quality of the achaar) is worthy of recognition. The people running the restaurant seemed to have a skill at doing so: the waitress kept my water glass full and sat me within a decent amount of time, the six other personnel I  witnessed in various capacities seemed motivated, etc.\n\nWhy is this review 2 stars? \nA) This restaurant has a documented history failing health inspections, resulting in immediate closure, and\nB) When I  went to the restroom... -My-Shoes-Stuck-To-The-Floor-. Let that ruminate for just a second while I  explain the baseboards in the restroom looked like they hadn't been wiped down in decades... And my shoes stuck to the floor. Shoes. Stuck. To the floor. Of the restroom.\n\nIt's a pity I  won't be back, I think most people who don't care about American-style cleanliness will enjoy this frustrating experience of a restaurant. Not me. I removed my bookmark. I  have one check in, never to be two.\n\nThe floor. Shoes. Stuck!  -Six- people working in this restaurant and !not one of them! Can figure out how to mop the #;;!!!##:#$ bathroom floor?!"
        }, 
        {
            "index": 91, 
            "rating": 4, 
            "review": "Have to agree with other reviews.  High quality tasty food in a very nice ambiance just a little pricey for off strip.  Bread and rice were extra.  Had 1 entree 1 skewer rice and desert water and the bill came to $52"
        }, 
        {
            "index": 92, 
            "rating": 2, 
            "review": "My boyfriend and I ate here on 3/13 for restaurant week, wasn't expecting much since Indian restaurants in vegas are sub-par at best. \n\nWell, the appetizers were disappointing. The chicken was ok: nothing to write home about, the stuffed mushroom was really gross, the lamb kebab was way too spicy and the fish was dry (luckily they brought out mint chutney and tamarind sauce).\n\nI was relieved that the entrees were better. The tandoori chicken was excellent! Lentils were ok, lamb was pretty good. Couldn't keep my hands off the naan :) so yummy. \n\nA piece of advice: skip dessert. My panna cotta tasted like jello and bf's doughnut holes tasted like pancakes -___- \n\nService wasn't great, decor was alright. Probably won't go back."
        }, 
        {
            "index": 93, 
            "rating": 4, 
            "review": "Had the lunch buffet for 14.95. All the basics included. As good as any Indian buffet I've had, and I like to think I've sampled some good ones. Certainly won't find a better deal on the strip for this quality."
        }, 
        {
            "index": 94, 
            "rating": 1, 
            "review": "It sucks... Naan was the only good thing.. And for which we had to wait so long... When we asked why is it taking so long the answer we got was \"we are busy\".\nBeing an Indian I know how these food should taste and they taste nothing like that.. Not much options in the buffet..."
        }, 
        {
            "index": 95, 
            "rating": 4, 
            "review": "Phenomenal lunch buffet during the week! Its $13.99 (give or take a $1), a good mixture of vegetarian options, chicken, pork and beef. The Naan bread is to die for, and they just keep bringing it on out!\n\nThe only bad thing about going here for lunch is that you definitely need a nap after!"
        }, 
        {
            "index": 96, 
            "rating": 5, 
            "review": "Yep.  I just found my favorite Indian food in Vegas.  I've tried most of them.  This place is the REAL DEAL!  They have improved the service considerably, from what I'm reading here.  We never wanted for a thing.  They were very attentive and kind.  The food is LEGENDARY!  Just go already!!"
        }, 
        {
            "index": 97, 
            "rating": 4, 
            "review": "I had a great time here, but mainly because the bartender is some sort of badass.  He has a celebrity quality about him and should probably be on tv making his specialty drinks.  \n\nThe food here was pretty good too.  The ambiance of the place is just ok though."
        }, 
        {
            "index": 98, 
            "rating": 4, 
            "review": "Our second time at Origin India, and it was as good, or better than the first time.  We had tandoori chicken for appetizer - the best tandoori chicken ever.  Not that dyed red stuff you get most places, but moist, tender flavorful dark meat chicken (our fav!)  We ordered papadums and it arrived with two dipping sauces which were fabulous.  The papadums were light and delicious.  We then had lamb shank, baked cod and sag paneer, all of which were terrific and 2 orders of garlic naan  (oh the naan!) to sop up all the delicious sauces and juices.  Our waiter, Ahmed (an Egyptian, actually) went out of his way to make sure we were happy, and we appreciated his attention to detail.\n\nThe decor is simple but tasteful.  This has become our favorite Indian restaurant.  The bartender is on UTube making a couple of the imaginative cocktails the restaurant serves.  We didn't have one, but my husband did have a Cilantro Mojito, different but delicious.  \n\nWe ate early (about 5:30) but by the time we left at 7:00 the restaurant was mostly full, with a couple of large parties as well.  Everyone seemed to be having a good time, and I know we did.\n\nBringing the check to the table with the machine to run your credit card is definitely different, but lets you have the confidence that there is no-one fooling with your card.  We like that little bit of safety!"
        }, 
        {
            "index": 99, 
            "rating": 5, 
            "review": "This was my first visit, and I came in with a $30 for $50 coupon I bought on Yelp. Upon entering the restaurant the wait staff were friendly & greeted me. Before I made my order I asked if one of their korma dishes could be modified (chicken instead of goat), and they accommodated me with no problems. The food was delicious and my waiter was very attententive. I'll definitely be coming back!"
        }, 
        {
            "index": 100, 
            "rating": 2, 
            "review": "I really don't understand where all the hype is coming from, while it was decent, it is nowhere near 4 star status.  \n\nI thought that the prices were pretty expensive during lunch.  We went on a Saturday lunch and they didn't offer any specials, except for the $30 Prix fixe meal for two.  \n\nThe food was okay, but I expected a fuller, richer flavor as the items seemed a bit bland to me for Indian food.  One of the chicken items tasted like Orange chicken from panda express and the other chicken dish used so much yogurt in it that it completely drowned out the spices, not to mention the impending bloating (dang Asian lactose intolerance genes!).  The rice wasn't aromatic like other basmati rice that I've had and the naan was a bit too thick for my tastes as I like 'em thin and crispy.\n\nI checked in on yelp and received a free appetizer, but the waiter gave me a little bit of flak for it because they said it wasn't on their system.  I was NOT about to pay $15 for 3 small pieces of dry lamb chop.  He finally conceded after tasting some of my Chinese haggling skills.\n\nI probably wouldn't come back, there's a whole bunch of other options in Vegas to eat at."
        }, 
        {
            "index": 101, 
            "rating": 5, 
            "review": "I've been to this restaurant 6 or 7 times over the past 2 years and it keeps getting better and better.  They have a new menu and possibly a new chef.\n\nOur most recent visit in Jan was unbelievably good! If we were in town one more night, we would have gone back!\n\nIf you like Indian food...this is the spot!"
        }, 
        {
            "index": 102, 
            "rating": 4, 
            "review": "I love how this restaurant feels like a different world once you walked into it!  The decor and service are A+, I was truely pleasantly surprised.\n\nTo be honest, I'm really still an Indian cusine virgin.  My friends knew what to order so I just went with the flow.  Everything we ordered were tasty, but a little bit on the mellow side probably because I expected Indian food to be some what spicy (as in certain degree of tongue burning).  I can't even begin to name the dishes, but we had a lamb chop curry dish, and chicken curry dish, and they're both really good.  The chops were tender, and the spices were just right.  We also had some lentile soup, that was good too.  Then we had this thing that's almost like a spinach dip, except its mixed with butter/oil and chunks of Indian cheese that tasted like tofu!  That's spinach dish was probably my favorite, and its actually something that's not on the menu, and my Indian cusine expert friend asked for it."
        }, 
        {
            "index": 103, 
            "rating": 3, 
            "review": "Awesome place! Nice ambiance, excellent food. The reason I give it a 3 is because the owner? (Or one of the two owners) who was going around greeting everyone didn't make his way around to our table! Granted we did just stumble upon the restaurant as we were driving past it and we weren't in our best attire, we were still paying customers who would have liked to be checked on by the owner!\nThat set a gloom tone to our overall dinner experience but that still doesn't take away (too much) from the fact that we had really delicious food!"
        }, 
        {
            "index": 104, 
            "rating": 4, 
            "review": "Stopped by while in vegas this last time. Chicken  tiki masala was amazing, their sag paneer was delicious and the cheese and garlic naan was mouthwatering. All went great with their mango chutney!! Oh and not to mention their great staff! Can't wait to eat there again!"
        }, 
        {
            "index": 105, 
            "rating": 5, 
            "review": "My wife and I have gone at least a dozen times and the service and food are always consistently very good.\n\nThe food (we've only tried vegetarian dishes):\n- Plenty-large servings (I have a good appetite and have never come close to finishing an entree, especially a paneer).\n- Most vegetarian entrees are excellent -- flavorful and well-spiced (and relatively authentic; I always see lots of Indians here so it seems to get their approval too)\n- Side rice dishes (the ones at $6 and less) are large but a bit plain; I've seen better at the same price at other Indian places.  The more expensive rice dishes aren't worth it, in my opinion.\n- Good variety of veggie dishes, though two are a bit greasy (the Baigan Bharta and Bhindi Masala) and they don't have Mushroom Masala.\n- Paneers are all very delicious, especially the Paneer Makhani and Paneer Rajastani which are exceptional.\n- If you want them, you'll need to ask for the complimentary Papadum (those thin lentil chips you can snack on before your meal arrives).  They used to always be provided without asking but they apparently stopped doing that; however, they are happy to provide them upon request.\n\nThe establishment:\n- Plates and silverware are very nice, NOT cheap\n- Seats are well-cushioned, high quality, and comfortable.  Nice tables.\n- Bathrooms have above average furnishings (granite counters, stone tiled walls)\n- Good overall furnishings, subdued lighting, not too loud; excellent for a date or conversation\n- Music is usually appropriate though once they were oddly playing 80's music\n\nThe service:\n- There is never a long wait for our food, even when they are relatively busy\n- Some of the waiters are a little on the reserved side (maybe it's an Indian thing?), but all of them are always very polite, friendly and eager to please without being overbearing."
        }, 
        {
            "index": 106, 
            "rating": 5, 
            "review": "What can i say? The staff was amazing, the food was amazing... Everything was perfect. My new husband and i stopped in while on our honeymoon. Neither off us had ever tried indian food. The server made excellent suggestions and worked to make the night very special once he learned that we were newlyweds. Next time we are in vegas we will make sure to Stop in"
        }, 
        {
            "index": 107, 
            "rating": 1, 
            "review": "Welp. The food was pretty bland and it gave 2 out of 4 of us the runs."
        }, 
        {
            "index": 108, 
            "rating": 4, 
            "review": "My first time here. Nice ambiance and deco. We ordered veggie samosa, which was good. Our waiter Abel who was very friendly recommended Hyderabadi biryani with chicken. It had a nice presentation in a clay pot.  The lamb nihani was excellent in flavor and the tender lamb. The garlic nan bread was buttery and soft. It turned out to be a great experience!!"
        }, 
        {
            "index": 109, 
            "rating": 2, 
            "review": "Had the buffet here..Food was fine..the server was good..I only wished there were more servers here..bcoz there were too many customers for jst 2 servers..It can help the service be faster..giving it 2 stars only for this reason..Had to wait for too long to get my cheque.. Ambience was nice.."
        }, 
        {
            "index": 110, 
            "rating": 2, 
            "review": "First the real bad. The service is slow and a bit inattentive. Our lassi took forever, we didn't get napkins until after our appetizers which didn't come with any of the typical chutneys. \n\nNow the not-so-bad. We ordered the Mater Paneer which was good, not great and the Chicken Tikka Masala which was runnier than expected and the chicken a little dry. The flavor was good but a little too garlicky. The Samosas were the best part, a little spicier than normal, which was a pleasant surprise. The mango lassi was spot on. The naan was solid and they offer a variety of naan flavors that can be ordered in one basket. \n\nFinally, the chutneys, once they arrived were a bit off. Too much mint in the mint chutney for one thing."
        }, 
        {
            "index": 111, 
            "rating": 1, 
            "review": "Our daughter got food poisoning from the undercooked tandoori chicken.  We went to this place because of a living social coupon. There prices were astronomical.  $40 will barely get you two entrees.  The food tastes okay, but we've had way better for a fraction of cost at hole in the wall Indian lunch buffets.  \nThey do not use traditional Indian names for their dishes making it hard for those familiar with the cuisine to know what you are ordering."
        }, 
        {
            "index": 112, 
            "rating": 4, 
            "review": "Om Shanti\n\nSome friends of ours who were in town were here on a layover after flying in some very rich and famous passengers.  \n\nA dinner night was in order and I was excited to hear some tid-bits of their adventures.  We picked this restaurant due to convenience and walking distance to their hotel.\n\nIt was late on a Sunday night so the restaurant had only a few guests.  I didn't  have time to Yelp it but so happy to see many of my Yelp friends have been here giving it great ratings.\n\nService was very, very friendly.  Food was delicious.  Service was prompt and attentive.\n\nChicken Tiki Masala and lemon rice was fabulous.  We ordered some tasty garlic naan and it was soft, chewy and warm. Yum!\n\nThe side of rice that we ordered was enough for a table of four. I asked how big the rice bowl was and he motioned like it was a small bowl-but trust me-like us you'll have too many leftovers. \n\nWe also had the stuffed mushroom as an appetizer and I wouldn't order it again, it was almost like a puff pastry with cream of the mushroom soup on top.  \n\nWe each ordered a dish and it was overkill despite our attempts to share.  Three beers, four entrees and an appetizer will set you back $135 so share share share and save save save.\n\nA free Mango Lasee comes with a Yelp check-in so I took advantage of that-and I'm very happy that for free it was tasty. Thank you!\n\nThis restaurant is hidden in a strip mall near the Hard Rock Hotel & Casino.  If you're in the hood and looking for some yummy Indian food come here."
        }, 
        {
            "index": 113, 
            "rating": 2, 
            "review": "They need to add some dark chicken curry to their menu."
        }, 
        {
            "index": 114, 
            "rating": 3, 
            "review": "The food tastes pretty good! But the food is not in good quality. We had buffet, there wasn't that many options. And they run out of food fast."
        }, 
        {
            "index": 115, 
            "rating": 3, 
            "review": "My wife and I wanted to try something out of the ordinary so we chose to eat indian food, we came to origin india restaurant and we had the buffet style and it was the end of their Ramadan. It was interesting and very different from any curry I ever tasted. Over all, this place is clean, servers were kind and welcoming."
        }, 
        {
            "index": 116, 
            "rating": 4, 
            "review": "I went here for the first time last month while in town for work.  I had the round table in the back which was perfect for 8 people-it wasn't too noisy and the ambiance was pretty good.  We ordered lots of appetizers-I'd have to say that the shrimp was my favorite.  Everyone enjoyed their dinner and most claimed it was the best they have had.  My ONE complaint was the server never regarded me although I was the host of the dinner, I think she had a crush on the guy to my left and although he deferred to my every-time-she ignored me and only asked him if everything was \"OK\" and if we needed anything else.  I will however go back,I'll just be sure to have a guy server next time!"
        }, 
        {
            "index": 117, 
            "rating": 3, 
            "review": "If I was rating solely on food quality and taste, I would give 5 stars. Adding in pricing and service makes me remove 2 of those stars, though.\n\nThe website currently says there is a drawing for tickets to London, which the waiter says was 2+ years outdated. Listed right below that on the website is the happy hour deals, and we would not have been offered those had we not known to ask. I felt as if the waiter was doing us some kind of favor by taking our order. Aloof would be my best descriptive word.\n\nI would highly recommend the chicken chilli fry appetizer. Delicious! The lamb curry and black lentil makhani were very good also. I was very disappointed that the carrot cigar dessert has been discontinued. That was the main reason I wanted to go today. I did not even try to use the Yelp coupon after reading the complications people have run into on other reviews.\n\nIf you are visiting and staying on the Strip, this restaurant is very convenient. We parked about 10 feet away from the entrance. That's a plus! If you live here, I am sorry to say I would not drive out of my way to go here."
        }, 
        {
            "index": 118, 
            "rating": 5, 
            "review": "My favorite restaurants in Las Vegas. Tried 7 other India places in the area and they don't compare. The only thing is there curry is slightly different each time depending on the cook and they keep changing portion sizes."
        }, 
        {
            "index": 119, 
            "rating": 4, 
            "review": "First, this restaurant DOES NOT come up on Yelp, as of the time of writing this. It shows it has been reported as out of business. Not sure which Yelper has something against about this place, but it is definitely open!\n\nWe got a groupon for $25 for $50. No problem honoring it and food and service were very good!  I will revise this posting later once Yelp shows it as open again."
        }, 
        {
            "index": 120, 
            "rating": 1, 
            "review": "Service was beyond bad, we waited & waited for refills, the check..., will never come back. Food was overpriced, and the server spit when he spoke, so being literally spit on plus waiting when there were maybe 4 families in the whole place.. Food was whatever..but could not get over how bad the service was. What a way to treat my Mom on her birthday :: total fail:: :( it took 2 hours to get out of there"
        }, 
        {
            "index": 121, 
            "rating": 4, 
            "review": "A welcome surprise for a strip mall eatery.  \n\nThe decor is upscale and a little different from what you would expect to see in an Indian restaurant.  In other words, it is not bohemian chic in the trendy sort of way.  Its comfy elegant.\n\nTo start, the naan is very good.  You do have to pay for each order.  Remember that when the server ask if you want more.  The plain naan is the best.  Worth mentioning is the cheese and chili naan.  It good but very spicy.  Which brings up the point, if the server tells you an item is spicy, take their word for it.\n\nLamb and vegetable briyani are fantastic as is the chicken curry.\n\nIf you're with a group, try the family style dishes.  Its more fun that way.\n\nOh yeah, it isn't as inexpensive as Rachael Ray made it out to be but its well worth the price.\n\nEnjoy."
        }, 
        {
            "index": 122, 
            "rating": 5, 
            "review": "This is by far our favorite Indian place to eat. Brought my family here when they visited, and they absolutely loved it. That's a compliment in itself since we've got some very picky people. Plus we're Indian, so everyone's expectations were high. Great service, too. I don't understand why this place isn't way busier, but we love our hidden gem!! If you haven't tried this place, grab the groupon (for dinner only) and give it a try! Even the buffet is good here. We usually never eat Indian buffet since it's never spicy enough. However, the buffet at origin India is flavorful (still not spicy, but distinctly flavorful)."
        }, 
        {
            "index": 123, 
            "rating": 4, 
            "review": "3.5 stars that I am rounding up.\n\nThe food here is good... if you are expecting classic Indian food, you will be a bit surprised with this menu!  I found the dishes to be a bit more playful and modern compared to the classics I have eaten tons of times.  Kebab menu was a treat!\n\nI thought the flavor of the food to be good, but both times I ordered a dish spicy it came out rather bland for my tastes.  The Samosas were great as were the chutneys.  \n\nIn terms of service, we had a pretty lackluster experience... and they were out of a lot of the beer selections--definitely not cool."
        }, 
        {
            "index": 124, 
            "rating": 5, 
            "review": "The best Indian restaurant we have ever eaten in, so glad to find this place. The service is amazing, the food is super delicious and very nice atmosphere. \nThe lamb kebab and chicken tikka masala were to die for! \nHighly recommend."
        }, 
        {
            "index": 125, 
            "rating": 5, 
            "review": "If you like Indian food this, Origin is as good as it gets. All the meat is halal which is nice but if you're a practicing Muslim. If not then you have to order some cocktails off the very creative and extensive list created by resident bartender Joseph. He's crafted some very complex drinks using the same herbs, spices and ingredients the cooks are using in the kitchen. \n\n I recommend the Black Mamba if you're getting something hearty like the lamb or chicken tikka. The Cucumber Pearl was light and  perfect for a vegetarian dish. The Lal Dupata (Red Veil) was also very good  with the chicken curry. We had a few more but I don't recall the names. Keep in mind these take a few minutes to make.\n\nVery well done in the kitchen and the bar!"
        }, 
        {
            "index": 126, 
            "rating": 2, 
            "review": "Food is good, tasy with good masala and spices. BUT service was horrible. One waitress only. She was great but you can only be so attentive with a few tables to attend to. The food ran out when we got there at 130. The owner promised to refill but it took a lot longer than he said. there was another woman there but IDK what her role was. she seemed to know nothing except they ran out of beers (???).  also they were showing item songs on the TV. I'm not prude but I don't want to see Sheila ki jawani on the TV while lunching with my grandparents. \n\nFood almost made it worth it. Tandoori chicken was tasty and tender. I liked the saag paneer and the butter chicken."
        }, 
        {
            "index": 127, 
            "rating": 5, 
            "review": "Not sure it gets any better than this. The staff are amazing and the food is outstanding. We took guests from out of town, there were 6 of us. Not one complaint and lots and lots of enjoyment"
        }, 
        {
            "index": 128, 
            "rating": 2, 
            "review": "Wish I could tell you about the food but the poor service overshadowed the meal. The staff was friendly enough but failed to provide the most obvious of necessities. Exhibit A: drinks. I requested a glass of soda from not one, not two, but three different staff members. Finally, when there was still no sign of the drink, I asked for them to just bring it when the food arrives. One waiter said, \"could you remind me to do that?\" Umm, isn't that your JOB to remember that? They seemed inattentive to their customers yet spent a great deal of time arranging silverware on tables that weren't even occupied. How about focusing attention on the warm bodies sitting here now?\n\nExhibit B: the bill. At this point, I was pretty annoyed and obviously in no mood to leave a big tip. But the waiter stands at your table with his credit card machine and processes your bill right then and there. AWKWARD.\n\nTo my Love, I'm sorry to have taken you here on your special day. Happy effin' birthday."
        }, 
        {
            "index": 129, 
            "rating": 5, 
            "review": "As out of towners we wanted a meal off the strip that felt like eating at home. The food here is SOOO good. We tried a few new things we had never eaten before as well as favorites like the Chicken Tikka Masala - great deep flavors all around and good service too!"
        }, 
        {
            "index": 130, 
            "rating": 5, 
            "review": "I love this place. The food and service is above par for me everytime. I have taken so many people to enjoy dinner w/ me and  have always had positive remarks from my guests. I used to pay a tiny bit less for food at a buffet that would be sitting out all day. Origin india's food is always fresh and has an explosion of flavor. My girlfriends and I always order extra because we love to have to the next day after a night of partying! Will be going back! I recommend this place I have tried Indian restaurants in La, NYC, and All over vegas. I still have this on at the top of my list and my second favorite is Bollywood in LA."
        }, 
        {
            "index": 131, 
            "rating": 4, 
            "review": "Food is a definite 5-star. Unfortunately the service was less than appreciated, at a 2 star level, extremely slow. But the food was worth suffering thru the lack of service. \n\nAlso Yelp offered a free drink for checking in. Problem is they were \"out\" of that particular drink and offered no replacement. Odd..."
        }, 
        {
            "index": 132, 
            "rating": 4, 
            "review": "I would describe this place as modern Indian dining. The presentation of dishes like the homemade paneer cheese tikka appetizer (stuffed with apricots and raisins, marinated in coriander and basil glazed in Tandoor, pickled red cabbage) looked like something I would get at a French restaurant.  This place isn't the norm and it was just what we were looking for this evening.  \n\nHaving a $25 restaurant.com coupon in hand didn't hurt either.  AND we got a free appetizer just by checking in on Yelp! WEEEEEEEE!!!\n\nWhat an excellent selection of vegetarian dishes!  My wife gets saag paneer at Indian joints like she gets filet mignon at steakhouses like she gets green curry at Thai restaurants.  EVERYTIME.  \n\nI got the Khadi Paneer (House-made Indian cheese and mixed bell pepper cooked in tomato sauce) which was delicious however we were already at maximum paneer overload after the appetizer.  This was out fault for not thinking this through.  It certainly made for a great lunch the next day though!!\n\nThe service was very attentive and filled up our water glasses promptly.  I'll be back!"
        }, 
        {
            "index": 133, 
            "rating": 3, 
            "review": "We had a solid experience!  The lamb was tender and flavorful.  Portions were good.  Service was spectacular.  I used a Groupon and it was very flexible and easy.  I will be back."
        }, 
        {
            "index": 134, 
            "rating": 3, 
            "review": "I saw good reviews on yelp for this restaurant and I went there for late lunch. \nGood part is - they are open throughout the day so you can go there anytime you want. \nI went with my family and we ordered all veggie items. \nRestaurant ambiance was good. You generally don't find Indian restaurant with good classy ambiance often. Food was also nice.\nCouple of things  I did not like -- \n1: Their service.  They are very very slow. We had to wait quite a long time after we ordered food.  \n2: They did not greet well when we entered in restaurant. (Hardly anyone noticed)\n3: We had to call someone to take order. No one came to ask whether we are ready for order or not. (we waited ~10 mins which is long time) \n4: After we finished, we had to call them for check. (we again waited ~5 to 10 mins) \n\nOverall, its good place for good indian food with good ambiance. \nYou need to be patient for slow service. \n\nGiving 3 stars because I am not satisfied with their service. (For food only I would give them 41/2)"
        }, 
        {
            "index": 135, 
            "rating": 4, 
            "review": "Very good indeed. Excellent service and selection of beers.\nFood very good and compared to other US Indian restaurants, superior."
        }, 
        {
            "index": 136, 
            "rating": 4, 
            "review": "The food was very good on the day I ordered delivery from here. The portions were a bit smaller than most Indian Restaurants. As long as value is not your main criteria the food was very well prepared and tasted excellent. I will definitely order from here again and even though delivery tends to take an hour here in Las Vegas, they arrived in 45 minutes."
        }, 
        {
            "index": 137, 
            "rating": 5, 
            "review": "Some little part of my life wants to be dedicated to eating the best indian meal there is. So i eat it a lot, cook it a lot, and love it a lot.\n\nSo far Vegas has been a big disappointment for indian food. Gaylord's wasn't great nor was Tamba. Origin India however was everything i hoped for. \n\nFor appetizers. I had the Bhajia and my girlfriend had the Aloo Mattar Tikki. For the first time in a long time i ordered better than her on appetizers. I'm not a huge bhajia fan but these were done perfectly. The Aloo Matter Tikki was also delicious and the presentation of both dishes were also great.\n\nFor mains. I was deciding between Paneer Shashlik or Paneer Shabnam $15 the manager recommended the Shabnam. The girlfriend ordered Chana Masala $13. Both dishes came with rice, naan and a small daal which i didn't realise and seems great value for money. Since i hadn't realised that i also ordered a daal palak as an accompaniment.\n\nThe Paneer Shabnam was absolutely delicious and the texture of the paneer also perfect. My girlfriend's Chana Masala was up until now the best and most well rounded Chana Masala i've ever tasted. Then on top of that the dark daal that came with my meal called Dal Bukhara was perfect too, extremely dark tasting. The manager asked how everything was and i said the daal was one of the best daals i've ever tasted, so then 5 minutes later he brings me another one out on the house. \n\nThe naans were also cooked to perfection with the crispy underside and very soft, air bread top.\n\nThe only small dissappointment was the Palak Daal and the Mango Lassi. The Palak Daal was too vinegary tasting for me and i couldn't get through it.  The mango lassi was more like a mango smoothie than Lassi, but still tasted good, my taste might be swayed by the lassi being served in a cocktail glass which seemed strange.\n\nLastly, inside is very very nicely decorated and the service is extremely attentive. \n\nAll in all, the best Indian i have eaten in Vegas and the third best Indian restaurant i've ever been too. Passe thru Indian in Malaysia #1 and East Z East Manchester England #2. \n\nHighly recommended."
        }, 
        {
            "index": 138, 
            "rating": 1, 
            "review": "We have been to Vegas and went for lunch on 5/14/14. Buffet was not good. So we have ordered the items. Mutton biryani looks like sambar rice and Chicken Curry tasted worst. This is not an authentic Indian restaurant. Dont get disappointed by going there."
        }, 
        {
            "index": 139, 
            "rating": 5, 
            "review": "We were disappointed to discover Raja, the owner, was on vacation.  The new Executive Chef, Kuldeep Singh, has reworked the menu so we had difficulty choosing from the listing of new entrees.   Our first selection was the grain-fed chicken breast stuffed with wild mushroom and black prunes, served with cashew nut korma sauce accentuated with truffle oil and pulao rice. Our second entrée was baked baby eggplant in Hyderabadi sesame, peanut sauce tempered with curry leaves, mustard seeds and whole red chilies which included lemon rice.  Our choice for bread was naan stuffed with sweet apricot and raisins.  Everything was visually spectacular and equally delicious.  Service, as usual, was friendly and efficient."
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "the best Indian I've ever had in my life. came in for the lunch special and loved all of it. I ordered the chicken masala and this came with daal ,naan,rice and salad. my only regret is that I'm staying at.a hotel and couldn't save leftovers because I would have had enough for two meals."
        }, 
        {
            "index": 141, 
            "rating": 4, 
            "review": "We had a mixed experience here -- for the most part our food was really great -- our server, however, should probably have been working in roller skates at Sonic...in the South, we typically say about folks like this -- \"awww, bless her heart..\"  It's not a compliment...\n\nThat said, her intent was never bad -- she was just, well, bless her heart...\n\nBest of the night, knock our socks off dish (and there was one) -- the Tandoori Lamb Chops.   I know, I wouldn't have ordered them either -- but they were really spectacular.  If you'll only eat rare lamb, get over it -- the \"overcooking\" is what made this such a standout -- I mean falling apart tender, melt in your mouth, finger licking good lamb (when was the last time you said that?)\n\nThe tandoori shrimp -- overcooked too and note to chef in the kitchen-- overcooking shrimp doesn't do anything for the critters...it just makes them mushy.\n\nWe also had tandoori chicken legs -- haven't seen chicken legs on a menu ever...they were good!  But not as finger lickin good as the lamb.   \n\nBreads in Indian restaurants are almost always great -- these didn't disappoint.\n\nNo one does Poori anymore though -- why?  \n\nI read on their website that they give discounts for UNLV students/faculty and if you're local -- but I forgot when the bill came... \n\nThey had a fairly decent wine list which surprised us -- but years ago, my friend taught me to drink Long Island Iced Teas with Indian food and it's a happy habit that I haven't broken, nor frankly feel a need to.  I don't drink LIITs any other time, except with Indian food either -- so if you've not tried this little combo -- feel free -- just have a designated driver, and drink plenty of water...  Theirs are lethal!\n\nWe ordered one dessert -- probably because the cocktails made us giddy and stupid -- sweet, milky balls (yes, that was the name...)  Um...we should have stopped while we were ahead, but it was good for a laugh!  (Yes, we often have 2 year old sense of humor...)\n\nWe'd definitely go back for the lamb, bread and cocktails though!"
        }, 
        {
            "index": 142, 
            "rating": 3, 
            "review": "On recommendation from a friend, who is Indian...we decided to check this place out on a Thursday evening. I was worried, the place was empty, (one other table was occupied by a group of business men). The atmosphere seamed fancy, but we were dressed in casual clothes and they didn't bat an eye. The wait staff were friendly and helpful with all our questions.\nWe tried a few of their signature Indian cocktails since it was happy hour.\nSkipped apps and I went for the Indian Kabob platter (2 shrimp, 2 ground lamb kabobs, 2 small pieces of chicken, and one piece of cheese), which was good (chicken could've used more spice). My husband got the Southern Indian style diced lamb stir fry which we both loved, I kept dipping my chicken in his sauce. We shared the bread basket which was 3 different Naan...warm, fresh, bubbly, and delicious.\nOverall we liked it, but the price was a little high and the portions small."
        }, 
        {
            "index": 143, 
            "rating": 3, 
            "review": "The food was average and service was a bit slow as well. Chicken Tikka Masala had too much cream in it that it became sweet and you could only taste the heavy gravy. Lahori Goat Curry was flavorful but it had too much oil. The lamb chops were cooked well and really good. Will probably come back here but order some lighter dishes for a change."
        }, 
        {
            "index": 144, 
            "rating": 2, 
            "review": "Very mediocre...nan was among the worst I've ever had...and I eat a lot of Indian food all around the country.  The veggie Kofta was uninspired and the sauce was straight out of a can...I have had this same sauce from a can in other restaurants.  Samosa's were not good...the other apps we had were equally boring...the chutney was generic...2 stars because the service was decent and the place looks nice.  Food is crap."
        }, 
        {
            "index": 145, 
            "rating": 2, 
            "review": "We only ate here because of a $25 gift certificate.  The food was descent but way over price for Indian food.  Our entrees came out in a single bowl  with no side dishes.  I thought it was a joke, but now I know its not one of my favorite place to eat."
        }, 
        {
            "index": 146, 
            "rating": 5, 
            "review": "Great food, great service! It's pricier than your average Indian restaurant, but as the saying goes, you get what you pay for.  I had the chef's tasting which was great except for the dessert, which was mediocre and served very awkwardly - a cone dish placed on a bowl. There was liquid leftover in the cone and since it can't stand by itself I had nowhere to put it to get to the separate dessert in the bowl..."
        }, 
        {
            "index": 147, 
            "rating": 5, 
            "review": "when you lay out money at a restaurant, you really really really want it to feed not only your stomach, but your soul.  and Origin India does exactly that.  the chicken makhani is heaven in your mouth, perfectly spiced & melts in your mouth, just like \"butter chicken\" should.  the service was sweet and impeccable, so friendly.  it felt warm and inviting.  there aren't many restaurants i've been to that i would actually go back to (simply because there are so many restaurants in Las Vegas to try,) and i always want the next new fix.  but Origin India breaks the mold for me.  i'll go back and bring my entourage with me :).  thanks guys."
        }, 
        {
            "index": 148, 
            "rating": 5, 
            "review": "Thanks for your donation of a delicious lunch for the Progress Now summit today. Your food was amazing."
        }, 
        {
            "index": 149, 
            "rating": 5, 
            "review": "Four star eats but they get an extra star for seriously nice customer service and attitude.  \n\nMy husband is a royal pain at times for restaurants - ordering in advance, insisting on rapid service, etc.  In his defense it usually works out really well and he makes our life awesome.  BUT, I can see where restaurant staff would be like \"wtf\". Anyway, he ordered to go and then we showed up and decided to eat in.  They unpacked the food and gave us great service without any complaints or problems even though over the phone he had insisted they have it ready in 3 minutes. (Lol).   Then he asked for ice for the free mango lassi and it took FOREVER.  He was starting to get annoyed until we looked over and one of the staff was coming in from outside with two bags of ice.  They actually sent someone out to hurry and get ice for just us (they had just opened).  It was one of those man-did-I-have-the-wrong-idea moments.   \n\nWe ended up eating here three days in a row, which I am not suggesting but my husband loves tikka masala and he is like a 12 year old who could eat the same thing every day of his life.  The butter chicken, which is basically the same thing, was better than the Tikka masala so he ate that the other two days instead after trying mine.  \n\nEverything we ate was good.  Service was stellar.  The place is packed with Indians, so I'm assuming that suggests authenticity although I've not yet visited India. \n\nHit it!"
        }, 
        {
            "index": 150, 
            "rating": 5, 
            "review": "Stopped in for dinner on a date night. Place was quite empty but is well taken care of. You get a real nice Indian experience. I ordered Paneer and it was cooked to perfection. Service is great and food is good. Will definitely come back."
        }, 
        {
            "index": 151, 
            "rating": 4, 
            "review": "This review was for a nice dinner experience here about 1.5 months ago.  We had a party of 10 here for our good friend's birthday.\n\n(This dinner was for 2)\nAppetizer\nChicken thigh tikka-This was very juicy but tasted different than the ones that I had before.  This appetizer is a little bit small for 9 bucks though.\n\nTandoori Black Tiger Shrimp - This was so sweet and yummy...will order again.  Shrimp lover must try.\n\nEntree\nKarahi Goat-Portion is smaller than other Indian restaurant that I have been to.  Flavor was decent, but of course, I asked for a plate of raw onions and lemon wedges and it brings out the flavor even more.\n\nFresh garlic & corriander naan and roti-very fresh and good!\n\nWe had bought an icecream birthday cake that was pretty much hard like a rock (didn't let it thaw enough), and the server was very kind to slice up the cake for us.  The service was very wonderful here.  It is a bit sad to see that this restaurant was a bit empty on a Friday evening.\n\nFood:  Yummy,  but wish the portion was bigger...\nService: Perfecto"
        }, 
        {
            "index": 152, 
            "rating": 4, 
            "review": "This is a more upscale indian restaurant in decor and ambiance for Las Vegas indian standards.  They have a alchohol bar and serve mixed drinks, not just beer (standard indian restaurant drink fare).  I had a stawberry mojito and it was surprisingly delicious.  Muttled to perfection.  Yes, a girl drink and delicious.  \n\nVegetable Samosa\n Fish of the Day was fabulous.\nSaag Paneer\nNaan is delicious and very fresh.\nChicken Curry\nOven baked Eggplant\n\nThese are some of the dishes we recieved.  Delicious food.  You may need a rez otherwise it can get busy especially certain nights of the week.  The strip mall this restaurant is in is a little colorful at night.  My kids love indian and I don't love taking them to this strip mall during the evening hours...Not sure if its the strip club or the 24 hr nail place that is the most dicey.  Lots of people around all the time so I can say it does feel safe just would not walk around this area in the evening for a stroll.  Bon Appetit"
        }, 
        {
            "index": 153, 
            "rating": 2, 
            "review": "Food was good, but so over priced! I wouldn't come here without a groupon. Service was beyond slow, our waitress barely understood english, and to top it off my table was served food AFTER another table that ordered at least 15 minutes after us. Rude!!!"
        }, 
        {
            "index": 154, 
            "rating": 2, 
            "review": "I bought a $25 lunch Groupon recently, and my wife and I decided to use it yesterday.\n\nWe each had the lunch buffet which had about 6 warm dishes and 3 cold dishes. I had mixed pakora, basmatti rice, dahl, soup, lamb curry, spicy fish, chicken curry, naan, and raita.\n\nThe naan seemed a tad under cooked. The lamb was very tender. The pakora was good but on the soggy side. The soup was tasty. The rest was rather forgettable.\n\nMy wife got a mango lassi and she said it was one of the best she ever had.\n\nEven after our Groupon, the bill came to $15 for the two of us for two lunch buffets, a mango lassi, and a diet Coke. The food was okay but I've certainly had better Indian food. For the price, I did not think this was a good value, and I have no plan to return."
        }, 
        {
            "index": 155, 
            "rating": 5, 
            "review": "I've tried many Indian restaurants here in Vegas, but this one is my absolute favorite! The food and service are both awesome! The naan and tandoori roti taste very fresh! This place is definitely worth a try!"
        }, 
        {
            "index": 156, 
            "rating": 1, 
            "review": "First and foremost, does it seem like everyone is trying to jack you in Vegas?  No one is holding a gun to your head, they just reach into your wallet and take the money right out.\n\nThis place definitely takes the cake.  My buddies and I were looking for a place to eat after a long night of drinking.  We figure, what else would be good but Korean BBQ for a hangover, but unfortunately, the Korean BBQ was closed and we settled for this place.\n\nUpon being seated at this establishment, the waiter asked us if we would like to \"supersize\" our meals with lentil soup.  It sounded good, but the additional $6 cost for a small cup is unwarranted, and never mentioned by the waiter or the menu.  The waiter never even mention to us that the cup of BEAN MUSH was $6.  WTF?  You can buy a whole bag of beans for $6.  The management wanted to argue with us over this fact, so hence no tip and a bad review.  \n\nThe food is good, but the restaurant staff needs to tell their clients about ridiculous details of the \"supersizes.\"  I can go for $2 or $3 dollar additional cost, but come on now.  We all know the restaurants in Vegas do this because they know you won't be back again.\n\nService, SERVICE, SERVICE!!!!!  We can eat anywhere, it's the service that makes us continue to come back."
        }, 
        {
            "index": 157, 
            "rating": 2, 
            "review": "When I walked into this restaurant I was struck by the ambiance.  The dim romantic lighting, the heavy silk drapery and exotic decor were enticing.  When I opened the menu and saw the rather high prices I thought that the food must be superb.  \n\nWell, in reality the food was just okay.  Nothing spectacular. In fact, the Chicken Curry was dry.   Even though our party of seven ordered seven dishes that were listed as \"family style\", there was just enough food.  Maybe not even.  I think people were embarrassed to take too much our of the small dishes- as we had to share amongst seven people.  I think that became apparent when everyone was anxious to order extra orders of Naan (break).  \n\nMy advice to the owners?  Lower the prices a bit and increase the size of the portions."
        }, 
        {
            "index": 158, 
            "rating": 1, 
            "review": "Last night we had a reservation at 6:15.  By 6:35 we had not even had so much as a hello from a wait staff.  We did, however, get water from a bus girl.  We left - feeling disappointed.  Went next door for Mexican instead.  It was packed - and we did not see a single table get waited on in 20 minutes.  Gave up!"
        }, 
        {
            "index": 159, 
            "rating": 1, 
            "review": "Very poor service by the waiters and attendants.. gave us empty glasses and didn't even serve water!\nCame midway through our dinner and took away the remaining empty chairs on our table.. YOU DONT DISTURB ANYONE HAVING DINNER AT A TABLE UNLESS CALLED!!! Food was less than average.. overall DISASTROUS experience"
        }, 
        {
            "index": 160, 
            "rating": 4, 
            "review": "I adore this place. It is clean, has a nice ambiance, friendly service. I have tried many different items on the menu and I have never been disappointed. The eggplant literally melts in your mouth! Highly recommended!"
        }, 
        {
            "index": 161, 
            "rating": 4, 
            "review": "This place was amazing.  My fiance and I checked this place out for dinner.  We sampled a little of everything.  Starting with the Aloo Mattar Tikki (Stuffed Potato Patties) appetizer...yum.  Then we shared the Tandoor Chicken Haryali Kebab which is marinated in a fresh mint, spinach and coriander sauce, also another wonderful dish.  Not to spicy either, so if your looking to try something a bit more on the mild side...I highly recommend giving this a try.  We also shared the Chicken Vindaloo, which is a favorite of mine, my only complaint was that it says on the menu that it's cooked with potatoes (and I love my potatoes), but there weren't any potatoes in the dish. And for desert we tried a little mini sampler desert, but our favorite was the Gulab Jamun (Spongy mild balls made from cottage cheese and dry milk soaked in sweet syrup, served hot).  The ambiance was terrrific, we had great service, and each dish was delicious.  I highly recommend this place, I will definitely be returning next time I'm in the Vegas area."
        }, 
        {
            "index": 162, 
            "rating": 5, 
            "review": "You can judge any indian restraunt by their chai and this is by far the best adrak chai you will get in las vegas. \n\nHighly recommended great food."
        }, 
        {
            "index": 163, 
            "rating": 4, 
            "review": "This place is amazing. From the minute you walk in the staff is pro. The food is great too. The special dishes they are doing this month to relect the movie foods ia a really thing: tandoori wings are the ones to get if you can."
        }, 
        {
            "index": 164, 
            "rating": 2, 
            "review": "My friend and I were in the mood for some Indian cuisine. 4 stars on Yelp is pretty good, right? Unfortunately, the best thing that can be said about this place is it has a nice interior, more upscale than your typical Indian establishment. Otherwise, the food was decidedly mediocre and the service was absolutely atrocious, some of the worst I've experienced in a long time. But let's start from the beginning...\n\nOn a big banner right outside the restaurant, they advertised a 3-course dinner for two for $29.99. Upon inquiring about this option, our waiter informed us that special was no longer being offered and they've been meaning to take it down. However, they did have a 5-course tasting menu, served family-style, for $45 per person! Now either the waiter was bullshitting us or their website which advertises the same special is out-of-date as well. Either way, this is what you call a classic \"bait and switch\" and FALSE advertising! We should have taken the hint and walked out then, but we were hungry. Unfortunately this same thought would be a recurring theme throughout the rest of the evening. So we asked what was included in the 5-course tasting menu and were not terribly excited by what we heard and it didn't seem worth anywhere near $90 for the two of us. We asked for a \"few more minutes\" to peruse the menu.\n\nAfter about 5 minutes, we decided to get the sweet apricot and raisin naan ($4), chicken tikka makhani ($13), seven spice veal ($25), baby eggplant ($11), and 2 side dishes of chana massala and aloo gobi ($7 each). Oh and we had to pay another $3 for a single order rice because none of the entrees came with any! We ended up waiting another 15 minutes before another waiter spotted us looking a bit perturbed and asked if we needed anything. We told him we were ready to order. I thought he was going to take our order but instead he just told our original waiter that we were ready and would be \"right with us\". Our waiter was running a couple's credit card with one of those portable terminals right at their table. After the receipt was signed, the waiter continued to idly chat with them for another 5 minutes or so. Then our waiter disappeared into the kitchen or God knows where for another 10 minutes before finally coming to take our order. He apologized for us waiting \"a few minutes\" (yeah right, try half an hour). I would be more understanding if they were really busy, but less than 1/5 of the tables were occupied. I know, I know, we should've walked out already.\n\nSo finally our order is in, but we wait and wait and we wait some more. We continue to watch other customers who sat down after us and ordered after us, get their food first and in one case, actually pay the bill and leave! At this point I am so incredibly green with envy of the customers who have the \"other waiter\". After about half an hour, they finally bring out all the food at once. At this point, we were absolutely ravenous, but our spirits lifted in the hopes that it would be worth the wait.\n\nUnfortunately, while the food satiated our hunger pangs, it was substandard Indian fare. The naan was not crispy at all but rather thick and gummy. It didn't contain very much apricot or raisin and no chutney, tamarind, mint, or any kind of condiments were offered. The chicken makhani, usually one of my favorites, was kind of bland. It lacked the spicy complexity that a good curry should have. The chicken didn't seem to be marinated at all. It was dry and was probably cooked separately and then tossed into the curry at the end. The aloo gobi was mostly potato and contained very little cauliflower. We both got bitefuls of undercooked, semi-raw potato as well. The chana massala, veal, and baby eggplant dishes fared no better.\n\nDuring this time, no one stopped by to ask how the food was. Nobody offered to refill our nearly empty glasses of water until we were ready to pay the check. After asking for the check, we waited over 15 minutes before our waiter returned and was expecting to collect the check. When we explained that we still had not received the check, he disappeared for another 4-5 minutes before finally returning with our check. We usually pay via credit card, but decided that we better settle up in cash lest we want to spend another half an hour waiting. I almost never leave no tip, but I'm thinking this is one of the rare situations that qualify. However, my friend lobbies hard to leave at least 10%. As we're walking back to our cars, a Black crack whore tries to solicit us. Ah, a fitting end to such a memorable evening!\n\nHere's the executive summary: nice interior ambiance, over-priced mediocre food, horrendous service. I am sorely tempted to give this 1-star but since the food was at least edible (except for the undercooked potatoes) I suppose it just BARELY merits 2 stars. Take my advice: save your money AND time. Don't do it. Just go somewhere else, like Mount Everest, Namaste, or Samosa Factory."
        }, 
        {
            "index": 165, 
            "rating": 1, 
            "review": "I visited their kiosk at the Las Vegas Convention Center.\n\nFirst off, the area was a mess. No effort was made to tidy up the serving area or the adjacent dining area. I picked a one meat, one veggie plate with the lamb and something, I don't remember now. It didn't look appetizing but it was the most appealing thing behind the glass, but the stuff looked as if it had been sitting around for hours. OK, whatever, I didn't eat breakfast and I need to eat something. So I take a few bites of the veggie with some of the rice. It doesn't taste bad, but it was cool, not hot or even warm.\n\nAfter a few bites, I have to run to a bathroom, and I pitched the rest of the meal in the trash. I didn't even get to the lamb.\n\nLess than 12 hours later I had chills, cold sweats and felt nauseous. I missed an entire day of the show I was attending. Thanks guys, you're sure swell!"
        }, 
        {
            "index": 166, 
            "rating": 4, 
            "review": "This is a upscale Indian restaurant in Vegas. It is expensive, but they have the best atmosphere of all Indian restaurants. Their menu is very unique and delightful. It is a great place for dinner.  They are very proud of their martini selections.\n\nThe quantity of the food is meager, almost like a tasting menu. The bread basket is very good. The chef apparently has been winning awards lately.\n\nThe owner is Raja Majid, and he is there most of the time. He is an experienced restaurant operator from UK."
        }, 
        {
            "index": 167, 
            "rating": 2, 
            "review": "The food was great, however it is quite overpriced for what you're getting.  I ordered the Tandoori chicken for 12.95 - all if comes with is 4 small pieces of chicken, no rice or bread to go with.  I wouldn't order from here again, it'll cost a small fortune to feel satisfied."
        }, 
        {
            "index": 168, 
            "rating": 4, 
            "review": "Good:\n1. Food is pretty good.\n2. Prices are reasonable for Indian food.\n3. Good service. \n\nBad:\n1. If you get there at a certain time they will make you wait until that time's menu is available. \n\nI'm not a fan of Indian food. My tongue cannot handle the spiciness this food typically contains. However, I was in Vegas and this town is about leaving your ol' self at home and trying new experiences. \nSo, I walked in to the restaurant and they were celebrating an event. They server told me that I had to wait 'til 10 pm to place my order. I waited patiently, and one of the owners came over and apologized. \nHe went ahead and took my order. I tend not to eat fish anywhere, so he recommended the Old Delhi style corn fed chicken tikka makhani prepared with ground spices and fenugreek flavoured tomato makhani sauce, served with pulao rice. \nI took it to go. When I got back to my hotel room. I seriously prayed it would not be too spicy. \nI grabbed a spoon and went for taste:\nUmmm, not bad. Hot ,but not... wait, crap, spiciness coming in... where's the rice? Found it! oh! yeah... that's better. Not bad. Ok, let's continue. \nSo, it was basically like this for the rest of the meal; 1 or 2 spoonfuls of Old Delhi chicken and rice. \nOverall, I would def. come here again. It is the only place I've found myself liking the food. I've gone all over the world trying Indian food, except India."
        }, 
        {
            "index": 169, 
            "rating": 4, 
            "review": "Two things led me to this place: 1) I had a voucher from restaurant.com, and 2) it was near the university, so my boyfriend and I decided to stop by after class one afternoon. \n\nWe went around 4 pm on a Thursday. It was a ghost town - nobody else was in there. Due to this observation, we immediately thought it was one of those restaurants that close in between lunch and dinnertime to partake in the \"siesta,\" but our waitress promptly darted out and greeted us, seating us at one of the many empty sea of tables.\n\nFirst impression: Fancy and proper table settings (the silverware already set, along with a water goblet, and the pyramid napkin-fold). Also, the leather seats exuded an executive-style feeling to the whole atmosphere. Very nice and well-kept.\n\nI had the PALAK PANEER and my boyfriend had the KALI MIRCH KA MURGH. We shared some naan bread and steamed rice between us with our main dishes. Our waitress made me a sample shot of the MANGO LASSI, which I ultimately ended up getting. (Its consistency is like yogurt for those that don't know. It was a nice contrast to the entree.) Overall, we both agreed that the food was very good - tangy infused with spices, flavorful and fresh. Even his ginger ale seemed like it was just made from scratch. Our taste palates were satisfied, and our waitress (having just one table to attend to) was very attentive. People slowly trickled in as we finished. I found out that there is a happy hour at 5. \n\nMy only COMPLAINT: The prices seemed a bit high, especially for an off-the-strip restaurant. If you look at its surrounding neighbors, you've got a Johnny Rocket's on one side and Paradise Cantina on the other. There are many Indian places near the vicinity of the university, and this ranked higher on the price scale. My dish was priced okay at $12.95, but my boyfriend's dish was $16 and his ginger ale was $4.50. It seemed to me more like a dinner. (Browsing the menu, some dishes went into the high $20-$30 ranges.) Our overall tab would have been about $50 for two people for just a late lunch. Luckily, I had a $15 certificate to use. I guess you're paying for the ambience.\n\n (Side note: The bathrooms are amazing! Just the right finishing touches and amazingly clean! The ladies' room even had sample hand salts to use.)"
        }, 
        {
            "index": 170, 
            "rating": 1, 
            "review": "I went for Lunch BUFFET today. Saw on their website and it was $11.95. Food was 4/10. not much option for veggie/vegetarian. Water was on the floor, I saw one person slipped while taking food (in the buffet line).\n\nWhen the final check comes, it was $14.95 + tax. I asked your website says, $11.95, so why its $14.95, I got answer, sir its holiday special. I was like, so its special for you, not for customers and also their website was not updated. WTFF. Also, I went for \nLUNCH BUFFET @ 1pm and not for Brunch Buffet.\n\nAvoid this place if you are a veggie/vegetarian. In the end, you will be disappointed. \n\nKeyword: groupon, veg, vegetarian, veggie, indian, restaurant, india."
        }, 
        {
            "index": 171, 
            "rating": 5, 
            "review": "I absolutely love this place. My wife and I can me here for our honeymoon snd our 1st anniversary. We went back on Valentine's day this year. I love the chicken 65 appetizer, my wife orders the Tiki Chicken Masala, bomb.com. I had the Tandoori chicken, also bomb.com. The only downside was they did not have poached pear dessert that we LOVE!!! Still can't give them a bad rating as all 3 time have been fsntastic. i love this place, they also have excellent garlic Nan bread, the apricot golden raisin Nan bread is also Excellent,  I highly recommend this place"
        }, 
        {
            "index": 172, 
            "rating": 2, 
            "review": "this place is just ok, i've given it two chances and still have not been impressed.  the first time i went my friend asked for chicken curry and the chef made it for her even though it was not on the menu. the shrimp/garlic dish is tasty as well as the lentil side dish but nothing on the menu is worth the high prices! thumbs up also for the mango martini. the second time i went the menu layout had changed and some of the items.  the \"platter\" we ordered was hardly a platter at all. maybe it's cuz i dont know what to order but i like to get my money's worth and will probably stick to buffet type places from now on. the ambiance is nice and i love the candles, but this is more of a snack/drink type place then meal place for me."
        }, 
        {
            "index": 173, 
            "rating": 2, 
            "review": "What happened Origin India? You used to be so good! So this is my first time coming back here since Feb. of 09, post their new chef and menu changes. I'm disappointed because they were so good and the service was so amazing before and this time around it was just not.\n\nMy friend and I walk in, get seated, and are immediately approached by a waiter inquiring on our water preference. We receive our menus and start talking and realize that we have no drink menu. Okay? Don't the two usually go together? Mid conversation we're interrupted by another waiter after we just looked at the newly received drink menu. We said we need more time and he saunters off. The menu has become this bizarre fusion without the proper names of the dishes, so it's like uh what? Basically they give you the recipe without saying what it is. My friend ordered the chicken tikka salad that was served over a minuscule bed of coarsely chopped iceberg and romaine and I ordered the lamb curry stir fry, which was really lamb vindaloo. We ordered some samosas and apricot and raisin naan to start. The waiter inquires how spicy I wanted the vindalooo and I say as spicy as it gets and that we would like the naan and the samosas to start. Please tell me why it took 10 minutes to get our cocktails in a bar that was not busy? I mean literally the bartender was just standing there doing nothing and there was no one at the bar. When we received our cocktails that were $10 in small martini glasses we were less then impressed. I ordered the orange peace margarita and my friend ordered a blackberry pomegranate concoction. We both slowly drank them, but they were not that good. So our naan arrives at the table as well as our samosas in a little tower shape with a nice presentation. The flavors were good, albeit dry. 4 minutes after that he brings the chicken tikka salad to the table after he asked when we were taking our order if we wanted the salad with the samosas or with the lamb. We said with the lamb since that was her entree. After 5 additional minutes obviously my lamb wasn't coming and he forgot they were supposed to be served together. So she ate and I just sat there. Fun times. After she was done, the lamb got brought to the table and I literally could barely eat it. My fault because I said as spicy as it gets, but that was ridiculous. I can usually take spicy but damn. He asked how everything was, I said really really spicy and he brought over some raita.  It still wasn't good after that, and when he inquired later on how I was doing, I still said it's really spicy and he awkwardly laughed and walked away. He didn't ask do you want me to have the kitchen make another one for you? Nope, he just giggled and walked away. WTF?! Now I could understand if I ate half of the dish but I had a little corner of my plate with the lamb on it and some rice. It felt like it was his first waiting tables job and it was just off. Yes, the waiter was nice but it felt like a poorly operated faux fine dining experience. They were not trained properly on etiquette, nor timing. We paid our $60 bill and left. I boxed up my vindaloo and took it home and ended up just throwing it away anyway because I knew I wasn't going to eat it, I just couldn't justify spending $21 for something and not eating it. Oh and also, the lamb didn't come with rice it was a $3 upcharge. Ridiculous. \n\nAfter the great experience I had to that is just disappointing, and it was my birthday last night to boot. I'm kind of undecided if I want to go back after that."
        }, 
        {
            "index": 174, 
            "rating": 4, 
            "review": "Recommended by a colleague of India origin... and it was good.  Two things that I would recommend to:\n1.  share the dishes among your companion - as all the dishes were great\n2.   try a variety of different breads - they were all wonderful\nIt was fairly reasonable at about $40 a person including tips."
        }, 
        {
            "index": 175, 
            "rating": 1, 
            "review": "All the prices on the pics is not right . Very disappointed with the food . Very less quantity with the very high prices."
        }, 
        {
            "index": 176, 
            "rating": 1, 
            "review": "I don't even know where to start. First, my husband and I went there for the first time tonight for our date. We figured out quickly what we wanted to order. We got 1 vegetable samosa appetizer, 1 lamb and rice entree, 1 chicken tikka masala, 1 garlic naan, and 1 cola cola. It took an hour to come out, and people were getting their food way before us that came in after us. A very nice man came to our table to apologize for the wait and assured us he would take 15-20% off our bill for waiting. We thought this was very kind and didn't expect it at all. We didn't complain once for waiting, so really it was very surprising to us. Anyway, or food finally comes out and it was killer good. We enjoyed it very much, but when it came you refills on my husband water, the servic lacked. We had to wait a good amount of time for our bill but when it did come we explained we had bought their yelp $15 for $25 deal. The same kind man that said he'd discount or bill 15-20% was confused by their yelp deal and said he'd have to speak to the manager. Some time later he comes back and looks at it again and says he'll just take the $25 off. But then we no longer were compensated the 15-20% for waiting. Okay, fine we understand. Our bill AFTER being discounted the $25 was still $63!! So look at the receipt and see that we have been charged for a lot of things we did not order. We were charged for 2 vegetable samosa's, 1 kingfish entree, 1 tikka masala, 1 glass of merlot, 1 lamb entree (i can't recall the name), 1 other entree (i can't recall the name), 1 coke, 2 garlic naans, and another appetizer I can't remember the same of. I bright the receipt to our server and said hold on, you way over charged us. She knew immediately what we really ordered and ate and really changed our ticket which ended up being $24 after taking the $25 off!! But the extra shady part is is that she was helping the kind man with ringing out our ticket that they way over charged us for! I definitely think they thought they were going to get away with overcharging us. It is so disappointing because the food really was wonderful. We still tipped $8 even though the service wasn't that great and they tried to scam us, but that's the right thing to do. We will find somewhere else to eat Indian food rather than going back here."
        }, 
        {
            "index": 177, 
            "rating": 5, 
            "review": "Warm, roomy,  authentic, comfortable decor. Just enough room between tables. Comfortably dim but not too dark. Friendly everyone. Rich, large, varied menu describing diverse delicious dishes in colorfully plain English. Both dishes I ordered were quickly brought out. Warm. Fresh.  Ridiculously flavorful. Textured. Spicy. Sweet. I am so satisfied and content. A simple, sophisticated  high note experience. Highy recommended."
        }, 
        {
            "index": 178, 
            "rating": 2, 
            "review": "The food and drinks were amazing last night. The service however, ruined it. We showed up a little after 6 and was strongly advised by our waiter to get drinks and apps because they were bogo during happy hour. We ordered drinks and apps and an entree each. The drink I ordered was Shandi something and it was spicy, peppery and perfect. My friend had 'The Maria' . It was fruity and on the sweet side but equally as delicious. The appetizers we got were plated beautifully. The scallops were my favorite, nice and crispy outside yet tender and mild on the inside. The stuffed portobella mushroom was tasty too, I just would have liked it served warmer since it was deep fried. I had the lamb shank after being advised by the waiter it was much better than the lamb stir fry i ordered at first. The lamb shank was every bit of amazing as it was expected to be. The sauce was extremely spicy, flavorful as well as hot. I coughed after my first bite. The lamb itself was so tender it fell off the bone. I could cut the meat with my fork. My friend had the baby eggplant dish and loved it. Now I bring myself to the downer of this meal....the LACK of SERVICE! We were never offered refills on our drinks, yet our glasses of water were refilled continually by the busboy. Once we were finished with our meal we sat and waited for our check for over 30 minutes with our waiter nowhere in sight. Thank God my friend was so entertaining or else I would have been more upset. After 40 minutes had gone by I started flagging down anyone i could find to ask for our check. I asked the bartender, the hostess, the busboy...then finally our waiter appears and presents us with our check. The check was wrong of course because he had charged us full price for the drinks and apps he worked so hard to sell us on for happy hour. I could understand though since it was now 8:15. I quickly jumped up and followed him back to the kitchen and asked him if he could fix our check. His response was \"I will speak with the manager about it\" to which I responded \"We are in a hurry!\" Then he said \"Okay I'll take it off right now.\" Hahaha I think I scared myself a little there, but whatever it worked! We finally got out of there. It was really busy for a Tuesday night, but nonetheless that is no excuse for poor service. \n\nFood = 5 stars \nService = 0 stars"
        }, 
        {
            "index": 179, 
            "rating": 5, 
            "review": "One of my favorite restaurants in Las Vegas. And one of the best Indian restaurants I have been to anywhere in the world.  The menu may or may not be \"completely\" traditional Indian cuisine, but their interpretation is quite well done.\n\nI love everything about this place. The ambiance and the food is just spectacular.  They have recently introduced a $45 5 course tasting menu which is a great way to introduce (or re-introduce) yourself to Indian fare. When ordering from the menu, I have never been steered wrong in any selection.  Each dish has been truly outstanding.\n\nSome changes to the menu have also introduced an Apricot and Raisin Naan which is unbelievable and can be eaten on it's own.\n\nThe biggest surprise about Origin India? They may well have the best cocktails in all of Las Vegas, and at non-Strip prices. Each cocktail is made by hand with care with fresh ingredients by their master bartender, Joseph. No pre-made fruit juice mixes in these drinks. Try the cucumber/pear martini: one of the best cocktails I've ever had the pleasure of tasting."
        }, 
        {
            "index": 180, 
            "rating": 4, 
            "review": "This was the very first place I've ever tried Indian food! I know I'm a bit late, but growing up, neither of my parents appreciated Indian Cuisine, so I never got to taste it til recently! And verdict is, I love it! But like I said, since I havent tried too many places, take my review lightly lol.\n\nI found out about them through groupon and both times came during dinner. The servers are really professional, but might I say a little too professional if that makes sense? Somewhat uncomfortable and stuffy but very polite nonetheless.\n\nHYDERABADI CHICKEN  $16.00\nChicken cooked with southern Indian spices and coconut milk sauce that is not too rich with a subtly sweet warm and spicy flavor. My favorite!  Super flavorful and moist, not too spicy and the coconut sauce had the perfect rich consistency.\n\nDILWALA MURGH MUKHANI (Chicken Mukhani) $16.00\nTandoori chicken tikka in a tomato and cream sauce and finished with butter. For some reason this dish reminded me the best fusion between Indian and Italian food you could think of. Rich sauce again, and       similar spices and flavors to the Hyderabadi Chicken.\n\nBHATTI KA MURGH (TANDOORI CHICKEN) $12.95\nTandoor roasted organic chicken in freshly grounded exotic spices, served with mint and tamarind chutneys. A little dry but great flavor, not overly salty like I've had and other places.\n\nDAL BUKHARA $12.95\nBlack lentils delicately spiced and simmered overnight then finished with a touch of cream and butter. Definitely one of my favorite Vegetarian dishes. As you can tell I'm a fan of creamy and rich lol \n\nVEGETABLE SAMOSA (Vegan)  $7.25\nSeasoned potatoes and peas stuffed in a triangular pastry fried and served with mint and tamarind chutneys. High five for being vegan! The mint and tamarind chutneys were the perfect pairing for these little flavor bombs.\n\nEverytime I've come here, I think 3 or 4 times already? All times have been consistent in great flavors, service and presentation. I'll definitely be back! Definitely check in for their amazing Mango Lassi, and take advantage of the special $15 for $25 deal here on yelp! Hopefully I'll have time to try their lunch buffet from 11:30-3pm soon!"
        }, 
        {
            "index": 181, 
            "rating": 4, 
            "review": "I have been fortunate to have traveled the world, and have had Indian food in the two best places- Britain and India. I rarely find a restaurant outside those 2 countries that have decent food, but I must say, that this one does. The service is impeccable, and I have not had anything that was short of delicious. They ask how spicy you want your food and they prepare it just that way- perfection.\n\nI have eaten there 3 times now, and will go back on every visit to Vegas. If you are a Curry Connoisseur, you will not be disappointed with this place."
        }, 
        {
            "index": 182, 
            "rating": 2, 
            "review": "I really wanted to love this place. The menu looked great and the staff was very friendly. \n I ordered 2 entrees to go. Stuffed chicken and the tikka masala.  They asked me a few times if I wanted it spicy.  YES, please! (I know I am a blond white girl, but I like it HOT).  I sat and waited for about 15 minutes when the bartender apologize, I could not have the stuffed chicken because it was too \"dry\".  He recommended the chicken Korma and promised I would like it.  Nope, hated it.  It tasted like dry chicken cooked in whole milk (NO FLAVOR) and super watery.  The tikka masala was so bland, add a little basil and you've got chicken tomato basil soup. Not even a little spice.  They could have hidden the blandness with some heat. Naan was delish.  Over priced for the meal-  $50.\nSorry Origin, but I make better Indian food in my own kitchen."
        }, 
        {
            "index": 183, 
            "rating": 5, 
            "review": "I've been to most of the Indian restaurants in Las Vegas and Origin India is one of the best. Great service, great food...love it!"
        }, 
        {
            "index": 184, 
            "rating": 4, 
            "review": "This is a great option just off the strip. We accidentally ran into this place but it was a pleasant surprise. The ambiance was pretty lively as there was a DJ that night. The service was very attentive .\n\nI ordered the lamb vindaloo, which is made in a sweet and sour sauce. This was the recommendation of our server and I was happy I listened. The lamb was tender and the dish itself was very satisfying. I thought the naan was excellent- some of the best I've had- and the perfect complement to this dish."
        }, 
        {
            "index": 185, 
            "rating": 4, 
            "review": "My husband and I went here after buying a groupon. I have to admit that I was pleasantly surprised. My husband likes Indian cuisine so I thought it would be a good idea to try this place out. It is off the strip so that take that into consideration when planning. But the food was delicious. We ordered Lamb biryani and Chicken Tandoori and both were outstanding. The service was impeccable as well. They really made sure we understood what to expect and how everything was prepared. Would definitely go back."
        }, 
        {
            "index": 186, 
            "rating": 5, 
            "review": "Came here when our other place was mega busy - Christmas Day!  Awesome food, super friendly staff. The peshwari naan & veggie pakora are top notch!"
        }, 
        {
            "index": 187, 
            "rating": 3, 
            "review": "We were not actually planning on eating here tonight, but as we walked by the smell of the Indian food was just to good to pass up. Now we have our regular Indian restaurant that we love, but that is on the other side of town and we were meting friends close by, so Origin it is.\n\nThe decor is nice, the private dinning areas are very nicely done, a different tone from the normal Indian restaurant for sure, it would echo what was to come.\n\nIf you are expecting your normal Indian restaurant menu, you're in for a shock, however, on closer inspection, the regular menu items are there, just hidden behind the words of someone who had way to much time on their hands when the menu was put together.\n\nFor example :\n\nOld Delhi style corn fed chicken tikka makhani prepared with ground spices and fenugreek flavoured tomato makhani sauce.\n\nThe vast majority of Indian places would simply call that Chicken Tikka Massala,  \n\nBut you get my point, study the menu and the regulars are there, also, the wait staff were more than happy to run through the menu.\n\nThere are also some \"non-standard\" dishes, but those will have to wait till next time as we were really in the mood for Indian comfort food.\n\nSo, Chicken Tikka Massala and Chicken Korma were ordered, along with a couple of plain naan and one Wild mushroom and truffle oil naan.\n\nThe food took about 15 minutes to come out of the kitchen, it then dawned on us both that they had not asked how hot we would like the curries, mmm, could be an issue, I like mine hot, but the wife likes hers very mild...Luckily for us, they were both mild, but then again (Indian food eaters are laughing) a Massala and a Korma really shouldn't be that spicy anyways.\n\nThe plain naan was good, the mushroom naan was very good, it actually made for a nice combination when eaten with the massala sauce.\n\nAs Frank S pointed out below, the flavours are very light and delicate, now, IMHO this is not a bad thing, especially when first being introduced to Indian food, the Korma was actually spot on, the massala needed a little more flavour to be just right.\n\nSo would I recommend Origin...Certainly, it is a decent Indian restaurant and even more so if you are just stepping into the wonderful world of Indian cuisine.\n\nAre there better in town, yes, are the worse in town oh yeah."
        }, 
        {
            "index": 188, 
            "rating": 5, 
            "review": "I have been here twice and each time the service and food doesn't disappoint.  The naan is amazingly fresh and tasty.  I was just there on a Saturday night though and they were almost empty.  I'm not sure why."
        }, 
        {
            "index": 189, 
            "rating": 2, 
            "review": "Very expensive with less quantity . If you are going for ambience then I would give 4stars but food with the money you spent is not worth it:("
        }, 
        {
            "index": 190, 
            "rating": 5, 
            "review": "Used a $25 for $50 groupon and was pleasantly surprised.  I normally only eat Indian food during buffets because i want to be able to try as many things as possible and i got use to eating a variety of foods at the same time.  The groupon allowed me to try the 6 things on the menu and i was able to take them home afterward.  What was so surprising to me was the service it was the best service I've had in a very long time.  The quality of the food was excellent."
        }, 
        {
            "index": 191, 
            "rating": 3, 
            "review": "I ate here last night for the first time with two friends visiting Las Vegas from Great Britain.  The food was very good.  I would have given it four stars, but the prices are too high for the food you get.  These are strip prices, not some off-Strip mall prices.\n\nI had the southern Indian style diced lamb.  The seasoning was wonderful.  My friends had 1) the Origin India Kebab platter and 2) the lamb shank.  We also had one order of regular and one of garlic naan.  We also ordered fried papardam.  They were out of the fried so we got baked instead.  It was only 4:45 in the afternoon.  \n\nFor the three of us, the bill was just over $100.  We had cokes and an iced tea, no alcoholic drinks.  Since we had a Restaurant.com certificate, they added 20% service charge to the bill before the discount.  That's just too much for three people for what we got.\n\nThere are other places that are less pretentious that have good Indian food.  I'll go there in the future."
        }, 
        {
            "index": 192, 
            "rating": 5, 
            "review": "Grossly underrated place! It takes a little while to get the food but that's because they seem to make a lot of it from scratch. I've been here twice and tried a total of 7-8 dishes. All have been fantastic."
        }, 
        {
            "index": 193, 
            "rating": 4, 
            "review": "Food was great, waiter was not. I ran into the owner on the way out though and he was very kind."
        }, 
        {
            "index": 194, 
            "rating": 1, 
            "review": "Fell sick the next day. Ruined Vegas trip"
        }, 
        {
            "index": 195, 
            "rating": 4, 
            "review": "We brought in a groupon here Thanksgiving weekend--I simply don't know why the place wasn't super packed! The food was delicious, aromatic, and on the unique side for Indian. They carry a great wine selection. The service was impeccable (it almost put the strip's fancy restaurants to shame, no joke), and the decor is awesome. I definitely recommend this place to locals willing to venture close to the strip and deal with the traffic, but also tourists like myself who are sick of waiting in line and paying too much for mediocre food elsewhere. \n\nI'll be back next time I'm in town!"
        }, 
        {
            "index": 196, 
            "rating": 4, 
            "review": "This review is for their Sunday lunch buffet.  I came in with my SO who loves Indian food.  The place is tastefully decorated and clean.  The food is tasty and spicy but not overly hot.  I liked the vegetable dishes more than the meat dishes, the sag paneer was outstanding, the lamb meatballs were delicious.  The naan bread was soft, fluffy, and warm the way it should be.  And the beetroot pudding was to die for.  The SO liked everything, although he thought the lamb dish (not the lamb meatballs) was just so-so.\nThe girl who served us, however, did not ask us if we wanted drinks.  She assumed we wanted water.  Before we left, my SO said \"thank you\" to her, and she did not say anything back at all.  She must have been in la-la land, but we thought it was weird.  The SO was impressed with the food, however, so we'll be back."
        }, 
        {
            "index": 197, 
            "rating": 4, 
            "review": "Just had dinner here as it was recommended by the concierge at our hotel.  We ordered the Chet's tasting menu and one appetizer to share between the two of us.  Well, the tasting menu was a carnival of favors.  So many delicious dishes - we could not begin to finish our meal.  And, the service was terrific."
        }, 
        {
            "index": 198, 
            "rating": 1, 
            "review": "They had a stall at the convention center. Awful is an understatement. I only went there because they had vegetarian food, but the rice was undercooked, the vegetables were overcooked and the Dal was not cooked and smelled burnt. Yikes! Next time, I will rely on Kind Bars rather than go here. Really bad."
        }, 
        {
            "index": 199, 
            "rating": 2, 
            "review": "Overly priced with poor service and good food. I ordered sparkling water for myself and ended up paying eight dollars for a large bottle. I should have checked the prices but the waiter made me feel that it would be individually priced. Then we ordered tea which was not served until after we received our bill."
        }, 
        {
            "index": 200, 
            "rating": 4, 
            "review": "The atmosphere is nice and is conducive for large dinner parties. The hosts and waitstaff are very friendly and honest. They are even accommodating on splitting entrees, etc. The food also looks great and tastes good."
        }, 
        {
            "index": 201, 
            "rating": 2, 
            "review": "My sis and I came here and we both craving Indian food since we hadn't had it in a while ... the staff is really nice, the place is clean and decor is great. Buuuuut, we left a bit disappointed. I guess this really only applies to the buffet ... which would really have 2 1/2 stars but gave them 3 assuming their regular menu is better. \n\nWe walked in, they seated us and said \"we have buffet, help yourself\" ... we thought that's all they were offering for lunch, we would have at least liked to see their lunch menu! It wasn't til they offered the menu to someone else that we became curious! haha We picked up a to go menu as we walked out and it sounds a lot better than what we experienced ... \n\nI guess being from Los Angeles, I've had my fair share of Indian buffets and this one fell short in my book. It was $14.99 and the selection was small. White rice, tandoori chicken, vegetable curry, chicken curry, punjabi curry (not sure what kind of meat it was, it was mushy), fish curry ... a potato soup (which was really salty), fruit salad and plain naan. I guess back home they just have so much more to choose from ... samosas, garlic naan, multiple curries etc. The food was ok ... just lacked variety and used to garlic naan. We ordered a side of samosas, good but would have preferred a thicker crust/wrap - it was more of an eggroll wrapper. \n\nNext time I'm in town and craving Indian food, I think I'll order off their regular menu or go somewhere else for a buffet."
        }, 
        {
            "index": 202, 
            "rating": 2, 
            "review": "Used the Yelp $20 for $40 deal. Wasn't worth it even with the discount! Food was overpriced and not that good. The service was excellent and I felt bad because they tried really hard but the food was mediocre. (Hence the 2 stars for the service and cute decor. The music they played was kind of odd as well; contemporary music which seemed out of place!) \n\nBack to reviewing the food... The lamb curry was neither lamb nor curry. Kind of bland and Americanized. Wanted to feel the intensity of the curry and taste the gamey-ness of the lamb meat. The kebab sampler was okay. The prawns in the sampler were delish (but you only get 2!!) but the rest of it was average. I have had better food at a food truck. I really appreciate value for my money and I don't mind spending a lot but I want to have a dining experience where the food is delightful and wows me. And for $25 a plate it did nether delight me or wow me. Too bad I really wanted to love this place and make it my go to Indian spot. I will continue my search! =("
        }, 
        {
            "index": 203, 
            "rating": 4, 
            "review": "This is a very nice restaurant. It's about a mile from the strip, and right across the Hard Rock Hotel, but the food was quite pleasant. It's one of the pricier Indian places I've been to, but I wouldn't say it's overpriced, because the quality really is great. I got a lamb dish that had a nice spice to it, and the garlic naan was good also! Very filling meal. Check this place out if you're ever near the Hard Rock Hotel area!"
        }, 
        {
            "index": 204, 
            "rating": 5, 
            "review": "I may have just been lucky, based on some of the previous reviews, but I have been to this restaurant multiple times and will continue to come back.  I always try to make an excuse to go to Origin even though its not on the strip when I'm in Vegas.  The multiple occasions I have been there include a Thanksgiving dinner with my family (lots of vegetarians so Indian food was perfect!), an intimate dinner with my wife, a bachelor party, and a 40th birthday.  In every instance the food we ordered was spectacular and the drinks were the perfect compliment.\n\nOur most recent experience was a 40th birthday party celebration.  We had a group of 12.  The menu had already been determined in advance in order to avoid the hassle of trying to get a group consensus on what to order.  Indian food is best enjoyed family style.  We had a wide variety of dishes:\n\nAppetizers- Mixed Appetizers: Samosa's, Lamb kabobs, Tandoori Shrimp\nMain Entrees: Family Style: Chicken Makhani, Bhindi Massala, Lamb masala, Saag Paneer\nSides: Plain Naan, rice, raita, mint and tamarind sauces\nDessert: Kheer and gulab jaman\n\nThe service was great, the food delicious, and the bartender made amazing drinks.  Make sure to ask Joseph to create a drink for your party from scratch."
        }, 
        {
            "index": 205, 
            "rating": 4, 
            "review": "Great restaurant with a nice menu and awesome grub. The ambience is unique and the service was also flawless. I will definitely visit this place during my next visit to Vegas. This place is bang on for the price they are charging. Expect to pay $15pp for lunch and $20 pp for dinner without alcohol. \n\nSuggestion: For bigger group, I heard there is a 10% off coupon available in the Las Vegas coupon book that you find everywhere."
        }, 
        {
            "index": 206, 
            "rating": 5, 
            "review": "This was probably the best Indian food I've had in the US.  We walked in for a late lunch and opted for the buffet and I am so glad  that we did. \n\nThe curried fish was definitely my very favorite.  I am not one for curried fish but I even had a third helping of the fish.  It was THAT delicious.  \n\nUnfortunately I cannot remember the details and did not make the effort to remember everything that we tried, however, it was an experience that left me craving more."
        }, 
        {
            "index": 207, 
            "rating": 5, 
            "review": "One of the best indian meals I've ever had, hands down. This place is as tasty as they come, and they make it spicy!\n\nAdded props for the beer selection (not amazing, but lightyears beyond other indian restaurants). They have a few belgians, some craft brews, and of course Indian beers.\n\nI can't wait to go back to this place next time I'm stuck in vegas thanks to a tradeshow."
        }, 
        {
            "index": 208, 
            "rating": 1, 
            "review": "If you are thinking to have a big party at this place, think twice!\nI represented 30 of our members and get in touch with the restaurant manager few weeks prior to our event date, everything (event date and time) was confirmed via email, 12 days before our event, a different manager called and told me that they were overbooked, suggested that we move our event to a later date. Hey come on, it is 30 people, everyone has put aside everything else and commit to attending this event, and now they want to move us because they took in a bigger order (she told me she had a party of 80 people on the same day when she wanted us to change our event date and not when I first called to book the event). She did give me an alternative - put us on the outdoor patio, are you kidding me? It is first week of August, summer month in Las Vegas, 12 PM is the time for our event, outdoor in the summer heat?\nThank goodness, 42 of our members shows up for the event and get to try a different indian restaurant other then this one who does not value their customer,  short-sighted in the way they run their business and lost all of us who vowed never to go back there again."
        }, 
        {
            "index": 209, 
            "rating": 3, 
            "review": "Good food, excellent service, nice atmosphere.\nThat being said, it's a bit overpriced and pretentious. The menu looked like upscale Indian, and lacked some basics. When the food arrived it wasn't any better than your average mom & pop Indian formulaic shop. I admit the bread basket was heavenly.\nWe were introducing some friends to the world of Indian cuisine and would have been happier elsewhere."
        }, 
        {
            "index": 210, 
            "rating": 5, 
            "review": "My favorite Indian lunch buffet place. \nGreat selection. \n\nNote: They only do the buffet Friday, Saturday, and Sunday now. They used to do it all week - that was amazing."
        }, 
        {
            "index": 211, 
            "rating": 5, 
            "review": "This is a good restaurant in Las Vegas.\n\nThe Ambiance and Customer Service is good.\n\nThey Provide very good quality food.\n\nIf you are going for Dinner,make sure to reach their before 10:15 PM.Their kitchen closes at 10:16 PM,after that you cannot order .."
        }, 
        {
            "index": 212, 
            "rating": 5, 
            "review": "The service is EXCELLENT, and everything that we had was delicious. We asked for medium spice level and that was just right because the food has a kick without losing its incredible flavor. We were in town for a few days and had dinner here more than once. My friend and I decided that I'd we lived in Vegas, we would probably eat here at least once a week!"
        }, 
        {
            "index": 213, 
            "rating": 4, 
            "review": "Good Food. Clean Place.  The breads come with rice and dal. We ordered another curry to accompany the dal which was quite good. The only  Indian place that I liked in Vegas. Pity its not on the strip."
        }, 
        {
            "index": 214, 
            "rating": 4, 
            "review": "The staff:  Good staff.  Helpful, un-intruding, and inviting.  Maybe not as knowledgable as I would have liked; had some interesting things to say about the wine that were untrue.  I don't think he meant to lie to us, I think he actually believed the things he was telling us.\n\nThe goods: Naan bread was scrumptious.  We all ordered a little of everything, and everything was delicious.  I didn't try the lamb (not really a lamb eater) but from what I heard it was no exception to the rest of our table buffet.\n\nThe atmosphere: I couldn't stop staring at the lights.  They've got killer lights."
        }, 
        {
            "index": 215, 
            "rating": 2, 
            "review": "We were in vegas for four days and ordered food to go from them twice and unfortunaltely both the times our experience was really bad. Firstly we ordered three orders of chicken makhni - the chicken was really hard and not cooked properly, the flavor was so missing, it was just like having a cream sauce in tomato puree with some chicken pieces in it.\n\nNext night we ordered saag paneer and chicken karahi and some naans. While the saag was just about ok the chicken dish was totally pathetic. The meat was not blended at all with the rest of the stuff - i wonder how can an indian restaurant make karahi chicken without any flavor. \n\nThe decor there is really good but you have to have the food quality to go with it and Indian food with no flavor - its a sin. I hope the owners will pay some attention to the food as well along with the decor."
        }, 
        {
            "index": 216, 
            "rating": 1, 
            "review": "The worst place ... Manager doesn't know how to manage and the server does not know what to talk..\n\nIdiotic place"
        }, 
        {
            "index": 217, 
            "rating": 5, 
            "review": "This has been by far one of our favorite Indian restaurants. We have been in there so often, the host/server said \"welcome back\" as we walked in and noted that we hadn't been by in a while.  This is my husband's favorite cuisine and he chose Origin India for his birthday dinner. As always, the food and service was great! We only had one very small issue: my husband and daughter ordered Vindaloo and the waiter told them it was \"very spicy\". My husband is very familiar with the dish and told him he knew the level of spicy and it was okay. The waiter , Tony, took it upon himself to tell the chef that it should be toned down. He did the same with my Chicken Tikka Masala when I told him I wanted it medium, not mild. As a result we didn't get the same Indian experience that we looked forward to; spicy and delicious. \n\nTo those that think it is high priced have you ever considered that is more than just casual dining? Cloth napkins, change in plates and silverware between courses, etc...this is not casual dining.  It is a treat for us because it is not in our \"everyday\" price range, but I do think it is reasonably priced for the quality of food and level of service.\n\nWe will continue to choose Origin India as our go to for Indian food as well as recommend it to others. My Favorites: Chicken Manchurian (appetizer), Chicken Tikka Masala & Garlic Naan."
        }, 
        {
            "index": 218, 
            "rating": 4, 
            "review": "Origin India is Las Vegas' only slightly elegant Indian Restaurant.\n\nAs such it doesn't offer the nearly standard lunch buffet and features higher prices than you might come to expect.\n\nWhat it does offer is very good food and a very nice atmosphere if you are into that sort of thing.\n\nMy Chicken Tikka Masala was \"above average\", as were the samosas and our side order of butter paneer. Wife wasn't as impressed with her vegetarian dumplings. \n\n3 1/2 stars tipping just toward 4."
        }, 
        {
            "index": 219, 
            "rating": 3, 
            "review": "Decent Indian fare but not the best. I have been here a couple of times. This time not sure as I see new management and staff."
        }, 
        {
            "index": 220, 
            "rating": 4, 
            "review": "LOVELY PEOPLE, FOOD, and EASY PARKING\n\nDecorated like ZGallerie, it's warm in colors and dark wood.  The people absolutely lovely that work here, and absolutely responsive and accomodating.  The food is excellent.  It's across from the Hard Rock hotel, and offers a shared parking lot...with ample free parking."
        }, 
        {
            "index": 221, 
            "rating": 4, 
            "review": "We went to Origin India last night after hearing they've brought in a new chef from the UK who was supposedly awesome. Well, they were right.  Presentation and tons of flavor - not what we are used to seeing at Indian restaurants out here in Vegas. This review really teeters around 4.5 stars...\n\nWe started off with the Chicken Chili Stir fry and Lamb Seekh Kabob. Both had intense flavor and were SPICY (just the way we asked for it). \n\nFollowing appetizers, we had the Chicken Makhani and Rogan Josh. The chicken makhani was buttery -- just the way it should be! Now, I'm not too big of a lamb fan because of the weird gamey aftertaste it has but the Rogan Josh was out of this world. Tender, boneless and unbelievable. The naan was nice and fluffy (not the burnt kind you see at other Indian joints). They served us a plate of onions, lemons and chilies without us even having to ask!\n\nI also ordered a side of okra which is my favorite vegetarian dish. It was good but not as great as my dad makes :)\n\nThe chef served us a complimentary dessert which was a little piece of heaven. Saffron poached pear with vanilla ice cream and an orange panacotta. Out of this world!\n\nThe husband is not a fan of eating Indian food in restaurants since it's never up to our standards; however, he said we would be back to Origin India very soon! Kudos to Chef Kuldeep Singh!"
        }, 
        {
            "index": 222, 
            "rating": 5, 
            "review": "Just had an amazing dinner here. The service was speedy and attentive. We never had to wait long for drinks or food. We had tikka masala, lamb curry, and vindaloo chicken. All were so yummy! Ronald took care of us and he was awesome!"
        }, 
        {
            "index": 223, 
            "rating": 4, 
            "review": "This was my first experience eating at an Indian restaurant.  It was a group dinner that was served family style and I had no idea what I was eating.  We didn't order off of menus, someone picked the dishes and we all sampled everything.  I wish I asked what the heck I was eating because it was awesome.....however, I was too caught up in the great conversation I was having with friends and my Wife took care of putting stuff on my plate to sample, so I didn't get the names of the dishes.\n\nThe service was very good.  They made sure our plates were always full.  The only downside is that their credit card machine is old school and takes forever to close out a check.\n\nI know this is a useless review for 90% of the people out there, but for those who haven't tried Indian food, I recommend giving it a try.....I was pleasantly surprised and can't wait to go back and try more dishes....this time I'm taking notes.\n\nReturn Factor - 90%"
        }, 
        {
            "index": 224, 
            "rating": 5, 
            "review": "Amazingly good. If you want a place off the strip that is slowed down, quite and has great food and service, go here."
        }, 
        {
            "index": 225, 
            "rating": 4, 
            "review": "My first outing to Origin India was with a lovely group of piano students and their fabulous teacher.  About half of the group was new to Indian cuisine and I think that they were suitably impressed -- and satiated -- after the meal.  \n\nLocated right by the Hard Rock Cafe, about a mile from the Strip and super close to UNLV, this Indian eatery is on the pricier side, but the food quality and the interior decor reflect the spendiness well.  Warm rich wood tones and relaxing browns and beiges dominate the interior, with pops of colour and tastefully chosen wall art.  Can I say this place is \"modern Indian?\"   \n\nMy party chose a variety of dishes (paneer, lamb curry, lentils, okra, etc) and everyone was happy and stuffed.  Tasty sauces, pretty presentation.  Nothing I had was super spicy, which will make those spice-phobes happy.  (I didn't ask, but I'm sure you can request more/less spiciness.)  A few of the kiddos had room for dessert (aaaah....to be young again with unlimited stomach capacity and high metabolism....).  I did not.\n\nI'll check this place out again when I want to be close to the Strip, but not on it!"
        }, 
        {
            "index": 226, 
            "rating": 3, 
            "review": "Haute living says this restaurant celebrated vegetarian awareness month in October it is located off strip vegetable samosas Chana masala okra and Paneer"
        }, 
        {
            "index": 227, 
            "rating": 2, 
            "review": "I came here with my boyfriend on our Vegas summer trip. I had seen this restaurant on Rachel's Vacation and wanted to give it a try. It was my 21st birthday dinner so I wanted to try some cocktail. The bartender recommended a few drinks for us and I decided to try something that had ginger in it (I forgot the name). It was crazy strong...I didn't eat before drinking it so I got really sleepy. Anyhow, we ordered the nan bread with mushroom. The nan were fresh and tasted okay.  We ordered two entrees, one seafood and one lamb. My fish was very boney, bland and hard to eat. My boyfriend got the lamb with some spices - it was not good at all. We had a really bad experience with the food. I'm not sure if we ordered the wrong things but ours were not good at all."
        }, 
        {
            "index": 228, 
            "rating": 4, 
            "review": "Everything here is awesome!!\n\nThe only reason I didn't give it five stars is because of one very stupid mistake from one of the waitresses, who was probably new, and probably foreign. When I asked for some milk for my daughter to drink, she brought her heavy cream. It made me livid! But once pointed out, all of the staff offered to go buy some right away for my crying toddler, even after she fell asleep."
        }, 
        {
            "index": 229, 
            "rating": 4, 
            "review": "The cost is not for the feint of heart - but the food is fit for a  Maharaja, have a great evening and treat yourself to the chefs tasting menu. Not typical presentations or traditional preparations set Origin India apart from usual Indian fare. Some may be disappointed in this. The bartender makes a wild selection of great martinis."
        }, 
        {
            "index": 230, 
            "rating": 5, 
            "review": "This restaurant is the BEST Indian Restaurant ever in Las Vegas. The ambiance, food and service everything is 5/5. I always go eat here when I am in Vegas. MUST GO!!\n\nWarning: Its a bit pricey.. \n$$$ with 1 drink from the bar and main course. No appetizer.\n $$ with just the main course. No appetizer."
        }, 
        {
            "index": 231, 
            "rating": 4, 
            "review": "Very nice Indian restaurant, Food was good and the place was very modern and upscale. \n\nPrompt service and friendly staff."
        }, 
        {
            "index": 232, 
            "rating": 5, 
            "review": "OFFSITE DELISH\n\nTypically food at the LVCC is just terrible and it's always the same boring food every day like pizza and burgers. So I was excited when I saw that Orgin India had a location inside the South Hall Las Vegas Convention Center. I discovered it during setup and could hardly wait for them to open up on Monday, during the first day of the show. What I really loved was the different menu for all 4 days. No food kiosk here does that kind of variety or even changes their menu like that. \n\nThere were two options to order. For $13 you could get one meat choice & one veggie choice with rice, bread & sauces and for $16 you could add on two more items of meat & vegetable. \n\nOn day one, I ordered the Chicken Makhani, Lamb Rogan Josh, Tadka Dal and mixed vegetables. I must say that everything was delicious. My favorite was the lamb because it was so tender. It melted in my mouth. I really loved the sauce from the Chicken and I mixed it in with all of my white rice. The lentils in the Tadka Dal were really good too. After finishing my delicious lunch I only knew one thing, that I could not wait to eat lunch here again tomorrow. \n\nOn Day two, I ordered the Lamb Vindaloo, Chicken Karahi, Dal Makhani and Gajjar Aloo. The spices were all amazing again. But I thought I wasn't going to get lunch here because the line went down the convention show floor. Obviously word had spread about the amazing food here. The secret was now out. I thought about getting out of line but decided to stay. I must admit the staff served everyone fast and I had my food in no time at all. I was so happy that it all worked out. \n\nThen on Day three, I ordered the Chicken Curry, Lamb Tikka Masala, Sag Aloo and Chana Masala. Everything was amazing and such deep flavors. The potatoes and spinach in the Sag Aloo wouldn't win any awards for looking beautiful but for taste that dish was a perfect 10. Again the lamb was very tender like it had been all of the previous days I had eaten here. \n\nI was sad on Day Four because I could not make it over here to eat. I just hope that Orgin India continues making food at the LVCC for future trade shows. \n\nI also was lucky enough to get to meet the owner Raja. He was a very nice man and I also told him thanks for delivering delicious convention food. He told me that he had another food cart in the central hall. Wow he is a busy man. I also praised his choice of making different food every day. Raja suggested I try his mango yogurt drink called Mango Lassi. It was both refreshing and yummy, in fact I could have had this drink for a full meal. On my walk back to my booth a few people asked me where I got the bright orange color drink. It was a real attention grabber. \n\nI must also talk about the yogurt on the side. It is so good with fresh cucumber, carrot and spices. It is probably the best yogurt I've ever had. I was also amazed at the fresh herbs and spices they used to make the food. On two different days I found real cinnamon sticks inside the chicken dishes. There is nothing like fresh ingredients and it really shows in the taste. \n\nSo if you are lucky enough to be attending a show at the LVCC I would highly recommend that you find either one of their locations. It's not likely you find Indian food on the show floor of a convention center. I am happy to have found this place and to have met Raja. I wish him much success but I know he doesn't need it because he cares about his food and his customers. He is a very rich man in my book. I look forward to my next trade show in Vegas because I know where I'm eating my next lunch."
        }, 
        {
            "index": 233, 
            "rating": 2, 
            "review": "Interesting, different menu items... My Dad really wanted to try something with, I think ox tail on the menu... I had something with duck...\n\n Now I know why they're \"interesting and different\" for Indian Cuisine... \n\nSorry... It just did not sate our palates..."
        }, 
        {
            "index": 234, 
            "rating": 4, 
            "review": "First time eating here and I have to say \"I'm coming back\". I finally found a Indian Food restaurant, I will continue to go to. It's a bit higher in price for certain foods, however well worth it. We had the \"Rogan josh New Zealand lamb shank with sun dried ginger, tomato and Kashmiri chilli\" which is delicious. Another of my favorite was the \"Eggplant crushed with cumin and ginger\".\n\nGreat Food, Service was okay; waiter took a tad to come take our order yet overall a good experience."
        }, 
        {
            "index": 235, 
            "rating": 5, 
            "review": "If there's better Indian food in Vegas, I'll never know. In fact, the biryani is so good, I have not ordered much more than that. Huge portions too. Great service, short wait. \nThe pizza place and Korean BBQ are also good, in the same shopping center. Then get a foot massage."
        }, 
        {
            "index": 236, 
            "rating": 5, 
            "review": "Came here for a lunch and definitely ate off the lunch menu. This is an expensive and classy restaurant disguised behind a lackluster front in a semi-crappy strip mall. We wandered in here lost thinking we would find a cheap Indian joint, instead we were treated to fine dining. After being initially shocked at the prices, I ordered some Murg Bharti off the lunch menu which came with some naan, salad, and rice. The dish was good - creamy and flavorful. And the prices for the lunch items really weren't bad at around 13 dollars per. I got mad though because I ordered normal water and they brought us a 7 dollar bottle of whatever. Give it a try, just keep in mind this place is fancytime.\n\nEdit: I came here again for lunch May 07 and they had corrected the little water issue by offering both. I even got some extra papadums for free. The other items on the menu were just as good so I'm upgrading to 5 stars because I believe this place is the best you can find in vegas."
        }, 
        {
            "index": 237, 
            "rating": 1, 
            "review": "I hate to give a business a 1-star, but I am a firm believer in giving credit only when credit is due... I had the butter chicken. I read the reviews prior to ordering & should have listened to the one that said it tasted like can tomatoes and chicken because they were so dead on! The chicken even tasted canned. Reminded me of Campbell's tomato soup with grated Parmesan cheese added. The naan was even weird. It was not prepared traditionally.. It was just a pita warmed up and brushed w/butter and garlic. I did not even finish my $20 meal for one : ("
        }, 
        {
            "index": 238, 
            "rating": 5, 
            "review": "Delicious food and wine. They catered to all our needs. Loved the customer service."
        }, 
        {
            "index": 239, 
            "rating": 5, 
            "review": "Very nice servers. Great Vegetable Samosas, and a calming atmosphere outside of the heat."
        }, 
        {
            "index": 240, 
            "rating": 5, 
            "review": "I love this place! I only discovered it recently through a friend, but it's already on my list of favorite restaurants. The food is fantastic! The drinks are fantastic! The staff is fantastic! Are you getting where I'm going here? After a very dismal and disappointing experience at another nearby Indian restaurant, I rolled the dice on this place and am very glad that I did. The ambiance really isn't 5-star worthy, but the overall experience takes it there. They also have this customer rewards program that gives you credit towards your next visit that is pretty cool. The food? Well let me tell you! The chicken stuffed with mushrooms and dates in the cashew stuff is awesome! All of the usual suspects are here and they are all wonderful! If you want spicy though, you need to ask here! Enjoy!"
        }, 
        {
            "index": 241, 
            "rating": 4, 
            "review": "I was on a journey to find some great Indian food.  I caught a TV show about a visit that Rachel Ray made, looking for some great Vegas restaurants.  One of the restaurants was Origin India, on Paradise Rd and Flamingo, just across the street from the Hard Rock Casino and Hotel.\nWe decided to go to dinner on a Friday night, it was fairly busy but not overly busy.  We were whisked away to our seats in a matter of minutes by a well dressed gentleman.  The setting was white linen and slightly formal, although we are in Vegas, and formal just doesn't cut the mustard in this town, it's typically blue jean Friday, every day of the week.\n\nOur waiter was incredibly attentive.  We ordered several appetizers, they were absolutely delicious, and had great eye appeal.  The portions at this restaurant fall are average, not to small, not too large.  Our main course was Lamb Masala and Buttery Chicken, again, both dishes were excellent and seasoned perfectly.\n\nThe restaurant environment, service and food are excellent, it's a tad pricey, but certainly a great dining experience."
        }, 
        {
            "index": 242, 
            "rating": 4, 
            "review": "Had garlic naan and chicken tikka and it was very good. The sea scallop app was greasy and overpriced. Overall good meal."
        }, 
        {
            "index": 243, 
            "rating": 5, 
            "review": "Yelp always does me right. I decided to go to Origin India because of the reviews, and even though my expectations may have been somewhat inflated, the restaurant rose to the occasion. I had the duck confit, my friend had the tandoori kabobs, and we shared the scallop appetizer. The food was terrific and beautifully presented, and the service was excellent."
        }, 
        {
            "index": 244, 
            "rating": 5, 
            "review": "Love food here, one of good restaurants here in Las Vegas. Love the food from menu, dont like buffet."
        }, 
        {
            "index": 245, 
            "rating": 5, 
            "review": "Garlic nam bread and vegan masala cravings Yasss I am always here. Love it. I recommend all my friends to try this place. Such lovely people and service"
        }, 
        {
            "index": 246, 
            "rating": 5, 
            "review": "I love love love this place , my husband is not really In to Indian food but he always eats everything up from this place. We originally found it on groupon , the first time we went it seemed  very slow (for dinner) but this last time it seemed steady. They have a great wine selection we ended up ordering two bottles. Also the food is amazing. Best Indian I've had in Vegas. I love the large selection of naan bread! The servers are great and professional, I can not wait to go back!"
        }, 
        {
            "index": 247, 
            "rating": 4, 
            "review": "The last time I had Indian food was probably about 10 years ago.  We were in Vegas and I had forgotten what Indian food tasted like, but mainly because one of our  friend was a Vegetarian, we decided to come here.\n\nI recommend the Chicken Korma and the Chicken Vindaloo, those were so delicious!  Service was excellent, probably one of the best I've ever had! Server was attentive and friendly, our  water was always refilled.\n\nIf the price was more moderate, it would have gotten 5 stars.  But I think I would definitely go back again when I am in town."
        }, 
        {
            "index": 248, 
            "rating": 4, 
            "review": "Had the chicken makhani w/ rice and chicken naan. Food was great and our server Tony was very informative and helpful."
        }, 
        {
            "index": 249, 
            "rating": 1, 
            "review": "We were told great things about the lunch buffet so we decided to try it one day for lunch. When we got there we saw a very nice restaurant but no buffet so I asked the woman at the front specifically if they still did the lunch buffet. To which she answered yes. So, we sat down and waited and waited and waited for a server to come over and finally a man came over to bring us some water. He asked if we had been served and we said we wanted more info on the lunch buffet. He got terrified and said someone else would help us. So, the lady I originally asked about the buffet came over and we asked her for information about it. She then said that they werent doing the buffet for a couple of weeks so they could change it. WTF??? I asked why she specifically said that she had it and she said that she was sorry because she never heard me ask that. THAT WAS THE ONLY QUESTION I ASKED!!! What did you say yes to? How does that even make sense? I don't like feeling like she said what she thought we needed to hear just to get us in the seats. We just walked out after that. Thats a terrible way to do business."
        }, 
        {
            "index": 250, 
            "rating": 5, 
            "review": "Amazing. I loved it. Joseph the bartender/ mixologist made amazing cocktails, he is an artist with alcohol. The food was great and so was the service."
        }, 
        {
            "index": 251, 
            "rating": 3, 
            "review": "Origin India, to me, is one of those places where you really want to like to like it for what it is but I guess the staff were having an off night the day I went.  \n\nThe overall restaurant ambiance is nice and I remember the nice hostess seating us quickly.  Everything after that was kind of weird, to say the least.  Our waiter constantly kept trying to upsell us, which is good sometimes, but we were pretty set on what we wanted and he kept pushing us to change our mind for something more expensive (I eventually told him I'm not a fan of lamb nor any kind of meat because I don't eat meat and he stopped haha).  The food took a while to come out but it did and it was pretty good.  The samosas were a bit cold in the middle but I didn't bother to tell anyone because I was hungry.  I also remember the Indian tea to be really yummy so try that out the next time you're in there.\n\nAlso, for some reason, the staff were bickering at each other all night.  Our waiter was fighting with the bartender and the bartender was telling the hostess to tell the waiter to go away and leave him alone etc, etc.  I not sure what the bustle was all about but it kept getting worse and guess what?  The waiter forgot about us.  A younger dude (maybe a manager? owner?) kept coming over while we ate to ask if everything was ok as well.  I just nodded and continued to eat because after awhile because I didn't want to state the obvious and tell him about the problem between the staff or the samosas.\n\nFinally, we were ready to leave and I called for the check.  At this point, the manager (?) was gone and we had to wait on our waiter.  It took a little bit because he went to the back for something and waited on some people coming into the restaurant.  I thought that was kind of odd.. he should have just given me my check and I could've signed it and been on my way.  But, Origin India does it different.  If you have a card (credit or debit) they have you use their CC machine at the table.  It was a bit awkward because it gives you option to manually put in a tip but I pressed okay and it automatically set me up for an 18% tip.  Now, my experience was nowhere near warranting an 18% tip but THE WAITER WAS STANDING RIGHT ABOVE ME waiting for me to press okay.  I felt weird asking how to go back on my tip for a more suitable tip so I just pressed okay and off the waiter went.\n\nOverall, it was an interesting experience.  I hope the waiter became a little happier with my generous tip.  Not sure how I feel about coming back to this place but if I do, I know how not to get tricked into a 18% tip!"
        }, 
        {
            "index": 252, 
            "rating": 4, 
            "review": "Probably the nicest Indian restaurant in Ladd Vegas. Naan, Curries, and salad are the best. Buffet Rice and biryani are just ok.\nAmbience is great too. Cushioned seats are very comfortable."
        }, 
        {
            "index": 253, 
            "rating": 5, 
            "review": "Outstanding Indian restaurant in the Las Vegas area. Try it, I guarantee, you won't be disappointed! Great atmosphere and superb service too!"
        }, 
        {
            "index": 254, 
            "rating": 4, 
            "review": "We came here with a group of 6 for a late lunch - and all enjoyed the lunch buffet.  For $12 you get a full lunch buffet - complete with at least 5 meat dishes and all the other things you expect at an Indian buffet.  \n\nWe came here after attempting to eat at another Indian buffet nearby that was too crowded and had a 20 minute wait.  I'm not sure why that place had a 20 minute wait and Origin India didn't - but I would encourage anyone looking for a lunch buffet to try this place first!  \n\nThe curry cabbage was delicious and very spicy - I wanted more of it but couldn't handle the heat!  The servers will bring hot and fresh naan to your table.  3 trips to the buffet later, I was ready to unbutton the pants and take a nap.  Too bad I had to return to work.  \n\n\nOverall, this is one of my favorite Indian places for lunch buffet.  The staff is friendly and the restaurant has a beautiful ambiance to it.  There is a little bar inside as well for those looking for a cocktail.  And for $12, you can't beat the price for the quality of the food experience!"
        }, 
        {
            "index": 255, 
            "rating": 5, 
            "review": "Most Indian restaurants I've been to have tended to look a little run down.  I don't know why this is, perhaps most of the emphasis is usually placed on the food.  \n\nOrigin India breaks that mold by having a snazzy, modern dining area and delicious Indian entrees!   Oh and it's got a great location too, right across from the Hard Rock, not far from the strip.  \n\nBest Indian in Sin City."
        }, 
        {
            "index": 256, 
            "rating": 5, 
            "review": "This place was fantastic!! Great service and the bext indian food I have ever had.  I highly recommend it.  It is a little on the pricey side and that is the only downfall.  Plus I am used to indian places that have meal with sides  included when you order your entree, where here you have to order everything separate.  Big portions though!"
        }, 
        {
            "index": 257, 
            "rating": 4, 
            "review": "Being an Indian, I can cook some good food myself. So, for me it is really difficult to find some good Indian restaurant, where they serve delicious Indian food. We went to Origin India for a brunch and liked the food very much. Potli Samosa & Tikki were prepared very close to their real taste. Indian Chai was awesome. Their service was very fast and the decor is good. However, it is a bit pricey."
        }, 
        {
            "index": 258, 
            "rating": 3, 
            "review": "Nice little Indian restaurant near my hotel. Had the buffet, which was well prepared & maintained through the lunch hour. Meat & veg curries... Tandoori chicken... All very good. $10  I'll definitely go back."
        }, 
        {
            "index": 259, 
            "rating": 3, 
            "review": "My boyfriend and I took his parents here prior to going to a show. The service was great! We had three apps, a few entrees, dessert and bottled water. The presentation was great, although I considered the portions small. They didn't ask us how spicy we wanted it and found it too Americanized. Normally its a good assumption that Indians will prefer Indian food traditionally. Total bill was 150 plus tip. We will be back but remember to ask for extra spice"
        }, 
        {
            "index": 260, 
            "rating": 4, 
            "review": "I haven't personally been to the restaurant, but I did have their catering and it was absolutely uh-mazing!!! From the vegetable samosa to the garlic nan and the chicken marinated in that excellent yoghurt sauce ugh it was all just so yummy .. I'm glad to find out that this hidden gem isn't too far from home, so I'll have to take a peek inside their actual restaurant one of these days! \n\n5 stars if the service matches the excellent food!"
        }, 
        {
            "index": 261, 
            "rating": 4, 
            "review": "Service was above and beyond! The bar started off a bit slow but made up for it by being attentive toward the middle of meal. Food is great in flavor. Unfortunately, most recent food experience was extremely salty. Environment was great. From dining areas to the bathroom."
        }, 
        {
            "index": 262, 
            "rating": 5, 
            "review": "AMAZING!!!!\nWe had the Vegetarian Chef Tasting. Every course was better than the last-fresh ingredients and perfect flavors. You cannot beat the naan-the garlic was my favorite\nIt is soooo much food that we had an entire meal for the next day, so it was DEFINITELY worth the price.\nThe service was also great, and all staff members were extremely helpful and friendly."
        }, 
        {
            "index": 263, 
            "rating": 1, 
            "review": "Several of us visited Origin India last Friday evening and we were all not impressed. \n\nAverage Indian food, small portions, slow service and expensive for what you get.\n\n The waiter was slow and there was only a handful of tables with customers which should have been the signal to try another place. We were hungry and figured we would give it a try. Will certainly not be returning."
        }, 
        {
            "index": 264, 
            "rating": 5, 
            "review": "Quiet and friendly!!! This is not my first time here... It is fresh and flavorful!!! The chef is always here and sitting looking proud of his dishes as he should be!!! They are all prepared in an authentic Indian ovens and pits... Besides the lunch buffet which is amazing, I recommend trying some of their unique specialties which one would rarely see on an Indian buffet... Most of my Indian eating experiences have only been buffets until now... The chef recommend som amazing items.... On the section of the menu labeled, South Indian menu, there is an amazing crepe made from lentils, it has different choices for fillings, but it is a must try... I think it's called, dosa... Try it let me know what you think... It is vegan and gluten free as are many things on the menu... Atmosphere is great.... Bring a party here... Could get busy so call ahead... I bet the chef tasting menu is the way to go dinner time!!!"
        }, 
        {
            "index": 265, 
            "rating": 5, 
            "review": "For me, this was some of the best food i've eaten in a very long time.  I don't know why it's getting such a bad rap but here's my experience.\n\nIt's a cozy restaurant with the perfect amount of lighting for a date, which I took my wife.  They have a nice wine selection list.  The service was spot on, we were attended to just the right amount.  \n\nI ordered the spicy lamb curry... and let me tell you, the lamb was so perfectly cooked that it literally fell apart in my mouth and the flavors and textures could not have been better.  I also ordered the lemon rice which if you like rice at all, it's beyond amazing.  Lemon rice + spicy lamb curry = foodgasm. \n\nThere was only one hiccup.  I like spicy food, like biting into a jalapeno hot so I did have to send it back for the chef to add a little more kick.  But that's just my personal preference.\n\nThe only thing that I didn't like is that rice or bread did not come with the entrees.  With that being said, the food was so phenomenal that it's getting five stars from me.  also my wife had some eggplant dish that I tasted and it was fantastic as well."
        }, 
        {
            "index": 266, 
            "rating": 5, 
            "review": "09/16/12 BRUNCH\n\nI have dined here many times. Mostly dinners, a few lunches. It remains my favorite Indian+ restaurant in Las Vegas. It's NOT typical Indian, which is one reason I like it so much. It's a bit more expensive than the rest, but it's worth it.\n\nYesterday Origin India began offering a buffet brunch. Saturdays and Sundays only, from 10am until 3pm, $14.95 per person. I went today, the 2nd day the brunch has been offered. This is, hands down, the best Indian+ buffet I have had in this town. It's on a gourmet level, the way the dishes were prepared. Not too heavy, wonderful spicing, divine. Again, UNUSUAL stuff in this buffet. I had so many favorites. I'm only sad it's not a DAILY buffet!"
        }, 
        {
            "index": 267, 
            "rating": 5, 
            "review": "Really, really, really good food. Just delicious. The staff is attentive, friendly, skilled, everything you'd want. The ambiance was cozy and wonderful. This was our favorite part of the trip. A great restaurant sets up a really romantic date and if you love quality Indian food you will just love this place. Recommend it to anyone and everyone, worth every penny."
        }, 
        {
            "index": 268, 
            "rating": 2, 
            "review": "Came here for some take out the other day and had the ol wtf?! moment when I got home. Here's why...\nThe Cabana Salad with added chicken tikka ($10.50) was disturbingly poor. First off, for it to be even a $8 salad (w/o the chicken added) is insulting. It's similar to a side salad you get at McDonalds (yes, this exists). It even had shredded cheddar cheese on top. I'll repeat this. CHEDDAR CHEESE and chicken tikka. Together. WHY? To boot, the tomatoes were wilted, the chicken tikka was dryer than a popcorn fart and I would comment on the dressing but they forgot to give it to me. So, know this going in, they can't even make a salad right... and it costs over ten dollars.  \n\nThe rest of the meal was a step up (how could it not be?) from the salad. The Chana Masala was average (a bit greasy) and the naan was baamb. \n\nMy advice? Grab an order or two of naan and dip it in your fave sauces at home. Better yet, find a place that makes great naan and something else to dip it in. NEXT!"
        }, 
        {
            "index": 269, 
            "rating": 1, 
            "review": "The worst indian food I have had waste of money,they don't even know how to make basic curry. Bhindi masala was a disaster, they used frozen bhindi and just put crushed cocunut on the dish. Also the lemon rice was one of the worst tasting rice dishes I've ever tried. It was hilarious because the manager was talking about each dish like it was too die for. But in reality, our stomachs were dying. I don't recommend anybody trying this place. I'm sure it will run out of business very soon"
        }, 
        {
            "index": 270, 
            "rating": 1, 
            "review": "Saturday night drove 30 min to get here.  Arrived at 11:15 and when we went inside , waiter said they close at 11:00 when clearly it says on the door 11:30 and they  wouldn't even serve to go order. Waiter said its  because the kitchen is closed too. Seriously ??Why don't they change the signs on the door and online and do the favor to customers by not wasting their time to come to this place but I guess they don't care. So ridiculous. Definitely not going back to this place."
        }, 
        {
            "index": 271, 
            "rating": 5, 
            "review": "It is my pleasure to report that Raja Majid has been honored with the Good Neighbor Award for the State of Nevada from the National Restaurant Association:\nhttp://www.nraef.org/Build-Talent/Industry-Awards/Restaurant-Neighbor/Recipients-(1)#NV\nNevada\nOrigin India Restaurant & Bar\nLas Vegas, NV\n\nThroughout the year Origin India Restaurant participates in a number of fundraisers and events. \"Origin India has continuously donated gift certificates to its restaurant for all of the events where proceeds benefit the Nevada Restaurant Association Educational Foundation,\" says owner Raja Majid. There are several such events each year and Origin India donates $100 every time. \"The company has also offered their venue, services and food and beverage free of charge for events and meetings for attendees of up to 100,\" says Majid. Additionally the company's chefs have taken time to attend teacher workshops and do food demos for instructors to take back to their students. Also, Origin India often hosts political fundraisers for candidates that support the local community."
        }, 
        {
            "index": 272, 
            "rating": 4, 
            "review": "Tasty food.  Quite spicy.  A bit pricy though and they charge separately for everything...as in no rice with main dishes.  The goat special was phenomenal."
        }, 
        {
            "index": 273, 
            "rating": 4, 
            "review": "ORIGIN INDIA\n4480 Paradise Rd\nLas Vegas, NV 89169\n\nMy son and I, who love to try new things and also love selecting favorite ethnic restaurants, have been hitting the Las Vegas India food places.  Most seem to lie in the Tropicana/Paradise area of town.  We tried many of the hole-in-wall lower star restaurants first with not much liking, and now we're trying some of the 4-5 star selections.  Origin India is our third 4-star restaurant to try this week.  We feel our results are better if we compare all of them fairly close together.  We ate here today at about 4pm for dinner service.\n\nThings we are noticing that seem in common for the India restaurants is most service is pretty slow and most food is served lukewarm.  We believe this is a cultural thing with newer restaurants that have opened in Vegas, while the ones that have been here for a long while seem to be Americanizing with better service and hotter temperatures for served food.  But our selections are based on the taste of the food and at least moderate service.\n\nAMBIANCE:  The ambiance of the restaurant was very nice.  The room was large and filled with tables but not crowded together.  A large television set was showing India music videos but it was turned way down so as not to disturb diners.  The tables are set up to show off a little elegance with cloth napkins.  It looks extravagant but yet the prices are not extravagant.  We arrived at 4pm and it was 103 degrees outside, yet inside it was very cool.\n\nSERVICE:  I prefer service with a smile.  It's nice when it looks like the workers enjoy their place of business.  Our hostess/waitress smiled and was very pleasant.  Our waiter/check bringer didn't smile but did provide refills in a timely manner.  Surprisingly, the food was served quickly compared to our other experiences where it took over thirty minutes to receive the first of several dishes.  Our food came out at the same time along with the appetizer.  And the food was a little better than warm, certainly not lukewarm as we usually expect and receive it.  It wasn't hot but it was much warmer than we've been receiving it in other India restaurants.\n\nFOOD:  For drinks we had water and tea.  I asked about flavored teas but was told they only had regular ice tea.  The tea was fresh and good.  We ordered Keema Nan ($4.95) which is naan bread stuffed with ground lamb.  Sorta like a flat bread but the lamb was inside the bread.  Delicious!  I ordered Chicken Karahi ($15) listed under chef's specialty low spice heat which is boneless chicken stir fried with bell peppers and onions with a thick tomato paste-like sauce.  My son ordered Lahori Goat Korma ($15) high spice heat which is goat braised in a spicy ginger-garlic sauce and finished with fried onions and yogurt.  The food was served family style filling two five inch round bowls about three inches deep, to over flowing.  The Chicken Karahi was delicious, only mildly spiced just as I asked and had a surprising amount of meat in it compared to most orders we've requested.  The Lahori Goat was bland.  We tasted neither ginger or garlic.  It was laced with small bone pieces which made it difficult to eat, and although it was selected for top spiciness, my chicken was spicier than it.  Also the Goat did not come with fried onions or yogurt.  Although I doubt that would have helped the dish.\n\nThe total for the meal was just over $28 (not including tip) since we used an Entertainment Book coupon for $15 off.  So the prices were good, but the food was hit and miss.  Plus they did not offer \"Buttered Chicken\" which I was hoping to try."
        }, 
        {
            "index": 274, 
            "rating": 5, 
            "review": "Excellent food and service!  Our waiter Abel was able to recommend dishes they fit our tastes.  Great recommendations on beer. New biryani dishes that are very tasty!"
        }, 
        {
            "index": 275, 
            "rating": 2, 
            "review": "The atmosphere is nice. The food is on par with other Indian restaurants. The price is very high compared to Indian restaurants in my home town. The rice and Naan come separate. I had a table of 4 and they charged a 10% service charge and did not mention that this would happen. The restaurant was empty, but the service was very slow."
        }, 
        {
            "index": 276, 
            "rating": 4, 
            "review": "I never considered myself a fan of indian food until I went here...  we experienced great service the moment we walked in the door.  I am big on service, if you have great food and have bad service then you have bad food in my opinion, because I wont come back.  ( I always seem to venture off on some sort of rant)  I was extremely impressed with all of the dishes we ordered.  I will definitely go back.  :)"
        }, 
        {
            "index": 277, 
            "rating": 1, 
            "review": "Worst Indian food.. Might be good for Non-Indians who doesn't know Indian food.please don't order Goat items.. They will serve Lamb and never agree that it's goat"
        }, 
        {
            "index": 278, 
            "rating": 5, 
            "review": "The best Indian in Vegas, and perhaps the best I've had in the US. Came here for countless work lunches (they have great specials, Dosas, etc) as well as dinners with my wife. \n\nService was always exceedingly friendly - waitresses remembered us, talked us up, etc. \n\nIt's a bit pricey, but worth it. Just really great cooking in a cool trendy ambiance that feels light years away from the tackiness and sleaze of the Vegas strip."
        }, 
        {
            "index": 279, 
            "rating": 5, 
            "review": "Everything was amazing!!! I purchased a groupon for this place to try out and will be going back and paying full price!!!"
        }, 
        {
            "index": 280, 
            "rating": 5, 
            "review": "Went there the other day with friends.  Great pag saneer; very good chicken and lamb dishes. Very good samosas.  Great naan.\n\nThe service was friendly, attentive, and warm.  Plus, it didn't feel like Vegas inside, which was, frankly, a huge plus. I have to agree with David C's assessment, when he wrote, \"First time eating here and I have to say 'I'm coming back.' I finally found a Indian Food restaurant, I will continue to go to. It's a bit higher in price for certain foods; however, well worth it.\" \n\nI'd go back."
        }, 
        {
            "index": 281, 
            "rating": 1, 
            "review": "First of all, I'd like to say Origin India does have GREAT food, their food is delicious, but, my desire of going back quickly vanished after getting to know how HORRIBLE their SERVICE was. It was the second time I went to the restaurant (Why? because I liked it the first time) so I brought 3 of my coworkers in the second time along with a coupon from Origin India, and here's exactly what the coupon said \"Buy one entree, get another one 50% off, Max 4 people\", so we have total of 4 entree that day, I'm 100% sure everyone here who read the coupon might think that we will pay two entree full price and get the other 2 entries half off since we ordered 4 total, but to my surprise, two waiters were arguing against me saying they only take one entree half off regardless of how many entree we have, but wait a minute, nothing on the coupon says there's a limitation, so that is when I know how LOW they treat their customers, they think we are stupid and can't read the coupon, I got frustrated and decided to be nice and pass along the coupon next table, and then the waiter immediately took my coupon away and said \"Sorry the coupon is not transferrable\", WOW, just WOW, long story short, we will NEVER EVER go back there again because of the horrible service, we will go to Ghandi instead, which is one block down from it, they have good food and good service and kids eat for free there too."
        }, 
        {
            "index": 282, 
            "rating": 4, 
            "review": "Saw it on Yelp and had to go try it out ^_^\n\nI have no idea what I ordered (just had to be something without yoghurt... even though I really wanted the lamb).  My friend got chicken tandoori, which came accompanied by some naan YUM, who would've known that the stuff in Trader Joes is nothing compared to the bread here! \n\nThe food presentation was nice, the restaurant itself was not crowded (we went in the 'tween lunch-dinner hour).  \n\nThe bathroom was clean, smelled good, and looked safe. yah yah (you're thinking weirdo....)"
        }, 
        {
            "index": 283, 
            "rating": 1, 
            "review": "Ok guys, I am an Indian and consider myself a connoissuer. My wife and kid keep complaining I am never happy until I find some decent Indian food. I can tell you this place sucks, the quality and taste of food, that is. The place is clean, good decor and all but the choice of food and the taste is terrible. You maybe impressed if you are a non indian but I wanted people to have an idea what another Indian thinks of it. I usually do not write negative comments but I feel this place should work harder at dishing out some decent Indian food and not rip people off. Almost everything tastewise was awful, I am sorry to say."
        }, 
        {
            "index": 284, 
            "rating": 2, 
            "review": "Caveat: my parents were in the restaurant business in Los Angeles when I was a kid. In the Indian food restaurant business. I know my Indian food. I know what's good, what's not so good. Years ago (like 5), I went to Origin India and was blown away by the food. It set the bar for Indian food in Las Vegas. \n\nI took my daughters (7 years old) to Origin India a few weeks ago. Figured it's time they're exposed to their peoples' food. The place still looks the same (which is quite nice, actually). The gentleman who waited on us was very friendly. He even brought my daughters out free Mango Lassi's. The lassi's were delicious. Reminded me exactly of those served in my parents' place in LA (now long gone). \n\nFor the kiddos, I ordered plain Naan, tandoori chicken and plain rice. For myself, the vegetable biryani and lamb vindaloo (my favorite dish in the world when done right). And a Kingfisher, which if you haven't tried it, it's a fantastic beer!\n\nOverall, I was pretty underwhelmed by the food. \n\nThe naan seemed flatter than it should be but tasted good. The tandoori chicken was a little on the dry side. Not unlike that you'd find at an Indian food buffet. \n\nThe vegetable biryani was a complete disappointment: mushy rice, too wet, soft and flavorless (probably canned) vegetables. \n\nThe lamb vindaloo was not good. It kind of tasted like vindaloo but mostly didn't. It's hard to explain but the flavors just didn't seem developed enough. You could tell there were spices and flavors in there but they just weren't coming through. The funny thing is, when I took the leftovers out of the fridge to eat the next day, the sauce tasted a 100 times better. I'm guessing the vindaloo sauce wasn't allowed to mix and marry for some time like it needs before being served. \n\nDespite really friendly service, we won't be back."
        }, 
        {
            "index": 285, 
            "rating": 5, 
            "review": "Origin India was great ... has a very upscale feel. I tried the Lamb and had the grilled shrimp for appetizers, both amazing. The service from the waiters was also great very friendly social people. The bartender has some very creative specialty drinks that i couldn't get enough of. Im a mexican guy from Los Angeles wasn't to optimistic about this place at first but I left very satisfied. EAT HERE"
        }, 
        {
            "index": 286, 
            "rating": 5, 
            "review": "Love this place. I was a skeptic at first but trying if your trying Indian for the first time this is a great start. \nThe black pepper chicken is perfect, I now go 2-3 times a week"
        }, 
        {
            "index": 287, 
            "rating": 4, 
            "review": "Ghandi was equal to if not better than any Indian eatery in Houston. Extremely polite and efficient service of fresh and tasty fare.\nDon't pass on the lamb Korma.  However, you might opt for the mild version. The quantities are massive, so you might consider \"family style\" and share entres."
        }, 
        {
            "index": 288, 
            "rating": 4, 
            "review": "Fabulous food by a rising star chef, who is cooking at a James Beard dinner in New York in February. Starting with the papadum, the meal was excellent. Everyone at a table of 8 raved about their food. I had the lamb kabob appetizer, which had just a hint of ginger which took it far beyond most kabobs, which can be dry. The chef recommended the long-cooked lamb shank,which none of us had, but we saw it as a nearby table and it looked fork-fall-apart. Also had the chef's version of eggplant bharta, which they call \"pressed eggplant\" as a side. It was a little too hot, probably my fault because I asked for spicy. All told, a wonderful value. Make sure you try the Monte sauvignon blanc from Chile, a steal."
        }, 
        {
            "index": 289, 
            "rating": 5, 
            "review": "This place is great! Food is amazing. They have a really reasonable lunch buffet as well."
        }, 
        {
            "index": 290, 
            "rating": 4, 
            "review": "I was in town on business and my uber driver recommend this restaurant.  The food was really good and fresh and they accommodated my level of spiciness.  The customer service was excellent!!"
        }, 
        {
            "index": 291, 
            "rating": 5, 
            "review": "Excellent food, best Indian/Pakistani food in Las Vegas! Highly recommended to anyone who is looking for a great meal in Las Vegas. They also offer catering and give an amazing discount to ensure they meet your budget. Owner Majid is very friendly along with the rest of his staff."
        }, 
        {
            "index": 292, 
            "rating": 5, 
            "review": "Had the opportunity to enjoy at the CES in Las Vegas the Service was extremely friendly and professional. Excellent job of explaining dishes to first time Indian cuisine enthusiast. The owner is Rajah was amazing and interactive. The dishes I had were not what I expected can be extremely spicy if that's what you like, they have no problem fixing it for you.  It was so good I went back for second later in that day. Looking forward to try there Restaurant."
        }, 
        {
            "index": 293, 
            "rating": 4, 
            "review": "I love this place! Romantic, sexy, great staff, and the food is delish! Definitely my go too spot in Vegas for Indian food!"
        }, 
        {
            "index": 294, 
            "rating": 4, 
            "review": "One of my Favs! Absolutely! They make this Spicy Shrimp Dish - it used to be available as an appetizer, but now it's offered as an entree. Yummy... I luv it!"
        }, 
        {
            "index": 295, 
            "rating": 4, 
            "review": "Food was great. The sauce in the dishes was surprisingly filling. Service was wonderful and professional. Overall it was a nice experience but overpriced."
        }, 
        {
            "index": 296, 
            "rating": 3, 
            "review": "Origin India used to be one of my favorite restaurants in Las Vegas, but over time, its rising prices and worsening service have pushed other Indian joints far above it. A visit today was the final nail in the coffin for my girlfriend and I, who both decided we'd probably not be coming back much anymore.\n\nLet me get this out of the way: the food is still good, generally, the atmosphere is upscale-but-comfortable, and the service is professional and courteous. But ... \n\nThe menu has been changed recently, forgoing names of dishes for lengthy descriptions that make finding what you want a challenge. It seems like a deliberate effort to Americanize/fancy-up further the menu. As well, the leaning toward the gourmet seems to have pushed up the prices yet again, as the restaurant offers nuanced, fusion fare beyond Indian-spawned dishes. The gastronomical experiments may please foodies. The deviations from the traditional do not please this eater, however.\n\nOne of our favorite items at Origin, regardless of anything else, has always been the vegetable samosa, an appetizer staple. But on this recent visit, the restaurant's traditional purse-shaped, doughy treats were replaced with thin, triangular samosas, similar to what Trader Joe's sells frozen, only not as good.\n\nThe service was slow (though it always seems to be slow at Indian restaurants for some reason, so that may just be a cultural difference in pacing), but it took extra long to get things like drink refills, despite a relatively calm lunch time, and when we presented a gift card to pay for part of the meal, it took about 10 minutes and two people to figure out how to get it to work.\n\nWhile, as I said, the food, and slowness aside, the service were both good, the price point has become too high for a casual meal, and the change in samosas? Unforgivable. For us, at least."
        }, 
        {
            "index": 297, 
            "rating": 4, 
            "review": "Great food, Exclnt. service. I seem to now be hooked on the chicken and the garlic naan. I will be back."
        }, 
        {
            "index": 298, 
            "rating": 5, 
            "review": "We're fairly new residents of Vegas from the northeast and have been looking for good Indian. We went earlier on a Sat night and the service was extremely attentive. Waiter answered all of our questions and the food came out quickly and was hot. We shared Dal Bukhara and chicken Makhani. The Makhani was a little sweet for me but the Dal was delicious. Yes, you do pay for rice and bread but in Vegas, where it seems good Indian food is scarce, it's worth it for us. We'll be back."
        }, 
        {
            "index": 299, 
            "rating": 4, 
            "review": "This is the first time I've ever had Indian food and I liked it a lot. My boyfriend had a restaurant.com certificate so came in on Saturday night to have dinner. There  were maybe 2-3 other tables the whole time, which is sad because it's really nice inside. \n\nWe ordered the lamb skewers for an app, and then I ordered the HYDERABADI CHICKEN and my boyfriend ordered the Chicken Mukhani. Our server brought us an app but it wasn't the lamb and we didn't know until after we ate it. It was this spicy chicken and apparently the server accidentally sent it to the wrong table. They were super nice and told us to enjoy it and then they brought our lamp app out. The lamb was actually lamb patties, not skewers, and it was just ok. The chicken app we got on accident was delicious but very spicy.\n\nBoth of our entrees were simply chicken in a curry-type broth and then we got a side of rice. My entrée tasted exactly like this Thai curry that I make at home. LOL. I LOVED it! Honestly, my boyfriend's entrée tasted very similar as well, with less of a coconut taste. We were stuffed by this point since we had two appetizers, so we had a lot left over to take home. \n\nThe service was good and we got our food fast. It's a fun little date spot."
        }, 
        {
            "index": 300, 
            "rating": 1, 
            "review": "They need better service for the high prices. But this is Vegas. Will not come back. The food was good, just not worth the price. Maybe the buffet is a better deal."
        }, 
        {
            "index": 301, 
            "rating": 4, 
            "review": "I'm going to trust my Indian friend Nakul who travels back and forth to the states and India often that this is good food. He took me here and I was astonished how much I enjoyed the flavorings, nothing too over powering and the taste was great. Service was prompt and for lunch it is a great inexpensive place to go. :)"
        }, 
        {
            "index": 302, 
            "rating": 4, 
            "review": "Hands down the best Indian restaurant in Las Vegas. Their Tikka Masala is incredible and everything I've tried there is equally delicious.  Their super knowledgeable and caring staff have made every visit (Im a long time Vegas local) a real joy. Their large selection of regional Indian specialties and vegetarian dishes is both extensive and creative. \n\nThe lunch buffet is of just as high quality as the dinner menu to the extent that it almost seems a shame to call it a 'buffet' by the standard Las Vegas definition. The location is also great- smack in the middle of town 5 mins from the LV Strip, from the airport and also from the Convention Center. \n\nThe owner Mr. Majid is also a tremendous philanthropist and supports numerous community organizations and world causes through hosting benefit dinners and community events at his restaurant. \n\nWhether you're a giant fan of Indian fare or just into trying new things, this place is a must - visit for locals and visitors alike."
        }, 
        {
            "index": 303, 
            "rating": 4, 
            "review": "Wow, I'm blown away, could well be Las Vegas' best Indian! :)"
        }, 
        {
            "index": 304, 
            "rating": 1, 
            "review": "This is one of the ridiculous Indian restaurants in Las Vegas. Five of us went for the buffet during July 4th. There were only a very few items in the buffet and there is a big sign  \"Use bowls only for dessert\" near the buffet. The service was bad. I looked around for the dessert out of curiosity and found only one very cold item and that is just Kheer and that's the only ONE item in the dessert.  OK, I started taking the curries and asked for Naan. It took 20 mts to get the Naan and by that time we were almost done with eating. Besides, to our surprise, we saw only 4 small pieces cut out of one plain Naan and five of us had to eat. I called the server and asked for Garlic Naan who responded immediately that it has to be ordered from the menu and it's not part of the buffet. With lots of frustration and agony, I gave the card for the check. The cunning staff had a portable credit card scanner who stood next to me to process the card. The scanner displayed tips options with 21%, 18% and other adding more fuel to my anger. What a crap... Normally I am generous in giving tips. And for this lousy buffet and egregious service, they had to give money back. This restaurant has to be banned."
        }, 
        {
            "index": 305, 
            "rating": 4, 
            "review": "This is my go-to Indian place.  They have deals on Groupon most weekdays--$15 for $30 worth of food.  That's more than enough during lunch when they have their lunch specials: 2 appetizers, 2 main dishes and 2 desserts.  During dinner, I use that to order my usual: Veggie samosas, Chicken Tikka Makhani, Basmati rice and 1 side or dessert.  Very filling!  The samosas here are well made and not as greasy as other Indian restaurants make them.  \n\nThe manager is a very nice guy!  He remembers us each time we visit.  I had bangs then no bangs between 2 visits and he didn't want to say, \"Welcome back!\" to my boyfriend because he thought maybe he brought in another girl!!  I found it hilarious.  So the manager has your back, haha.  The wait staff is very prompt w/taking your order, refilling drinks and getting the check to you.\n\nPricey w/o deals from Yelp or Groupon, but still worth it either way."
        }, 
        {
            "index": 306, 
            "rating": 5, 
            "review": "Origin India is a hidden gem that you have to try out if you're ever in the area.  Came here for lunch today and was exceptionally pleased with the food.  I opted for the buffet because I was in a hurry for a business meeting.  Nothing disappointed.  I had rice, salad, chicken, goat curry, vegetable soup and Mango Lassi for my drink.\n\nI particularly enjoyed the vegetable soup the most and it actually really helped clean out my sinuses with the nice spicy kick after each bite.  I honestly believe it's helped me breath easier today...not habanero hot, but good enough for the taste buds to get a buzz.  Service was just as good and the staff are exceptionally friendly.  Will come again."
        }, 
        {
            "index": 307, 
            "rating": 4, 
            "review": "Service is great. We'd came in almost closing time, and they still sat us down. The one called pappit? isn't very good here. too salty. Their garlic nuns are good. chicken mahktai is great. Crushed eggplant  also very good. Place has nice decor, but a little bit pricey."
        }, 
        {
            "index": 308, 
            "rating": 3, 
            "review": "I've been to this restaurant multiple times before and had amazing meals, but the buffet was not as good as the meals we've ordered before. The biggest problem this day was the service. My husband's lassi was supposed to take \"6 - 7 minutes;\" it took 25. The server forgot my glass of wine. When we got the bill, the mango lassi was supposed to be free because I checked in, but there it was on the bill. Maybe we just need to get a different server, but I was disappointed based on my previous visits."
        }, 
        {
            "index": 309, 
            "rating": 1, 
            "review": "Tasteless food and bad service\nThe only thing this place seems to be good at is adding all sorts of silly charges to bloat up you cheque."
        }, 
        {
            "index": 310, 
            "rating": 2, 
            "review": "so we went here because we had a desi food craving. unfortunately this was not fulfilled at all. the place has good decor/atmosphere and the service is professional and friendly. however the food does not do justice to the name \"origin india\" - maybe they are better at meat dishes than vegetarian but their kofta was basically all potato and not tasty. the food was bland and i would not go back there to eat. however they do have a wide selection of beer which was intriguing because its not the typical stuff you find - mostly belgian.. so if you do end up here then ask about their beer selection - its the only tasty thing i had there!"
        }, 
        {
            "index": 311, 
            "rating": 5, 
            "review": "Reviews for Origin India are all over the map -- from gut-busting to orgasmic. I suppose consistency is important, but the restaurant is only 2 years old, and they've gone through a number of adjustments which may account for the fluctuations in quality. All I can speak to is what I ate, which was superb -- the best Indian I've had in Las Vegas, everything tasted fresh and not too heavy, like some Indian food. I suppose it helps that I was dining with one of the owners, who talked to me about the idea behind the restaurant: to mimic the Indian restaurants in England (2 of which they own) and use fresh, high-quality organic ingredients. She'd kinda hyped it up so much that I was dubious until the food came and spoke for itself. \n\nWe had some mussels seasoned with Indian spices and coconut milk. I don't usually like mussels, but these were delectable. Everything else surpassed expectations. Naan was piping hot, doughy, and fresh out of the oven. Chicken makhani, the crowd favorite, pleased my palate like a good Indian curry should. The garlic shrimp curry, fish kabob, and lamb curry were equally fantastic. Kinda expensive, but helps when you're not paying! Also very dark inside, but who needs to see when the food is so kick ass?"
        }, 
        {
            "index": 312, 
            "rating": 2, 
            "review": "I was craving Indian food. So I googled Indian restaurants. This place had a good rating so I thought I'd give it a try. \n\n  There palak paneer was really spicy. Didn't like it. Very disappointed. It's not suppose to be spicy. Palak Paneer is my ultimate favorite Indian dish! So I was sad! My husband got the chicken tiki masala. Not realizing its $16 just for chicken in masala sauce!!!! It was good. Chicken was a little tuff though. $16 for that is just ridiculous!!! Tried the lemon rice and it was terrible! No flavor and way to many poppy seeds! Who wants seeds in there rice!? not me. Tried the garlic \"nan\" (tortillas) that was good! So for two dinners w/rice and tortillas we spent $45. That is just outrageous!\n\n food is not that great. PRICES ARE RIDICULOUS!!!! And it's far from my house. Won't be going back!"
        }, 
        {
            "index": 313, 
            "rating": 4, 
            "review": "Best samosa ever!  I was really impressed by this place considering its tucked in a strip mall.  We stayed at Hard Rock Hotel and just crossed the street to dine here.  It was really delicious and clean."
        }, 
        {
            "index": 314, 
            "rating": 1, 
            "review": "Mediocre food and the worst attitude I have experienced in a long time. \n\nWent for dinner on July 3 and ordered 4 Biryanis which were OK but the Raita which came with it was good for one Biryani. When pointed it out they said that's the standard quantity so we ordered more Raita, no Problem still. Ordered some desserts but nothing great there as well. Gajar Halwa was too sweet and luke warm, Ras Malai pieces were broken (happens if they are not fresh) and was not cold as its supposed to be. When the bill came it had few (4-5) items we didn't order. Thankfully my buddy caught it and when he pointed out to the manager he was not apologetic at all and behaved as if he is doing us a favor by correcting his mistake.  \n\nAnyway next day we saw a deal on Groupon next day so we thought lets give it another shot and try their Buffet.  We were a big group so bought two different coupons and they said one coupon per table. We offered to sit on two different tables but the waiter smiled and said it's ok and pointed us to a big table.The spread was good but the food was again OK and very heavy, one positive was that they brought fresh Nans to the table which were soft.  When the waiter got us the bill they again said that they can't accept two coupons. We called the manager and he said \"I am not sure what the waiter said but I see you sitting on one table\" . I don't mind these small things usually but its the attitude that sucks, forget about accepting the coupon there was no apology in case the waiter created the confusion. This is the level of service when they saw us second time in two days .\n\nBottom line didn't feel that the management/ staff is courteous and and the food tastes edible but is pretty greasy and heavy. May be try another Indian restaurant next time."
        }, 
        {
            "index": 315, 
            "rating": 5, 
            "review": "We found the restaurant using the Yelp iPhone app.  My girlfriend and we always I make it a point to try out a local Indian restaurant when we're away from home.  We've been to Tamba in the past for buffet and it was ok.  We were greeted warmly when we arrived by a well dressed host for a Friday night dinner.  We were expecting another hole-in-the-wall join but to our surprise, the ambiance was fantastic.  Dimly lit, very elegant.  Apparently the restaurant is modeled after their restaurants in London.  I played it safe with a Chicken Tikka Masala dish.  They got this right, and MORE.  I literally licked my plate clean because the sauce was so delicious.   It was that good.  The bartender, the waitress, the host, AND even the chef took a moment to stop by at our table throughout the evening to check in on us.  I was really impressed by the service.  It  is so uncommon to see, especially at an Indian restaurant.  The customers at the time of our visit were a diverse group of people, with an Indian family at the large round table in the corner.  Overall, I would highly recommend this place to those who are visiting Las Vegas and love Indian food.  Origin India is clearly in the running for best Indian cuisine in Las Vegas.  You will be delighted by their service and will enjoy the food.  If you're reading this on your iPhone, just go.  Get directions from your currently location now!"
        }, 
        {
            "index": 316, 
            "rating": 3, 
            "review": "I guess this is the French culinary approach to Indian cuisine: very light and delicate flavors. Compared to the more rustic Indian restaurants I've encountered, I would say the food here is bland. But if I had no point of reference from which to stake a comparison, I'd say the food is tastefully seasoned.\n\nI started with the grilled paneer tikka appetizer: a mildly seasoned tower of fresh cheese. I loved getting little flashes of char from the grill on my tongue. The tikka sauce was sparingly placed on the plate. It was satisfying yet light, and also not terribly flavorful. I had the chicken tikka makhani as my main course. Paired with the garlic naan, it turned out to be tasty, but once again lacked any real punch.\n\nThe dining atmosphere is quiet and elegant with a pleasantly minimalistic decor. I would eat here again. The menu options are unique and I'd like to explore them a little further. However, I left the restaurant feeling slightly ambivalent about the food. Maybe one of these days I'll drop back in: after I've forgotten how unmemorable it was."
        }, 
        {
            "index": 317, 
            "rating": 4, 
            "review": "Origin India always tastes great! It's a little pricey, but they always have a Groupon so check that out first."
        }, 
        {
            "index": 318, 
            "rating": 1, 
            "review": "I met some friends here for a birthday dinner.  My first impression of the restaurant was questionable.  While I like the music and earthy tones used in the decor.  I didn't like the cheap decorations and hanging fake candles.  The chair and table combination made me feel like the table was at my throat.  \nOnce we were seated it took a unreasonable length of time to get water much less drink service.  Water was finally served at the time they took our order. Which was probably about 30 minutes after our arrival.  Our order was taken by a waiter who insisted there portions were very \"generous.\" \n\nThe presentation of the appetizers was very nice but not very high on the taste factor.  I can't remember what it was that I had ordered.  Our main curse arrived in a series of small bowls.  The rice and naan were both tasty but the portions were disappointing.  Rice and naan are cheap to make and shouldn't be given out so limitedly.  I again can't remember exactly what I ordered but the food overall was highly disappointing.  The only item I can remember eating because it was probably the best of all 6 different dishes we ordered was the curried chicken.  While better than anything else we had it was still not great.\n\nAfter dinner was served is when things really went down hill.  Our server seemed to have died.  Everyone at the table ran out of water about half way through dinner and never got a refill.  It took another hour to get the bill during witch time the buser passed our table repeatedly with the water pitcher and ignored us as we tried to wave him down.  Even with money in hand trying to pay the bill we were ignored for sometime.  I was very please to walk out of Origins 2.5 hours later, not because I was satisfied but because I hated every minute I spent in the place.\n\nOn one final note they were not busy this night.  Our table was one of about 6 with patrons.  The food was instantly forgettable and the price was way to high.  Hands down worst service in Las Vegas.  I will not return to Origin ever again."
        }, 
        {
            "index": 319, 
            "rating": 4, 
            "review": "Took two steps off the plane and went straight here for dinner to meet friends. Being from a smaller area where Indian food is hard to find, I was impressed. The restaurant itself has a great decor and ambiance. The food was yummy too, large portions. A very enjoyable experience."
        }, 
        {
            "index": 320, 
            "rating": 4, 
            "review": "Food was exceptionally good!  The buffet had a decent selection, loved the goat curry and tandoori chicken especially.  The staff is prompt and friendly. Will be coming back here the next time I'm in Vegas."
        }, 
        {
            "index": 321, 
            "rating": 2, 
            "review": "So begin in Las Vegas for the first time ever, and being a lover of Indian food, decided to check out this place as per recommendations of fellow yelpers and a great review in the VEGAS magazine. Well... Brace for it.. It was horrible!!!! \n\nFirstly, the decor left alot to be desired. If your going to be in the restaurant business in Vegas, you really have to great decor, something visually appealing. Trust me the photos posted on the website make it seem like its nice...its not. After visiting many restaurants on the Strip, this one had me thinking \" wow..this looks plain\". Even though its off the strip, I have seen mom and pop shops that look better than this, however I was still interested to see how the food was.. \n\nThe dishes we ordered were as follows: New Zealand lamb shank..veggie biryani..punjabi khadi..paneer tikka masala. The best of all these was the Lamb Shank..the meat was quite tender but the curry felt like it was just warmed up, didn't taste fresh at all. The veggie biryani was kinda sticky, not very flavorful. The punjabi khadi was horrible! It was so salty we had to send it back, after the waiter tasted it himself he agreed, the salt was overkill. Paneer tikka masala was your standard fare..nothing stood out. I would have to think that maybe the owners think they can get away with serving sub par indian food, since Im sure this restaurant doesn't get many people of indian origin visiting. \n\nSo to sum it up, I have got to believe that Vegas has better indian food than this place. I'm quite shocked at all the positive reviews from some people! Maybe next time I will go to Gaylord Indian Restaurant at Rio."
        }, 
        {
            "index": 322, 
            "rating": 4, 
            "review": "Good naan and Punjabi veggies. The restaurant was nice and staff was friendly."
        }, 
        {
            "index": 323, 
            "rating": 4, 
            "review": "I came here for dinner for a birthday party.\nThey were very accommodating, the restaurant decor was nice, their food was good, and prices were reasonable.\n\nI'd certainly come back  here as it was a very pleasant dining experience, but from the 6 dishes I tried that night nothing really stood out as amazing.\n\nI can easily recommend this place to others looking for a good Indian restaurant to eat at, I just don't have a dish that they \"must try.\"\n\n(Does that make sense?)"
        }, 
        {
            "index": 324, 
            "rating": 2, 
            "review": "PLEASE SEE Way below for the original review, originally was rated 1 star.\n\nThe manager attempted to contact me after my review & here is the message. I do give them credit, hence the upgraded 2 stars for actually listening to their guests and attempting to make things right. But in all honestly, I was burned too many times to consider going back.\n\n\n\nGanesh M.\n \nOne month ago\nHello Ma'am my name is Ganesh and I'm the manager over at origin India. I read your review about our restaurant and to be honest with you this is the first time I am hearing about this situation. Did you get the food delivered or did you pick it up from the restaurant. If you picked it up from the restaurant would you be able to describe the person that took your order? It seems strange that I have no recollection of anyone letting me know about these situations for I would have corrected it. We would like to get to the bottom of this situation because it is very damaging to our restaurant if this situation has happened. We would like you to come back and give us another chance for us to change your mind about our restaurant. Thank you for your constructive review and please visit us soon.\n\n\n_______My response:\n\nJen C.\nSir, I appreciate your response. And I always feel horrible giving a business a bad rating, but it's a constant & consistent problem your business has. \n\nI've been to your restaurant MANY MANY MANY times and literally every single time the service was horrible!!! So I started to do take-out and then even the take-out was just a joke. \n\nSo that's why I will not come back to your establishment which really sucks for me because I think the food is terrific! \n\nOne note I will give, is one of the many times visiting, I attempted to use an opentable check, which is just like a travelers check. Which you are supposed to accept since you are on opentable.com\nThe servers and supervisor that night had no idea what it was and refused to take it. That was one of my many disappointing trips in. For future, I would suggest you educated your staff on ALL payment methods.\n\nThanks."
        }, 
        {
            "index": 325, 
            "rating": 5, 
            "review": "The service has been great both times we have visited and the food is consistent and flavorful! We will make sure to visit whenever we get to vegas!"
        }, 
        {
            "index": 326, 
            "rating": 4, 
            "review": "The food was excellent.  Mysis in law had chicken tikka masala and said it was excellent.  My husband and I had the Baigan Dahiwala.  I'm a wimp and ordered it at 0 heat.  They did an excellent job of doing spice without the heat.  It was delicious!  The garlic nan was good, but the onion kulcha was exceptional.  \nThe service was less than stellar, but the food compensated.  The food at our table was overall a thumbs up."
        }, 
        {
            "index": 327, 
            "rating": 4, 
            "review": "Dinner last evening on a hankering for Indian. Excellent service.  Creative menu. Extensive Scotch selection."
        }, 
        {
            "index": 328, 
            "rating": 3, 
            "review": "Eh-ish. \n\nI will say this - most of their food was good, but in my opinion, it was very overpriced for a reason unknown to me. I think sometimes it's because it's closer to the strip?? We paid almost $200. That's a lot of money in my opinion. I have a hard time with it because I can get just as good Indian food in a 100% comparable location nearby.\n\nWe came here on Friday night with some friends. We had 4 dishes, 2 appetizers and 5 drinks total. \n\nWe had  -\n\n3 beers\n1 wine\n1 Martini\nStuffed mushroom - Very weird for me. It was a very blunt taste of curry, yogurt and a uncooked mushroom that was breaded.\nSaag Paneer - Very good\nShrimp Tikka Masala - Sauce was very tasty and rich. \nLamb Rogan Josh - The sauce was okay. I felt they used a little too much curry and it over powered the dish with that and nutmeg.\nChicken Mukhani - We actually don't think this was the right dish. It came out and the sauce didn't taste like it normally would for chicken mukhani. It was a bit thinner and not thick like butter chicken typically is. \nLamb Vindaloo - good flavor, nice and tender meat. \n\nOverall - the service was not good. It took us over an hour to get all of our food. Mainly because the waiter was not coming around to ask if we were ready to order. It was not busy, maybe 5-6 tables total. On Friday nights at 7, it's packed at a lot of places. So, that could be a sign if they're not busy. \nAgain, the food was good - not amazing for a pricier menu. The location and the building itself does not call for higher prices. Neither does the service."
        }, 
        {
            "index": 329, 
            "rating": 5, 
            "review": "Surprised that this place has only 3.5 stars. I wish CA had a restaurant as good as this one.\n\nVery creative menu, awesome food, artistic presentation.\nOnly drawback is that lunch is only buffet and there are few to no veg items. \nA la carte dinner is good and is the only option to order veg items. \n\nThis place is no gamble, you are a winner!"
        }, 
        {
            "index": 330, 
            "rating": 4, 
            "review": "If your looking for Indian food with flair, this is the spot! The decor was beautiful and plush, the service was excellent, the background music was soothing and the food...Delicious!  I ordered the tasting menu which gives u a variety of meats and veggie dishes, curries, etc. It also comes with a gorgeous naan basket and traditional accompaniments. \nThe price is a little high but well worth it!"
        }, 
        {
            "index": 331, 
            "rating": 2, 
            "review": "The food really wasn't that great. The chicken tasted microwaved in the chicken curry dish we ordered. The customer service was dismal as well. They were pretty restrictive on their yelp check in offer. My wife and I usually split entrees. We were required to each order an entree. Most resorts in Vegas don't offer a fridge. I hate throwing away leftovers."
        }, 
        {
            "index": 332, 
            "rating": 3, 
            "review": "To continue with my exploration of Indian lunch buffets around town, I invited a friend from UNLV to check out Origin India's version.  My experience at Origin India prior was limited to one visit for dinner years ago which I was completely unimpressed with the flavors (or lack thereof) that I experienced then, but I was willing to give it another shot due to my having experienced much more Indian fare since then (I pretty much guessed what I wanted on that visit), and plus my Currygeous Indian Eats list here on Yelp demanded it!   Pro tip: it never hurts to plug your own lists or reviews within other reviews.\n\nUpon entering, the dining room looked as nice as a I remembered it, and there were only a few other tables with diners which was a stark contrast to what I'm used to at Mt Everest or Mint.  Origin's buffet offering is new, so perhaps this will change over time.   In addition to less customers, another big difference was in the options of food.  I don't know exact numbers and maybe it was just perception, but it seemed like Origin had quite fewer dishes available than Everest or Mint.  \n\nI've adopted a \"one plate\" rule with Mt Everest and Mint due to severely overstuffing myself each time if I don't, but Origin's plates are decidedly smaller so I allowed myself one return visit to the food offerings on this occasion (I'll use any excuse to eat more).  On my first plate I had some rice, chili mint chicken, some potato dish, goat curry, and a dish made mostly of peas.  I thought the flavors were quite nice on each one, but particularly was fond of the chili mint chicken.  It had quite a kick to it which I enjoyed and the chunks of chicken were nice and juicy, and this was all while having scooped out the last of what was in the tray in the buffet line.   This brings me to one of the issues I had: 15 minutes after originally going up for the first plate, I went back up and the chili mint chicken had still yet to be refilled.  Now normally in a buffet filled with a plethora of offerings, one item missing wouldn't be so bad, but with the shorter list of options and what is clearly one of the more popular items, I thought it was inexcusable it wasn't constantly being filled.  In fact, I didn't see a lot of freshening up of the options while I was there.   One could argue that due to the lack of customers perhaps not many of them needed more, but it would have pleased me much more to know that I was likely to be eating freshly prepared food than ones that could have been sitting out for some time.  I'm willing to excuse this a little given that they're new to the buffet game, so hopefully this improves over time.   \n\nMy 2nd plate since there wasn't any chili mint chicken to add to it ended up being fairly sparse with just some more rice and a couple curry options I hadn't gotten to try originally.  They don't have any sort of helpful guides on the dish name cards to let you know which ones are vegan/vegetarian friendly so proceed with caution!\n\nIt was a satisfying meal, and service was good with fresh hot naan brought out a few times and drinks refilled at a dizzying speed.  Price was about average (I think, to be honest I didn't pay much attention).  Ultimately though it's impossible for me to not compare it to Mt Everest and Mint for their as of now superior lunch buffet options.  Less options and less constant refills of those options along the line will lead to less visits from me to Origin."
        }, 
        {
            "index": 333, 
            "rating": 5, 
            "review": "Great service.  Great food. \n\nThe Nan bread is awesome.  Their curry dishes are wonderful.  Love this place.  I've been here twice in the past week."
        }, 
        {
            "index": 334, 
            "rating": 5, 
            "review": "OMG....this was the best Indian Food I have ever had.\nCame in with no expectations, and ordered Veggie Samosas...amazing!\nThen chicken dish was off the hook.\nService was really good too.\nFelt like I found a great restaurant to return too. Thx Origin!"
        }, 
        {
            "index": 335, 
            "rating": 2, 
            "review": "I found this at Groupon and decided to try it out. I'm not Indian, but I'm a sucker for Indian food. So far, I've tried other Indian restos here in Vegas that I would recommend than the Origin India. The ambiance is pleasant, but as for the food, they did not taste very Indian-ish to me. They were spicy but they tasted plain. It was not a terrible experience, since the service was not so bad, but food quality wise, maybe try somewhere else."
        }, 
        {
            "index": 336, 
            "rating": 5, 
            "review": "If you go here with friends do yourself a favour and start off by sharing all their \"street food\" selections before ordering other stuff. I've been here several time and everything on the menu has been fantastic."
        }, 
        {
            "index": 337, 
            "rating": 4, 
            "review": "Satisfied with food! The stuffed mushroom is a no-no. However, tandoori chicken, chicken makhani, and fish n yogurt sauce are delicious. The portions are generous and service is prompt! I recommend this place"
        }, 
        {
            "index": 338, 
            "rating": 2, 
            "review": "When we first arrived we ordered drinks and they were out of the first three types of beer that my boyfriend tried to order.\n\nI ordered a chicken dish while he ordered vegetarian and the food was fantastic...until 4 hours later when I was sick with food poisoning. It was great going down but I didn't enjoy being extremely ill on vacation.  My boyfriend never got sick and enjoyed his leftovers.  I enjoyed the ambiance but I don't think I'll ever be going back. Stay away from the chicken!"
        }, 
        {
            "index": 339, 
            "rating": 4, 
            "review": "Really good indian food and I can say that considering I'm indian and surprise, surprise, so are the parents! We came here off the strip cuz we were craving indian food and it had the best ratings. It is on the pricier side for Indian definitely but the decor and service are very, very good. They also have the cutest samosas and serve the food with style. They have relationships with indian restaurants in London and those of us who have been to London know indian food in london is to-die-for. Going off strip will cost you with the whole taxi thing but it's nice to getaway from the nonstop tourist traffic!"
        }, 
        {
            "index": 340, 
            "rating": 5, 
            "review": "Great Indian food, and decently priced. Classy but unpretentious service. Really worth checking this place out."
        }, 
        {
            "index": 341, 
            "rating": 4, 
            "review": "we visited vegas and were looking for some authentic, tasty indian food near the strip.we checked some ad in the local magazine and decided to go visit this restaurant.\nalthough this place is a little away from the strip, its not very hard to locate.i should mention we visited this place around 7:30pm, so its was not rushed.the staff was very courteous,the naan very yummy though pricey.we had ordered the paneer tikka and chicken chilli as appetizers and chicken makhani and paneer kadahi.we ordered a side of yellow dal which was very tasty, unlike any other indian place we have been to.\neven with all these dishes, the dinner for four was very well in budget.\nI would recommend this place.do go try it."
        }, 
        {
            "index": 342, 
            "rating": 2, 
            "review": "Oh my god! I never had this bad of service before in all my life. The restaurant  is empty but we had to wait almost forever for our food. First, they brought us frozen bottled water because the tap water tastes like garbage, so I complained about the frozen bottled water and they sent us a second one to fix the problem. My son even tried to use the candle to melt the ice in the first one...anyways, when they gave us the check, I was surprised to see that they charged us for two bottles !!!!!! Other than that, they did not bring the right dressing on the salad...only reason I gave it 2 stars is because the food was ok. \nI will never come back to this restaurant again ever, because of all the stuff I mentioned previously. The service was lousy!"
        }, 
        {
            "index": 343, 
            "rating": 5, 
            "review": "Was invited to lunch with a press person for the restaurant so we could have a meeting. We decided to order the naan bread, full lunch buffet of curried meats and no meat curried veggie items. We also tried a smaller, sweet lobster, that was cut down the shell and submerged in butter.\n\nThe lunch buffet pricing seemed a little high and there weren't too many people in the restaurant. If this restaurant wants to gain additional returning local customers, they should offer several lunch specials to bring people in, then they can discover what the buffet is about. Drinks were refilled many times in a short order so that was nice.\n\nI would return if the prices were to change or if they were to offer a happy hour menu."
        }, 
        {
            "index": 344, 
            "rating": 3, 
            "review": "Decor and service were excellent. The food was great, and the naan basket was really yummy. However, the pricing is a little ridiculous. Example, a $9 chicken appetizer with only about 4 bites of food. I wouldn't come back here without a coupon, but with one I probably would."
        }, 
        {
            "index": 345, 
            "rating": 5, 
            "review": "Hands down my favorite Indian Food Establishment in the Continental U.S.  \n\nI used to live in Vegas and frequented Mt. Everest on Sahara, and upon a recent vacation in Vegas a friend recommended this place.  It is so good that I would almost consider moving back just to be able to eat here more frequently.  It is THAT good!  \n\nMango Laasi was exceptional, as was the Saag Paneer.  The Hyderabadi Chicken was out of this world - the coconut milk gave exceptional balance and flavor and it wasn't too rich, as many cream-based dishes can be.  \n\nI also love that Origin India has a naan sampler basket.  Makes the decision easy - garlic, regular, cheese, or spicy - how about ALL!"
        }, 
        {
            "index": 346, 
            "rating": 2, 
            "review": "It was time for a curry, after all i haven't had one since back in England. I saw this place had opened up and thought...well why not eh?! The decor is nice a little bit on the poncy side for an indian but well whatever floats their boat right? \n\nSo we ordered the usual beers (Cobra and Kingfisher) and had a mild heartattack at the cost of a small beer...ok i unerstand that this stuff is shipped from India and all that, but i can buy the same beer at Lees for cheaper...well the resturant charges us $6.00 (domestic was $4 and other imported beer like corona was $5) So we supped our beers very slowly! \n\nAs always you get a \"freebie\" plate of popadoms and chutneys, their chutney selection was mint and some sort of brown sauce...still not too sure what was in that one....but we were very disapointed not to find the usual onion salad and mango chutney in the selection!\n\nThe menu is quite limited, you won't find the standard tikka masala, rogan josh, or aloo gobi here my friends. The menu seems to be aimed more towards the veggy market, and seeing as the whole point of curry was a strong sauce to over power the taste of rotten meat (it's true check your history books...look for some time around the British Raj!) the meat side was very limited...a bit of chicken, prawn, fish and lamb.  \n\nAll of the main dishes come served with rice, salad, naan and a veggy side dish.....which no matter what you choose turns up as yellow or black lentils!!! The curry is quite a small portion and comes set on your plate (there's no sharing here!) the rice was just plain white...what happened to the balsamic i hear you cry? The salad was mainly red pepper (3 slices) and cucumber (4 slices) on a warm lettuce leaf...yum appetising *blee* \n\nOn our table we ordered the Safed murg korma  (which tasted like Cambells chicken soup), the Murg makhani (which actually wasn't too bad as long as you ask for it hot!) and the Aloo nazakat (which looked and i'm positive it had the same texture of baby sick!) \n\nThe total cost of the meal was $120, that was made up of  the 5 beers and 4 curries; all in all i believe it was over priced with tiny portions!\n\nSadly it looks like i'll have a bit of a long wait (or a 10 hour plane ride) for my next curry!!"
        }, 
        {
            "index": 347, 
            "rating": 4, 
            "review": "LOVED this place! Came here as part of a group of seven, which is perfect for this type of restaurant, because we were able to order a bunch of dishes and try a little of each.\n \nWe started with the onion bhajis and Bombay bhelpurri. The latter is puffed rice mixed with onions and tomatoes in a tamarind sauce. I'd never tried this dish before and it was very tasty. The puffed rice gave it an interesting texture different from most dishes you typically find in an Indian restaurant.\n\nFor our mains, we shared the the lamb vindaloo, chana masala (chickpea curry), Rajastani paneer and southern grilled fish. The fish was a bit disappointing (lacklustre and slightly overcooked) but the other three dishes were excellent. I'm not a huge lamb fan so my favourites were the chana masala (very spicy and flavourful) and most of all the Rajastani paneer. This was a paneer (Indian cheese) dish in a carrot-based sauce that also contained bell peppers and cashew paste. Again, I had never tried this particular type of paneer before, but I absolutely loved it and will definitely keep an eye out for it in Indian restaurants in my 'hood. It was rich, creamy and delicious.\n\nThe atmosphere was I suppose what you would expect in an Indian restaurant (Indian-style decor but with a lot of modern touches), with the exception that instead of Indian music, they were playing random pop music. A little out of place with the atmosphere I thought, at least until later in the evening when it becomes more of a \"bar\" atmosphere.\n\nOverall, the service was very good and we had a great experience here. It's located a short cab ride from the strip but more than worth a return trip if I'm looking for good Indian food in Las Vegas."
        }, 
        {
            "index": 348, 
            "rating": 4, 
            "review": "I seem to end up here every time I am in Vegas. Probably because I like the foot massage across the parking lot. The Chicken Tika Masala is very good here. This most recent trip, I tried the Tika Masala with Tofu (by accident) and it was even better than the Chicken Tika!!  Service is good, but they are slow to bring the check.  I've tried the buffet before, and the section is good and food was fresh and tasty. I prefer the menu, however."
        }, 
        {
            "index": 349, 
            "rating": 1, 
            "review": "Chicken Tandori & Chicken Marsala not worth it at all.  We won't be back.  Full bar but no martini?? Service was soooooo slow it took forever for the food & our check!!  Only thing good was the nan!!!"
        }, 
        {
            "index": 350, 
            "rating": 5, 
            "review": "Had one of the chicken tandoori dishes and it was pretty good.  Just the right amount of spice and flavor.  The hardest part was trying to figure out which one of the tandoori dishes to get because they all looked and sounded good.  Yup, the naan was pretty good too.  The restaurant was very clean and the service was friendly and prompt but that may have been because we were the only ones eating in there.  The restroom was also pretty cool with a giant wooden door for the toilet."
        }, 
        {
            "index": 351, 
            "rating": 3, 
            "review": "The food was really good. My parents hare indian food but they tried the Chicken Tikka Masala and we're very pleased. I was not happy I had to pay $3.00 to have rice with my meal. Every place I have gone services rice with the meal. I don't think I would return."
        }, 
        {
            "index": 352, 
            "rating": 4, 
            "review": "My boyfriend wanted his lamb to be boneless.  The lassi is okay.  This was the best Indian food I have ever had.  I had roti here for the first time.  We were the only ones in the restaurant for lunch."
        }, 
        {
            "index": 353, 
            "rating": 5, 
            "review": "We LOVE this place.  We are Vegas locals and have been here probably a dozen times.\n\nFriendly wait staff, great atmosphere, great food.  The lamb is tender and perfectly cooked.\n\nGo now if you love Indian food!!!"
        }, 
        {
            "index": 354, 
            "rating": 4, 
            "review": "Good food and good service a bit over price for my opinion.\n the rice should come with the main dish, a little bit slow but that was accepted from an Indian restaurant\nI ordered the Baingan Bhartha which is vegan ordered a side rice and the combination was really good, a bit spicy but no too much.\nGo check this place out"
        }, 
        {
            "index": 355, 
            "rating": 3, 
            "review": "My husband and I have been huge fans of this restaurant. We used to dine here almost every month. However, during the last few months, we have noted some downsides which has lessed our visits. Seems like the previous chef has left and food esp vegeterian is not as tasty. Prices have increased a lot. I loved their fusion cocktails but price has increased from $10 to $12 per drink. Prices are like a top level restaurant but food, service, quality and ambiance is no where close to a top level restaurant. My husband still enjoys their signature lamb chops and New Zealand lamb shank. Their appetizers and cocktails are awesome, I just wish the prices were more resonable. We love our server Abel, he makes our visit special every time."
        }, 
        {
            "index": 356, 
            "rating": 3, 
            "review": "Ugh, what happened here? I hadn't been here in 1 year but the first few times I ate here were really good. I had liked the food very much back then. \n\nI went again this week and I have to say it just didn't live up to my memory. The food was ok. That's it just ok. \n\nHad a fried scallop appetizer that was heavily coated and locked its fried breading prison begging to be set free. Had a lamb appetizer that was good, spicy but good. I like spicy. \n\nHad mushroom truffle naan. It was tasty. \n\nHad the striped bass entree. As a heads up it is pan fried served with all of its bones. Which is fine with me but the waiter could have let me know or given me a side plate to put all of those bones. I enjoyed the flavor but again it was really oily. It could have done with a touch less oil used a hotter pan when cooked to prevent the absorption of all that oil into the fish. \n\nThe hubby had lamb which I tasted and it was average. \n\nAt the end of the meal the hubby had an after dinner drink. The waiter offered me one which I declined. I was never brought a dessert menu. Maybe they don't have dessert? \n\nThe service was not horrible but could have been better. Besides the fact he kept forgetting my husbands allergy which was explained at the start of the meal and the happy hour specials being explained incorrectly and the wrong prices listed on the menu vs. the prices on the receipt."
        }, 
        {
            "index": 357, 
            "rating": 1, 
            "review": "The most horrible and terrible experience.\n\nI went to this place with my family for lunch buffet, the buffet is over priced $14.99 per person and the following are the items in buffet.\n\n1 veggie soup - flavor less and watery.\n2 cheap appetizer \n\n3 Chicken tikka\n4. steamed rice\n5. lamb curry\n6. Fish curry \n7. veggie curry - no salt and veggies were uncooked and raw.\n8 lentils - flavorless, no salt \n9 rice pudding \n\nService is very bad, there was a middle aged waiter who has an attitude problem.\n\nThe decor is good and looked expensive and therefore it seemed they want to feed customers garbage at expensive rate and make up for the decor cost. \n\nFor the kind of money they charge I could have had better meal in one of the casinos.\n\nThe very thought of this place enrages me and my family because we spent nearly $100 for this crap.\n\nWill never ever go to this place, the owners of this place"
        }, 
        {
            "index": 358, 
            "rating": 4, 
            "review": "Great food, butter chicken and goat briyani were fantastic. Meat is cooked perfectly. Service could be improved, but it's not bad. Positive experience."
        }, 
        {
            "index": 359, 
            "rating": 4, 
            "review": "With all the hustle and bustle of Las Vegas, it's nice to find a place where you can take your time and enjoy yourself and your food. At Origin India, the decor is simple and chic with Hyderabad written all over it. Contrary to the popular Indian buffet, Origin India offers an a la carte menu. \n\nDishes on the left side of the menu with \"Traditional Dishes Served Family Style\" come without rice. Dishes on the right side of the menu under \"Entrees\" come with rice. I recommend ordering from the left side, then getting a side of rice. It comes out economically more friendly and portions, according to the server, are equivalent.\n\nIF you're an herbivore, they're vegetarian-friendly and will have provided you with (V) next to any items that are vegetarian. They also have a vegetarian menu slipped in the middle for your green delight. \n\nTo the food...\n\nHome-style chicken curry scented with kaffir lime leaves and smooth onion tomato sauce: I was curry-ous to see how this dish would turn out. My curry hopes were curtailed and there was much more tomato flavor than I would have hoped for. The density was just right, perfect for dipping naan, and if one enjoys tomato sauce with naan, one should order this dish. I, for one, was still curry-ous afterwards.\n\nThey have an amazing selection of naan. Their naan is very aromatic with the oven's flavor baked right in. I ordered the\n\nCheese and Chilli Naan: great oven-baked flavor, very cheesy and went well with the tomatoey curry. Fluffiness with stretchy paneer... yum\n\nDal Makhani: black Urad lentils cooked with garlic, butter and cream; these bad boys were so delicious, spiced just right with a savory lingering flavor even after you've swallowed. This was on the Vegetarian menu, but we got it as a side, so it was only $7. On the bill, it showed up only as $6. Score! Every dollar saved is another dollar to eat some more!\n\nI intertwined my meal with a tasty\n\nMango Lassi: smooth and frothy yogurt with natural mango flavor to tantalize my tongue.\n\nAs tasty as this drink was, the next dish I had which is the\n\nOven-baked baby eggplant in Hyderabadi sesame, peanut sauce tempered with curry leaves, mustard seeds and whole red chillies: but it was so disappointing. I only tasted sesame seeds and peanut sauce, but they must have forgotten the pinches of salt.\n\nThis dish was made up for with the Vermicelli Pannacotta. Three squares of vermicelli creme with lychee jelly... like something someone would think to make on \"Chopped.\"\n\nFood was 3.5 stars. Ambience was 5. Service was 4. Try this place at least once. I'll be back for a third time."
        }, 
        {
            "index": 360, 
            "rating": 3, 
            "review": "The menu has changed significantly since my last visit.  It's not the traditional indian fare that I've come to love. The vindaloo was not on the menu, but the server said that they still served it.  If was definitely not the dish that I had last time i was here.  The spice wasn't right and I had to add a ton of green chiles to get it right.  Charging for rice must be a Vegas thing.  One of the big drawbacks was the server charging card tableside.  It was just plain awkward."
        }, 
        {
            "index": 361, 
            "rating": 5, 
            "review": "Excellent Indian restaurant to go to! I ordered the Saag Paneer and a vegetarian curry dish(sorry folks, the name of the dish eludes me) along with a Naan that had raisins and apricots in it. This meal was easily the best meal I had in Las Vegas on this trip! The food tasted amazing and I always bypassed on sweeter Naan before in the past but no longer! It was delicious! I did take out and met up with Steve at the hotel. The service was fast and friendly! I will make a point to seek this place out next time I am in town!"
        }, 
        {
            "index": 362, 
            "rating": 5, 
            "review": "I have been here 3 times now and will keep going back for more. The food is amazing. The staff is very friendly and helpful. Our waiter even remembered me from the last time I was in.\n As far as what to order here, I love the stuffed nan (get a side of Riata and chutney for dippins), and the eggplant with cashew sauce(oh my heaven), and the lentils are so fragrant. The house merlot wasn't bad either at $6 a glass. Overall, it does add up and gets a bit expensive however its not a cafe style place its a nice sit down place.\nI also love their hours 11am to 11:30 pm.\nwww.originindiarestaurant.com"
        }, 
        {
            "index": 363, 
            "rating": 3, 
            "review": "Underwhelming. While I was thrilled to see new, unknown (to me) items on the menu, nothing was particularly stand out. I was most looking forward to the vegetable nilgiri, as I'd never had an Indian green curry, but it turned out to be on the bland side, even though I'd asked for medium hot. In fact, there was very little spiciness to any of our dishes. I also had the yellow dahl, which was fine but also not terribly spicy. My accomplice for the weekend said the same about her chicken makhani (Origin's version of chicken tikka masala), but we both loved her mango beverage, which turned out to the highlight of an otherwise uneventful meal. \n\nI would use this place as an Indian back-up if the curry craving ever hit, or to introduce a curry neophyte to the cuisine, as it's a rather calm and beautiful decor."
        }, 
        {
            "index": 364, 
            "rating": 4, 
            "review": "What a difference 4 years makes! I had last visited Origin India that long ago prior to moving to Vegas, and I had left disgruntled by overpriced, undersized Indian dishes that weren't particularly notable. We were lured back in by the Yelp Deal, and I am happy we decided to give Origin a second chance. Even though the menu is still a bit pricey, the dishes we had were well-executed and flavorful. \n\nMy advice is to stick to the traditional vegetarian dishes, as at $11 they are the best value, and the servings come in a big, deep bowl. You can also get a half-serving, which is not skimpy either. We ordered the saag paneer, yellow dal and a mixed vegetable curry. Both the saag and the yellow dal were complex, savory and non-stop delicious. I wasn't a huge fan of the mixed vegetable curry, but my husband was. Our first order of roti hardened quickly, but the second order was okay. The flavor of our dishes was definitely the standout of our experience. \n\nWithout our Yelp Deal, we could have likely had a decent amount of food for rather affordable, as two vegetarian dishes is more than enough. However, the specialty dishes are substantially more expensive between $20-$25. And, our service was spotty. When we showed up, the lights were still bright, and we felt as if were in a cafeteria. Then, we waited for a long time to be greeted by our server, even though there were staff joking around behind the bar. Once our server arrived, she was very kind, but our water ran dry. Plus, our order was messed up. They corrected it quickly and let us keep the errant dish, but for an environment this nice with these prices, I would expect a higher level of service and attention to detail.\n\nAs for the errant dish, it was black dal, and it wasn't as good as the yellow, but we enjoyed it as a snack the day after!\n\nI definitely think this is an improved Origin India, and with the Yelp Deal and an extra \"oops\" dish, we definitely left satisfied."
        }, 
        {
            "index": 365, 
            "rating": 3, 
            "review": "Pretty expensive compared to Ghandi's just down the street.  Food was fine, but not wonderful.  A bit nicer ambience than most Indian places"
        }, 
        {
            "index": 366, 
            "rating": 5, 
            "review": "was in vegas for a week-long convention. my wife and i had lunch here on a whim as we were driving around, luckily we were pleasantly surprised. the staff was very friendly and attentive. The food seemed like a somewhat modern take on classic Indian cuisine. I had a Paneer dish that was quite good, and my wife's food (chicken masala?) was also very tasty. highly recommend this place if you are feeling up to a slightly expensive meal."
        }, 
        {
            "index": 367, 
            "rating": 5, 
            "review": "Origin is absolutely deliciously out of this world! The restaurant ambiance provides a romantic feel at the same time adding a touch of elegance of India. Tai Mahal premium beer is a must get, it is refreshing and it makes you feel like you are sipping on champagne. Order the nan/garlic nan paired with red curry, lamb with rice and the shrimp Molly. The nan with curry exactly what I expected, perfection! The lamb with rice in a bowl was tasty the lamb was tender and was full of flavors. Finally my main entree the shrimp Molly, it is out of this world and it would rock your taste buds. Thank you Goldie (manager) and your staff. Superb!"
        }, 
        {
            "index": 368, 
            "rating": 4, 
            "review": "My native Las Vegas (Las Vegan?) friends said that Origin India was one of the best indian places in Vegas.  And as a whole they were correct.\n\nThe food was quite good.  I'm not up on my Indian food names, but I can tell you that we got a lamb dish, a chicken dish, a potato and spinach dish and lots of lentils and naan.  They were all quite tasty though the lamb dish was no where near being as spicy as we requested.  \n\nFor the price, I thought the food was just so-so, but I'll give it an extra star for being the \"Best in Las Vegas.\"  The wines were reasonably priced.  The waiter could NOT grasp the concept that we wanted to share everything, which made ordering overly complicated.  \n\nA DJ started playing right when we got there and though the music was pretty cool (techno Indian music and live bongo drums...seriously, it was pretty cool), it was pretty loud and we had to scream and repeat ourselves to uphold our conversation.\n\nOverall a good place, but I can't wait to get some SF dive Indian food."
        }, 
        {
            "index": 369, 
            "rating": 1, 
            "review": "If you are looking for nice ambiance and plethora of waiters serving you, then this place is for you. But if you are looking for authentic Indian food stay away from Origin India. I ordered Makhni (Butter) Chicken (medium to spicy) which is a common dish at Indian restaurants but what I received was bland Cream of Tomato Soup with pieces of chicken. After sending it back for the chef to make it spicier I got my dish back with green chilies on it, again which isn't Makhni Chicken. The waiter took my food away without even asking why I hadn't eaten it or if I would like it to go and just handed me the bill. Overall just a bad restaurant and service."
        }, 
        {
            "index": 370, 
            "rating": 3, 
            "review": "This is a Pakistani/ Indian restaurant. One look at the menu and you encounter a few familiar names but then some odd spellings from your traditional Indian restaurant.  \n\nKali Mirch Ka Jhinga (Pepper Shrimp) is a dish I have never encountered before.  It was good but I an still trying to figure out if the stir-fried dish served over green papaya noodles is indicative to Pakistan or some chef's fusion creation. I had never seen Sweet Potato salad a blend of masala and plum chutney flavors. There are tasting menus for 2 or more people.  \n\n\nThe decor and design of this restaurant  is very upscale. The prices for entrees are a bit more than I am used to paying. Quite a few over $20 dishes. The location and outside door is much better than the only other Indian restaurant I have been to in Vegas.  I'll eat here again but I had to budget for it."
        }, 
        {
            "index": 371, 
            "rating": 5, 
            "review": "LOVE this restaurant!  The food is amazing, service is just right, and atmosphere is posh yet relaxed.  Even if you aren't a huge fan of Indian cuisine, you must give Origin India a try!"
        }, 
        {
            "index": 372, 
            "rating": 4, 
            "review": "My family and I were craving Indian food during our trip to LV and for some reason, it was harder to find an Indian restaurant on the strip than one would imagine (things may have changed since those days). \n\nSo off the strip we ventured, determined to find a solid Indian meal and found ourselves at Origin India. Not knowing what to expect, we were beyond pleasantly surprised - the ambiance is not that of your usual stuffy Indian restaurant (I know, I have so much faith in my people). Rather it was uncluttered and tastefully decorated, combining both traditional elements with avante-garde accents... clay colored walls and archways reminiscent of Delhi's Red Fort, which were offset by modern touches such as comfortable brown leather chairs and sleek wooden tables. \n\nThe menu echoed the mix of tradition and contemporary, including staples like samosas and Rogan Josh, but was also had unique offerings such as Atlantic black cod and Grilled Canadian rock lobster. Everything we ate was delightful and the service was great too.\n\nThe distinguishing nature of this establishment is a testament to its founders, an England-based restaurateur couple that modeled Origin based on their industry experiences in the UK (which is well-known for their Indian cuisine)."
        }, 
        {
            "index": 373, 
            "rating": 4, 
            "review": "Located on Paradise just off the strip, this restaunt has a fine-dining-ish kind of feel to it with its eclectic yet tasty decor.Traditional indian dishes are served in a modern/contemporary presentation that transform a simple meal into a masterpiece. \n\nIt's been a while since I've been here, can't wait to go back even though the service wasn't that great. Last time I was here, I believe we had:\n\nTandoori Black Tiger Shrimp - awesome though portion a bit too small for the price.\nA Scallop Entree - not on the menu anymore, but really good.\nFresh garlic & corriander naan and roti (both freshly baked, really good)\nDessert - nothing. The wording on the menu needs a little work. It had descriptions like \"steamed, spongy cottage cheese balls\" that is not very American friendly."
        }, 
        {
            "index": 374, 
            "rating": 4, 
            "review": "Tried this place on a Saturday night in Vegas recently. Surprisingly the whole place was empty at peak time. There were lot of customers in other restaurants in the same strip mall, so its not as if this place was unique. \nWe entered and we were immediately impressed by the decor and ambiance. They also had some nice music playing and flattering lighting. \nThe restaurant may be struggling as they had a Groupon deal running when we went there and also have a Yelp $15 for 20 running right now.  The issue could be with their pricing. The entrees were about $15+ for vegetarian and $20+ for Non-vegetarian. Typically, either bread or rice is included with entrees, but here it was separate. So its like they have 'on the strip' prices for an off the strip restaurant with less value. Nevertheless, we liked the food, service and ambiance. The server/host was welcoming, he made it clear from the beginning that he can only accept one Groupon per table (we had 2) which is a fair policy. Despite applying the deal, there was no difference in service. We ordered the tadka daal, aloo paratha and some chilli paneer. Out of which, I would rate chilli paneer the lowest - as it tasted more indo chinese and was super sweet. The daal was really nice and aloo paratha was fresh and not frozen crap. Our friends tried the chicken and lamb and also liked it. Our Indian food standards are pretty low coming from Austin, TX - but we had just returned from India so the taste of amazing Indian food was fresh in our minds. In the end, the servers even offered to pack our left overs for us, which was a nice gesture. No hassles with billing or the check. All in all, if you crave Indian - go for it."
        }, 
        {
            "index": 375, 
            "rating": 5, 
            "review": "I don't even know where to start... WE LOVED IT! My husband and I went here on 4/1 with the Groupon that we bought and we were expecting an \"ok\" experience...boy were we wrong! IT WAS FANTASTIC! Everything from the service, our waiter Amad, the atmosphere, to the FOOD was awesome! We ordered the Lamb Kebab as an appetizer and that was super flavorful and moist. For our entrées we ordered the Hyderabadi Chicken....OMG! SUPER DELICIOUS! The flavors exploded in my mouth. Creamy, just the right amount of spice, and a hint of coconut...PERFECTION! We also ordered Lamb Vindaloo, very spicy and great taste. Make sure you order the Raita with this dish to cool off your palate. :) Naan...oh the naan! Fresh, warm, and super soft! Was perfect! For dessert we ordered the Poached Pear with ice cream...I've never had a poached pear before and man, I've been missing out! It was very good and the ice cream was a nice addition. My husband and I are still ranting and raving about what a great experience we had and what AMAZING food we had! WE CAN'T WAIT TO GO BACK!"
        }
    ]
}