{
    "category": "Las-Vegas", 
    "entity": "Hussong's-Cantina", 
    "avg_rating_stars": 3.3632075471698113, 
    "review_count": 212, 
    "reviews": [
        {
            "index": 1, 
            "rating": 4, 
            "review": "Having dinner here on a Monday night. Where is everybody? Food here is terrific, margaritas even better. The Mexican street corn is delicious with char that was just right, while their tacos were great. Had the two taco combo with ribeye and chicken taco--deliciosa!! Great combination of flavors. And don't miss the chips-- we had two baskets with their excellent green chili salsa."
        }, 
        {
            "index": 2, 
            "rating": 2, 
            "review": "First time last time. \nFor those who like happy hour this might be good food not so good. Guess there is a reason no one is here\nI must say outlet waiter was good. \nMenu is limited for a local Mexican restaurant"
        }, 
        {
            "index": 3, 
            "rating": 3, 
            "review": "Great happy hour specials, slow service! Every time I come here it seems the waitresses take their good time. Hire more staff!"
        }, 
        {
            "index": 4, 
            "rating": 3, 
            "review": "The environment and décor was awesome! Its much smaller than the one inside of Mandalay Place but the food is still the same! Amaze-balls. My friend and I ordered their nachos with Barbacoa and chips and guacamole. The gauc was so bomb. Its a must have. Although the service wasn't as great as the other location, the food is great always. Plus we went on a Sunday and it was happy hour all day which made it better! A definite great place to eat, drink, and be it casual."
        }, 
        {
            "index": 5, 
            "rating": 5, 
            "review": "I love the margaritas. Love the vegan food! Matt behind the bar is awesome. Great atmosphere and the margaritas are to die for! I've been here several times in the past six months and every time it's spot on! Are non-vegan friend loves the enchiladas!! Lol"
        }, 
        {
            "index": 6, 
            "rating": 4, 
            "review": "Went for Happy Hour.  Great prices!  Friendly staff.  They only have regular blended Margaritas, but they threw in some strawberry flavor and it was delicious!  The chips are great too!  (and the Chipotle salsa!)  Will be back!"
        }, 
        {
            "index": 7, 
            "rating": 4, 
            "review": "I like this place. The micheladas, elote, ceviche and stacked quesadilla are good. However the service could use some improvement, my husband and some friends I've brought here don't feel it's worth coming back too. I am still willing to give it another go."
        }, 
        {
            "index": 8, 
            "rating": 5, 
            "review": "I Loved my Food. The ceviche is delicious and Guacamole too. My waitress was attentive and sweet. Great combination. Loved the food and the experience. I'll be back."
        }, 
        {
            "index": 9, 
            "rating": 4, 
            "review": "Great tacos, you get to customize yourself; look forward to trying the \"original\" margaritas next time!"
        }, 
        {
            "index": 10, 
            "rating": 5, 
            "review": "Just went here for my first happy hour in Vegas since my 21st birthday, good prices for beer and wine, and the tacos and street corn were very good. Our waitress Amanda was very nice and helpful!"
        }, 
        {
            "index": 11, 
            "rating": 3, 
            "review": "We thought the service and staff were great.  The food was good but nothing spectacular, a little better than average.  The prices were not bad either, pretty reasonable for being in Boca Park."
        }, 
        {
            "index": 12, 
            "rating": 2, 
            "review": "All of the other negative reviews were spot on. Service sucks, food is mediocre and overpriced. Won't be coming back.\n\nIf you're a vegetarian like me, the vegan menu is a nice touch...but overall quality is just bad."
        }, 
        {
            "index": 13, 
            "rating": 5, 
            "review": "I liked this place. Tacos were pretty damn amazing!!! Service was great. Salsa was great. great!!! Enjoy :)"
        }, 
        {
            "index": 14, 
            "rating": 5, 
            "review": "9/10/16\nStopped into Hussongs for some food and drinks. So they have Mojitos here, and they are actually made the proper way, probably one of the best I've had in quite some time.\n\n Our server was pretty cool, made sure we had everything we needed and was fast. I ordered the I got the Shredded Beef Barbacoa, which was phenomenal!\nAny chance that I get, I will be coming here to try their other dishes."
        }, 
        {
            "index": 15, 
            "rating": 2, 
            "review": "Like the location at Mandalay bay way better. Customer service was awesome, food not so much. The beef had an old funny taste to it. Won't be returning."
        }, 
        {
            "index": 16, 
            "rating": 4, 
            "review": "Good Mexican fast food and GREAT Original Margaritas. I was very happy to see three vegetarian taco options! Original margaritas are half price during happy hour. The Boca Park location has a good-sized patio with big tables for large groups. Staff is attentive. Will definitely go back."
        }, 
        {
            "index": 17, 
            "rating": 4, 
            "review": "Pleasant enough. Kind of a cross between a fast food joint and a sit down restaurant.\n Food was good. Definitely not Mexican. The salsa was tasty but all 4 were SUPER mild ...even the fire hot xxx had no heat.\n Service was slow toward the end. Had to flag down another server to get take out boxes and check because we could not get attention of our server.....finally our server came over.Portions good and piping hot. Just needed more flavor."
        }, 
        {
            "index": 18, 
            "rating": 5, 
            "review": "As they say you can never get a second chance on a first impression. With that said I have to say what a great 1st impression! Was greeted in a welcoming manner and was told about the happy hour specials. These specials are incredible! Drafts 2.95 and some excellent food specials to.  Just for checking in to yelp I received a complimentary order of their street corn right on the cobb with the husk still attached. I really enjoyed the atmosphere as well. Just a great place for great food, family and friends to hang out."
        }, 
        {
            "index": 19, 
            "rating": 5, 
            "review": "Chris is the man very helpful and nice!!! The hole entire staff was very professional and made a great environment to have dinner and drinks!"
        }, 
        {
            "index": 20, 
            "rating": 3, 
            "review": "My first time in, and I thought it was pretty good.\nWalked into a dining room buzzing with several servers, and was directed to seat ourselves.\n\nShortly after we had menus brought over. The menu is a bit strange in its format, but once you figure it out it is fine. It is divided into protein, style, sauces, etc that you basically \"build your own\" - I did a simple fish tacos, my friend did a pork rice bowl. You get the idea. They are all $9.95 (with upgrade options)\n\nThe food was good. I think I liked my tacos better than my friend liked his rice bowl. The endless salsa bar was a great addition. They had some awesome flavors available, from super hot to smokey roasted. The salsas helped kick up the flavor!\n\nService was surprisingly attentive. Even though it was clear that our server was running around helping a very busy dining room. Really, she was hustling that room, and doing a great job in the process!\n\nOverall, it was good. I would go back because it is close and I like Boca Mall shops. If it was opposite side of the city, not sure I would venture just for this."
        }, 
        {
            "index": 21, 
            "rating": 2, 
            "review": "I thought I was going to love the food but it was gross and had no flavor at all. We had corn which was good but not great. We had tacos chicken and barbacoa disgusting I couldn't finish them. We had chips & bean cheese dip it was ok, we didn't finish that either. Service was mediocre at best. I don't recommend you waste your time here."
        }, 
        {
            "index": 22, 
            "rating": 5, 
            "review": "By far the best margaritas.  Chips and salsa amazing.  I had the shrimp kow pow tacos by far the best I had.  Street corn so delicious.  My husband had the 3 Tacos and loved all of them.  Great service.  Awesome happy hour."
        }, 
        {
            "index": 23, 
            "rating": 5, 
            "review": "I ate off the happy hour menu.\nTacos , nachos, margarita.\nAll were good good flavor. Great service. Strong drinks.\nCute girl gave me sample beer, very good beer. Nice to get a sample before purchase.\nGood attitude good place"
        }, 
        {
            "index": 24, 
            "rating": 3, 
            "review": "I feel torn between 3-4 stars for this place. But I'll go with 3. \n\nWe bought a Groupon ($20 for $40) which was good. Started with the guac for $5.95 which comes with bottomless chips and salsa. The guac was good, not great. It was heavy on the tomatoes which I'm not a fan of. But it's a good price for an easy app. Also comes with chicharrones on the side. Never had a pork rind in my life, but gotta be honest- they're pretty good. Almost like rice cakes with more flavor. The actual chips that come with the salsa trio are not great. \n\nMy husband had the vegetarian chimichanga. He really liked his, although wish it came with rice/beans or anything on the side. I ordered the carne asada fajitas. The meat was delicious, flavorful and cooked to perfection. I was not a fan of the rice or beans. But the onions, peppers, corn and potatoes were seasoned well and a nice side. Tortillas were delicious. \n\nWe also had a pitcher of margaritas that a friend helped us with. The pitcher was 36.00 and was worth with it. \n\nWe sat at the bar and the bartender was really nice and helpful. I guess the vibe seemed dull to me, being we were some of the only people in the restaurant at that time. The story behind Hussong's is actually really interesting and being that's it's one of only a couple others aside from the original in Mexico, I would think they would have gone with a more authentic decor. Just my take.  Would probably go back again, only with another Groupon."
        }, 
        {
            "index": 25, 
            "rating": 4, 
            "review": "It opened on Monday and I visited on Friday July 24th around 7:30pm.\n\nI came in the back door and sat down at the bar. I used to frequent this place when it was Embers so the changes in the place were interesting to see, with the removal of the wall separating the bar and dining tables, as well as lighter wood stains and red upholstery on the chairs. Lots of random pictures and posters adorn the walls. The bar has two hanging bottle displays with different tequilas in them. I really liked the interior as it seemed lighter and fresher.\n\nBartender Justin spotted me and came over to take my order. He recommended an \"original\" margarita so I went with it ($10.95). He gave me some good recommendations on tacos as well since I don't like spicy food. Tacos are 2 for $9.95. I missed out on the Happy Hour menu which has discounts for drinks only.\n\nOriginal Margarita - I'm not a huge margarita fan, I usually enjoy tequila as a shot. This was ok, nothing special in my book. \n\nTacos - I went with a chicken taco that comes with fresh pineapple on top, and the pork belly taco (extra $1). Both were plenty big and very well made with lots of meat. The pork belly taco was delicious with a sweet marinade sauce and some crispy pork rinds on top. \n\nService was great, Justin kept using my name during conversations, and checking up frequently and keeping my water glass full. The other bartender whose name I don't remember didn't hardly even look my way, nor smile much while she was working the other side of the bar. There was a manager guy there who seemed like he was watching the bartenders work and he also didn't smile much or seem to have much customer connection. \n\nOverall, I'll probably come back during Happy Hour when drink prices are a little more reasonable. One thing I did notice was the bartenders shirts said \"Serving up fun since 1932\" or some year, yet the place didn't really seem all that fun. It seemed like a business."
        }, 
        {
            "index": 26, 
            "rating": 2, 
            "review": "This place doesn't have the same menu as it's location in the Mandalay Bay, so that sucked.  You also have to get your own salsa, and the wait staff were confused about which table ordered what.\n\nOn a different note, the bartender gets 5 stars; drinks were amazing."
        }, 
        {
            "index": 27, 
            "rating": 4, 
            "review": "All I can say is that they have the best tacos that I have found in Las Vegas. I took my first bite (carnitas tacos) and said \"yes\", this is a taco. I also had a fish taco but it was bland.  I took a group and unfortunately there was only one waitress who was also the bartender. Let me tell you, she did a super job. It was slow service but spot on considering all the other people that she had to handle. We will go back!"
        }, 
        {
            "index": 28, 
            "rating": 5, 
            "review": "I absolutely love this place! Chris, Elizabeth and House have all given us great service every time! Such personable people! Love the food and the atmosphere! There's only one thing I wish was different, and that is the happy hour time! I would definitely come by more than I do if it was maybe 8pm-close! I mean 1 hour just ISNT ENOUGH!! Let's change that guys! Make this place even better than it is! :)"
        }, 
        {
            "index": 29, 
            "rating": 2, 
            "review": "Walk right in and was not greeted which is not that big of a deal to me, but the food was almost below average. Very Americanized and not your real authentic Mexican good. Not a place I would go back to."
        }, 
        {
            "index": 30, 
            "rating": 1, 
            "review": "Let me start off with the most important part of the review,the food. My wife and I ordered an array of tacos, The ribeye taco, Kung pow shrimp taco, barbacoa taco,& The chicken taco. Ribeye taco was dry this is their version of carne asada. We also had the mango habanero guacamole. The flavor had no hints of mango taste like regular guacamole. The rest of the tacos were greasy overpriced and had little seasoning. The restaurant is known for inventing the original margarita, so I thought I'd give it a try. They definitely want to charge you for the history and a margarita was quite underwhelming. Now onto the service. Number one, the manager never checked to see if our food was any good and asked us if this was our first time, Which replied yes it was. The order taker thinks speed equates to service my wife and I could not understand a thing that was coming out of her mouth. The food expediter didn't explain one taco and placed my wife's napkin in the guacamole and just walked off. Please do not waste your time with this restaurant."
        }, 
        {
            "index": 31, 
            "rating": 1, 
            "review": "1st, I swear the beans are Hormel chilli. ..which is just ew for a supposed Mexican place. Just no. Why? The rice has no flavor for \"cilantro lime\"...Chipotle is better.  2nd the margaritas are awesome and strong (maybe so you get drunk and forget that the beans are probably chilli from a can?). So, go here fo the bar and NOT for the beans. The steak tacos were good but we just couldn't get over the beans and rice...yuck! Even worse that they had the nerve to put those godforsaken  beans and rice in my husband's burrito. Double yuck!"
        }, 
        {
            "index": 32, 
            "rating": 2, 
            "review": "There's nothing quite so disappointing as a drink that runs you $2 per sip. If I wanted a margarita that was mostly ice I'd have it blended. Five mouthfuls from a ten dollar pint is nearly laughable. \n\nMaybe if it were half price would I give this place three stars. Subpar beans and rice in tiny portions only serve to make the nearly average tacos seem nice by comparison. \n\nThe staff seems to be trying to make up for the shortcomings of this place, but it's a shame it probably won't last long enough to make their training time worth it. Their enthusiasm gives this place one star above the minimum."
        }, 
        {
            "index": 33, 
            "rating": 5, 
            "review": "Great service by beth! Definitely will go back! Fantastic environment & the food was amazing!! The drinks were well made as well!"
        }, 
        {
            "index": 34, 
            "rating": 5, 
            "review": "My fiancé and I came here about an hour before closing- so we were actually out before they closed cause our time there was about 45 minutes total. \nAnywho, we sat at the bar and the server was Elizabeth. She was attentive, got my fiancée his beer and our waters, put our order in right away, and we got our food in, i wanna say about 7-10 minutes, we ate and then we left. All in all it was a really good experience. The food was tasty and Elizabeth was very nice! Will come back."
        }, 
        {
            "index": 35, 
            "rating": 1, 
            "review": "What a joke!!! After a lovely date night with my husband, we decided to stop and watch the football game and have a couple beers. The female bartender not only spills my beer on the bar, it spilled all over my phone, my purse and me.... She only was concerned about my phone and the bar countertop. She didn't offer to wipe my purse or offer to give me a towel to dry myself up. I had to ask for one. And to top it off, charged me for it!!! Good job bartender!! A comped beer wouldv'e been the right thing to do....."
        }, 
        {
            "index": 36, 
            "rating": 5, 
            "review": "Great happy hour during Sunday night football. Pitchers of beer, food. Street corn amazing! Great TV's/ sound too."
        }, 
        {
            "index": 37, 
            "rating": 5, 
            "review": "Loved the ambiance at this restaurant as soon as you walk up to the entrance there's 90s alternative playing in the background I'm sure they change it up if your not into alternative. You are greeted by a nice friendly hostess who is very welcoming. We had the option of sitting outside or inside and being such a beautiful night we took outside sitting (I recommended it) the waiter was friendly and gave us enough time to look over the menu before we ordered (I hate being rushed) I ordered the combo plate that included rice and beans    steak, shrimp and fish taco they were delicious (the combo comes with 2 tacos i ordered an extra taco).  At the end of our meal we decided to order dessert coconut flan and it was very creamy as it should be. I will be recommending this place to my friends."
        }, 
        {
            "index": 38, 
            "rating": 5, 
            "review": "Grand Opening today great margaritas! The Bartenders are crazy good. Give this place a chance you will enjoy your time. Excellent food great fun happy hour or for dinner or a quick lunch. Remember to ask for House at the Bar!"
        }, 
        {
            "index": 39, 
            "rating": 5, 
            "review": "Awesome little place great guacamole and a salsa bar with very good salsa options. The smoked chipotle was great. Had three tacos which were delicious. One shrimp one Kung pow shrimp and Pulled pork. Recommend the place. Service was awesome as well !!"
        }, 
        {
            "index": 40, 
            "rating": 5, 
            "review": "Amazing food... Awesome vegetarian and vegan options!!! Amazing service.. Angelica was fantastic and love that managers still touch tables!!!"
        }, 
        {
            "index": 41, 
            "rating": 5, 
            "review": "Very good food great atmosphere... Love the all day \" Happy Hour\" on Sunday!!!  The server was very attentive"
        }, 
        {
            "index": 42, 
            "rating": 5, 
            "review": "Great guac, and great casual atmosphere.  High quality, reasonably priced food--can't beat it!"
        }, 
        {
            "index": 43, 
            "rating": 4, 
            "review": "I came here due to the Vegan menu, and I am always on the hunt for new spots with vegan options. This place was great, and will definitely be a regular for my boyfriend and I\n\n1. They have an entire vegan menu, from appetizers, to entrees, to desserts. It was awesome! The food was so good, and the fish taco was AMAZING. I have been craving a nice fried, crispy, fish taco ever since I started being vegan and the taco they served here was just...SO GOOD.\n\n2. Service was awesome, we got there as soon as it opened on Saturday and our waitress was so nice and on top of it. \n\nOverall, like I said...everything was great and I will be back :)"
        }, 
        {
            "index": 44, 
            "rating": 2, 
            "review": "I'll make this quick. The food wasn't good. Grabbed a steak burrito bowl to go and the meat was soggy and depressing. Just no flavor or imagination or delious grill char in this dish. Also messed up the order and gave me the wrong beans.\n\nI presented the bartender a groupon and she charged the whole amount to my card anyway. Honest mistake and she was friendly enough so no big knock on the service here. \n\nIts a nice place but when your burrito bowl is worse than Del Taco I gotta rate accordingly."
        }, 
        {
            "index": 45, 
            "rating": 5, 
            "review": "*Everything was fresh\n*Great customer service (from Amanda)\n*Great atmosphere\n*Best tasting margarita\n*Great Tacos"
        }, 
        {
            "index": 46, 
            "rating": 1, 
            "review": "Really disappointed on food and service. The busser is cleaning tables without  sanitizer. Going from one table to other .moving dirt from one table to other. Chicken taco was very bad.so much oil on the food .really sad .get a manager who is gonna  watch everything."
        }, 
        {
            "index": 47, 
            "rating": 5, 
            "review": "The street corn is delicious! Service, food and ambiance are fantastic! Elizabeth was very friendly and made sure we were taken care of! We'll be back soon!"
        }, 
        {
            "index": 48, 
            "rating": 1, 
            "review": "Terrible! This is what you call Mexican??? Not only did I have to pay extra for chips and salas at a \"Mexican\" restaurant but I also waited 48 mins for some tacos just for them tacos to be dry, no flavor & definitely not worth $54 of food at Happy Hour at that. Last time I waste my money there! Try Javier's that's real Mexican!"
        }, 
        {
            "index": 49, 
            "rating": 4, 
            "review": "Best beans I've had in a long time.  Rice was also excellent. The Barbacoa and Carnitas tacos rocked!!!   One was better but I'm not sure which was which.  Cantinas always have a great atmosphere and the location is great!!   Enjoy."
        }, 
        {
            "index": 50, 
            "rating": 4, 
            "review": "Food was good.. bartender was busy so not very attentive but she did her best... need better tvs by the bar."
        }, 
        {
            "index": 51, 
            "rating": 2, 
            "review": "I'm not impressed with the enchiladas. They don't even serve \"hot\" drinks.  Coffee..   They should stick with being only a bar."
        }, 
        {
            "index": 52, 
            "rating": 1, 
            "review": "Food has no flavor at all. I enjoyed my old school lunches a lot more than this. The only thing of theirs I actually liked was the guacamole. Will not be returning."
        }, 
        {
            "index": 53, 
            "rating": 3, 
            "review": "Food is decent. Service is below par. Bartenders are slow and aren't very attentive. Only thing that saved our meal is that the manager stepped in and made sure we for service. Took almost 25 min plus before we got a drink."
        }, 
        {
            "index": 54, 
            "rating": 4, 
            "review": "Doesn't look like much, however, the food was great!\nHad the fish tacos, hubby had the steak burrito smothered with all 3 sauces...BEST Cadillac margarita (with Hornitas Blanca tequila) in town!\n\nMusic a little loud for a date night (for us at least), little like a sport bar. (Thus the 4 stars). \n\nA definite go to for Mexican."
        }, 
        {
            "index": 55, 
            "rating": 2, 
            "review": "Here's the deal: the tacos are good, some are great. I love the fried avocado taco, the chicken taco and the barbacoa taco. My boyfriend said the fish tacos were good as well. The food, for us has never been the problem, the service however, that's another story.\n\nAnd it's not the fault of the servers! Management needs to get a clue, and have a hostess seating people, that's how you avoid two  people sitting at six tops and making your larger parties wait for tables. Do not let people seat themselves, its a mess. Also, give your servers a busser, we were there during their happy hour on a Monday and it was busy, but the only had 3 servers working, and no bussers, and no one seating people. That's why it takes 20 minutes to get drinks out. Its not fair to your servers, as it effects their tips and their ability to make money.\n\nBathroom trash was overflowing, and there were crushed chips  all over the floor at the waiters station.\n\nThis place could be great if management gave their staff the tools to succeed."
        }, 
        {
            "index": 56, 
            "rating": 2, 
            "review": "First off, the girl that \"greeted\" us was not even warm or welcoming. If i didnt ask if the bar was open seating i am pretty sure she wouldnt have even acknowledged us.\n\n Margarita was delish but over 30 min for 3 tacos? And it was not even busy for the amount of staff they had... by the time the bartender realized our ticket was \"lost\" they were out of barbacoa. Luckily it took them less than 10 minutes for them to get out the 3 tacos but the tortilla was not even cooked all the way and the tacos were not even hot. Didnt even really check up on us, didnt seem sincere about the timing, no compensation, and even short changed me. Im not the type to look for dicounts but at least seem like you care that your guests are not happy. The first time we dined here the it was sooo much better...Maybe if the staff spent less time on their phones things would have been different."
        }, 
        {
            "index": 57, 
            "rating": 3, 
            "review": "I came to pick up food here last night it was pretty empty I stood at front a while until I realized I needed to walk to the back. \n\nI checked in on yelp and asked to use my check in offer which didn't specify dine in only but I was told that it was. \n\nI ordered a veggie burrito and vegan tacos.\nWhen he read my order back he said vegan burrito. I said I ordered a veggie burrito he corrected himself and said he was indeed and veggie and NOT and vegan burrito. \nWe also ordered two sides of rice. \n\nHe was super rude on the phone and kinda rude in person. But showed me a new expanded vegan menu and we talked briefly about the other locations because I work at Mandalay bay. I said thank you that was nice of you and nothing no thank you good night just weird bad customer service. \n\nWhen I got home to eat there were not two sides if rice and they gave me the Vegan Burrito that I specifically said I did NOT want. It was an awful burrito. I didn't eat it. It was full of green chiles and I was so dissapointed because I drove super far out of my way to go there. The experience was lack luster. I didn't eat my ten dollar burrito. And my friend didn't get anything because they didn't add the rice. \n\nThe food itself is good but they have to get there service on point to make this location successful. It'll take more than a good happy hour. \n\nIf owners are reading this and you need a new training manager call me. Would love to show you what supreme customer service reflects in your sales and yelp etc."
        }, 
        {
            "index": 58, 
            "rating": 4, 
            "review": "The chips were kinda stale, but the tacos were yummy!   I would for sure give this another try if in the area!"
        }, 
        {
            "index": 59, 
            "rating": 4, 
            "review": "Great Happy Hour times and offerings! :) Yummy fish tacos."
        }, 
        {
            "index": 60, 
            "rating": 5, 
            "review": "Excellent Margaritas! Chicken Nachos are amazing, gotta try the Rib Eye tacos!! FIRE!! \nThe bartender Amanda is fun and friendly!!! Not to mention she has the cutest southern accent! Lol. Highly recommended place to spend with friends and have drinks!!!"
        }, 
        {
            "index": 61, 
            "rating": 4, 
            "review": "This is a happy hour review. The happy hour is from 3-6 M-F, and all day on Sunday's. Basic tacos are $3, special happy hour drinks are $5-$7, chips and salsa is .95 and guacamole is $2.45. There are also items for happy hour on the menu. The drinks are strong but not over the top. The bottomless chips and salsa are good - you choose your salsa from a salsa bar and the guacamole is fresh and well made, but a small portion. The steak taco I had was a bit on the spicy side. The taco was decent sized, but I felt it could have a had a bit more meat. We also had a chicken quesadilla melt, which was delicious. The service was uneven. Our first server was on top of things, but we ended up having to move tables, and the second server was not very visible. Overall, the prices made up for the small issues. We will come back again for happy hour."
        }, 
        {
            "index": 62, 
            "rating": 5, 
            "review": "Great food Chris is awesome very personable delicious margaritas I love the music and the atmosphere I hate going on this to try to upload a review because my phone sucks The Wi-Fi would not connect to my phone"
        }, 
        {
            "index": 63, 
            "rating": 5, 
            "review": "Came here with my parents and my twin brothers (1 year old). Good service and very very good food. Best fish tacos I've had in Vegas. I enjoyed the low prices and the quality of the food, for such good prices. Not too busy, not enough advertising. But hopefully stays in Boca Park!"
        }, 
        {
            "index": 64, 
            "rating": 4, 
            "review": "Man I wish margaritas weren't so delicious and refreshing. \n\nWhen you walk into a place and the barkeep tells you they are the inventors of the \"Original Margarita\", well you might as well stick a fork in me, 'cause I ain't going nowhere anytime soon.\n\nIn case you're wondering, the \"Original Margarita\" is a damn fine margarita.\n\nMy barkeep was House, and he was just about as brilliant as his more famous medical namesake.\n\nI started with the Mexican corn. Mexican corn is a truly odd experience for a Midwestern kid who was raised on corn-on-the-cob. Back home, the only way people cooked corn-on-the-cob was in a pot of boiling water, a method which all but removes every bit of flavor from the corn (it's a wonder I wasn't culinarily scarred for life). \n\nForgive the tangent here, but if I could travel back in time, I would go back to my grade school self and introduce myself to Mexican Corn (and then we would explode into non-existence when we make contact in the congratulatory high five).\n\nNeedless to say, there is a reason the Mexican Corn is pretty much the only picture on the menu. No matter what else you try, you need to try the Mexican Corn.\n\nHouse picked two tacos for me and kept the margaritas flowing. I will honestly admit I cannot remember which tacos I got, but that may be due to House's master mixology skills. I can say, without a doubt, that they were two of the best I have ever had.\n\nThe prices here are quite high, which is the sole reason for the missing star. I'm not completely saying the price point doesn't match the food and service quality, but the prices need to come down a little bit to be a 5 star joint, especially on the \"Original Margarita\", which hits you at a whopping $10 a piece. \n\nBut the good news, happy hour has the \"Original Margarita\" at half price. Guess where you'll be finding me from now on?"
        }, 
        {
            "index": 65, 
            "rating": 1, 
            "review": "A step above taco bell. A definitely didn't expect this place to be sit down fast food with the other expensive retauarants in the area. The menu has 5 options, and it's definitely more a bar than a restaurant, which is fine if that's what your looking for.\n\nThe food was ok..meat was seasoned well but fake guacamole pureed and the salsa was zingy in the \"I'm going bad\" way. Disappointing.\n\nThe place was very clean and the staff was friendly, hence the one star."
        }, 
        {
            "index": 66, 
            "rating": 2, 
            "review": "Went here for lunch, only a couple tables of customers. Ordered, the specialty steak taco was inedible, the meat was so tough and chewy we sent it back and got a chicken. The chicken taco and avocado tacos were good, no free chips at this mexican place! The waiter was not so great, had a empty glass for half my meal, don't expect refills. Than he came up and said \"the manager took the chicken taco off your bill\" I explained that of course she didn't charge me for a taco I got to replace the one that I couldn't eat! Than I pointed out that I was still being charged the extra dollar for the 'specialty' taco. Nevermind the manager coming out to check on the table. This place is what it is a bar don't expect restaurant quality or service."
        }, 
        {
            "index": 67, 
            "rating": 5, 
            "review": "Street corn to die for and chicken tacos were on point. You wont be disappointed. Service was good and employees were friendly."
        }, 
        {
            "index": 68, 
            "rating": 1, 
            "review": "Last Wednesday (March 2) I got food poisoning from a cheese Quesadilla. A bad night that I won't describe followed. I aspirated vomit and now have respiratory problems. To say will never be returning is a gross understatement."
        }, 
        {
            "index": 69, 
            "rating": 4, 
            "review": "They have a vegan menu, great chips and salsa. The service is good. The vegan tacos still needs improvement. But I would return to this place"
        }, 
        {
            "index": 70, 
            "rating": 2, 
            "review": "Only reason for 2 stars is because the restaurant is cute and outdoors. Terrible Mexican food. We ordered carne asada and it was overly condimented. There's no need to condiment like that a good piece of meat.  The beans tasted like canned beans and were extra salty as everything else. I would never recommend it or go back!!!"
        }, 
        {
            "index": 71, 
            "rating": 1, 
            "review": "Located in the old Embers space in Boca Park, this place offers no reason to return.  $10 for 2 tacos.  Do I need to write more?  Ok.  The woman behind the counter - it is fast food, akin to Chipotle or Cafe Rio - told me the tacos are very large..\"worth the price\".  Not.  The carnitas taco was flavorful, the fried avocado taco was not.  Neither was large - About the size of a street taco (if you are familiar).  Do yourself a favor and go to Cafe Rio or Chipotle - cheaper and better.  *I was not drinking, so I didn't try the \"best margarita in town\".  Maybe that's worth coming back for."
        }, 
        {
            "index": 72, 
            "rating": 3, 
            "review": "Food is pretty good I had the Kung Pow Chicken bowl my girl had the Baja Fish Tacos. We went there on a Friday Night when the bar was the only thing open. The bartenders had to be waiters and make drinks so we didn't get that great of service since we decided to sit at a table. I had to go to the bar to get my bill after sitting there for a while thinking that they were going to come to me to give me my bill. Almost thought I was getting the meal comp'd I mean hey its Vegas. I  did like the food and the Margarita so I may go again just will make sure to go when they are open full service."
        }, 
        {
            "index": 73, 
            "rating": 1, 
            "review": "Shrimp tasted like white rubber, inedible. Beef tasted like jerky. Black beans had no flavor, like out of the can.  Better options nearby. Did not have drinks."
        }, 
        {
            "index": 74, 
            "rating": 5, 
            "review": "Ate here with a some girlfriends Thursday night. Staff was very friendly and made recommendations when asked. The food was excellent, especially the corn on the cob. Drinks were good, but perhaps a bit expensive. They do have a happy hour though and margaritas are half price. The waiters were very attentive. Definitely looking forward to returning!"
        }, 
        {
            "index": 75, 
            "rating": 5, 
            "review": "Great food and really nice atmosphere! Looking forward to my next visit!"
        }, 
        {
            "index": 76, 
            "rating": 5, 
            "review": "Love the food. Love the service. Happy hour is amazing. Try the chicken tacos & swirls."
        }, 
        {
            "index": 77, 
            "rating": 1, 
            "review": "Let me start this review by stating that I've been to this location of Hussongs many times and I have had great food and experiences there before. Unfortunately I did not have a pleasant time tonight. Naomi was our server, we went on 10/4/16 for $2 taco day. We ordered 1 Mexican mule, I ordered 1 chicken and 1 steak, he got 2 chicken 2 steak. We received our waters after 12 minutes, restaurant was not busy and never received our alcoholic drinks, then she forgot 2 of the 6 tacos and didn't say a word about either. We're very unhappy the quality of the food wasn't great this time either. Also, on our bill we were charged 11.25 each for our two tacos... on $2 taco day? She said it was cheaper, but somehow we ended up paying $23 for our 4 tacos, rice and waters. \nWe'll be back, but if I see Naomi, I'm running for the hills."
        }, 
        {
            "index": 78, 
            "rating": 5, 
            "review": "Greatest margaritas in town! They make them from scratch instead of sweet and sour mix. Plus the food is amazingly delicious and fresh. I do his recomend anyone looking for a great medical joint to check this place out!"
        }, 
        {
            "index": 79, 
            "rating": 1, 
            "review": "I'm so surprised by some of the reviews. Never would I go back. The margaritas were awesome. The food was alright. But the service was absolutely terrible. Took them 10 mins to even come over and get our drink order. We had to ask them to place an order (like are you kidding). I double checked on Yelp to see if they were closing (since we went on a Sunday and they're times could be different) and they didn't close for another hour and half. Used the coupon on Yelp for the queso dip and they decided to not bring it out until all of our food was done. After we just sat there we had to ask them for the check (since they didn't really care about our table at all). And our bill was wrong. Sorry but I'll go and spend my money over at The cheesecake Factor or Kona Grill next time."
        }, 
        {
            "index": 80, 
            "rating": 1, 
            "review": "Absolutely disgusting food last night! Service was awful. Will never come back here. We had to serve ourselves our own chips and salsa and they still billed us full charge. They got my order wrong and the food server had the audacity to tell me it was my chimichanga when it clearly was a burrito. Food was gross. The bartender apologized that they were short staffed."
        }, 
        {
            "index": 81, 
            "rating": 2, 
            "review": "So I come to try something new and thought coming to boca park would be good place to start. I love Mexican food so I came here. Started out when I walked in this brown haired girl yelled and said sit where every you like. So we sat down. The floor isn't too clean and looks like a hurricane came through. Huge chunks of food. The menu looked cheap even though when you order 5$ guac you don't even get a full avocado and wasn't even that good.. It was so small. I rly like the fire salsa tho. We didn't even have any napkins in our holder. There wasn't enough people on sad or they are just lazy. I gave the two stars for the salsa and one because the girl was nice.... Food wasn't very flavorful. I threw some of that salsa in it to make it up."
        }, 
        {
            "index": 82, 
            "rating": 5, 
            "review": "Are you kidding me? Soooo much better than my visit to Loco Cantina on the other side of town! Came in for a taco and was told it was All Day Happy Hour for Election Day. The carnitas taco was twice the size of Loco Cantina for twenty five cents less yet twice as good or more. The real pint of Pacifico was 1.00 less!\nNo comparison.  Very good.  Free stuff with Yelp check-in."
        }, 
        {
            "index": 83, 
            "rating": 4, 
            "review": "I love a place w/ both Omni & Vegan options!  The Vegan Taco Menu (this is on a separate menu that you need to ask for) is affordable ($10.95 for two tacos, rice, & beans) and has a slew of options.  I enjoyed both the fried avocado taco & fishless filet tacoo.  They even have a kids menu for those picky omni children.\n\nMy sister-in-law had the ceviche and thoroughly enjoyed it! \n\nRestaurant is in a great location, w/ nice outdoor heated seating area, and service was attentive."
        }, 
        {
            "index": 84, 
            "rating": 4, 
            "review": "I love the location and ambiance of this restaurant!  There's outside seating and when the weather is nice and it's cool in the late evening this is the place to sit, eat and relax.  \nThe food is not bad, it's more Americanize than Mexican food ( kinda reminds me of Baja grills )."
        }, 
        {
            "index": 85, 
            "rating": 1, 
            "review": "I'm sure it would be a great restaurant if I wasn't gluten free. The server stated that \"everything\" on the menu was gluten free except the flour tortillas. Some of the descriptions included words like \"breaded avocado\". The restaurant clearly has no actual idea what gluten free is and I'm worried they don't know what cross contamination is or if the chips and breaded items are all fried together. I'm not feeling too hot. Never going back."
        }, 
        {
            "index": 86, 
            "rating": 1, 
            "review": "The vegan food here was gross. Bland, no flavor. The service was good. The beer was good. Good atmosphere"
        }, 
        {
            "index": 87, 
            "rating": 1, 
            "review": "The worst food even worse ambience.  The night we were there, there were some vulgar women at the bar screaming while watching a football game. These women were using awful obscenities disturbing all of the patrons. No one in management addressed the issue in spite of being asked to. We left with our food half eaten. No loss as the food is a terrible imitation of Mexican food."
        }, 
        {
            "index": 88, 
            "rating": 5, 
            "review": "So far so good! Mario was an amazing bartender! Margaritas were on point! We were greated right away (by who we think might be the owners) they explained how everything works and Mario did the same for us as well. We only got the margaritas today along with the warm chips and salsa bar. Very friendly staff, good atmosphere... We will definitely be back and Mario has a lot to do with it!"
        }, 
        {
            "index": 89, 
            "rating": 5, 
            "review": "The quesadilla was so good! I got a chees one and it was big and wasn't just a normal cheese quesadilla. It has a smokey chipotle sauce in side. The cheviche was amazing too. Spices were perfect and the chips were thick corn chips! Yummy margaritas!"
        }, 
        {
            "index": 90, 
            "rating": 5, 
            "review": "Awesome spot we just now stumbled upon.  Not just your average taco joint - Has really great versions of all different types of tacos.  And more importantly the best margs."
        }, 
        {
            "index": 91, 
            "rating": 1, 
            "review": "Quite possibly the worst Mexican food I've had the displeasure of eating. I didn't know this restaurant was featured on dirty dining, otherwise I never would have came here in the first place. \n\nThe food: Mediocre in every sense of the word!! The house nachos were basically a plate of sad tortilla chips with beans and watery cheese and green sauce. The chicken tacos were so bland!! My love for tacos could not overcome the blandness of these tacos. It tasted like I was eating a squishy card board with mango plopped on top. \n\nThe service: So slow!! We walked in for a quick bite. There were literally only three other tables with people and it took forever to get a menu, then to get drinks, then to get food, then to get our bill, then to get our bill corrected because they messed up on it. No one had come into check in us or even walked by us so we couldn't ask for hot sauce to mask the sadness of the tacos. \n\nAlso, the seats and tables were dirty when we were seated. Water was brought out in a cup that has old food residue on the bottom of the cup and on the sides. \n\nDirty dining, indeed."
        }, 
        {
            "index": 92, 
            "rating": 5, 
            "review": "I enjoyed the Beautiful patio view, the nice Salad , and the Service , From the Very pretty Blonde waitress , was exceptional !!  I WISH everyone hire sweet good looking staff in restaurant , LIKE they use to . It makes the entire experience FAR more Enjoyable!!!"
        }, 
        {
            "index": 93, 
            "rating": 1, 
            "review": "First time trying it and the last time. The atmosphere is nothing special, the decorations are ugly, but the real review is for the shitty tasting food and the wrong amount charged to my card. I'm not sure how my server, Jonathan could misinterpret a $6.00 tip to a $15.00 tip. My card was over charged by $9.00. The food was horrible. I got the 3 enchiladas and my wife got the 3 soft tacos. Both plates were pretty spicy. That is not disclosed on the menu. Their rice is overly drenched in lime and their churro dessert was mushy. I wouldn't recommend them at all and we'll see if they're prompt on refunding my money back."
        }, 
        {
            "index": 94, 
            "rating": 1, 
            "review": "Ordered fish tacos and my husband had the steak burrito.  The fish taco was the worst I have ever had.  It was soggy with such a wired unpleasant taste.  My husbands burrito was poor.  Sauce was sweet and meat tough.  Poor meal.  Needless to say we will never return."
        }, 
        {
            "index": 95, 
            "rating": 4, 
            "review": "I was hesitant to go to this restaurant but my friend Chris amp it up for me. I Normally go to chayo for tacos Tuesday but this place has some amazing tacos. I tried four different type and the shrimp tacos I'm the best I have ever had  I wish they had horchata or any Aguas Fresca."
        }, 
        {
            "index": 96, 
            "rating": 2, 
            "review": "$50 for lunch , only 1 Maragarita .. Not worth the $$\nDerive was poor, low class place in a high rent district. \nI would expect more  in Boca Park"
        }, 
        {
            "index": 97, 
            "rating": 2, 
            "review": "It's walk up style jack in the box type restaurant. So you get jack in the box service with the boca park prices. The food and margaritas were just okay and very pricey. Definatly wouldn't recommend it."
        }, 
        {
            "index": 98, 
            "rating": 5, 
            "review": "First time here and they were definitely under staff, however the hostess who was also the bartender, waitress, busser, and manager made up for it. Elizabeth was amazing & very attentive. She was very prompt with our drink orders and recommended items off of the menu. We were mainly here for happy hour but did try the bean dip and salsas, which were good. My cousin had a carnitas taco and she said it was fantastic. I will definitely come back and try their food. If you are looking for happy hour I highly recommend to come here, they have great drink specials and food."
        }, 
        {
            "index": 99, 
            "rating": 1, 
            "review": "I order for delivery fajitas and corn very disappointed with the food I paid 26 bucks for 2 mediocre items one time not anymore"
        }, 
        {
            "index": 100, 
            "rating": 5, 
            "review": "Great place,  I took my mom for her birthday, and the food was great,  amazing drinks,  great customer service"
        }, 
        {
            "index": 101, 
            "rating": 4, 
            "review": "Big baby treats head of household to dinner.  What... where... who???  Hussong's!  They sang?  No, Cantina.  Huh?  No, Hussong's Cantina!  Yummy food!  Great flavored taco combos with refried beans and rice.  They do fried avocado too.  It can be ordered on the side like avocado fries.  Warning: addictive.\n\nThey have a margarita of the month, made with muddled cherries.  Strong stuff.  Works well for relaxation during dining.  Try it!\n\nWe tried their shrooms and veggie delight taco combo, and their chicken and steak taco combo plates.  The chicken has pineapple in it!  Wow delish!  The steak is made with pickled onions and had a very nice spice kick to it.  For sure would order the steak ones again.\n\nThe restaurant is a fairly large center bar with TV's and very casual seating inside and outside.  TV's along the walls all around and paraphernalia galore of anything and everything it seems.  Looks like a collector's arrangement of many interests.  \n\nCool place to hangout.  Good day to come in apparently is a Wednesday; it isn't busy.  Service is polite and simple.  This side of the parking lot however is hectic.  Have patience and have another margarita."
        }, 
        {
            "index": 102, 
            "rating": 2, 
            "review": "Stopped in for a quick lunch. Everything from the self-serve salsa station to the tacos was just so so. In our group of 3, not one of us ordered anything that was note worthy. They do advertise specialty margaritas, which we didn't get to try. Maybe that's what is boosting their ratings."
        }, 
        {
            "index": 103, 
            "rating": 2, 
            "review": "Went there last night, it was not a great experience.\n\nThe restaurant was empty on a Saturday night?  Really?\n\nCustomer service was mediocre, the $6 draft beer was flat UGG.  Crazy no?  A cantina that can't get the beer right?  Their quality control is lacking, they are in a premium location .  \n\nWe didn't eat, but please review previous yelper's reviews where the health department gave the restaurant multiple demerits--"
        }, 
        {
            "index": 104, 
            "rating": 1, 
            "review": "Went at lunch time and there was only two tables.  Yet, they couldn't keep the orders straight and kept trying to give the food to the wrong table.  My food was good.  Another's was raw.  For the price, it should be top notch...it was ok.  Just ok.  Could get same food elsewhere for less...GO there."
        }, 
        {
            "index": 105, 
            "rating": 5, 
            "review": "A wonderful incidental find during lunch at Boca Park. I am from SoCal and haven't had any decent Mexican food in the last 8 months in Las Vegas. A colleague and I were joking and saying how a drive-through Alberto's is better than anything in this town. Well, I have to say I am rather impressed.\nThe ambiance is very casual, which is wonderful for lunch. Don't know how the restaurant is during dinner time (since Boca Park restaurants are a zoo during dinner and weekends). \nWe had two servers, one who greeted us, gave us the history of the restaurant, explained the menu and made some recommendations. The service was on point, enough attention not pushy or overly annoying- just perfect. The chips were fresh and very delicious. The array of salsas that we could choose from was plentiful. I really like the spicier choices. Their original margarita was wonderful. I ordered the combo tacos (Baja shrimp and Carne Asada). Baja shrimp was best outside of Baja, Mexico. Carne Asada one was filled with flavor. I really enjoyed the beans, they were creamy and delicious. \nExcellent food paired with great service!"
        }, 
        {
            "index": 106, 
            "rating": 1, 
            "review": "Totally fell in love w this place last week , then we went in today for Thursday night game .. Well the whole staff was different very sad cause it didn't compare to last weeks staff.. Not only did the bartender spill a full beer on my wife she had the balls to yell out to everyone we had a \"whooping 16 dollar bill\" it was happy hour btw .. She couldn't apologize or comp or take care of the fact she spilled a full beer on my wife , just in case I forgot to mention it .. Again not coming back again .. Parkway tavern wins again"
        }, 
        {
            "index": 107, 
            "rating": 5, 
            "review": "Best tacos in Las Vegas!!!! Go with the ribeye tacos you'll never regret it! Awesome friendly staff too!!!"
        }, 
        {
            "index": 108, 
            "rating": 1, 
            "review": "I am torn on the stars...I would give the food and waitress 5 stars but the owner should stay away from the customers! I was enjoying an amazing meal and drinks with my husband and children...my husband had kept a menu so he could order more when he felt like it. The owner came over and asked if he could take his menu. We did not know this was the owner by the way...my husband nicely said no that he'd like to keep it. He lingered and my husband asked if he was a manager or owner...he said YES I AM THE MAN! My husband then made small talk about never knowing with all these reality shows and youtube tricks...the owner (Brian) then asked AGAIN for the menu. He responded no thank you. Brian lingered again and asked AGAIN. I said- he just told you no...he'd like to order more, spend more money. Brian then proceeded to tell us loudly in front of many other tables I JUST BOUGHT THOSE NEW MENUS AND I'M JUST WATCHING BEANS ON THEM! I sort of laughed and said that they were the washable kinds of menus and that he was being ridiculous.  It is very clear he should keep to the business side of things and leave the employees and patrons alone! It was a very unneeded experience! I hope he reads this and realizes what an impact his negativeness made...I've NEVER written a negative review EVER!"
        }, 
        {
            "index": 109, 
            "rating": 5, 
            "review": "Decided to go for lunch since im over in the area its located in Boca Park, arrived there and got seated quickly my server was very friendly I ordered a Smothered burrito and it was delicious! definitely going back for happy hour soon."
        }, 
        {
            "index": 110, 
            "rating": 2, 
            "review": "Place was almost empty during lunch hours - but looks like it might liven up during Happy Hour.  I tried the carnitas taco and the barbacoa taco - the carnitas taco was really bad, like it might have gone off.  The barbacoa was pretty gross as well, too much nasty-tasting sauce. \n\nI would never eat there again, but it looks like it might be a good place for drinking.  Lots of tvs, but not very big tvs.  The food server and the bartender were very nice, friendly - great service.  Too bad they don't have better food to sell - not their fault!"
        }, 
        {
            "index": 111, 
            "rating": 4, 
            "review": "Great place , asked to watch boxing,they very accomodating ,great food,good music and great atmosphere! Will come back again!"
        }, 
        {
            "index": 112, 
            "rating": 5, 
            "review": "My God! This place is so cool! The staff are so friendly especially that bartender Elizabeth will take care of you. The food is great get the 3 tacos! We had the ribeye and shrimp awesome! With drinks and food for three people we were under a hundred. Next time we will hit happy hour the specials look so affordable!"
        }, 
        {
            "index": 113, 
            "rating": 5, 
            "review": "Came here for lunch specials. The got carnitas taco and barbacoa. It was amazing! I sat outside next to the water feature. It was great! They told us to help ourselves to the salsa bar. The salsas were tasty and so were the corn chips that were freshly made. The service was great and it's perfectly located in the shopping center. Will definitely come back and recommend these amazing tacos."
        }, 
        {
            "index": 114, 
            "rating": 3, 
            "review": "Nice Mexican restaurant located in Boca Park with decent food and drinks. The berry margarita was a tasty choice for a sweeter style margarita. I tried the loaded quesadilla and it was very good. It had a tomato mixture inside which was non conventional but worked well. The guacamole was fresh. The music was on the louder side which was a bit distracting, but other than that it was a nice place."
        }, 
        {
            "index": 115, 
            "rating": 4, 
            "review": "Bartender was super friendly. Hostess smiled and greeted me as soon as I walked in the door.\n\nKind of an older crowd at the bar but I did get there during happy hour.\n\nThe pork tacos were awesome. I didn't care for the queso bean dip at all but it was free with a Yelp check in. Next time I will try the grilled corn.\n\nThey have a pretty decent happy hour. I would return for that."
        }, 
        {
            "index": 116, 
            "rating": 4, 
            "review": "Very tasty food and drinks. Loved the free corn by checking in on Yelp. It was kinda pricey as we came on a Saturday and there is no happy hour on Saturday. Server was great, not busy at all when we went. I would return."
        }, 
        {
            "index": 117, 
            "rating": 1, 
            "review": "We were on our way to the Kona Grill, and when we parked, we noticed Hussong's and decided to try it out since Kona looked pretty packed. \n\nOur waitress was nice, the atmosphere was cool, but the one star lies in the quality of the food/drinks. \n\nWe ordered a pitcher of white sangria, and what we got was a pitcher of what looked like 7up with maraschino cherries in it and tasted like a non alcoholic Capri Sun. Zero buzz was had.\n\nChips and salsa next. They brought out a tray of three different types of salsa that i guess maybe they make there? Pineapple, Chipotle and Habanero. The only remotely good one was the habanero. The other two were literally so awful we didn't touch them after one taste. \n\nOn recommendation from the server, I ordered the pork belly tacos. My wife ate the carne asada tacos. Both dishes lacked serious flavor, and the pork belly, for some reason, was diced up extremely small in the taco. When ive had pork belly, its always been whole so you can really get the flavor and texture from the fat and the meat. This was just strange. \n\nAt the very end of the meal, our waitress finally brought us the waters we asked for when we ordered the Sangria. We were already paying the bill. Thanks for that.\n\nAlso, WAY overpriced."
        }, 
        {
            "index": 118, 
            "rating": 4, 
            "review": "Since learning about Hussong's Cantina while in Ensenada, MX a month ago and visiting the Original location opened in 1892 I have been a fan of this place as a bar establishment. \nFinding out that there was another location (Mandala Bay) here in Vegas was very exciting but driving through Boca Park and seeing Hussong's in an old restaurant location I had previously visited I was more than EXCITED!! \n\nWalking up to Hussong's there is a visible outside covered Patio location with Bar Tops and a few 2-4 seating tables, patio is not super big and on this day when we arrived it was somewhat empty but filled very quickly. \n\nWalking into the restaurant we were quickly greeted by a hostess/server that asked us if we had been here before. I said no only the one in Mexico. She then proceeded to tell us how to order food/drinks from the walk up counter and we would be given a table # Flag, then we could sit anywhere we like and the food/drinks would be brought out. \n\n*TIP: Be sure to tell the staff when ordering you would like to keep your tap open if you want more drinks. \n\nWe did not order food but certainly ordered The Original Margarita to see if it lived up to its Standard in Mexico! Drinks were on Happy Hour Special 3-6pm M-F. \n\nAs we sat on patio the drinks were quickly severed and they were certainly strong and tasty! Not quite as strong as the Mexico drinks, however, in there defense, that was Mexico :-)\n\nThe food looked good and will certainly be back to try that! There is a center bar located inside the restaurant along with a few TV's which has sports playing at the time. \n\nAgain, I am fan overall and happy this place is near by at Boca Park, next to Pink Berry and Total Wine and Spirits."
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "For lunch, my wife suggested a new place she'd seen. A cantina in Boca Park?  Gotta be pretentious, I'm thinking. Quite the contrary. The atmosphere is very casual and the staff very friendly and courteous. I would liken it to Chipotle meets sports bar but with higher end ingredients. The restaurant and restrooms were very clean and the service was excellent. Our party of six was seated immediately and drink orders taken on the spot. The bartender brought me the wrong beer and before it even registered in my mind, she returned with the correct beer and told me to keep the first. All right, this is my kinda place. \n\nThe menu is a bit limited, but hey, it's tacos. The street corn is charred to perfection and the salsa bar is pretty good, too.  The manager checked on us, which I always like, and we were in and out in just over half an hour. Price was very fair, too. Can't wait to go back."
        }, 
        {
            "index": 120, 
            "rating": 5, 
            "review": "My experience has been delightful. My friends and I came in for a bite and drink while MNF and we enjoyed the food.. I had the Kung Pow Shrimp Tacos... Yuuuummmmm!!! Also had the el pepino margarita, it was perfection every sip of the way. My friend had the deep fried avocado tacos... Pretty good too. I will be coming back to watch the super bowl :)"
        }, 
        {
            "index": 121, 
            "rating": 1, 
            "review": "Poor service.  Don't go on Sunday.  The staff is too busy watching the football games to serve you.  Will not be back.  Ever."
        }, 
        {
            "index": 122, 
            "rating": 5, 
            "review": "I was pleasantly surprised how much i enjoyed hussongs.  We went to the all day happy hour on sunday.   The food had so much flavor and my husband loved the salsa bar.  The cheese quesadillas were the best ive ever had.  I enjoyed my chicken taco also with the grilled pineapple on top!  I loved the relaxed vibe of this place too.  The staff was nice and the food was really good!"
        }, 
        {
            "index": 123, 
            "rating": 2, 
            "review": "Had a real bad experience when they first opened but after seeing on a web site that they had a happy hour on a Saturday we decided to give them another try. We suggested to friends that we meet there during their happy hour. When we asked to see the happy hour menus we were told by the bartender there was no happy hour on Saturday. When we showed him the web site, he informed us that it was a web site displaying  Las Vegas happy hours but not posted by them. He was going to inform his manager to make corrections. Their director of social media should be aware of any inconsistent information about their restaurant and attended to this as soon as it was posted. When we saw a meal returned because of a dirty plate we left. We will not be making a third visit."
        }, 
        {
            "index": 124, 
            "rating": 5, 
            "review": "This place has an amazing Happy Hour!!\n\nThe staff is always friendly and the food is great for the price. \n\nI've been on several occasions where there has even been live music!!\n\nThe salsa are self serve and a great way to explore your palette. I like to mix the pico with a bit of the extra spicy salsa to make it more kicking but not out of control. \n\nThe nachos are fantastic and the quesadillas are more than enough to fill me up all on their own. \n\nOverall: love this place. \nAnd: it's happy hour all day on Sunday's!!! Can't beat that!"
        }, 
        {
            "index": 125, 
            "rating": 1, 
            "review": "Terrible & greasy food, should of known when we saw the rotten tomatoes on there market cart by the entrance. Food so bad & greasy. Bartender made several comments and didn't appear very happy or assist us with anything. Food hade no flavor & poor quality ingredients"
        }, 
        {
            "index": 126, 
            "rating": 3, 
            "review": "Nice bar that has almost no connection to the original, except the name. Good happy hour options and $3 drafts. They advertise \"street tacos\" that are anything but. Very whitewashed foods that are not even close to being authentic. Good place to have a couple of beers after work, if you're not in a rush. Service is pretty slow. 3 stars only for their HH."
        }, 
        {
            "index": 127, 
            "rating": 2, 
            "review": "Generally We like Hussongs. But on Cinco De Mayo we went for a early dinner during the happy hour (3-6) The service was slower than usual but it was a Mexican holiday so we exercised patience. Once we did get waited on and had our dinner and drinks, got the bill. Higher than normal so we asked the manager why. He said no happy hour today. Not at anytime did they tell us or was it posted anywhere there was now happy hour. Just felt like we had been hustled, won't be going back anytime soon. I expect honesty in doing business not a hustle."
        }, 
        {
            "index": 128, 
            "rating": 4, 
            "review": "This was our first time here and found the food good, service quick/friendly, and Chris the manager simply outstanding!  Great seating and view...a for sure Friday place."
        }, 
        {
            "index": 129, 
            "rating": 5, 
            "review": "Genuine Margaritas! From the original, since 1941 in Ensenada! This place is legit! Amand the bartender is the best! She knows her drinks and is very friendly and welcoming! The food is great and the atmosphere is fun and contagious!"
        }, 
        {
            "index": 130, 
            "rating": 4, 
            "review": "Love trying new places, heard this place had amazing Mexican food... Let me tell you it was delicious! The salsa bar and guacamole.... Oh my... BUT the only thing that held me back from giving 5 stars was because of the bartender, our waitress was amazing but the bartender was helping too. She would hand out food from over the pony wall near the bar while the waitress was getting our order... Or reach over the pony wall to get old dishes... It was the most oddest thing I've ever had happen at a restaurant.... Other than that food was amazing even the margaritas!!"
        }, 
        {
            "index": 131, 
            "rating": 4, 
            "review": "Chips, tacos and beer... good. \nReally casual place in Boca Park with a nice little outdoor seating area. \n\nHussongs offers a bunch of unique and delicious taco fillings... the Kung Pao shrimp, Pork belly and rib eye tacos are all great.  I just tried the enchiladas off their new expanded menu... awesome with the half n half cheese and red sauce. \n\nService is friendly, food is tasty, digs are casual."
        }, 
        {
            "index": 132, 
            "rating": 5, 
            "review": "One word. AMAZING! My husband and I stopped in randomly for lunch after running some pre-thanksgiving errands. It happened to be happy hour all day for the holiday. Super awesome. The chips and salsas were great! I loved them all. I also ordered a house margarita on the rocks. Super fresh and perfectly crafted. I'm a margarita snob and it was perfect. We decided on tacos. We both ordered 2 a piece and it was the perfect amount of food. I had the chicken and Barbacoa. Both were fantastic. If I had to choose, my favorite would be the Barbacoa. My husband got a Barbacoa and carnitas! The carnitas was good as well and had pork grinds sprinkled on top. Nice touch!!!! We noticed that happy hour is ALL day Sunday! We decided we will be going back on Sunday. It's our new spot and we couldn't be happier. By the way...the staff and manager on duty were super friendly. We thoroughly enjoyed ourselves!!! See y'all again soon!!!!"
        }, 
        {
            "index": 133, 
            "rating": 5, 
            "review": "I love Hussongs. Food is great,  ambiance is great,  service is great.  Is recommend it to anyone.  My first time here I liked it so much I brought my mom back.  She liked or so much she brought my sister back."
        }, 
        {
            "index": 134, 
            "rating": 4, 
            "review": "Ok so the tacos, street corn and salsa are amazing! However, for approximately $21.00 a person I thought the self service concept is a bit steep. Margarita is $9.95."
        }, 
        {
            "index": 135, 
            "rating": 2, 
            "review": "Went here when if was embers and loved the food and service but couldn't get over how dead it was. I think it's just forgotten about. But we we're excited to find a place that has tacos and happy hour. I would totally come back for just beer, chips and salsa. The food was nothing special and service lacked. Not sure if our waitress was training or not cause we saw someone shadow her a few times but if that the case I blame her trainer. It was too slow to receive the service we received. Love the area and so close to home but doubt we will be back. I hope they are able to turn things around."
        }, 
        {
            "index": 136, 
            "rating": 4, 
            "review": "Quick review here. Pretty good. The margaritas were okay. Loved the chips n salsas (and guacamole rocked)!!! Husband got the chimichanga and I got a couple of tacos (veggie and shrimp). Good food, very good service, very good atmosphere. I would come here again."
        }, 
        {
            "index": 137, 
            "rating": 3, 
            "review": "The best part of the meal was the street corn.   Very tasty!  The steak enchiladas were dissapointing.  The textures and flavors did not taste \"authentic\".  The enchilada meal included beans and rice; overall  mediocre.  The salsa bar was unimpressive.  The salsa that was supposed to be XX was sweet and mild compared to the salsa that was labeled with only one X.  The  service was very good.  If I return it would only be for the street corn which I consider a tad pricey."
        }, 
        {
            "index": 138, 
            "rating": 5, 
            "review": "What a great local find! Great happy hour and the margaritas are awesome. Loved my tacos and guacamole too."
        }, 
        {
            "index": 139, 
            "rating": 5, 
            "review": "My experience as a consumer with hussongs was awsome to say the least . my first impression was great costomer sevice , the bartender there \"amanda\" hands down is the reason i frequent this establishment consistently.. The food is great and served promptly.. Yes , im a fan of hussongs!!"
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "I will sooooo be back!   After two hours of Boulder Climbing at RED ROCK all we wanted were margaritas!   Seriously the Sunday bartender was amazing and talked to us about the coolest places to climb!   And the prices were awesome.  I looked up and seen its a Pittsburg bar which made Cleveland me a little sick but IDK I think I'm gonna cheat on TORO's and make this my new margarita bar when I'm in Summerlin :)"
        }, 
        {
            "index": 141, 
            "rating": 5, 
            "review": "Great hopitality at this upcoming establishment In the Boca Park/Summerlin  area. Elizabeth and House the bartenders on duty, Wow they make excellent Margaritas. The feel of this bar is genuine and makes you feel at home. Shout out to Brian Mangino the director of Operations he really knows what Excellent Customer Service is. Brian and his team made our visit very enjoyable the minute we sat down at the bar. Give this establishment a try you won't regret it!!!!"
        }, 
        {
            "index": 142, 
            "rating": 4, 
            "review": "The bartender / supervisor, i think her name was elizabeth was amazing! She was hostess, bartender, busser & server all in one. She was working the night of the election. She is very attentive & great personality! She deserves a raise."
        }, 
        {
            "index": 143, 
            "rating": 1, 
            "review": "This was my first time dining at Hussongs. The service was really bad. The self seating throws you off a little. We came in right after happy hour when it was slow. It took someone 10 minutes to approach us. We were not told about the self service chips and salsa until we asked for some. At that point we were told we have to get it ourselves. Weird. When we ordered we watched the waitress walk around for 5 minutes before putting our order in. After we were done eating it took another 15 minutes to get our check. The wait wouldn't have been a problem if they were busy but they weren't. Also the food wasn't great. My chimichanga wasn't cooked all the way and the cheese dip was not your normal Mexican queso dip. I wasn't a fan."
        }, 
        {
            "index": 144, 
            "rating": 1, 
            "review": "Came here on a date since neither of us had been before.   First off there is not much of a selection on their menu and it is overpriced. Second, service sucked. They told us to sit anywhere, took a couple minutes to even get menus and as soon as she dropped off the me yes just walked off without asking if we wanted anything to drink. I asked for some water as she was walking off and she finally brought some a while later.  She also never once came over to ask if we wanted refills.  Third, the food was not good. I got the burrito and it was the driest burrito I've ever had, no sour cream or anything, just the burrito.  My date got the cheese enchiladas and I could tell he wasn't that pleased with his either, but he still finished it.  I didn't even eat half of mine, even though I was starving. Over all this was probably the worst Mexican food I have had and nice had some pretty bad stuff before."
        }, 
        {
            "index": 145, 
            "rating": 1, 
            "review": "If the waiter was better we would of given two stars but our waiter was just not attentive. \nWe waited 10 minutes for two cups of water & a kid's drink.\nPersonally-- why charge for chips and salsa when other places don't? Coming from a business aspect, why would we choose here over the others? \nWe ordered a rice bowl and three tacos.\nOur food wasn't appetizing. The only meat that was mediocre was the chicken. The steak had a very funny taste and after having the stomach bug we really don't want to mess with food poisoning! \nIn other words, we won't be returning. \nWish you better luck"
        }, 
        {
            "index": 146, 
            "rating": 4, 
            "review": "Anjelica was a very nice and attentive server. If you check in on YELP you can get a free roasted corn (delicious-- reminds me of TJ corn back home) or bean dip.\n\nTheir happy hour isn't bad. The portions are full sized. I was expecting small street tacos so I ordered 3.. 2 was enough. The tacos were pretty good-- definitely on the more TexMex meets new America side. I think I liked the chicken taco best. Their pinapple salsa is very good as is their free chips.\n\nThe place gets a little warm inside since it's an open space that connects to their patio. Also, it looks like you can walk straight in and order To Go from a counter in the back. The space is fairly small so it would be a little difficult to accomodate a large group together."
        }, 
        {
            "index": 147, 
            "rating": 3, 
            "review": "With so few all day Sunday Happy Hour choices my girlfriend and I decided to check out Hussong's. My girlfriend was seated at a patio table when I arrived.  She had chips and a water.  She said the hostess told her it would be about 15 minutes before a server got to her so I arrived in that 15 minute window and still no server. After about 10 additional minutes and making eye contact with what appeared to be a couple servers on the patio still nothing.  I flagged someone down and asked if we could place a drink order.  She said who's your server, and we responded we did not have one to which she responded, how did you get the chips then. I mean why are we being questioned how chips appeared on our table.  So needless to say it didn't start off too well.  So this person became our server by default.  According to my receipt her name was Jasmine.  \n\nWe ordered tacos, quesadilla, guacamole and queso, which was free via Yelp check in. The guacamole was good but I was not a fan of the queso and would not order it again even for free.  I enjoyed the frozen swirl margarita which is the traditional margarita with flavor of choice mixed in.  I tried the raspberry and strawberry.   I like the salsa bar choices versus most restaurants that offer spicy or mild.  \n\nDuring our time there two parties had dogs so the patio is dog friendly and I am a fan of that.  Overall, I was not a fan of the initial slow service but once Jasmine became our server we didn't have any other issues and she was helpful making recommendations.  This is a chain restaurant so the food is not mind blowing but add in the drinks and it's a decent happy hour option."
        }, 
        {
            "index": 148, 
            "rating": 2, 
            "review": "Not really feeling this place. Went for a Friday happy hour. Firstly, I'm not a fan of the \"order at the counter, we'll bring it to you\" thing. Am I at a sit down restaurant or a Cafe Rio/Chipotle? The menu felt confusing and was ridiculously limited. It basically is a Chipotle with booze, except the food at Chipotle is way better. \n\nI had the carnitas salad, which consisted of romaine lettuce, pickled onions, carnitas and some awful pork rind thingies. Nothing particularly interesting, inventive or good about it. The food came quickly and the margarita was fine. \n\nAnother thing that bugged me was one of the giant TVs was tuned to a network evening news program. I don't know about you, but when I want drinks and fun evening out, seeing various dramas/tragedies being broadcast doesn't exactly add to my experience. This was a one and done for me, I won't be back."
        }, 
        {
            "index": 149, 
            "rating": 5, 
            "review": "I will definitely have to come back when there's happy hour. Sat at the bar a few weeks ago .. The bartenders Were super nice and helpful . Had beer, elotes, tacos and some unlimited chips and salsa . Pretty filling. Their taco selection were very tasty. I love the atmosphere . Very crowded , which is a good thing!"
        }, 
        {
            "index": 150, 
            "rating": 3, 
            "review": "In all honesty I didn't think this was memorable. The service was good and the food was mediocre. \n\nWalking in the vibe reminds me more of a cantina located on the beach. Not an authentic Mexican cantina. The waitresses were friendly but short of awesome. Amanda are server was great at refilling our drinks and keeping us with food in front of us. \n\nThe steak tacos had to be some of the worst tacos I've ever had. The shell was that awkward in between.. Was it hard? Was it soft? It was like a soft tortilla was half way fried. Not good. The fillings were minimal. The Barbacoa filling was delicious but again the shell Was confusing. \n\nSalsa was normal, nothing super tasty. Chicken quesadilla was amazing. The aioli inside was chipotle. Tangy goodness. Margarita was good too but it wasn't out of the ordinary since it was a margarita mix. The Elote was good but I've had better on street corners. There just wasn't enough sauces on it to balance the char. Good but not great. Pretty good price wise since it was free when you check in on Yelp. \n\nThe prices are affordable here, especially since Sunday all day is happy Hour specials. Also, Monday through Friday is happy hour 3-6. I would only come back for happy Hour."
        }, 
        {
            "index": 151, 
            "rating": 3, 
            "review": "Not busy but service was sketchy.   Was not acknowledged when entering and pretty much ignored after that.  Food was good.  Great guacamole."
        }, 
        {
            "index": 152, 
            "rating": 5, 
            "review": "The bartenders Justin and Elizabeth are amazing! They treat me like family every time I go there. Excellent place to chill out and watch the games inside or outside. Great food. The Barbocoa over a bed of rice is amazing. They stay true to their Ensenada roots with the decor. Best local hangout spot"
        }, 
        {
            "index": 153, 
            "rating": 5, 
            "review": "I was so excited to see so many vegan options that I wanted to order everything. Our server was very friendly and informational!  We sat in the bar area. (I forgot her name but she was blonde and wearing a head band) Ended up getting 2 tacos, gardein steak and fried avacado. SOOOO GOOD! Also got the original margarita on the rocks that was delicious. (I hate bad mixed drinks) Oh yeah and our server kindly informed us the rice and beans are vegan too. Score \nMy meat eater boyfriend got the chicken burrito and was loving it as well.\nWe will be back!"
        }, 
        {
            "index": 154, 
            "rating": 5, 
            "review": "Never a disappointment! Love the food and the great service here! Matt was our bartender. He had great suggestions and the drinks were great! I ordered the Cadillac and my boyfriend ordered a mojito! First we had the chips and salsa which I love all 3 salsas that come out. Next I ordered the grilled corn(which is free when you check in)! It had great flavor, came in a cute small dish. Not overwhelming amount which is good before my main course. I ordered the pork belly, Barbacoa, and Baja shrimp tacos which are AMAZING! I loved all 3! My boyfriend had the chicken quesadilla which was very good as well. Hussongs is one of my favorites. Love this place."
        }, 
        {
            "index": 155, 
            "rating": 5, 
            "review": "We came here with some friends a couple weeks ago, and couldn't be more excited to have found this place! As vegans, we've had a hard time finding restaurants that serve food we can eat. Hussong's has a whole vegan menu with four choices that can be put into tacos, salads, or bowls. The chicken tacos were SO good, and so was the fried avocado. We're looking forward to going back to try the two other flavors! Seating is very limited, but we got a table for our party of 5 quickly. Service was perfect, and they were happy to explain the menu items and answer all our questions. We're so happy to have an alternative to Chipotle or the veggie burger some places offer. We'll be back!!"
        }, 
        {
            "index": 156, 
            "rating": 4, 
            "review": "Best Sunday happy hour you can find. The tacos are both inventive and delicious. Not over the top and maintain a touch of authenticity. I usually sit outdoors and get the tacos and a large large margarita. Must visit, and then most likely visit again."
        }, 
        {
            "index": 157, 
            "rating": 3, 
            "review": "The interior is nice a cozy here at Hussongs! The service is also great, very attentive and great. Only disappointing thing was their tacos! I heard a lot of good things about their tacos but they defiantly did not impress me at all! In fact I didn't enjoy them one bit. I had the shrimp tacos and the sauce they put in it is just too much! They drenched the tacos with the sauce and the sauce was just too much! If the sauce tasted good it would be one thing but it wasn't at all. Same with their carnitas taco, the meat was dry and not tasty at all."
        }, 
        {
            "index": 158, 
            "rating": 3, 
            "review": "Overall, this place was okay and the prices were higher than expected.  We ordered two taco plates with rice and beans. The steak and barbacoa tacos were the better options. The chicken taco was okay, but the meat wasn't very flavorful. The carnitas taco was dry and probably the worst option. The tacos were served on soft corn tortillas, that looked heated in oil. They serve their plates with cilantro lime rice and pinto beans. \n\nThe service wasn't bad. The bartender took our order and a waitress showed up to see if we were doing okay and  brought our food. \n\nUnlike other places this one charges $2 for bottomless chips and salsa. Not a fan of this...especially if you're charging $10 for 2 tacos w rice and beans (add $$ if you want a 3 taco plate). The salsa is a self serve salsa bar with 4 types of salsa. A mild pico de gallo red (meh), tomatillo (the best option), a spicy red sauce (2nd best option), and the fourth was a spicy green. \n\nBottom line, the food wasn't exceptional and it cost $38 +tip for x2 3 taco plates with rice and beans with chips/salsa and 2 beers. Not cheap for a Mexican style lunch. I should mention they have cheaper prices on the menu for happy hour (3-6pm), but I wouldn't make a special trip for HH."
        }, 
        {
            "index": 159, 
            "rating": 2, 
            "review": "Came to this spot last week and it was dead. Sat at the bar with some friends. Ordered the barbacoa quesadilla, but had all the grease running down my arms, and 3 of the 4 pieces fell apart. Had a few margaritas, and a shot. I'm not sure how long this place will last if they don't charge customers for their drinks. Amanda, the little bartender with the southern accent didn't put any of our drinks on any of our tabs and just charged us for our food. We asked her if these were our bills and she said, \"yes.\""
        }, 
        {
            "index": 160, 
            "rating": 5, 
            "review": "Just got back from eating the best burrito. Definitely ask for Amanda she the best . The friendliest waitress I've ever met in Vegas.  5 stars"
        }, 
        {
            "index": 161, 
            "rating": 5, 
            "review": "After having some horrible luck this weekend at Boca Park, we thought we would give it one last try. Walked into this place, and even though they were busy, we were acknowledged and served quickly. Bartender was awesome. Only had the chips and salsa, but they were yummy. Would definitely go back!!  If you want great service and a warm friendly atmosphere, check it out!"
        }, 
        {
            "index": 162, 
            "rating": 5, 
            "review": "This cantina is one of our favorite eateries in general and without question the best Mexican restaurant in Summerlin.  We're from Santa Fe, New Mexico where there is so much good Mexican food and I think Hussongs offers top notch quality Mexican fare, service and a welcoming casual atmosphere.  We usually go there for dinner and sit at the bar where Matt the bartender pours the best Margaritas in town and meets our every need no matter how busy it gets.   Last week I ordered the rib eye fajitas ( they will make it Paleo friendly for you if you ask) and that is so far my favorite dish.  I also recommend any of the tacos, especially the pork belly.  The Ceviche.... best I've had in the city. The quality of food and service makes it our top choice for dining out at least once a week if not more."
        }, 
        {
            "index": 163, 
            "rating": 4, 
            "review": "I hate to say it, but I like this place. Some may be turned off the the over-flare-ification of the interior or the high-priced Mexican fare (at least compared to hole-in-the-wall spots). But, the tacos and street corn won me over. The char and prominent cotija flavor of the former make it worth getting, especially when it's free for checking in. \n\nAs for the tacos, the pork belly is my favorite. Balanced sweet and savoriness, varied texture with the cabbage mix and most importantly it was topped with chicharrones. What's not to like? The barbacoa was a close runner-up. Who cares if it was messy with its sauce dripping everywhere. It's still bold flavored and delicious. \n\nLess noteworthy, but still decent were the chicken tacos and carnitas. Taco platters come with two tacos, which you can mix-and-match. Rice and beans can be hit or miss. The first time around the rice was better than almost any rice I've tried at a Mexican restaurant -- light, fluffy and buttery. The second time around... not so much. Still, Hussongs is a worthy spot to hit up as long as you don't mind paying a little more for tacos.\n\n3.5 Stars"
        }, 
        {
            "index": 164, 
            "rating": 4, 
            "review": "The service was great! The bartender during happy hour was informative and attentive! While the food was good I wish it was more memorable, besides the burning sensation of spiciness in my tummy I actually don't remember what our  food really tasted like! We will probably come back to try something else and see if anything else would be more memorable!! I would say give it a try!!"
        }, 
        {
            "index": 165, 
            "rating": 4, 
            "review": "We had a great experience. The ambiance was okay- somewhat like a sports bar. We made it for the last few minutes of happy hour, and the bartender let us know it was still HH and she took our order right away. The chips and salsa came with 3 salsas. I loved the spicy salsa and mango salsa! Both had great flavor. The more mild red salsa wasn't my favorite, but my BF loved it- to each their own! All staff were friendly and service was fast. They took a custom veggie order for a chimichanga, which made me happy. And my BF really liked the HH carnitas tacos. OH AND the margarita were great (no mix) and not too sweet. We will be back."
        }, 
        {
            "index": 166, 
            "rating": 4, 
            "review": "Good service, Baka shrimp tacos are awesome. Good drinks, micheladas and churros but the street corn could improve a little. Good happy hour but need to have a late night one too, for those who work through the early evenings"
        }, 
        {
            "index": 167, 
            "rating": 5, 
            "review": "Great margaritas!  Love the street corn!  And they even have a good Chardonnay.  The atmosphere is delightful and people friendly.  Happy Hour 3 to 7!  This is a great addition to the Summerlin food scene."
        }, 
        {
            "index": 168, 
            "rating": 5, 
            "review": "Hussong's Cantina has just opened their new location in Boca Park and they prove again they're masters at the best Mexican food and drink!   After years of steering clear of margaritas due to the sweet and syrupy taste, I reclaimed being a fan....but only of the \"Original Margarita\" at Hussong's!  I actually can't wait to have another one!   As far as the food, since I am a bit of a health nut, I am very particular about restaurant food and was thrilled to see great options in veggie entrees, gluten free items and the best part is that it is all freshly made!  \nI will be going there again very soon!!"
        }, 
        {
            "index": 169, 
            "rating": 5, 
            "review": "Awesome place.  Chris is great! Suggests drinks and food items if you were never here. The music is great, atmosphere is comfortable and friendly. The food is amazing, the steak quesadillas are delicious and crunchy as well as cheesy and yummy. The Original Margarita is perfect. I will definitely come back."
        }, 
        {
            "index": 170, 
            "rating": 5, 
            "review": "This place is amazing!!!  So much more fun than Kona Grill!!!  The atmosphere is wonderful and service is so great!!!  The food is delicious too!!!  And Amanda is the BEST bartender ever!!!"
        }, 
        {
            "index": 171, 
            "rating": 2, 
            "review": "Heard about this place so decided to go to lunch on a Monday afternoon. First when I walked in I stood there waiting for someone to say Hi or even notice I was there but that did not happen. Asked the lady standing there too if she could seat me and she laughed and said she was hoping I could do that as she was a customer too. Finally saw the sign to go to the counter and headed that way. \nServer at counter said Hi then I asked her to explain this concept and she did. Somewhat I got from her was basically this is a cafeteria  with a bar. You order from service counter then get a long stick with a number of  it and then go sit down. Some drinks come from  the bar and some they give you before you leave the counter where you also pay before you leave there. Sat àt the bar and bartender served my beer then the counter person brought our food out on a tray and took long stick with number. Really felt very cafeteria  style  and had ordered the steak nachos. Not the worse I have had but then again not the best. While at bar I kept noticing how people kept walking in and just looking lost like I did. \nProbably will not returned as the experience was not anything worth a second visit. The concept is not what I would describe friendly,  warm or even welcoming."
        }, 
        {
            "index": 172, 
            "rating": 4, 
            "review": "This is my 10th time here and it was awesome like usual. Our friendly waitress suggested some new menu items and we went with the shrimp guacamole. It was the best guacamole I've ever had and I've had a lot. It came with some pork rind on the side and 3 salsas. Their margaritas were voted the best in vegas this year by the lvrj and I'm not going to argue. \nWe came in here after a bad experience at a Mexican place down the street in Tivoli village."
        }, 
        {
            "index": 173, 
            "rating": 5, 
            "review": "I've been wanting to eat at a Hussong's forever and was never able to make it down to their locations in Mexico.   Growing up in LA, I know good Mexican food and was really looking forward to trying them out; I was NOT disappointed!  \n\nYou enter the door and go straight to the counter to place your order.  Their prices are economical and comparable to Chipotle or Qdoba, but oh-so-much better!  My fiancé had the carnitas tacos with rice and beans ($9.95) plus the bottomless chips and salsa for $1.95 (freshly made chips and a salsa bar for the grazing...good stuff!).  I had the chicken bowl, which included chicken, cilantro-lime rice, cheese, pineapple (it also comes with guac and onions, but I got it without).  it was delicious and a heaping portion!  I couldn't have been happier!  Speaking of happy, we were there during Happy Hour and though there are no food specials, the drinks are half off and with that, I had one of the best Margaritas I've ever had!  The beer selection is good and the well tequila was really, really good.  \n\nWe were there on their grand opening night (and totally by accident) and the service was ON POINT!  Every staff member we had contact with was friendly and happy; the manager and several other servers in the bar area kept checking back with us to make sure we had everything we needed and if everything was perfect.  Very attentive and genuinely concerned about our experience.  \n\nA great experience and we will come back again and again!!!"
        }, 
        {
            "index": 174, 
            "rating": 3, 
            "review": "Went to this restaurant for lunch and the costumer service was very good. Was able to sit right away and the waiters were very welcoming. Me and my Co workers thought we would be able to receive our free street corn for checking in on Yelp but because we were using a Groupon we weren't able to redeem both deals. I think if I were to go without the Groupon this place would be way too expensive for Mexican food. I didn't like the fact that you had to pay for bottomless chips and salsa either. Their salsa was good but not anything remarkable about it. I ordered the chimichanga with carnitas and red sauce and the burrito was great. I love the red sauce sort of thick so it was perfect for me. The rice however wasn't anything special, very basic. I did however get their street corn and that was great! Probably the best thing there! All in all I think this place was great but a little pricey for Mexican food. If we hadn't used a Groupon our meal would have probably been around $60"
        }, 
        {
            "index": 175, 
            "rating": 1, 
            "review": "Worst customer service....my wife asked for flour tortillas as she ordered and was told NO next time it's too late...it didn't end there I'll never waste my time or money going back...staff needs more customer service training...food was ok but not up to par for Boca Park"
        }, 
        {
            "index": 176, 
            "rating": 1, 
            "review": "The food is overpriced and bland. The decor is gaudy. It is supposed to be a restaurant and margarita bar but it has a very fast food vibe - think a more expensive version of chipotle. The time when I went in particular the chip and salsa bar was understocked and I wasn't able to eat any of the bottomless chips and salsa that I paid for during the course of my meal. This place pales in comparison to the restaurant that used to be here which only adds to the disappointment I feel about this venue."
        }, 
        {
            "index": 177, 
            "rating": 3, 
            "review": "The Mandalay Place I believe has this exact restaurant & even though the happy hour all day Sunday is a great idea, friendly quick staff, the food is just ok.  Many other Mexican restaurants out there that are better.  The margarita was very sour.  Good spot for a large group, nice atmosphere for it & prices.  \n\nCheck-in for a free yummy Mexican corn so I'll be back now haha.  As long as I've been to a Hussongs Cantina, it's always just been so-so & convenient.  Happy Taco Tuesday & happy hour!"
        }, 
        {
            "index": 178, 
            "rating": 4, 
            "review": "Shout out to House for being awesome! I liked that you could pick your own salsa, and the endless warm chips made our hour happy!"
        }, 
        {
            "index": 179, 
            "rating": 1, 
            "review": "I don't often leave behind a whole plate of food I've paid for and look for a second restaurant for dinner. That's exactly what I did at Hussong's. \n\nMy wife and I ordered chicken nachos, steak tacos, chips and guacamole, and tried all of their salsas at the salsa bar. \n\nMy wife and I only ate half of a steak taco, three nacho chips, two bites of guacamole, and a few dips of salsa. Everything but the chips was terrible. The chips were just standard low end chips.\n\nThe nachos, chicken, and salsas can be summed up with the phrase, \"what is that flavor?\" For the chicken it was something red that doesn't quite taste like tomatoes. For the fresca salsa it was something that tasted like tomatillo but not, and was much stronger. For the hotter salsas it was something that reminded me of a mole, a deep rich flavor that clashed hard with the salsa. For the nachos it was a combo of whatever makes the chicken gross and something green that I have no idea what to compare to. \n\nThe steak tacos were a complete joke. Easily some of the lowest quality meat we've had. Even by Mexican restaurant standards. We weren't expecting filet or ribeye, but this meat was just pure gristle and tendon. Totally unacceptable. \n\nFinally the guacamole. It might as well have been a bowl of cilantro. There was so much cilantro it was completely inedible for both of us. My wife looked at me incredulously when I called it \"inedible\". Sometimes when it comes to cilantro I can exaggerate a bit. So she took a bite, looked at me with a funny look on her face, and said, \"wow, you're right: inedible.\"\n\nIn the end -- about 4 minutes after the beginning -- we got up, still hungry, and walked away from a still-full table of terrible food.\n\nI lost $30 so you don't have to. You're welcome."
        }, 
        {
            "index": 180, 
            "rating": 5, 
            "review": "You had me at \"All Day Happy Hour\" on Sundays!\n\nCame here around 8:30 Sunday night (be prepared to have to fight to find parking because this little shopping center is packed 24/7)\n\nAfter about fifteen minutes of circling the lot like two hungry sharks we finally got lucky and snatched up a spot.\n\nGot seated right away and our server, Angelica, was super quick and attentive!\n\nOrdered:\n\nClassic Margarita\nStrawberry Swirl Margarita \n\nBoth 5/5 strong tasty and refreshing!\n\nChips and Salsa (Serve yourself Salsa Bar) .95c\n\nGuacamole $2.95\n\nQueso Bean Dip $4.96 (free with Yelp check in offer)\n\nChicken Nachos $5.95\n\nAll these were Happy Hour Prices and I think our total bill came out to only $22.00 total!\n\nDefinitely our new Sunday Happy Hour Spot!"
        }, 
        {
            "index": 181, 
            "rating": 3, 
            "review": "Came during HH at the suggestion of other reviews: It's 3PM-6PM, Mon-Fri, FYI. Half-off limited drinks, no food specials. Only the Original Margarita is discounted (down to $5), and it's a full-sized glass instead of the typical lowball glass one might expect. I don't know if I'd splurge the $10+ for a specialty version, but the lychee one sounds delicious.\n\nFood menu is pretty basic, with two-taco plates running $10, additional options for burritos and nachos. They get bonus points for offering vegetarian options and barbacoa, which has been difficult to find in Las Vegas- their version isn't great, but it's adequate. The $7 order of nachos (+$2 for protein) is on par with Chipotle in terms of size, taste, and price. \n\nThe service was really great, Mario and his sidekick were friendly and outgoing and checked up on us frequently. Aside from that, this place was a bit more average than I had hoped for. Considering Hussong's has been around 120+ years, the food was very Americanized... as were the prices."
        }, 
        {
            "index": 182, 
            "rating": 2, 
            "review": "Was going out for dinner and first choice was Cheesecake Factory which btw I should have went to. Instead decided to try Hussongs. The waitress gave her recommendations before I checked out the menu. Once seated and looked over menu I decided to order the enchiladas with carne asada meat. When my dinner came out immediately I noticed the wrong beans on the plate. It was taken back and delivered with correct beans. As I took a few bites I then realized they did not put the correct sauce on top that I specified I wanted when I ordered. The waitress didn't come to check on the table for awhile and when she did she offered to bring a side of the sauce. At this point I was over it. The food wasn't the best and I will not be returning. The manger was kind to take some things off the bill but overall I wasn't satisfied."
        }, 
        {
            "index": 183, 
            "rating": 5, 
            "review": "The staff is great. Friendly and welcoming. Service was smooth during this grand opening day too. \n\n We sat at the bar (you have to order at the window if you want to sit at a table). The nachos with carnitas (pork) were way delicious. Definitely happy about this location and hope they thrive"
        }, 
        {
            "index": 184, 
            "rating": 5, 
            "review": "Very delicious, flavorful, and tasty food! \nYou can sit inside or enjoy the outside. \nThere are several large TV screens for your viewing pleasure so you won't miss the game. \nThere's a full bar... and a salsa bar! \n\nThe food and decor make it appealing to want to sit for a while and hang out with your friends, be served, and have a few drinks. That's one option. \n\nYou also have the option to walk to the back, wait in a line, read the big menu on the wall, place your order, pay, then find your own seat somewhere (like at Wahoos or Panera) and they will bring the food to you. This is a great concept for people on their lunch breaks because it eliminates the middle man of waiting to order, pay the bill, etc."
        }, 
        {
            "index": 185, 
            "rating": 3, 
            "review": "This place can't make up its mind whether it's going to be ultra casual or trendy. Plastic utensils and tacos served in plastic baskets make it a family friendly place. But the large bar and focus on margaritas make it more of a trendy place. Food OK for happy hour. Would not necessarily recommend at full price."
        }, 
        {
            "index": 186, 
            "rating": 1, 
            "review": "We wait for at least 10'min they not even offer is a water... We just leave....  Bad customer service and also I went to the taco register they just ignore us."
        }, 
        {
            "index": 187, 
            "rating": 2, 
            "review": "Once was more than enough for me. This place is just weird. The seating is cheap and uncomfortable, the service is less than stellar, the decor was outdated(felt like Chotchkie's from office space), and the food left much to be desired. \n\nThe waitress got my friend's order wrong. Who would order dry enchiladas and better yet what waiter would not question an order like that? She spilt water on the table and decided to wipe it up with a dirty rag right next to my other friend's meal. Overall her attitude just felt shitty. \n\nAll of the flavors were odd and disappointing. Nothing I ordered mentioned cilantro yet it was found all over my meal. The fried avocado was heavy, oily, and just not good. Caramel filled churros contained exactly zero caramel. The biggest disappointment was the street corn. It was easily the most bland street corn I've tried. \n\nThe only reason I might find myself back there would be for the happy hour but I'm definitely in no rush."
        }, 
        {
            "index": 188, 
            "rating": 1, 
            "review": "Sucks. Very rude staff. Not even worth 1 star. Staff really does not know customer service the place is kind of messy and dirty as well. Look at the salsa bar if you dare go there. \nWe are told by a female employee to sit down and then they will clean the table for us. We wait 5 minutes. This is the only table available to seat 4.  Then this male manager or whatever he is comes by and says get up I need this table. I ask him where we should sit and he says he will switch us. We get up wait 5 minutes again and nothing happens.  This is a terrible way to treat customers. I was never nasty or loud either. I guess he was having a bad night and enjoyed taking it out on me. \n   We went to the CHEESECAKE FACTORY and had a pleasant meal that was delicious and we were treated very nice by their friendly staff"
        }, 
        {
            "index": 189, 
            "rating": 3, 
            "review": "First off,  let me say the wait staff is great. The food however is at best mediocre.  I had chicken al pastor that was good,  my friend had steak tacos that  were gross. Four pieces of large gristle in two tacos,  what gives? The cook couldn't see them? That really put me off my lunch. Would not recommend,  or go back. This was my first and last  time."
        }, 
        {
            "index": 190, 
            "rating": 2, 
            "review": "My friend and I went just last week for the first time after hanging out at Sambalatte. Looked cool especially the location so figured we would go to it since we were also hungry. We weren't really quite sure about the salsa bar until much later after we got seated. \n\nMy friend is vegan and she specifically said vegan. The waitress comes out with the vegetarian salad which my friend ordered and had dairy on it-yogurt (the waitress should have mentioned about dairy). As a waitress, you should know the menu and know the difference between vegan and vegetarian. As soon as my friend got her salad she asked what the dressing was and the waitress didn't know. She went back to the kitchen to ask. \n\nThen, my dish was wrong. I ordered Baja shrimp and I got carne asada. Whole order already messed up. I feel like the waitress was paying attention more to the guys at the bar than us-it was pretty slow in there. \n\nI gave it two stars because the shrimp was ok. I wouldn't come back again because Del taco tastes much better, lol. And I'm all about cuisine and not fast food."
        }, 
        {
            "index": 191, 
            "rating": 3, 
            "review": "Really enjoyed the atmosphere of this place and what we tried of the food was amazing. The habanero mango guacamole was the best guac I have ever had. The set up for ordering and seating is very confusing and I noticed a lot of people left assuming they would get served. I think for this place to be successful it would need to probably change this ."
        }, 
        {
            "index": 192, 
            "rating": 1, 
            "review": "What gives Vegas? Not a single mexican joint worth a shit in this town, this one included. How hard is it to make mexican food!? Apparently REAL DAMN HARD in sin shitty."
        }, 
        {
            "index": 193, 
            "rating": 5, 
            "review": "This place is awesome, Mexican food made vegan, Whaaaa??!?!?! I've only gotten their take out so I can't account for the innards of the restaurant but I can for sure tell you about the taste of their food. \n\nFirst their vegan habanero guacamole is the bomb. Not spicy enough for a spice chaser but it's super delicious. I'm always leery of getting guacamole at places since a lot use dairy ingredients in their dip, but with the vegan seal of approval, I'd have to say this is the best vegan guacamole I've had yet! Paired with their crispy warm and salty tortilla chips...heaven! \n\nMy favorite item is the vegan chimichanga with the faux chicken strips. It's so crispy and cheesy, and yummy. They really can make the food taste flavorful without using the typical ingredients. \n\nI 100% recommend Hussong's, try it out, you'll love it!"
        }, 
        {
            "index": 194, 
            "rating": 2, 
            "review": "Slow service.  No drink refills when we needed them.  Only three tables with customers in the place.  Food was okay and that is why they got two stars."
        }, 
        {
            "index": 195, 
            "rating": 3, 
            "review": "The tacos are decent, the guacamole is good, unfortunately the margaritas are less than desirable. All you can taste is lime juice because they put them in a giant 16 oz glass. I'm sorry, but I like to taste tequila in my margaritas."
        }, 
        {
            "index": 196, 
            "rating": 3, 
            "review": "food is pretty good, but the service is pretty bad.... there's only one waiter and one bartender in the whole place on a saturday night..... go figure how that  works..."
        }, 
        {
            "index": 197, 
            "rating": 4, 
            "review": "The food was great. My salad was flavorful and perfectly seasoned. The atmosphere is not what I expected - it's more like \"upscale\" fast food seating with few actual dining tables, a large bar and very loud music. There are tons of tvs for sports fans and the salsa bar was a nice touch (though plastic cups again made me think of a fast food joint). Service was very slow but we werent in a hurry so it didnt matter and maybe our servers sensed that. I wouldnt go again for a nice meal out but I would totally go to watch a game while enjoying a margarita and bottomless chips and salsa."
        }, 
        {
            "index": 198, 
            "rating": 5, 
            "review": "This was our FIRST TIME here and I do NOT know what the hell people are talking about with bad reviews???  The service is FANTASTIC and the food was out before we could even CONSIDER wondering where our food was!!! Elizabeth was FANTASTIC and the food was DELICIOUS!!  VERY flavored and VERY fresh!!  Stephon served us our food and he was SWEET and SUPER FAST!!  LOVE IT AND WILL BE BACK!!!"
        }, 
        {
            "index": 199, 
            "rating": 1, 
            "review": "I really wanted to like this place.\nI ordered delivery (through Eat24)\nCraving pozole I ordered 2 bowls, assuming they were small because of the price. But not THAT small. Didn't even fill up a coffee cup.  It didn't taste fresh (granted it was 8pm so it was prob sitting all day. They put the cabbage in the soup instead of serving it on the side so it was wilted and had no flavor. Also ordered ceviche and chips and salsa. Ceviche was great.. bag of chips was huge and the salsa wasn't included. Not sure if the driver didn't check or if the restaurant left it out but the while experience was wet disappointing."
        }, 
        {
            "index": 200, 
            "rating": 1, 
            "review": "We walked in several days ago to enjoy some lunch on the patio.  There was no hostess, so after waiting a few minutes, we seated ourselves at one of the two empty tables.  Neither had been cleared from the previous guests.  We waited about ten minutes, but no waitress or bus-staff appeared on the patio, even though it was busy.  Finally, a waitress showed up on the patio and helped a couple of tables.  As she was leaving, without stopping at our table, I asked her if she was our waitress.  She replied there was another person working the patio with her and said \"oh, you haven't been helped yet?\"  and left.  We expected someone  to return with menus and to clean the table.  This did not happen, so after five minutes we left.  Management seems to be MIA and the staff appears to be poorly trained.  I can't comment on the food because we were never able to order any, but the service, obviously, is horrible."
        }, 
        {
            "index": 201, 
            "rating": 2, 
            "review": "Though the name resonates with an upper middle aged crowd, this Summerlin eatery falls short in many categories and is simply not worth the time or money. Despite its rich long term history due to its namesake and original location, this restaurant seems like it just tries too hard to be hip and cool and ends up resembling something more like Carl's Jr. but lacking the cheap eats value. \n\nWhen you enter, you are asked to order from a counter. Then you can opt for \"full service\" where the waitstaff will supposedly check on you and refill your drinks. To opt for this service you must leave a CC at the counter to establish an open tab, regardless of whether or not you accrue additional charges. Then once you order, you are given a number and told your food will be delivered to your table. How they know who is \"full service\" and who isn't I have no idea and it didn't really matter anyway as we left a CC with them yet not ONCE did a waiter come by to offer refills or check on us. \n\nWe left the table to refill our own drinks from the soda fountain and collect our CC prior to departure. The best value we experienced here was our lack of need to tip. \n\nOverall, the only reason I gave a 2 star instead of 1 is I did enjoy the overall aesthetics. The kitschy 80's and 90's era toys like Stay Puft Marshmallow man and PeeWee Herman doll were nostalgic and cute. But when it comes to the food and service, stick to Carl's Jr. At least when they deliver the food they usually ask if you need anything else. Hussong's could learn a few things from them."
        }, 
        {
            "index": 202, 
            "rating": 5, 
            "review": "Good prices on happy hour and good food! Our server Amanda was very helpful and didn't mind us taking photos in the sombreros. Steak tacos were very good!"
        }, 
        {
            "index": 203, 
            "rating": 1, 
            "review": "If your looking for a great Mexican restaurant, don't go to Hussong's! That has got to be the worst restaurant I've eaten at since I've been in Vegas 12 years & I eat out a lot ! There's a lot of great restaurants in this town & I can honestly say this has been THE ONLY bad restaurant we've been to...so what does that tell you??\nThe whole experience was terrible...starting with their salsa sauce! How do you mess that up? They do....\nIt's tangy & tart...I didn't taste any garlic or cilantro...very bland & tangy ...no zip to it! And for starters, they are the only place I know that charges for chips & salsa in a Mexican restaurant . It's only $1.95, but it's the principle , & their chips are aweful too! Thick & hard...I like thin & airy chips.\nSo that's the 1st 2 things wrong. I order a frozen margarita, it comes out on the rocks, so I send it back. The guy brings it out to me frozen, but with no garnish?? Maybe they're saving their limes...who  knows, but I take the 1st sip, & my mouth started to draw up on the sides from it being so tart, so I bring it to the bar & asked the guy if he could put more triple sec in it to sweeten it up a bit & he takes the drink from my hands & goes behind the bar & puts a topper of triple sec in my drinks & hands it back to me...all with not saying 2 words to me! I stir it up, taste it, but couldn't tell a difference, so I said I need more in it. Let me drink it down a bit so you can add some more. He seemed annoyed that I was even asking, but I went to hand him my glass again, but instead he reaches down for a shot glass & fills it 1/2 full w triple sec & I said that's perfect & picked the shot glass up & walked back to my table. That's when I realized this guy has got an attitude, cause this whole process has gone on & still not one word from him! As a paying customer, he made me feel like I was a pain in the ass, but the real truth is....if they had a good bartender that knew how to make drinks, I wouldn't be bothering him to fix this drink that sucks, cause my drink would be spot on!\n\nNext, we order our food...Dom & I both order cheese enchiladas. I ordered mine w extra cheese & green sauce. I ask our server what kind of cheese do you have...cheddar, Jack ? She says no we don't have either of those...we use this Mexican cheese blend, so I said ok, not really knowing what these enchiladas are going to look like. She walks off & Dominic says to me \"if they don't have cheese, then how are they making our cheese enchiladas\" & I said good question. I get up from the table & walk over to her as she's putting our order in & I ask her that question. She says well, it's a blend that we use & I said does it melt? Cause I like a stretchy cheese on mine & she says yea, it melts & I said ok & don't forget extra cheese on mine & she says yes I know. The meal comes out & mine looks exactly like doms...- no extra cheese, both had a drizzle of a thin white sauce on top. There is NO CHEESE AT ALL THAT WAS VISABLE....huh ? None on top of the enchiladas nor on the refried beans...NO WHERE! I  don't say anything & we both start eating & Dom says this tastes like shit & I said I was thinking the same thing...but didn't want to complain since I already started off complaining about my margarita , but when he said that , I said OMG , I was  thinking the same thing! I thought it was just me thinking this food just doesn't taste right, but we both were on the same page ! That Mexican cheese they used to make the enchiladas sucks! No cheese on top & the extra sauce I ordered (green sauce) that she charged me for...I never touched cause that too was very tart & sucked! It was so dark green, I thought maybe it was seaweed puréed ...lol , no kidding...that's their green sauce...dark & tangy!\nWhen I tell you nothing was good in this place...I mean it!!!\nThis place is not a true authentic Mexican restaurant ...I think maybe they're from the Middle East & that's middle eastern  food or cook  we had...look at the name \"Hussong's \", maybe Asian ...whatever it is, DON'T GO! I promise you'll be disappointed just like we were! I knew something was off when I'm in a \"Mexican restaurant \" & the music that's playing is classic rock ! Where's the ambiance of being in a Mexican restaurant ? I thought I was at PT's pub for a minute .... What a joke this place is!!!!!\nThey don't even deserve the 1 star I gave them, cause the whole place had an attitude! That place won't make it...you watch! They took over Embers space in Boca Park by the Cheesecake Factory . What a waste of $30 that was...I only wish I would have taken a pic of the food so I could have posted it here so you could see for yourselves that everything I've said is true! Neither one of us could finish  our meals, & it wasn't because we got full...because it was all we could do to eat 1/2 of it, that's how  bad it was! We both had 1/2 our meal still on our plates when we left....we just wanted to get out of there !\nThat was our 1st time there & our last"
        }, 
        {
            "index": 204, 
            "rating": 5, 
            "review": "Ordered a rice bowl with steak. Not bad. Salsa bar is outstanding. Margaritas were above average. However our server Amanda was the highlight of our lunch !! Will come back just for her !!!"
        }, 
        {
            "index": 205, 
            "rating": 2, 
            "review": "My family and I normally love this place up until this past Friday night. I was lucky enough to come here prior to them opening to the public to sample and critique the Cantina. I loved it! we have been here a minimum of 10 times since then. Back to Friday Night and the 2 star rating! \nWe get there at 9:00 pm, order our food, sit down outside, in a few minutes we get our food served by the gentleman from the kitchen. the waitress that was helping the other patrons outside literally blew us off completely.\nThere are 2 other tables being occupied, the manager comes outside and greets the couple next to us and asks how their evening is and if everything is alright, they chat for about a minute. He then proceeds to pass our table and goes to the next table and asks them the same questions, they chat a little longer, wait.. here comes the big issue.. the manager looks at me and my group with a look of disgust, turns and walks back inside! WTF!! seriously?! \nWe paid for our food like everyone else in this place, why not ask us, how our food is? I did not want to make a big deal because I don't want the girls to feel uncomfortable, but the manager continues to stare at us from inside, but never came out again. \nMy husband had to go to the front counter to ask for a to-go box and to refill our drinks. This is the first time I have ever felt so little in my life! Need less to say we did not leave a tip and i felt horrible, but like my husband said, since we were invisible to the waitress, she got an invisible tip too! She did nothing for us, not one word to us for the hour we were there. \nI hate to tell my daughter that we will not be going back, because, us being Mexican, we think the food is actually delicious. I dont fel comfortable returning. I was really hoping that is was not a racial issue (we are a biracial family) because this is the first time i had seen that certain manager and we were treated like crap.. but after reading some of the other reviews, they pick and choose who gets good service :( \nI will not recommend this place to anyone again. Good food, horrible service by those 2 who worked on 11/6/15."
        }, 
        {
            "index": 206, 
            "rating": 5, 
            "review": "The new destination in Summerlin, Hussongs kicks a**.  Two things - great service and great food!  Scott and Jeff have extended their groundbreaking venue at Mandalay Place with a patio and a great vibe!  Staff is friendly and setup is top notch, you won't be disappointed."
        }, 
        {
            "index": 207, 
            "rating": 3, 
            "review": "Service was slow and it was not that busy. Our server had to be reminded to take the free corn off of our check since we checked in through Yelp. The enchiladas were yummy as well as the margaritas. I didn't care too much for the corn on the cob; it was different than expected. Overall this place rates as average. I'm not too impressed but I would go back if I was thirsty for a margarita in Boca Park."
        }, 
        {
            "index": 208, 
            "rating": 4, 
            "review": "Fun little place to go to for margaritas. They often have coupons as well, and the service is good. Love going to see the bartender, House. He's always super friendly. Their salsa bar is fun and their tacos are all super good."
        }, 
        {
            "index": 209, 
            "rating": 5, 
            "review": "Staff is very overly friendly. The food and drink was amazing. I make awesome enchiladas but I have to say theirs best mine wholeheartedly."
        }, 
        {
            "index": 210, 
            "rating": 2, 
            "review": "I actually prefer the strip location better. The  food and service at that one were much better and that's rare to say in my opinion."
        }, 
        {
            "index": 211, 
            "rating": 1, 
            "review": "High hopes but sadly disappointed. Not expensive but added up quickly. Girls seemed like they'd rather be anywhere but there with a splash of conceitedness. We asked if the habanero guacamole was really spicy or just had a hint of the flavor and the employee said it wasn't spicy at all. So for $6.00 we got it and the portion was ridiculously small. Robertos gives more food than that and actually would have rather gone there . The portions were way smaller than expected especially bc the heavier set girl said they were big enough to share. WRONG."
        }, 
        {
            "index": 212, 
            "rating": 1, 
            "review": "No integrity, no quality control & no respect while expecting way to much money for the crap they put on a plate or glass. Never to return after this second disastrous dining experience."
        }
    ]
}