{
    "category": "Las-Vegas", 
    "entity": "Delhi-Indian-Cuisine", 
    "avg_rating_stars": 4.248971193415638, 
    "review_count": 486, 
    "reviews": [
        {
            "index": 1, 
            "rating": 5, 
            "review": "I can't speak highly enough about this place. If you're coming for the Buffett but come late (after 3pm) like we did, don't be afraid to order their sampler. It's awesome! We had so many things. I'm no pro when it comes to Indian food but the Tandoori chicken was the best I've had out of the ~10 other places I've been. The butter chicken was really good and their. \n\nThe service was attentive enough and they didn't make us feel like they were hovering even though there were only a couple of other tables seated. When we were unsure about something, they were patient and pleasant when explaining."
        }, 
        {
            "index": 2, 
            "rating": 5, 
            "review": "I love their buffet. They had briyani when we were there for lunch a few weeks ago. Friendly server."
        }, 
        {
            "index": 3, 
            "rating": 5, 
            "review": "We are Indian and we loved the food.  We had Paneer Tikka Masala, Bhuna Gosht, fish tandoori tikkas, lacha paratha, and Tasmania for desert.  Every dish seemed to be perfect.  The fish was perfectly cooked, tasty and not over cooked.\nTwo minor things I didn't like:  color added to the planner giving it a bright red color.  Unnecessary in my opinion.  Second the Bhuna Gosht was a bit salty (my wife thought it was perfect), but this is something you can tell them when you place the order.\nAlso I had 2 glasses of the 2008 Perez Cruz Cabernet which I enjoyed.  Just give it time to breathe."
        }, 
        {
            "index": 4, 
            "rating": 5, 
            "review": "Our cravings were satisfied indeed! Chicken biriyani was amazing (5 stars). Chicken tikka masala with plain naan bread was ideal especially if you only eat chicken breast. I also got free mango lassi was delish!"
        }, 
        {
            "index": 5, 
            "rating": 4, 
            "review": "Got to order the \"Mango Lasse\" oh, sooooo good! Still the best Indian buffet for it's value and taste. Even the take-out for lunch is a huge portion enough for a big eater like me to have two portions."
        }, 
        {
            "index": 6, 
            "rating": 5, 
            "review": "The buffet is only $9.99 and the food is great.  I have been to many of the other buffets in town and this is probably the best.  \nAdd in the free drink with check in and u can't beat it.  This is my go-to place for indian food."
        }, 
        {
            "index": 7, 
            "rating": 4, 
            "review": "I really enjoyed myself here. The atmosphere was nice, the food was delicious, and the waiter did a great job. The chicken Biryani was delicious ! Can't wait to come back and try something else on the menu."
        }, 
        {
            "index": 8, 
            "rating": 5, 
            "review": "I was craving Indian food so I came here based on recommendations on yelp. the place including the bathroom is very clean. staff is super friendly and nice. the food was excellent. I tried everything on the buffet and they were all tasty. I especially loved the goat curry but I love curry in general. when u sit be sure to ask for garlic naan.  I was searching for saag paneer but it was displayed so I asked and they said they had run out but they made a small bowl for me. it was excellent as well. the buffet is only available for lunch and they temporarily close from 3-5pm so they can change for dinner. I think I found my Indian lunch buffet place. oh it's $10 which is cheaper than other places. I'd definitely be back for sure!!!"
        }, 
        {
            "index": 9, 
            "rating": 5, 
            "review": "Delicious briyani, highly recommend \nWaiter is very friendly and quality is good \nFood is not pricey compared with other food in Vegas"
        }, 
        {
            "index": 10, 
            "rating": 1, 
            "review": "Hardly any options for veg food and the veg curries were tasteless. Th white rice was not cooked properly and the Nan was cold. i did not like the appetizers or the desert as well. Probably the place was catered to non -veg folks but considering it was buffet i think it should have been better."
        }, 
        {
            "index": 11, 
            "rating": 4, 
            "review": "If you've been waiting to try this place I suggest you try and see for yourself what Delhi Indian Cuisine is all about. I've only tried 2 other Indian places in my Life both were in Vegas The first was India Oven and the second was Mount Everest. India oven was ok. Wasn't a big fan of that restraunt but then again I was also younger and not interested in broadening my horizons and trying different things. Mount Everest was really good their sweet rice was really yummy but they don't serve Garlic Naan anymore :( at lunch I believer so in comes Delhi. \n\n\n\nWe came at about 2 and there were 2 parties of people besides us eating here. They have the standard share of Indian offerings my favorite was the Chicken Makhani. It's probably my favorite Indian dish. It's super good especially with the garlic Naan. Free mango lassi with check in so that's also a plus. \n\nOnly thing I will skip next time is the Galub Jamun. It's a dessert. Little balls of I think bread in a almost diabetic coma sauce. It's wayyyy too sweet for me. \n\nI hope you last Delhi India cuisine. Just put the sweet rice on the buffet line and I will be extra happy !"
        }, 
        {
            "index": 12, 
            "rating": 5, 
            "review": "This is one of my favorite restaurants in town.  Definitely the best Indian.   The grilled paneer cubes are amazing.  The buffet is great.  Definitely worth it.  But for an experience you won't forget, go for dinner.  Too many great recommendations to list.  Just go, you won't regret it."
        }, 
        {
            "index": 13, 
            "rating": 5, 
            "review": "We missed the lunch buffet here by minutes, but were so resolved to try this food we stuck it out and came back for dinner hours.\n\nDelhi came recommended to us by a British friend who had spent two years in India as \"the best Indian food I've had in America.\" That's high praise from someone from the two Indian food capitals of the world (and perhaps having a palate more similar to an American than a native Indian)\n\nThe service was almost hilariously attentive since we walked through the door right as the place opened for dinner and it was all but empty.  I love a full water glass though, so even though being asked 10 times during dinner was a bit of an interruption, I can't complain.\n\nI foolishly filled up on delicious samosas at the beginning of our meal, but they were so tasty I can't be sad.  The vegetarian dumpling curry we had was surprisingly tasty.  The cashews in the sauce added such rich, thick, depth of flavor.  It is one of those dishes that makes you think, yeah, this is what I'd eat if I were vegetarian, and I wouldn't miss meat one bit.  ...But, speaking of meat, the butter chicken was an absolute dream. I've never had such perfectly cooked chicken in a curry.\n\nThe naan was also on point with a yummy chewy top and a crispy bottom.\n\n\nTo sum up how good the food was, my dining partner and I ended up eating so much of it we promptly went home and took a nap.  Bravo, Delhi Indian Cuisine, bravo."
        }, 
        {
            "index": 14, 
            "rating": 5, 
            "review": "I am Indian and am disappointed with restaurants' lack of proper flavor 90% of the time.  This place is different.  The lunch buffet gives you tons of options, and the dishes are prepared with care and taste delicious.  The tandoori chicken is moist, the pakoras have great flavor, and the garlic naan was right up there with the best I've ever had.  I'm going back immediately to try some dishes off the dinner menu!  The most telling detail about this place is that every single customer was Indian, not surprising at all for a place of this caliber."
        }, 
        {
            "index": 15, 
            "rating": 5, 
            "review": "This is the best Indian restaurant in Vegas ! I have tried every single one in this city, and I have never been as satisfied as I am here. \n\nThe buffet is not only the largest variety of any other Indian buffet in Vegas I have experienced, but it is also extraordinarily fresh and it is the most affordable. \n\nI award my highway recommendation!\nI bring friends and youngsters here all the time, those who have never tried Indian, and I have only seen the most positive experiences!\n\nEnjoy!"
        }, 
        {
            "index": 16, 
            "rating": 3, 
            "review": "I had dinner buffet. Their portion are about average. The food is OK, but nothing special. Its not too greasy, but the palak paneer isn't creamy. Malai kofta is OK. Their dal is OK. Their naan is average. Kind of surprised place has 4.5 stars. I would go here, but wouldn't go out of the way to go here."
        }, 
        {
            "index": 17, 
            "rating": 5, 
            "review": "This was the best restaurant I had food at since long time. Each and everything in buffet was amazing .. Highly recommend here !!"
        }, 
        {
            "index": 18, 
            "rating": 4, 
            "review": "Nice food. Their Garnic naan is good. Its better than few other places in Vegas. Their staff is nice too. Its basically owned by Nepali couple. Buffet is $10.99 plus taxes."
        }, 
        {
            "index": 19, 
            "rating": 5, 
            "review": "Excellent food .. Excellent staff and service  .. I'd like to come back again .. You have to try butter chicken"
        }, 
        {
            "index": 20, 
            "rating": 5, 
            "review": "We visited vegas for 3 days, on last day we decided to try a different indian restaurant out of the strip and found delhi indian cuisine via yelp, we are glad we tried it out. Food here was simply amazing, yummy and delicious with indian kind of spice level and highly authentic. \n\nWe went for lunch buffet - tried idly, sambar, chicken briyani, chicken gravy, reshmi chicken kabob, samosa, pakora, mutter paneer, navarathna kurumah aloo gobi. All the items were too good without any complaints and we truly enjoyed the whole experience. \n\nDessert - carrot halwa was too good and simply cant stop eating :). \n\nI would recommend anyone visiting vegas to definitely check this out , one of the must eat place. We will absolutely go here during our next visit."
        }, 
        {
            "index": 21, 
            "rating": 5, 
            "review": "Some of the best Indian food I've ever had. Clean environment, attentive staff, GREAT FOOD"
        }, 
        {
            "index": 22, 
            "rating": 2, 
            "review": "This place got great reviews so I figured I would try it. Well, not going back. 2 stars for the way it looked. The food all had the same spice level. The rice, both of them were really dry. The buffet is in one location that makes for poor circulation of people. Crowded, a lot of screaming children. Thanks but no thanks."
        }, 
        {
            "index": 23, 
            "rating": 4, 
            "review": "Overall definitely in the top 10% of the Indian restaurants I have eaten at across the country over last 15+ years. Chilli Chicken was really good and non-veg thali was alright. Service was great. I will go here again."
        }, 
        {
            "index": 24, 
            "rating": 5, 
            "review": "My family loved the food.. My kids had the greatest time ever.. We had a wonderful time and the food was amazing ... Thank you Hary for everything .. Amy"
        }, 
        {
            "index": 25, 
            "rating": 4, 
            "review": "Haven't tried any other Indian Restaurants other than Tamna in Las Vegas, the Buffet here, tasted very well, and its cheaper on off-long weekends."
        }, 
        {
            "index": 26, 
            "rating": 5, 
            "review": "The food and service was absolutely beyond awesome! We enjoyed the whole experience from the decor and ambiance to the service and food! I highly recommend this restaurant if you visit Las Vegas!"
        }, 
        {
            "index": 27, 
            "rating": 3, 
            "review": "I decided to try this place's lunch buffet so I could get a good idea of what they offered.  While there were a few good dishes on the buffet, I guess the flavors weren't quite what I expected. Also, the paneer was really quite hard and the pakora was over cooked and more hard than crispy. The goat curry was quite good, but I don't think I could justify coming back for just that. They may have a lot of selections, but having less selections and concentrating on quality might be the better way to go.\n\nI must say, the service is very good and their attentiveness is outstanding. It's something the other Indian lunch buffets here in Vegas could really use."
        }, 
        {
            "index": 28, 
            "rating": 5, 
            "review": "By far one of the best restaurants in Las Vegas! We eat here frequently, never disappointed, great service!"
        }, 
        {
            "index": 29, 
            "rating": 1, 
            "review": "AVOID!\n\nVisiting from Texas and had an extremely bad experience two days in a row.  First day we order food and waited for 45 mins without a single dish on the table.  Since we were in no position to go anywhere else and just wanted to eat indian food, we asked it to be packed and get to-go and were told we will have our food shortly.  After waiting for nearly an hour, we proceeded to walk out at which point the food was being brought to us.  After taking the food back to the hotel, we noticed there were several items missing.  \n\nExperience on Day 2 was similar with order placed for to-go and waiting for 40 minutes.  During our wait, we noticed two families walking out in a similar manner as we had on a previous day and also observed some patrons without menu and water for a long period of time.  Once again, we received the food after 45 minutes and took it back to the hotel.  AND THE ORDER WAS WRONG AGAIN!  \n\nFood quality was just above par, it wasn't anything special.  Just slightly better than the popular indian place off the strip.\n\nOverall, I will not be visiting this restaurant again."
        }, 
        {
            "index": 30, 
            "rating": 4, 
            "review": "Great buffet, everything was good but the Chili Chicken was to die for, the best I've ever had. They could have made it everything spicier for my taste but it was still very nice. The free Nan was ok, I've had better but for the price it was fine. I'll be back when I visit Vegas again."
        }, 
        {
            "index": 31, 
            "rating": 1, 
            "review": "Worst veg food ever. Everything tasted bad..and they are not courteous. I wouldn't go again ."
        }, 
        {
            "index": 32, 
            "rating": 3, 
            "review": "Tried the place on new year day 2016. Biryani is horrible.. and friedrice too.\nOnly thing liked is mango lassi. Not sure how does it get a 4+ rating."
        }, 
        {
            "index": 33, 
            "rating": 5, 
            "review": "Surprisingly empty on a Friday night, but the food was stellar! We had the chicken Nepali Momo as an appetizer, Chicken Tikka Masala, and an excellent Baingain Bharta which they recognized from our confused description and prepared even though it wasn't on the menu. Unfortunately we're only passing through Vegas. I'd definitely be a regular if they were located in my hometown!"
        }, 
        {
            "index": 34, 
            "rating": 5, 
            "review": "Delicious yummy food.  Loved Malai kofta, palak paneer, kali  daal, aloo tiki, samosa, chilli paneer.  Must try their falooda kulfi.  Very good services.  Their garlic naan is must try.  Found out that they serve jain food too. Love it...."
        }, 
        {
            "index": 35, 
            "rating": 4, 
            "review": "I haven't been to many Indian places in Vegas, because this place is awesome. What makes them extremely memorable is their daily lunch buffets. They've got a wide variety of vegetarian and non-vegetarian options to select from and their lassies are super flavorful! Dinner a la carte options are great too. Can't go wrong with anything. The only reason they didn't get a 5 star rating is for their spice level. As of lately, the lunch buffet has been getting too spicy to the point where it's difficult to enjoy the food's flavor, and at dinner time they let a bit of the spice slide a tad bit when you customize your spice level."
        }, 
        {
            "index": 36, 
            "rating": 5, 
            "review": "Went during the lunch buffet and not a bad item was tasted! Everything was delicious and prepared as it should be. For the cost it is a tremendous bargain. I will definitely be going again! Also, try the garlic naan! Yum!"
        }, 
        {
            "index": 37, 
            "rating": 2, 
            "review": "By far, Not the best Indian Lunch Buffet I have ever been to.  Staff was cold and less than accommodating,  and even less welcoming.  The Room was crammed, packed and bustling busy . \nAtmosphere was loud and uninviting.  The food was not terrible, but taking the staff and room into consideration it was definitely less than stellar.  I am certainly NOT interested in returning."
        }, 
        {
            "index": 38, 
            "rating": 4, 
            "review": "Came here for lunch buffet on Sunday afternoon. Being from the bay area we are very familiar with Indian buffets and we were pleasantly surprised by this place. It is clean and has a lot of great selections for both vegetarians and non-vegetarians. In terms of veg selections I remember seeing samosas, pakoras, palak paneer, chole, dal makhani, malai kofta, idli sambar, gulab jamun, salad, naan, rice, indo/chinese noodles. A lot of options. I particularly enjoyed the malai kofta and the palak paneer. I'd come back again if in Vegas and craving Indian food. \n\nNote: $18 taxi ride from Vdara to Delhi Indian Cuisine (take Uber instead b/c it will most likely be cheaper)."
        }, 
        {
            "index": 39, 
            "rating": 5, 
            "review": "It's my second time eating India food,  it's very good a different level of spicy then I'm use to but I was still able to enjoy the flavors of the food. I really enjoyed the  okra dish and their chicken rice dish. I will recommended and eat there again."
        }, 
        {
            "index": 40, 
            "rating": 4, 
            "review": "This is the first Indian restaurant/buffet that I've been to where I wasn't stiffed on meat. My butter chicken actually fed 3 people! Expect to wait about 20mins longer to get take-out because the tandoori chicken has to be cooked fresh. Here's the breakdown of my order:\n\nChicken Tandoori - was a bit dry but still tasty\nKorma Shrimp - was really good too, I saved all the sauce so I can slather my rice in them the next day\nButter Chicken - tasty as always and had enough meat to feed 3 people\nGarlic Naan - not as garlicky as I would have wanted\nChicken Pakora - not a fan, dry and not that tasty\nVeg Samosa - not a fan, too doughy, not enough filling"
        }, 
        {
            "index": 41, 
            "rating": 3, 
            "review": "It was just OK. Ive definitely had better Indian food before (not in Vegas but back home in the UK).\n\nLets just say, I wont be ordering from here again lol. I ordered a Lamb curry/biriyani"
        }, 
        {
            "index": 42, 
            "rating": 4, 
            "review": "Food is pretty decent, prices are reasonable, and Harry (the manager) takes care of customers very nicely. Halal. Lunch buffet is $12 and has a wonderful selection. Restaurant is nice decor, clean, great service."
        }, 
        {
            "index": 43, 
            "rating": 1, 
            "review": "Buffet was half empty all the time. People were racing for the naan.\nNo entree tasted good.\nIn short other than naan, nothing good to eat here.\nVery displeased."
        }, 
        {
            "index": 44, 
            "rating": 5, 
            "review": "The best Indian food we've ever had! Thank you Yelp for helping us find this place.  Everything was SO delicious. Some of my favorites were:\n\n- Palak paneer (spinach/cheese) had the perfect amount of spiciness, so delish!\n\n- Tandoori chicken was so juicy and smokey, not dry like other places. \n\n- The goat meat in the goat curry was so tender and flavorful. \n\nCan't wait to come back next Vegas trip."
        }, 
        {
            "index": 45, 
            "rating": 5, 
            "review": "Yes! Finally, a good Indian place! \nI went for their lunch buffet and everything was soooo tasty! Included in ur lunch buffet is plenty of Naan. They also have ,my fav, Samosas within the buffet. So, u kno I had to grab two. Everyone working was super nice. They even were gushing over my baby, which I think is really sweet. \n\nThe only thing negative thing I can say isn't really a big deal. But, it was super stuffy in there. There was condensation on the windows haha. But soooo worth it. Maybe in the summertime not so much. Locals know."
        }, 
        {
            "index": 46, 
            "rating": 4, 
            "review": "Whenever I come to Las Vegas this is where me and my Indian friends come to eat.  The food is great the service is impeccable also the owner is a great guy. I threw a surprise party for my wife at Vdara they were kind enough to cater this event for my wife at the last minute everyone was raving about the food I would encourage anyone who visits Las Vegas to stop by and have a Taste of India"
        }, 
        {
            "index": 47, 
            "rating": 5, 
            "review": "I am very impressed with this restaurant!  The service we received was first class.  The food blew my mind with the flavors and overall quality.  This is the best Indian cuisine in Las Vegas!"
        }, 
        {
            "index": 48, 
            "rating": 3, 
            "review": "This was a very pretty Indian restaurant in a not SO good location.  The food was good, as was the service.  However the portions were extremely small and the prices were high for what we got. \n\nOur recommendation for Indian is Mount Everest.  Good portions, quality, service  and the right price for us!"
        }, 
        {
            "index": 49, 
            "rating": 5, 
            "review": "First time eating here and the wait staff was awesome help! The food was very well prepared! Will defiantly be back!"
        }, 
        {
            "index": 50, 
            "rating": 5, 
            "review": "Great food affordable prices. Really can't go wrong with their lunch buffet. Their Garlic Naan is amazing!"
        }, 
        {
            "index": 51, 
            "rating": 5, 
            "review": "Went to dinner with my husband and was blown away by both the service and the food! The staff was very friendly and knowledgeable. There were two managers on and both of them checked on us which is always nice. The food was phenomenal! Our server recommended the Vindaloo and told us the Tikka Masala was their most popular do we tried both, and while both were good the Vindaloo was out of this world! We will be going back soon and I highly recommend it."
        }, 
        {
            "index": 52, 
            "rating": 1, 
            "review": "horrible food, i was given the food which was left in the buffet , the chicken tandoori was so hard to chew one can say it is warmed up again in the microwave, tikka masala chicken was same . \nworst experience and horrible food i would recommend \ncurry leaf"
        }, 
        {
            "index": 53, 
            "rating": 5, 
            "review": "Food was authentic Indian. Liked much  the goat and chicken curry n naan. Can't forget the taste really yummy"
        }, 
        {
            "index": 54, 
            "rating": 5, 
            "review": "I'm speechless. I live in northern California we have lots of  Indian restaurants here but, nothing came close to this restaurant as far as the food quality and the tastes. Great customer service and beyond. Can't wait to come back and try the food again. And It was so good that I went 3 time during my stay in Vegas."
        }, 
        {
            "index": 55, 
            "rating": 5, 
            "review": "Went here with my wife for the lunch buffet, no wait at all to sit down and immediately asked what kind of naan we wanted (Garlic or Butter). We each went up to the buffet and there was a large selection of different foods, I loaded up on Chicken Tikka Masala, basmati rice and vegetable samosas. \n\nThe chicken was delicious and not dry on the middle as some other places I've been to that don't let there chicken sit in the sauce for too long, this was deliciously juicy throughout. The garlic naan was delicious as well and complimented the meal nicely. I had a couple other things from the buffet that I've never had before and all was nicely cooked. We left after filling up on one plate each, both wanting to go back for more but knew better. Final bill was about $23 total for two (both drank water)."
        }, 
        {
            "index": 56, 
            "rating": 3, 
            "review": "I could have given this a better rating - but I went here for a lunch buffet and they had 5 entrees in the non-veg section which I cannot venture into.\nIt was Christmas and we were on our way to the airport. So we picked this restaurant for lunch. I went by the star rating in my Google search.\n\nThe idly was soft and sambar tasted pretty good. I heard lot of people talk about the Gulab Jamuns here. So I made sure I checked them out. Again they were very soft. But a bit sweet even for me. The veg curries were good and the nan was ok. And I should not forget the starters. They were good."
        }, 
        {
            "index": 57, 
            "rating": 5, 
            "review": "Excellent food, super friendly service, incredible price. Chicken Biryani was very good. Possibly one of my favorite buffet to date. Take a break from Casino Buffets and go here."
        }, 
        {
            "index": 58, 
            "rating": 1, 
            "review": "One off the worst Indian restaurant I visited. For new visitors, please dont go there better go to other restaurant. The 4.5 start ratting is fake."
        }, 
        {
            "index": 59, 
            "rating": 5, 
            "review": "Brought my friend here for her birthday and we both loved it! Definitely coming back."
        }, 
        {
            "index": 60, 
            "rating": 5, 
            "review": "I eat a lot of Indian food in Sweden, where I live, but this was better than most of it.\n\nMy choice was the Vegetarian Thal and it was excellent. costed only a bit more than a sandwich and a coffee at Starbucks on the Strip, earlier that day. :)"
        }, 
        {
            "index": 61, 
            "rating": 5, 
            "review": "Great butter chicken and curry goat.  And the roti is addictive and fresh you have to ask for it. I will definitely be taking my guest their brunch is from 11 to 3. Great price."
        }, 
        {
            "index": 62, 
            "rating": 5, 
            "review": "Good service. Nice selection. Flavorful. Generous naan portions. I was happy with them. Reasonable price too. Strong competition to India palace."
        }, 
        {
            "index": 63, 
            "rating": 1, 
            "review": "Worst food that u will ever experience. Cold food, breads were uncooked. Long waiting time.\n\nI am actually shocked to see this restro have a rating this high."
        }, 
        {
            "index": 64, 
            "rating": 5, 
            "review": "Enjoyed a delicious dinner here. Can't wait to come again and enjoy the lunch buffet. Chicken tikka was fabulous as was the chicken kadhai. Okra masala was delicious.   I suggest you give the kashmiri naan a try.  It was to die for."
        }, 
        {
            "index": 65, 
            "rating": 5, 
            "review": "We had a very good time here, the service was excellent. Our waiter (Krishna) took really good care of us.  They have a great variety of vegetarian as well as non veg.  If you are into non veg I would highly recommend the tandoori chicken, it was juicy and spicy and very well cooked.  The Navratan kurma was wonderful and the shaai paneer was great.  The kulfi is homemade so definitely try that,  it was great."
        }, 
        {
            "index": 66, 
            "rating": 5, 
            "review": "I stumbled upon this place by accident and I'm so happy I did... It's exceptionally clean inside and the staff is very helpful and friendly! Nice linen table clothes and napkins... It feels like a very nice restaurant. The food is great!! Best palak paneer I've had in a restaurant! The chicken biryani is great!! All the food I tried was delicious. I can't wait to return for the food, friendly service and classy ambiance."
        }, 
        {
            "index": 67, 
            "rating": 5, 
            "review": "Diamond in the rough. Fantastic food and exceptional service. We had dinner tonight and we will go back tomorrow for lunch:-) Thank you for the wonderful experience."
        }, 
        {
            "index": 68, 
            "rating": 5, 
            "review": "Excellent lunch buffet. They offer both meat and vegetarian options for the buffet. Large dinning area with plenty of space."
        }, 
        {
            "index": 69, 
            "rating": 5, 
            "review": "First time coming here for the lunch and it enjoyed it better than other indian buffets that I have been to.\n\nThere is a large selection of food that takes up the back wall. You have a choice between regular or garlic nan, I prefer the garlic one. \n\nMost tandoori chicken at other places are usually dry, but this one was nice and tender!\n\nDefinitely worth trying out (:"
        }, 
        {
            "index": 70, 
            "rating": 5, 
            "review": "Sometimes we don't act like tourists when we are tourists but like to go where the locals go.  This buffet for lunch was a great deal, and it must really be, because it was full of indians eating there , except for us.  I loved the tandoori chicken which was moist inside and spicy outside.  The garlic naan was delivered to our table piping hot, so I used it to soak up my curry sauce on the curry chicken and the sauce on a remarkable goat  meat dish. They had steamed white rice and biryani, take your choice.  I wish my stomach was bigger. I'm going back again next Vegas trip, also note: clean bathroom and lots of parking."
        }, 
        {
            "index": 71, 
            "rating": 5, 
            "review": "Oh boy!  My sister found a great South Indian Buffet in Vegas (via yelp, of course!) Fantastic buffet spread!  I especially like that they have Chicken Biryani, Saag, Dhal, Butter Chicken, the most tender Tandoori Chicken and lots of other items too many to mention.  All were good!  There were 2 kinds of naan brought to the table and helped me to try out all the different curries in the buffet.  Eat all dishes with bites of the split jalapeno peppers.  Sure adds that heat in the food.  Dessert was gulab jamun and kheer.  \n\nWill be back!"
        }, 
        {
            "index": 72, 
            "rating": 1, 
            "review": "Took over an hour to get 2 Cold entrees and Half cooked Naans for dinner (not buffet). With regards to taste, its average. Samosas were bland. Dal Makhani was OK and Paneer Tikka Masala is nice. Garlic naan was awful. Portions size is below average.\nI'd give it a miss and try something else next time."
        }, 
        {
            "index": 73, 
            "rating": 4, 
            "review": "Went here on a Friday night around dinner time. Thought the place was closed because there was only 1 other patron dining. The server was a bit weird, awkward, and his English wasn't the best. Everyone (staff) else seemed weird and different as well. However, the food was very delicious and fresh. We ordered chicken tikka masala and a chicken kabob style with a yellow rice. The food was flavorful and tasted great."
        }, 
        {
            "index": 74, 
            "rating": 1, 
            "review": "Decided to give this a place a try during \"Dinner\nService\".\n\nAs we entered we quickly noticed the emptiness. \n\n1st Started with an Appetizer, \"Chicken Pakora\" ($6) for drinks we ordered the Mango Lassi (1 free via Yelp check-in) Very delicious!  it's like biting into a very ripe mango!\n\nMy Wife ordered the \"Authentic Chicken Curry\"  ($14), I had the \"Prawn Xacuti\" ($21)......\n\nThe problem with this place is that they use the same \"Base Sauce\", the Sauce used for the Prawn Xacuti and Chicken Curry dishes tasted the same!, only difference was color and spice level , that's it!\n\nInitially I was going to try the Non-Vegetarian Delhi Thali but was told by waiter that the Chef \"did not time for that\" so I chose the \"Prawn Xacuti\" . \n\nThe portions regardless of dish/price are the same. \n\nOnce our food arrived we really couldn't eat peacefully as the waiting staff were constantly asking if the food was OK, like every few minutes, I avoided making eye contact after the 2nd time, I just wanted to eat the freaking food! this place was a total disappointment guess the Wife and I should of just done the Buffet, but No Thanks, you only get to disappoint us once! We will never return!"
        }, 
        {
            "index": 75, 
            "rating": 1, 
            "review": "Lunch buffet had cold food and very less options. Bland food. Only good was fresh lime soda."
        }, 
        {
            "index": 76, 
            "rating": 5, 
            "review": "Last night was my first time at this establishment and I was not at all disappointed. The food was stellar and the staff were charming. I over ordered and took home far more than we managed to eat. I will be back very soon."
        }, 
        {
            "index": 77, 
            "rating": 4, 
            "review": "Delhi Indian Cuisine was the second Indian buffet that we tried during our last trip to Vegas. It is located not too far from the south end of the strip so location and accessibility was not a problem. Upon entering my first impression was that the place seemed pretty inviting. It was spacious with the buffet nicely spread out along the far end, tables nicely spaced apart so after having eaten in Mount Everest the previous day this was a welcome change.\n\nThe buffet again has all the standard items that you will find in an Indian buffet. Appetizers included tandoori chicken, vegetable pakodas (vegetable fritters) and samosa (puff pastry with potato filling). Entrees included butter chicken, goat curry, saag, rice, biryani and noodles. Desert included gajar ka halwa (carrot pudding) and kheer (sweetened rice pudding with milk). Taste wise what stood out to me was that everything was good but not great. Well the biryani and naan (provided fresh on the table) were both excellent but all the entrees were enjoyable but nothing popped out. The deserts could have been better. The gajar ka halwa cried out for some more mava (heavy cream) and the kheer for more sugar. Obviously they were made keeping the health conscience, not too sweet regulars in mind (another resturant which was full of locals). \n\nService was good, all our plates were cleared promptly and price wise it was $10.99 which is pretty much standard for Indian buffets.\n\nOverall I feel that the food surely needs a shot in the arm, but considering the overall package of location, decor, service and value for money a repeat visit is surely on the cards during our next visit."
        }, 
        {
            "index": 78, 
            "rating": 5, 
            "review": "The food was incredible. Flavorful, very warm, aromatic, and massive in portion. \n\nI ordered the Chicken Tikka Masala, the Garlic Naan, Steamed Rice, and the Aloo Tikki (Must be a minimum of $25.00 to order for delivery). Everything was packed clean and tight, no spills and no issues. \n\nThe Chicken Tikka Masala is one of their most popular menu options. Now I know why. Creamy, smooth, rich, and especially spicy (if you order it as such). A perfect consistency with large chunks of delicious chicken. The tomato is not overwhelming, the spices don't rule the flavor (saffron is especially nice), and the chicken has a great consistency. I ordered a side of steamed rice, which was incredible for the amount given at $3.00. I expected a tiny bowl, but instead received an entire 6 x 6 to-go box full. \n\nThe Garlic Naan is good. The flavor is not especially strong, it's incredibly soft, not insanely chewy, but chewy enough; great to have just alone as a snack. The portion is large enough to be split between three people or more, and the texture is fluffy with that infamous smoothness of naan. I would honestly prefer regular naan, but that doesn't mean the garlic isn't especially tasty.\n\nThe Aloo Tikki numbers in two for $3.00, both about the circumference of a tennis ball. They are thick potatoes cakes, with a smooth interior and an especially crispy exterior. A little on the heavy side, but still delicious. They come with two sauces, one of which is a very close relative of a green avocado salsa, and the other a thick, sweet brown sauce. I have no idea what they are. I prefer them mixed together, because the green is especially spicy and the brown is a little too sweet. Combining or dual dipping evens them out perfectly.\n\nOverall, the meal impressed me. I'm full with so many leftovers for tonight. Everything was absolutely wonderful and the delivery was so quick and efficient. I feel horrible, by the way. I ordered delivery and gave the girl the wrong amount for a tip. I wanted to give her $6.00 instead of $3.00. *Sigh*"
        }, 
        {
            "index": 79, 
            "rating": 5, 
            "review": "OMG Yelpers - thanks so much for your recommendations - we were in Vegas for the weekend and didn't want to eat on the Strip. We drove out to this place for dinner because of all of the Yelp reviews and it was fantastic. Everything was delicious and authentic (and spicy!) and the service was great too. We cannot wait to come back - yay!"
        }, 
        {
            "index": 80, 
            "rating": 3, 
            "review": "The food was great!   Tomato soup, garlic naan, tandoori chicken, Karachi chicken.  However as great as the staff was last time, this time not so much.  Mostly attentive, just chaotic.   Also the decor could use lots of help."
        }, 
        {
            "index": 81, 
            "rating": 5, 
            "review": "Great food! First time coming here and the owner greeted us at the door and made us feel very comfortable. Great variety and the price was on point! Would recommend to anyone."
        }, 
        {
            "index": 82, 
            "rating": 5, 
            "review": "Best Indian Lunch Buffet in Las Vegas!\n\nThis place has been open for about a year, but as you can see has already received accolades from over 200 Yelpers. I was introduced to this restaurant by my Indian friend who assured me it was the best in town. For $10.99 (or for that matter at any price) this lunch buffet is outstanding. It has a 35 display of savory meats and vegetables from traditional tandoori chicken to a goat stew. Admittedly, passed on the goat, but everything else was great, including the desserts. A complimentary freshly-baked nan (garlic or plain) comes with each order.  Spacious and clean and an A Health Department rating completes the offering."
        }, 
        {
            "index": 83, 
            "rating": 5, 
            "review": "I've been to several Indian restaurants here in Vegas and this one is definitely the best I've had. The garlic naan is chewy and delicious. Also, so many great vegetarian choices on the lunch buffet which is a very reasonable $9.99. The staff is extremely sweet and they provide great service!"
        }, 
        {
            "index": 84, 
            "rating": 3, 
            "review": "Recently dined here for the lunch buffet hoping to find the best Indian food in Vegas. Greatly disappointed. Being originally from the Bay Area, I've ate at some really fantastic Indian/Pakistani restaurants. Haven't found one in vegas yet. \n\nThe staff was very friendly and the Garlic Naan was really good. However, allot of the food tasted bland and lacked flavor altogether. The chicken curry lacked chicken and the flavor of the yogurt was overwhelming. The Saag, Samosa's and the Dal lacked flavor. The pakoras tasted stale and the rice in the Biryani was over cooked. \n\nThe only two things good were the Garlic Naan and the desert, Galub Jamun. I see all the great reviews so maybe I just came on a day when the cook wasn't feeling it."
        }, 
        {
            "index": 85, 
            "rating": 4, 
            "review": "Delhi Indian Cuisine has been on my radar for quite some time. I've seen the high reviews and wanted to check this place out. I'm so glad that I did because the food here rocks! (my socks).\n\nThe lunch buffet starts at 11:00am and goes until 3:00pm. It is one of the better priced Indian buffets in town at 9.99. I came in and ordered the lunch buffet. The dining room is very clean and spacious. There is a large buffet area which is loaded with tons of food.\n\nThe yelp check in offer was for either a soda or one of their house made lassi's, basically, a yogurt smoothie. They have a sweet one, a salty one, and a mango one. I ordered the mango. It was SOOO good. The flavor was very mango-ey and it was silky smooth and had a nice mouthfeel from the yogurt.\n\nAs for the food, I would recommend anything! I especially liked their chicken, all of their versions of them were super tender. The goat stew was especially tasty as well. It wasn't too gamey and the sauce on it was fabulous! There wasn't anything on the menu that I didn't like.\n\nOne thing that I thought was kinda weak was their garlic naan. I found the taste to be a little bit bland. And for their noodle, milk dessert was a little bit too sweet.\n\nService was also kinda questionable. They seemed to start out pretty slow with taking our orders and getting our drinks, and after our first round of dishes they didn't clear our plates fast enough so that we were stacking our plates on top of each other. But, they were quicker at bussing our table during the middle of our dining experience.\n\nWould I come back? Oh, you know it, because I loves me some Indian food. And the food here is delicious, fresh, and tasty. And try the mango lassi, it's really good."
        }, 
        {
            "index": 86, 
            "rating": 2, 
            "review": "Quantity over quality is best way to describe this location. It also doesn't help that during their buffet hours they rented out half the restaurant to a family that was celebrating their wedding party. This isn't the most professional thing to do, because things did get a bit hectic when you try to get food at the serving stations. \n\nNow to the quality of the food. The curry flavor is so-so, lot of the curries are watery. The naan was excellent, but the food can use some improvement. \n\nI'd recommend Mint, Saffron, or Mount Everest over this place. Check them out for their buffet and a-la carte meals."
        }, 
        {
            "index": 87, 
            "rating": 5, 
            "review": "This is seriously the tastiest, most legit Indian buffet my wife and I had been to since Manohar's Dehli Palace in Los Angeles. Would recommend this to anyone who likes good Indian food. It's not exactly as authentic as some places we've been to (Taj Mahal in Boise), but it's spicier and more authentic than most white boy / gringo style Indian buffets in the U.S.\n\nEAT CURRIES AND SUCH TO ONE DAY BECOME INDIAN FOOD YOURSELF!!!"
        }, 
        {
            "index": 88, 
            "rating": 5, 
            "review": "Very very good! Had a great first experience. Everything we ordered was hot, full of flavor with the perfect amount of spice. We were here during dinner and had great service. Will definitely be back soon!"
        }, 
        {
            "index": 89, 
            "rating": 1, 
            "review": "Made reservations on this yelp page- yet wasn't allowed to come in because they were only \" open to CES\" people... Ruined my companion bday dinner \n\nDude at the door was rude as hell"
        }, 
        {
            "index": 90, 
            "rating": 5, 
            "review": "I would Rate this restaurant top notch..\nAwesome food, great service, beautiful interiors with an awesome pic of Himalayas. Not far away from strip. They even added rice when we packed the leftovers.\nI forgot o take pic if anyone can post that to me."
        }, 
        {
            "index": 91, 
            "rating": 5, 
            "review": "Terrific location. Very attentive wait staff that were on their game. We had multiple waiters check in actively. Food was very good as well."
        }, 
        {
            "index": 92, 
            "rating": 5, 
            "review": "Came in for lunch buffet. Great variety. All delicious. The vegetable samosas were my favorite. Crust was light and crispy filling was moist. I've had samosas elsewhere that were doughy and dry. The goat curry is definitely worth a try. They come in big chunks, lean and tender."
        }, 
        {
            "index": 93, 
            "rating": 1, 
            "review": "We have placed few orders, the way of packing is not good the entire food got leacked into the packing bag and we have informed to them, the restaurant staff members are very bad in the way of receiving the customer calls were not so improper and the way of talking to the customer is not good, we asked them to refund my money they didn't do that and they haven't replaced my order, fuck the restaurant"
        }, 
        {
            "index": 94, 
            "rating": 5, 
            "review": "I have tried many Indian restaurants but this place stands out all their food was very flavourful and fresh we had been here for lunch buffet . This place is must go place if you are in Vegas it satisfies both south and north Indian cuisines."
        }, 
        {
            "index": 95, 
            "rating": 3, 
            "review": "Does Delhi Indian Cuisine serve the best Indian food I've tried?  Sadly no.  Do they serve the worst I've tried?  Far from it.  Simply put, Delhi Indian Cuisine is average if not slightly above.  I went with a group of Yelpers for a Sunday lunch buffet.  I was impressed by the overall number of dishes to try and found the $10.99 price to be quite fair.  Not being one to shy away from new foods, I tried a sampling of nearly all the options Delhi has to offer from meat dishes to vegetarian.  I even tried the curried goat, a protein new to me.  It wasn't bad but there was nothing about it that made me think \"oh my goodness, this is awesome.\" In fact, that is true for basically everything I tried.  There was nothing that I wanted to push aside but there was also nothing I wanted to go back up to serve up seconds of.  I had their chicken makhani and chicken tikka masala which are typically my favorites at an Indian restaurant.  Both were good just not spectacular.  My biggest disappointment was the saag paneer.  I got a nice healthy scoop of saag but had trouble finding the paneer.  Its a good thing I like creamed spinach because that is about all it was.  At least on my plate.  I did see others with paneer on their plates so maybe I just got the bottom of the barrel before it was refilled.  At the other end of the buffet bar, I did like the desserts quite a lot.  I tried and thoroughly enjoyed the galub jamun and the syrup those little dough balls are in.  There was a rice porridge or pudding of sorts that was tasty too.  Sweet, cool and refreshing on a balmy summers afternoon.  In the end, the food was fine but the company was better."
        }, 
        {
            "index": 96, 
            "rating": 5, 
            "review": "We had the lunch buffet. It is a great way to try lots of things. They brought us fresh naan and garlic naan. It was fresh and delicious. There were lots of meat and vegetarian dishes. It was a bargain for at 11.99 a person."
        }, 
        {
            "index": 97, 
            "rating": 1, 
            "review": "Didnt enjoyed the food as it was not good based on price... i just tried having seeing the good rating.."
        }, 
        {
            "index": 98, 
            "rating": 5, 
            "review": "Great food and excellent customer service.  We went there almost around closing time, most of the restaurants will probably say their kitchens are closed but they accommodated us without any rush.\n\nFood quality was great, specifically garlic roti, onion Kulcha and baigan bhadatha."
        }, 
        {
            "index": 99, 
            "rating": 4, 
            "review": "Mmmmm I love Indian buffets!! Very clean inside, attentive and friendly staff. Used to be a super salad back in the day...we've visited twice so far both for their lunch buffet, and sat where we used to sit way back then :) Can't beat the price when you are craving big plates of spiced comfort food.They have a nice vegetarian selection as noted by other yelpers which my daughter likes and good garlic nann. They also have an assortment of fresh fruits and a small salad area with some chutneys and desserts. Definitely my daughter's favorite which means we'll be back."
        }, 
        {
            "index": 100, 
            "rating": 5, 
            "review": "Fantastic! We went to the lunch buffet and they have the largest selection of dishes for vegetarians like us, (don't worry there were plenty of meat options for you carnivorous types.)  And the customer service was out of this world! We felt like we got the royal treatment, we had a couple special requests and were accommodated graciously, I have to say this may be our new favorite indian restaurant in Las Vegas!"
        }, 
        {
            "index": 101, 
            "rating": 5, 
            "review": "Had an Indian person in town for the first time so we tried a few different restaurants courtesy of yelp and by far this place was the best. On top of it, service was outstanding even though it was just the lunch buffet. The workers clearly take pride in their restaurant."
        }, 
        {
            "index": 102, 
            "rating": 5, 
            "review": "FINALLY found some good Indian food in this city! This will be our go to place for Indian food from now on. The lunch buffet was so delicious and most importantly FRESH! The atmosphere was nice and clean. The staff was very polite. The restaurant is chef owned and you can tell that he takes pride in his food and restaurant."
        }, 
        {
            "index": 103, 
            "rating": 5, 
            "review": "It'll be a sin to steal a star from Delhi Indian Cuisine, they come to be party with the most delicious food and an all star buffet backed by a very friendly host. Oh, did I tell you about the tall glass full of real mango lassi that's free of psychological pricing at three dollars?\n\nIf you want north Indian food while on the strip, don't waste a moment before you decide to drive to Delhi Indian Cuisine."
        }, 
        {
            "index": 104, 
            "rating": 4, 
            "review": "As much as I enjoy trying new things, there are certain cuisine I am a creature of habit. I have my favorite spot for that food and I am just not messing with it. Indian lunch buffet is one such thing, but after hearing some love from trusted friends, I reluctantly shook up our routine and tried out this new spot. \n\nIt's a large open room so it's probably a better bet if you are dining with a large group as the other better buffets are rather small dining rooms. Size of the buffet is fairly good as there were 16 hot dishes, some chutney, lettuce, cucumbers, some fruit and kheer. \n\nWe got the garlic naan, which I thought was superb and had nice garlicky flavor. \n\nAll the food was solid, but there were a few standout dishes for me. Tandoori chicken was juicy and I appreciate these aren't huge hormone large pieces. The goat curry had a nice flavor in the sauce, though quite a bit of bones to navigate., Saag paneer was solid, a bit creamier than average. The one surprise for me is the malai kofta. In the past, I've disliked this dish at other places, but I loved it here because of the texture of the kofta. I find some places it just is dry and dough-y and full of blah, but the texture of this is soft and creamy even. There wasn't a label for it, but it was sort've cut up pieces of sausage similar to a lulu kebab that had a nice gingerly flavor to it that was awesome wrapped in naan with chutney. The yellow daal was really tasty - probably my favorite one I've had in the recent years. \n\nI see that there are pics of the Himalayas and seen some mention of there being Nepalese owners and Indian owners so it's reflected in the way food is flavored. I find Napalese is less spicy and more a balance with savory and sweet. \n\nService was decent. We had our drinks refilled and the people were friendly. There's a current check in for a lassi or soda so we took advantage and got a free mango lassi which was yummy. \n\nI think this matches my usual standby in quality so I'm glad we went. I think I will alternate between this place and Mint depending on the type of Indian I feel like having."
        }, 
        {
            "index": 105, 
            "rating": 5, 
            "review": "Awesome food choices . the spice level was good as well . Very neat and clean . very helpfull staff . The Gajjar halwa and kheer were simply amazing . \nwe went for buffet they had good choices for both veg and non veg  and a lot of items for both. garlic naan and chowmein were also very very good. i would definetly recommend them to all my friends and family visting Vegas ."
        }, 
        {
            "index": 106, 
            "rating": 5, 
            "review": "As soon as you walk in you know you came to the right place. Full buffet and beautiful ambiance. Mango lassi was bomb!"
        }, 
        {
            "index": 107, 
            "rating": 5, 
            "review": "I tried a lots of indian buffet in CA. This Indian Have the most varieties. The goat curry and chicken curry are my favorite! And the buffet is worth your money. \nThe service is excellent, Ashmita always come and ask if me and my friends need any thing and add water for US."
        }, 
        {
            "index": 108, 
            "rating": 4, 
            "review": "I wanted to try this lunch buffet since reading some friends' reviews and I went today.  It's taken the #1 spot in the Indian lunch buffet spot with one restaurant yet to go.\n\nI was there early, about 11;15, and I was the first person in the restaurant.   There soon were several other customers.  It's a very large room with lots of tables laid out well and the buffet is a large area opposite the entrance.\n\nWith a check in on Yelp, you get either a mango lassi or a soda free.  It's a good deal for merely checking in.\n\nI ordered garlic naan and then headed to the buffet.  The naan was good but I wish it had more of a garlic flavor.  For the first plate, I had chicken Biryani, a couple vegetable pakoras, a vegetable samosa, a piece of tandoori chicken, some chili chicken, soya badi, and some saag paneer.  Everything I had was very good and I noticed that almost all dishes had a spiciness that I liked.  Of these, the weakest dishes was the saag paneer.  The crust of the samosa was flaky and the filling was very good.  The soya badi was quite good.\n\nFor my second plate, I had squash, Navratan korma, chicken curry, and chana masala.  All of these were very good save the squash which was a little nondescript.  I also tried some of their raita which was good.  The chicken curry didn't have very much of a curry flavor but when the juices from the chana masala mixed with the curry juice, it became much better.\n\nFinally, I went back and got one idli and put a small amount of tamarind chutney on it.  It had a soft texture and was good.  I was a but disappointed that they had no dhokla.  I had read Christopher S.' review and I was interested in trying something different.\n\nOverall, this is a very solid buffet and moves to the top tier of Indian restaurants.  The price is now $10.99 but that's still very good considering the wide choice you have with their large buffet.\n\nService was very good!  Several times, someone stopped by to see how things were.  A woman stopped once and asked me if it was too spicy so they know that they spice their foods.  Plates were cleared before I came back each time.\n\nThis is another stop for after hiking when we go to an Indian buffet.  It's a great addition to the Indoian dining in Las Vegas."
        }, 
        {
            "index": 109, 
            "rating": 3, 
            "review": "Waitress rude and stuck up. Didn't honor Yelp offer of free mango lassi upon Yelp check in. Food tasted good and no complains there. Taste wasn't anything special or remarkable."
        }, 
        {
            "index": 110, 
            "rating": 4, 
            "review": "Finally an Indian buffet I can go to. Wide spread..lot of choices both in vegetarian as well as non vegetarian food......clean ambience, good service, decent price."
        }, 
        {
            "index": 111, 
            "rating": 4, 
            "review": "**Summary**\n       - Value - This is probably the cheapest Indian buffet in town.\n       - Quality - This ranks as one of the top Indian buffets I've had. Moist chicken/goat and good curry. What more can you ask for?\n       - Service - They're absent from the front a lot of times, but when they do come over, they're very friendly.\n       - Asian Influence - They have chow mein and chili chicken. I guess it adds variety, lol.\n**Price**\n       - Lunch Buffet $9.99\n**Ordered**\n       - Garlic Naan - I suggest requesting the garlic naan or they might give you the regular naan instead.\n       - Tandori Chicken - Flavorful as ever cooked in a clay oven.\n       - Chili Chicken - One of their Asian tasting entrees. It wasn't too spicy. A little salty from the sauce, but good otherwise.\n       - Chicken Makhani - Chicken + Curry + Butter = Delicious. The chicken wasn't too dry and the curry was as buttery delicious as ever.\n       - Chicken Saag - I prefer the makhani, but this adds variety to my plate.\n       - Goat Curry - The goat is fall off the bone tender. A must try.\n**Recommendations**\n       - I'd recommend this place if you're looking for a nice lunch Indian buffet. It's a great deal!"
        }, 
        {
            "index": 112, 
            "rating": 5, 
            "review": "Best Indian I've had in the USA! \nThe sauces (especially the Mali Kafta) were amaaaazing!!! Naan and rice (cumin seasoned) were delish too. The servers were attentive and so friendly. *we came for dinner but we hear lunch buffet is a hit!*"
        }, 
        {
            "index": 113, 
            "rating": 5, 
            "review": "Amazing food. Amazing service. This is real indian food. Every item's taste is so perfect and balanced. This is second time I came here coming from San Francisco. I wish they open in Bay area as well. Their Naan is one of the best I ever had."
        }, 
        {
            "index": 114, 
            "rating": 5, 
            "review": "Satisfied with lunch today. There buffet is one of the best buffet I have ever ate. Loved it. I will always eat here when I do Vegas trip. Recommended to all"
        }, 
        {
            "index": 115, 
            "rating": 5, 
            "review": "My first  time  here...I missed  the lunch buffet  which  starts  at 11-3pm but I  will surely come back. The service  was awesome!  The food was really  good..."
        }, 
        {
            "index": 116, 
            "rating": 4, 
            "review": "A great value Indian cuisine buffet. We arrived right when they opened on a Thursday. We were sat at a booth and it obviously was not crowded at all. Many patrons who were already seated were of Indian descent which is always a good indicator of authenticity. There were also a few locals. Our server came along a few minutes later and we ordered naan bread and a mango lassi and went to work on the buffet. \n\nI loved the curry selection and they had a variety of typical Indian cuisine meats such as goat and lamb as well as chicken. Tandoori was spot on and the only thing I didn't care for was the spinach. At the end of the line there was a variety of soups and some dessert and fruit selections which were delicious! My favorite was the semiya payasam which was creamy and thick with noodles in a milky soup. The mango lassi order took some time to come out since it was forgotten the first time but it did come out right in time for desert which was fine. Overall price for the buffet was well-worth it for two people under $30! Definitely would come back!"
        }, 
        {
            "index": 117, 
            "rating": 5, 
            "review": "Came here for the breakfast, they have one of the best buffet in Vegas. Many choices in Buffet and delicious food."
        }, 
        {
            "index": 118, 
            "rating": 4, 
            "review": "Good food amazing gulabjamoon clean and neat restaurant with good customer service what else do you want. Will come back again"
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "Great place great food !!! Amazing mango lassie\nMust check out ... Best out of 2 buffet that i been to\nOwner super nice guy , great garlic nan"
        }, 
        {
            "index": 120, 
            "rating": 5, 
            "review": "Excellent food! We had a class reunion and ordered food for 18 guys. Everyone love it. Good service."
        }, 
        {
            "index": 121, 
            "rating": 5, 
            "review": "My foodie fantasy day two, another 5-star success. I couldn't bring myself to go to a casino restaurant after the long day standing at the World Market Gift Show. So, thank you Yelp for another great find. \n\nI found Las Vegas' Best Indian Food! No, REALLY they won 2015 Best Indian Food by the Las Vegas Review Journal. Delhi is a very large family restaurant and everyone made sure that everything was perfect. Even a little hiccup was corrected immediately. \n\nI had the Vegetable Thali for dinner. Ample portion and I couldn't resist the Pani Puri to start. The Chai Tea was rich and creamy. Delhi has earned a place on my Vegas Restaurant list."
        }, 
        {
            "index": 122, 
            "rating": 4, 
            "review": "Biryani was great ! was here for a conference and tried this restaurant and it was worth."
        }, 
        {
            "index": 123, 
            "rating": 4, 
            "review": "We went here for late dinner. So, this place was pretty empty. Other than our server not giving us personal space, the service was good. \n\nWe tried a few of our favorites. For the most part, we enjoyed dinner.\n\nMango Lassi:\nThe color was a bit off-putting. It was very orange. It didn't quite taste like what I've had at other Indian restaurants. This tasted artificial. 2/5\n\nPapadum:\nPerfect cracker. But what makes this exceptionally good were the sauces: tamarind and mint. Their sauces are better than anyone else's. 5/5\n\nGarlic Naan:\nThis is my favorite. I can eat this stuff by itself. Warm, soft, buttery and garlicky goodness. I'm making myself want garlic naan by what I just said. 5/5\n\nPrawn Korma:\nThe sauce was a bit garlicky and creamy. It has some spicy kick to it. I wish this dish had more prawns since it is in fact PRAWN korma. 4/5"
        }, 
        {
            "index": 124, 
            "rating": 2, 
            "review": "You have 4.5 star rating in Yelp. I am sure it is influenced by the ala carte because most of the starters in buffet today were like warm, tight. A bit stale. \nYou have a good customer base. Please strive to be great every day. \n\nWill hit the main course now with expectations !"
        }, 
        {
            "index": 125, 
            "rating": 3, 
            "review": "Food was GREAT!!!! \n\nI only docked 2 stars since service was pretty much non-existent. We went in on a Friday afternoon for the lunch buffet, it was a slow day I suppose, there were probably only 6 other patrons eating there. After you are seated and given your drink and naan, you are pretty pretty much on your own until its time to pay. If you ever want a drink or naan refill during the rest of your meal, you'll have to get up and go look for your server in the backroom/kitchen. I had to do this twice. Its like they don't care about your refills if its a slow day and instead just go hang out in the backroom."
        }, 
        {
            "index": 126, 
            "rating": 5, 
            "review": "Hands down the best Indian restaurant I've ever been to. The lunch buffet is cheap and the quality and taste of the food is amazing!  The staff was very attentive by keeping our glasses full and giving us as much naan as we wanted. The garlic naan is delicious and they have a bunch of vegetarian options. My boyfriend eats meat and he was surprised with how many meat options they had as well. I'm so happy I tried  this place, it's soooo good!"
        }, 
        {
            "index": 127, 
            "rating": 5, 
            "review": "Great place the food was amazing and so was the service I will be definitely coming back here and bring all my friends !!!!"
        }, 
        {
            "index": 128, 
            "rating": 5, 
            "review": "Norm K invited a bunch of Yelpers to eat here for the lunch buffet. I wasn't expecting my taste buds to be delighted at almost every bite or for everything here to taste good and fresh, but that's pretty much what I got.\n\nYou know the rule of thumb about places that largely serve their own demographic, right? Well, I got really excited when I walked in and saw tables and tables full of Indian customers. It's such a huge place that I'd almost call it a dining hall rather than a dining room, and there were plenty of tables available for our group. Wish the lighting wasn't so dim, but that's a minor issue.\n\nNaan, either standard or garlic depending on what you ask for (I think the garlic actually gets too soggy, but table majority ruled), is brought out by servers as needed. The rest of the food and condiments are in the buffet line. Starting from the front of the line, you run meats, veggies, and sauces/desserts. I'll just list what I had:\n\n- Tandoori chicken: the one without sauce; luckily, only a little dry as opposed to the considerably or ridiculously dry fare at other places.\n- Chili chicken: reminiscent of some Chinese fried chicken offerings, but pretty sweet, not too spicy, and definitely fresh as opposed to what you might expect at an Asian buffet.\n- Chicken curry: can't recall the flavor exactly, but I'm sure it was good.\n- Chicken makhani: aka butter chicken, definitely a favorite of mine at Indian restaurants. Rich and delicious here as well.\n- Goat curry: tasty, somewhat fatty, typical gaminess of goat meat. Delicious.\n- Chicken biryani: chicken and rice dish, kinda sour but still not noticeably dry.\n- Vegetable pakora: a fried vegetable dish, wasn't very special but could pair with something like the saag paneer\n- Vegetable samosa: fried pastry stuffed with potato, good filling to crust ratio, crunchy on the outside and warm on the inside, not too spicy if at all spicy\n- Saag paneer: creamy spinach with cheese. Didn't even pick up cheese until round 2, so I was pleasantly surprised. Tastes good until you get really full. \"Hey ma, I ate my veggies!\"\n- Navratan korma: curry with cheese and potato, or at least those were the only two I fished out of the buffet tray. Pretty tasty, worth it even for meat-eaters like myself.\n- Tamarind sauce: sweet sauce that you can dip naan in. Helped to combat the sour taste when I accidentally bit into something unpalatably sour from the chicken biryani.\n- Mint sauce: light, and as minty as you would reasonably expect. I didn't really try pairing this with as many of the dishes as I should have, but I'm sure it would complement something well.\n- Gutab jamun: I probably have had this before, but I'll be darned if any place has made it this good. Great warm dessert dumpling in a sweet sauce. Wish I'd had room for more!\n- Kheer: rice pudding available next to the fruit, mildly sweet and probably should be eaten before you overwhelm your mouth with gulab jamun\n\nI haven't gone out of my way to try every Indian restaurant around my hometown of San Jose or around the Vegas area, but Delhi Indian Cuisine serves through and through the best Indian food that I've had so far, period. The buffet thing is icing on the cake as it hardly detracted from the quality and was a tremendous value at $11. Fair warning, though: it was a busy Sunday lunch, and I don't know if the weekday holds up. Go as early as you can for freshness, perhaps?"
        }, 
        {
            "index": 129, 
            "rating": 5, 
            "review": "This restaurant was excellent. Every dish we ordered was delicious. Heat being graded from 1-10 the spices were perfect. We all ordered different heat levels. The waiter was very informative with all questions answered. Will definitely return to try other dishes."
        }, 
        {
            "index": 130, 
            "rating": 5, 
            "review": "Really good Indian food in Vegas. Chicken biriyani was excellent and garlic naan is a must try!!"
        }, 
        {
            "index": 131, 
            "rating": 5, 
            "review": "The paneer pakora appetizer is really yummy! They give fair portions for the price. Something else that I love about this is that they don't skimp on paneer! I ordered the shahi panner and it had good flavor, more vegetable than I'm used to but still good."
        }, 
        {
            "index": 132, 
            "rating": 1, 
            "review": "****STAY OUT OF THIS PLACE****\nPathetic food. The breads were totally unbaked and the food served was cold.  Extremely long wait times for serving a couple of thali.\n\nCustomer service is pretty bad and doesn't bother about your concern.\n\nOverall please don't go by the misleading 4.5+ reviews"
        }, 
        {
            "index": 133, 
            "rating": 5, 
            "review": "Wow..... i am still drooling over the delicious indian food... must must try the chicken biryani  and the mango lassi... the place is comfortably seated but the food is to die for... oh and have the samosas   owner was very nice wanted to make sure my fam and friends enjoyed the food... yes we did and will always stop here on our every trip to vegas...."
        }, 
        {
            "index": 134, 
            "rating": 5, 
            "review": "I went to the this place for lunch with my wife and my son . When I went there , I was really surprised with the decoration inside . And the buffet wow, it's the largest Indian buffet in Las Vegas so far ,, so many varieties in the buffet , they have the largest selection of vegetarian and non- veg items , and the price wow, ,, just under $10 . Waiter and servers are so friendly and polite ,, great customer service ,, I am really glad conning here ,, highly recommended ,, Great service !!! Great Food , definitely going back soon ."
        }, 
        {
            "index": 135, 
            "rating": 4, 
            "review": "tasty spicy veg biriyani and authentic chiken currry . both the items were delicious. satisfied with the taste. THE INDIAN TASTE in Vegas.Do visit"
        }, 
        {
            "index": 136, 
            "rating": 5, 
            "review": "Service: 5 Stars \nFood: 5 Stars (well, I really like the goat curry, garlic naan, Khir...)\nAmbience: 5 Stars\n\nYelp check in: free lassi/soda\n\nWhat more can I say?  Just try it for yourself!"
        }, 
        {
            "index": 137, 
            "rating": 5, 
            "review": "For $10.99 lunch buffet, it's a great place during working hours. Easy to find location and very clean. Food quality is good. Spicy level is bearable. My favorite is the chicken curry. The chicken is very soft to taste. A variety of selections. Would go back!"
        }, 
        {
            "index": 138, 
            "rating": 4, 
            "review": "I kinda get what another reviewer meant when she said the buffet is quite large, yet lacked variety. Everything was pretty great though; I love that they aren't as afraid of adding a little bit of heat to their buffet dishes (most places avoid heat in buffet items, for obvious reasons). \n\nI also thought the garlic naan was wonderful, hot and fresh from the kitchen. They brought it out pretty late into our meal, which brings me to the service. Not bad, but a little slow. Understandable, as they haven't been open long, and not a huge deal. Just looks like they might still be working out a couple of kinks perhaps?\n\nI would definitely return, for the buffet, and possibly for dinner if the mood strikes."
        }, 
        {
            "index": 139, 
            "rating": 5, 
            "review": "Not too far from vegas strip. The lunch special is a great deal! Best food I ate while in vegas! Get the chicken tikka masala over white rice!! So good :) also very nice staff."
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "OMG. Both the food, and service was excellent. Very kind Gentleman named Hari defined various dishes for us, and went out of his way to make sure we were taken care of. The Chicken Tikki Masala was so very tasty, along with garlic naan bread. Very clean place!!!!!!! Thanks Hari, you rock!!!!!"
        }, 
        {
            "index": 141, 
            "rating": 5, 
            "review": "The best Indian restaurant in Vegas. They had idli and sambar which was the best. Chicken biryani and samosa was good too. It was spacious and the waiters were also courteous."
        }, 
        {
            "index": 142, 
            "rating": 4, 
            "review": "I am a picky eater when it comes to Indian food and I have been disappointed by the quality of some of the Indian food I have eaten over various major cities in the US. But this restaurant has one of the best Indian buffets in the US (from those I have been to). It is cheap, has a big capacity for seating, and a good variety of starters, vegetables, meat, and rice dishes. The goat meat dishes are excellent cause the meat is soft and tender (as compared to chewy meat with lot of bones in some other places). Chicken biryani is standard and not too spicy. I loved their samosas as well. I have heard that they have good lassi, though I haven't tasted it yet. This places is usually full of Indian tourists over weekend, so you may need to come a bit early (between 11 am-noon)."
        }, 
        {
            "index": 143, 
            "rating": 5, 
            "review": "Very good food, the garlic naan bread is quite nice.\nButter chicken always is my favorate."
        }, 
        {
            "index": 144, 
            "rating": 5, 
            "review": "I have been here twice and each time the staff was wonderful, and the food was amazing too. I am a huge fan of Indian food, so finding a buffet that served great quality food, at a beyond reasonable price had me sold. I highly recommend this place. The fresh Naan, that is made to order is delectable, along with the curried goat, and tikka masala was fully of flavor to compliment it all. Although the buffet has only a few choice, there wasn't any lack of flavor or quality to each choice. There is only one thing i would like change and that would be there being more light in the building. I personally like to see what i'm eating and it is awfully dim in there. Besides that, Yelpers please check this place out! It is worth your time, and belly happiness!"
        }, 
        {
            "index": 145, 
            "rating": 5, 
            "review": "Ok so I like to try many indian restaurants when I go on vacation...and this is awesome! Felt like home cooking....Sunday brunch....must go if you are visiting from out of town....cheaper than a regular buffet."
        }, 
        {
            "index": 146, 
            "rating": 5, 
            "review": "Good ambience and good food. The owner was very nice and so was the staff we reached there at 10:30 and they did not rush us at over all a good place to eat Indian food"
        }, 
        {
            "index": 147, 
            "rating": 4, 
            "review": "owned by a nepali, but serves authentic indian food. The service was slow even though we were the only ones in the restaurant on a Fri night. The location is a bit far from the strip, but worth the trip."
        }, 
        {
            "index": 148, 
            "rating": 1, 
            "review": "Very bad chicken fried rice ... had no spring onions ... just plain rice and chicken nothing else ... very disappointed with the food. After seeing those many reviews I don't think it's worth that many reviews"
        }, 
        {
            "index": 149, 
            "rating": 5, 
            "review": "The food is excellent. The service, one of the best I have seen at any Indian Restaurant's.\n\nTheir Biryani is very tasty, the pa Kora s - perfectly sprinkled with tiny salty spices and the mood music was superlative too. Love this place."
        }, 
        {
            "index": 150, 
            "rating": 5, 
            "review": "Oh man, where do I start?  My husband and I eat a whole grain plant-based diet, and Indian food has lots to offer.  We ordered one of almost everything on the Vegan menu, except for naan and roti.  We're full and satisfied, and have enough for at least one more meal!  Delicious flavors, savory aromas...what more could one ask for?  It's no surprise they were awarded Best Restaurant 2015."
        }, 
        {
            "index": 151, 
            "rating": 5, 
            "review": "Very good, nice buffet available daily.  Garlic Naan, served with buffet. Amazing Lentils,, Curry dishes, plenty of vegetarian dishes........ Manager and wait staff very friendly, interested in customer satisfaction. Very pleased! Excellent quality, and experience."
        }, 
        {
            "index": 152, 
            "rating": 5, 
            "review": "Awesome and affordable food, good service and family friendly . What else u need? I will come again to try other entrees . They have 9.99 buffet with endless choices ."
        }, 
        {
            "index": 153, 
            "rating": 5, 
            "review": "This place has opened two months ago and hence doesn't appear on google maps. But dont let that get into your way for this awesome north indian treat. I like the owner n staff who are very polite and attentive to their customers. The food is of high quality and is priced reasonably. My pick would be the traditional style chicken curry and would recommend it to everyone."
        }, 
        {
            "index": 154, 
            "rating": 3, 
            "review": "Two stars only on the strength of the food. \n\nSecond time here. First time was great good food and decent service. \n\nToday is a different story. 1pm lunch buffet time and theres not too many people here the wait service is bad. Waited 25 min for our naan. \n\nOur server went on break without telling us or notifying another waiter to watch our table. Did not get one refill of water. \n\nFound three pieces of hair in the tikka masala \n\nAlthough very good masala after the third hair I just couldn't eat anymore. \n\nOne of the hairs looked like an eyebrow hair. \n\nThe manager was nice about it and gave us the meals for free even after we tried to pay for at least 1."
        }, 
        {
            "index": 155, 
            "rating": 2, 
            "review": "I don't invest my time in reviewing places that don't shine for me, but rare weird experiences ask of Yelp-catharsis. If you're considering visiting this place, please note that all recent reviews have a trend: poor ratings by reviewers who are most likely connected to the Indian subcontinent; high ratings by others. If you are still coming, then keep your guest service expectations as low as possible. Because of the location and constant flow of touristy customers (who won't return in a hurry irrespective of their experience here), the management seems to care not much for customer service. Sorry folks, this is one atypical case where the Yelp rating is farcically misleading on many fronts. Would I visit this place again? Nope, not even if someone else is willing to pay for my meal."
        }, 
        {
            "index": 156, 
            "rating": 5, 
            "review": "Really enjoyed this buffet! Lots of selections, large parking lot, friendly service!\nWhen I went, they didn't serve any dishes with paneer but hopefully next time I visit again, they'll have it! Great flavor and consistency with all their selections."
        }, 
        {
            "index": 157, 
            "rating": 5, 
            "review": "This place is good - it bills itself as \"The Largest Indian Buffet in Las Vegas.\" It has about two or three steam trays/food serving stations, and it's all typical Indian buffet stuff - well-done tandoori chicken, chicken tikka masala, goat curry, biryani (I believe it was chicken), basmati rice, salad, and typical desserts - cut-up fruit, kheer, etc. It's reasonably priced (about $11 or $12) and well worth eating at if you're visiting the nearby Museum of Atomic Testing, or shopping at the Best Buy, Target, Men's Wearhouse, etc. while taking a break from the Strip.  There are also no gambling machines, so that's also a nice break from the Strip. I've eaten here three or four times, and will definitely continue to eat here when I'm in town."
        }, 
        {
            "index": 158, 
            "rating": 5, 
            "review": "Best Indian buffet I've ever had.  10 min drive from the strip near UNLV.  Big lunch buffet selection including meat dishes.  Everything was good and only $11 for lunch. \n\nMy favorites: goat curry and chicken biryani.  Goat curry had lots of sauce was good for dipping the garlic naan.  Naan was fresh from the oven and doughy (a bit too doughy).  Indian buffets usually have little spice to cater to the masses, but not Delhi.  Actually had good flavor and decent spice level. \n\nGet the mango lassi too.  You won't be disappointed.  5 stars overall."
        }, 
        {
            "index": 159, 
            "rating": 5, 
            "review": "This is my Indian place to go in Las Vegas. They have really good varieties and everything tasted good. \nMy favorite is goat curry and tandoori chicken. Their naan is very fluffy and awesome. Mango lassi is great as well. Servers are friendly and attentive. Overall, it's worth the money that you spent for an Indian buffet."
        }, 
        {
            "index": 160, 
            "rating": 5, 
            "review": "Excellent in everything ! \nFood tastes amazing\nVeg food, non veg food, service quality taste best !"
        }, 
        {
            "index": 161, 
            "rating": 5, 
            "review": "No complaints. All love and appreciation for delicious food and awesome service. I'll be back for sure!"
        }, 
        {
            "index": 162, 
            "rating": 3, 
            "review": "Whoo I'm kind of a fan!!! I would have definitely given 4 stars for food and cleanliness, however there was a little something the servers did that I'm sure would annoy most people, but I'll get to that later.\nWhen we first came in, there were about 4 other parties seated. There was a lot of seating available and everything was kept nice and clean. We didn't get any menus, once we sat down, she told us we could start on the buffet. We didn't realize they were only offering a buffet for lunch but no problem. She also asked if we wanted fresh garlic or regular naan and if we wanted mango lassi. We went with garlic naan and skipped on the lassi just because we wanted to see how the food was first. \nWe basically tried all the meat options and many of the vegetarian options and there wasn't a single dish we didn't like. They all had incredible flavor and you could tell everything was really fresh and constantly having the temperature checked. Forgive me, I forgot basically all the names as I just started getting into Indian cuisine, Sorry! But everything was delicious.\nNow time for that annoying little quirk they had. They started passing out fliers to everyone to vote for them as Best of Las Vegas while everyone was eating. Okay no problem, I told them I would later since I mean I was basically mid-bite lmao BUT they wouldn't leave our table till I was like okay fine and pulled it up on my phone. And they were telling me how to vote and apparently you need an account to vote, then she grabs my phone, clicks login and tells me to enter my Facebook. I don't have a Facebook. Soo then she takes my phone again and tells me to create an account and just stares at me waiting for me to do it. Are you kidding me?? Ughh so I enter my info and it says it sent me and email confirmation. I kept checking and I never got an email..finally I tell her I'll call her over when I get it. She continued to check on me the rest of the time we were there and when we checked out. -_- Ya I know, I could of said no, but I didn't want to be mean. They should of never been so aggressive with it anyways. \nOverall, food was amazing especially for $23 total (including tax before tip) and water was constantly being filled. Also fresh garlic naan was definitely a plus but hopefully if we come back, they don't attack us with that crap again. If they don't, 4 stars."
        }, 
        {
            "index": 163, 
            "rating": 5, 
            "review": "Is it just me or is curry more potent than Thanksgiving turkey? I feel like I need to drift off into a deep slumber every time I have some Indian food! \nBut I don't care. It's worth it. \nI've only eaten here for the lunch buffet (about $11- cheaper than most Indian buffets I believe) and have enjoyed it every time. Choose between garlic/butter or just plain naan. Can't go wrong with either. Very flavorful dishes and vegetarian options. Only wish there were more! Usually only one choice for dessert. Employees also prompt and accommodating."
        }, 
        {
            "index": 164, 
            "rating": 5, 
            "review": "Really really amazing food. Very authentic in terms of taste. If you are in Vegas  and love Indian food then it's a must visit. I am out of words to describe this place"
        }, 
        {
            "index": 165, 
            "rating": 5, 
            "review": "The best Indian I've ever had in the states. Im from uk and Indian is a big dish so it takes a lot for me to say this. Highly recommend."
        }, 
        {
            "index": 166, 
            "rating": 5, 
            "review": "Awesome food....very well organized... More staff to help... I have tried all the Indian Restaurants in Las Vegas.. But this is my no 1. Choice..\n\nI would recommend all who visit Las vegas please check this place out....\n\nDelhi Palace .."
        }, 
        {
            "index": 167, 
            "rating": 1, 
            "review": "do not go here\ndo not trust any ratings\n\nwe went for dinner and food was stale\n\ndecor and service was good\n\ncosted us $90. do not serve stale food to families who come for dinner and spend extra money."
        }, 
        {
            "index": 168, 
            "rating": 1, 
            "review": "Sat for 10 minutes- no menus, no drinks, no service.  Tried to seat us at someone else's table.  Won't be back."
        }, 
        {
            "index": 169, 
            "rating": 4, 
            "review": "Great food! Whenever i travel i automatically dont expect much from ethnic food in really touristy places, ie las vegas, but the food here was actually really good! I always judge my indian restaurants on their malai kofta and this place was right up there with my favorite places. Kudos and keep it up!"
        }, 
        {
            "index": 170, 
            "rating": 5, 
            "review": "The food is really yummy especially the tandoori chicken. It's very well cooked and their garlic naan is amazing! They also deliver which is a plus!"
        }, 
        {
            "index": 171, 
            "rating": 3, 
            "review": "Huge selection of buffet items. Typical Indian buffet. I wouldn't say it's anything really great but I've also had worse so if this is an option and you're looking for reasonably priced buffet, I'd recommend."
        }, 
        {
            "index": 172, 
            "rating": 5, 
            "review": "Fantastic as always. I decided to mostly eat the vegetarian dishes today. Saag paneer, chana masala, yellow dal. Mmmmm mmmm mmmm. It was fantastic. The veggie Palau rice was also incredible. My favorite buffet appetizer are the samosas and the bread as usual was fluffy and delicious. Today I tried their Chai Masala and was very impressed. Not overly sweet, but just enough sweetness to compliment the tea. Thanks Delhi!!!"
        }, 
        {
            "index": 173, 
            "rating": 4, 
            "review": "This restaurant is big and has a nicer setting than I thought it would. The owner Hari, comes from Tamba on the strip. \n\nI was dining by myself so I went with the vegetable thali and mango lassi which is free if you check into yelp. My mango lassi was made in a blender at the bar so I could hear it being made from where I was sitting. The mango lassi was icy and tasted watered down. This was the first non creamy mango lassi I have had. \n\nThe samosa filling was well seasoned, not too greasy, but breading was a tad thick. It took 45 minutes for my vegetable thali to come. I am used to Indian restaurants being abnormally fast. \n\nThe presentation of the thali was classy and each dish tasted freshly made. My favorites were the malai kofta and the Kashmir sabji, the rest I could have done without. The malai kofta was well executed and the creaminess of the curry and aromatic spices worked harmoniously. First time I have had the Kashmir sabji and the assorted vegetables seasoned with herbs and spices pairs well with the richness of the malai kofta.  \n\nAll the food I had was thoughtfully prepared and freshly made. Hari seems to genuinely care about his customers. After finding out i didn't like my mango lassi he made me another one without the ice. I hope they work on getting the food out in a more timely manner because I do not know anyone that wants to wait almost an hour for Indian food."
        }, 
        {
            "index": 174, 
            "rating": 5, 
            "review": "I LOVE this place! I can't say enough! We went to Mount Everest indian buffet and it was entirely too spicy and I love spicy food! But this place is so perfect friendly and clean."
        }, 
        {
            "index": 175, 
            "rating": 5, 
            "review": "Possibly the best Indian spot I've ever been to. The Tandoori chicken was better than an Indian wedding I went to with and Indian caterer, and the non-veggie dhali was all around phenomenal."
        }, 
        {
            "index": 176, 
            "rating": 5, 
            "review": "I am from out of state. My best friend and I were looking in the area to eat and decided to try out Dehli. Trying new food is always a risk. Dehli put that fear to rest. Hands down one of the best Indian cuisine buffets I've been to. Great service, great food, can it get better than that??? Would come back for sure!"
        }, 
        {
            "index": 177, 
            "rating": 5, 
            "review": "We had come in from Los Angeles and we were so happy to find such an authentic Indian restaurant with food that excites your taste buds. Thank you for the wonderful sweets! :)"
        }, 
        {
            "index": 178, 
            "rating": 5, 
            "review": "So far as I have experienced, the best Indian buffet in LV.  The staff is nice without being overbearing, and very attentive.  The food is always excellent.  I also like the fact that there is always a different item on the buffet which is veggie."
        }, 
        {
            "index": 179, 
            "rating": 3, 
            "review": "Went for the lunch buffet, wide selection of chicken dishes, chicken tandoori, chili chicken, was quite appetizing, the curry chicken, not so.  The chicken curry seemed too watery to me.  The spices were off a little bit on the light side in all the dishes.   but overall, I liked it because of the large selection and the large dining area.  The AC was off so it was a bit muggy and uncomfortable.  Overall, based on the food alone, the taste is decent but not inspiring.  It's good because they put so much effort in it, but I don't think it's quite 4.5 stars.  I'd say closer to 3.5 to 4."
        }, 
        {
            "index": 180, 
            "rating": 4, 
            "review": "This review is for the lunch buffet only. I have came to this place several times, and I return every time I get bored of bland everyday food, and I need spicy flavors with the kind of kick that jolts me out of my culinary boredom. For that effect I specially recommend the Chicken Makhani and Malai Kofta; I usually don't care much for the meat and just get the sauce and dip the Biryani garlic bread in it, then I frantically reach for my ice cold Coke (keep it close). The seasoned rice is also great. Warm atmosphere, friendly service, overall very good experience."
        }, 
        {
            "index": 181, 
            "rating": 5, 
            "review": "By far the best Indian food in Las Vegas\nThe service almost too good\nThe food amazing\nThe restaurant very clean\nThe spicy very spicy\nThe price very fair"
        }, 
        {
            "index": 182, 
            "rating": 5, 
            "review": "The Best Indian Buffet in town with a wide variety of dishes and very tasty food. Sure will recommend any one try and the staff is very polite with a big smile."
        }, 
        {
            "index": 183, 
            "rating": 4, 
            "review": "Very good buffet, at least twenty items to choose from, haven't eaten dinner there yet. Very friendly staff."
        }, 
        {
            "index": 184, 
            "rating": 5, 
            "review": "Lunch buffet was awesome! Very large selection of items, vegetarian and non-vegetarian alike. \n\nNaan bread is brought to your table fresh from the oven, so no problem of dried out (or missing) naan in the buffet line like some other places. As if you need another reason to wolf down warm deliciousness...ask for the garlic naan, mmmmmm, you won't be sorry.\n\nWe ended our meal with one of my favorite things - a cup of real chai tea ($2/cup). If you have  never had it, you have to add your own sweetener, which is nice because you can adjust it to your liking (and you don't have to use real sugar if you prefer artificial sweeteners).\n\nI would have to say this is one of the best Indian buffets I have had in Vegas. We left full and happy, without feeling heavy (other buffets we've visited often had overly oily items and this one did not). I also think that for the quality and selection of items, they could actually charge a couple dollars more and still be a bargain. We will definitely be back!\n\nnote to owners:  I wish you offered some kind of drink menu. Not only would customers would know what kind of drink options were available for purchase, it would also give your business the opportunity for additional revenue during the lunch buffet time."
        }, 
        {
            "index": 185, 
            "rating": 3, 
            "review": "So i am back here after 2 years!!!! The owner is still the same courteous person. Not all food were the same what I had it before. I had mango lassi too much yogurt and also the consistency was on the watery side. I had goat curry it was finger licking good. Butter chicken was nice & creamy but the flavor was bit on the pale side. Tandoori chicken was overcooked & dry. I loved palak paneer & gulab jamun so overall I would say it was not convincing as I was specially visiting for butter chicken."
        }, 
        {
            "index": 186, 
            "rating": 4, 
            "review": "I was very excited to get Indian food while in Vegas as Phoenix's Indian food scene.... how can I say this nicely.... leaves something to be desired. After seeing the great reviews, I knew we had to check Delhi out. We came for the lunch buffet on a weekday and it was not overly crowded (which was nice). The buffet was large with an extensive selection of dishes. Most of the food was quite good, with the spicy chicken curry being the tastiest option (in my opinion). They also had a large variety of vegetarian options if that is something you are looking for. I was a little disappointed that they didn't have chai tea on the buffet, nor did they have my favorite Indian dessert (the rice pudding... yum)... but apparently the selection changes from day to day, so maybe we came on an off day. The price is good for all that you get (about 11$). I must admit that I have had a better Indian buffet experience in Vegas (Evergreen... yum), but this is another great option, especially if you are a local. Happy eating, Vegas!"
        }, 
        {
            "index": 187, 
            "rating": 5, 
            "review": "This was my first time eating Indian food ever! And be experience was amazing. I suggest it to everybody."
        }, 
        {
            "index": 188, 
            "rating": 1, 
            "review": "Food is good, but the delivery experience was horrible - food was 30 minutes late and cold, but that wasn't the worst of it.  The driver called and told us we'd need to come down from our apartment to pick up the food from his car, rather than coming up to our apartment (we order delivery a lot and never have that problem).  When we got the food, we told the driver we'd be lodging a complaint, and he rudely told us he'd tell the restaurant never to deliver to us again.  We called and asked the manager for a refund, and he refused to even refund the tip we had pre-paid for the driver.  Horrible customer service, late delivery, cold food, rude driver, and no ownership of the issue from the manager."
        }, 
        {
            "index": 189, 
            "rating": 5, 
            "review": "Loved the food here. We had the lunch buffet and we really enjoyed it. This will be our go to place for Indian food in Las Vegas."
        }, 
        {
            "index": 190, 
            "rating": 4, 
            "review": "If I rated it on the food flavor alone, I would give it five stars. What's holding me back is the casual racism exhibited by the owners. \n\nIf you don't think white people can handle spicy food, just don't ask us how spicy they want it. Make us think you only offer it one way. But that's not what you did. You specifically asked how spicy I wanted my Vindaloo. I said, \"Very spicy.\" You looked at me like I was crazy, and asked again. I said, \"Indian spicy\", hoping that magical keyword would convince you. No, instead, you looked me in the eye and asked if it was for someone else. Had I not been ready to rob a bank for a Vindaloo, I would have left right then, but, at this point, I was committed. So, thinking that you finally were going to give me what I asked, I let it go, and we ordered the rest of our stuff. \n\nThe Vindaloo's spice level was somewhere between yogurt and a milk shake. Granted, it had a fantastic flavor, as did the Tikka Masala, the Mahkane, and the Saag Paneer. The Kashmir Naan was so delicious it brought a tear to my eye, and the Galub Jamun was top-notch. In fact, the only thing missing from my night of Indian food bliss was some vague tingle; some heat to let me know that I had eaten some spices. It was just not there.  \n\nI'll definitely order from here again, but I need to know what secret code I can give you so that you'll actually put some heat in my Vindaloo."
        }, 
        {
            "index": 191, 
            "rating": 5, 
            "review": "Thank you, Yelp, for finding me a place with delicious food, that's open late, not on the strip, and most importantly takes American Express! \n\nFantastic food. Great flavor! Ordered butter chicken, level 7 spicy (next time I'll order level 9, could be spicier for my taste), and buttered naan for take out. Wonderful service, very friendly staff, and food was ready in the exact amount of time they said. Wish I had found them earlier in my work trip!"
        }, 
        {
            "index": 192, 
            "rating": 5, 
            "review": "By far the best food during my Vegas stay. I spent two weeks vacationing in Vegas and went to several restaurants everyday.   For dinner I had a yellow curry lamb dish. This dish is in my top three rated dishes of life. The chicken masala was the best that I've had. This place's lunch buffet easily beat out Caesar's palace buffet and was a fourth the cost.  I I will eat here anytime I'm in Vegas."
        }, 
        {
            "index": 193, 
            "rating": 4, 
            "review": "OMG!  I stumbled on this place about 8 weeks ago going to my favorite sushi joint.  Let me point out that I come from the UK and have eaten at some of the best Indian restaurants London has to offer, in addition to eating in the homes of my dear friends who cooked (some who are Chefs) for me on a regular basis.   As Las Vegas goes, key word here is  Las Vegas,  the buffet is amazing and is worth every penny.  We went for dinner about 3 weeks ago and ordered off of the menu and the food was very good!  I recommend that if you are looking for Indian food you give this place a try."
        }, 
        {
            "index": 194, 
            "rating": 5, 
            "review": "After 6 hours of long drive I reached Vegas and went to this restaurant. Amazing food....authentic indian food...we had shadi paneer, dal and palak paneer. We all loved it... I felt like I am eating in India..."
        }, 
        {
            "index": 195, 
            "rating": 5, 
            "review": "I love the food environment . It's affordable their chicken biryani, palak paneer are best plus there chilli chicken and reshmi kabab are good. Food variet is owsum gajar halwa , gulam jaman and butter naan and garlic naan are owsum I love this place."
        }, 
        {
            "index": 196, 
            "rating": 5, 
            "review": "Amazing Indian food. Hari was very accommodating. We kept it simple with chicken Vindaloo and the traditional chicken curry, but both were incredible. The paneer kulcha was the perfect vehicle to deliver these tasty morsels to our bellies. Check this place out if you are in the Las Vegas area and LOVE Indian cuisine. Highly recommended. Cheers! \n\nI am ridiculously full."
        }, 
        {
            "index": 197, 
            "rating": 5, 
            "review": "Its the best Indian Restaurant that I came across in Vegas.They were ready to make jain dishes for us and all tasted so delicious that we went twice there. I must say that the ambience was pretty good as well and the place was neat and tidy. The willingness to cater to the customers' need is what blew my mind. I am gonna come here every time I visit Vegas. Will definitely recommend to all my friends:)"
        }, 
        {
            "index": 198, 
            "rating": 5, 
            "review": "The food is delicious. I went there with my family today and ordered the paneer chili and chili chicken as appetizers. What can i say the appetizers was absolutely amazing. Try ordering it at a level 6-7 spicy and it will burn your mouth. Loved the Chicken Tikka Masala and Chicken Jalfrezi. They also have a check-in deal for yelp for a free lassi or soda. Last but not least one of my favorites was Gajar Halwa, it was nice and warm, and absolutely amazing. The prices are reasonable and cheap compared to other Indian Restaraunts around vegas. Chicken dishes are at $14 versus other restaraunts that have them for $18. They also have huge buffet for only $9.99. The most selections for the lowest prices. Now thats what i called a indian Buffet. I would deffinetly come back here again."
        }, 
        {
            "index": 199, 
            "rating": 1, 
            "review": "Terrible. We did not receive appetizer or drink for 1 hour. Don't go by overall reviews. Poor management. No communication."
        }, 
        {
            "index": 200, 
            "rating": 5, 
            "review": "Yum, yum,yum!!  Great selection of food.  Chilli chicken, naan bread, and all the others I don't remember the names but equally yummy.  Restaurant was very clean and the service was great.  Will definitely return."
        }, 
        {
            "index": 201, 
            "rating": 5, 
            "review": "We LOVED this place! The food selection on the lunch buffet was incredible and tasted amazing. We're pretty picky about our Indian food, and this place did not disappoint! They had some dishes new to us! Fav dish was the Chicken Tikka Masala. Flavors were nice & even. Some Indian buffets do not have much for a \"salad\" section, but here they did, with pickled items and a mango desert. We witnessed staff taking food temperature readings, which is a nice thing to see. It means they care about the customer. Very clean, & friendly staff. I lived out in NYC for a number of years, and this restaurant beats the places in Little India in Queens and the fancy places on the East side of Manhattan."
        }, 
        {
            "index": 202, 
            "rating": 5, 
            "review": "my husband and I came here after the sales associate at the pandora store at the forum recommended it. \n\nfor apps we had bhel puri, chili chicken and chicken momos. the bhel puri was nice and spicy. the tamarind chutney is as good as homemade. the chili chicken is a huge portion and could double as an entrée. the momos were tasty also.\n\nwe then shared a non-veg thali and everything was divine. the best part was that the tabdoori chicken appetizer that comes with the thali wasn't hot pink in color (and it shouldn't be people just FYI) it was nicely BBQ'd and spiced beautifully. loved it! \n\nfinally, a true test for me, was the chai. perfection! I really enjoyed thai place and will definitely be back. \n\nwell done!"
        }, 
        {
            "index": 203, 
            "rating": 5, 
            "review": "Fantastic Indian buffet for lunch. Chicken tika and curried goat were excellent. Great service and atmosphere. Very good variety."
        }, 
        {
            "index": 204, 
            "rating": 2, 
            "review": "My boyfriend and I decided to try this place after finding out our first choice restaurant had a 60 to 90 min wait.  Little did we know that we would end up waiting for 10 minutes before we were even given water and a chance to order, and another 50 minutes before our food would arrive.  And the restaurant was only half full!  After we finished eating, we called for the check and again, we were made to wait as we watched the guy who promised to bring us the check run around, refilling the potpourri bowl and ringing other customers up..basically doing anything but bringing us the check.  \n\nI guess the food was decent enough.  But I don't care how decent your food is, if you can't get your food out within a reasonable amount of time when your restaurant is only HALF full, then you've got an issue and you can forget about ever attracting your customers back.  As such, we could have stayed at our first choice restaurant and still ended up eating at around the same time.  We would also have saved on the gas money it took us to drive over to this place."
        }, 
        {
            "index": 205, 
            "rating": 5, 
            "review": "Great buffet! Delicious food and amazing service :) The lunch buffet has a lot of great options especially if you don't eat meat!"
        }, 
        {
            "index": 206, 
            "rating": 5, 
            "review": "Excellent buffet. Large selection (including plenty of vegetarian). The restaurant is big and quite popular with both Indians and non-Indians alike. Everyone needs to try this!"
        }, 
        {
            "index": 207, 
            "rating": 5, 
            "review": "Awesome!  Awesome! My fiancé and I eat a lot of Indian food back home (Queens, NY) and I'll say this food is better than most we've eaten in NY. Sooo much flavor. Sooo many chooses for the buffet lunch. We visit Vegas often and were getting tired of eating like tourists and have decided to eat where the locals go. Everyone here is friendly and smiling. Very nice people. This is a family owned restaurant and we spoke with owner for a few minutes. Our water was always topped off and with so many food choices we practically rolled out of the place. We will definitely eat here every time we're in town."
        }, 
        {
            "index": 208, 
            "rating": 4, 
            "review": "Good buffet with many items. All appetizers are good. chilli chicken is the killer. I will go again just for that. Biryani is not actual biryani. Dont go for it. Curries need some additional indian flavors. Overall the buffet is worth the money"
        }, 
        {
            "index": 209, 
            "rating": 3, 
            "review": "The lunch buffet was ok, I felt that the food was very spicy at least that part was authentic they didn't water down the spices. I had wished they had chicken tikka Marsala even though it's not an authentic Indian dish but it's a tasty dish. \n\nI wasn't that impressed with the vegetarian curries, I'd would have liked it if they had Chana Marsala and vegi korma. I'm sure they rotate their dishes but the day I went I wasn't that happy with the buffet selection. \n\nThe naan was good and so was the mango lassi. That was the best part."
        }, 
        {
            "index": 210, 
            "rating": 4, 
            "review": "LUNCH BUFFET ONLY\n\nHow does one intelligently review an Indian buffet ? First off, India Delhi has the second largest population in the world and projected to surpass China within the next ten years. China has fifty-three ethnic minority groups. Where as India has thousands of enthic groups each with their unique cuisine.\n\nDelhi Indian Cuisine is operated by two families, one Indian and the other Nepalese. While Mt. Everest India's Cuisine on the westside is owned and operated by just one Nepalese family. \n\nI have dined at many wonderful Indian restaurant all over the US. Buffets are for the general public to sample Indian cuisine and are usually available during lunch. Dinner is always much more satisfying and my preferred way to really sample many od India's incredible cuisines. I also think it's important to know which region of India the head chef is from. It's important since the seasoning and method of cooking will be greatly influenced by his region of origin.\n\nI've pretty much have tried all the Indian buffets in town and I would rank Delhi Indian Cuisine's buffet equal to the spicier Taj Palace on Eastern Avenue and certainly superior to Mt. Everest India's Cuisine makeshift buffet counter. My review of Taj Palace is available. Mt. Everest India's Cuisine had failed to impress me in more than one way, and I didn't bother to place a review. \n\nMy most favorite Indian buffet is served at the beautiful Royal Taj of Hanover, MD.  The family is from the region of Kashmir."
        }, 
        {
            "index": 211, 
            "rating": 4, 
            "review": "First time trying Indian food. Didn't know what to eat so we figured AYCE is a safe way to go to try everything. \n\nAll the food was delicious!!!   Be aware, some were spicier than I could handle. But the yummy mango lassi hit the spot. \n\nManager/owner was very nice and helpful. Prices are great.  Going to go back for dinner and try more items. \n\nOnly reason why they didn't get five stars was the service from the wait staff. The manager came to the table more than the young girl that was supposed to be the waitress.   Only one other table was eating besides us and she walked past our dirty plates and we had to flag her down to get drink refills. \n\nOther than that. This will be our spot to go for curry and naan."
        }, 
        {
            "index": 212, 
            "rating": 5, 
            "review": "Wish I could give you 10 stars. Food is excellent. Buffet is a great price. Staff are friendly. Place is clean and beautiful. Nice dining experience."
        }, 
        {
            "index": 213, 
            "rating": 4, 
            "review": "Very comfortable n nice place to eat with great menu n choice of food \nDesert \"Gulab Jamun\" is very delicious over ther good job guys !!"
        }, 
        {
            "index": 214, 
            "rating": 4, 
            "review": "Spacious restaurant with many food selections. Halal/zabiha meat. Tasty chicken curry. The owner was friendly."
        }, 
        {
            "index": 215, 
            "rating": 5, 
            "review": "Food is mouth watering and service is awesome.\nThey do care for your comfort, your oder and your taste\n\nI would recommend to give it a try for once."
        }, 
        {
            "index": 216, 
            "rating": 5, 
            "review": "Food and service were nothing short of amazing.  The menu featured some traditional dishes not seen elsewhere.  Besides a vegetarian menu section, there was also a wealth of vegan offerings.  We will absolutely be back."
        }, 
        {
            "index": 217, 
            "rating": 4, 
            "review": "The buffet was delicious without a doubt. Their bread is also very nice and well seasoned. I'm sure that if I was a fan of Indian good (I came with family), I would've loved it. Getting enough rice seems to help with the spices, but again, definitely great for people who are a fan. The service was amazing. They were very attentive. Although the food was spicy, it was of amazing quality!"
        }, 
        {
            "index": 218, 
            "rating": 5, 
            "review": "Out for past 11 days and was tired of eating burgers and pizza, we wanted to have Indian food. While browsing yelp, we stumbled upon this place. Dinner was great, service was also good. Next day we tried their lunch buffet, and it was even better than last night's dinner. Lots of option, great taste and overall great service. I would recommend this place to my Friends visiting Vegas."
        }, 
        {
            "index": 219, 
            "rating": 4, 
            "review": "This place was great the food was delicious. We had the sev puri, all the ingredients tasted very fresh with just the right amount of spice. I also had the chicken tikka masala and it was also very good, they made it spicy to my specific request, even the nan was great."
        }, 
        {
            "index": 220, 
            "rating": 5, 
            "review": "I had a GREAT Indian lunch here. The lunch buffet was huge with a very good selection. The food was HOT just the way it is supposed to be. The chicken was very tender and moist. The service was spot on. I will definitely be letting my friends know about this great restaurant."
        }, 
        {
            "index": 221, 
            "rating": 3, 
            "review": "When we walked in this place was completely empty.  There were four of us and we ordered an appetizer/starter (samosa chatt), the tandoori sizzler, chicken vindaloo, chicken tika masala, rice and garlic naan. The food was all wonderful and service was good too. The only two things I didn't like is that our waiter didn't like the fact that we didn't order one entree per person (\"you realize these dishes are meant to be for one person\"), and the prices. I can get the same foods at many other Indian restaurants for less, larger portions and that have a better taste. I'm glad I went and tried it, but probably won't be back."
        }, 
        {
            "index": 222, 
            "rating": 5, 
            "review": "Best food and service. Best taste in Las Vegas veg korma, paneer kadahi, dal everything was tasting. Staff and restaurant very clean."
        }, 
        {
            "index": 223, 
            "rating": 3, 
            "review": "We went for a buffet on  Wednesday 12/14. They have a huge selection. Food tasted good. Samosa was the best. Naan was served at table. Naan was good. They won't serve you naan until you empty your naan basket even if it's the last bite left. Cmon guys I respect your sense of responsibility of not wasting food but don't give that reason to customers who need a naan. I don't want to wait for five minutes between my last bite and next bite.\nI know there might be people who waste lot of food in buffet but there must be a better way to refill Naan. You are already saving food by serving naan at table."
        }, 
        {
            "index": 224, 
            "rating": 3, 
            "review": "This isn't good for vegetarians. The options were limited.. for about 13$ I expect more. Also the  restrooms weren't functional when we went."
        }, 
        {
            "index": 225, 
            "rating": 5, 
            "review": "Amazing food and service! Highly recommended! We had the paneer tikka masala and paneer shahi with garlic and plain naan. Best Indian food in LV!"
        }, 
        {
            "index": 226, 
            "rating": 5, 
            "review": "Amazing Indian food! The buttered chicken and garlic naan are the best here! The service is great and a nice clean restaurant. Definitely will be coming back!"
        }, 
        {
            "index": 227, 
            "rating": 3, 
            "review": "I was lured in by the good yelp reviews, found myself in Vegas wanting some really good chicken tikka masala,  it wasn't terrible but I wasn't impressed. I like my food spicy so I ordered 7 out of 10 for the spice level.  When my food came out I was very surprised with the portion size I received a bowl of sauce and 8 of the smallest chunks of chicken, some which were dry while other pieces were mushy. The level of spiciness was perfect but the flavor of the food just wasn't there for me.  Service was great but the place was empty.  I wouldn't come back again."
        }, 
        {
            "index": 228, 
            "rating": 5, 
            "review": "My friend and I had dinner here after meeting the chef om wonderful food I enjoy the variety of naan bread and vegetable Thali relaxing atmosphere and very nice service I love going to aurhentic  restaurants where they actually have authentic music playing definitely will be coming back"
        }, 
        {
            "index": 229, 
            "rating": 5, 
            "review": "I love this place! Naan is always delicious. Their lentil soup is hands down my favorite. Their dishes are tasty! I always get the American special -- chicken tiki masala. But I've tasted a few other dishes and I wasn't disappointed. Their service was quick and friendly, which is hard to come by! It's my go to Indian restaurant in Vegas."
        }, 
        {
            "index": 230, 
            "rating": 5, 
            "review": "Amazing food and good service. We had goat Biryani and it was excellent! The vegetarian was very good as well. Whenever I come back to Vegas, will definitely come back and eat here!"
        }, 
        {
            "index": 231, 
            "rating": 5, 
            "review": "OUTSTANDING! \n\nWhen we walked in, we had our doubts.  The restaurant is pretty big, and the decor is very nice.  But it was 7:30PM and the place was literally empty.  Not one other customer.  Normally, this would have turned us off, but we decided to give it a try because of the good reviews on Yelp.  We were not disappointed.  My Butter Chicken was not the best I've ever had, but it was delicious with the perfect amount of spice.  My nephew said that his Tikka Masala was the best he's ever had.  He lives in Vegas and commented that he has a new \"go to place\" for Indian.  Our vegetable samosa's were very nice as well, but the reason I have to give five stars is because of the Chicken Pakora's.  They had the perfect amount of breading in comparison to the chicken.  The outside was just crispy enough, and the chicken on the inside was moist, tender, and juicy.  They were without a doubt the best pakora's I've ever had, and I've been to Indian restaurants all over the world.  The service was very friendly, and quick (granted, we were the only ones in the restaurant), and the prices were surprisingly reasonable.  Give Delhi Indian Cuisine a try if you are in Vegas and want a fantastic Indian meal.  You will not be disappointed!"
        }, 
        {
            "index": 232, 
            "rating": 5, 
            "review": "Perfect food !!!\nI ordered Paneer Tikka Masala Vegetable, Dal Makhani and Garlic Naan !!! All of them had amazing flavor and taste.. As a foodie, I would definitely recommend this restaurant for an authentic Indian gastronomic delight!!\nDeserves a sixth star for superb service.."
        }, 
        {
            "index": 233, 
            "rating": 5, 
            "review": "AAAA++++++++++++    This is by far the best tasting, decor, customer service and price ever!!!! The people here are very nice and the food is awesome for an indian lunch buffet. Huge selection and the price is amazing! I love it and I will be back very soon. When I saw indian people surrounding me ... I knew I found my pot of gold at the end of my rainbow for indian buffet!!! woohooo!!! The garlic nann bread is absolutely amazing.... order it.. order it NOW!!!!!  They are so good at topping off the food and if by chance you need something in the middle of your meal just ask someone they will be glad to help you. I was helped by a younger cubby boy and he was the sweetest waiter ever! He ran to assist me when I ordered an indian tea and then ran to get it and then I ordered a coke and he ran to fetch that and smiled ear to ear like it was the best day of his life to be at work. \n\nI couldn't believe it was happening to me... amazing lunch for cheap and sweet little boy with fantastic customer service!!!!!"
        }, 
        {
            "index": 234, 
            "rating": 2, 
            "review": "They do take American Express, but will try to talk you into using another card.  The food was decent, but I am rating them low due to how they scammed me into using a Visa card."
        }, 
        {
            "index": 235, 
            "rating": 4, 
            "review": "big lunch buffet  (10.95  $ )  with lots of things to choose from . it's a little bit on the spicy side , but not too much . food was fresh and the seasoning was good . free mango lassie or soda with yelp check in . free choice of regular or garlic naan ."
        }, 
        {
            "index": 236, 
            "rating": 4, 
            "review": "I really enjoyed the buffet selection- six meats - chicken and goat, multiple vegetable dishes, free naan, deserts, and they do not push you to start at the salad bar.   I didn't eat again all day.\n\nIf you are sensitive to spice, which I am, make sure you taste the dishes and avoid spicy curries (even the mildly hot ones are trouble!).  I had a bad experience later that evening."
        }, 
        {
            "index": 237, 
            "rating": 5, 
            "review": "My husband and I came here for dinner our first night in Vegas.  Our dinner was so delicious that we decided to come back again the next night! This was the best Indian food we have had compared to places in San Francisco and Sacramento, CA. It has delicious food, great service and good prices. The restaurant is also nice and clean.\nThe Tandoori Chicken was fresh and sizzling when it came to our table. The meat was tender and falling off the bones! We also had the Lamb Curry, Chicken Curry, and Chicken Tikka Masala. All of the curries were amazing with just the right amount of spices. The staff was friendly and accommodating. We will definitely be coming back here when we visit Vegas!"
        }, 
        {
            "index": 238, 
            "rating": 3, 
            "review": "Food tasted pretty fresh and tasty for this buffet. They had a large variety to choose from. They had goat, chicken, and a lot of vegetarian options. Some of the items were pretty spicy. The item that stood out the most was their Garlic naan. It was exceptional. I've been to several Indian buffet back in my home state of Iowa so I was not sure what to expect here in Vegas. Heard a lot of good reviews so we tried this place out. I am giving it 3 stars because I expected the food to be a step above what I get in Iowa but I didn't get that. Sorry I just expect a little more when you are in Vegas. I would still recommend this place if you want Indian buffet because at $11.99 for lunch was pretty cheap for the variety you get.\n\nFood - 3/5   Thought it would be better than what I get in Iowa, come on.... it's Vegas!!!\n\nService - 5/5  They refilled our drinks often and took our empty plates."
        }, 
        {
            "index": 239, 
            "rating": 5, 
            "review": "What an excellent surprise!  Babygirl and I were out shopping in the area and were arguing - oops, I mean \"discussing\" our options along Maryland Parkway, and had finally reluctantly agreed to go to Jason's Deli, Turned out, the parking lot was jammed, it was unseasonably hot for October, and we were ready to turn that car around and go home when I remembered that the old soup place in the next lot over was now an Indian place. I admit I didn't hold out much hope, but it's a cuisine of which we are mutually fond, and I figured we could find SOMETHING good on the menu.\n\nYee hah! Turns out they featured the ubiquitous lunchtime buffet, so we could try it all. \nThe tandoori chicken was surprisingly moist, the butter chicken rich and tasty, and the curry had a satisfying kick. There were lots of vegetarian options involving rice, lentils, spinach, etc., which I never got to. Not because I don't like them; I happen to believe that All Foods Matter, but I had slurped up so much sauce with that nice hot naan, that I had to tap out. Did manage to wash down a big glop of sweetened carrots that made a fine, if unintended, dessert.\n\nMight have been a four star, but it's getting five because there was actual meat in all those steam table trays, not just the sauce with a few barely detectable chunks as is too often the case at Indian buffets. Good job. \n\nHighly recommend that next time you're in the area, skip the \"Deli\" and hit the \"Delhi\".\n\n(Did you see what I did there? Hee hee hee)."
        }, 
        {
            "index": 240, 
            "rating": 5, 
            "review": "I am sorry this restaurant is not closer to our part of town, for when we are craving Indian food! My husband and I stopped in for their lunch buffet. A great selection, and all the food tasted fresh. I thought the particular standouts were the Goat Curry, the onion bhaji, and the garlic naan. I love goat, and of course its not easy to find in the U.S., and this is a staple on Delhi's buffet. Goat meat is a little stronger tasting than beef, and stood up to the sauce very well. The cuts of meat are on-the-bone...I wanted to dive in with my fingers and grab each piece and gnaw it clean!  The onion bhaji was crisp and tasty; not greasy at all. And the garlic naan was light and chewy and very, very fresh.\nI'm not a big fan of the bright yellow curry sauces, but my husband reported that the Punjabi curry was very good. The saag paneer was good also.. The tandoori chicken wasn't as highly spiced as I like, but it was moist enough to be tasty. Like the onion bhaji, the samosas were crisp, not soggy, and had a nice flavor. The biryani rice was a little greasy, but that was probably my only real nitpick with any of the dishes.\nThey also have the standard side sauces, raita and mint sauce. We could have eaten those all day long, with baskets of naan! For dessert, there was warm carrot halwah (very tasty, but a little odd to us; not quite a side dish; not quite a dessert); and one other selection. You'll have to look for the \"samia\" (I've always known it as \"kheer\"), at the back of the salad table. It's not labeled as a dessert, and it's right next to the similar-looking raita sauce. If you aren't familiar with it, its a sweet milk and vermicelli-noodle pudding flavored with cardamom. I like mine with more cardamom, but this was a nice cool & sweet ending to a spicy lunch :-) \nWith one soda pop, our meal for 2 was about $25, and well worth it. Rather than cook just one main dish at home, we enjoyed being have a lot of good Indian food at one meal. Oh, and the employees were very friendly as well!"
        }, 
        {
            "index": 241, 
            "rating": 5, 
            "review": "Delhi Indian cuisine is nothing short of delightful, as soon as you walk in you are overwhelmed (in the best way possible) by the most wonderful smells. You are immediately greeted by staff,  seated, and walked through their menu. We chose what I can best describe as a sampler platter. It was so great, we will be coming back soon, promise."
        }, 
        {
            "index": 242, 
            "rating": 2, 
            "review": "Holy cow do not come here today. It's about 95 degrees and 95% humidity inside here! I came here to dine on authentic Indian cuisine not dine in authentic Indian summer heat. On top of everything being very spicy and no ice in your drinks. Was never asked if we wanted drinks. We were never offered menus. We never even had a server. The food was ok. I would assume it was very authentic and that is why they have such good reviews on here. I would hope that ordering off the menu would be better. The pictures on Yelp are definitely not from the buffet. 1 extra star because on the plus side I lost three pounds due to excessive sweating;)!"
        }, 
        {
            "index": 243, 
            "rating": 5, 
            "review": "We came to this restaurant with our friends thrice during our 3 days stay in Vegas. The buffet was amazingly awesome. Everything was freshly made and had lots of varieties both north and south Indian cuisines. Do try the golgappas here, I must say it was yummy.. We had thali in our dinner..u can only finish the thali, if your hunger level is 5 out of 5. Restaurant is well maintained. I recommend it to everyone atleast to try once."
        }, 
        {
            "index": 244, 
            "rating": 5, 
            "review": "Yes LORD! The buffet is amazing!!! It's so comprehensive and the display is also fantastic. Really well seasoned food."
        }, 
        {
            "index": 245, 
            "rating": 5, 
            "review": "Great food and great people! The hosts were wrapping up when we walked in but they still accommodated us. We went with a simple order of jeera rice and chicken curry with beverages and raita. The food was original to the Indian palate. The hosts were possibly the best I've met! Must check it out if you have an Indian craving in Vegas"
        }, 
        {
            "index": 246, 
            "rating": 5, 
            "review": "Brought the family for lunch buffet on a Sunday. Their lunch buffet is $11.99. A really good price for all the food they offer in their lunch buffet. They have the usual chicken curry, chicken makhani, goat curry, tandoori chicken, chicken biryani, reshmi kabab, etc. For the veggie dishes they had Paneer Saag, Aloo ghobi etc. They had alot more I just cant remember everything. I just remember not being able to decide what to take because there were so many options and my plate was full just have way down the buffet line. They had lots of veggie options including salads, chutneys, pickles, raita and more! \n\nWe had great service from the time we walked in and throughout our entire stay. The servers were friendly and checked on us often. The food was very good. Everything was cooked right and very flavorful. Their regular and garlic naan was soft and delicious. All the food was fresh too, not sitting out for hours. The meat curries and biryani had nice big pieces of meat. Some places have more sauce than meat. I think we found our new favorite Indian restaurant in Vegas. We all felt like eating more and more even past the point of not being hungry anymore and stuffing our tummies with extra food.\n\nGood service, great food, friendly staff, clean restaurant and restrooms. Great overall experience and looking forward to coming back."
        }, 
        {
            "index": 247, 
            "rating": 5, 
            "review": "The best Indian food in vegas ever. Nice staff, plenty space,no reservation need. Chicken masala is so smooth and creamy, melting in mouth. Try garlic naan! Will be back for sure."
        }, 
        {
            "index": 248, 
            "rating": 5, 
            "review": "You get your moneys worth for a very good Indian lunch buffet."
        }, 
        {
            "index": 249, 
            "rating": 5, 
            "review": "My sister and I we were craving Indian food for dinner , I've been to mint, Mt . Everest, Indian oven.. hands down we found the best one yet, Delhi Indian Cuisine is truly the best. And the setting is great, Hari the one who help us was awesome. Don't think twice about it, eat  and enjoy.."
        }, 
        {
            "index": 250, 
            "rating": 5, 
            "review": "Passing through Las Vegas, found this place on Yelp! Amazing experience! Food was fantastic, fresh, plentiful and diverse and each dish had its own, unique flavor.\nStaff was friendly and provided excellent service. The establishment was also clean and well maintained.\n     Will not pass through without another visit!"
        }, 
        {
            "index": 251, 
            "rating": 4, 
            "review": "I'm a foodie for Indian and many places in town do not have the variety as Delhi Indian. Their selections are vegan friendly, meat, and they even have some salad/desert bar. The service was by far the best, staff is very friendly and accommodating. Looking forward to my next visit."
        }, 
        {
            "index": 252, 
            "rating": 4, 
            "review": "Overall not bad experience. The restaurant itself was clean and was surprisingly not very busy for a weekend evening. The food itself was actually pretty good, the best in Vegas I've had yet, but still falls short compared to other big cities with a larger Indian population. Service was great, no complaints there."
        }, 
        {
            "index": 253, 
            "rating": 5, 
            "review": "Excellent place to get Indian buffet. I highly recommend to have food there as it's worth. The service is really good and the variety is awesome. Lastly you will get high value for what you spend."
        }, 
        {
            "index": 254, 
            "rating": 1, 
            "review": "People who say that this is a good Indian restaurant have never eaten Indian before!! Seriously! I have eaten at Indian restaurants all over the U.S. I get it if the food is lil less spicy and all but the food here is completely tasteless. As if you are eating some kind of mashed taste less stuff. We tried the buffet and seriously we didn't like a single item. And not only that we had severe stomach ache after few minutes, maybe it was the baking soda or something I have no clue. I would say do yourself a favor and don't go to this place!"
        }, 
        {
            "index": 255, 
            "rating": 5, 
            "review": "I'm a Vegas local, and Delhi is my go-to Indian restaurant. High marks on service, price, atmosphere, selection, and taste! Vegan friendly too!"
        }, 
        {
            "index": 256, 
            "rating": 5, 
            "review": "Well people I have to say nothing less than ..OMG!! Hands down the best Indian restaurant i have ever been to.The service and the food went together like bonnie and clydeI had a sizzling plate with a variety of meats,  and bed of rice with their naan bread.. Will definently be returning soon!!"
        }, 
        {
            "index": 257, 
            "rating": 4, 
            "review": "If you don't make it to the lunch buffet, Everything  on the menu is á la cart, we assumed that our order would have came with rice or naan when ordering, but the waitress was quick corrected us. Her mood seemed to change quickly when we were not interested in the drink menu she provided. While waiting for our food we noticed a dead silence due to the fact that there was no music playing. A few moments pass by and a gentleman with a really upbeat attitude came over and delivered a little snack while we waited for our food.\nWhen the food arrived , it looked amazing! The flavors were perfect along with the spice level that I had picked. I ordered the chicken tikka masala with rice and garlic naan. One garlic naan and white rice can be split between two people but the chicken tikka masala could not. \nThe restaurant has a promotion going on that says \" free dessert when you check in on Yelp\" my fiancé told our waitress that we checked in and she said we would also have to write a review. She stayed with our table to watch my fiancé write the review and she then gave us a choice between rice pudding or a pastry.\nThe pastry tasted like a pancake with liquid sugar. It was really good.\nOVER ALL, the restaurant could use background music, and maybe a little better costumer service, but the food was perfect for the most part. For $45 I paid for 2 white rice, 2 garlic naan, and 2 chicken tikka masala. It was worth it but in the future I now know that the naan and rice and be shared."
        }, 
        {
            "index": 258, 
            "rating": 4, 
            "review": "Great Indian cuisine.  Resurant is lovely and clean.  Staff are very good and friendly. Went for the lunch  time buffet and was grea. , Service good, prices good we would diffinately  recommend."
        }, 
        {
            "index": 259, 
            "rating": 4, 
            "review": "Amazing food and fresh buffet. Indian style nan was very fresh with different types, \nWould love to go again and again."
        }, 
        {
            "index": 260, 
            "rating": 5, 
            "review": "I was like you once. Looking on yelp for the best indian food option. Knowing that these places on the strip weren't worth their prices but wondering what other joints still offer good food, good service, and nice atmosphere (because, hey, you're vacationing in Vegas and you don't need to be slumming it at some filthy ethnic place to save $10 you'll just lose on a side bet anyways). Well, this is the answer. Do not look at any other reviews because New Dehli is where you want to go.\n\nJust a few months old, it has a slew of positive reviews and -- as great as the food was (there is a mango lassi free with your check in that you MUST get) -- the pride the staff/owners put into the restaurant is apparent with every detail of the restaurant. From the decor to the menu to the EXCELLENT service, New Dehli is what comes to mind (for me, at least) when we talk about \"shopping local\". This is their restaurant and I saw in my visit that the owners truly care about this place. These folks took out a space in a shopping center (plenty of parking!) and have created a truly sincere dining experience. Maybe it's not something I can explain well -- but if you'd like to understand, swing by New Dehli on a Thursday evening and take in the experience. Never have a rooted this hard for a restaurant in a city I've only been visiting."
        }, 
        {
            "index": 261, 
            "rating": 5, 
            "review": "Before entry into the restaurant, the parking lot for the restaurant was very room. The moment you enter the front door, you can sense a classy vibe that is being emitted from with in. All the tables have cloth napkin and wine glass style cups that were set already. Inside the restaurant it was very well designed, tables were placed in a well designed arrangement, and in the back near the kitchen entrance there is a bar. The workers are very tentative to every customers needs. \n\nThe food that we ate was the Butter Chicken, the chicken was presented in a curry pot, the color of the of the curry is a bright dark orange, the aroma from the food smelt like tomato with the smell of curry, a very sweet aroma. At first taste, you can taste the butter, cream, curry and, tomato. The texture of the chicken was very smooth and soft. The flavor from the butter chicken gave a buttery/creamy/curry taste and a sweet smell in your mouth.\n\nThis was a first time having Indian Cuisine and the service was great, I highly recommend this restaurant."
        }, 
        {
            "index": 262, 
            "rating": 4, 
            "review": "Their food was great! Customer service was definitely okay. I came in two consecutive days for my lunch break at the beginning of the buffet lunch. Initially, no one was there to greet me but I was noticed quickly. I told them I wanted buffet to go and he said okay. Then proceeded to sit two groups of people, grab them all waters, and then come back and ask me if I wanted a to go box. Obviously I did so he took another 5 minutes or so to grab me so styrofoam containers. This didn't happen the second day I came in as I went straight to a waiter that recognized me and told them I wanted to-go again.\n\nThe food is amaze-balls! It's on the spicy side, so for someone who likes their curry mild beware! That's why I'm giving them 4 stars instead of 3 for the service. $10 for as much as you can stuff into 3 containers is great to me! Also, I forgot to get dessert so I ask the waiter if I could get a little cup. He gave me a little side sauce cup, but he could have said no so I'll still give credit where it's due!"
        }, 
        {
            "index": 263, 
            "rating": 4, 
            "review": "Subsequent to a long day at work and with a gift certificate in my love's hand, we were on our way to cash in at Delhi Indian Cuisine. It was a bit of a drive across town for us, but we would soon discover that it was well worth the drive on this blustery night in Vegas. When we arrived it was rather quite with only a few tables of guests, but we were welcomed with a warm greeting that soon transformed into thorough service in their clean space with simple yet pleasing ambiance.\n\nWe took most of our server's suggestions after talking about our likes and dislikes. Most dishes have a spice range from one to ten. We opted to stay right in the middle and asked for some separate spicy sauce to add...the spice on the side was very spicy, just the way I like.\n\nWe ordered Garlic Naan, Nepali Vegetable Momos, Butter Chicken with dark meat, Lamb Dhansak, Baingan Bharta, and Mango Lassi. Dinner also comes with complimentary Papadum & Chutney. Everything was delicious and exotic. \n\nMy favorites were the Momos and Butter Chicken. The Momos are Nepali dumplings--folded fresh and juicy with curry dipping sauce on the side...I enjoyed these dumplings very much, especially the excellent wrapper of the Momos...not too thick and not too thin.  I am used to Japanese and Thai Curry but this Indian Curry was made of different layers of spices and full of great flavor. To cool it all down we had a Mango Lassi...made with Yogurt and Mango...yummy.\n\nAccording to Yelp Reviews, lunch buffet at Delhi Indian Cuisine is must...so I am planning to come back to satisfy my appetite for Indian meals."
        }, 
        {
            "index": 264, 
            "rating": 4, 
            "review": "Tried it once so far. Loved the lunch buffet. Check-in offer at the time of this review is still one free soda or lassi, which is a cool bonus for what is already a great deal ($9.99 lunch buffet).\n\nImpressed by the gingery Dal Tadka, and the savory and slightly sweet Navratan (veggie) Korma. They were cool with making us Roti (whole wheat) instead of regular Naan, and I thought the size of the Tandoori Chicken pieces was encouraging. Smaller chicken pieces indicate less hormones, and a more expensive bird. It's the first dish you will see on the buffet, and is a good representation of the rest of it. Quality ingredients made with care in quantity - these are some of the largest chafing dishes you will see on a Indian buffet, ever!\n\nLooking forward to the next visit, and hopefully an upgrade to a string of *red* stars.\n\nWay to go, Delhi! Keep it up please!"
        }, 
        {
            "index": 265, 
            "rating": 3, 
            "review": "Food was average during dinner time. Soup was very spicy even after reminding the staff twice."
        }, 
        {
            "index": 266, 
            "rating": 1, 
            "review": "We went to eat at this restaurant today. It was my Husband Birthday and after reading the good reviews, we decided to go to this place. \nWhat a disappointment!, the food was cold, the taste nothing to impress, the waiter was rude, bossy and impatience with us. \nI do not recommend it."
        }, 
        {
            "index": 267, 
            "rating": 5, 
            "review": "Best Indian Buffet in Vegas.\nBeats Mint India buffet both in size, convenience and the choice of food.\nYou have to try their reshmi kebabs.\n\nMy server was Krishna and he redefines customer service.\n\nI would go there again."
        }, 
        {
            "index": 268, 
            "rating": 5, 
            "review": "Wow- my husband and I are vegetarians from phoenix who love indian food, and we loved this place! \n\nThe food was very flavorful and colorful - some unique items. It was presented elegantly, with a good selection of alcoholic beverages. \n\nAlso, the owner came to our table and was very polite, asking us if there was anything we needed. \n\nDon't usually eat much dairy, but we got the free mango lassi and it was to die for! \n\nDefinitely check this place out! It's HUGE so it would be great for big parties. Good atmosphere with lots of natural light."
        }, 
        {
            "index": 269, 
            "rating": 5, 
            "review": "My family and I came to Vegas back in August for a vacation. We were craving Indian Food so we decided to try this place out. In three days we ate here twice. The food for an Indian Buffet was very good. Their variety of dishes was nice from classic muglai to chinese, their gulab jamun are the best I have had in a buffet and believe me I have been to many. The staff was very attentive however the owner not so much. We had to wait quite a while for our naan to come out and requested the owner many times. The second time we went back was better, of course now he recognized us. Overall a good buffet if you are in the Vegas area"
        }, 
        {
            "index": 270, 
            "rating": 5, 
            "review": "We got here at 1100 and the food wasn't quite ready yet, so we ended up waiting until about 11:10 which wasn't that big a deal. The place was clean, the decor was warm and inviting, the hostess was really nice and the food was GREAT. I've never tried Indian food up until this point so I don't have much to compare to but I do love food and trying new things and I was impressed, the bread they gave us was hot and fresh (and free) and the mango lassi was so good! I loved the food on the buffet and the fruits at the salad table were so fresh. The waiter came around multiple times during lunch to check on us. It got progressively busier by 1130 but we didn't feel neglected at all. I'll come back to this place for sure."
        }, 
        {
            "index": 271, 
            "rating": 5, 
            "review": "Worth every penny to eat here. Service was excellent. Loved the chicken tikka with the peas polau!!! Delicious.... Must try the naan too, fresh & soft."
        }, 
        {
            "index": 272, 
            "rating": 5, 
            "review": "YELP SHOULD OFFER 10 stars!!!!!!! This place gets it!! absolutely amazing this is the best indian food we have ever had the pleasure eating!!! the staff is awesome and attentive !!?soooooooo worth every penny spent the sheer amount of food lol is crazy!!!!!!!"
        }, 
        {
            "index": 273, 
            "rating": 5, 
            "review": "Great food, great prices, great service. Everything about this place is great. Got the palak aloo, lamb korma, and garlic naan. Washed it all down with a tasty strawberry lassi. Highly recommend to any lovers of Indian cuisine. Goung to come back and try the buffet soon."
        }, 
        {
            "index": 274, 
            "rating": 5, 
            "review": "Food is amazing here . Best buffet I have ever had .  They had awseom malai kofta and Naan.Food is not expensive too. They have very good service too :)"
        }, 
        {
            "index": 275, 
            "rating": 5, 
            "review": "Great atmosphere. One of the best waiters we ever had!! The is the first time eating Indian food and because of the perfect wait staff it won't be the last! ( haven't got our dishes yet so can't say on the food yet! Our bread with sauces ( in the pic) is great though)\n\nBy the way the food was perfect also! Got to try the garlic naan too. Been in vegas almost a week and hands down the best place we ate so far and definitely the best service! Thank you Dehli!"
        }, 
        {
            "index": 276, 
            "rating": 5, 
            "review": "2 thumbs up!! Lots of clearly labeled veggie options.  Excellent never-ending garlic naan with the buffet.  Large selection, great service and very clean."
        }, 
        {
            "index": 277, 
            "rating": 4, 
            "review": "If you want to eat good Indian food this is the place. Chicken curry and daal is very nice, service is amazing, nice place to have North Indian food"
        }, 
        {
            "index": 278, 
            "rating": 5, 
            "review": "A must-visit restaurant when in Vegas and craving for Indian food. The food portion is huge, fresh and tasty, restaurant is hygienic and the service is prompt and impeccable. We were a group of five comprising of my husband, my MIL and my parents. My family can be a bit fussy and choosy when it comes to food but they all thoroughly enjoyed the food served here. We went for a vegetarian thali, sev puri, momos, chilly chicken, and chicken curry with assorted bread. No disappointments whatsoever! We were served by Hari and Krishna. They were both extremely courteous, prompt and accomodating when it came to our preferences. Special shout- out to Hari who went out of his way to give us the best service possible. Highly recommend this restaurant for its service, ambience and taste. Definitely worth giving it a shot!"
        }, 
        {
            "index": 279, 
            "rating": 5, 
            "review": "We walked for 2 miles from the strip for this and we were not disappointed with the quality and flavor of the food.  It was Awesome!!!"
        }, 
        {
            "index": 280, 
            "rating": 1, 
            "review": "This is my first review on yelp and you can imagine how disappointed i am that i took the pain of writing this review. \n\nProbably the worst food in terms of quality that i had in my recent memory. Please do not waste your time and money at this place."
        }, 
        {
            "index": 281, 
            "rating": 5, 
            "review": "Very good Indian lunch buffet. They even do it on weekends! Fantastic garlic Naan complimentary as well."
        }, 
        {
            "index": 282, 
            "rating": 5, 
            "review": "Truly some of the best Indian my wife and I have ever had and there were some great Indian places in Phoenix where we lived previously. \n\nAs others have stated, the Naan is pretty much the best I've tasted in Las Vegas. The lunch buffet is very good with a wide, fresh selection. I also order take out a couple times a month to bring home to the wife and kid for dinner. \n\nEvery staff member there is beyond nice and super attentive to boot! Highly recommended."
        }, 
        {
            "index": 283, 
            "rating": 5, 
            "review": "I went during the lunch buffet.  Clean establishment,  friendly staff.   The buffet offered some common dishes like tandoori, samosas, butter chicken as well as a few of out of the ordinary ones (curry goat).   Mango Lassi is always delish.  There are a few items on the buffet that I find to be the best I've ever tasted (when compared to other Indian restaurants):  pakora, chile chicken,  chicken tikka masala, and galub jamun.  To me, the flavors are perfect.  I do wish they would add mango chutney to the buffet."
        }, 
        {
            "index": 284, 
            "rating": 5, 
            "review": "I ordered delivery while on a work trip from CA. Ordered quite a spread too - chicken korma, saag paneer, rice, papadums, roti, kheer, mango lassi, and 1 other appetizer. Not only did I have enough for 3 people, but the food was delicious!!! Perfectly spiced and beautifully prepared. I would definitely recommend this restaurant, and would definitely order again next time I am in town!"
        }, 
        {
            "index": 285, 
            "rating": 5, 
            "review": "Thank you yelp once again! While roaming the streets of LV, I got the craving for some food from the homeland. After some bad experiences with lunch indian buffets in the past here, my hopes were pretty low.  I have to say I'm vegetarian so while many may love indian buffets with great meat options, I usually am stuck with like two non-appetizing vegetarian options. Not the case here!! The buffet was huge! Filled up half the restaurant! And the food was delicious!!\nNaan-amazing\nSamosas- to die for! (I ate like 3)\nKorma- almost fell out of my chair!\nEven the dal was good!"
        }, 
        {
            "index": 286, 
            "rating": 4, 
            "review": "Food was great! I was a little bummed I missed the buffet, but that melted away after eating a level 10 spice chicken tikka masala.  I'll definitely be back next time I'm in Vegas to try out the buffet!\n\nAlso Keema Naan was very good."
        }, 
        {
            "index": 287, 
            "rating": 5, 
            "review": "Delicious food ! Considerate and hospitable with the service. \nWe did a to-go. They made tava rotis on special request, even if that is not on the menu. Sweet! \nWould definitely stop by next time if I want Indian food."
        }, 
        {
            "index": 288, 
            "rating": 5, 
            "review": "Well appointed great service and amazing food. Make sure that you get garlic naan. Had the lunch buffet. The chicken makkani ( which I would compare to chicken tikki masala) melts in your mouth. The goat curry falls off the bone. Everything was Great!"
        }, 
        {
            "index": 289, 
            "rating": 5, 
            "review": "My wife and I came for the lunch buffet.  The food was excellent in taste and variety.  We had eaten at Mt. Everest a month ago and had tasted it a bit too salty.  The service was excellent.\n\nThere seemed to be a good balance of vegetarian/vegan and chicken or goat options.  Nice salad section and 3 dessert choices as well as honey dew, cantaloupe and orange wedges.  Oh, and let me not forget the naan.  We got plain and garlic and both were fresh, tasty and plentiful.  I think next time though, we'll get ALL garlic naan though...it was that good.\n\nWe most definitely will be back again.\n\nRafael"
        }, 
        {
            "index": 290, 
            "rating": 5, 
            "review": "Delicious. My mom wanted Indian food, and she couldn't stop raving about how everything tasted. The Lassi deal for checking in was pretty sweet too. It sucks that it's off the main tourist hub, which means you'll need a cab to get there, but it was definitely worth it."
        }, 
        {
            "index": 291, 
            "rating": 5, 
            "review": "This review is for the dinner. \n\nOn a recent trip to Vegas, a friend recommended I leave the strip (its like 3 blocks away so not that far I guess) and eat at Delhi. I love Indian food so I gave it a shot. If I didn't like Indian food before, this would have sold me for sure! \n\nThe food was a solid 5/5. We had the butter chicken and the malai kofta. We also started with some classic somosas. Everything was fantastically delicious. The somosas were crisp and yet fluffy on the inside. The butter chicken was a little spicy, creamy, and melt in your mouth all at once. The kofta was a dish I had never tried before but was pleasantly surprised because the curry it was in was the best curry I have had to date. We topped it off with garlic naan and life was perfect.\n\nThe servers were always attentive. This is the kind of place where you will never see a water glass empty. To be fair, we were one of two parties dining at that time (they had just opened for dinner 2 minutes prior to us arriving) so mileage may vary.\n\nFinally, the price was most definitely right. That entire meal I described came out to like $40 which left me and my gf who I was eating with bursting at the seams. I can't say enough about how great this place is."
        }, 
        {
            "index": 292, 
            "rating": 5, 
            "review": "Great Buffet.  Love the variety. Had a good selection of meat and bread.  Will go there again."
        }, 
        {
            "index": 293, 
            "rating": 5, 
            "review": "Its very tasty and there are lot of items to eat during buffet. Enjoyed idli and sambar, chicken and goat curries and dessert a lot. Naans were very soft too.\nThis surpassed my expectations :)"
        }, 
        {
            "index": 294, 
            "rating": 5, 
            "review": "Excellent lunch buffet. They had a good spread for vegetarians as well. The owner was nice and came by the table many times to check on us. Much better than other Indian fares on the strip -- similar taste but much better price and service."
        }, 
        {
            "index": 295, 
            "rating": 3, 
            "review": "It's all good but most of the plates don't have any meat. Also there are no desert at all. However they are really friendly and nice."
        }, 
        {
            "index": 296, 
            "rating": 2, 
            "review": "We came here for dinner after checking the high rating in yelp. It took 20 minutes for us to even get a waiter. Another 20 minutes for our beer to come. We ordered bhindi masala and goat biryani. Apparently no curry comes with a side .. Which is disappointing.. We ordered tandoori roti .. After 40 minutes wait .. Finally our food arrived .. Goat biriyani had 4 small pieces of goat .. Thats it! My bhindi masala tasted blant and had the top head of bhindi in it ( which is typically discarded as garbage) .. It took us forever to get our bill .. So once we gave our credit card we had to wait 20 more minutes.. So we just went to cashier instead.. So in the end .. We arrived at 7.55 and left at 9.35! And irony is it was just two of us and we didn't order much .. Its totally unprofessional and hotel management should really look into this .. We were so tired waiting that instead of playing in casino we just hit the sack!"
        }, 
        {
            "index": 297, 
            "rating": 5, 
            "review": "I loved their lunch buffet! Lots of vegetarian options as well as options for meat eaters"
        }, 
        {
            "index": 298, 
            "rating": 1, 
            "review": "Bad customer service. Made us wait for 40 mins before serving anything! They assured us that they will give us food now and it never came. After we repeatedly told them that its long time we are waiting, give us or we will walk away. Then, they started serving.\n\nFood was ok and not great taste. It was bit salty and looks like made in hurry. Also few items was missing from vegetarian thali.\n\n4 star reviews are I believe because of incentive of free Lassi. It is not worth even 2 star with this kind of customer dining service !"
        }, 
        {
            "index": 299, 
            "rating": 5, 
            "review": "I'm so glad i decided to have Indian cuisine for the first time.  It was delicious!  I tried the garlic namn bread n the regular.  Regular one was my favorite.  The price was very reasonable. The buffet is the way to go of you're new to it.  I tried a bite size of everything then went back for seconds of my favorites. Loved the goat curry... but many others were great.  Namn bread is brought freshly made."
        }, 
        {
            "index": 300, 
            "rating": 5, 
            "review": "I was never a fan of Indian food because the spice was just too over powering and you could not enjoy the flavors of the food. But at Delhi they will tone down the spiciness of the food so you can actually taste the food. Now we (my wife and I) love to eat Indian as often as we can, we even take our out of town guest there!\nHaving only eaten there for dinner, I am unable to comment on their lunch buffet."
        }, 
        {
            "index": 301, 
            "rating": 4, 
            "review": "This place was the only vegan friendly restaurant open, so my girlfriend and I stopped by for a bite. Food was delicious, but we ended up getting too much. We had snacked on the way into Vegas so our original order of palak aloo and garlic roti would've been enough. However, our waiter convinced us portions were smaller so we added something else to our order. The food was incredibly spicy so we didn't even eat much of the added dish."
        }, 
        {
            "index": 302, 
            "rating": 5, 
            "review": "Excellent food! Warm people and patient service.\nThe entire family loved their custom flavored and spiced menu.\nAny days choice!! Go and meet Krishna. He loves people coming to this place and serving them with lot of affection."
        }, 
        {
            "index": 303, 
            "rating": 5, 
            "review": "I am good cook of Indian and Pakistani food, so my standard for Indian and Pakistani food is pretty high. In my 35 years I've been to countless Indian and Pakistani restaurant in US and I always get disappointed in at least 95% of restaurant I have been. I am from Bay Aria there is only one good Pakistani restaurant in SF, Fremont name Shalimar, I used to travel 2 hrs. drive from Sacramento to Fremont just to eat at this restaurant to me Shalimar on scale 10. When I go to any Indian and Pakistani restaurant I compare it to Shalimar. I just recently move to Las Vegas and start trying new restaurant and came across Delhi Cuisine restaurant and scale 1 to 10 its up there at 8 and believe me every other restaurant  I've been never cross more than 4 on scale. The best Indian Buffet restaurant, place is clean service is great and food is absolutely delicious fresh and tasty. Usually they have about 25 different dishes to choose from.  fresh plain or garlic nan the buffet is only for $10. You cannot beat that. I go there at least every other day for lunch. If you are looking for Indian and Pakistani food in Las Vegas this is the only place in town try it and you will love it."
        }, 
        {
            "index": 304, 
            "rating": 1, 
            "review": "Very poor service \nToo slow. Took forever to take the order and then we had to wait 1 hour to get the food. \n\nThat too at non peak hours\nThe restaurant was 20% capacity.  \n\nVery slow. Went by the yelp reviews but poor service"
        }, 
        {
            "index": 305, 
            "rating": 4, 
            "review": "I came here for dinner because I am traveling solo for business and they offer a thali (a kind of combo plate), which is great because I enjoy variety. It was wonderful. The tandoori chicken appetizer (2 pieces, almost a meal in itself) was amazing and the assortment of dishes was just right. If you like Indian you must try this place."
        }, 
        {
            "index": 306, 
            "rating": 5, 
            "review": "To start with I have been lazy on this review I ate here couple of months ago when I was in Vegas last and I owe them this review cause I searched them on yelp and boy was I glad to have landed there with my wife. We were greeted very warmly and shown around the dishes they served that day in buffet wich was priced very reasonably at 10.99 . Food was delicious we loved chicken Tikka masala and couple of other chicken and veg dishes ghot curry was great and we simply fell in love with the punjabi curry witch was finger licking good ( we Indians eat with hands  not forks) desserts were also good as was the service . I would definrtly recomend it to every one and will definetly eat here when I visit Vegas again"
        }, 
        {
            "index": 307, 
            "rating": 4, 
            "review": "I was travelling through Las Vegas and found this restaurant through Yelp. Thanks to it.\nIt seems a new restaurant and 5 to 10 mins away from strip. I usually go to Gandhi but found this better for various reasons.\nThis have plenty of parking space for vehicles and plenty of area for dining. \nWe are larger group with three kids and  we need a plenty of space to move around. This restaurant was perfect for us. Coming to the food it was better than other Vegas Indian food i tasted. Since it became crowded the items are fresh that makes it delicious . I wont find anything in the heating tray for longer time. It always better to go early for buffets, we went late by 2pm so some of the vegeterian trays are already over so we got a little wait time for the foods to be prepared and filled up.\n\nThe Non veg starters are more , so you will get good options. This is typical north indian resturant so you cant expect a South indian briyani or the idly at its best. But its typical briyani and an better idly served at north indian resturant.\n\nThe butter nan and garlic nan was really delicious. \n\nAnd at that time there was option to get a Mango lassi for yelp check in, Its really very good. I found this as best among Indian resturants in Vegas."
        }, 
        {
            "index": 308, 
            "rating": 5, 
            "review": "Great food. Some of the best Indian food I've had. Ate their Tahli, and each portion was perfect in every way. The waitstaff was also professional, helpful and pleasant. I wish they were closer...."
        }, 
        {
            "index": 309, 
            "rating": 5, 
            "review": "Came in for the lunch buffet. Great food and excellent service! Garlic naan came with the lunch buffet. Mango lassi was delicious. As others have stated, lots of variety. Food was hot and tasted fresh. We will be back for sure!"
        }, 
        {
            "index": 310, 
            "rating": 4, 
            "review": "It is the best Indian restaurant you can find near UNLV. My favorite go to always tandoori chicken, do not forget to ask for hot and fresh baked garlic bread. Try goat as well it was so tender and tasty. \nIf you are student, show your student card and get 10% off!!!!"
        }, 
        {
            "index": 311, 
            "rating": 5, 
            "review": "We were on a 4 day trip to Vegas and took a taxi here for the lunch buffet. IT WAS AMAZING!!! Highly recommend you do the same. The strip is so expensive that you will pay less all around by coming off of it to this place for lunch even with the taxi. My husband is the pickiest eater out there and he says it was better than his favorite Indian place at home! The mango lassi was also the best I have had. Good job guys!"
        }, 
        {
            "index": 312, 
            "rating": 5, 
            "review": "Great food, great service. Make sure to get garlic Naan. I'll definitely go back for some more. I sample a little bit of everything, but my favorite was goat curry by far. Plus you can't beat the price around $10.00 dollars for their lunch buffet .!"
        }, 
        {
            "index": 313, 
            "rating": 4, 
            "review": "This is another good Indian restaurant in Vegas. This restaurant's goal is high volume, as is apparent with its large layout and seating capacity (100+ people could dine here). The buffet is great, with the chili and tandoori chicken dishes being my personal favorite."
        }, 
        {
            "index": 314, 
            "rating": 5, 
            "review": "The BEST place to get your masala fix! The place to be whether you want an extensive vegan Indian spread or if you are a carnivore at heart. The lunch buffet spread is impressive. For only $10.99 you have transported your palate to India aboard the royal elephants with the cool Maharajas of Rajasthan.  The staff are attentive ... make that very attentive and friendly. Pleasant ambiance, glass goblets, paper lined white tablecloths and linen napkins.  The food speaks for its self. The flavors are so pure, complex and divine. You can taste the unique blends of masala spices like cardamom, turmeric, fennel are noticeable. From the Dals, Curries, Pulaou, Tandooris to the Koftas, Paneer, Tikkas and Kormas - the food is awesome. Plus the condiment section is amazing: lime chutney, tamarind sauce, chili peppers, corriander chutney, Raita etc are just nice touches to make your experience unforgettable. Fresh Naan brought to your table bubbly, crusty and pipping hot! I love this place. I drove 17miles to get here and it was worth it. Give this place a try."
        }, 
        {
            "index": 315, 
            "rating": 4, 
            "review": "My first experience with Indian Cuisine, very good! First of all, the place looks great, very clean and great service, all the staff is friendly and attentive. I tried the buffet, keeping in mind that is the first time I try Indian Cuisine and I don't have any other experience to compare with, I liked it a lot!!! The garlic bread is really good, I tried all the vegetarian plates; I was a little worried about the food being very spicy, but it wasn't. Overall I enjoyed the food and will definitely recommend this place to my friends."
        }, 
        {
            "index": 316, 
            "rating": 4, 
            "review": "Came back last night and I'm trying to decide about removing one star or two.\n\nCame at 5 and was pleased to see more people in the restaurant than the last time we where here. Feels more comforting personally.  \n\nMy partner ordered the non vegetarian Dahl thali **(that take out menu, in restaurant menu and online menu all have different items listed for this- be warned) **  which was a great way to try a lot of different items. They serve you small portions dishes, plus rice, naan and a yogurt dip. Such a great deal to try new food. The menu said dessert was part of it but it never came. Out of all the dishes the only one that he didn't like was the lentils. Was too salty. Not sure it that's how it's supposed to be or if it just got over seasoned. \n\n\nI ordered whipped spinach with cheese, and goat curry at a spicy level of 7 andJeera Rice( if you never had this before, I HIGHLY recommend this)  and of course garlic naan. What came to the table was different. I got a different goat dish instead of the curry ( tomato base that was thin and soupy) and with very little spice. (My boyfriend order his spice lever at 5 and was stronger than my dishes)  new cook, different cook, waiter miss heard me??  I didn't complain because I hate that at restaurants and didn't want to waste the food. It was still good ( not amazing like last time but again, I got the wrong dish) different chef, off night? \n \nNo dessert for the boyfriend \nI was served the wrong dish \n\nI still really enjoy the food I was served and my evening out but these little things kind of bug me. the servers are always nice and great, sometimes a bit slow when trying to wrap things up at the end. I'm just gonna say it was a off night.   Of course I'll be back because everything is still delicious."
        }, 
        {
            "index": 317, 
            "rating": 5, 
            "review": "Our first time eating here. Yelp's reviews brought us here :)  \n\nWe had the manchurian veggie balls for an appetizer & chicken karadi with plain nans for dinner. Everything was delicous!\n\nThe staff were all very friendly & attentive. \n\nBaby Alayna approves too :)\n\nBtw the mango lassi was yummy too"
        }, 
        {
            "index": 318, 
            "rating": 5, 
            "review": "The food here is amazing!  Loved the fresh hot naans and malai kofta.  We had our Thanksgiving family reunion here (I know - not traditional) and they were very polite and accommodating.  We were 27 people from 3 years old to 72 years old and we were a little rambunctious - mostly because all of us were trying to talk at once.  But the Delhi staff was polite and listened to each one of our requests and followed up promptly.  Highly recommend this place even though it is a bit off the Strip.  A few of us family members walked back to Paris Hotel after dinner and it was absolutely do-able.  Great hotel!  LOVED it!"
        }, 
        {
            "index": 319, 
            "rating": 3, 
            "review": "Buffet starts at 11 and we reached at 11:30. We were surprised food was cold already. Chicken biryani and chicken curry were really good, everything else was okayish. Service was good and very polite."
        }, 
        {
            "index": 320, 
            "rating": 5, 
            "review": "Hands down, the best Indian food in Las Vegas.  The buffet is incredible and economical.  Plus a free drink when you check in on Yelp!"
        }, 
        {
            "index": 321, 
            "rating": 5, 
            "review": "Best Indian food ever. We tired almost all Indian restaurants in and around Vegas and this is the outstanding one. Sumptuous food, warm welcoming, and quick service are their attractions... I recommend everyone to try food here when you visit Vegas"
        }, 
        {
            "index": 322, 
            "rating": 4, 
            "review": "Came here recently and loved the buffet.  The nan was hot and fresh.  Tandori Chicken was as good as I have ever had.  I will certainly return to Delhi on my next trip to Las Vegas."
        }, 
        {
            "index": 323, 
            "rating": 5, 
            "review": "And the NEW Undisputed Indian Champ of LV is......Delhi\n\nJust a week ago I went to another 4.5 star Indian Buffet off Sahara and there's no comparison - Delhi's so much better and I need to revisit Mint to see if it unseats it but I\"m pretty sure it does.\n\nTheir lunch buffet selection is ridiculous with Biriyani, Goat Cury, Chicken Curry, Tandori, and many other specialties.  They switch it up as I've been a few times and everything is done better than Mt Everest Indian.  The goat curry here had better flavor and was more tender.   When they bring you the naan, it's piping hot made to order chock full of garlic.  I went to play a poker tournament after and this definitely helped me force a couple folds.\n\nThey have a great check in deal where you get a free Lassi or soda - gotta go with the Mango Lassi. \n\nI've yet to come for dinner but if their lunch buffet is this good i'm sure it will also deliver!"
        }, 
        {
            "index": 324, 
            "rating": 2, 
            "review": "Okay so I just don't get the hype. I was really excited - I mean Indian, buffet, good reviews, sounds like a recipe for success. It was okay... and cheaper than other places at $9.99. But I think I would pay the extra few dollars and go a block over to Mint in a heart beat. Yes the buffet takes up length wise over half the restaurant, but what I didn't care for about this place was that it lacked variety - you have the standard Tandoori chicken, Tikka Masala etc.  But maybe it was a busy day before I got there giving them the benefit of the doubt, but I had to fish around in the sauce to find pieces of chicken and not only in the tikki masala but any dish which contained sauce and meat. Don't get me wrong I love sauce, but I like to find that there is ample meat to accompany my sauce. \n\nAlso, there was something about the ambience that felt cold - maybe it was the poor acoustics which made it feel very big and open but not in a good way or the just the set up but somehow the dining room was not overly inviting. Although, that in itself is not something that would normally concern me - hey if the food is superb I'll eat it sitting on a street corner (as used to be the case with Viva Las Arapas before they moved). Nonetheless, I thought it is something that should be noted. \n\nService was average, nothing outstanding. We did request garlic naan and they brought it. My friend asked for lemon wedges for water, they forgot, had to ask again and then they brought a plate of lime wedges from the salad bar.. maybe they don't have lemons? \n\nOn the upside I got a free Mango Lassi which was tasty with Yelp check in - so thank you Delhi Indian Cuisine for that treat. So overall I wish them good luck and I hope that they make it as I do with all restaurants that are not chains but unfortunately I am going to stay loyal to Mint for lunch buffet, and Mt. Everest as a second choice."
        }, 
        {
            "index": 325, 
            "rating": 5, 
            "review": "All VEGAN and VEGETARIAN  items are clearly marked. They have a meat section and a veggie section. The staff really care that you have a good experience. The manager named \"Hari\" is just AMAZING.  For lunch buffet it is fast and dependable. The quality is consistent from day to day...which is very good. For weekend Sunday is my favorite day to go. I eat a huge pile of noodles that are \"asian-indian fusion\" along with Samosas, Lentil Soup and what-ever else I can before I \"pop\". Yummy \nUPDATE : Nov 6th just went there again today. It was great and fresh"
        }, 
        {
            "index": 326, 
            "rating": 5, 
            "review": "CANT BE BEAT!!! This is my all time fav place to eat in Vegas. Where else can you get a wide variety or veggie and meat selections in a takeout or dine in form?!?( serious question...let me know) I love Indian food and Dahl Indian Cuisine NEVER disappoints."
        }, 
        {
            "index": 327, 
            "rating": 5, 
            "review": "Amazing Indian food! We went for dinner and their chicken tikka masala was so delicious along with their yummy garlic naan. Their goat vindaloo was just as amazing. Everything was great and the staff is very friendly! We also had the mango lassi and it was so tasty I want more! Can't wait to go back!"
        }, 
        {
            "index": 328, 
            "rating": 5, 
            "review": "Four words: bang for your buck. For $9.00 you get amazing food! And when you're in Vegas surrounded by steak buffets offering powdered mashed potatoes, this is a great deal. What this place lacked in ambience, it made up for in taste. It's relatively new with a great culinary future ahead.\n\nThe owner was very sweet. He personally brought over the free mango lassi I got from checking in (delicious, might I add).\n\nIf you're feeling your pockets empty because the strip is just too darn expensive, then hop on over to the outskirts of main vegas attractions and scoop up your desired heaps of savory, succulent, mouth-watering (affordable) Indian food. Seriously though, go go go."
        }, 
        {
            "index": 329, 
            "rating": 5, 
            "review": "I've been looking for a really excellent Indian restaurant in Vegas for a while now, and this totally exceeded my expectations. This was my first time here, and they gave me complimentary rice with my (some type of curry? Alas, I forgot) dish. My significant other ordered a lamb-curry dealio and couldn't rave enough about it. This was his first time trying Indian food ever, so this was a pretty epic moment. There is a plethora of vegetarian options, of course, and the naan tasted uber hot and fresh and is friggin' delightful. 10/10 would Delhi again"
        }, 
        {
            "index": 330, 
            "rating": 4, 
            "review": "I came here today 45 minutes before their lunch buffet closed and it was a good experience. \n\nWe were sat promptly as our party was already there. They have about 12 hot dishes that range from curries to rices and then a salad bar.\n\nThe stand outs were the chicken curry, goat curry, and the chicken tikka masala. They also gave our table two orders of garlic naan. The naan was piping hot and full of garlic.\n\nI would say the amount of meat in the curries was minimal but given it was a buffet I understood. Plus the flavors of all of the curry dishes were each so delicious and unique that the sauce with naan was enough for me.\n\nI'm used to having curry in a non AYCE setting and I don't know if I'll ever do that again. The value of the buffet was really good for the variety.\n\nI also liked their fried onion fritters, the veggie samosas, and their rice and chicken dish. I don't know any of the names but everything was worth a try.\n\nThe staff was solid for a buffet as in those 45 minutes I had my drink refilled about 5 times. They also cleaned up our plates before I got back from each trip the buffet line\n\nThey also had this spice mix when you leave up front that was full of spices they used like dinner mints which was cool to try.\n\nI like the value, the restaurant staff, the decor, and definitely the flavors. For $35 after tax for three people it's an excellent value and I'll return very soon.\n\nChicken tikka masala that is comparable is about $15 at most establishments on its on so this was awesome."
        }, 
        {
            "index": 331, 
            "rating": 5, 
            "review": "Great buffet! Good service.. Chicken curry, naan, veg curry, chicken biryani, tandoori, all was delicious. The ending with Gajar halva was heaven. We got a good chai to end our lunch. The price is good for the amount, service, variety in flavors & taste."
        }, 
        {
            "index": 332, 
            "rating": 5, 
            "review": "I rarely go to a place that lands 5 stars in all aspects.  Great food, great price $10.99, good service! Ooof! I'm stuffed. \nHighly recommend this place."
        }, 
        {
            "index": 333, 
            "rating": 5, 
            "review": "Excellent food and service! Ordered yellow dhal, chole and bhindi masala. It was outstanding. Would strongly recommend this place"
        }, 
        {
            "index": 334, 
            "rating": 5, 
            "review": "Simply the best service! So friendly and sincere & the food was too notch. I was so excited I forgot to take a picture of the presentation but it least I took one of the aftermath..... So good I couldn't finish it all. I will be back for sure and will mark this as one of my favorite spots."
        }, 
        {
            "index": 335, 
            "rating": 5, 
            "review": "Delhi Indian Cuisine, you have become my favorite!  I went a few weeks ago for the buffet, and as buffet goes I think this one is one of the stand outs.  I loved each curry I tried, where in alot of places flavor does not separate  each dish. But for each choice at Delhi Indian Cuisine, I could taste a different recipe.  I also had the mango lassie.  It helped anytime i had a super spicy curry.  The only downside was that it was such a small glass. Honestly I would drink a gallon of lassie if they served it to me.  The selection was great, I really though the naan and the tandori chicken was the best I have had in a while.  And to finish off a perfect buffet lunch, the mango custard was amazing.  I will be back.  And I can't wait to take my friends."
        }, 
        {
            "index": 336, 
            "rating": 5, 
            "review": "I love Indian food and I've been to several Indian restaurants on and off the strip so I was very delighted when my friend told me of Delhi's Indian buffet. I'm usually a little disappointed with the small portions at the Indian restaurants so I thought the buffet would be a good change. \n\nI was very very pleased with my experience. The selection was great and the food tasted very good. I haven't had vegetable pakoras that tasted as good as the ones they serve here. I tried goat curry for the first time and was impressed. The chicken tandoori and chicken biryani were just as delicious. I also tried these dough balls in syrup called Gulab Jamun and although the texture was a little weird at first the flavor was exceptional. The server suggested I try it with the rice pudding and it tasted even better!\n\n I have nothing but positive things to say about this place. The service was prompt and friendly and you cannot beat the price of $9.99! My bf said we're not going anywhere else for Indian food. We have definitely found a gem!"
        }, 
        {
            "index": 337, 
            "rating": 3, 
            "review": "Food taste was average, tasty but not special. Staff were friendly. We ordered our food medium spicy but it came out very spicy."
        }, 
        {
            "index": 338, 
            "rating": 3, 
            "review": "Very less vegetarian options in the buffet. Was not a great fan of the place and food."
        }, 
        {
            "index": 339, 
            "rating": 5, 
            "review": "Great Food!!! You won't be disappointed. My favorites are the chicken Biryani and Chicken Curry. Love the flavor and spice. Great atmosphere and ambience. I will definitely come back for more."
        }, 
        {
            "index": 340, 
            "rating": 5, 
            "review": "Food was delicious! Owner was super nice too! He came and talked to us and even offered me and my friend free mango dessert drinks~! \n\nThey have a great selection in the buffet and you can't beat the price! \n\nI'll definitely return ~\nAnd I highly recommend this place."
        }, 
        {
            "index": 341, 
            "rating": 4, 
            "review": "(Review of buffet only)\n\nInteresting choice of location to set up a new Indian buffet on the east side of town considering you have Mint, India Masala, Origin India, Gandhi, and Taste of India all within a 2 mile radius, although I think it's the others that should be intimidated, since the new kid in town has got some bhangra swagger.  Pretty much all of its rivals are in little strip malls of varying degrees of  decay, so this should not deter you in terms of its exterior.  Once you step inside, the modern decor with track lighting, single open room layout, and seemingly endless linear display of offerings along the buffet line should set your mind at ease.  \n\nUpon being seated, you are immediately prompted if you would like naan bread with your buffet.  Not only should you say yes, but you should specifically request the garlic naan since the aroma alone with the freshly minced garlic and finishing brush of ghee emanating from the freshly cut bread removed from the tandoori oven is intoxicating enough to get your appetite revved up on the feast that lies ahead (refills are complimentary if you need more)\n\nAs one approaches the buffet line, the first wave of offerings include various meats including the standards such tandoori, tikki masala, and curry chicken along with some wild cards such as goat curry and reshmi kababs, which is a ground chicken meatball that seems a bit healthier than the sauced meats.   The latter half of the line offers a multitude of vegetarian offerings including saag paneer (spinach), chana masala (spicy stewed chickpeas), eggplant, mixed curry veggies, and lentils.  The third category of offerings is the carbs, which in this case included plain basmati, a spicy chicken biryani, mini-samosas (which gives you more of the flaky crust to enjoy, much like why mini-pecan pies are superior to regular pecan pie), idli (a steamed rice cake), and something I've never seen before, a spongy savory cake called dhokla, which I've read to be a beloved street snack in the southern part of India.  It has a cornbread-like consistency, a rich yellow hue from turmeric and mustard seeds, and is served with some chili peppers, cilantro, and toasted coriander seeds.  Add a dollop of tamarind, and it is a pretty addictive combo of flavors which I would have had more of had I not discovered it at the end of my meal.  \n\nI almost never have room for desserts after an Indian buffet but it is a rotating mix of gulab jamun(sweet milk balls), rice pudding, gajar halwa (carrots+milk), and a few offerings of fruit which I am always a bit wary of when it comes to buffets in general.  \n\nService was very good in which plates were cleared and water was refilled efficiently, and the staff checked in a few times to see how I was enjoying the meal.  Compared to the local competition, price point is excellent (9.99 vs 10.99 at India Masala, and 12 and up at Mint and Gandhi), quality of food is definitely in my top 3 in Vegas (Mount Everest and Taj Palace), and highlights include the garlic naan, balance in offerings between vegetarian and meat dishes,  a few unique offerings (mini samosas and dhokla), and ambiance.  India Masala is still my go-to choice for take out buffet due to quantity (refer to my review for my patented packing technique) as well as complimentary Mango Lassi with yelp check-in, but if I'm dining in, Delhi Indian is my new go-to place for quality when I plan to go on an Indian carb feeding frenzy for lunch."
        }, 
        {
            "index": 342, 
            "rating": 4, 
            "review": "This place truly surprised me. I took advice from a fellow Eliter on this place. I'm totally glad I did. I'm totally not one for Buffets but this place had really fresh food. None of the food tasted like it's been sitting there a while. A lot of buffets run into that problem. \n\nLunch buffet was all you can eat for $9.99. Great deal!\n\nRestaurant was big and spacious so you aren't on top of one another. Service is meh. The servers really don't know the food too well. I was quite nervous eating there because I have a tomato allergy. Server didn't know the sauces too well so I had to be selective on what to eat. Sucks but at least I was smart in my food picking. I asked the server what was in the sauce like spices and such and all he kept saying was \"it's cream based\" over and over. Like I get that but what else is in it???? At least go ask a manager or a cook?!\n\nMalai Kofti (fried vegetable balls in sauce) was my favorite part of the meal. A sauce unlike I have had in a while with yummy fried veggies in it. All around amazing.\n\nThe vegetable Samosa I expected more. The flaky part was ok but the vegetable middle wasn't what I was expecting: I just dipped it in the Malai Kofti sauce and it tasted better lol\n\nBasmati rice was simple like most places. Hard to mess up. Mixed it with some goat stew and it came out great. \n\nGIVE THIS PLACE A TRY YOU WILL BE PLEASANTLY SURPRISED."
        }, 
        {
            "index": 343, 
            "rating": 4, 
            "review": "Was a little disappointed that the buffet was only available at lunch, that said the food we ordered was reasonably priced and the quality was comparable to our favorite places back home. Located in a small shopping plaza, it was pretty empty when our party of 7 arrived so no problems with seating. Later more families came, predominantly Indian which is always a sign of authenticity. The goat curry was fantastic. They had a wide variety of lassis including strawberry, cherry and lychee which the kids enjoyed. We ordered all of the dishes mild for the picky eaters in our group but I was happy to find that some dishes were more on the spicy side. Usually have to order extra rice and naan but the portions here were good sized and ended up with leftovers. The manager was very friendly and helpful and came to our table many times to check up on us. I had ordered a gulab jamun to go and was pleasantly surprised later when he doubled my order for free. Everyone was very happy with the food and the service. Will visit again next time we are in Vegas."
        }, 
        {
            "index": 344, 
            "rating": 5, 
            "review": "Fantastic Indian cuisine. We had the butter chicken, dal and lamb koma and the flavors and texture was right on point."
        }, 
        {
            "index": 345, 
            "rating": 4, 
            "review": "As an Indian lunch buffet veteran in Seattle/ NYC/ Chicago, I was very impressed with the variety and quality of dishes offered for the price. The goat curry was a standout, as well as, the gajar halwah dessert, drizzled with some rice pudding, as a sauce.\n\nI would definitely return with friends on my next visit to Las Vegas."
        }, 
        {
            "index": 346, 
            "rating": 5, 
            "review": "The very best food we have had in Las Vegas. Very tasty, adequate spiced and nice served.  All staff was friendly, smiling and with a sense of humor. This was not our last visit!"
        }, 
        {
            "index": 347, 
            "rating": 5, 
            "review": "Very clean.  Friendly staff.  Food tastes great.  All this for 9.99.  We'll be back over and over again.  Dont forget to try the garlic naan."
        }, 
        {
            "index": 348, 
            "rating": 4, 
            "review": "One of the good Indian restaurants in Vegas. Good food and descently priced. Lunch buffet was really good."
        }, 
        {
            "index": 349, 
            "rating": 4, 
            "review": "Great service! Good food! The reason I am giving four stars is because it did take a long time for the food to come out. Granted we were warned ahead of time, so at least we prepared ourselves for the long wait."
        }, 
        {
            "index": 350, 
            "rating": 4, 
            "review": "I rarely eat Indian food, so I took an opportunity to come here for dinner while my kitchen was out of order and I had some shopping to do nearby. Some friends recommended this place, but didn't give any specifics on what to order. I tried the Delhi vegetarian thali- a sampler of curry dishes served with naan, rice, and samosas. Everything was good- and the presentation was quite nice. My favorites were the malai kofta and dal makhani. I also ordered the mango chutney, but didn't love it. The Thali says for one person only, but I left very full without touching the rice. The staff checked up on me often- maybe because business was slow. I would come back, maybe to try some new things or to check out the lunch buffet."
        }, 
        {
            "index": 351, 
            "rating": 5, 
            "review": "Unassuming and amazingly delicious. If you like Indian and Nepalese food you gotta try it."
        }, 
        {
            "index": 352, 
            "rating": 5, 
            "review": "After a long time found a typical North Indian restaurant which still has some true Indian flavors in their chicken, goat curries and creamy tikka masala\n\nPakora, tandoori , were good too. \n\nBiryani was decent\n\nChilli chicken could have been better. \n\nCould probably improve their sambar."
        }, 
        {
            "index": 353, 
            "rating": 5, 
            "review": "Great Indian food and it's made fresh to order. Best lamb biryani I had so far (comparing to bay area and Chicago)"
        }, 
        {
            "index": 354, 
            "rating": 3, 
            "review": "We visited the restaurant for an afternoon buffet and found that the appetizers options were adequate but the entree and dessert options were less and also did not look to be fresh considering that we were there around 1 PM and not at 3 PM which is what the restaurant serves buffet until."
        }, 
        {
            "index": 355, 
            "rating": 1, 
            "review": "Pathetic service..!!! Waste of time.. please don't visit...we r waiting for food last more than 1 n half hour .."
        }, 
        {
            "index": 356, 
            "rating": 5, 
            "review": "I love Indian food, definitely a favorite cuisine for me. I keep coming back to Delhi and its becoming my new favorite indian restaurant in town. \n\nIt seems this place must do the majority of business during their lunch buffet because each time we have dined in the evening it's been dead. I don't mind a quiet restaurant...actually I prefer to feel like I have a restaurant all to my self but it makes me worried that somehow this restaurant is hurting. I hope not! I would hate to see another great Indian restaurant close. \n\nThe service here is great, the owner is always floating around and managing every aspect. You can tell he is passionate about his restaurant and it really shines through the service and food. \n\nThe Food\n\nChicken Tikka Masala\nAmazing. Perfect balance of cream, tomato and masala spices. Not too oily and great depth of flavor. Chicken is succulent and juicy, only gripe is there is not enough chicken but I deal with it because their sauce is that good.\n\nNaan\nAiry pockets with doughy edges and just the perfect amount of seasonings. Heavenly! Always so fresh and so darn addicting and their garlic version is a standout. \n\nTandoori \nHave tried both chicken and shrimp. By far my favorite was the shrimp. I've always preferred a shrimp tandoori anyway because there is nothing more visually appetizing than large juicy shrimp and fresh onions and lemons sitting atop a sizzling hot plate. Those sexy soft hissing and popping noises get me every time. \n\n\nMatter Paneer \nWell I have had better IMO but it wasn't bad. I think it's too forward with tomato and I'm searching for more creamy notes. Which is silly when you think about it, there is paneer in there and that should somehow be enough, maybe a touch more cream would make it better? I don't know. \n\nMalai kofta \nSauce 10! Dumplings 0! Way too dense and I like when they are shaped into round balls instead of those football shaped things. I'm totally just whining here, shape shouldn't matter but the shape coupled with how dense they were just didn't do it for me. But that sauce though! Their cashew based sauces are amazing. \n\nGulab Jamun\nAgain another too dense item but I don't hold that against them. I've experienced the same dense issue at other restaurants regarding this dessert. Maybe was cooked or sitting too long? Not sure.\n\nMango lassi\nDare I say this was made with canned mango? I hope I'm wrong here but I'm pretty sure it wasn't fresh mango. Still tasty nonetheless especially as the alcoholic version. \n\nAll in all this place is excellent. Great dishes full of flavor and wonderful attentive service. I can't really ask for more!"
        }, 
        {
            "index": 357, 
            "rating": 5, 
            "review": "This is my new favorite Indian Buffet!!  Lots of choices! All fresh, hot and great spice.  People were nice and attentive.  If I had one thing negative to say it would be that it is hot and humid in the dining room. However, it's so good I don't mind sweating. \n\nThis is my second time now and it is better than I remember.   The food is wonderful and it is not hot or humid.  Just perfect."
        }, 
        {
            "index": 358, 
            "rating": 5, 
            "review": "What can I say? This place is not what I was expecting. Taking my first step into the door I was in awh. Upon entrance my friend and I were greeted and shown to our table where our third party was waiting for us. The slightest details of this place were excellent; The booths were nice and comfortable, The ceiling lights: modern, The music sets the mood: calm and relaxing. \nThe customer service was great; because the three of us we're foreign to Indian Cuisine we had many question on what we were eating. The staff was very knowledgeable and able to answer our every question. \n\nThe food? It was delicious!! No complaints on my end. The Butter Chicken was very well rounded. Nice and creamy curry, soft and moist chicken; put that on top of rice and you get a wombo combo! The complimentary Papadum was something else: the bread was nice and crispy, add one of the two sauces that came on the side and you get a sweet taste (black sauce) or a earthy savory taste (green sauce). We also ordered the Sev Puri which was a whole mouth full of flavor. The house made cracker was nice and crispy topped off with what seemed to be a jumbled yet organized mess of toppings and you get a nice high note of sour and spicy and a slight saltiness. The visual representation and organization of these dish depicts what hard work the chef puts into the food before it is delivered to the customers table.\n\nOverall I would highly recommend this place to anyone looking forward to experience new flavors. Great staff. Great food. You can't ask for anything more except for food."
        }, 
        {
            "index": 359, 
            "rating": 5, 
            "review": "Best Indian food ever .   EVER.      Goat curry is good.    Chicken curry no bones is good.  And everything is good.   But mango lassi looked reddish.      Too much food coloring?   But it was good too"
        }, 
        {
            "index": 360, 
            "rating": 5, 
            "review": "Delicious fresh food! Best Indian food in Vegas. Place is very clean. Customer service is prompt and friendly. I was not expecting the food to be this good. I highly recommend this place!!"
        }, 
        {
            "index": 361, 
            "rating": 5, 
            "review": "Super great food and it was a buffet.  Really yummy and a variety of foods to try.  Great location"
        }, 
        {
            "index": 362, 
            "rating": 5, 
            "review": "I've constantly been disappointed with Indian food in the US, but this place is awesome! I ate way too much, but it was just so good that I couldn't stop. I would definitely go back if we weren't leaving Vegas tomorrow morning."
        }, 
        {
            "index": 363, 
            "rating": 4, 
            "review": "So far from my experience best restaurant in Vegas,  although I am a vegetarian so only can comment on Veg food. Their manchurian and momo's are best. Also restaurant is Spacious so no waiting..!!! I wish they add dosas to menu and veg biryani in buffet."
        }, 
        {
            "index": 364, 
            "rating": 4, 
            "review": "Food is really good and very nice waitress...Restaurant is very spacious  and try Lassi...Sambar is very tasty."
        }, 
        {
            "index": 365, 
            "rating": 5, 
            "review": "Tried their buffet lunch for the first time.  After tax, it's works out for $25 for two, which is amazing deal, considering all the food you get.   The buffet has three sections, two for hot entrees and one for fruit/veggies/dessert.  Everything tasted fresh and was delicious.  Servers were attentive and a manager came over to ask how everything was and if we needed anything.  Definitely recommend."
        }, 
        {
            "index": 366, 
            "rating": 5, 
            "review": "Great food and great service.\nThe staff was very helpful and the garlic naan was delicious! \nWe will definitely be coming back!"
        }, 
        {
            "index": 367, 
            "rating": 4, 
            "review": "My wife and I decided to step out of our respective offices the other day for a quick lunch and this was the spot of choice.  And what a great choice it was!! They have a buffet style lunch with all kinds of great dishes for just $10.99.  I tried a little bit of everything, including my favorite aloo gobi. It was all delicious.  Literally nothing on the buffet I didn't like. The garlic naan was great too. Service was fast and efficient, and our drinks never ran dry.  We were in and out quickly, with tummies full to polish off the rest of the work day. We will definitely be back."
        }, 
        {
            "index": 368, 
            "rating": 5, 
            "review": "Came here with my husband and we both loved it! The best Indian food I've had in years! Everything that interested me was tasty and also for my husband. I would highly recommend the buffet which is what we had! Great service, great food!"
        }, 
        {
            "index": 369, 
            "rating": 3, 
            "review": "I went there a few days ago with a friend. I tried some of their vegetables and they were average. The lady said it's halal but i highly doubt it since alot of people disagreed. Other then that the staff was friendly"
        }, 
        {
            "index": 370, 
            "rating": 3, 
            "review": "I went with à la carte option, the food was good, but they took a lot of time in serving. If you take it positively, may be a good sign that they were cooking fresh food! I found it little expensive, though."
        }, 
        {
            "index": 371, 
            "rating": 5, 
            "review": "Very good food. We came here as Mint restaurant was running full but felt very happy as food was very good here as well."
        }, 
        {
            "index": 372, 
            "rating": 5, 
            "review": "I come here for the perfectly seasoned and cooked goat curry, but all of the many items are great. It's not far from the strip, but it's mostly a locals spot. It's affordable priced and they offer free Naan. DIC is always busy but has plenty of space."
        }, 
        {
            "index": 373, 
            "rating": 4, 
            "review": "It has Delicious and cheap food! The only problem is it seems it is a business family. So in the rush hour time, you won't get good service."
        }, 
        {
            "index": 374, 
            "rating": 5, 
            "review": "Where shall I begin, food is excellent, nice atmosphere, service is great. The staff is very friendly and informative for first timers to Indian cuisine. The chicken tikka masala was my favorite dish, along with the yellow fried rice."
        }, 
        {
            "index": 375, 
            "rating": 5, 
            "review": "I've just recently gotten into Indian food so I can't really compare it to more than 3 other places but man this place is so good. People are super nice and veg and non-vegetarian is all amazing. Highly recommended!"
        }, 
        {
            "index": 376, 
            "rating": 2, 
            "review": "Chicken Fried rice was bad. \nJeera rice is like it came out of ghee pot. \n\nWhite rice n goat curry were good. \nAmbiance is great"
        }, 
        {
            "index": 377, 
            "rating": 5, 
            "review": "Went for dinner, it was delicious! I had the Vegetarian Thali and my babe had the Butter Chicken. My Thali came with regular naan but we ordered additional garlic naan and both were tasty. We had plenty of leftovers, there was so much food! Service was great, really friendly."
        }, 
        {
            "index": 378, 
            "rating": 4, 
            "review": "The food was seasoned right and I asked for mild and that's what I got. Lol. There wasn't a lot of people there when we arrived around 6:30 pm for dinner. It was little pricey, but portions was adequate. We were advised to come in for the buffet and have to same items we ordered and more at a great cost. The manager is nice and kind of a flirt or maybe he was pulling my leg. Lol. The staff was attentive and friendly.  We left a nice tip. We will be going back."
        }, 
        {
            "index": 379, 
            "rating": 1, 
            "review": "Last night, my mother and I stopped in for dinner. We ordered garlic nan bread, tandoori chicken, & a mild curry chicken. The curry chicken was very good, but the Tandoori chicken, not so much. We never received refills on our drinks, the service was okay at best, and when we asked for for more rice, we were told no! But here's the kicker, we were never thanked nor did anyone say goodbye as we were walking out the door. Maybe the buffet during the day would be a better option since you're serving yourself."
        }, 
        {
            "index": 380, 
            "rating": 5, 
            "review": "Very good food. Nice atmosphere and friendly servers. The garlic naan is so good I took some home. Chicken tikka masala was excellent. Veggie samosa is very good and an excellent light meal. I can't wait to try everything on this large menu; everything is so tasty! The room while large was fairly quiet and the booths afford some privacy. I havent tried the buffet but will be back soon to do so!"
        }, 
        {
            "index": 381, 
            "rating": 1, 
            "review": "Can't give minus stars, so starting with one star.  This is my first review ever and thought it might be helpful for anybody walking in with family and small hungry kids.  Service was so poor that one of the starters (chicken soup) was delivered after 35 min and the other starter (Pani Puri) after 40 min. Not to mention that the Pani puri shells were stale and smelled/tasted bad.  Food was delivered after one hour and don't even want to discuss how it was.  One of the servers realized and offered us gulab jamun, appreciate that, but fact is fact and if you are hungry and with impatient kids, please look somewhere else."
        }, 
        {
            "index": 382, 
            "rating": 3, 
            "review": "I'd like to give them 3.5 stars, but it's not an option on reviews.\n\nMy stepdaughter and I ordered takeout from Bite LV. (Good service from them as an aside.)  The food was good quality.  We shared chicken tikka masala, butter chicken, garlic naan and samosas.  We like Indian food on the mild side.  The food tasted good and it was hot and delivered quickly.\n\nMy personal preference leans toward India Palace.  I find their food more flavorful, but In fairness, we order the food on the low scale of spicy.  I order the food the same way from IP but find it to be more to our liking."
        }, 
        {
            "index": 383, 
            "rating": 5, 
            "review": "One of the best Indian restaurants I've eaten at. We were here last year and couldn't remember the name. Literally drove by all the Indian restaurants in the area until we found it. Worth the effort!"
        }, 
        {
            "index": 384, 
            "rating": 3, 
            "review": "Well they have a buffet so food is plentiful, but, one of the dishes is goat curry. I guess I am not cool enough to eat that and as far as pans go it was the fullest, timing perhaps but I was told people like it. Place is clean and all the staff is very nice, love the bread."
        }, 
        {
            "index": 385, 
            "rating": 5, 
            "review": "Best Indian buffet in Vegas!!! Lot of good vegetarian options and lot of sweets!!! The best thing was idli sambhar!! Must visit!!"
        }, 
        {
            "index": 386, 
            "rating": 5, 
            "review": "Great meal. Nice people great tradition Indian cuisine. Garlic Naan was perfect. Curry Goat and the sizzling platter was just what was needed. If ur in the mood for Indian food this is the place."
        }, 
        {
            "index": 387, 
            "rating": 5, 
            "review": "BEST INDIAN FOOD IN VEGAS! I usually say all Indian food is delicious since I love it so much, but this is definitely the best (next to home made) that I've had. The prices are affordable, the location is clean and the service is fast.  We usually do take out, which I love, because the serving sizes are large. I love bringing the food home and binge watching House of Cards (or anything on Netflix). Add candlelight and the sound of rain falling outside your open window...makes for a romantic night in. Love it!"
        }, 
        {
            "index": 388, 
            "rating": 4, 
            "review": "This place has great food for the price (lunch buffet).  It is not a disappointment either on selection.  They actually had one of my favorites which have been difficult to find in a buffet, vegetable samosa...very yummy.  Unlike a lot of Indian places, the food was not too salty.  Definitely will be a repeat customer."
        }, 
        {
            "index": 389, 
            "rating": 5, 
            "review": "Excellent Food with Authentic Taste and flavorful...Service was also fantastic. Mango Lassi is an absolute must have in this restaurant and one of the best that I have had ever. I had the Vegetarian Thali and every item was great.."
        }, 
        {
            "index": 390, 
            "rating": 5, 
            "review": "Wow! First time here and all I have to say is wow! The food is fantastic!! This may be one of my new favorites. Hint: order the garlic naan, you won't be disappointed."
        }, 
        {
            "index": 391, 
            "rating": 4, 
            "review": "Oh garlic naan! How I love you!\n\nThis place has legit naan! We came to the lunch buffet, the price went up from 9.99 to 10.99, but you get a free mango lassi with Yelp check-in.\n\nBeing that I'm a weirdo and I don't try everything, this was momentous for me. The inside was really dimly lit and clean clean. The buffet line was clean and the food didn't look hella old. It actually looked and smelled appetizing. \n\nMy person favorites were Tandoori chicken, chicken curry and butter chicken (that's what my coworker Safi said it was called) I was super impressed by everything! The customer service was great; the food was delicious and hot. For desert we had Gajar Ka Halwaw, my coworker loves this stuff!\n\nWe will be back!\nYay!"
        }, 
        {
            "index": 392, 
            "rating": 5, 
            "review": "This is one of the best Indian restaurants you can find in Vegas! I was here when it opened about 2 years ago, and it wasn't known that much! This restaurant has a variety of food that's good for both vegetarians and non-vegetarian! You can tell it's a great restaurant by looking at the crowd that come to the buffet!"
        }, 
        {
            "index": 393, 
            "rating": 4, 
            "review": "Excellent lunch buffet. Chicken biriyani, garlic naan, and chicken makhani are what I would recommend. Everything is good though. Cheap and reasonable price, can't go wrong with that. I hope this place gets more business."
        }, 
        {
            "index": 394, 
            "rating": 2, 
            "review": "i wish i could rate more but i cant. i was there on saturday for dinner and then later on sunday for lunch buffet. Before i start i would like to say that i am vegetarian and i am only saying from this perspective. when we were there on Saturday for dinner it was nice and comforting everything was on point so we decided to return today for lunch buffet! But no it was a wrong choice this time. It is the worst buffet that i ever had in US. the food waa not fresh and it tastes pathetic. \nsambar was as thick as a gravy of shahi paneer, punjabi kadi was as sour as lemon and it is super thick too with no dumplings in it. \nthen we tried kofta and its same no taste: very thich and same with yellow daal. BTW there were few more (aloo matar,corn saag) and they were equally horrible. we ordered breads and they were also not properly cooked we have to ask our server to cook it properly. Mind it we didnt had any trouble yesterday over the dinner. When we informed about our disappointed to the management they started giving diffuse excuses and just said sorry!\n\ni dont think the sorry was sincere ! \ni have grew in delhi and i know how the delhi food tastes! i am not returning back again and will not advise anyone!"
        }, 
        {
            "index": 395, 
            "rating": 5, 
            "review": "This buffet was amazing! This is the first time I've been here and I was impressed with the variety and freshness of the food. The curry chicken and the chicken tandoori were especially delicious. As a lover of spicy foods, this buffet was right up my alley.\n\nThe price was reasonable, considering the quality of the food and the atmosphere of the dining area. They do have gluten free/vegan/vegetarian options as well. Overall, 5 stars for a great dining experience."
        }, 
        {
            "index": 396, 
            "rating": 5, 
            "review": "You know it's legit when you're the only white person in the restaurant. This is officially the greatest tasting Indian food I have EVER experienced in my life! Thank you YELP for leading me here.\n\nOnly down fall is how well they're doing. This place is so packed that they are having trouble keeping their buffet filled. The naan is instantly gone once it's put out/served."
        }, 
        {
            "index": 397, 
            "rating": 3, 
            "review": "We had to get off the strip for a little, and we wanted some Indian food for lunch. This hit the price point and the relaxed environment we were looking for.\n\nI thought it was a good price for the quality and selection. I thought the Curry Chicken and Butter Chicken could have used a deeper flavor, but all of it was pretty tasty. The Chicken Tandoori was pretty dried out so that would be the only dish I recommend skipping.  The Garlic naan was made fresh whenever you ran out and was very good.\n\nIf you are vegetarian the buffet gets even better for you. They had a number of choices that were flavorful. Paleek Paneer is a personal favorite."
        }, 
        {
            "index": 398, 
            "rating": 5, 
            "review": "I have been to 4 other Indian buffets in Vegas but none of them made me crave their food as badly as this place. \n\nThe service here is not always the best but it's getting better in recent months. You may need to wait a little longer to get their attention especially if you don't look Indian. I don't really care because their food compensates for everything else. \n\nMy favorite buffet dish is Malai Kofta. Just dip your fresh naan bread in it and you will know what I mean. Kebabs are also really good. \n\nThey tend to rotate their buffet dishes throughout the week but removing Malai Kofta on certain days is the crime against the part of humanity they made addicted to it!"
        }, 
        {
            "index": 399, 
            "rating": 5, 
            "review": "The best service I've ever received at a restaurant. And delicious food! Please go! \n\nWe came for a late dinner, stayed past closing, and received freshly made, free desserts. Not to mention outstanding service throughout. \n\nEach dish was absolutely excellent, and SO FRESH. Our friend ordered the tandoori chicken and loved it. It had few spices, came out on a sizzling hot plate; great for anyone scared of eating Indian. \n\nRecommend the chick pea bread, rice pudding, and carrot desserts.\n\nCouldn't say anything better. (Thank you!)"
        }, 
        {
            "index": 400, 
            "rating": 1, 
            "review": "Very creepy servers ,always looking on what are we eating.horrible taste and not delicious.\nWill not recommend for desi people anytime."
        }, 
        {
            "index": 401, 
            "rating": 5, 
            "review": "I went there for the first time and I really like the goat. And the Biryani . Friendly staff. Chicken kebab was very good. It's halal !!!"
        }, 
        {
            "index": 402, 
            "rating": 4, 
            "review": "This is only my second Indian buffet I've tried, so maybe you want to take that into consideration. But I'd come back again. A great deal for only $11/person. They had butter chicken and goat curry, which were both good and not tough or overly dry. The veggie/salad section was small but fresh. Chana masala and potatoes/cauliflower mixture were good. (Unfortunately for me) they had more of a vegetarian selection than meat selection. But all in all, a decent variety to suit any palate or diet. One plate was enough for me as I find Indian food to be extremely filling, even in small quantities.\n\nA few minor complaints were that the naan was thin in some parts, but very doughy towards the middle. And had to remind one of the workers about my drink order. But worth it to come back again."
        }, 
        {
            "index": 403, 
            "rating": 5, 
            "review": "First time food here love chicken Briyani love service and food thanks I will be back for sure thanks you guys for the wonderful food"
        }, 
        {
            "index": 404, 
            "rating": 5, 
            "review": "My husband and I love good Indian curry.  In fact, most times we prefer to cook at home rather than going out.  Enter Dehli.  They have an awesome lunch buffet that has a lot of curries that are difficult to make at home.  Overall, go to this place for lunch and order the Garlic Naan"
        }, 
        {
            "index": 405, 
            "rating": 4, 
            "review": "What a great spot for AYCE Indian buffet for brunch on the weekend! You get a lot of different varieties here to suits your craving.  The service I received from the staff are always friendly and top notch that I don't hesitate to leave them a fat tip afterward.  \n\nPlease keep up the excellent work and I will continue to show my support in the future!"
        }, 
        {
            "index": 406, 
            "rating": 5, 
            "review": "After reading so many reviews, my BF and I finally tried this place out last week. We had the lunch buffet, and I was surprised by the variety of the different foods. Of course our first question to the owner was if the meat is halal or not, and it was!! *halal alert* \n\nThe food was delicious, everything from the reshmi kabob to the warm gajar ka halwa. They had chicken tandoori (flavorful!), goat biryani, channa masala, and the list can keep going on and on. We also ordered garlic naan (including in the 10$ buffet price) and it honestly seemed to come right out of the oven! I couldn't get enough of the chicken tikka masala, and the Navrata korma (I think that's the name? LOL). The sauce (Salan) was creamy and hot. \n\nIt became obvious that this place is going to be very popular VERY soon. We talked to the owner, and he was very helpful. He told us that although the main items stay the same during the lunch buffet, sometimes the dessert (mithai) might change, and maybe the lentil curry (daal). \n\nThe atmosphere of the restaurant was quite fancy and quiet on the day that we went... But they have a very nice setup. \n\nI'm itching to come back again! :) \n\nSPECTACULAR place!! MUST GO."
        }, 
        {
            "index": 407, 
            "rating": 4, 
            "review": "Excellent service and very tasty goat curry. Garlic naan was slightly biter but the Mango Lassi and chai were great."
        }, 
        {
            "index": 408, 
            "rating": 4, 
            "review": "It's a place that's a little out of the way (really close to UNLV tho) and if you're looking for authentic Indian food this is a great place to visit. It's a buffet, but the selection is on the small side. They DO however have Butter Chicken, which I found is something that a lot of Indian restaurants in Vegas lack (that has saddened me to no end, Butter Chicken and I are in a committed relationship). There are two sides to the buffet; one side is purely vegetarian which is nice so people don't get confused. The food itself is really delicious. I ate almost everything and I recommend it all. I also recommend getting a Mango Lassi if you're not good at handling spice. Since the food isn't made to order, you have no control over the spice levels."
        }, 
        {
            "index": 409, 
            "rating": 5, 
            "review": "Having a delicious lunch before I go into work!  Started my lunch off with a free mango lassi! Check in on yelp for a free mango lassi or soda!  So yummy! Always great service too!"
        }, 
        {
            "index": 410, 
            "rating": 5, 
            "review": "I have never imagined that I would get such a great Indian vegetarian food in Vegas. This is a great place for any vegetarian folks out there in Vegas, especially this restaurant serves Jain( food without onion, potatoes and garlic). The staff is very friendly and helping. I would recommend to visits this place if you're looking for delicious Indian food and great ambience. Totally worth it."
        }, 
        {
            "index": 411, 
            "rating": 2, 
            "review": "Curry was good. Lachha Paratha was not even close to what it is supposed to be...  Paneer Paratha had raw paneer (no masala, etc).... And in a delivery order to Hotel there were no disposable plastic ware or napkins.  One star deduction for each issue:-("
        }, 
        {
            "index": 412, 
            "rating": 1, 
            "review": "This is a famed restaurant in Las Vegas, \nWent for buffet yesterday with family. Extremely disappointed. Food was OK at best. Tandoori chicken was cold and dry, It got finished and was not replenished for 30 mins. Till then we were done.\nThey serve bread (naan) fresh on the table. Great. We were 4 adults. Gave us 2 naans, one garlic and one plain. We didn't know the type till we were done with the top garlic one. We asked for another garlic naan and our unfriendly waitress refused till we finished all the naans. As is in dictatorship you have to follow what the Govt says so here we have to obey with the instructions. When done, we asked for Garlic naan and for a change she smiled and left to get replenishment. We waited for as long as we could reminding her but with little success. Finally after a long wait we got the naan (1 piece) only to discover that it was not properly cooked and raw dough was coming in our mouth. Called the waitress and she quickly took our naan away never to be seen again. At that point we were disappointed and done. Paid our bill and left the place vowing to never return. \nMy wife paid the bill as me and kids were freaking out because of poor quality of management and lack of food. She complained to the manager who had following reasons. Got too many people, staff ran away, 3 weeks ago there was rain in Las Vegas that they are recovering from etc.. However we had to pay full price for the food while they all messed up.\nOur waitress was very unprofessional and would run away when before we could finish asking her a question. I had once asked her to listen patiently. She was rude or may be helpless. Did not understand hospitality and maybe had no experience. I think if she was polite my review would not be so negative.\nAs I see we paid full price for below average meal and horrible service. Will not go there again."
        }, 
        {
            "index": 413, 
            "rating": 5, 
            "review": "i like their selections..from curries and vegetables! this is a hidden indian food away from the strip"
        }, 
        {
            "index": 414, 
            "rating": 5, 
            "review": "Real exceptional service... Attentive and kind and the food was phenom!  Big fan of super spicy food and they did it right :). palaak paneer was perfect and great portions too.  Will be back :). Thanks!"
        }, 
        {
            "index": 415, 
            "rating": 5, 
            "review": "Excellent. Food was spicy and well prepared. Atmosphere was nice. The place was extremely clean. I'll definitely be back."
        }, 
        {
            "index": 416, 
            "rating": 5, 
            "review": "I am a self confessed foodie! I am in particular an Indian food snob! \nI have the opportunity to travel with my job and I try ask sorts of locally owned places. Because this place received a good review I thought I'd give it a go... Oh man! Wonderful! The Saag paneer was fantastic. As was everything I tried. Everything was fresh and flavorful. I easy Indian all over the state's and this it's by far the best I've had! I'm almost sorry I only make it to Vegas twice a year!"
        }, 
        {
            "index": 417, 
            "rating": 4, 
            "review": "Solid lunch buffet for $11/person- clean and organized display with all item labeled, naan available by request with garlic, and free mango lassi with Yelp check-in.\n\nCucumber, onion, and tamarind-sauce salad is refreshing and delicious.\nGoat curry is meaty with good heat to it, tandoori chicken, curry chicken, chili chicken, and biryani rice all available. Vegetarian options included samosas, pekora, chana masala, dal, and squash, along with saag paneer.\nThe salad section also has a phenomenal mint sauce that goes deliciously with absolutely everything- I'd buy this stuff to go if I could (I didn't ask).\nFinished up with the gulab jamun, my favorite dessert of milk-cheese balls soaked in honey sauce.\n\nI liked that the variety of the buffet was fairly diverse with a lot of lighter and vegetarian options, allowing me to sample a little of everything without totally pigging out.\nService was polite and soft-spoken, we were asked repeatedly if we liked our food, which was appreciated.\n\nHaving moved here from the Bay area, with about 234920349 times more Indian restaurant options to pick from, I simply wish I didn't have to cross town to find this cuisine."
        }, 
        {
            "index": 418, 
            "rating": 3, 
            "review": "Very tasty food... not a very large selection but good for the buffet i guess.  the service was very very slow.  took almost 20 min to get the bread which is essential in eating indian food!  place wasnt even busy. we must have asked the waitress at least 4 times and she just kept forgetting.  all in all it was good...."
        }, 
        {
            "index": 419, 
            "rating": 5, 
            "review": "Great buffet, service is great, good food for the money cant go wrong with this place"
        }, 
        {
            "index": 420, 
            "rating": 5, 
            "review": "Best Indian food !!! Love chill chicken  and okra dish with mango lassi . Don't forget to get some garlic naans !!"
        }, 
        {
            "index": 421, 
            "rating": 5, 
            "review": "One of the best buffets in vegas taste real desi and reasonable staff is nice ,i love the environment must try nice. Cheers!"
        }, 
        {
            "index": 422, 
            "rating": 4, 
            "review": "Just thinking about the place made me hungry .It`s 11 PM so probably too late for the buffet .But anyway ,Vegas local ,frequent visitor to the Indian buffet and have been to most in town .Yes that crazy ! I started going to this place about 2 months ago , had a gigantic biryani and mango lassi , the chef specializes in the Mango lassi as far as I am concerned! Fan ever since .\nFirst time I went there for the buffet , the garlic bread , the mushroom were fantastic , not to mention the chicken and mutton .I had a feast , no pun intended . Only regret that day was, maybe  I shouldn`t have eaten that much .But by another 3 days the regret vanished and i duly returned ,this time ,they had another special variety of chicken , I am blanking on the name , but i was good , if you end up there just look and sausage like chicken roll,it`s really good . \nWhen I am not going to this one ,I am probably going to some other one :) .Imagine the embarrassment at showing up at the same buffet ,every other day ! And have to say most of them are similarly priced and probably have similar food range ,but after multiple sampling at other indian buffets I have to say that this one has more options,maybe a little bit cleaner and definitely the most spacious  in town. And would recommend it to anyone who wants to get away from ridiculously priced buffet at the big nightclub restaurants , as long as you like indian food .\nAs for the negative stuffs , the ambience could be better , i mean they could decorate the walls a little bit better and play some decent music like some upscale places.Sometimes they have hard time catching up with the demand supply thing but i guess this being a new place ,its something they can work on.And  yes sometimes ,there is just that little extra oil floating around in the nan-bread or the curries, again something they can work on .All in all ,for an indian buffet ,it`s bang for bucks. And no I don`t own the place and have nothing against any other Indian buffets."
        }, 
        {
            "index": 423, 
            "rating": 3, 
            "review": "This buffet is very average. There were some items I liked and some that I didn't, but nothing wowed me. \n\nThe sitting area is large and they can hold a good volume of people. The staff was nice, but a little disorganized. We had to let a couple people know before we actually got our naan. The ambiance is very casual and it makes for a nice lunch place.\n\nIn the appetizers, the Tandoori Chicken was cold on the outside from sitting out so long and only tasted okay. The Shish Kabob was tasty, but not one of the kinds that I could keep eating. I had a couple pieces and was done. The Samosa, I would rave about. Though the filling had a little too much peas for my taste, they were really yummy. In most samosas, my favorite part is the little end where there is no filling and the dough is crunchy, and in this samosa, all of the dough tasted like that edge piece. Simply wonderful!\n\nOne really good thing about this place is that they deliver fresh naan to your table. Other buffets have the naan cut up as part of the buffet, but when there isn't a high turn around, you know those naans have been sitting for a while. Not the case at this place, they offered us plain or butter, but we asked for garlic and they obliged. It did take a little while for the naan to actually come out after we had ordered it, but it more than made up for the wait with the quality. \n\nThe main dishes is where I was most disappointed with this buffet. Chicken Makhani was pretty good. It had good layers of flavor. Unfortunately, at they tray seemed like the chicken pieces were either very small or had been picked through by other guests. The Chicken Curry had no flavor, and I only ate a little. There were a couple of vegetarian options, which was good to see for the vegetarian folk out there. I'm not a fan of brinjal, so I didn't try that, but I did try the Chana Masala, which was decent, although, not my favorite. All in all, there was nothing super exciting in terms of the main dishes.\n\nFor desert, I tried both the Gulab Jamun and the Kheer. The Kheer wasn't sweet enough for my taste. The Gulab Jamun, on the other hand, was pretty spot on. They were nice and warm too!\n\nOverall, this buffet did not hold up to its reputation, but it was a good value for the amount of food that you get for the price you pay."
        }, 
        {
            "index": 424, 
            "rating": 5, 
            "review": "First off me and my girlfriend LOVE this place they always have new dishes every time we go but they always keep the fan favorites. The food is always warm and fresh. They are sometimes a little slow on bringing the naan bread at times but they always refill your water right away. We have went so many times now they ask us how our life has been going if we haven't been in a while just a overall very pleasant experience. Good food, Nice people and a clean place what more can you ask for?!"
        }, 
        {
            "index": 425, 
            "rating": 4, 
            "review": "I really enjoyed this. Everything was good. Spicy was properly spicy and unlike some other Indian joints, the chutneys were rapidly produced to mitigate the heat. (I've heard that chutney is English more than Indian, but I do not care: A good chutney is the perfect counterpoint to spicy Indian food.)\nThe naan was perfect. I like the garlic naan best but either way, you're winning. We had chicken vindaloo and a lamb dish. Both were terrific. Plus a full bar and they know how to pour a drink!\nThe service we had was terrific, even when (because I was stupid) I forgot to order our entrees, our wait person was patient with me and got the orders in immediately. I note that some of the reviews dinged them on this, but seriously, our service was well-neigh perfect."
        }, 
        {
            "index": 426, 
            "rating": 5, 
            "review": "Lunch buffet was only $9.99! The best quoalit and great selection.  I want to try dinner soon.  Love it!  :)"
        }, 
        {
            "index": 427, 
            "rating": 4, 
            "review": "Order my food to go... BEST CHICKEN CURRY!! My new favorite place. I love Indian food!! Glad this place is open!! I've been waiting to eat here. The ambiance is really nice as well. Look forward to trying their buffet!!"
        }, 
        {
            "index": 428, 
            "rating": 5, 
            "review": "Food was amazing! Went for brunch and it was awesome not authentic though but the taste was just awesome."
        }, 
        {
            "index": 429, 
            "rating": 5, 
            "review": "Great food, great service, Krishna came to our table and got our review.  They were willing to accommodate our specific food requests. Food to table took some time but art cannot be rushed.  Compliments to the chef."
        }, 
        {
            "index": 430, 
            "rating": 3, 
            "review": "I gave this place at three their naan-bread is not that greatat all I gave it to three overall because of the look of the restaurant. Service was okay and I realize why there was only three people inside. I will admit that there Teeka masala was awesome"
        }, 
        {
            "index": 431, 
            "rating": 1, 
            "review": "Never order for delivery!! Ordered and they never showed up. Don't know how the food taste because I never received it."
        }, 
        {
            "index": 432, 
            "rating": 5, 
            "review": "Delicious food!  So much flavor!  Lots of variety.  Very friendly staff.  I enjoyed trying the mango lassi with my yelp check in!  The garlic naan bread is so yummy!!!!  Will be back soon!  Nice family restaurant."
        }, 
        {
            "index": 433, 
            "rating": 5, 
            "review": "Excellent food and awesome service. Our server Krishna was one of the best we have ever experienced. We will definitely visit again."
        }, 
        {
            "index": 434, 
            "rating": 3, 
            "review": "Came here with my bf and his friend. We were visiting Las Vegas for the 1st time and the friend really wanted to eat Indian food. So this place was the best choice to eat from the order restaurants. \n\nThe location was pretty easy to find. Although if you are coming from the side it can be a little difficult because the restaurant is hidden in the back corner. The server was pretty quick... too quick I say. She would come around and grab my bf's plate 1st before asking \"are you done?\"\n\n *sigh; honey you gotta ask if they're done before you take it* \n\nThe buffet in my case was pretty good. I like the chicken masala, to me it was good. The spinach (saag paneer but without the cottage cheese) * I think * had a little weird taste to it. The lamb dish was kinda hard and over cooked. The soup was pretty good (can't remember the name of the dish). The chicken tandoori was severely burnt and lacked spice and flavor. Samosas (vegetarian) were pretty good. They had a slight kick to them,which I liked. \n\nFrom the guys side, they didn't like it. They say the chicken  was over cooked. The saag paneer was mixed with milk and it tasted bad. The Naan was dry, hard and slightly burnt but the dessert was okay ( the guys say it was the only dish that was good because it was brought rather than made). Overall if you're not a food analyst  will love it! But if you are one then \"enjoy\".\n\nAlso the manager doesn't really care about its customers, he could have at least asked if the food was alright, instead like most business people, Money 1st (pay 1st) ask questions maybe later.... or never."
        }, 
        {
            "index": 435, 
            "rating": 5, 
            "review": "The Guy Krishna, was awesome, Food is really nice and Good..!! Its a good place for eating spicy food..!!"
        }, 
        {
            "index": 436, 
            "rating": 1, 
            "review": "My coworker and I went here for lunch today because the Mint was too busy.  We arrived around 12:20pm, and the pickings were scarce. No naan. No pokora. They were out and didn't replenish for 1/2 hour. Lentil soup was watery. I think the most aggravating thing was they were just plain out of items and did not replace the whole 30+ minutes I was there. They also have the nerve to kick up the price 2.00 more for lunch. You can't do that if you can't back up the price increase. This was by far one of the worst buffets I have been to. When I complained about the lack of essentials when I went to pay, there was no apology, no \"let me take the drinks off.\" Nothing. A blank stare. I will never go here again. Save your money and take it to the Mint where the food is delish and FULL buffet ALL the time."
        }, 
        {
            "index": 437, 
            "rating": 1, 
            "review": "tell you 1 hour in delivery time comes to you in 2 hours and 10 mins, the take out servings are less then half of the real serving spent 80 dollars on 5 people and we order 2 pizzas form pizza-hut afterwards, the food tasted so-so not that happy with it specially with the price\n\nand the greedy fat delivery man demanded a tip. before kick him out with 2 dollars"
        }, 
        {
            "index": 438, 
            "rating": 3, 
            "review": "Slightly on the expensive side for dinner buffet, good options for people who love meat, but usual/not much different options for people who don't eat meat. \n\nPrice would be what that could prevent me from going back."
        }, 
        {
            "index": 439, 
            "rating": 4, 
            "review": "The Lamb Briyani took us by surprise, it was super delicious!!!"
        }, 
        {
            "index": 440, 
            "rating": 2, 
            "review": "This review is from ordering off their menu, not the buffet.\n\nI came here at night and ordered chicken masala and samosa. The chicken masala was over cooked and dry. No flavor at all. The appetizer that they delivered at first was the wrong order and burnt on top of it. The samosa was okay, but again the seasoning was poor and there were 2 big ones for 5 dollars, which is pricey for the quantity. \n\nIt took me awhile to get the food, and I had to get the waiters attention just to place the order. They weren't that busy, so it was disappointing. The place looks nice. The food tasted like buffet quality, and I have had better buffet food to be honest. My bill came to around 20 dollars."
        }, 
        {
            "index": 441, 
            "rating": 5, 
            "review": "I do not consider myself an expert in Indian food at all.  I just know what tastes good.  I'm from Southern California, and there are 2 authentic Indian food restaurants where I'm from.  Delhi Indian Cuisine is right there in line with them.  I love their food, the servers and even owner are very nice.  They always ask you how the food is.  I come here so much that I'm almost a regular.  I haven't been to the lunch buffet yet, I've only eaten dinner here.  The portions are huge enough for two people.  I love this place"
        }, 
        {
            "index": 442, 
            "rating": 5, 
            "review": "Grand opening tomorrow. They had a soft opening on New Year's Eve. I was presently surprised at how lovely the place was on the inside. It's dimly lit and makes for an intimate experience. They have a GREAT selection on the buffet for anyone's taste; several options for vegetarians and meat lovers. They even had biriyani on the buffet line, which I am a big fan of. \n\nThe place is very spacious and has a contemporary layout with soothing music playing. It makes you feel like you are really in a high end restaurant, but you realize that it's a high end buffet with great food instead. I'm told they will offer a full bar in the near future which is unique for an establishment like this.\n\nI had no complaints. The staff were accommodating and received prompt service. I will definitely be back. \n\nI just need to work off the 20k+ calories I just injected into my body first after I take a much needed nap. Not smart planning on my apart considering it's the evening of New Years Eve. Oh well. We live and learn."
        }, 
        {
            "index": 443, 
            "rating": 1, 
            "review": "Extremely slow service. There were 5 people who were supposed to take orders but were wandering aimlessly, just passing a  stare and moving to the next table\n\nWe had ordered Naan and biryani Once the food arrived, it was extremely spicy even though the order was supposed to be moderate spicy. To top this experience, when we shared this feedback to the restaurant guy, his answer to eat naan with a bit of curd. Must be kidding right?\n\nVery pricey, extremely slow service Not worth it.."
        }, 
        {
            "index": 444, 
            "rating": 5, 
            "review": "Goat curry was amazing, great blend of spices . Enough quantity of meat too.\nService was pleasant and courteous.\nMasala papad was also good. Place has modern decor and comfortable seating."
        }, 
        {
            "index": 445, 
            "rating": 1, 
            "review": "They must have changed cooks.  The new food was too spicy for the kids.  We will not be going there again.  They need to have Golan Jamin too."
        }, 
        {
            "index": 446, 
            "rating": 5, 
            "review": "Food was very tasty.Excellent customer service.clean and pleasant.I will recommend this restaurant to my friends....."
        }, 
        {
            "index": 447, 
            "rating": 4, 
            "review": "The Skinny: the Nepalese/East Indian cuisine is very satisfying... not to mention great piping hot naan that is perfectly crispy on the bottom with a slight chew. Only sad thing is that they do not consistently have kheer which is my fav. (4) service: always pretty good - water glasses are filled consistently (4) value: for $11.99, the lunch buffet is a great value - good for groups due to the large dining room (4).\n\nThis is our new go-to Indian Buffet joint in town. Sporting a good variety of items, they offer both Nepalese/East Indian flavors. The dining room is spacious and is capable of serving large groups of people comfortably.\n\nService is usually pretty good and your water glass is never left unfilled.\n\nMy favorite items include the saag paneer, chana masala and the aloo gobi. So delicious and usually always there. Their raita is nice and thick. They do not have chutney available as a condiment however the tamarind sauce does okay in a pinch. The tandoori chicken is quite moist and tasty as well. The hubs is addicted to their butter chicken and daal.\n\nTheir naan is great - loved the crispy bottom with the slight chew. Order it with garlic at no extra cost. Awesome!\n\nTheir one weakness in my opinion are the desserts. They have a rather artificial, watery mango \"custard\". This is in rotation with the vermicelli payasam which I found to be a bit too sweet and one note. I kind of miss the kheer using rice pudding and cardamom.\n\nOverall, these are minor issues to an great buffet. 4 starred review."
        }, 
        {
            "index": 448, 
            "rating": 5, 
            "review": "This place has an amazing lunch buffet. All of the food tastes amazing and they keep it stocked."
        }, 
        {
            "index": 449, 
            "rating": 5, 
            "review": "Fantastic is the word... Have been in the States for the last six months and I can bet that this the best buffet lunch I've had. Absolutely authentic Indian.. Pls enjoy yr Indian cuisine here like my wife n I did.. Keep it going!"
        }, 
        {
            "index": 450, 
            "rating": 4, 
            "review": "Delhi indian cuisine is by far the best indian buffet i have had and i have tried at least 4 of them. There is enough variety and more importantly the taste is good to great for most part.\n\nThe malai kebab and the goat curry wrre excellent and so were the naans. The only thing i could complain about if i wanted to nitpick was the raita and panjabi kadhi being too sour for my taste.\n\nIf you are in vegas, dont miss this buffet."
        }, 
        {
            "index": 451, 
            "rating": 5, 
            "review": "One word, delicious.\n\nIf you can read more than one word, then read on my friend cause this is one of the best Indian restaurants that I've been to. \n\nSome hobknobs might find the location a bit shady, but the interior of the restaurant is clean and well put together and makes you forget about all the bums across the street. Whataraya gonna do? Amirite?\n\nThis place has only been opened a week or so. The service here was good. While the waiters were new and seemed untrained in the usual customer service/waiter chatter, (family owned restaurant I assume?), they were still very polite and attentive, and boxed our food to-go for us. No complaints from me, they refilled my water glass often as I slew down all that spicy curry.\n\nGood news for all vegetarians, half the menu is vegetarian based, which put me in a chipper mood right off the bat when we entered. They also have multiple chicken and lamb entrees if you're still craving the meat food. For me not actually being a big fan of curry, the food was amazing and I ate till I was beyond stuffed. I forgot the names of the dishes we selected, but I had a nine vegatable combo with mild spicy creme curry and my boyfriend had the traditional chicken curry. Both were just right in hotness and didn't leave a chalky taste in my mouth like most curry does.\n\nThe grand finaleeeee....Naan bread. mmm yes, that's right. the garlic naan bread here is so delicious I just wanted to go adopt a new puppy or something. Was so good that I got another frisbee shaped bread slice to-go.\n\nWith all that and an extra bowl of rice, the price for two was pretty decent. We ate there during the dinner hours where they gave us a menu, but they also do a lunch buffet which I have yet to try. I plan on coming back here as this place has awakened my curry craving. I'm getting hungry just typing about it."
        }, 
        {
            "index": 452, 
            "rating": 3, 
            "review": "Never had Indian food tried it for the first time . It was good experience staff was great friendly and polite. I d go back in the future to try the lunch buffet."
        }, 
        {
            "index": 453, 
            "rating": 5, 
            "review": "This is one  of the best Indian buffets i have been to in USA. It's $14 but it's totally worth it. We were in Zion National Park for 4 days and really craving Indian food while on the way back to Vegas airport we stopped here and I am so glad we did. I had an awesome meal, there were 5 chicken dishes, a goat curry, 4-5 Indian dishes ( palak paneer, aloo mutter, korma etc) , nan and pulav. The only thing which I didn't like was gulab jamun which felt a little old but all in all a good restaurant.\nI will def visit again"
        }, 
        {
            "index": 454, 
            "rating": 4, 
            "review": "Pretty good! The buffet is good and has a lot of vegetarian options. They could definitely spice up the options a bit (after all, most people who want Indian food want spicy food) and they could definitely mellow out on the salt. Way too salty! \n\nVery friendly service. It's also a lot nicer, bigger, and cleaner than you would guess from the outside. \n\nI'll be back :)"
        }, 
        {
            "index": 455, 
            "rating": 5, 
            "review": "Came here for buffet with friends, and boy it was amazing. Indian buffet was only $9.99. This is the cheapest buffet in town. Everything is tasty, they have 5 vegetarian and 5 non vegetarian options. They even put out tandoori chicken and chicken kabab together. Gulab Jamun for buffet thats crazy, never have i seen someone put gulab jamun for buffet."
        }, 
        {
            "index": 456, 
            "rating": 5, 
            "review": "Great indian buffet!!!! Will definitely be going back when in Vegas!!! Lots of choices to choose from. Don't know the name but the carrot dessert was delicious!!!!! Best I've had!"
        }, 
        {
            "index": 457, 
            "rating": 4, 
            "review": "We went there for dinner. \nWe were surprised to see lot of empty tables around 9:00/9:30 PM.\nBut the food was good. The Mango Lassi was no good. \nIf you want to try Indian food after a long day in Vegas, This is a good Restaurant you can visit. \nThe service was really good."
        }, 
        {
            "index": 458, 
            "rating": 4, 
            "review": "One of my favorite places to go for AYCE Indian lunch buffets. Staff is friendly & efficient. I love the decor as well! Consistent, delicious & great customer sevice"
        }, 
        {
            "index": 459, 
            "rating": 4, 
            "review": "Had lunch here. The buffet had a great selection and the food was yummy.. Great flavor - love the mango lassi and the chicken curry.. Very nice ambience- kinda simple but I'm all about the food.. I recommend this place.."
        }, 
        {
            "index": 460, 
            "rating": 5, 
            "review": "Best indian food at lasvegas as of I know.. saffron is next to this one.. earlier I was thinking li mm e saffron is best but after trying here I changed my best option to here.. lot of varities and good food at las vegas"
        }, 
        {
            "index": 461, 
            "rating": 5, 
            "review": "Amazing chicken tikka masala! Craved Indian food for two months and this was just the place to go. first time coming here and truly blown away"
        }, 
        {
            "index": 462, 
            "rating": 4, 
            "review": "Excellent service delicious chicken tandoori veggies crisp hey im tryna write like a food critic i enjoyed myself I will be back."
        }, 
        {
            "index": 463, 
            "rating": 1, 
            "review": "This place was so horrible!!  I love Indian food and had it bookmarked for a while.  I was excited to suggest hitting it up to 2 of my good friends for dinner end of business day. \n\nI arrived first and it was empty and cavernous.  I ordered a cocktail while waiting for my friends.  15 minutes went by and my first friend arrived and still no cocktail. I was the only one there!  It was forever before she finally brought my drink and when she did it was the wrong cocktail. I explained it was a goose and side of fresh lemon juice the first time. She brought out a goose and a fresh lemonade.  When I told her it was wrong she totally copped an attitude with me, then went back to the bar only to make another wrong cocktail which was goose and a lemon soda!   When I told her she got it wrong yet again she told me she's never had somebody in there like me and she started yelling in her native language to another of her associates... and clearly it was about me lol  \n\nThen someone came out of the kitchen, we believe it was an owner, and started accusing her of stealing keys.  It turned into an all out screaming match in the middle of the restaurant.  I mean take it outside!  The cooks even came out of the kitchen to get ring side seats, eagerly awaiting the blood shed.   Our friend finally arrived in the midst of the insanity. It was like an episode of cops was unfolding before our very eyes.  We exited the establishment post haste.  \n\nUnfortunately we never tried the food but the ambience or lack there of leads me to want to leave a negative star rating, but I have to give it a one to post.  Needless to say it's erased from my bookmarks forever!  I was ashamed it was my suggestion in the first place. My friends definitely applauded me for the stellar recommendation lol"
        }, 
        {
            "index": 464, 
            "rating": 5, 
            "review": "i've gone back a few more times for the lunch buffet and its still fantastic. only wish they offered a dinner buffet atleast once a week."
        }, 
        {
            "index": 465, 
            "rating": 5, 
            "review": "I LOVE this buffet! And that's saying something, because I have been a die hard fan of Mint for some time now, but.... I gotta give props to Delhi, mainly because of CUSTOMER SERVICE!\n\nThere is one guy, HARI! He is amazing. The first time, we came here as a huge group for Norm's UYE, and despite there being around 14 of us, he made sure our glasses and Nan were never empty! Very attentive, and always on it.\n\nThe next time I visited, I brought my mother. Again, Hari made sure to come over and check on us, chit chat a bit, and make sure we had everything we needed. I reminded him that I came with the huge Yelp group, and he gave me a warm welcome back.\n\nAll the food is fabulous, and if you come during the early daytime rush, it is VERY fresh. Yes, there will be a bit more people there, but it's worth the wait.\n\nMy favorites from the buffet include the Goat Curry, the Navratan Korma, Gulab Jamun and the Tandoori Chicken. Mmm, just writing about it now is making my mouth water. And that's just a short listing of all the choices Delhi has to offer on any given day.\n\nYou have to go and try for yourself. Make sure you say hi to Hari for me!"
        }, 
        {
            "index": 466, 
            "rating": 1, 
            "review": "Pathetic food. We ordered chilly chicken, chicken momos, dal makhni, karahi chicken and bhunna ghost. All except chilly chicken was worse indian you could have. First, waiter forgot our order. Bhunna ghost was uncooked. Karahi chicken had excessive salt. Dal was bland. One of the worst meal I ever had in US. Breads were not up to the mark. Washrooms were in bad condition. \nWhat else do you expect from a resturant. \nEat at your own risk !!"
        }, 
        {
            "index": 467, 
            "rating": 5, 
            "review": "We came here for dinner and ordered from the regular menu, as buffet is only available during lunch. Appetizers were generally priced at about $5, and entrees range from about $11 - $15. So it is a little pricey, but the portions were generous. We ordered vegetable pakora, saag panner, tandoori chicken, and aloo gobi. We also got a free Mango Lassi for our Yelp check-in, and complimentary Galub Jamuns for dessert (served warm)! My husband and I were both full by the time we left, and we had enough left over for lunch the next day. \n\nThe food was absolutely delicious and the staff was very nice. There place was pretty empty, only about 5 tables were occupied, so the staff was very attentive - asking if we needed more water, and checking to make sure we were enjoying our meal. \n\nI'll definitely be coming back here - only next time I hope I can make it for the $10.99 buffet lunch!!"
        }, 
        {
            "index": 468, 
            "rating": 5, 
            "review": "We go to Vegas a lot from Los Angeles.. I was a fan of Ghandi since last 8 years.... I think I found my new fav... Food and service was great..."
        }, 
        {
            "index": 469, 
            "rating": 5, 
            "review": "Such good food!! The chicken tikka masala was amazing. Definitely will be coming here again."
        }, 
        {
            "index": 470, 
            "rating": 5, 
            "review": "Never had Indian food before. Friends recommended I give this place a chance, and I loved it. Spice level on everything is perfect for me, and the bread must be foreign to earth cause it's on another level."
        }, 
        {
            "index": 471, 
            "rating": 4, 
            "review": "Funny enough, I thought I knew all the Indian restaurants near UNLV. But this was new. The exterior is unassuming enough and fits into the surrounding businesses like a leaf on grass. But once you enter inside it looks pretty nice and clean. What I noticed was how big this place was. My go to place for Indian is Everest, but my friend told me to try this place and I did.\n\nThe service is quiet but friendly and very quick. I give the food a 3-3.5 star but the service moves it over.\n\nOk, stop your yammering Andrew. What about the grub? The food is actually spicier than most other Indian restaurants I been to. The butter chicken is probably the tamest entree there. Well, that and the pre-requisite tandoori chicken. My favorite go to is always tandoori chicken and goat. And that's what I went for. The tandoori chicken was pretty dry. I wasn't sure if it was the Hoover Dam drought effects but i shrugged that off and notched it against Delhi. The goat is very tender and tasty. The butter chicken is very delicious. I also had the other spiced chickens like curry. It was good but not memorable enough for me to remember much about that foul. The eggplant was cooked well but man oh man it had some spice to it. A bit too much for a rather bland vegetable if you ask me. Sometimes the veggie is best left natural with a bit of seasoning. To me, this is one of them.\n\nMy regular rice pudding dessert was a bit different, it had vermicelli noodle bits in it....glass noodle for the noodlers out there. The fruit and desserts were minimal. If you like sweets, they had this glutinous ball that was swimming in honey water. Sweet and delicate. Try it.\n\nI did not eat the different varieties of rice there but it looked good enough. The nan bread was brought out piping hot and had garlic and cilantro in it. It was fresh and tasted great, especially after dipping it in the butter chicken sauce.\n\nAYCE lunch was about $10. There is quite a variety but I think I will stick closer to home and go to Everest.\n\nBusiness seemed pretty slow so I hope it was because we lunched at 1:30.\n\nI will mention one more thing. There were a little too many black things in the rice pudding. Maybe 2. Imma tell myself that it was some sort of spice. It wasn't a bug. I rubbed it on the table and it was more like lint. A bug would break apart. The better half thinks it's spice so I'll go by that. She did notice that it had quite a bit of it on the tray as well. I am Chinese but an extra added bonus of tiny bug is persona non grata."
        }, 
        {
            "index": 472, 
            "rating": 5, 
            "review": "Really good food and nice environment. Manager was friendly. Naan was fresh made. A good Indian Buffet at Las Vegas."
        }, 
        {
            "index": 473, 
            "rating": 4, 
            "review": "We ate here in August and with Indian food being one of our most favorite ethnic styles, we jumped at the chance to try out Delhi Indian Cuisine. \n\nThe menu contained numerous items that were new to us, and we started things off with a Mango Rum Lassi. The alcohol was a nice addition and did not overpower the sweetness of the lassi. For my main course I had the  Kadhai Paneer and enjoyed every bite. My wife had the Chicken Xacuti. I'll let her write about that in her review (she liked it). We shared the kashmiri naan and used it to scoop up the great food. \n\nWould love to come back for the buffet.\n\nSide note, be careful in the parking lot, there was a taxi that flew by us not once but twice and darn near hit our rental car. :\\"
        }, 
        {
            "index": 474, 
            "rating": 5, 
            "review": "Great dishes for Vegan folks. I'm also gonna gues.its really authentic cause I was like the only non Indian looking white guy in there but then again i have nothing to go off.\n\n\nFood was delicious but really spicy for my liking.\n\nI'll go back anyday."
        }, 
        {
            "index": 475, 
            "rating": 1, 
            "review": "Long wait times and we realized server missed orders requested after an hour. Requires repeated follow ups for the orders placed. Waste of time and a horrible experience knowing food was not prepared after an hour wait. If you are lucky to get the food served it's not any better too"
        }, 
        {
            "index": 476, 
            "rating": 5, 
            "review": "I would rate it as 5stars and a fantastic place to hang out and have food. Very polite at service and delicious food served. Its very close to the strip and one must try out of thou are nearby."
        }, 
        {
            "index": 477, 
            "rating": 5, 
            "review": "Food is great, service is awesome. We are in Las Vegas on a trip. We will surely come here again whenever we visit Las Vegas. There are lot good things like customer care, light Hindi music, interior etc.,. One thing which I didn't like is the lack of cleanliness in the restroom (actually it was in too too bad shape to say the least) but I will not reduce the number of stars because they deserve another chance on that.\n\nOn the food side had goat biryani liked it, had tandoori chicken super liked it. Today I have ordered chilly chicken looks good I am sure it will taste great!"
        }, 
        {
            "index": 478, 
            "rating": 5, 
            "review": "Simply in  the best . Best Binyani we ever had . Thanks for ur excellent service . We will be back ."
        }, 
        {
            "index": 479, 
            "rating": 5, 
            "review": "Great food, great service, best momo and best Manchurian we have had in a long time. \nVery nice staff especially Krishna and Hari and their team\nWe will definitely visit when back in Vegas."
        }, 
        {
            "index": 480, 
            "rating": 5, 
            "review": "Loved the food and the people is really friendly too, after we finish our dinner they even gave us desert, it was awesome, recommended 100 percent, delicious food!"
        }, 
        {
            "index": 481, 
            "rating": 5, 
            "review": "Great place for a first date; nice ambiance... the music is half Indian/half American and the decor is modern and subdued. There are white tablecloths with white paper tops, and lots of booths. The menu is varied with lots of choices for vegetarians and those looking for healthy food. My fish curry had some serious capsaicin authority, and I had ordered it as a 3 spiciness on a scale of 1-10. So if you don't appreciate spicy food, order it mild, mild, mild. My vegetable samosas were spiced perfectly, but my son would have complained that they were too spicy. I really liked the buckwheat roti (like a pancake)."
        }, 
        {
            "index": 482, 
            "rating": 5, 
            "review": "Excellent service, delicious food, and reasonable prices. I kinda wish I had come for the buffet because it looks like it was enormous."
        }, 
        {
            "index": 483, 
            "rating": 5, 
            "review": "This place is great, the food was fantastic, the service very good,  you don't expect it in a restaurant that has buffet."
        }, 
        {
            "index": 484, 
            "rating": 5, 
            "review": "Have to say this food is better than Mint Indian Bistro. Sorry guys. Great great Food!!"
        }, 
        {
            "index": 485, 
            "rating": 4, 
            "review": "I ate my first plate of Indian food about a year and a half ago and it seems like I've had it at least once or twice a month ever since. The stuff's addicting, like crack well not really. Why didn't I know about Indian food when I was going to school.\n\nAnyways Delhi Indian Cuisine is the latest Indian restaurant in my rotation. It's located in a plaza on the NE corner of Flamingo and Maryland between Toys\"R\"Us and Albertsons. Of course you have to do the lunch buffet I think it was $10.99 which is about the same price for everyone else, you might find someone doing it for $9.99. The food here is delicious, not my favorite for taste but maybe a close 2nd with the other business one block over. Forgive me but I don't know what all the dishes are but I love the green stuff, the orange stuff, the reddish stuff, and the chicken stuff. Nah I'm kidding, almost but I'll pretty much eat everything they have to offer, the tandoori chicken, the chicken tikka masala, the chilli chicken, the goat curry, the saag paneer, the garlic naan, the gulab jamun, etc. Well almost everything, I still haven't tried the chow mein yet.\n\nIt does seem like it can hold a lot of people, you could throw a party,  and it has been very busy each time I've been there. They have booths and tables. Customer service is alright they do seem to be shorted handed and do take a while to do thinks like getting the garlic naan.\n\nThey have check-in offer of a free soda or lassi. Each time I've been there I've asked them for the lassi but they've yet to brought be one. Good luck on getting your. Dammit I see that a lot of you are getting yours."
        }, 
        {
            "index": 486, 
            "rating": 5, 
            "review": "Another  5 star review that everyone isn't sure of right?!\nNo, this is the real deal. The food is excellent. My wife and I had dinner off the standard menu and we asked for several dishes and we know indian food. How do we know indian? We were taught by an Indian from Goa who knew many dishes and taught us how to cook northern, delhi, goa, and southern styles. My wife has cooked indian, made the paneer, made the yogurt, crushed the spices, everything. So we know how it should taste and the regional spices.\nSo what did we try?\nWe had vegetable samosa chaat with mint sauce and tamarind d sauce. They also brought papadom.\nWe then had Rogan Josh, Navratan Korma, Goat Vindaloo, Mutter Paneer, plain parathas, and plain basmati rice. Every dish was authentic and provided in nice portions.\nThe dinner was capped by galub jaman which was very light and fresh and the syrup was light and sweet.\nIf you like indian, you won't be disappointed. If you want to try it, they will scale the heat from 1 to 10...don't be afraid it will be too hot!\nThe owners are one family from Nepal. We were served by Krishna and Ashmati who were informative and met our wishes exactly.\nI love indian food and this restaurant is incredible...please, just go!"
        }
    ]
}