{
    "category": "Las-Vegas", 
    "entity": "Paymons-Mediterranean-Cafe-&-Hookah-Lounge", 
    "avg_rating_stars": 3.744186046511628, 
    "review_count": 387, 
    "reviews": [
        {
            "index": 1, 
            "rating": 4, 
            "review": "When you are feeling awful, eat a falafel! \n\nMy husband and I get an occasional junk out craving and this is were we go. Not the best, but definitely not the worst :) This is a great place to hang out with a few friends but be aware the music is very loud sometimes. \n\nHappy Hour is 5-7pm and is only offered in the lounge area. That means you get a ton of food at a great deal! \n\nVeggie dolmas are good so is the baba, hummus, falafel...I don't care for bread (any bread) so they bring me sliced cucumbers to dip instead. \n\nWe have always had great service. I can't think of any complaints at all. They even keep an eye on our coals and are always refilling water (the tap they serve is horrible for some reason here). They check up on you without being annoying. \n\nOrder some Skittles hookah, pig out, drink some yummy tea, and relax."
        }, 
        {
            "index": 2, 
            "rating": 4, 
            "review": "My girly and I are visiting from out of town and came about seeing this place all over yelp so we had to give it a shot!\n\nThe place itself is decorated very nicely. It has loads of paintings on the wall, beautiful curtains, and is lit with extravagant chandeliers. The hookah itself is fair. The first night we came, we tried the skittles flavor which wasn't bad, it just didn't hit very hard where a lot of smoke would come out. The second night we tried the thief flavor, which was my personal favorite of the two; which again, didn't hit too hard, but did taste very good. At some point in the night, I felt we needed new coals for our hookah, and the waitress told me they don't change coals, you have to buy a new refill for coals which to me is a little ridiculous (and that's an understatement). The music they play is a combination of reguaetton, cumbia, and top 40's. I actually enjoyed the music a lot. Also, on Friday nights they have a dance floor availible. I didn't go about trying the food, but if I do come back, I might just do that.\n\nOverall; to me, this place is more bark than bite, it has a very well decorated lounge, and has fair hookah. The customer service isn't terrible, but I can see them doing more fir the customer."
        }, 
        {
            "index": 3, 
            "rating": 5, 
            "review": "I had avoided this place for a while due to the fact that my ex worked here. Well I couldn't stay away any longer and boy am I glad I decided to go back!\n\nOh have I missed their delicious wonderful food...\n\nI went here with my friend TracieP for lunch the other day, she had never been here and I finally got her to go after bragging about their Penne Pesto Pasta for months. \nSo we both ordered the Pesto Pasta and we also ordered the Athens fries as an appetizer. The fries were well seasoned and I absolutely love the dipping sauce they serve with it. The pasta was creamy goodness in my mouth by far the best pesto ive ever had just as I had remembered. \n\n*Delicious food \n*Good prices\n*Great service\n\nIf you havent tried this place please do and please order the Penne Pesto Pasta if your a fan of pesto it is mouth watering delicious."
        }, 
        {
            "index": 4, 
            "rating": 5, 
            "review": "Let me just start out by saying that I must return to purchase their seasoning for the Athens Fries!\nI was just here on friday, and Their pita is delicious, our server was friendly and helpful!\nI got the eggplant parmesan. I Liked the Penne a lot, but it was a lot of food for me. I'd maybe have preferred half the amount of penne and has salad instead, but the eggplant parmesan was SO GOOOOOD!!\nI really enjoy the atmosphere too."
        }, 
        {
            "index": 5, 
            "rating": 5, 
            "review": "Paymon's is a must visit on every trip to Las Vegas. In a sea of dining options Paymon's is relaxing with 5-star service and exceptional Mediterranean food. An extra plus is the abundant portions of food at reasonable prices. Two could very easily share an entree and still have leftovers. Best iced tea in the valley!"
        }, 
        {
            "index": 6, 
            "rating": 4, 
            "review": "Stopped in here during one of our recent (and annoying) severe thunderstorms for some afternoon lunch. Ordered the Chicken Pita with a side of rice and it was very good. The chicken was cooked just right and the flavors from the tahini and herbs were delicious. The rice added just the right touch and I even threw some in my pita. \n\nNot much else to say about the place... was my first time and due to the weather it was pretty quiet. Seems like they have a cool little bar area in the back but I did feel like they need to do a little updating of the decor in the main seating area.\n\nI'll be back for the food and hopefully some nicer weather!"
        }, 
        {
            "index": 7, 
            "rating": 3, 
            "review": "I had the gyros platter with my friend but I've now discovered that I'm not a fan of gyros. The Athens fries were pretty good, though.\n\nThe environment is dim so it's one of those.. which aren't really my thing, and they also have the lounge.\n\nMight come back in the future.. who knows."
        }, 
        {
            "index": 8, 
            "rating": 4, 
            "review": "I had seen this place for quite some time, but I had not tried it.  My mother in law and brother in law had and spoke highly of it, so tonight was our night to give it a try.\n\nIt was a bit busy, there were several big tables reserved and/or seated already, but we were able to get a table.  We started with a couple of apps, the first were the Athen's fries, it had been given many good reviews, but they were just well seasoned fries with a dipping sauce other than ketchup.  The second app was the a combination of hummus and baba ganosh, now these were both good!\n\nFor my entree I ordered Moussaka, it was a layered casserole of sliced eggplant, onions, potato, ground beef, fresh herbs and spices, covered with behamel sauce and served on basmati rice and vegetables.  I really enjoyed this.\n\nOverall, a good experience, service was excellent, the food was flavorable and met my expectations, but a bit pricey ."
        }, 
        {
            "index": 9, 
            "rating": 5, 
            "review": "Die Lage ist super. Das Essen schmeckt sehr sehr gut und die Mitarbeiter sind auch sehr freundlich. Die Atmosphäre dort ist sehr schön. Immer wieder sehr gerne"
        }, 
        {
            "index": 10, 
            "rating": 5, 
            "review": "I came for my birthday  about 2 weeks ago-I got so wasted that I really don't remember that much. I had a ball and I went to work the next day with a headache- but it was well worth it. We order a lot of food and most of it was good- mainly the chicken wings.\nO yeah i remember i was trying to get someone to taste my birthday cake---jk"
        }, 
        {
            "index": 11, 
            "rating": 5, 
            "review": "So we are in Vegas again a year later and had to stop in today for lunch. We were not disappointed.\nWe knew better that to order as much food as last time. The Farosh salad, 3 dips, and falafel pita were enough for the two of us. \nExcellent quality, probably the best Mediterranean we've had.\nKeep up the great \nWork, well probably  bring a crowd later this week or next!"
        }, 
        {
            "index": 12, 
            "rating": 4, 
            "review": "I can't say that the rating I am leaving is for the food alone, we had a UYE here tonight and had a pretty good time. A few rounds of drinks, some great Athens fries, some stuffed grape leaves and a plate of calamari later...What else can you ask for. Hmmm the mad hatter, that's what. The local hookah master took good care of us refilling our hashish right when we needed it. We went from mint to the mad hatter and I have to say, The Mad Hatter takes the cake. \n\nTonight was the happy hour in the hookah lounge and it makes it very very affordable, the decor was done well, the light is kept low and the music is turned up as the night goes on. The place has a slight clubbish vibe when it comes to the music and the atmosphere which was nice. The music was loud but not obnoxious, we could still carry on a conversation without screaming. From looking at the regular menu I can see that the food may be a little pricey when not on happy hour but this is now a Tuesday happy hour favorite for me."
        }, 
        {
            "index": 13, 
            "rating": 5, 
            "review": "Paymons is definitely my favorite spot off The Strip.  Bf n I were looking for the best hookah bars in Vegas, and we came across Paymons.  We have tried Rhumbar and Azuza also, but they just dont compare!\n\nWe arrived at around 11:30pm, and the restaurant was very empty.  The lounge was nearly full, bumpin 80s music with a live DJ.  The seats were very comfortable, bf was very happy.  The service was great too, very nice girls and friendly to all their patrons.\n\nWe just came from a concert, so we were starving.  Bf ordered the Tandoori Chicken and loved it.  I ordered the gyro plate which also came with their signature Athens Fries... HOLY MOLY forget the fries, the GYRO was awesome!  In Hawaii, all Greek and Mediterranean food is pretty standard and nothing mind-blowing.  Paymons serves a JUMBO gyro and they do not skimp on ANY ingredients.  Loved it, but I couldnt finish it.  \n\nWe read about the Thief flavor shisha, and we ordered a bowl of that.  There was margarita mixed with several other flavors.  It was tasty! We also ordered a bowl of the Cherry Bomb shisha, which I thought tasted a lot better, more flavorful.  \n\nThere was a lot of funky music playing, and the music videos for the songs were also on the TVs on the walls.  This lounge is spacious and has a great vibe, dont be shy to get up and dance! \n\nOnly thing I would have changed is to not sit near the A/C vent so I can do my smoke tricks...lol\n\nI definitely want to come back again, but with a bigger group, its a great late-nite spot to get away from The Strip and just have fun."
        }, 
        {
            "index": 14, 
            "rating": 2, 
            "review": "I was disappointed in the service, price, and food.  \n\nThe waiter never refilled our drinks, which were completely empty, and never took away our empty plates.  \n\nAll of the pita sandwiches come in a paper bag to help them from falling a part.  The bag just made it seem cheap and reminded me of a fast food restaurant. Plus the bag did not prevent my pita from falling apart, and I ended up having to eat it with a fork and knife.  \n\nThere are no lunch specials, so expect to pay full dinner prices.  The pita sandwiches, which are close to $10, do not come with ANY sides and fries are extra."
        }, 
        {
            "index": 15, 
            "rating": 3, 
            "review": "Paymon's (on Sahara) has gone from being a \"treat\" to more of a stand-by neighborhood restaurant, as my wife and 2 kids (10 & 7) enjoy ethnic and different places to eat.  And, what used to look like a pretty daunting restaurant (I mean, with the Hookah Lounge tag on the name and the rather imposing storefront), has become like a coffee shop or diner for us...and that's mostly a good thing.\n\nI like the huge menu, and the ability to pick from Italian, Persian, Greek, and Indian (albeit only 3 choices) selections.  On Wednesdays, it's 25% off your entire tab, a great value!  Not being subscribers of local papers and always tossing out the ad-paks that come in the mail, I haven't seen all the 'coupons' mentioned by others.  So what about the food?\n\nDecent job of the Chicken Curry - and the spice-to-taste option is great.  My 10-yr old enjoys it mild; I love it spiced to the max!  She wishes they put potatoes in the curry, but with the wonderful rice-bed that the curry sits on, I think she can live without the potatoes.  Maybe some veggies (besides the cursory onions) would make it a little more interesting, but hey, this isn't the Red Velvet Vegan Cafe (just down the street a bit).\n\nPaymon's Greek platters are also good - Gyros platter, Baked Kibbe platter, etc.  I wish the Kibbe wasn't quite as \"moist\", and retained more of the beef texture, but it's still quite good.  I think the Athens Fries is a bit overrated - a little too salty for my taste.  I also enjoy the Fesenjan (Chicken breast cuts in a slightly tart/sweet yummy pomengranate sauce), but it wasn't to my wife's liking.  Your experience will very much vary depending on how you take to the specific spices used in each dish, so ask the server to elaborate.\n\nThe service is good, almost family-like, unless they are packed.  Then, a certain level of panic seems to set in, and it becomes hard to flag down your server.  Funny - I still like restaurants where the person who took your order is the same person who brings your food.  Sometime about 10 years ago, I think most \"big box restaurants\" adopted a serving method where someone more junior and less experienced than the person who took your order always brings out the food...and you lose the chance to question the food at the moment it arrives.  That is definitely a pet peeve of mine...especially when your original server who heard your specific requests doesn't come around until at least 5-10 minutes after another person has dropped the plates of food in front of you!  Annoying!  BUT...this doesn't happen at Paymon's!\n\nPortions are large enough that I don't recall having room for dessert yet at Paymon's.  All in all, Paymon's is a handy restaurant to have close by.  They stay open to 11 pm every night, so no rushing down by 8 pm to try and make it.  Since our family has no interest in the Hookah Lounge, we don't even see the area to the left of the entrance.  The atmosphere inside is a slightly cheesy cross between Istanbul and the Taj Mahal, but it's not overbearing, and kind of grows on you.  Those who tend to always be cold should bring a sweater...unless you're going to be eating the extra-spiced version of the Chicken Curry!"
        }, 
        {
            "index": 16, 
            "rating": 5, 
            "review": "My husband and his best friend went up to Vegas this past weekend and came across this place. Jessica took very good care of the guys giving helpful recommendations. Calamari was amazing. Hookah was amazing. Food was amazing. Food was amazing. He sends love to Jessica from LA for a great night!"
        }, 
        {
            "index": 17, 
            "rating": 2, 
            "review": "I have eaten at Paymon for many years.  the food there used to be great. I ordered a gyro and spicy fries. The spicy fries were delicious but the gyro was horrible the pita was hard the meat was cold that was too much lettuce and tomatoes in there not enough sauce. The service was phenomenal she was a great waitress"
        }, 
        {
            "index": 18, 
            "rating": 4, 
            "review": "I have been here a couple of times for dinner, hookah or both. The food here is reasonably priced and well seasoned. The lights are dim so it gives it a lounge feel, the music is nice as well. The staff have all been friendly and helpful. Some of the food items include: Kebabs, hummus, gyros, calamari, lamb, baklava etc. There is not a good selection of wine so I prefer having their teas which are phenomenal. The rice pudding is excellent as well. \n\nThis is a a Middle Eastern restaurant you must experience."
        }, 
        {
            "index": 19, 
            "rating": 4, 
            "review": "This is always one of my go to spots for happy hours. The prices are super cheap and the food is great! Their happy hour goes late too, 4-7 pm which is great for people who tend to work late like me. This location is also much bigger then the Maryland one which makes it easier to find a table. \n\nOn my most recent visit I decided to go with the traditional hummus, stuffed grape leaves and dolmas. I liked the hummus but felt it could have been a bit for flavorful. The dolmas and grape leaves however were great. The flavors are bold and nicely complimented with a gyro type sauce. I also recommend trying the fries and calamari here!"
        }, 
        {
            "index": 20, 
            "rating": 4, 
            "review": "On a split decision place to go for happy hour, my fiance and I went to try out Paymon's. It was an excellent choice. The drinks are heavenly and being a bartender myself, that is a huge compliment. The happy hour prices are great and the appetizer quite delicious. We will definitely be going back soon."
        }, 
        {
            "index": 21, 
            "rating": 5, 
            "review": "Love, love, love this place!\n\nI was lucky enough to be invited to my first UYE (Unofficial Yelp Event) at Paymons.  Lots of good eats, great conversation, service and atmosphere.  The perfect mix of Greek, Indian, some Italian and I loved that there were a ton of Vegetarian options!\n\nAppetizers:\nI had the infamous Athens Fries, which lived up to their reputation.  The spice really added to the fries and the sauce was delish.   I kept trying to figure out what was in the sauce as if I were at a wine tasting.. lol..  never did figure it out, but well worth it!  \nThe hummus with pesto sauce was bomb.  Adding the pesto sauce probably took away from the healthy factor, but, when in Rome...\n\nEntrees:\nI ordered the Chicken Curry (mild) and my other half had the Chicken Tandoori.  The flavors were perfect and not overly spicy.  We were both part of the clean plate club.\n\nUnfortunately, I didn't leave room for dessert.  I highly regretted this when I got home.  Next time, I must indulge.  Mama's Baklava is calling my name.  \n\nAs far as drinks, they had a great wine list, a killer margarita and their unsweetened tea was so good, it was almost as if it were sweetened.  As a southerner, I'm not a fan of iced unsweetened tea, but they make it work!  There were also a variety of warm tea to choose from.. Lots of green tea, Mango, Earl Grey, Spiced Chai, etc..etc..  A perfect way to end a meal!\n\nThe service was perfect!  We were a large party (around 20 peeps) and I don't think there was a single hiccup.  I was also impressed with how the server was able to effortlessly split about fifteen different tabs.  If only I could remember his name!  Shame on me.\n\nI didn't check out the Hookah Lounge; Shisha tends to give me a headache.  Maybe next time.\n\nGreat food!  I'll be back!"
        }, 
        {
            "index": 22, 
            "rating": 4, 
            "review": "This is a restaurant with a variety of well-done ethnic dishes including Greek, Italian, Indian and vegetarian.  I like the combination plate and the lamb kabobs.  Great hummus, gyros, lamb burgers, falafel, curry dishes, pita bread, pasta, fries and grape leaves.  The service can be inconsistent.  They have a great tea selection including Moroccan mint and a chai tea.  On Wednesday you get a big discount for locals night.  This restaurant has been around for a while and is consistent."
        }, 
        {
            "index": 23, 
            "rating": 2, 
            "review": "I went with 4 girlfriends and we sat in the lounge. We ordered several combo platters and entrays as well as a hook and cocktails. The food was good but the service was rediculasly horrible. It took forever to get a drink and forget about water or even getting an extra napkin. There was 1 (yes you read correctly 1) waitress/ bar tender for the whole lounge on. Which wasn't terribly crowed but not empty either.  I ended up busing our table after having it be full of dirty dishes for over a half an hour. Can't say I would recommend this place or be back my self and the only reason I gave it two stars was the food was acceptable."
        }, 
        {
            "index": 24, 
            "rating": 4, 
            "review": "We visit both Paymons locations equally since neither is close to us. The best part is that we get the same delicious food and great service. So, it's really a matter of where we are when we get that Mediterranean craving and we love Paymons.\n\nMy favorites:\nCombination Platter ($13.95)\nMoussaka ($13.95)\nBroiled Kabob Trio ($20.95)\n\nAll of their flame-broiled meats are packed with flavor and so very yummy with their basmati rice and house salad. I love the trio platter since it comes with three types of meat that are cooked with different seasonings (I hate to decide and I just love the variety). I feel the same way about the Combination Platter. It comes with EIGHT different items! It's the best dish to order if you want to try multiple specialties or just sharing with the table. My favorites on the platter are the Athens Fries, Falafel, and Baba Ganoush.\n\nMore details on my review of Paymons' Maryland Pkwy location: http://www.yelp.com/biz/paymons-mediterranean-cafe-and-lounge-las-vegas?hrid=vE7m76ZKe_7-WRh_qFeGGg&utm_campaign=www_review_share_popup&utm_medium=copy_link&utm_source=(direct)"
        }, 
        {
            "index": 25, 
            "rating": 5, 
            "review": "We celebrated my daughter and my birthday on Friday January 13th. What a great night. The girls were wonderful. What great friendly fast fun service."
        }, 
        {
            "index": 26, 
            "rating": 4, 
            "review": "Fun hookah bar, with a classy atmosphere. The food is, in my opinion not amazing, but it's pretty good, and I come here mostly to smoke and drink and maybe have a little hummus snack. Come here on happy hour between 5-7, ALL hookah, drinks, and some appetizers are 1/2 price. I like this place for larger groups."
        }, 
        {
            "index": 27, 
            "rating": 5, 
            "review": "The Gyros here are fantastic and the service is always exceptional.  We usually go for lunch about once a month and are never disappointed."
        }, 
        {
            "index": 28, 
            "rating": 4, 
            "review": "It's a great place to have some traditional Mediterranean food and the service was excellent. I would recommend anyone to come here"
        }, 
        {
            "index": 29, 
            "rating": 4, 
            "review": "Been here a half dozen times. I've tried the Mediterranean food, but actually prefer the Italian food here. Usually here with friends, but came alone a couple of times and still had a good time. Don't know why, but the place reminds me of Firefly minus the crowds and minus the tapas. Hookahs not bad and the food/drink prices pretty damn good. One time a group of 9 of us, total bill (food, hookah, and drinks) was less than $250. Can't beat that.\n\nStaff is great, very attentive."
        }, 
        {
            "index": 30, 
            "rating": 4, 
            "review": "Given the close proximity of Paymon's to me, I'm a bit embarrassed that I'd never been. The hostess was unfriendly but, lucky for her, I was distracted by the restaurant's decor. Big. fan. For my 1st time, I was pleased to be there during the sweet-spot of the evening where I got to see what it was like with all the natural light from the skylights then the dim lighting once the sun set. The chairs were a pleasant surprise- they have a little give when you lean back in them. Über comfy. Unlike the hostess, our waitress was very friendly. We ordered their fries & mozzarella sticks for appetizers- not a single complaint! Later, with our entrées, we had some sides of tzatziki that I enjoyed dipping the fries in more than the standard sauce. I ordered the beef kabobs, at the recommendation of our waitress- it came with a small side salad & basmati rice. All very tasty! My g.f. got the gyro salad with a side of tzatziki, in addition to the dressing- I had a nibble of the salad & would definitely order it. Because I fell in love with the baklava, on a previous Yelpventure at Petra, I HAD to try Paymons'! Obviously, now I think I'm an expert &, in my expert opinion, the baklava at Paymon's is good but Petra's could take it out to the monkey bars & beat it up. Even so, I'll absolutely return to Paymon's & I'll probably even save room for dessert."
        }, 
        {
            "index": 31, 
            "rating": 2, 
            "review": "The food here is really great. This WAS our favorite Greek restaurant. One night during dinner, at a table in our clear view, was a girl smoking hookah and drinking. Annoying,  obnoxiously loud and becoming more & more intoxicated with every moment. Eventually, as we we're eating our lovely dinner, she vomited all over her table. Ran to the bathroom, also in our view, and continued to vomit there. Maybe it was the hookah or the drinking or the combination of both, but she ruined our dinner and we never went back. It's literally been 3 years. We were just saying how much we missed that place but I can't get that image out of my head. Yuk! Sorry. The Maryland parkway location is way too far to travel to."
        }, 
        {
            "index": 32, 
            "rating": 5, 
            "review": "Great restaurant. I have been a customer there for years. The quality is superb, the prices are great and the food is always fresh. One of my favorite places to eat!\nCarolyn Vanzlow"
        }, 
        {
            "index": 33, 
            "rating": 3, 
            "review": "Dropped in here Friday night around 8pm for another Hookah session with my friend. I've been to Paymons several times in the past.\n\nTonight it was a bit loud, with a large group nearby who were basically yelling because the music was a bit too high. The music was electronic, and for the first hour it felt like the same song, over and over and over again. Drop the volume level and pick a new song....geez. Eventually some DJ came on and the music got a little better, but by that time we were just about to head out the door.\n\nService is good, shisha is good...not as many varieties and flavors as Azuza. Paymons is a nice spot to hang out and enjoy a little smoke. They might be the only place on the westside that offers Hookah and serves alcohol, as all the other places we searched did not offer booze."
        }, 
        {
            "index": 34, 
            "rating": 5, 
            "review": "I make it out to Paymon's about once a month and have always been extremely pleased. I found this place originally because it came up high in a Google search result by zip-code for Vegan restaurants.\n\nThe menu is an interesting and very unique \"fusion\" between several different cultures, and is so varied you could come in 100 times and have 100 different meals before you run through all the options.\n\nAlthough I don't make it to this part of town very often, when I do come in, almost every time there is at least one staffperson who remembers my name and my meal choice (I'm one of those guys who goes to a few select places and orders the same thing every time).  Impressive because I'm not exactly Norm at Cheers when it comes to this place, and it shows they make a genuine effort to appreciate customers.\n\nWhenever I have visitors in town, I try to bring them here if time or schedule permits."
        }, 
        {
            "index": 35, 
            "rating": 5, 
            "review": "This is my favorite Paymons.  It's got easy parking, good location, and great food and tea.  It is just a bit nicer then eh one on Maryland parkway.  The Hookah lounge is also more swanky and tons more spacious.  \n\nMy favorites are the veggie combo platter or the kabobs.  The baba ghanosh and falafel are great.  The Athens fries are spectacular, I don' t think I have had any bad food at Paymon's."
        }, 
        {
            "index": 36, 
            "rating": 5, 
            "review": "Paymon's is a LV Institution!  They've been doing the Mediterranean thing longer than anybody else in town.  I've NEVER has anything less than EXCELLENT food, STELLAR service and a TREMENDOUS value.  We went on a whim last Wednesday, unaware that they have 25% off on Wednesdays.  25%!!!  What a steal!  We had a HUGE meal for under $30 (tax & 20% tip included)!!!!  Keep up the good work Paymon's Fam!"
        }, 
        {
            "index": 37, 
            "rating": 4, 
            "review": "One of the best happy hours in town! Delicious drinks, food, & hookah. The lounge part of the restaraunt is done so well with tapestries hanging fromThe walls to lighting that gives you a whole different experience. Let's be real though. We all know what's good\nTheir... Two words: Athens Fries. Holy cow. Get one for\nYourself and do not share. Not\nEven with your Grandmother. Ok maybe her, but that's it. I would also recommend trying their baklava & Eggplant Parmesan. Simply delicious. The baklava is some of the best I have ever had. It's light and flakey and not too sweet. The staff is also excellent. Always welcoming and take care of you very well. \n\nMy Tip:\nHappy Hour is the way to go. Everything is half off!"
        }, 
        {
            "index": 38, 
            "rating": 4, 
            "review": "We all could use a little happiness in our lives and I tend to be a little bit happier between the hours of 4pm-7pm everyday. The only requirement is that you sit in the lounge. Besides that, Paymon's has a ridiculously large array of finger foods and drink specials. \n\nAll of their specialty cocktails, wines by the glass, and mixed drinks are half off. $4 will get you a Babylon Spice. One cannot go wrong with a mixture of ginger and coconut milk. It is rather heavy and I can only drink one before going to something else, but it is a nice starter drink. \n\nThis night, my friend and I ordered the falafels, dolmas with meat, Athen's fries (or better known as crack fries), babaganoush, and a pesto pizza with mushrooms and bell peppers. A few drinks and all of this food only came out to $28. We were still able to pack up a box to go. \n\nBesides all the food and drinks specials, they do half off of hookah as well."
        }, 
        {
            "index": 39, 
            "rating": 5, 
            "review": "I read some of the negative reviews and I'm convinced they must have had an off night. The service was excellent. The atmosphere is very laid back and relaxed, and the food was phenomenal!"
        }, 
        {
            "index": 40, 
            "rating": 2, 
            "review": "I've been going here for years and used to love the place and the original on Maryland Pkwy! However, the wait staff is mediocre now and the food portions are getting way too small and the prices way too high!\n\nOrdered hummus and it covered the plate but you could've read a newspaper through it and my gyro had about 1/2 the meat it used to. We haven't been very satisfied the last few times we've been here and the food's way overpriced, $9 gyro and $14 salad (add chicken)?!?! We won't be going back."
        }, 
        {
            "index": 41, 
            "rating": 1, 
            "review": "There is no one greeting or servicing, we had to walk all the way to the bar to find someone working there, and he just couldn't find time to help us to even get seated... Maybe there were other waiters/waitresses around the bar while we were there, but they were enjoying themselves like they were the customers. We walked away. We came here to smoke hookah and enjoy our time, not try to play hide and seek with the waiters."
        }, 
        {
            "index": 42, 
            "rating": 4, 
            "review": "Paymon's on Sahara is a really cool space. I have only had some appetizers there because I always go to the lounge but I've heard the food in the main restaurant is amazing as well. I'm mainly focusing on the lounge area which is separated from the main area. There are plenty of seating tables for a group of friends to chill on couches, get some great drinks, and listen to cool music (mix of hip hop, to club, to even some dubstep when I was there). There is a heated patio area also very nice to get away from the music to have more intimate convo's. Inside has a real bohemian type of feel with cool drapery as well as hookah available.  It's a great place to chill with friends, maybe even a date when you want to avoid the strip. The only reason I didn't give a 5 star is because I have not tried out the entire restaurant yet soooo I need to go back soon and so should you!"
        }, 
        {
            "index": 43, 
            "rating": 3, 
            "review": "1 star for the food, 2 stars for the atmosphere and service. \n\nThe meat in the gyro I got was kind of chewy and not very fresh, and they piled all the lettuce and veggies at the bottom half of the pocket pita and the meat on the top.  Obviously that detracted from my gyro eating experience.  This pretty much sums up my feelings about that: \n\nhttps://medium.com/@luckyshirt/dear-guy-who-just-made-my-burrito-fd08c0babb57\n\nThe fries were okay, not blow my mind amazing....just really seasoned...\n\nOverall, overpriced and kind of meh. \n\nI'd prefer to go Yassous, the food is way fresher there, the portions and value is better."
        }, 
        {
            "index": 44, 
            "rating": 3, 
            "review": "This is my friend's favorite restaurant so we gave it a try last night. The hummus was delicious and the spinach pie *(spanakopita) was very good but the side of stewed vegetables were awful and the rice seemed ill matched in our opinion.  We had horrible service sitting outside because we were the only table and would strongly suggest sitting inside where there is really good atmosphere.  The menu had a Greek section, Indian Section and Italian.  We only had Greek food but our server said the Curry is excellent. I would return but only for lunch or takeout and would try the kabobs like my friend recommended and the hummus appetizer. I'm sure they have some other great options but I have a feeling the menu is hit or miss, it's hard to do everything well. This would be a good inexpensive place for a large group and it's super casual."
        }, 
        {
            "index": 45, 
            "rating": 5, 
            "review": "We had an awesome evening at Paymon's. The hookah was great and the food was amazing. We had the chicken curry and it was better than most of the indian joints we go to. Great drinks and in a great chill spot. And of course Mymy our server, was the super good to us. Thank you!!!"
        }, 
        {
            "index": 46, 
            "rating": 3, 
            "review": "The hookah lounge has a great atmosphere. If you come during happy hour they have good specials on drink food and hookah. The service is generally pretty good in the lounge as well. Ask for the great white buffalo hookah (it's not on the menu). \n\nThe restaurant's service is pretty bad, but I come back anyways because the food is really good. You MUST get the Athen's  fries. The sauce is so good. I always get the chicken pita. Their tahini is really good as well. They have Italian food on the menu too."
        }, 
        {
            "index": 47, 
            "rating": 3, 
            "review": "Dinner is ok. Lunch, they don't have the same specials like the other location on Maryland. If I had my choice, I'd rather go to the location on Maryland but this one is closer to us. \n\nPersonally, even if the food is ok, I'd rather go to Khourys. Food is much more flavorful and selection is better."
        }, 
        {
            "index": 48, 
            "rating": 4, 
            "review": "This is one of my favorite restaurants. The food is phenomenal, the atmosphere is cozy and it's a great place to hang out with friends. My only complaint is that the service is always so slow. It takes at least twenty minutes after asking for them to bring your check, and my glass is often empty.  If you're not in a hurry this place is good. The hummus is some of the best I've had. Also, their Athens fries are addicting!"
        }, 
        {
            "index": 49, 
            "rating": 4, 
            "review": "Went there for lunch and got the lamb burger.   It was well cooked and tasty.  It came with fries that were well seasoned also.   Got the fried cheese thing as an app and it solid.  Overall good dining experience.   The place was pretty empty and the servers were attentive and on point.  The prices were reasonable for a sit down Greek restaurant.    Probably wouldn't go back because I'm cheap, it's far from me, and my friend paid because it was for my birthday but I would recommend it if you're close and don't mind your meal being a tiny bit pricey."
        }, 
        {
            "index": 50, 
            "rating": 5, 
            "review": "Great food - love their Mediterranean dishes. We always go as a group and share plates so you can try a little bit of everything. Cool atmosphere too. Wednesday is their best night to go - 25% off your entire bill from 5-9pm."
        }, 
        {
            "index": 51, 
            "rating": 4, 
            "review": "I have ordered the same entree -- chicken kebab -- for years. It's always been exceptionally delicious. As far as middle eastern food goes, this place is highly recommended."
        }, 
        {
            "index": 52, 
            "rating": 3, 
            "review": "This is another place that the company eclipsed the food, IMO...Wifey and I split the Lamb Burger and Athens Fries which seems to be a favorite among lots of reviews.\n\nI also ordered a Falafel gyro because I haven't had a good Falafel in a while. Don't know if the size of our party was a concern, but when our food arrived, it looked good, but sadly, the taste fell short. The burger itself was pretty good, but the bun was pretty hard, a sign of it being toasted WAY ahead of time. Same with the Falafel, it had a thicker than usual crispy shell(little too long in the fryer?) and was just okay.\n\nThe Fat Greek serves up a much tastier Falafel Gyro, as well as the ones at Amena.\nYou want \"crack\" Fries? Head down to Greek Bistro in Henderson and taste them for yourself...ALOHA!!!"
        }, 
        {
            "index": 53, 
            "rating": 3, 
            "review": "Hookah lounge so good. One time they ordered too many chicken wings and had a special rotisserie-cooked wings. They were so good. I don't even eat chicken ... \n\nThe food is decent. I can't imagine its too authentic. The seasoned fries are great, though. \n\nThe apps are a nice accompaniment to the smokes. A bowl is ~$15 and a refill is like ~$8 I think. They have a variety of flavors. I remember when the whole no smoking where food is served thing was around. Paymon's complied for a sec, but then reverted back. \n\nSometimes we get picky about how hot the coal is or how the shisha is burning, but the smoke boy comes around and makes it all better. \n\nThe drinks are okay-priced. If you ask for a water, they'll give you a tiny Fiji for like $5. I think the food prices are reasonable, though. Get the app combo platter (classy, huh?) for $11 to feed a non-ravenous group of three. Baklava and rice pudding are vera nice. \n\nOn the weekends, the lounge fills up. I've seen the restaurant side get busy, but not packed. The lounge is open late, but not late enough. 1a every night. \n\nThe lounge is lowkey and chill. Its perfect for the nights you want to get out of the house, but not deal with the crowds or yelling over loud music. Sometimes they play Middle Eastern jams. Sometimes its like club electronica. \n\n* off the strip, non-casino"
        }, 
        {
            "index": 54, 
            "rating": 4, 
            "review": "Now, this was some good 'ish! Got there kinda late and accidentally walked into the Lounge part, which neither of the entrances weren't clearly designated, so it was odd. Service was GREAT, quick and super friendly. Portions are pretty big and they Gyro sammy was DEEELISH!"
        }, 
        {
            "index": 55, 
            "rating": 4, 
            "review": "I've been to Paymon's once for dinner, and had some really good food so I fully intend to return! What really won me over was the Saganaki, aka, greek salty cheese flambeed with Bacardi rum and finished off with a splash of lemon juice. Oh my god, this appetizer alone is worth 4 stars!!!! There are no words for how amazing this was. We also had the warm dolmas, the Pastitsio (another must try), and the gyros platter. I left there pretty full and happy. Delicious!!!"
        }, 
        {
            "index": 56, 
            "rating": 5, 
            "review": "Paymon's was so good that my kids said it's one of their fave restaurants!  The kebobs were great, the chicken pita is fantastic, and the salads too!  However, 2 items on this menu are mind blowing, the gyro, and the fries!  The fries are in a league of their own in the french fry world, I almost don't order them because I know I will eat way too many, but I always get them anyway!!!"
        }, 
        {
            "index": 57, 
            "rating": 2, 
            "review": "I absolutely love the Sahara location during the day time but at night it's like a mini club. Drunk girls everywhere lol. It's soooooo crowded and the service sucks (in the lounge are) this rating is based on the lounge from 5-whatever pm. Our food was so terrible, the pesto pizza was cardboard and our chicken fingers weren't even cooked all the way! I was soooooo upset we literally told the server and he didn't even do anything but give me the bill... Service at its finest... I'll probably stick to the Maryland location or come during the day."
        }, 
        {
            "index": 58, 
            "rating": 4, 
            "review": "I LOVE THIS PLACE!!!!!!!!!!!!!! Both locations are great, but I prefer the west side. They have over 20 vegetarian selections and I gotta tell you I am a creature of habit and I would eat here every day if I could. They have some of the most amazing salads, try the Bruschette Salad and the Athens Fries are amazinggggg."
        }, 
        {
            "index": 59, 
            "rating": 4, 
            "review": "Delicious \"crack\" fries, great gyros, and other meats.  Service was a bit slow, but nice place."
        }, 
        {
            "index": 60, 
            "rating": 4, 
            "review": "This place is good. There are great hookahs there. I recommend the frozen thief or frozen skittles. And if Randy is working, he is great at creating custom combinations.\n\nI can't give it 5 stars because of the price, $20 seems a little to high for hookahs.\n\nHowever, if you go on Tuesday nights, hookahs and drinks are half off. If you're in summerlin, this is the perfect place to go on Tuesday nights.\n\nAlso try the flaming saganaki, it's delicious (though it's weird my browser/Yelp thinks saganaki is a misspelling)"
        }, 
        {
            "index": 61, 
            "rating": 5, 
            "review": "This is the first time I have been to Paymon.... Second time having Greek good in vegas. I have to say this rivals the Greek food I used to get in New York. The falafels were seasoned just the way I like them, the sauce made it slightly sweet and tasted like it had a hint of cinnamon, the sauce went perfect with the falafel. The gyro meat was tender, flavorful and not in the least greasy, it was exactly how it should be. Plus they have a ton of vegetarian and vegan options it seems, I feel all the vegetables we got were quality and deliciously fresh. My boyfriend raved over the Athens fries, they were quite good!"
        }, 
        {
            "index": 62, 
            "rating": 5, 
            "review": "Great food, excellent hookah! What more could one want?!?! Try the three meat plater!"
        }, 
        {
            "index": 63, 
            "rating": 2, 
            "review": "The food is good. The ambiance is good. But they always seem to be understaffed and it takes FOREVER to get food, drinks and hookah in the lounge. It took 20 minutes to get a beer after I ordered it. And I saw it sitting on the bar for 15 minutes before someone picked it up and brought it to me. I really really want to give a higher rating but the slow service is tough to swallow."
        }, 
        {
            "index": 64, 
            "rating": 4, 
            "review": "Place is so gooooooood. skip the hummus though it's really bland.  gyro platter a+, service is hit or miss.  their passion fruit ice tea is delish.  My friend's husband is British and swears by their curry dishes. \n\nThey have Greek AND Italian food AND some Indian Curry, so lots of menu selections. Sandwiches and salads are large too.\n\nBUT my favorite thing is their hot sauce. It's like Tabasco, but BETTER. They make it in house I swear we go through 1/2 a bottle each time we are there!"
        }, 
        {
            "index": 65, 
            "rating": 2, 
            "review": "I used to love Paymons. Service on this location is a miss and hit. Tonight's experience was not a good one.\nWednesday night 25% OFF \n- Arrived 10 min before 5pm they say they would send a server at 5. \n- 25 min go by and no one comes to check on our table. Another guests sitting near were also getting impatient \n- One more table gets seated, I finally go ask the host to either send a server or move us to a table where the server would come and actually take the order.\n- Finally a server shows up and apologized she wasn't aware we were waiting... Hmm strange? 4 tables totally unattended for 20-25 min.\n-Last table gets seated gets their order placed and sure enough they get drinks and food before us. \n- Another guests get upset and leave. 5min later the server comes with the drinks and at this point I tell her what was going on.. I said we've been waiting for so long and the last table gets served first obviously someone will get pissed.\n- Another server comes not sure if it was the supervisor apologized offered to comped our appetizers... Blah blah \n- 45 min to get our food when the bill comes, I can't help to notice the appetizer wasn't comped. No reason to bring this up. I'm actually just impatiently waiting to pay and leave. \nThis people don't really know how to treat and keep your long time clients happy. I've been coming to Paymons for at least 8 years and is disappointing how the service has gotten this way.\n- Honestly for being Wednesday night it wasn't even that busy. But two slow servers for the whole place..?"
        }, 
        {
            "index": 66, 
            "rating": 5, 
            "review": "I love this Hookah lounge & restaurant! The hummus and chicken were really tasty! The lounge is nicely decorated and the staff was friendly. Plus, after going to Men of Sapphire and paying $15 for a beer it was nice to pay $1.50 for blue moon. So if you have some extra down time in Vegas and want some good middle eastern food then I would make the trip."
        }, 
        {
            "index": 67, 
            "rating": 2, 
            "review": "Mediocre.  Too much quantity over quality. And whats with the HUGE beverage glasses. Waitress didn't know much about the food. Have to say tho', had a better experience at their location near Las Vegas airport."
        }, 
        {
            "index": 68, 
            "rating": 5, 
            "review": "If you haven't been fortunate enough to experience Paymon's you are really missing out.  The Food is great, the atmosphere is laid back and relaxing, and the service is always top notch!  Oh and don't forget to stop by the lounge.  A wide selection of Hookah and some really interesting Speciality Cocktails.  Paymon's is always a great time for me and my friends!"
        }, 
        {
            "index": 69, 
            "rating": 5, 
            "review": "Another place that i MUST visit everytime I'm in Vegas!!  stumbled across this place one day looking for a lunch spot before a massage.  My best friend and I went in and were greeted by a very nice gentleman who seated us in their dining room and began to discuss middle eastern culture and food... they had a beautiful hookah room separated from the dining area decorated with gorgeous pillows and couches where you could have hookah and listen to soothing music.\n\nThe food was amazing... as if my grandma was in the back kitchen herself making the grape leaves from scratch!  They were so good i was tempted to order a second dish of it... we also shared a panini and fries that were off the hook!  Salad was also yummers!! \n\nThey have weekly food and hookah specials and are also known for their array of spices which they also sell online.  Very authentic place... I also wish they had a location in LA closer to me. :)"
        }, 
        {
            "index": 70, 
            "rating": 2, 
            "review": "So, I'm a hookah fiend. I have one at home and probably smoke it almost on a daily basis. My friends have hookahs so I can smoke it their houses. All in all, everyone I basically know has one and we always smoke it together whether just to chill or when we have a pahteeeee. \n\nI started coming to Paymon's years ago. The hookahs were always real good and didn't taste burnt. The guys would come around to make sure the hookah was still hitting well and constantly replaced the coals. The happy hour all day Tuesday was the best with half off hookahs and lots of drinks to choose from.\n\nNowadays, I hardly ever go here, because the hookahs are always burnt and die really fast. The service is lacking now - I literally have to wave my hands in the air and do a little dance to get someone's attention. The drink refills dont come fast anymore so I'm always contemplating if I should just order two drinks instead of one. \n\nI used to like the other location on Maryland Pkway better, but I always came here due to distance. The other location is just the same now - the hookahs arent's as great. I'd advise you to just smoke at home where you'd get the best service haha"
        }, 
        {
            "index": 71, 
            "rating": 5, 
            "review": "I love the ambiance here. Our waiter, Matthew was great at letting us know their vegan options. They were so accomodating with substituting various items in the Combo Plater to make my meal vegan.  \n\nHere's a few vegan friendly items on the menu:\n+ Falafel\n+ Athens Fries (without fry sauce)\n+ Tahini dipping sauce\n+ Lentil soup (yummy)\n+ Hummus (without pita)\n+ Baba ghanoush"
        }, 
        {
            "index": 72, 
            "rating": 3, 
            "review": "We had my sister's 30th birthday here with a dinner for about 30 friends.  The service was exceedingly slow.  I think they only had one waiter working each table, which was a mistake.  The food itself was competent, but nothing to rave about.  I got the chicken parmigiana, and also tasted a greek lasagne type dish.  I am willing to go again, and mark the poor service down to a large group poorly managed."
        }, 
        {
            "index": 73, 
            "rating": 4, 
            "review": "We went here on a Saturday night around 8:00 PM. \n\nFor appetizers we got hummus and bread. HOLY HUMMUS!!! It was delicious!!! If it wasn't for the pita bread I would have spooned the hummus into my mouth. \n\nI forget the complete description of my entree, but they should have just called Salmon marinated in heaven with rice. The salmon was cooked and seasoned perfectly. The ultimate flavor party came when I made little sandwiches from pita bread, salmon and rice. WOW. \n\nThis is great Mediterranean food."
        }, 
        {
            "index": 74, 
            "rating": 4, 
            "review": "After visiting various hookah bars since the ripe old age of 18 I can definitely say that Paymon's is by far the best I've been to.\n\nThe decor is awesome, Mediterranean themed with a very relaxed atmosphere. The comfy bench seating and throw pillows always make me feel at home. The only think I don't like is the tables and chairs made for little people. I am 5'10\" and the boyfriend is 6'5\" so when we go with a group of friends it is always a bit cramped. However, when it's just me and him we spread out comfortably. \n\nThe hookahs are always smooth and tasty, at $15 each it doesn't get any better. I have tried hookahs at bars and clubs in town and they were no where near Paymon's standards and are usually double the price! \n\nThe food is pretty good as well, I am not much into Mediterranean food except maybe hummus. The pesto hummus at Paymon's is delicious! You cannot go wrong with their \"Athens Fries\", the spices that they use to season the fries are out of this world! The drinks are so/so every specialty drink I have had has been overpowering or not the right flavor combinations so I stick to beer or pellegrino most of the time.\n\nThe service is hit or miss, sometimes it is excellent and other times we are waiting 45 min for a hookah or 30 min for drink refills. I guess it depends on who serves you. \n\nPaymon's happy hour is one of the best in town with $7.50 hookahs and half off drinks and appetizers. Tuesdays are locals nights where happy hour goes from 5pm-1am, just make sure you get there early since the place fills up fast!"
        }, 
        {
            "index": 75, 
            "rating": 4, 
            "review": "Our friends decided to meet up for dinner and it was my first time here.  I didn't try the hookah as but my friends always enjoyed this part of the lounge before going to the dining area.\nGreat mediterranean food & service!  Definitely will be back here!"
        }, 
        {
            "index": 76, 
            "rating": 4, 
            "review": "I've never been to the Hookah lounge but the dining area has great decor. Very unique and vibrant. I went to this location at and odd hour on a Monday. It was about 2:30 pm. There was only one girl working the floor, the host stand and answering phones; a bit odd I thought. Doesn't make for great customer service BUT to be fair she did a good job and we never felt ignored or abandoned with empty glasses. \n\nThe food as usual, is good. Their lentil soup and Musakka are my favorite."
        }, 
        {
            "index": 77, 
            "rating": 2, 
            "review": "I've always been a huge fan of supporting local businesses. Paymon's being one of them, but after last night I'll think twice about coming here. \n\nFirst and foremost I may say Paymon's has an excellent happy hour. The service is usually terrible in the lounge area but we deal with it because it's a pretty awesome atmosphere. Being huge fans of Hookah and living in Summerlin, this location is usually our go to spot when we don't want to drive all the way down to The Olive Hookah Lounge. Food wise, the hummus and the stuffed grape leaves are awesome! The fries are so good that I have to talk myself out of getting them most of the time haha. Hookah wise we love the peach flavor.\n\nNow for last night...  We came in with a few friends and I was wearing a Chargers baseball cap. The waitress (after taking our drink orders) told me I was not allowed to wear a hat. Now the very last time we came in I was wearing  the exact same hat. Very confused I asked her what the issue was. She said there were no hats allowed in the restaurant / lounge. Now I find this pretty insane. We are long time paying customers of Paymon's and I was being asked to leave over wearing a sports team baseball cap? I'm still pretty taken back by this, even now. We all ended up leaving and I probably won't return. It's such a shame."
        }, 
        {
            "index": 78, 
            "rating": 5, 
            "review": "Excellent service and wonderful food. The Babylon spice is dangerous; bring a designated driver. Happy hour is truly one of the best in las Vegas. Food is hot and delicious. Beef kebab is delicious. They check in hookah several times. Definitely a Vegas treasure"
        }, 
        {
            "index": 79, 
            "rating": 4, 
            "review": "Came here around 1:30pm on a sunday. There weren't a lot of people eating that time so we got seated right away. Restrooms were decent. Price range is appropriate for the amount of servings. The taste of their food has always been consistent. However, the quality of service  subpar. There was only one server taking orders although there were busboys. So it took awhile for our orders to be taken and delivered. Poor guy looked overwhelmed when all the other guests arrived.\n\nYELP 100 CHALLENGE: #5"
        }, 
        {
            "index": 80, 
            "rating": 3, 
            "review": "Food is pretty good, service is very good.  Reasonably priced for portions. Friends birthday dinner, they wanted to charge us extra to be in lounge? Went after dinner in a Saturday night and it was pretty empty-charge for what?"
        }, 
        {
            "index": 81, 
            "rating": 5, 
            "review": "Visiting Vegas for a few days and found this place.  Great food,  cozy place and nice people. Hookah lounge is extra for those who smoke.  A much better option that overpriced crappy casino food. Drive 10 minutes trust me it's worth it.  We tried steak kabob and chicken kabob.  Quality food. Tasty!!!"
        }, 
        {
            "index": 82, 
            "rating": 4, 
            "review": "Cool spot good hookah and atmosphere. Seating a bit uncomfortable but I have a bad back. Great friendly staff."
        }, 
        {
            "index": 83, 
            "rating": 5, 
            "review": "This restaurant is simply fabulous!!!! I can eat there everyday.\n\nFrom,\nRachel"
        }, 
        {
            "index": 84, 
            "rating": 4, 
            "review": "Food is awesome and the menu has a great variety, so you can bring in friends that might not be in the mood for a traditional kabob meal. Service in the restaurant is always great, but I've always had extremely slow service in the hookah lounge. For some reason it's always such a long process to get the check and cash out, no matter who I'm with. Weekends are always busy in the lounge, but it makes for a great vibe, even off the Strip."
        }, 
        {
            "index": 85, 
            "rating": 4, 
            "review": "everything was delicious!\n\ncame with 2 others and we shared the shrimp, artichoke, cheese dip with parmesan crisps, the combination platter and the kabob trio.\n\nso effin good! the combination platter came with falafels, hummus, babaganoush, athen's fries, rice stuffed grape leaves (forgot what they were called), and other dips. soo yummy!\n\nthen the trio came with lamb, ground beef, and chicken skewers, and came with this white saffron rice and this other orange colored rice which was so bomb! the meat was cooked perfect medium rare and the chicken skewers were sooo moist! not dry at all.\n\ni will totally come back here again. and fyi the hooka lounge is 21 and up. i figured this out because a bunch of high schoolers walked to the hooka lounge, then walked out all pissed because they couldn't get in. haha."
        }, 
        {
            "index": 86, 
            "rating": 3, 
            "review": "I've always liked Paymon's.  It's not the most exciting food in the world, but it's consistent, good renditions of all of the expected Americanized \"Mediterranean\" faves, hummus, baba g, falafel, etc...  \n\nI do love the lentil soup.  Love love the iced tea.  Gyros are just fine and fresh but nothin spesh.\n\nPaymon's is always a strike down the middle for me.  No curveballs, nothing unexpected.  Easy to hit a fastball down the middle and they always do.  So they seem like an A-OK all day, so three stars for you, Paymon's..."
        }, 
        {
            "index": 87, 
            "rating": 4, 
            "review": "Had dinner here Monday night. Started off with an appetizer sampler, this was really good. The fries were a little stale, but as soon as we mentioned it out came a fresh batch. Let me tell you, these are by far the best fries I've have in Nevada. for dinner I had  Had the Lamb, Chicken and Beef Kabobs. Huge portions, I ended up boxing most of it up. Will def come back when I come through the neighborhood again."
        }, 
        {
            "index": 88, 
            "rating": 5, 
            "review": "This review is strictly for the hookah lounge. I love coming here with a group of friends for some hookah, drinks and occasional food. The decor in the lounge is absolutely stunning and immediately puts you in a loungey, relaxy mood as you take a seat. This place is what I feel a true hookah lounge embodies. All the other ones I've been to around here and Cali have nothing on this lounge. With that said, the one on Maryland Pkwy is the same, just smaller and more narrow in size.\n\nDuring my many visits here for about the past 10 years, I've had the pleasure of trying a few dishes whilst drinking and smoking in the lounge. Some of my faves here are: moussaka, lamb kabobs, beef kabobs, calamari, Athens fries, hummus, to name a few. I can't remember not liking anything I've tried here.\n\nIf you get here during happy hour, the specialty drinks and appetizers are half off. And they do not skimp here. You can order a full size calamari app for under $5 and they are some of the best I've ever had.\n\nThe service is always super friendly but they do get overwhelmed when it gets busier at night. This is a fact I've come to live with when visiting Paymon's but the relaxed feel when I'm here makes it a non-issue for me.\n\nEvery time I come here, it's always great times and great memories. This is a must-do when I have friends in from out of town. I'm so glad we have such a beautiful place like this in Las Vegas that is off the Strip."
        }, 
        {
            "index": 89, 
            "rating": 4, 
            "review": "Always loved it here at paymons. I always get the same thing though, and can't go wrong. The gyro is great! And gotta get a side of their Cajun fries. But make sure you have gum after; the fries leave you with an unpleasant breath afterwards. Service is usually always great. We have a 20 month old, and I love their highchairs. It's the plastic ones that are almost like a high chair you would have at home. The only negative comment I have is that my gyro always falls apart!"
        }, 
        {
            "index": 90, 
            "rating": 4, 
            "review": "Great place for after work fun or chill hookah happy hour. Ambience is relaxing and comfortable. Staff is very generous and make rounds consistently. Prices are fantastic, drinks hit the spot, food is delicious. I would like a longer happy hour maybe until 8pm."
        }, 
        {
            "index": 91, 
            "rating": 5, 
            "review": "The wife really wanted me to go here.so we went last Sunday.  I figured it wouldn't be all that. To my complete surprise, both the hookah lounge and the restaurant were outstanding. Never smoked hookah before but loved it. Loved the atmosphere, the comfortable couch the drinks and the fact that I could watch the football game and listen to enjoyable music. Then we went and ate in the restaurant. I had the chicken curry. Best curry I've ever had and I've had a lot. There were 5 of us and everyone loved the food. You have your choice of Italian, Greek, Indian or mediterranean. Really enjoyed it. I'll be back fo sho"
        }, 
        {
            "index": 92, 
            "rating": 4, 
            "review": "I haven't been here for a while, but I decided to check it out yesterday, and it wasn't bad at all.... I got the kabob pita sandwich that came with the lettuce and the traditional greek sauce you would in a gyro. The price wasn't bad at $8.75"
        }, 
        {
            "index": 93, 
            "rating": 5, 
            "review": "I've been coming to Paymon's for years and they've never disappointed me. The taste of their food is consistently the same. That is something I find hard to come by.\n\nWhen I think of what lentil soup should be, I think of Paymon's lentil soup. Hearty chunks of veggies and not overly salty. Just what I needed today because I'd been feeling under the weather. \n\nOur server, Ben, recommended the chicken pita, which was really good. He was attentive and gave amazing service. Ask for him next time you're in.\n\nKeep doing what you do best Paymon's!"
        }, 
        {
            "index": 94, 
            "rating": 2, 
            "review": "After traveling all day I was looking forward to ordering carryout from paymons.  When I called in my order I was disappointed to find out they don't take any carryout orders after 9p"
        }, 
        {
            "index": 95, 
            "rating": 3, 
            "review": "Love happy hour.\nBut I'm just a little confused on the rules. \nGuys can't wear tank tops or hats. But the waitresses can wear tank tops with their bra straps hanging out? Then the waitress asked my boyfriend to remove his hat..fine okay. But the girl sitting across from had a beanie on. Not sure what sense that makes."
        }, 
        {
            "index": 96, 
            "rating": 5, 
            "review": "Best enviro men best variety of food I love there grill food and panini there salad and soups are so good beautiful interior I love there fries."
        }, 
        {
            "index": 97, 
            "rating": 2, 
            "review": "I'm giving Paymon's 2 stars for the ambiance, great prices, the nice waitress, and delicious Cosmo I had. I would have given it 1 star if it weren't for these factors.\n\nWe waited at the entrance for a good 5 minutes but no sign of a waitress or hostess. Awkward. Once we were seated, I was pretty pumped to give this place a go. The decor is great and it was obvious that people were having a great time in the hookah lounge. \n\nThe food was probably the worst I've had in the area, and I don't say that lightly. We ordered the appetizer sampler, which was lackluster. I'd rather buy hummus from the store. The fries were pretty gross - couldn't place the spices they used, but definitely not my taste. The falafel was alright but I've had better. \n\nMy friend ordered the kabob sampler. The lamb was OK, nothing to get excited about. I didn't care for the chicken much either. Something about it didn't sit right with me. \n\nThe deal breaker was the ground beef kabobs. My only description of them wouldn't be appropriate, so let's just call them straight up nasty. They were warm and cooked on the outside but the insides were cold and total mush. I have never sent back food in my life, but I can only imagine the sickness that would result if I didn't. When they came back, they were practically burnt on the outside (as kabobs should be I guess?) and the insides were slightly more solid. I've had kabobs at plenty of other places in town and in my travels, but I never have experienced this. SUCH a disappointment... It was really gross. The rice was ok but tasted really greasy, and the stewed tomato thing on the side tasted slightly of soap. The waitress offered to send it back a 2nd time but at that point I was over it and the thought of eating more turned my guts. I didn't ask for it to be removed from the bill, but they did it anyway, which was nice.\n\nI'd go back to try out their hookah lounge and have drinks, but I'll be avoiding the food. I hope it was just a fluke but not willing to dump money down the drain again."
        }, 
        {
            "index": 98, 
            "rating": 4, 
            "review": "I am not a smoker, but an occasional hookah is always fun with friends. The Hookah Lounge attached to Paymon's is THE hookah lounge in town. It is right next to UNLV which proved convenient for my study buddies and I when we needed a break from our rigorous study nights (ha ha). The dcor is fitting of a Mediterranean theme, and I especially enjoy the collection of small shoes hung about the room. There is so much to look, one could lose track of time inside. The windows are blacked out, and warm colors fill the room to add to the time distortion. There are about eight tables and two big booths for your hookah party. The best part is that they serve food from the restaurant side. A small bar is located toward the back, and one of their rinks was featured on $40 a Day with Rachael Ray. I can't remember the name, but it is tropical and sweet, and if you asked, I'm sure they would know which one you were talking about. It pairs nicely with a fruity hookah too. The Hookah Lounge is small and cozy and always a good time.\n\nRecommended Hookah flavor: Mango Jasmine Mint\n\nRecommended drink: A mojito. For sure."
        }, 
        {
            "index": 99, 
            "rating": 4, 
            "review": "Dinner with friends in venue that felt intimate and warm for a larger establishment.  The bar area with televisions is completely separate from the dining area which I appreciated. Attentive,  polite service was prompt and well timed.  I ordered the gyro salad, one of my favorites,  and was in heaven from first bite to last. The tzatziki on the tender gyro meat was garlicky,  creamy perfection.  The salad was dressed with a light, tangy vinaigrette kissed dill, plump, briny olives,  juicy tomatoes and spicy red onion. The dish was visually appealing as well as pleasing to the palette.  Portion size was generous.  The drinks were surprisingly pricy as the food menu was quite moderately priced. Drink prices aside, Paymon's will be one to revist."
        }, 
        {
            "index": 100, 
            "rating": 5, 
            "review": "Paymon's is unbelievable! I ordered the curry chicken. It was the best sauce, and the rice was great. I ordered it mild, but you can order it a lot spicier. If you want to add a little kick, add the delicious Racy Red sauce. Do not go to Paymon's without ordering the Athens fries as an appetizer. They are addictive, not to mention delicious. And you can't go wrong with the baklava or rice pudding for dessert either."
        }, 
        {
            "index": 101, 
            "rating": 5, 
            "review": "I first discovered Paymon's before I moved to Vegas.  I had read an article that said they unequivocally had the best fries in Las Vegas.  I rushed out and picked up an order of fries to go and wasn't disappointed.\n\nWhen I moved to Vegas, Paymon's was the first restaurant I ate at.  It was absolutely delicious and has a wide variety of menu offerings.  I love the freshly wrapped grape leaves.  The chilled leaves have just the right amount of citrus and are firm.  \n\nThe lentil soup is savory and well balanced.  The soup itself can be very filling as a light meal.\n\nThe Athens fries.  Where do I start?  These fries are always served hot and thick.  They aren't too starchy and are coated with Paymon's proprietary spice blend.  They are served with a delicious sauce.\n\nThe spanikopita portion is huge.  The phyllo is flaky and the filling is rich and creamy.\n\nThe salmon tandoori comes complete with a huge mound of rice.  The salmon is plump and tender, cut into large cubes.  The tangy seasoning is great and well balanced.\n\nPersonally, I opt for the combination platter.  It is a little taste of everything, from falafel, fries, babaganoush, tabouli, bourrani an hummus.  It is served with fresh pita.\n\nOh, and one of my friends would kill me if I didn't mention the Chicken Fesenjen.  He says it is killer."
        }, 
        {
            "index": 102, 
            "rating": 4, 
            "review": "I love the interior! So much! Very classy and elegant, full of vibrant colors & Mediterranean trinkets & figurines. Service was very good, we were seated right away. It was a busy Sunday night, full of patrons enjoying their wine and food so I knew it was going to be a good dinner.\n\nOrdered the 3-Kabob Combo. Came with Pita, two different rice entree & salad. All delicious & hot & fresh. Server was very attentive and refilled our drinks when needed. Although it was a busy atmosphere, it wasn't too loud or rowdy in there. \n\nI would definitely come back."
        }, 
        {
            "index": 103, 
            "rating": 2, 
            "review": "Two stars for the happy hour food/drink menu... But honestly the worst hookah in Las Vegas. If you don't believe me then go see for yourself. It never hit well, and even after having them change the coals, the bowl, and the base itself, the outcome was still crap (barely any smoke and minimal flavor). I hate to sound so harsh but honestly I've been here four times thinking each time that next time would be better, but I'm done trying. They need to make it so the coals aren't covered...I know there's a liability, but it really destroys the quality of the smoke and flavor when you have the cover on the coals...they're the only place I know of in Vegas that does that.\n\nThe decor is nice though :-)"
        }, 
        {
            "index": 104, 
            "rating": 5, 
            "review": "Amazing!! Pita and hummus was so good and the chicken pita with fries were amazing. Definitely get the fries and try whatever the sauce is that comes with them! Reasonable prices and really good service. Got sat within 10 minutes on a Saturday night at 6pm without reservations!"
        }, 
        {
            "index": 105, 
            "rating": 1, 
            "review": "Limited menu after 9pm we got her at 9:15 the waitress said we only have a limited menu right now so we ordered hummus and tapoli for app And kubedeh for main she came back and told us only one kubedeh their out"
        }, 
        {
            "index": 106, 
            "rating": 4, 
            "review": "I've been here twice. Once several years ago and most recently, a few days ago for a friend's birthday. On the advice of said friend, I ordered the Fesenjan. I'm usually really into pomegranate concoctions, so I was sold as soon as I read the description. To be honest, I enjoyed it thoroughly, but it was a tad too sweet.\n\nI also had their Passion Fruit Iced Tea. I remember having that last time and it is definitely my go-to drink whenever I return. On a side note, my friend ordered the Chicken Curry. She is hardcore when it comes to spicy food. She asked the waiter to make it as spicy as possible. I tried it and it definitely kicked my butt.\n\nPaymon's has a lot of charm. The servers are extremely accommodating and friendly. When they say Mediterranean, they mean it. I always thought they were primarily Persian, but they offer Greek, Italian, and I'm sure other cuisine styles that I haven't bothered to identify.\n\nIt's not a place I would go to often. However, I would never hesitate whenever someone makes the suggestion."
        }, 
        {
            "index": 107, 
            "rating": 5, 
            "review": "ask yourself. do you even happy hour?! hands down best in the west. im hesitant to boast about it for fear of blowing the lid off and never being able to grab a table during this time. but again here is where im wrong. there is plenty of seating in the lounge. \n\nits nice to veer away from the classic bar food for happy hour specials. being and exvegetarian, medditeranian food just does it for. 50% off drinks and hookah. i dont even hookah and im like yea, lets do this. \n\ngreat experience, friendly knowledgeable staff. cant wait to be back on the west side between 5-7 :)\n\n\n(oh and i cant spell w/o spell check)"
        }, 
        {
            "index": 108, 
            "rating": 4, 
            "review": "Tuesdays is happy hour in their lounge.  Although a decent HH choice, they will serve their full menu in the lounge.\n\nMy favorite is their curry chicken and tandoori chicken.  You can choose a spice level for the curry as well.   I like the chicken better from the tandoori and love dipping it in the curry sauce.  However, they charge something like $5 for sauce on the side so I find it a better deal just to order an entire curry chicken meal.  The saffron rice is the best.\n\nIn the past I've had also had their HH athens fries, chicken wings and hummus.  Not the best for your waist line but definitely satisfying for the belly."
        }, 
        {
            "index": 109, 
            "rating": 3, 
            "review": "Went here for a dept dinner. It was fine, I had a gyro , the pita and meat were good, it was nothing that made me say \" yes!! I love it\" but I didn't hate it. Our server was nice which is always a plus. The lychee martini was good! Def had a good kick. I don't use hookah so can't review that. I'd eat there again."
        }, 
        {
            "index": 110, 
            "rating": 1, 
            "review": "What a disappointment.  Wanted to sit in the hookah lounge but of course they were only sitting people with reservations in the hookah area even though I called ahead of time to see if we would be able to sit in the hookah area. This is the second time. They did this to me. So done with these idiots. I suggest not to go here until they realize the reason they exist is the hookah lounge. The food is only so so."
        }, 
        {
            "index": 111, 
            "rating": 5, 
            "review": "I always enjoy eating here. The service is always on point and it's my routine chicken kabob and dolmas. Always consistent and never disappoints. Unlike many other places, the chicken kabob is always tender and moist. I love their rice as well!"
        }, 
        {
            "index": 112, 
            "rating": 4, 
            "review": "I come here a couple of times a month and have never had a bad meal.  Always start with the baba ganoush, it is excellent. My favourite dishes are the chicken fatoosh salad, pesto and mushroom pasta and the gyro."
        }, 
        {
            "index": 113, 
            "rating": 4, 
            "review": "it doesn't matter which location you go to, but both paymon's are great off strip places to eat and smoke out!!! ha..ha..ha.  this was probably one of the first places to offer a hookah lounge in the vegas area.  thank, goodness!!!  the hookah lounge is great place to chill out at.  it 's decorated beautifully (if you are into the middle eastern theme), but it's a bit dark,  and the music can be loud at times.  so if you are looking for an intimate date place, the loud music may interfere.  the food here is yummy!!!  for appetizer's i recommend the flaming saganaki (Kefalotyri cheese lit on fire w/some rum and sprinkled w/fresh lemon juice).   I also like the baba ganosh (eggplant blended w/tahini, garlic, olive oil, and lemon juice)  as far as entrees, i always order either the  pastitsio ( a casserole filled w/ground beef, pasta, tomato, and cheese) or moussaka (a casserole of sliced eggplant, onions, potato, and ground beef).  i'm always too full to eat dessert, but i finish my dinner off with some dark rich sweetened turkish coffee....\n."
        }, 
        {
            "index": 114, 
            "rating": 4, 
            "review": "Paymon's is on my regular rotation since it is near my work and one of the few Mediterranean places close by. (RIP Madpita Express *sniff sniff*) I would really give it 3.5 stars so I rounded up. The prices are high for what you get. The salads are a deal though, as you can easily share them. The Gyro salad is huge and pretty tasty. The gyro pita sandwich however doesn't fare as well. We always have to ask for more tahini sauce because of the minuscule amount they put on it. The sandwich is honestly mostly lettuce, very little meat. The pasta I've had there wasn't horrible, but it also wasn't anything I have reordered since. I tried the pesto sauce with angel hair pasta. The pesto lacked flavor and was too heavy for my liking. The food here isn't amazing by any means, but it's sufficient for a nice business lunch."
        }, 
        {
            "index": 115, 
            "rating": 4, 
            "review": "I'm a repeat customer of Paymon's, therefore I'm leaning toward 4 stars. Realistically, probably more 3.5 but let's not split hairs.\n\nThe hostess was fantastic as soon as we walked in. She was friendly and alerted us to a nice booth that was just opening up, instead of just sticking us at any table.\n\nOur waiter was very familiar with all the dishes and recommended his favorites, as well as commented on the wines we were considering.\n\nNoticed that they have a 1/2 portion menu for a limited time that includes some of their huge portion items (like the Spanakopita).\n\nThis evening we opted for the small Indian section of the menu (I know, Indian at a Mediterranean restaurant??)  The Chicken Tandoori was very tender and the Mango Chutney dipping sauce superb.  The portion was perfect also. The Chicken Curry dish was excellent, although I would have preferred more chicken. That was my only knock on the meal, although for the price I wouldn't say it's a deal breaker.\n\nThe atmosphere is quite nice. And for the hookah smokers out there, the lounge is a great stop.\n\nAll in all, Paymon's is a great off-strip stop and I will be back."
        }, 
        {
            "index": 116, 
            "rating": 3, 
            "review": "The interior of Paymon's is very warm and inviting with a lot of mixed and matched Fall colors everywhere and fake trees/bushes. From what I see in the pictures, the Hookah lounge is gorgeous, but I didn't get to see it since we were just here for lunch. The waitress sat us in a booth a quickly brought out our water and told us what she recommended. \n\nWe ordered:\nFried Calamari ($9.50) - Topped with grated parmesan cheese and served with spicy marinara sauce.\n\nPastitsio ($12.95) - layered casserole made with lean ground beef, Barilla pasta, tomato, parmesan cheese, and several herbs and spices. Topped with bechamel sauce, oven baked and served on a roasted tomato coulis. Served with Mediterranean vegetables.\n\nGyro ($8.75) - Slices of beef and lamb, served with fresh romaine lettuce, red onions, tomatoes and Greek tzatziki sauce.\n+Athens fries for $2.95 extra\n\nTo be honest, I found this all to be a little overpriced. Our bill came out to be over $40 with tip because we also ordered iced tea and a soda. However, the food was very good. The meat in the Gyro was very tender and the fries were crisp and perfectly seasoned. I don't know what kind of dipping sauce they gave us with the Athens fries, but it was addicting. The Pastitsio was very flavorful although a little too heavy for my liking, so I probably wouldn't order it again. The calamari was heavenly; Lightly breaded, tender, and oozing with flavor Parmesan/herb goodness. The marinara sauce was an added bonus. I normally prefer my Calamari with marinara as opposed to aioli. \n\nIf it weren't for the regular menu being a tad overpriced, I would give this place an easy 4 stars. I just don't think I can justify the Gyro and fries being about $12 and the Calamari being $9.50. I'll have to come back again during happy hour when Calamari is only $4.75, so I can add on another star ;)\n\n*Tips\n-Customer Appreciation Night: Wednesdays from 5-9pm, 25% off bill\n-Tuesdays: from 5pm-1am all specialty cocktails, beer, mixed drinks, hookahs and lounge food at 50% off\n-AYCE pasta for $8.95"
        }, 
        {
            "index": 117, 
            "rating": 3, 
            "review": "I had a mixed experience here. First of all we were seated in the corner where it was so dark I could hardly read the menu. The waitress however was great. Very friendly, and she did an awesome job. We ordered the hummus app and it was delicious. I then ordered the chicken tandoori and it was o.k. but I've had better."
        }, 
        {
            "index": 118, 
            "rating": 4, 
            "review": "Interesting food. I enjoy hanging out in their hookah lounge. It's reasonably priced and has an awesome ambiance. Sometimes they have a live dj but there's always music and lights. Drinks are good. The only thing is they could possibly come around to tables a little more often. Still a great hangout place!"
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "Went to this place for my birthday with a large group of around 20 people and they were so nice to us and catered to our every need. I had a chicken gyro which was awesome, and their athens fries which are delicious. Def the best mediterranian food I have had in forever!"
        }, 
        {
            "index": 120, 
            "rating": 5, 
            "review": "This is one of my fave places in town.  I LOVE the food, and the menu is large and diverse.  I usually get the appetizer sampler, a variety of middle-eastern mezze that is the BOMB!  Definitely try to go during happy hour tho -- half price drinks and hookah.  Otherwise it can get pretty expensive!"
        }, 
        {
            "index": 121, 
            "rating": 2, 
            "review": "Great for appetizers and hookah, bad for dinner.\n\nMaybe I got slighted because I went during the late night hours. The hummus and Athens fries are always good. They have loose leaf tea which is a plus, but the dinner entrees that myself and the rest of my party ordered were equivalent to overpriced Mediterranean fast food.\n\nOrdered a chicken pita. It was alright, nothing extraordinary. Chicken was a bit dry and there was a lot of it, which explains why the pita was served in a paper wrap with printed instructions on how to eat it, so as to avoid a food explosion. It could have benefited from a bit more veggies and tsatziki, as there were only a few lettuce leaves and a sparse amount of tomato and sauce.\n\nThe others in our party ordered a brushcette salad with chicken that was also dry with very bitter and overdressed romaine. There were also quite a few lettuce stems in the salad which is quite bizarre. A broiled steak kabob was also ordered. Again nothing extraordinary for the price. Rice was very salty, the green beans with tomato sauce were reminiscent of something you'd find in a geriatric cafeteria.\n\nService was also painfully slow and one waitress was arguing with what appeared to be her boyfriend. Despite that, our waiter was polite and took the salad off of our check."
        }, 
        {
            "index": 122, 
            "rating": 1, 
            "review": "***3rd updated review: All please note the business manager deleted his reply. (As he should have, as he was extremely rude to my feedback. i will go and post screen shots of his original reply when i get some time. \n---------------------------------------------------\n***2nd updated review: Here's an update to my review below. I tried to comment back to Jeff E. from this business but Yelp wouldn't let me for some reason. So this explains why the staff was rude, as you all can see below the Business Manger is rude himself in his reply. Not once, did I get an apology for his staff being rude or making us feel uncomfortable. Note, I am a first time customer and a potential client, obviously he doesn't care. In his review he didn't post about how we where addressed by the bus lady. Our own waiter didn't even enforce the dress code or anything. \n\nAnd our bad on the \"garlic fries\" when he asked the server about them we where told the following, \"We stopped serving those\" which indicates or conveys you once had them to a new customer like myself. So if you don't serve garlic fries or \"never have\", then please Jeff, educate your staff to let people know that, so they can respond correctly to customers. \n\nIf you enforce a dress code regardless of race, or gender then all of your employees should enforce it, not just the bus lady, but your hostess who sat us AND the waiter who served us who said nothing to us. Please understand it felt like we where being picked on because after us sitting there for 2 hours smoking hookah and spending money on drinks no one said anything. I understand the dress code is posted but it was late and dark so we did not see it. Your host, and waiter said nothing to us. It would have been better to be addressed earlier, then 2 hours in, from a bus lady clearing our plates after we are done and about to leave. Please note, unlike the other customer, who was asked to remove his baseball cap \"3 times\" as soon as where we asked we cooperated and removed the hat. The point I am trying to make is we where addressed rudely about the baseball cap. Threated even, \"if we do not remove it we have to leave,\" but the guy across from us is allowed to be asked 3 times and us only once? That is not right.\n\nAnd I think that that's great you have a way to buy shirts if someone has no sleeves, but if its NOT about race or gender, then why are the females allowed to wear sleeveless tops and sleeveless dresses in there? I myself had a tube top on that night, and no one made me \"pay for sleeves or a shirt.\" If you are going to have a dress code, then all should abide by it then. Not just males. Women should too if that is what the dress code is. But again, it seems this place only caters to the \"regulars\" based the response below that I got. :-/  so I guess it doesn't matter. \n\n\n---Old review: My friends wanted to come in for the \"garlic fries\" only to find out they no longer serve them. We sat there for about 2 hours smoking hookah. Then some bus lady out of no where tells my boyfriend \"you need to take off your hat or get out.\" First off, we have been sitting here for 2 hours and now it's an issue? Second of all I understand a dress code but the way she approached us and ask was rude. Simple. I then looked around and saw other people with baseball caps on as well. So we asked if my boyfriend needs to remove his baseball cap then so should the others. The bus lady / clean up lady claims she asked the other guy to remove it 3 times. I find it funny that she can supposedly ask someone to remove a hat 3 times and it's ok. But of course she asked my boyfriend once or her would be \"kicked out\" after 2 hours of sitting somewhere come on. So anyways my guy took off his hat. As we're waiting for our check there was a guy next to us and he had a regular black tee shirt on. They told him He has to have a \"proper shirt on or get out\" they then had him come over to the bar and \"pay a shirt fee\" wtf??!! This place is wayyyyy to worried about baseball hats and plain tees on certain people. If you know what I mean... If you guys are going to have a \"dress code\" it should be the same for everyone. No matter race or gender. Example: they let people in wearing sweats and work out clothes but worry about hats and plain tees? Come on now."
        }, 
        {
            "index": 123, 
            "rating": 5, 
            "review": "This place is amazing and unique !! I'm going there for a years and I love it . The only thing .. Hookah is not great ,they need to improve it . But food,beverages,customer service are good . I'm fascinated by Mediterranean interior style in this place . Nice lounge . Relaxing atmosphere."
        }, 
        {
            "index": 124, 
            "rating": 4, 
            "review": "I don't smoke hookah, but came here for their Tuesday happy hour with some friends. We were seated at a very comfy table/booth and there was more than enough room for the four of us. \n\nIt seemed rather busy, but the two waitresses on the floor were on point with their service!  Also the hookah attendant was informative and helped my friends select their flavor with great suggestions on their preferences. \n\nAgain, it was Tuesday Happy Hour. if you ever go here, go for Tuesday Happy Hour!!!!  Our tab for 4 including drinks (we were there for a few rounds) was extremely dirt cheap. Like, UNREAL, out of this world, I can't believe this is Vegas cheap. Check it out!"
        }, 
        {
            "index": 125, 
            "rating": 4, 
            "review": "I love the food & the atmosphere is very soothing & mellow. The service is always pleasant but slow.  Go here when you have a lot of time to sit & relax & enjoy the food."
        }, 
        {
            "index": 126, 
            "rating": 5, 
            "review": "Good service and delicious food, the best thing in this place that you can have Indian,  Arabian and Italian food at the same place,  the waiter was very nice to us....recommended"
        }, 
        {
            "index": 127, 
            "rating": 5, 
            "review": "Wow I am so impressed at this restaurant. The manger and owner Cathy is courteous and kind. The food is fantastic and in a good big size. One of the few restaurants in Vegas that I can recommend to any one.!"
        }, 
        {
            "index": 128, 
            "rating": 3, 
            "review": "Hello from Japan!\n\nFor those following my reviews, I am Yelping from Sendai city in beautiful Miyagi prefecture (two hours north of Tokyo).  I am working here as an ALT, so I'm going to be here for a while.  I'm going to get my last reviews in because I miss Yelp, and wish I could yelp some of the great places I've been to here in Japan.\n\n(Sorry for that tangent... on to the review!)\n\nI came to Paymon's about a month ago when I was supervising a group of international students to Sin City.  Echoing my previous reviews, I find that the best restaurants and treasures in Vegas definitely come from the locals, and it wasn't long before buddy Francis C. took me here for a late lunch.\n\nPaymon's specializes in Mediterranean café style foods- a cuisine I've never really touched before, so my choices here were definitely on the safe side.  Conveniently located a few blocks away from the Strip, Paymon's offers a great atmosphere to enjoy a nice meal, as well as a hookah bar right next door (however, you must be 21 or older to enter).  When we went, we sat in between the restaurant and the bar in this extremely nice patio area, where natural sunlight was where it was at.\n\nService that day was decent.  We placed a few orders of fries, and I ordered the chicken marsala for my hefty meal.  Our food took a bit for it to come out, which confused us because a couple of other parties received theirs before ours (and we felt it was a pretty small meal).  When I finally received my chicken marsala, I was ready to sink my mouth into that piece of chicken.   In terms of the taste, the flavors didn't do much for me.  It wasn't bad at all, but nothing about my meal struck me.  The piece of fried chicken breast was okay, and my sauce over the noodles were simply average.  However, they do give a good sized portion for you hungry gamblers out there.\n\nEven though my meal wasn't completely mind-blowing, I did enjoy the French fries and the on-and-off lighting inside the patio.  Next time I come, I will definitely venture off and try the more Mediterranean options that Paymon's is known for.\n\nParking is plentiful outside in a private lot with other businesses."
        }, 
        {
            "index": 129, 
            "rating": 5, 
            "review": "Awesome food.  Kobideh perfect , kale salad , service was great.  I am happy to bring my out of town guest and know the food would be good"
        }, 
        {
            "index": 130, 
            "rating": 2, 
            "review": "Save your money.  Took my girlfriend for her birthday and so noted when making the reservation.  No special dessert offered as is customary at every other place.  Worse, food tasted as it was prepared in advance and was just heated.  Asked for owner who was not there.  Nice waiter but when confronted before leaving, his only response was sorry.  Cashier also told about the problem and she with the personality of a snail, said I should have told waiter (in front of my GF?).  Will not return."
        }, 
        {
            "index": 131, 
            "rating": 5, 
            "review": "ALWAYS delicious Mediterranean food! We have been here a few times now and the food is always on point. We decided to grab a late dinner on Wednesday night with some friends from France and the main door to the restaurant was closed so we seated ourselves in the lounge to grab some food. I spoke to the bartender to get a menu and after a few minutes he returned and notified us that we could not sit in the lounge because one of our friends had a tank top on, so he walked us into the main dining room thru an interior door. We all ordered hummus and Baba ghanoush (which is delicious!) and our main courses. I ordered meat Dolmas, my husband ordered Felafel and our guests ordered Chicken Kebab. All the food was very good, as always. Not being able to sit in the lounge because of a tank top was kind of weird but eh whatever. Love this place and excited for many more meals here!"
        }, 
        {
            "index": 132, 
            "rating": 4, 
            "review": "OK so lets start with the food, and ill move on to the rest :) \nYou have to try: Athens Fries!,Chicken Curry, and Falafel! \nCons:  There Beef kabob with any plate. \nAlso i hate that they dont do substitutions. Every single restaurant substitutes, especially when you are substituting something that is priced lower, than the actual item on the plate. (Ridiculous).\nHookah is good, if you can ask Eddie to make it he is awesome! \nCons: Extremely stingy on coal!!!!! I mean seriously who does that, i am a very frequent hookah smoker and own several of my own, and we all know how long one charcoal lasts. Instead you have to do a refill and order another one for 10 dollars! \nDj is great! \nAmbiance is Great! \nStaff is wonderful! They really do have great service!"
        }, 
        {
            "index": 133, 
            "rating": 3, 
            "review": "There are definitely not many places to find Mediterranean food in Las Vegas, but this place is definitely worth considering.  The interior of the restaurant is vibrant with color with painting and plants around the tables. The music that plays in the background is very lively and adds another dimension to the experience. The staff is friendly and checks up on your party regularly.\n\nI ordered a gyro pita was rather disappointed with what I received. It did not have the spirit of what a gyro should have, for it did not have much flavor or seasoning to it. The rice was ok but was rather dry and boring. Despite this, the fries are absolutely incredible. They are seasoned and well-cooked; the fries are like no other fries I've ever had. The value of the meal for one person is reasonable.\n\nI usually enjoy Mediterranean food, but trying the food at this place turned me off from enjoying other aspects of Mediterranean food. I might come back again for the fries, but that would be the only thing I would order again."
        }, 
        {
            "index": 134, 
            "rating": 5, 
            "review": "Amazing chicken curry, fish kabob, Athens fries! I love coming here. Definitely can't complain."
        }, 
        {
            "index": 135, 
            "rating": 2, 
            "review": "1.5 stars, actually.  \n\nCafe:\nIt was quite a late dinner and the cafe portion was pretty empty.  We got a pretty quick and good service.\n\nFood: \nAthens fries didn't really work for me.  It was good, but seasoning was bit too much for my taste.  \nBeef kabob was overcooked.\nFesenjan was tasty but on the sweeter side.  \nOverall, food was ok.  \n\nHookah lounge:\nThe worst of the hookah lounges I've been to.  The waiter, despite repeated requests to replace the coal never did.  He looked at the container that housed coal, blew into it and left."
        }, 
        {
            "index": 136, 
            "rating": 5, 
            "review": "This is the best Mediterranean restaurant I've been to. The koobideh was fantastic."
        }, 
        {
            "index": 137, 
            "rating": 3, 
            "review": "Very nice restaurant! The ambiance and very intimate. We ordered the famous athens fries and they were good!!! We also had the chicken pita and gyro platter . The pita was good, but the bottom was pure lettuce, no sauce or anything. The sauce up top was good too. Kind of tasted like a spicy peppercorn or spicy Bleu cheese (idk). The gyro platter was okay. Salad was really good and the rice. The meat was good, but very grenade. My husband couldn't eat it all because of that. Otherwise, it was pretty decent for our first trip there. I also like the fact the hookah area is separate from the dining area. Good idea!!"
        }, 
        {
            "index": 138, 
            "rating": 5, 
            "review": "This place is pretty awesome.  Me and my girlfriend ate here for our 11 months (aww how cute), and it was a fantastic night.  I had the Curry Chicken, she had the Chicken Kabob thingys with humus.  We split an order of the Athens Fries (I got the reference for the fries from other reviewers. They were pretty awesome) and got a bottle of wine.  The food was delicious, the wine was perfect for the food, and we had leftovers to take back to enjoy later. After dinner we went to the adjoining room and got a spot to smoke some hookah.  2 friends joined us to smoke and we all sat around talked and had some drinks also.  The dirty martini with Belvidere vodka was probably the best one Ive ever had from anywhere.  The atmosphere in there was awesome, the music never got annoying, and we had a great time.  The only thing I would change about this place is I would keep it open later than 1am.  I wish they had a place like this in Long Beach. Maybe Ill open one like it someday."
        }, 
        {
            "index": 139, 
            "rating": 4, 
            "review": "We arrived right before 5PM on Thursday and were seated right away.  They weren't very busy and were told they didn't have happy hour here ( cafe side).   The decor was nice, I liked the outside patio.\n\n After reading the reviews we ordered a side of Athens fries and hummus.  The fries are amazing especially with the dipping sauce. The hummus was fine however the pita bread was not so good.  The bread tasted as if it was reheated prepackaged bread not freshly made.   \n\nFor the main dishes we ordered the steak kabobs- medium and the gyros platter. Both were very tasty the steak was good quality meat and of big portion size.   They both came with rice and vegetables however I found the white rice to be bland tasting.\n\nOverall the service was fast and our waiter always made sure we were taken care of.   It would of been 5 stars if it was not for the pita bread!"
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "For great Mediterranean food and some great hookah in a super chill hookah lounge there is no place better. If someone wants hookah or Greek food, I am going to always bring them here until I find someplace better."
        }, 
        {
            "index": 141, 
            "rating": 5, 
            "review": "I've been here dozens of times with friends and the food never disappoints! I feel like it gets better and better every time we go. The hostesses, food runners, and servers are all very friendly and on top of everything. The food is amazing. Definitely try the trio kabob platter and the babagonush!"
        }, 
        {
            "index": 142, 
            "rating": 4, 
            "review": "Amazing Italian and Mediterranean food under one roof???  Is this possible?? YES it is... My sister and I shared the All-You-Can-Eat pasta plate and a greek salad.  We started with the pesto angel hair pasta and then had the meat sauce with spaghetti.  The pesto angel hair was a little overdressed in pesto, but tasty nonetheless.  There was so much pasta left, they even let us take the rest in a to go box.  The take out packaging was super fancy..the utensils were silver and looked like actual forks.\n\nIf you want excellent greek/mediterranean/italian food while in Vegas, without the long lines, then Paymon's is the spot!!!"
        }, 
        {
            "index": 143, 
            "rating": 4, 
            "review": "Pretty darn good.\nI have been to the original location several times, this was my first time at the West Side. The Shrimp & Spinach dip is amazing!! Get it before you even look at the menu.\n\nThe selection is vast and you will find yourself concerned as you read through, because you will want to try everything. The Combination platter comes with thier amazing Fries, Baba Ganouch, Humus, Stuffed Grapes Leaves and more. It's a meal for 1+. \n\nFurther, we went with a Baked Kibbe for a shared entree. Fantastic.\nThe leftovers were great at work today.\n\nThe service is very good. We came late, 8:30pm on a Sunday.\nWe waited at the door for about 5 minutes. That sucks, however, Daniel, who turned out to be our server, noticed us, say us, apologized and explained and provided excellent, attentive service throughout the meal. He genuinely cared that we got the right food for us and enjoyed what we had ordered.\n\nAlso, there was a crooked painting on the wall. Can't knock points of that, but just sayin' :)"
        }, 
        {
            "index": 144, 
            "rating": 5, 
            "review": "Crack fries and gyro are always what I crave here! Service, music, and atmosphere is great. They also offer military discount."
        }, 
        {
            "index": 145, 
            "rating": 5, 
            "review": "I love this place.  I have been visiting this site for years but started at the Maryland Parkway location.  Both very good.\n\nMy hubby and I usually split an order of hummus and it is excellent with their warm bread.  We usually order the same gyros or chicken kabobs but this last time, I had a chicken panini with roasted red pepper and spinach and it was DELICIOUS.  My hubby had a taste and we are now both hooked.  We've never had a bad meal at either location and if you love tropical iced tea, this is the place for you."
        }, 
        {
            "index": 146, 
            "rating": 4, 
            "review": "Athens Fries - 'nuff said. The sauce that comes with the fries = CRACK. My mom and I got the Gyro sandwich and Falafel-Hummus sandwich and split them half and half. Both were really yummy! \n\nThe food took some time to come out, but we thankfully had our Athens Fries! Service was good as well. We were promptly seated, brought out drinks and menus, and the server was constantly checking up on us.\n\nThere is a separate hookah lounge which is a fun time. \n\nDefinitely coming back for more!"
        }, 
        {
            "index": 147, 
            "rating": 3, 
            "review": "First and maybe last time here. Boyfriend got a gyro which was enormous but he got sick later. We also ordered cucumber dip an hummus, plus I ordered Buffalo mozzarella panini. \n\nThe waitress Judy was very nice and gave great service. My sandwich was just meh. I was concerned about my guy getting sick. We both are the dips an I was fine so might have been the gyro meat."
        }, 
        {
            "index": 148, 
            "rating": 4, 
            "review": "This is a nice place on the west side of town to get some tasty Mediterranean food. I'm always on the look out for some good dolma especially  if they are served hot. I think the cold ones are too oily. I liked the fact they had both of them at this location. I started off with the hot dolmas for ($7.95). A dolma is a grape leaf filled with seasoned beef and rice baked in tomato sauce. This is the closest one I can find to the ones I ate during my childhood. \n\nI had the Fesenjan for my entree ($12.95). It's a boneless chicken breast that is slow cooked with crushed walnuts and pomegranate sauce. It's served with basamati rice. I typically don't like eating a lot of chicken because I'm afraid it would be bland but this was bursting with flavor! It has a tangy sweet flavor to it. \n\nI also sampled their combination platter ($13.95) which comes with Hummus, Tabuli, stuffed grape leaves, falfel, yogurt cucumber dip, baba ganosh and Athens fries. Everything tasted fresh and delicious! You could tell the food is made to order."
        }, 
        {
            "index": 149, 
            "rating": 4, 
            "review": "Great spot for some tasty Greek / Mediterranean food.  Atmosphere is cool, prices are fair, service is nice.  This is a place to go often."
        }, 
        {
            "index": 150, 
            "rating": 1, 
            "review": "I was sick for two days after eating the falafel here. Also the manager was ridiculous telling us what doors we could exit out of when we were attempting to leave"
        }, 
        {
            "index": 151, 
            "rating": 5, 
            "review": "Paymon's is my go-to. Amazing happy hour, amazing people, amazing atmosphere/decor. Plus, the foods delicious. If you haven't visited, you're missing out."
        }, 
        {
            "index": 152, 
            "rating": 4, 
            "review": "Overall atmosphere is very nice and relaxed, and the food is great! The hookah lounge is fun and the fact that you can eat in here is amazing. And the baklava is to die for!! Such a great experience!"
        }, 
        {
            "index": 153, 
            "rating": 4, 
            "review": "Very large and nicely decorated dining room.  Great service when we went late-night.  Everything clean and neat.  Food was 4 stars.  Great, but not excellent.  Decorations very nice.  Music good.  Confusing entrance at late night.   Will definitely try again during lunch time.  Toward the end of our meal, our table was left unattended for 10 minutes or more, that was the only real downside."
        }, 
        {
            "index": 154, 
            "rating": 3, 
            "review": "A good enough place to hang if you want to smoke the water pipe on a Sunday night. The \"turkish\" flavor of tobacco was nice--not too sweet and a little toffee-like. Drinks were fine and properly made.\n\nService was slow for the drinks and very, very slow for the tobacco.\n\nAnd the no hats rule is ridiculous, and something that will make me think twice about going back to this place. I like my hats."
        }, 
        {
            "index": 155, 
            "rating": 4, 
            "review": "Traditional Greek and Mediterranean restaurant that offers a decent selection of traditional veggie items. The food is very good and very dependable and the service is generally very friendly."
        }, 
        {
            "index": 156, 
            "rating": 1, 
            "review": "WOW - we were craving Mediterranean food. this reminded me of when I lived in Denver and their number one year end pizza poll was Pizza Hut.\n\nThis place is the taco bell of Mediterranean food. Everything including the Babaganoush, Hummus, fries(salty hell - with special sauce? - terrible and not so special) couldn't even be done right. The Salmon entree was terrible - dry and  the rice with it has some very odd spice etc... The combination plate was a salt plate and \n\nFalafil sandwich was so dry - barely anything soft inside - terrible.\n\nPastitso - didn't even resemble the real thing.\n\nI know I am spoiled coming from Chicago eating authentic Greek food - but man this was bad. I suppose if you never had Greek or middle-eastern food - this is \"taco bell\" ok - otherwise if you are - stay away from this place.\n\n- a sorry attempt to say the least."
        }, 
        {
            "index": 157, 
            "rating": 5, 
            "review": "awesome! great food, great service! i was VERY impressed with the hummus and the lebni. however, the athens fries were just eh. if i could give 4.5, i would (and that would be based on the fries that i read such rave reviews about)  i wasn't blown away at all. not saying they arent good fries, dont get me wrong, they are....but they aren't the \"crack\" fries i read about.  the passion fruit iced tea is DELICIOUS!!!!!! could drink it all day long! i really enjoyed the ambieance of the place as well. the prior yelp reviews were really helpful and are what lead me to this place. please go, enjoy the food...it's worth it. oh, another cool thing is if you see some appetizer you like, they come in small and regular sizes....cooool!!!"
        }, 
        {
            "index": 158, 
            "rating": 3, 
            "review": "This is our usual hangout space. Love the food here. The platters and the fries are pretty good. Also love the lentil soup. No complaints there.\nHowever the hookahs leaves a lot to be desired for. They get harsh really fast. And they don't change the coal. Not good.\nAmbience is fun, patio area is really nice. However sometimes in the weekends the music is too loud to even converse. But it's still fun.\nIf ur looking for hookah, there are better places in town. If ur looking for good ambience and food it's the place to go"
        }, 
        {
            "index": 159, 
            "rating": 4, 
            "review": "I love this place!!!!\nThe fries are off the hook, mixing hookah flavors amazing, full bar, reservations can be made for the dining portion on the hookah its first come first serve.  \n\nGreat music as well!\n\nWatch out for the bill though as they can mistake a cash payment for the tab as a tip."
        }, 
        {
            "index": 160, 
            "rating": 4, 
            "review": "Food and ambiance at Paymon's is unmatched. Definitely one of the most chic spots to grab a hookah in Vegas. I only wish they would call me and allow me to help them get their hookah to match their amazing decor ;) Consider this an indirect solicitation!"
        }, 
        {
            "index": 161, 
            "rating": 5, 
            "review": "Amazing food, unbelievable ambiance. Keep up the good work! Compliments to the Chef!"
        }, 
        {
            "index": 162, 
            "rating": 4, 
            "review": "Full disclosure: Sentimental favorite. We went to the original on Maryland Parkway when my wife and I were dating 15 years ago. It was a treat for us poor college kids. When we vacation in Vegas once a year or so, Paymon's is always a must do. \n\nThe fried calamari appetizer is well done. Nothing to rave about, but it's good. The real draw, for us, is:\n\nThe \"gyros in pita\" is awesome. Lots of meat, plenty of veg, and a wonderful tzatziki sauce. Always pair it with Athens fries. \n\nOverall, the food here is fresh and clean, with nice Med flavors. There's something here for everyone, including vegetarians and carnivores. This place is just solid: Never had a bad experience here in over 15 years!"
        }, 
        {
            "index": 163, 
            "rating": 1, 
            "review": "If I could leave worse than a 1 star I would. I called in a lunch for 8 people 24 hours in advance. They took my order, asked for my credit card info, and assured me the lunch would be ready the next day. I showed up to a bunch of people acting confused and playing the blame game. Not one person new anything about the lunch and the girl working up front simply laughed and said, \"Oh well, someone must have forgot to put the order in, haha!\" I asked to speak with a manager and was informed there are no managers on duty. I then asked for the owners name and received a blank stare. Long story short, their awful customer service cost me business. Reps should avoid this place at all costs."
        }, 
        {
            "index": 164, 
            "rating": 4, 
            "review": "I go to lunch here a few times a month.  Very filling salads and great pita.  I like the Mango iced tea too.  If I go on the weekend or after work, they have an interesting selection of European beers."
        }, 
        {
            "index": 165, 
            "rating": 4, 
            "review": "I'm surprised based on the horrible reviews I read, my experience here was nothing compared to the bad ones. I tried it tonight with my boyfriend and we left satisfied. \n\nWe were greeted warmly as we entered and were sat within 4 minutes. We already knew what we wanted to try so when our server came to get our drinks we also ordered our meal. We tried the Kabob Trio which was basically white basmati rice, brown basmati rice, chicken kabobs (their chicken was flavorful and really juicy!) , beef kabobs (they were SOOOOO GOOOD! Like melted in my mouth good!), and lamb kabobs (THE BEST lamb I've ever had. Not gamy, filled with flavor, cooked perfectly medium ), yogurt mix which complimented the lamb kabobs the best in my opinion, Greek salad, along with roasted onions and tomato. \n\nThe food was so delicious and the service was good enough that I would definitely come back. I would give a 5 star, but the service wasn't as amazing as the food. I'd recommend this to friends and families. The interior was pretty, had a nice relaxing ambience. And the hookah lounge at the other room looked pretty as well! It's a must try for next time.\n\nThe icing on the cake for this place was that we got our food at a discounted rate and we didn't even know it was happening. The Kabob Trio is usually 20 dollars plus tax, but I guess they have a sale going on on Wednesdays. So instead of paying 20, we paid 16 dollars for the massive Kabob Trio :) \n\nLove this place, would try and recommend."
        }, 
        {
            "index": 166, 
            "rating": 1, 
            "review": "I used to go to the Paymons by UNLV fairly frequently when i lived on that side of town. My boyfriend and i were in the market for a new happy hour to check out, so i found this place on my mobile app. Regretting it greatly now.\nFirst regret, the specialty cocktails. Margaritas were ridiculously too sweet, and i read through the ingredients. They use a mix i have used before, so i'm not sure how those got screwed up... and I'm a bartender. \nNext, we ordered the hummus as a starter, and it arrived surprisingly fast. Downside however was it was depressingly bland and oozy, not thick or flavorful at all. We figured oh well, the entrees should make up for it.\nI ordered the gyro pita, accompanied by athens fries, my boyfriend got the pesto pizza. I couldn't pick up the thing, cuz it would probably fall apart, so i proceeded to make little mini pitas by tearing pieces of it and putting the meat, tomato, onion and tzatziki sauce inside, very messy. I now realize that we were never given settings or napkins. Since my boyfriend had to go looking for our server a couple times, i said to hell with it and got some paper hand towels from the bathroom. My server saw me come back with said towels, and said nothing to us or checked in still.\nBack to the food. I couldn't put my finger on it, but something was way off with the gyro meat, a little too 'chewy' i suppose, and barely warm.. the fries weren't really anything to write home about. My boyfriend said his pizza was basic and bland also.\nThe only time server finally checks on us, he rudely interrupted my boyfriend and i having a moment. We asked for a box and the check. In all honestly the only reason for the box was to give the food to the dogs.\nThe check arrived, and we were thrown for a loop. I have no problem paying for a quality fare, but we were under the impression that most of our items were on happy hour pricing. Nope. 2 drinks, hummus, pizza and my gyro came out to 50 bucks, wtf. I then got on here and learned that happy hour pricing was only on Tuesday nights. Another thing i came across in these reviews was that Weds nights are customer appreciation night and they take 25% off the final check.  Again, didn't happen.\nWe were over it at this point and just wanted to vacate. Again, my boyfriend had to go looking for our server,  who he said gave him an irritated look when we needed change. I always leave 20% as i am in the industry, and can understand that not all issues are the service staffs fault. In this case I'll admit I lowballed.\nTo make it even better, as we were getting some stuff at the gas station on the way home, i rapidly became unbearably nauseas and ran outside to throw up. Definitely won't be caught here again, i don't even think i feel safe giving the hounds the food anymore... that's bad."
        }, 
        {
            "index": 167, 
            "rating": 5, 
            "review": "Gyros and Athens fries are to die for hunny even though the menu has simple traditional Italian food such as spaghetti I think it is better to stick towards the Mediterranean menu rolled grape leaves, chicken pita chicken"
        }, 
        {
            "index": 168, 
            "rating": 4, 
            "review": "I went to the Hookah lounge last night (Tuesday, May 14) with a friend. Tuesdays they have all-day happy hour in the lounge (which means half-price hookah, drinks, and some appetizers)! It gets a bit crowded which may not be for everyone, but I think it makes for a more fun vibe. They tend to start playing electronic music later in the night on Tuesdays as well (I have heard they also do this on weekends).\n\nI give them four stars mainly for overall atmosphere in the lounge and selection of the hookahs. They have a huge assortment of hookah flavors - at least 25 that you can mix and match, and you can also choose liquids other than water for the bottom of the hookah. My only complaints are that the hookahs take phenomenally long to come out (I can never understand why this part takes so long - the drinks and even the food arrives before the hookah!) and they won't refill coals - you just have to order a new hookah flavor. But, the music is good and the seating is comfortable, so the wait doesn't bother me enough to stop going.\n\nThe food is good, but not exceptional. It's decent middle eastern food for Las Vegas, but like I said, if it weren't for the great vibe in the hookah lounge, I wouldn't go for the food alone. The hummus, baba ganoush, and meat dolmas are my favorite appetizers, and the lamb skewers are a great entree. I wouldn't recommend going to this place for dinner, but I would hands-down recommend going to have a fun night smoking hookah and grabbing some drinks with friends."
        }, 
        {
            "index": 169, 
            "rating": 4, 
            "review": "So my lady and I came in for happy hour on a Monday evening with no expectations whatsoever.  We entered the lounge area where all the smoking takes place.  We're not smokers, but were pleasantly surprised with the subtle aroma of the few smokers in the vicinity.  I'd characterize it as a cross between pipe tobacco and light, fruity incense.\n\nAnyways, we enjoyed a number of the half-off appetizers and cocktails.  The appetizers were great.  We had the stuffed grape leaves (filled with a well-seasoned ground beef), the pesto pita pizza with mushrooms, the falafel and the chicken fingers dipped in a phenomenal buffalo sauce.  Each one was better than expected.  The drinks were also very good and we walked out with the perfect buzz.  I'd recommend the Lychee martini for a strong, yet tasty after-work drink.  \n\nThe atmosphere was very serene and unique for the Vegas scene.  It was hard to imagine that we were in the heart of Summerlin while sitting on a wraparound couch and surrounded with dimmed, colored lighting and interesting, yet well-themed artwork.  \n\nWe were there for an hour and had a great time.  There is no doubt we will be back."
        }, 
        {
            "index": 170, 
            "rating": 4, 
            "review": "I've visited Paymon's twice in the last week, and I must say, the food is very tasty! I had the chicken pita, and my Cousin had the Med veggie platter, with falafel, hummos, grape leaves, athens fries, etc. Very, very good!\n\nThe only thing is I wish the service were a bit friendlier. I just get the feeling that no one enjoys working here.  The restaurant is very nicely designed, and they've got the food down pat! To earn that extra star, let's get the staff smiling a bit, and let's pick up the tempo a tad, and you'll have a true winner!"
        }, 
        {
            "index": 171, 
            "rating": 3, 
            "review": "We stopped here for something different.  I had looked at the menu online and decided on the kebab trio--a dinner with koobideh, chicken, and lamb kebabs.  Served with the meal are vermicelli pilaf, basmati rice, a house salad, and grilled tomato and red pepper.\n\nI started my meal with a cup of their summer soup available for a limited time.  It's a cucumber yogurt cold soup with walnut pieces and golden raisins for a touch of sweetness.  The soup was topped with some croutons and garnished with a sprig of mint.  It was excellent!  Very different and very refreshing.\n\nFor the main course, the kebab trio was perfect for the two of us.  My wife does not like lamb.  By sharing the trio, I was able to have some lamb while she stuck with chicken and koobideh.  Of the three, the koobideh was the star of the dish.  The lamb was cooked too much--I had requested rare and it was more on the medium side.  It was also a bit tough.  The chicken was OK but there wasn't much spice to it.  The koobideh, on the other hand, was done medium rare as I asked and it was flavorful and very enjoyable.\n\nFor dessert, my wife got the rice pudding (it was very good), and I got an order of baklava--also very good.\n\nService was not the best.  We waited at the podium for about 5 minutes before anyone came to seat us.  My iced tea wasn't refilled in a timely manner and even though there were only a few other diners in the room, our server seemed to disappear for long periods of time only checking back with us once near the end of our dinner.  I also thought it was a bit tacky to take the dessert order, enter it into a nearby terminal, and then put the bill on the table before clearing the dishes and well before dessert was brought.  Bad form.\n\nIf I decide to come back, it will be for takeout, but with other choices in the area for Mediterranean food, I probably will go elsewhere."
        }, 
        {
            "index": 172, 
            "rating": 5, 
            "review": "Great lentil soup\nThe hummus is delicious with the pest sauce\nLamb kabobs are fabulous \nThe salmon kabobs are five star flavor change for a change \nSkillfully cooked moist thtoughout. \nSuper staff.  Always attentive"
        }, 
        {
            "index": 173, 
            "rating": 3, 
            "review": "Love the atmosphere and the food is great. For this next part I'm only speaking for the hookah lounge area. For some reason the service is slow. Don't know why they seem properly staffed to run properly. If you are patient enough it's a great place to relax with friends and family. I suggest the combination plate appetizer to start. It's a great mix of hummus, boba ganoush and fries. The salmon dish is great for a main dish. They have a good variety of flavored tobacco for the hookah to choose from."
        }, 
        {
            "index": 174, 
            "rating": 4, 
            "review": "Fun place to hang out after a busy week. The food is great and a nice variety of drinks(of course I only drink wine). Creating your own Hooka is my favorite part, and if your not sure what to get, you can always order off the Hooka menu. The music is upbeat... i only wish they had a dance floor.\nLast but by no means least, the staff is amazing...they give it a \"Cheers\" vibe....everybody knows your name and they're ALWAYS glad you came."
        }, 
        {
            "index": 175, 
            "rating": 3, 
            "review": "Good food but service was slow. \n\nThe server was prompt to get our drink order but slow to take our order. Food came out promptly but the server didn't come to see if we needed anything after he brought the food over. No refills and has to flag him down to get the check and to go box."
        }, 
        {
            "index": 176, 
            "rating": 4, 
            "review": "Great find in Las Vegas! The chicken curry was delightful, chicken was very tender and filled with a myriad of eastern flavors, curry has just the right amount of heat. Saganaki was hot and crispy, but a bit salty for my taste buds. Service was superb, the ambiance is very pleasant and relaxing. Defiantly recommend it, and look forward to tasting more of their authentic Persian dishes."
        }, 
        {
            "index": 177, 
            "rating": 1, 
            "review": "Worst eggplant parmesana ever. Waiter messed up our orders and gave me something I didn't order. The baba ganoush tasted burnt.  I do not recommend this place if you are looking for true Arabic or authentic Italian."
        }, 
        {
            "index": 178, 
            "rating": 2, 
            "review": "Being a fan of Paymon's other location on Maryland Pkwy, I wasn't too fond of this one...here are my issues with the place:\n\n1. Too Americanized. Although decor is very nice and seemingly authentic, there is a touch of fakeness and not authenticity about it all; The waitresses are always recomending the more \"Americanized\" dishes and knew very little of the more traditional Mediterranean dishes the few times that I dined here. \n\n2. They started offering pasta! dishes!!! What travesty offering run of the mill spaghetti in a Hookah lounge and Mideterranean place, let's focus on the cuisine at hand!!!\n\n3. Kataifi, my favorite desert is gone!!!\n\nI still enjoyed my Fatoush salad and Baklava desert, and teas were certainly good, but food is still far from what it is at the Maryland location. It seems like the owners are trying to capitalize by abandoning more traditional fair and offering more \"poplar with the masses\" fair. I was not impressed and won't come to this location of Paymon's again, unless I am really pressed to find no other dining establishment (not likely)."
        }, 
        {
            "index": 179, 
            "rating": 2, 
            "review": "It pains me to give this a low review, but after being a faithful and long time customer of Paymon's dating back to the original location in the early 90's I had such a disappointing service experience that I don't think I will return.\n\nA few weeks back my family and I stopped in for dinner just past 9 pm.  Our drink orders were taken (tap water for me, an ice tea, and a child's soda) and menus were presented.  When the waitress brought back the drinks I asked if we could have a full house menu, as there was only bar food.  She said that the kitchen had just closed and this was all they had.  I don't a lot of fried food, and neither does my child.  He wanted hummus and pita, so I asked if she could go into the kitchen and see if there was any hummus or baba ganoush left, figuring I could always have it on a pita as a vegetarian sandwich.  It was literally 10 after 9, and the items I was asking for were no cook.  Plus, other diners were still being served from the kitchen.  She came back and said that the chef wouldn't be able to accommodate me, and that she didn't know why.  She apologized and said that she works every Thursday night and I could come back any other time after hours and get it.  Well...If I could have it on any other Thursday night after 9 pm, why couldn't I have it on that night?  Especially when other diners were still being served food from the full menu?  \n\nWe decided not to stay, and apologized to her.  She gave us a bill for the ice tea and soft drink which came to over $6!  We paid and left.  \n\nI have always loved their food, but no matter how much I want it, I doubt I will go back."
        }, 
        {
            "index": 180, 
            "rating": 3, 
            "review": "No longer my favorite restaurant in Las Vegas. The two previous years we were in LV on a business trip this was one of our favorites. This year the food seemed \"tired.\" I have heard people on \"Top Chef\" talking about putting \"heart\" into their cooking. This time Paymon's food had no heart, it seemed like it was phoned in. Also the service was so-so. Therefore my review is down from 5 stars. I don't mean you should stay away, especially when you most everything you can spend money on in Las Vegas is a rip off. I did not feel ripped off this year, just disappointed. See my review on the Himalayan restaurant on Flamingo for our new favorite/good buy restaurant."
        }, 
        {
            "index": 181, 
            "rating": 1, 
            "review": "Woah! I thought we would take a chance once more and what a disappointment. Again, we ordered our favorites, chicken curry and hot dolma (to go). One curry was ordered extra hot and the other medium. What we received was the regular curry with a douche of cayenne pepper. It was hot and only hot, no flavor. My medium curry was flavored with a long hair in it. The dolma was a huge disappointment. The leafs were not tightly wrapped, swimming in the tomato sauce with a wilted lemon and it was also flavored with hair. I hate to say it, but they have made their choice to ignore the restaurant and focus on the lounge.... so long to Paymons!!!"
        }, 
        {
            "index": 182, 
            "rating": 5, 
            "review": "I am not that familiar with Greek Food but this place certainly gave me a great experience! Got the Salad and Chicken and Rice... serving was huge and enough for two people. Flavor was good and very tasty. I could eat everything on the plate from the grilled chicken, to the grilled onions and bell peppers... everything was YUM! I was satisified and yet didn't feel very heavy after the meal. It was very healthy and cooked just right. Would love to come back again and try the other dishes! Price is not bad too, 16 bucks for one meal thats big enough for two!"
        }, 
        {
            "index": 183, 
            "rating": 1, 
            "review": "Me and some of my friends went here last weekend to smoke hookah. When we got there the place was crowded as usual, was not our first time coming here. There were 4 of us and we ordered 2 hookahs to share between us. The wait for us to get our hookahs after we ordered them was forever. A good 30 min if not longer. When they finally brought them out to us they were super harsh. They weren't hitting good at all, and to the point where we were choking. We told the guy and he blew it out and it was fine for about 5 minutes and then it was super harsh again and we weren't getting any smoke. We were annoyed and were just gonna get our check and go. We waited for our check for 45 minutes before anyone even came over to check on us. We could have literally walked out without paying and nobody would have even noticed. Finally for our check and then we left. Won't be coming back here anymore."
        }, 
        {
            "index": 184, 
            "rating": 5, 
            "review": "Best Mediterranean food in Vegas.  I'm surprised at the reviews. I've been a loyal patron for over ten years.  It's always very good.  Lots of flavor.   The Fesejen  is delicious.  The kabobs are amazing.  Love the staff.  Kind and very accommodating."
        }, 
        {
            "index": 185, 
            "rating": 1, 
            "review": "Ate here recently.  The food was ok but the service was just about the worst I have ever experienced anywhere here in town.  First off they \"ran out\" of not just their drink special but also the main dish I ordered.  Second, the service was terribly slow.  We are talking 20 minutes to get a glass of wine.  Third, when this was explained to the manager, he offered to take a \"couple\" drinks off our almost $200 tab, which I will just say was completely inadequate given all the gaffs that went into our meal.\n\nIf I wasn't there with a big group I would have walked out  and gone someplace that values my business.  Save yourself some headache by not \"walking in\" to begin with."
        }, 
        {
            "index": 186, 
            "rating": 4, 
            "review": "The food took a little longer than expected, especially since there was only one other table of customers there at the time. Its a good thing we werent in a rush to be somewhere. The food was excellent!!!! Service was good, Judy was our server and she was very friendly and attentive. Great atmosphere!"
        }, 
        {
            "index": 187, 
            "rating": 5, 
            "review": "Never in my life did I think I would be giving 5 stars to a Hookah Lounge of all places! I hate tobacco smoke, and am not fond of middle eastern style food. I TAKE IT ALL BACK!!! WOW!!!\nThe ambiance and décor of this place was remarkable. High ceilings, beautiful carpeting on the floors and walls. I for sure felt like I walked into the castle where Aladdin dreamed of living. \nThe hookah side was not too smoky and you could eat your food, enjoy your drink, and sit comfortably without being bothered by the other parties. I of course tried the hookah, we had watermelon margarita and it was good considering I don't smoke.\nBut the real treasure of this place. The food and drinks. Oh man. Ok so first I ordered their version of a cosmo with a sugared rim. Not bad, especially if you get it during happy hour. We had hummus, pesto pizza with red peppers, chicken masala, lamb kabobs, and salmon. \nI would order every single thing again. The lamb was perfectly cooked and the spices were not overwhelming. Same thing with the salmon. I loved that they had Greek and Italian options as well as curry, and other more authentic style Indian Cuisine. Then at the end, I tried the Bloody Mary. NO REGRETS even after being stuffed. The mix was house-made and it was spiced perfectly. My mouth literally waters for one as I type. \nI cant wait to go back, I probably wont hookah, but I will enjoy plenty of decently priced food and drinks. I hear they get crazy on the weekends, DJ and all."
        }, 
        {
            "index": 188, 
            "rating": 5, 
            "review": "I love this Paymons much better than the other one. The staff are fun and attentive and they have great customer service skills. The food is also amazing. I enjoy spending my Saturday night here !!!"
        }, 
        {
            "index": 189, 
            "rating": 5, 
            "review": "Come for happy hour, the prices are good for drinks, hookah and food. Fries and martinis - lychee ! Service can be a bit slow when there busy though!"
        }, 
        {
            "index": 190, 
            "rating": 3, 
            "review": "The chicken was of very good quality however, the lettuce seemed to be a little aged and wilted. Not much flavor to the hummus but the hot sauce they have is now one of my favorites. 16 dollars for a kabob plate seems a bit over priced to me compared to other places. Overall just a  average place."
        }, 
        {
            "index": 191, 
            "rating": 3, 
            "review": "Nice decor, great service, price was right. Best hummus I've had in long time.  However, Greek salad too dry and little fete cheese. Gyros dry with very little sauce, but more was bought upon request."
        }, 
        {
            "index": 192, 
            "rating": 4, 
            "review": "I like coming here, the ambience is good, food taste great not so expensive, good music a little loud - not the best place for a date maybe although you will enjoy it. \nThere is a good but not wide selection of Mediterranean food, nice selection of beers, and they play music videos on the screens. \nI come for the Hookahs, they have so many flavored here that it's hard to choose. \n1 round is 16 bucks and a refill is 13. A little expensive for my taste but not exaggerated. \nOverall good experience."
        }, 
        {
            "index": 193, 
            "rating": 4, 
            "review": "Came here on a hungry day with no expectations, and left with a happy face! One thing to remember here, sharing is caring. Portions are big and hearty and the fun part about that is you have more opportunities to try new things! I must say, as someone who has been a fan of Greek food for quite some time, it is difficult to find a falafel that is done right. You won't be disappointed with the little nuggets you get here. Crispy, crunchy, and smooth garbanzo texture. No burnt rubbery falafel in this joint! (which is refreshing to say the least). I wasn't particularly impressed with the roasted red pepper pita sandwich, a bit bland but edible nonetheless. One recommendation I do have is the veggie kabob, which features Mediterranean-style veggies grilled to perfection, especially the red pepper, yum! \n\nCame here for the first time the other day and will definitely be back to experience it night-style, hookah and all. If you like Greek food, this place is worth checking out!\n\nService: Quick and Friendly\nAmbiance: Busy but warm and comfortable\nPrice: Fair $$"
        }, 
        {
            "index": 194, 
            "rating": 5, 
            "review": "Absolutely love this place.  Great atmosphere, and the owner is possibly the best business owner I've ever met!!! One of the friendliest people!!! Hookah lounge is great and the food is absolutely to die for!!!"
        }, 
        {
            "index": 195, 
            "rating": 5, 
            "review": "When my wife and I first moved to Vegas in 2007, this was a place we fell in love with and frequented often. The food is excellent along with the atmosphere. We had a pre-New Years Eve party here in 2007 and all of our friends loved the place as well. The last time we were here was in the summer of 2009.\n\nThe curry is to die for and they will make the food super spicy if you ask. The outdoor area is great in the summer and inside the restaurant area is nice, though can be a little tight, so not a place you want to talk about anything too personal, though a great place to eat. The Hookah area is great, and while my wife isn't a smoker, she loved their jasmine and vanilla flavored tobacco.\n\nDownside, you can't smoke a regular cigarette inside, though who would need too since you have a flavored hookah in front of you?"
        }, 
        {
            "index": 196, 
            "rating": 4, 
            "review": "Surprisingly worth the wait! We had to wait an unreasonable amount of time for our food (other people got their orders first even after arriving after us). Our older waitress forgot to refill our soft drinks and just brought water. But she was trying so hard we just couldn't stay mad. Plus, the food was really delicious. \n\nThe decor in the cafe is tacky but nice enough."
        }, 
        {
            "index": 197, 
            "rating": 5, 
            "review": "The food is really delicious, big portion, the restaurant. I like the vibe, chill mood place to be in. Sweet waitress spastically Haley. In the hookah lounge u can eat, drink, smoke hookah, and dance it's the good mood kind place."
        }, 
        {
            "index": 198, 
            "rating": 4, 
            "review": "Good food and good service.\nNothing blows my socks off but the food is always good. \nTasty kabobs, gyros and lychee martinis! \nThe hookah is a little pricey.... My check is always over $100 for 2 people....\nI've heard of some new all you can smoke hookah joints, prob gonna check some out. I love their seasoned fries and hummus. Wish the pita bead came in a basket where it stayed soft. On the plate they dry out fast and get hard..."
        }, 
        {
            "index": 199, 
            "rating": 5, 
            "review": "My girlfriend and I come here a lot with her family. It's great because they have a little bit of everything... Mediterranean, Italian, Indian... So, whatever you're craving, you can get. And I love their hot sauce!"
        }, 
        {
            "index": 200, 
            "rating": 4, 
            "review": "Came here with two of my friends and we all enjoyed the food..  my friends got the combination platter & the lamb pita.. to be honest we were not a big fan of the lamb pita, there was like 75% vegetables and 25% meat which the lamb was very thin. But the chicken kabob was delicious!!!"
        }, 
        {
            "index": 201, 
            "rating": 5, 
            "review": "Best gyros, athens fries are amazing! Service is usually really good."
        }, 
        {
            "index": 202, 
            "rating": 4, 
            "review": "Really cool hookah hangout. We got a hookah and a refill for $15 and $12, respectively. Then we ordered a few beers and a combination plate with hummus, pita, falafel and fries. All came in a little under $60. \n\nThey had a DJ playing live music videos and there was a cool little dance floor. I believe this started at 10pm on Saturday. They have open seating but a reservation might be needed for a bigger party. \n\nI wouldn't say the food is phenomenal, but the portions were nice and it paired well with the hookah which was reasonably priced. \n\nI enjoyed my night. Good hookah and good vibes. I'll need to come back for all night happy hour with half off drinks and hookah on Tuesdays."
        }, 
        {
            "index": 203, 
            "rating": 5, 
            "review": "Took the family out to dinner at Paymon's last night. Food was great and service was excellent. We ordered curry chicken, gyro platter and two kids meals. Also, when I got the check it had a 25% discount for dining on Wednesday nights which topped off a great evening."
        }, 
        {
            "index": 204, 
            "rating": 5, 
            "review": "Excellent New Year's Eve dinner with family.  I love that every dish it tastes so homemade, unlike chain restaurants.  My Mom had the chicken marsala with artichoke hearts, mushrooms and s delicious wine sauce.  She said it was the best she ever had!  My sister the spanikopita and substituted rice with hummus and I had the chicken skewer dinner with Athen's fries (to die for! - very lemony and herby!)  and side salad.  Thank you for another great meal.  It's good to support another local small business.  Happy 2016!"
        }, 
        {
            "index": 205, 
            "rating": 5, 
            "review": "Great food and fun classy atmosphere. I love the menu because there is something for everyone. Everything I've tried has been good but my favorite is rice pudding with Turkish coffee. And the hookah lounge is a great place to hang out with friends after dinner."
        }, 
        {
            "index": 206, 
            "rating": 2, 
            "review": "Had high expectation, so wanted to like this place, was quite disappointed. So so service, ok ambience, food was bad. A good test is how well the lamb kebab is prepared, I had to send it back and get something else as it was super chewy like rubber, disappointing!"
        }, 
        {
            "index": 207, 
            "rating": 5, 
            "review": "I love their Athens Fries.  I am always happy with my food."
        }, 
        {
            "index": 208, 
            "rating": 5, 
            "review": "Excellent restauraunt! Paymon's is absolutely the best Mediterranean restaurant in Las Vegas, from the delicious food to the beautiful ambiance inside the restaurant and hookah lounge. Everything is well prepared and tastes fresh, the Gyro Salad here is to die for, simply perfection. This is definitely a must try in Vegas!"
        }, 
        {
            "index": 209, 
            "rating": 4, 
            "review": "I freaking love Paymon's Mediterranean restaurant!\n\nThis place literally has the best hummus I've ever tried! I've tried many other restaurants and no one even comes close to making hummus like Paymon's.\n\nThis visit was great! The food was great as usual and my server was very friendly and attentive to my tables needs.\n\nMy friend had the fried calamari, which she highly enjoyed and I had the dolmas stuffed with lamb and side of hummus. It all tasted delicious and was very fresh.\n\nOur bill came to about $32, which I thought was a great price for the amount of food your getting. \n\nIf your looking for a nice quiet place on a week day on a tuesday at 5pm this place is perfect. You can dine in for an hour or more, have a nice meal and catch up with a friend.\n\nOverall this place is great and I can't wait to try it again!"
        }, 
        {
            "index": 210, 
            "rating": 4, 
            "review": "Try the Chicken Curry Extra Spicy!"
        }, 
        {
            "index": 211, 
            "rating": 5, 
            "review": "Great food, staff is unbelievably nice. Service  is top, no complaints there. Friday/Saturday they have a Dj. Drinks and food specials are stupid good and they don't cut portions down. Hookah is good. Definitely a great stop for anyone just visiting!"
        }, 
        {
            "index": 212, 
            "rating": 4, 
            "review": "Paymon's is still one of my favorite Mediterranean restaurants in Vegas.  I've been here a dozen times (at least), and the service has only disappointed me once.  The food has always been consistently good.  This is also one of the better looking Mediterranean places, so it's a nice place to hang out.  They also have a pretty impressive menu.  They serve koobideh (ground beef kebab) which is my favorite thing in the world.  They also serve some Italian, and Indian dishes.  I haven't tried many of those yet, but it's nice to have options."
        }, 
        {
            "index": 213, 
            "rating": 5, 
            "review": "Amazing  high quality food , great costumer service \nAll the staff are so welcoming \nThis is the place we feel like hanging out \nOn weekends \nIt's perfect for birthday party or any kind of party"
        }, 
        {
            "index": 214, 
            "rating": 5, 
            "review": "Nothing but great fun, delicious food, yummy specialty drinks and AWESOME hookah here!!! You can't go wrong with Paymon's!!! \nHappy Hour In the Lounge daily from 5-7pm but on Tuesdays it's Happy Hour from 5pm-1am!!! That means drinks, some appetizers, and all hookahs are half off!!!!! The ambiance is always cozy, lights are low, with great house music. There are tons of original hookah recipes to try, even alcohol-infused hookahs like the 25 to Life or the Southern Belle.\n\nSome of my favorites hookahs:\n*One Night Stand\n*Southern Belle\n*Beautiful Disaster \n*North Shore\n*GWB \"Great White Buffalo\"\n*Caribbean Dream\n*The Sangria\n*The Criminal\n*Applejax\n*French Toast\n*The Mau5\nand more!   \n\nFavorite Specialty Drinks:\n*The Grape Gatsby\n*Pink Grapefruit Martini\n*Lychee Martini\n*Caramel Apple Martini\n*Desert Sunset\n*Tangerine Mojito\n*Arabian Night \n*Pear-sian Drop Martini\n\nFavorite Foods:\n*Chicken Curry\n*Steak Kabob (med rare)\n*Moussaka\n*Saganaki (flaming cheese)\n*Gyro Pita\n*Chicken Pesto Panini\n*Farfalle\n*Bruschette Salad\n*Wings\n\nFavorite Desserts:\n*Greek Rice Pudding\n*Tiramisu\n\nThis is the ORIGINAL and BEST hookah lounge in Las Vegas and I love working there!"
        }, 
        {
            "index": 215, 
            "rating": 5, 
            "review": "The premier hookah lounge of Las Vegas!  Great food, great hookah, great cust. service, and the ambiance is awesome!  Come lounge and enjoy a smoke!"
        }, 
        {
            "index": 216, 
            "rating": 5, 
            "review": "Great place to have a good time. awesome atmosphere. had the beef kabob plate which was SOOO good ! definitely coming back here"
        }, 
        {
            "index": 217, 
            "rating": 4, 
            "review": "Took my husband to lunch there today, he had never been.\n\nThe food was great and the prices are fair, which is good because the portions are medium not large sized.\n\nIt's always a great place for me to introduce people to Meditteranean food!"
        }, 
        {
            "index": 218, 
            "rating": 2, 
            "review": "Great menu of choices and specials, but highly mediocre food, at best.  When you claim to feature: Greek, Italian, Persian, Middle Eastern, Indian, and vegetarian dishes...you have the potential to be master of none.  Success!  This, unfortunately, is what they've become.  I've been a few times to try different items (kebabs, pasta, other)...and final and last straw was when I sent back my plate 3 times.   I'm done with Paymon's.\n\nI've never tried their Hookah, but I've walked thru the separate room from the dining side, and it's absolutely gorgeous.  Great lighting, beautiful artwork, and well-ventilated.  For locals, it could be a great night out with the buds, or a date -- but , make sure you get this, it's not 'Vegas'.  It's nice lounge, but you can pick-it-up and place-it-down in Anytown, USA.  Parking is easy, no hassle in the private lot, no valet necessary.\n\nIn the end, Hookah wins, but the food is middle-of-the-road."
        }, 
        {
            "index": 219, 
            "rating": 4, 
            "review": "Great service and food :) all my roommates come here and I finally got to try the place \n\nDefinitely coming back"
        }, 
        {
            "index": 220, 
            "rating": 4, 
            "review": "They make good gyros here so I always come here and get that. Think tender, juicy lamb and beef pieces stuffed in a warm pita pocket; their portions are quite large and I've had to ask for a doggie bag on several occasions. Also, you must must must order their Greek fries. Their seasoning is so amazing that they even have bottles of them for sale.\n\nThe downside of this place is the service and cook time might be slow at times, so be prepared for that."
        }, 
        {
            "index": 221, 
            "rating": 5, 
            "review": "Generous portions  of tasty dishes.   Everything  I've ever tried has been good.  My favorite is eggplant pannini.  Wish portions and prices were smaller.  I could then have room for dessert."
        }, 
        {
            "index": 222, 
            "rating": 5, 
            "review": "I've never had a bad experience here.  When I lived in Vegas I was here quite often with friends in both the restaurant and the hookah lounge.  Now that I no longer live in Vegas, I truly long for Paymon's.  My favorites:  The curry chicken, the bruschetta salad, the hookah & the baklava.  Whenever I am in Vegas, pretty much every meal is eaten at Paymon's.  Definitely TOP NOTCH!"
        }, 
        {
            "index": 223, 
            "rating": 4, 
            "review": "Fun and good food!!!! Love getting a variety of the Mediterranean delights!!! So good.... The best is their French fries OMG so good..... I love when they wash my hands with the special rose water.... This place really takes you away and you forget you are in a strip mall...."
        }, 
        {
            "index": 224, 
            "rating": 4, 
            "review": "My son and I were out Saturday afternoon and stumbled across Paymon's. I love calamari, order it first. If its a home run for me, then I stay and order entree. The way the calamari was just the way I like it, tender, lightly bread, full of flavor. I enjoyed the turkey sandwich... Great flavor.\nMy son ordered the falafel. Both delicious! Grandson enjoyed their french fries too. Service food atmosphere all good!"
        }, 
        {
            "index": 225, 
            "rating": 4, 
            "review": "I had the chicken curry and fell in love! I wanted to lick the entire plate clean! The stuffed grape leave were awesome I love those darn things. The fries were good as well. Went to the hookah lounge it was nice as always."
        }, 
        {
            "index": 226, 
            "rating": 5, 
            "review": "All I can say is wow. One of the best food I have had in a long time. Everything was fresh and amazing. I'm visiting from California and this was by far one of the best food I have had in Vegas. Excellent excellent food :) YUMMMMM TO MOSAKA. I don't know if I have the spelling right but this food was also excellent"
        }, 
        {
            "index": 227, 
            "rating": 2, 
            "review": "Got the gyros platter ($10.95 with gyros meat, rice, salad). Substituted the rice for fries which were really good. Salad was also good. The gyro meat however was bland, lukewarm and soft rather than crisp on the edges. They give you a ton of meat though, but no pita. All in all I'd give the food 3.5 stars. \n\nHowever the service was horrible. Our waiter didn't acknowledge us after taking our order even though he looked right at our table whenever he passed. We weren't offered refills until we we were completely finished with the meal. And no one wanted to give us our check. The service drops this place down to 2 stars."
        }, 
        {
            "index": 228, 
            "rating": 3, 
            "review": "My cousin and I came here last night for dinner. We were seated after a few minutes and they brought our drinks quickly. We ordered two appetizers plus our individual dinners. We had the baba ganush, falafel, she had the steak kebabs and I had the koobideh. The baba ganush was a bit bland but ok. The falafel was mediocre - over fried/too crispy for my taste. My cousin ordered a roasted tomato on the side. It was barely roasted and cold when it arrived. Our dinner platters honestly were the only thing that we were fully satisfied with. Our hostess wasnt terrible but she wasnt great either. We asked for to go boxes and she brought the boxes with the check and left, leaving us to do it ourselves. Okay no biggie. To leave an honest review Id have to give them 3 1/2 stars for the overall food and service. Regardless we didnt complain and we did leave a decent tip. We spent $65 between the 2 of us and to pay that much I would have expected to have a better experience. I remember their food and service being a lot better when they first opened up but that was many years ago. Seems to have downgraded a bit since then."
        }, 
        {
            "index": 229, 
            "rating": 4, 
            "review": "I really like this place. I used to live in the mediterranean and the food here is pretty spot on.  The atmosphere is nice although i havent been to the outside patio. There is a large menu with lots of different items on which can make it difficult to decide on a choice! The salads are really good but quite large and the gyros is really nice too. A plus for me for this place, is you get 50% military discount when showing your ID card. A meal for 2 of us with countless soft drinks came to under $20. Cant remember which night it is also, but one of the nights, there is a all you can eat pasta dish evening-different types of pastas and sauce. Will have to try that sometime. Will definately be coming back."
        }, 
        {
            "index": 230, 
            "rating": 1, 
            "review": "falafel were falAWFUL.\nburnt to a crisp through and through.\nthey were completely inedible.\nwhether it was old oil or old falafel, i don't care, it was the absolute worst falafel i have ever had in my entire life.\ni would not recommend this place to anyone who is looking for good mediterranean.  \nthere are plenty of other places in town that wouldn't even allow burnt food to leave their kitchen, let alone be served to you.\ni honestly can't even remember whether the rest of my plate was decent because the falafel were just that bad, they overshadowed everything else.\nthank goodness for the good company because otherwise, i would have left with a horrible taste in my mouth.\n\n*UPDATE*\none would assume that poor reviews would be used by the business owner as constructive criticism and as a way to improve in areas they may not have been aware that there was a problem.  i have no agenda here other than to review my exact experience at an establishment.  i stick to the fact that my falafel were burnt to a crisp.  i care very little how many awards were won and what other people think of this establishment.  my review is based strictly on my personal experience and when i dined here, my falafel were burnt to a crisp.  take this review however you'd like, but as the business owner, trying to convince me that your falafel is amazing when mine clearly were not, does not work.  i'm glad you have a loyal following and i'm sure it's deserved.  however, it still doesn't change the fact that my falafel were burnt to a crisp."
        }, 
        {
            "index": 231, 
            "rating": 4, 
            "review": "Love this place, the food is always great.  Service could be better, faster more attentive.  Everything is good!  Atmosphere is a little cooler than the east side, literally, it's freezing in there regardless what time of year, so not comfortable."
        }, 
        {
            "index": 232, 
            "rating": 1, 
            "review": "This review was meant for the cafe. As far as the hookah lounge goes, everything is pretty cool. I.E. decor, hookah, service. But today I figured 'what the heck,' and decided to have dinner in the cafe...\n\nFirst off, let me tell you that this place is like the Olive Garden of Mediterranean food. And by that, I mean everything looked and tasted as if it was prepared hours ago and had been sitting in a kitchen waiting for the rush to come in.  Possibly reheated. I dont know, but every dish I ordered reminded of  the cheap quality dishes you find at food chains like Sizzler or Applebees. Seriously, I love paymons for their hookah lounge but the quality of their dinner food was very very very disappointing. Stick to the hookah, get food somewhere else."
        }, 
        {
            "index": 233, 
            "rating": 4, 
            "review": "I'm a big fan of Mediterranean food.\nLove fresh salads and flavorful food.\nMy favorite items from their menu:\nGyros platter - plenty of gyros meat with saffron rice and side greek salad.\nCurry chicken with basmati rice - freshly grilled chicken in a light, but very flavorful curry sauce. This meal takes a little bit more time to be prepared, so if you don't have to much time to wait, you might get impatient.\nWhen I like to eat very light, I just order one of the Panini sandwiches. Tomatoes, basil and mozzarella cheese, grilled. Very yummy!\n\nBesides the full bar, they serve bottled water in the perfect size of 500ml, S.Pellegrino. \n\nService is always very attentive.\n\nWednesday's special: 25% off of entire bill!"
        }, 
        {
            "index": 234, 
            "rating": 2, 
            "review": "Service blows here. Not sure if its because its late, but they only have 1 server for the entire restaurant. They don't have any pasta after 9p, the waiter asked what we wanted and we asked for a minute, he never came back! 10 min later I chased him down across the restaurant and ordered. He brought out our appetizer and after we finished, he passed by 3 times and a buser 2 times. No one came to pick up the plate. The main food took forever. It's ridiculous."
        }, 
        {
            "index": 235, 
            "rating": 2, 
            "review": "I appreciate the owner responding, shows character and he stands behind his product."
        }, 
        {
            "index": 236, 
            "rating": 4, 
            "review": "I've been here a few times and I'm never disappointed. The portions are huge and always tasty. I really like the kabobs, especially the chicken. The fries and dipping sauce is pretty great too. I've never checked out the hookah side of the place but that looks fun too."
        }, 
        {
            "index": 237, 
            "rating": 5, 
            "review": "This place is jumping on a Tuesday! One of my favorite spots for Hookah, food, drinks and casual dates. The chicken curry with athens Fries is the best thing on the menu."
        }, 
        {
            "index": 238, 
            "rating": 4, 
            "review": "Good place to hang out n have simple good foods. We always come here and have a little snack and hookah if the mood is right. I enjoy lounging in this restaurants lounge over coffee and hookah"
        }, 
        {
            "index": 239, 
            "rating": 3, 
            "review": "Went for lunch last week. Athens fries are a must! I also had the chicken pita. The chicken was great! The pita bread was very dry. Not sure if that is how it usually is, or if it was just old. Service was s...l....o....w.... If you plan on going during lunch, be sure you have an entire hour, and work close by. Getting a refill took forever as well. They food was great, service is what brings my rating down."
        }, 
        {
            "index": 240, 
            "rating": 2, 
            "review": "As a restaurant this place is probably a 4 star location, the food was good and the service was quick. The most disappointing factor came from the Hookah Lounge aspect of the place, which was just downright embarrassing. Every single hookah in the building seemed like it was smoking nothing, hookahs had no clouds, barely any flavor, and it seemed like that was consistent with the one we got as well as just about any other in the building. \n\nYou're better off going anywhere else for hookah."
        }, 
        {
            "index": 241, 
            "rating": 4, 
            "review": "For Mediterranean or maybe Italian this place will make your belly happy.  I usually order the Athens fries and Falafel.  Eggplant parm was also good and filling.  Great atmosphere when you walk in from 100 degree weather. Great place to do a business lunch.  I give it 4 stars."
        }, 
        {
            "index": 242, 
            "rating": 5, 
            "review": "Great place to have a drink smoke and relax!  love the looks of this place the happy hour and the cooked cheese ! The Only thing is they should play chiller music like some ragas or Something smooth and sultry . It's like this epicly goregous lounge that's super romantic intimate and low key yet they have techno music BLASTING ! Lame!!!! lol . I wanted to take a star away for it but because they have such a great happy hour special I'm leaving them with 5 stars"
        }, 
        {
            "index": 243, 
            "rating": 3, 
            "review": "I have been here a few times before... Good environment, Decent Staff; BUT a little disappointed you can't sub Couscous or even Sweet Potatoes on their Fesenjan plate?! I would of paid the additional charge; But Denied"
        }, 
        {
            "index": 244, 
            "rating": 5, 
            "review": "Everytime I go to Vegas I make sure that I make a trip to this lounge.  The ambience is very nice and the setting is very chique. I love how the owner has been innovative enough to come up with his own spices. He also makes sure a live dj us always playing.  This is something I havnt seen in many hooka lounges. Food is dead on and very healthy... something that I care about. Only criticism I have is for Vegas, this place closes too early at 1am! Check this place out next time u are in Vegas."
        }, 
        {
            "index": 245, 
            "rating": 2, 
            "review": "what happened to the mediterranean food... when i go there now its all italian! I know italy is on the mediterranean (i hope ;) ) but what little mediterranean food they have on their menu is now just bad... this used to be a great restaurant that all my friends and i would go eat at, but now the food is just bad... Service was great though, dont get me wrong! I just didnt like their new menu... I havent done their hookah lounge and that may be good, but im not into hookahs..."
        }, 
        {
            "index": 246, 
            "rating": 4, 
            "review": "Great company. I love the laid back, relaxed atmosphere here. Not only do I love hookah, this is one of my favorite places to just relax and talk. It's not too loud like normal night clubs where you can't even hear yourselves talking. I love the service as well."
        }, 
        {
            "index": 247, 
            "rating": 1, 
            "review": "The girlfriend and I would come here weekly sometimes twice a week, it would be our little hangout and unwind spot before going out for the evening and plus we would take advantage of their happy hour. We have been coming here for about 4 years and ran into a problem once but they corrected the problem while there. However tonight is a different story...\n\n12/16/2015 @ 6:30pm\nWe arrived and went to the hookah lounge attached to the restaurant, it was busy as normal for a week night not overly packed we sat down and the waitress came and took our order, she even knew we came here regularly and commented about it. We ordered two waters and a lemon drop hookah - not a complex order by any means but the hookah lasted for 33 minutes 7:03pm I looked at my phone as the waitress never came back around to check our hookah, waters, if we wanted anything else not to even see if things were okay. So let the waiting game begin ... 10 mins turned to 20 ... Which turned into 30 while waiting and having the waitress walk pass numerous times, but her attention was to the gentlemen (whom I believe was the manager off duty - I've seen this man here almost every time we are there and I'm sure that's not by pure coincidence) and his friend to our left, but never rendered service to us until 7:38pm to while I told her I wanted her to fix the hookah but I'll just have the check as the service was horrible. I made sure I paid with my credit card so I would be able to dispute the charge as service was never rendered. I will be avoiding this place and going to the other hookah lounge our friends go to more often, this place was good but now the service look like lost puppy dogs running around without a clue.\n\n Overview:\nService is poor\nHookahs are okay\nFood is good\n\n I would not recommend this place to anyone anymore."
        }, 
        {
            "index": 248, 
            "rating": 4, 
            "review": "Visited Paymon's for the first time this past weekend for my Dad's 50th birthday. I was a bit leery when we walked in, it was not very busy. The hostess seated us right away and a friendly waiter got us our drinks. \nStarted with a Magic Carpet, my stepmom got a vanilla type of martini. Martini was kind of gross, but mine was delish (redbull, vodka, and chambord. Simple enough.) We had the combination as an appetizer, comes with falaffel, tabouli, baba ganoush, hummus, and bouranni and stuffed grape leaves which I always avoid at all costs. My homemade tabouli is much tastier, but the rest was very very good. This was all new to my Dad and he was impressed. Dad got chicken fesenjan, which he swore was amazing, as a vegetarian I refused to taste it, so all I can say is my Dad is a total meat and potatoes guy, and he was about to lick that damn plate. Hubby had meatball sandwich, not really sure why they serve Italian here! I got the eggplant panini and was not impressed, a bit bland, just a plain mushy sandwich. But the FRIES... omg YUM they really are great!! We finished up with some tirimasu, heavy on the rum, just the way we like it, and some sort of dessert martini which they added dark chocolate to at my request. All of the food was good, not super amazing, and I should have avoided the Italian and enjoyed Meditteranean. I would go back, great atmosphere! We had my kids and sadly could not enjoy the hookah, but the lounge smelled divine when we passed by it!"
        }, 
        {
            "index": 249, 
            "rating": 4, 
            "review": "My friend K and I flew into Vegas for the Rock n Roll Las Vegas events. Seeking a healthy and yummy lunch, K suggested Paymon's. She'd discovered this place when she had a project in LV and I was happy to go along as I love Mediterranean cuisine.\n\nA little ways off the strip, this gem can be found in an unassuming strip mall. The restaurant itself is quite large and it looks like from the doors that they have expanded into adjacent storefronts a few times. I can see why :)\n\nWhen we arrived for a late lunch, we were quickly seated by a friendly hostess. Our waiter was great--checked in with us regularly and helped us figure out how much to order without over ordering. \n\nWe decided to split a plate because he advised us it was large--it was! The chicken kabob skewer has 10 ounces of meat on it! We also split a side of dips--the babaghanouj and the yogurt dip. The baba was probably the best I've ever had! It comes with a side of white or whole wheat pita. When we ran out, we were offered more pita or sliced veggies (super healthy--love it!)\n\nThe chicken kabob plate was perfect for two fit friends to split. With 10 ounces of grilled chicken, we each got ample protein. It also came with a greek salad, roasted red peppers and a great rice dish. We finished most, but not all of the plate--that's how large it was.\n\nSince we were visiting and didn't have a car, we asked our waiter to call a cab and he quickly obliged. When one didn't show up, he checked in, found out the cab company was in the middle of a shift change, and took the initiative to call a second cab company so that we wouldn't have a much more prolonged wait. \n\nIf I lived locally, this would definitely be a place I'd come regularly. Tasty food, good portions and great service--winner in my book!"
        }, 
        {
            "index": 250, 
            "rating": 4, 
            "review": "I took my daughter here who is in college in Arkansas, she said her friends told her she should try of mediterranean food, but she was uncertain of eating it. Well she knows her mom loves international food so we headed to Paymon. We shared a lamb kabob dinner since we are both light eaters. She loved it. She loved the \"cinnamon rice\" as she called it AND the greek salad, AND the saganaki (sp).  Now she says when she goes home she's going to try thebplace there and hopes it will be just as tasty."
        }, 
        {
            "index": 251, 
            "rating": 2, 
            "review": "I heard really good things about this place for a long time. So I decided to take a friend there for  lunch.  I ordered the kabob platter which was very bland.  My friend ordered a gyro but when the order came out it was a chicken gyro. When she pointed out the mistake the waiter took it back with apologies.  Totally forgiveable. But a moment later you could loudly here the kitchen staff arguing with the waiter about the mistake.  The waiter then very quickly returned with the correct order.  The service was very good untill the end of the meal when I  wanted the check.  The waiter was nowhere to be found. I had to ask the bus boy for the check witch the host brought to the table.  I was a very disappointing experience after all the great things I have heard.  I'm hoping it was just a bad day. I will give this place one more shot but it may  be a while before I return."
        }, 
        {
            "index": 252, 
            "rating": 2, 
            "review": "Paymon's has always been a local favorite, but I can only provide a very mediocre review. \n\nWe came in about 6 on Friday evening. The place was not busy, and the hostess greeted us right away. Fine. But she takes us to a table literally steps from the front door, directly in line with the kitchen door. Can you say freeway? Could have asked for another table, but I didn't...so my bad, but I don't think I should have had to...\n\nServer came and took orders promptly, ok so far. Hummus appetizer comes out quickly, always delicious. Then the entrees came out, gyros salad for me, falamus pita for my wife. also delicious. Maybe not exactly authentic Mediterranean food, but yummy nonetheless. Shared a few Athens fries...these are the bomb.\n\nSo what's the problem? Indifferent service.  Our server did not once stop and ask how we were doing. After he took our order, he literally disappeared. A different server brought the food out, and of course our server didn't bother to check if we got everything we needed. He must have passed our table 10 times without so much as a nod of the head. I even had to flag him down for a water refill! \n\nWe finished eating and just sat there. No offer of dessert, nothing.  I flagged him down for the check, since by that time I was getting annoyed and just wanted to split. \n\nWe like Paymon's and will probably go back, but if the service is as poor  next time, we'll move on."
        }, 
        {
            "index": 253, 
            "rating": 3, 
            "review": "I heard a lot of very good things about Paymon's, so of course I wanted to love it.\n\nWe head there for lunch after work and are seated in the dining area, not the hookah area. \n\nI will say, having fresh Athen's fries is a must with their special sauce. They are definitely special.\n\nI had hot green tea with honey and it was delicious :] served in a pot.\n\nAside from Athen's fries we had calamari for an appetizer which was the fried variety-just how I like! And a big serving for the price of about $10.\n\nI had the Greek Pie.. I forgot the name but the menu read that it had a baked béchamel sauce on top.\n\nOverall it was forgettable. It was served with a side of veggies. Pretty much tasted like a soup.\n\nSomeone got the meat kabob gyro which was said to be very good.\n\nAnd for dessert we shared an unimpressive baklava.\n\nHad take out a couple of weeks later from here and had the chicken Marsala and also had a bite of chicken parmasen.\n\nHelped keep my rating to a 3.\n\nOur server was great but it ends with the food which was meh. \n\nBig complaint is the small tables. Sooo annoying when the plates are so big."
        }, 
        {
            "index": 254, 
            "rating": 5, 
            "review": "Just driving around, looking for something different to eat. Saw the sign and wandered in. Paymon's could best be described as a middle-Eastern-fusion place, no that doesn't quite describe it. First of all the interior is breathtakingly beautiful; and the ambience is matched by the food. They have Greek, Italian, Indian, and Persian dishes (in alphabetical order), and sandwiches, all very reasonably priced. We started with a combination of dips and pita bread: hummus and yogurt-cucumber (actually tzatziki but who can pronounce that?). Next was the lentil soup with melted feta cheese. One of us had Tandoori chicken and the other had chicken curry, both out of this world.\n\nNow an aside. There were two Las Vegas Metro Police officers seated adjacent to us, and that day was the day they buried one of two officers who, a week earlier, had both been shot in the head and killed while dining in a restaurant. Now the Las Vegas cops are awesome for what they do every day, but I can't imagine how it must feel to sit down for a restaurant meal, after that incident, not knowing if there's some other nutcase who's going to walk through the door and open fire on you. Of course, the fact that cops eat at Paymon's is a recommendation in itself.\n\nI can't wait to get back to Paymon's and check out the rest of the menu, or maybe I'll order the Tandoori chicken the next dozen times. You really owe it to yourself to try this place, it's every bit as good as those fancy Las Vegas Strip hotel restaurants that bear the names of famous chefs who never visit.\n\nHookah lounge, sealed off from the restaurant (untried). Open 11 AM-1 AM every day, take-out until 8 PM. Cocktails. Credit cards."
        }, 
        {
            "index": 255, 
            "rating": 4, 
            "review": "I can't complain about the food. Everything was pretty good... the hummus, yogurt with cucumber dip, falafel, steak kabobs. The kabob was a huge serving that my wife and  split and couldn't finish. The quality of the meat was good and correctly cooked to the requested temp. It didn't come with Basmati rice, but did have rice pilaf with a wonderful butteriness to it.\n\nTheir menu is ridiculously large with cuisines including Italian, Mediterranean, Persian, Greek, and Indian. In my opinion they'd be better off with a more focused menu, but I guess they have to do what they can to attract the most customers. They even have a kid's menu with all the typical kid stuff. \n\nService was decent and prices were ok. The interior looks a little dated but it was comfortable enough."
        }, 
        {
            "index": 256, 
            "rating": 5, 
            "review": "Best Mediterranean spot in Vegas! Our server Ben sugested some wonderful dishes and provided excellent service. Highly Recommended!"
        }, 
        {
            "index": 257, 
            "rating": 5, 
            "review": "The food was excellent.  I love the atmosphere, the drinks and the blueberry tobacco."
        }, 
        {
            "index": 258, 
            "rating": 5, 
            "review": "i crave the Lentil Soup... and they have an incredible Greek Salad.  The kabobs are delicious also...the fries are next level.   (Also..the red hot sauce, and the Greek dressing is delicious..and is for sale in the restaurant... YUM!!! I love the Hookah lounge at the Sahara location..and I love the outdoor courtyard at the Maryland spot. I think they would be more respected if they didn't offer  italian food... keep it \"mediterranean...\" Just my opinion.  Also... they have delicious iced tea.. their \"adult beverages\" are pricy, and again...the hookah lounge... well, its pretty fab."
        }, 
        {
            "index": 259, 
            "rating": 4, 
            "review": "I went here after hiking, so my review might be skewed by excessive hunger at the time of arrival, but I really enjoyed it.  The interior of Paymon's is well decorated and cozy, but it's not at all a snooty atmosphere and casual wear is perfectly fine (that said, I will say that I felt underdressed whilst wearing my hiking clothes and desperately needing a shower post-hike).\n\nThe prices are a little on the higher side, although apparently there is an all-you-can-eat pasta special for only $9 (it seems like a good deal to me, but I'm not a big pasta fan so I didn't order it).  A simple vegetarian pita sandwich with no sides runs on the order of ~$8-9. I had the Eggplant pita, and it was overall very good.  The ingredients (grilled eggplant and roasted red peppers) tasted very fresh and the pesto sauce had good flavor.  It wasn't the most overwhelming sandwich I've ever had, but I would be inclined to order it again.\n\nThe thing that stood out the most in my experience was the flaming saganaki (greek cheese).  That was FANTASTIC!  I am a fairly picky cheese eater, and was extremely happy when I tried this.  The texture was excellent with a crispy outside and gooey inside, and the cheese itself had a very elegant flavor. \n\nI will definitely be going back to Paymon's in the future, and am excited to try some of their other dishes!"
        }, 
        {
            "index": 260, 
            "rating": 4, 
            "review": "Husband and I were here for dinner love the decor he had the chicken marsala it was a bit too smoky but still delicious with pasta kind of disappointing that they didn't offer price for another option. It was great to see that they have loose leaf tea to drink my favorite... The rice pudding is amazing...\nDavid was our server and he was great at explaining the dishes..."
        }, 
        {
            "index": 261, 
            "rating": 4, 
            "review": "Absolutely fantastic food. The hummus and pita app was great. I had a falafel on pita sandwich. It was the best I've had in years. Staff from hostess, waitress and busboy were all very happy and friendly. Walking up to restaurant, I was doubtful. A hookah lounge was not my idea for a place to eat lunch, but my daughter had been there before. Its in a small strip mall and an old one at that. But when we walked in, I was pleasantly surprised by the friendly and attentive staff. The hummus was creamy and the pita warm and fresh. The only problem with my sandwich was the falafel was a bit too large and kept rally out of sandwich. Very small problem. I'll definitely be back, next meal will be the moussaka! Give it a try!"
        }, 
        {
            "index": 262, 
            "rating": 4, 
            "review": "Service initially was slow. We waited at our table for quite a while before anyone acknowledged us. Once the server came, the service was pretty good until the end, when it got slow again. \n\nMy brother and I agree that the fries used to be better.  The falafel might be the best falafel I've had- although I wanted chopped white onions and  they only had red.  I had to ask for more Tahini sauce to bring it to my taste.\n\n\nMy brother said the gyros were good,  but needed more sauce as well. \n\nFor dessert we had the rice pudding with whipped cream and cinnamon: excellent!  \n\nIf I had it to do over again, I would order basmati rice instead of the fries. \n\nWe had a Greek salad which was just fair- mostly lettuce. ;(\n\nAll in all, a fine experience & I will eat there again."
        }, 
        {
            "index": 263, 
            "rating": 5, 
            "review": "Tonight, I tried the turkey panini.  OMG....it was so delicious. The orzo salad that came with it was perfectly complimentary with the panini.  I don't care of you come here and always order the same thing, try this once.   You'll thank me."
        }, 
        {
            "index": 264, 
            "rating": 5, 
            "review": "Nice classy venue with nice kitchen and ambiance.  \nWarm staff - Kim and Chrissy - very sweet and attentive.\nGreat for happy hour or a good meal - restaurant or hookah lounge."
        }, 
        {
            "index": 265, 
            "rating": 5, 
            "review": "They have good food and service.  Atmosphere is cozy and comfortable.   Prices are reasonable too"
        }, 
        {
            "index": 266, 
            "rating": 2, 
            "review": "Meh is right.  It's been at least 5 years since my last visit, so when I was craving Mediterranean recently it was my first thought based on my past experiences.  I have to say I was really disappointed.  My kabobs were tough and lacking in spices and flavor.  The fries app, though, is still one of the best I've had."
        }, 
        {
            "index": 267, 
            "rating": 2, 
            "review": "Car lunch one day and enjoyed the busy atmosphere but thought it was a big pricey for a gyro and athens fries.  Even though it was not at the height of the lunch hour I had to flag down my waitress to order, flag her down for my bill and had to ask another worker to help me to get a to-go box.  Not the most attentive/ available wait staff that day, but that may not be a reflection of the service overall.  Glad to have tried it but probably wouldn't come back."
        }, 
        {
            "index": 268, 
            "rating": 5, 
            "review": "Great mediterranean food that tastes authentic. The hummus was amazing. And having Hookah after a big meal was perfect ending . Will return to eat and smoke hookah! Should try this place, you will like it if you are into Mediterranean food!"
        }, 
        {
            "index": 269, 
            "rating": 4, 
            "review": "TIP: good for family and / or friends (hookah lounge)\n\nAddictive athens fries, killer lamb kebobs, huge portions, reasonable prices, even good coffee, gyro plate was 10.95 which was a good deal considering how much food and meat they give you, the combo appetizer was really good, had everything from hummus to baba ganoush; you know this place is good when there's both zagat and yelp stickers on the front door.  Their menu is extensive, even have italian food.  there's even an unlimited pasta deal which you shouldn't get because the kebob plates are a must try."
        }, 
        {
            "index": 270, 
            "rating": 3, 
            "review": "The restaurant was recommended by the people at Vapeco next door.  The service was helpful and friendly.  We ordered the fries and appetizer plate.  The fries came highly recommended.\n\nFood was good and filling.  Would definitely go again when in the area."
        }, 
        {
            "index": 271, 
            "rating": 5, 
            "review": "The best Persian Style food and hookah I've ever had :) Love it :D The music was awesome :)\nI came here 2 times and I will come back every time I came to Las Vegas :D I love the Koobideh :D"
        }, 
        {
            "index": 272, 
            "rating": 4, 
            "review": "Paymons is one of my favorite Mediterranean establishments in Vegas! I have never tried the Hookah lounge, so my review is based only on the restaurant side. First off, I have to mention the décor. I love the way it's decorated, and I think that it adds to the ambiance of the establishment. \n\nThe menu is quite extensive with your typical Mediterranean offerings with some Italian and Indian thrown in. I usually get one of the kabob platters. The meat is high quality and the portions are very large, I usually end up taking about half home. They not only give you normal rice typically seen at a Greek or Persian restaurant, but another dark colored spice rice, which is my favorite!\n\nI believe they do 25% off for locals on Wednesdays. It gets a little busy, but nothing unreasonable."
        }, 
        {
            "index": 273, 
            "rating": 4, 
            "review": "I'm not a hookah-girl, but that room that they've got at the Sahara location is absolutely beautiful.\n\nHere's what I have to say about Paymon's-- the food is excellent.  My favorite thing to get is a Greek salad and add on the salmon.  They make a light, but flavorful house dressing, just the right amount of cheese, and plenty of veggies.  It's definitely enough to fill you for a whole meal, or to share with a friend while you also order a round of their great appetizers (like hummus, grape leaves, etc).  \n\nIt's also a good starter place if you are new to Mediterranean and Greek fare as the staff is generally knowledgeable, and the menus are pretty comprehensive. \n\nIt's a great place to eat for a casual date or lunch meeting."
        }, 
        {
            "index": 274, 
            "rating": 3, 
            "review": "I didn't dine in, so I can't rate this restaurant based on their service, only their food which I took to go late at night.\n\nThe server who took my order was lovely, and provided me with one of their late night menus which is more limited and doesn't provide any pasta options. Just fine with me, I came in for a salad anyway.\n\nThe wait for the food was short, and it was packaged nicely when I got home. I ordered the Greek salad which came with romaine, red onion, pepperoncini, feta, tomatoes and olives. The olives were quality with the pits still in them, and the pepperoncini were served whole in the salad. The tomatoes you could tell had been refrigerated for a while as they had no taste except to be slightly sour with a mealy texture. The feta was dry and grated which was very strange to me. I prefer a creamier, softer feta, the kind that comes packed in water. I usually associate dry feta with poor quality. The vinaigrette was thin, thank goodness as I hate syrupy dressings, but I still added some red wine vinegar to my salad at home because it lacked the acidity I was looking for.\nI also got a side of rice, and it came with white basmati rice topped with some saffron basmati rice. It was decent, but tasted heavily of butter. I can only imagine how much they probably used when steaming/reheating it.\n\nThe ambiance here was very pretty and I can see this easily being a nice late night lounge for locals who live nearby. But the food quality was lacking in authenticity for me, and I think I'll stick to my favorites unless I'm in a late night bind."
        }, 
        {
            "index": 275, 
            "rating": 4, 
            "review": "I haven't tried the Italian food, but the Mediterranean and Greek food are really good.  Falafel is tasty, as well as the gyros.  It is a bit pricey though, wish it was a few bucks cheaper.\n\nThe hookah lounge can get pretty crowded on the weekends.  One time there was a big party and it was so loud we had to ask to be moved to the outdoor patio in order to hold a conversation.  You only get one coal though (it lasts a long time) but they will adjust if the hookah gets harsh, but not replace the coal unless you buy a new head."
        }, 
        {
            "index": 276, 
            "rating": 5, 
            "review": "Paymons never disappoints. I have been going to his restaurants since it was a market with a deli stand in the back on Maryland. He has perfected his art. From the fries to the hot sauce to the secret recipe hummus paymon's mediterranean is unique in its class. I am always excited to introduce people to this spot because i know it will become their favorite. This is a must!"
        }, 
        {
            "index": 277, 
            "rating": 2, 
            "review": "Walked in, didn't get greeted had to look for a waitress. We sat outside about ten min no service, went inside to look for someone we sat inside asked about the flavors of hookah she told us the flavors and walked away to a guy that walked sat down talked to him for a couple mins and had to get her attention again to get service!!!!!!! Finally got our hookah noone came to check on us and see if we were doing okay in that hour. Wanted to pay and once again had to look for the waitress to get our check. We got the check, and she didn't come get our check (paying by credit card had to wait) for about 25?) min, waitress passed by ask her to take it shes like ill be there to get it in a min 15 more min passed and nothing!!! Most likely won't be coming here again. I felt like we were playing tag or hide n seek with the waitress!!!!"
        }, 
        {
            "index": 278, 
            "rating": 5, 
            "review": "I've been to over 7hookah lounge in town and paymond on sahara is defitnetly my favorite the food and hookah taste delicious and the service great they deserve 5stars also on the weekend they have a dj and you can enjoy and dance!!"
        }, 
        {
            "index": 279, 
            "rating": 5, 
            "review": "Athens fries and a Gyro salad. Yummy yummy in my tummy"
        }, 
        {
            "index": 280, 
            "rating": 5, 
            "review": "This is definitely my favorite Mediterranean Restaurant. My Mom and sister come here to eat healthy... they get soup with salad and some tea while I absolutely crave their Athens Fries and Rice Pudding. I never even liked rice pudding until I had it here.\n\nMy favorite dish is the chicken curry but I swap it out occasionally and it's always good.  This place is never packed so you can always get in and the service has always been really good with no issues."
        }, 
        {
            "index": 281, 
            "rating": 4, 
            "review": "Good all around restaurant.  Great service.  Good eats.  I recommend the following the \"Chicken Marsala\", \"Lasagna\", and the \"Koobideh Ground beef kabobs\"."
        }, 
        {
            "index": 282, 
            "rating": 3, 
            "review": "This was my second time coming here and I wish I could give it a 4 or 5 but what stops me is that the service was SLOW...given that it is Valentines Day but our server did not greet us until 10-15 minutes after sitting down.  Then she failed to check on us throughout the meal, had to ask about refilling our drinks ...\n\nOh well, onto the food: the lamp kabobs were ordered medium but it came in overdone.  The boyfriend did not enjoy. \n\nI hope my next visit will be better... Will try the hookah lounge."
        }, 
        {
            "index": 283, 
            "rating": 5, 
            "review": "Yummy!! We love Paymon's. We love it so much we had our rehearsal dinner there!!  We love the pitas and fries and the chicken tandoori. Kabobs are great too! Their Italian menu is tasty as well. Lovely interior and the waitstaff is very friendly. Pick up some Paymon's Athens Fries Seasoning to take home and make delicious dishes with it!"
        }, 
        {
            "index": 284, 
            "rating": 4, 
            "review": "I'm a big Paymon's fan, but this was my first time at this location.  Like all the times we've eaten at the Maryland Parkway outpost, our lunch experience was great.  Our group of 3 started off with some hummus and baba ganoush, complete with warm pita wedges.  Delicious as always.  Two gyros (one traditional and one falafel) were ordered along with a huge gyro salad.  It was all excellent.  Service was fast, friendly, and efficient.  Lunch was quick and tasty. Can't beat that!!"
        }, 
        {
            "index": 285, 
            "rating": 4, 
            "review": "Oh sweet Paymons. I wish they would not try to cover the gamut and just do what they do well. Ill admit that I tend to stick with known quantities here because I find if I wander too far off things get... variable. I also find that I really like the Maryland location in comparison to the other.\n\nWith that said, the chicken curry sauce here is to die for. Its creamy and rich and spicy and just addictive. The chicken is always juicy and well seasoned. As for the rice, ditch the jasmine and ask them to substitute Turkish rice because it goes so much better with it.\n\nTea suggestion: Morroccan blend!"
        }, 
        {
            "index": 286, 
            "rating": 3, 
            "review": "I love falafel, but I never get to have it.  Greg always chants, \"Falafel is awful.\"  Partly because he likes the rhyme, partly because he knows it annoys me, and partly because he hates falafel.  I was super excited when he suggested Paymon's for lunch.  He tends to avoid Mediterranean restaurants, because he always says, \"Isn't that whole area a little iffy?\"  Paymon's serves what I think of as non-threatening food from a foreign country.  Nothing is very strange, falafel is perhaps one of their stranger things on the menu.  Everything is amazingly overpriced.\n\nGreg had the pastitsio, which is basically bland Greek lasagna, something that I could never get excited about.  (Apparently, this is no longer on the menu).  I had the falafel which had really large patties.  I prefer my patties smaller and crispier.  The fries were just superb though.  I could go to Paymon's for just the fries with their strange mustard like fry sauce.\n\nThe thing that pissed me off though is when we ordered a pot of tea.  They have a great selection of tea to order from, but when we asked if we could split a pot of overpriced tea, we were informed that it wasn't allowed.  Really?  Everyone has to get their own POT of tea...not a glass, a pot.  You can't split a pot of tea.  What a joke of a restaurant showing that they really just care about ways to make money!\n\nPaymon's, by the way, is the restaurant that gets called in about on KNPR constantly.  Whenever they have a food critic on, people call in and rave about Paymon's.  It got the point that people at KNPR usually mention that they will not be taking calls about Paymon's and that Paymon's is just all right of a restaurant.  The people that called in about Paymon's apparently were over-enthusiastic employees."
        }, 
        {
            "index": 287, 
            "rating": 1, 
            "review": "So I've been going to Paymons for a long time now and up until tonight I've had an overall great experience.  And then tonight one of of us long time customers were thrown out because we were wearing a tank top. The waitress, after serving us food and drink, decided to remind us that one of us was wearing a tank top and it wasn't acceptable. They told us to leave and that the food would be their treat. How fucking generous!!!!!  I've been going to Paymons for years now and was astonished that were asked to leave in the middle of our meal.  After all of the money I've spent time after time at Paymons I was shocked To be asked to leave!!! Literally in the middle of our meal they said we had to leave due to our dress code. Mind you they weren't even sold out!!! What a solid disappointment!!!!!!!!"
        }, 
        {
            "index": 288, 
            "rating": 1, 
            "review": "We live in Las Vegas and were told men couldn't wear tank tops to smoke hookah. Eh?? We ran across 2 different servers and werent told until we were about to sit down that unless we had a shirt in the car we couldnt sit. Completely ridiculous. We just left and went to another (and better) hookah lounge. If you have dress codes it should be clearly displayed and the staff should let you know before you're about to sit down. \n\nDefinitely will not return!"
        }, 
        {
            "index": 289, 
            "rating": 4, 
            "review": "5 minutes from where I work so I love the convenience.  I always get the combination platter cause I love the hummus and the fries. I tend to get the iced tea to wash my grub down and it's fresh brewed and delicious. Middle of the day service is great cause it's not too crowded but later in the evening at dinner time it slows things down a little cause this place is pretty popular. Great music and friendly service. Oh and the food is pretty damn good too!  :)"
        }, 
        {
            "index": 290, 
            "rating": 4, 
            "review": "Got a chance to head back up to Paymon's last night for a few drinks with some coworkers.  Returning after a little over a month ago Paymon's was just as I remember.  The vibe last night was relaxing and our hookah expert immediately brought out the special mix to complement our drinks and Athens fries.  Overall, the service last night was a little on the slow side, however, the food, drinks, and hookah were all on point and my fellow coworkers found a new place to hangout at."
        }, 
        {
            "index": 291, 
            "rating": 5, 
            "review": "Seriously good food, good hookah, decent music,  great service. What more can you ask for? Love this place. Tuesdays are locals happy hour. This place is awesome. Love it."
        }, 
        {
            "index": 292, 
            "rating": 3, 
            "review": "Went here with friends for some kabob koobideh. My boyfriend ordered the Fesenjoon. The Fesenjoon was awful. Not authentic tasting at all. The koobideh was mediocre. I prefer the location on Maryland, as their koobideh is much better. Service was fine.\n\nI would say their best dish was the appetizer sampler platter. Came with falafel, babaganoush, hummus, tabouli and athens fries."
        }, 
        {
            "index": 293, 
            "rating": 3, 
            "review": "I was a first timer and I had mixed feelings. I came in around 10pm for a late dinner and the restaurant side was empty. There was one table. I literally waited 20 minutes at the front waiting to be seated. I saw a few waiters walk by but was not acknowledged. Eventually a male waiter came by to seat us.\n\nThey have a late night menu. The only difference with this menu is that they do not have the pasta offerings as they do during the day. I ordered the combination appetizer to taste most of their appetizers. That was worth it! It came with a very big portion. I also ordered the pita gyro and the chicken kabobs. Both very delicious meals. I also ordered the greek rice pudding to go. That was so yummy, it's a must! \n\nThe waitress was nice and everything, but they should really work on having someone at the door to sit people, cause standing there for 20 minutes was a complete waste of time."
        }, 
        {
            "index": 294, 
            "rating": 3, 
            "review": "Came to Las Vegas from Texas and this place was on our \"must visit\" list for the hookah lounge. We come in and order our food only to find out that the entire hookah lounge has been rented out for the entire night. The entire lounge?? I feel like thats really unfair to advertise this place as a \"hookah lounge\" when the lounge isn't even open to the public. Besides that, the ambience is great and romantic. The food was decent. I enjoyed the bruchette salad. My advice is if you're going here to visit the lounge, call ahead and make sure some rich asshole didn't rent out the joint first."
        }, 
        {
            "index": 295, 
            "rating": 4, 
            "review": "Even though Paymon's is a bit overpriced I have such warm fuzzy feelings for it. I had my first date with my boyfriend there. It was his pick. Yay for originality!\n\nI like that there is a bit of flexibility in their dishes. I can have pasta, or curry or gyros. So there isn't a big fuss if a group of us want to eat there and all have different tastes. My usual for quite awhile was the broiled steak kabob. The meat is always very tasty (but not always the most tender) and the basmati rice fluffy and nicely spiced. The vegetables are always overcooked. Not that I'm a bit fan of them anyway but I might be more enticed to eat them if this was not the case.\n\nMy current favorite is the chicken curry. I get it about medium spicy but then I cover it in their racy red sauce. I could pour that on just about everything it's so good. The hummus is my  mom's favorite dish. I like it too but it is so filling that I usually can't finish my entree if we get it as an appetizer. The gyros are nice, the meat is not dry and they are really smashing with a side of Athens fries. The sauce that comes with the fries is pretty addictive."
        }, 
        {
            "index": 296, 
            "rating": 1, 
            "review": "Came here for the first time with a group of friends. We love hookah. It was so hard to get the servers attention. And when he came, it took him forever to bring us our drinks. We ordered a round of shots at the beginning of our stay, and about a half hour in, they still hadn't come. Hookah is overpriced and not worth it. I wouldn't recommend this place. It's really a shame that the service is so terrible here. I had high expectations."
        }, 
        {
            "index": 297, 
            "rating": 3, 
            "review": "I have been coming here for a few years now and the food is pretty good. They have the best Athens fries which are addicting. I usually get the salmon cube kabob which is really good had some other stuff on the menu as well like their panini which  was good as well. Their Moroccan hot tea is really good. Last time I went my friend he ordered the beef shish kabobs which were like gum and regretted that he didn't listen to my advice and not order it maybe it was a off-night! As for the decor I think it's outdated and in need of a makeover!"
        }, 
        {
            "index": 298, 
            "rating": 3, 
            "review": "Love the food here. The service is usually pretty spot on. They are flexible with customizing dishes. We've been here several times. My only complaint is they keep the door open between the restaurant and the hookah lounge. I don't feel like coming to eat and inhaling second hand smoke. I'm not sure what the purpose of leaving it open is. It's not fair to restaurant diners who don't want to smell that stuff and want to enjoy their food. I hope they will consider closing it going forward."
        }, 
        {
            "index": 299, 
            "rating": 3, 
            "review": "Interesting. Italian, Greek, and Persian food all mixed in to one place. And you know what ; it works.\n\n I eat a lot of middle eastern food and this is actually pretty good. The humus and Babaganoush were pretty good. The chicken kabob was good, the ground lamb was good, although the beef was chewy. Deserts are good, and I really liked their french fries...yes a Mediterranean style restaurant with fries. \n\nI must say that Judy, are waitress, was amazing: efficient, great personality, and very attentive.\n\nFor the very affordable price, good food, nice ambiance, and great service I would definitely come back here."
        }, 
        {
            "index": 300, 
            "rating": 5, 
            "review": "Love this spot, usually hit up the one next to Fruition boutique (Maryland/Flamingo) more. Both locations are exquisite. I usually get the Gyro with the flavorfully seasoned Athens fries (Wrap style), thats my usual go to dish. Hasn't ever let me down. Staff is great and the atmosphere is quaint."
        }, 
        {
            "index": 301, 
            "rating": 5, 
            "review": "Excellent!\nService was great. Melissa...Thank uuu\nI LOVE THIS PLACE..."
        }, 
        {
            "index": 302, 
            "rating": 3, 
            "review": "Good food.  A little overpriced, but nice, quiet place for a group for lunch.  Everyone seemed happy with their choices.  Not everyone was happy with the check.  Some ordered the fries - which are delicious - but didn't realize that they are a la carte and not included with the price of the gyro, etc.  I would eat here again, but not frequently just because $13 for a salad sans meat seemed a little steep for your everyday lunch fare."
        }, 
        {
            "index": 303, 
            "rating": 2, 
            "review": "Have been going to the Paymon's location on Maryland Parkway near the University for many, many years now. However, the location on Sahara has been terribly disappointing. My first visit was a year ago or so, and I was in the area tonight, and decided to give it another try. Well, strike 2....and I will just call it strike 3 based on principle. \n\n1. Not greeted properly \n2. Unnecessary wait\n3. Sat myself & my party\n4. Got my own menus & place settings\n5. Ask for a manager who was just shy of \"worthless\" in her response and apology. \n6. Asked for a server who could take care of us. \n7. Server did a fairly good job. \n8. Food was \"marginal\" compared to the Maryland Pkwy location\n\n** Will never return to the Paymon's on Sahara."
        }, 
        {
            "index": 304, 
            "rating": 5, 
            "review": "Although this is my first review for Paymon's, I have dined and lunched in several times and it's always a 5 stars especially with the Chicken Tandoori and Chicken Curry. However, I am on a veggie cleanse and after eating all the veggie dishes last night with a friend....it is as good as it gets! \n\nPaymon's is definitely a very good restaurant with a wide range of variety of dishes that a meat carnivore and veggie delight eater can both enjoy! \n\nAs veggie delight eaters, we ordered the following:\n\nSTUFFED GRAPE LEAVES\nServed cold as Paymon's Greek version of Dolmas consists of young, tender, grape leaves, stuffed with rice and flavorful herbs. Served with delicious Tzatziki sauce.\n\nATHENS FRIES\nAs it says on the menu, these fries are highly addictive and indeed they are! Addiction derives from their house seasoned fries accompanied by a delicious creamy dipping. Nevertheless, I like to dip mine with their special bottled hot sauce.\n\nHUMMUS\nOne of my favorite delectable dip! Puree of chickpeas, Tahini, fresh garlic, olive oil and fresh lemon juice. \n\nBABA GANOSH\nThe name speaks for it self, it sounds like a hot Greek man riding on a white horse down the white sands of Greece....but it is a scrumptious mixture of seasoned, baked eggplant, blended with Tahini, fresh garlic, Olive oil and fresh lemon juice.\n\nTABULI SALAD\nWhat a fresh Mediterranean classic of a salad! Tabuli salad is combined with chopped parsley, bulgur wheat, tomatoes, cucumbers, onions and fresh mint leaves. Tossed with their house seasonings, extra virgin Olive oil and fresh lemon juice.  I know I know...it has gluten in it, but it's already hard to be gluten free so I ate it anyway! This salad is delicious!!\n\nEGGPLANT PARMESAN\nThis Fresh Eggplant coated with Italian bread crumbs, layered with roasted whole garlic, Marinara sauce and topped with Mozzarella cheese was sooooo gooood!!!  It even came with Barilla penne pasta Marinara which made the dish so huge and plenty of left overs.\n\nI heart Paymon's!!"
        }, 
        {
            "index": 305, 
            "rating": 4, 
            "review": "this place was absolutely cool.  Came in to do a little hookah with some friends.  Had some drinks and food, prices were amazing.  I guess they have a late night happy hour because it was around 11pm on a Tuesday.  There was a nice amount of people cool cozy decor and furniture.  The food dishes were about $5 and descent portions, 12 hookah wings, 4-5 Moazarella sticks, Lychee martini was bomb and I had a custom chocolate cake martini which was very tasty.  Mymy our server was amazing I will definitely come back."
        }, 
        {
            "index": 306, 
            "rating": 1, 
            "review": "The food was....okay.  The service was....okay.  What was not okay was showing up with a friend wearing a sleeveless $300 shirt and told he couldn't come in to the hookah lounge because of their \"dress code\" and watching some bimbo walk in with sandals, cut off shorts, a tank top and no bra.\n\nThis is NOT an upscale place - they're in a strip mall - and they should be pleased to greet any guest walking through the door."
        }, 
        {
            "index": 307, 
            "rating": 2, 
            "review": "I've been to both this location and the one at The Arts Factory that closed a while back. The food didn't really do anything for me. I have tried their kabobs and gyros and they didn't seem spectacular to me.  I've heard that their fries are supposed to be the best, they have their own special spice/salt condiment they put on it that I especially disliked. Maybe it's me though. I think they even sell the condiment, people love it so much. The only thing that I would go back for is the lentil soup and the grape leaves. The service is good though, friendly staff."
        }, 
        {
            "index": 308, 
            "rating": 2, 
            "review": "I really went to Paymon's with high hopes after reading all of the great reviews, but sadly, I was disappointed.  Maybe it was an off night, maybe it was because we arrived toward the end of happy hour, but regardless, it just was okay at best.\n\nI met my friend at the hookah bar, where we were quickly set up with the Disco Lemonade hookah and ordered drinks.  The drinks (apple martini for my friend, lychee martini for myself), were actually quite good, as was the hookah, which was mild and flavorful.  That's where the good stuff ends, though.\n\nService from that point was a slow and lacking. We ordered 3 dishes: the wings, calamari, and the Athens fries, which took quite awhile to come out, were lukewarm at best, and tasted old- as if they had been sitting out for awhile.  The hookah attendant seemed annoyed that we weren't smoking our hookah fast enough and *gasp* socializing and talking to each other.  When we finished our meal, we asked our waitress for boxes for the leftovers, which she never brought.  No one ever came back to ask if we were done, needed anything else- or even to bring our check.  After waiting for at least 20 minutes, we finally tracked down our waitress at the bar to ask for the boxes and the bill.  The boxes were given to us with annoyance, and after seeing us struggle with them, a bag wasn't offered- luckily, the hostess at the front offered one to us.\n\nI am not sure if I'll give it another chance.  I did like the location, the look of the lounge, but the food and service...as the stars say- \"meh.\""
        }, 
        {
            "index": 309, 
            "rating": 4, 
            "review": "Great food for a good price. Service was slow. It took 45 minutes to get a table when they said 15."
        }, 
        {
            "index": 310, 
            "rating": 4, 
            "review": "I highly recommend the lentil soup here. The kabobs are also really good! They have many herbal tea varieties. One of my favorite restaurants here in Las Vegas!"
        }, 
        {
            "index": 311, 
            "rating": 4, 
            "review": "This place has outstanding food! The fries are the best in the world hands down! Seriously everyone MUST have fries!  Everything else is great too. Great, cozy atmosphere, great hookah, service is subpar. I left off one star because our waitress was a total b****! she was super rude the entire time! I think her name was miriam. Other than her, this place is awesome! I'm sure the rest of the staff is better than her!"
        }, 
        {
            "index": 312, 
            "rating": 4, 
            "review": "This place is feet away from my home & it's a convenient go to spot. The service has consistently been great & the food is always good. The atmosphere is cute with a Mediterranean touch and every Wed they offer 25% off your entire bill so it's a great value!\nFavorites off the menu are - saganaki! Flaming cheese that comes with warm pita bread and you drizzle lemon all over it! I also love the variety plate that comes with lamb, chicken & a mixed meat skewer that is perfect for sharing! The rice and vegetables are so delicious and you always get a huge tomato that just came off the grill! I'm a huge fan of these Mediterranean flavors! \nThey have great ice tea with mint & a slice of orange, it's a must if you're an ice tea drinker!\nThere's also a hookah lounge if you're into that and when the door opens from the restaurant I always hear fun European house music!"
        }, 
        {
            "index": 313, 
            "rating": 5, 
            "review": "Food is great. Prices are good. And the waitress Samantha is the best server I ever had. I go there once a week."
        }, 
        {
            "index": 314, 
            "rating": 1, 
            "review": "The food was ok. But definitely not good enough to make up for horrible service."
        }, 
        {
            "index": 315, 
            "rating": 1, 
            "review": "I have been to Paymon's several time the last 4 years and have always enjoyed the service and food but have no idea WTF happened tonight!!!!!!!!! Service was very slow and the waitress was over worked in fact only she was the only wait staff for the night. Food was cold and lacking of flavors. Use to enjoy the place but will never return!! Goodbye Paymone's"
        }, 
        {
            "index": 316, 
            "rating": 3, 
            "review": "Waiting for a table on a friday night with the owner taking up 2 tables.  Not the way to do business. The d.j. is playing top 40 music and the staff seems scattered,  I'm sure that is natural given the owner presence. As a visitor, I shouldn't have to wait. The staff seems apologetic and concerned but there are reserved spots but nobody sitting there.\n\nTypically this is a great spot to visit when you want to relax and enjoy the evening, the hookah is really great here and the drinks rock too!"
        }, 
        {
            "index": 317, 
            "rating": 3, 
            "review": "Paymon's is not bad at all. They have one of the best falafel around. It's green and flavorful and not dry at all. I especially like the Athens fries which are french fries that have been tossed is seasonings and served with a spiced dip. So good. I recommend the rice pudding for dessert.\nThe hookah lounge is connected to the restaurant but separated. I went in there one time and smoked after dinner. The tobacco tasted great but I immediately regretted my decision because I threw up. So I would recommend eating after smoking. But I am not a smoker so Im not used to the tobacco."
        }, 
        {
            "index": 318, 
            "rating": 2, 
            "review": "Well - two stars for the food and maybe 3-4 for the service. \nI just can't bring myself to give them 3 stars to even it out. \n\nWe came here because it was highly recommended to us by a friend - which I will never trust again. \n\nThe food was...not good. It was a notch below mediocre...\n\nWe started off with the combo appetizer platter - the only thing that was good was the dill sauce. Everything else was okay and somewhat bland or over-fried. \n\nFor dinner, we had -\n\nChicken Curry - Man, I don't know what they use in this curry other than some kind of bland curry and nutmeg. It wasn't even very spicy as I requested. It was so bad, I couldn't even finish my dish...even though I was hungry. \nAlso, they use precooked basmati rice...??? I don't understand any restaurant that uses precooked rice. I'm half Asian. I know when rice isn't fresh. I eat that shit every day. \n\nLamb, beef and chicken kabobs - same thing. That rice...oh, that rice. And the kabobs were alright. I give them 3 stars. But, they were not that pleasing to the taste buds. \n\nI don't know. The server was good, but very oddly quiet...like we had to listen in very closely to hear what he was saying. He was prompt though. \n\nI do not recommend this place. It's outdated and maybe it was good at one time. If so, they've taken a turn for the worst. There are many other places in town that beat out this place, hands down."
        }, 
        {
            "index": 319, 
            "rating": 4, 
            "review": "Hummmm... Falafel pita sandwich with seasoned fries! \n\nGreat place for both vegetarian and meat eater's, The food is good, the place is cute with a good atmosphere, the menu is pretty big, the staff is nice and they have a fun Hookah lounge.\n\nMost of the vegetarian items can be made vegan and every time I have been there the food was tasty. \n\nIt's also a great spot to go for Happy Hours with friends."
        }, 
        {
            "index": 320, 
            "rating": 4, 
            "review": "I'm not a hookah fan, but I love Mediterranean food and Paymon's came highly recommended- the cozy interior is intimate enough for a quiet date, a family dinner, or a birthday celebration with friends. The menu offers an odd mix of Mediterranean, Italian, and vegetarian dishes, with higher price tags than I initially expected- but the quality is also much higher than I was led to expect!\n\nThere are several kabob plates, the KOOBIDEH PLATE  ($13) is solid with sides of saffron rice, house salad, and roasted tomato. By far my favorite dish here though, is the EGGPLANT PITA WRAP ($9) with roasted veggies, feta, and pesto sauce. Add on a side of ATHENS FRIES ($3) with their unique dipping sauce, and ask them to bring some tzatziki too. It's a flavor and texture explosion, in the best of ways.\n\nThey also have different spices, cookbooks, and gifts for sale right inside the front door. Takeout service is quick and friendly. Wednesday evenings there is a local's appreciation discount."
        }, 
        {
            "index": 321, 
            "rating": 4, 
            "review": "This review is going to be on the hookah lounge and not on the food. No, not this time. I believe I will have to make another visit to Paymon's just so I can retry their food and write up a review. It's been too many months since I've burned the roof of my mouth while trying to eat Saganaki and Athens Fries.\n\nHOOKAH LOUNGE & SERVICE\nMy cousin and her friend invited me here for a round of hookah the other night. We weren't sure if we were supposed to enter the lounge or wait at the front of the restaurant to be directed, but we had to wait quite a bit for someone to show up and help us -- by the way, there was hardly anyone dining in the restaurant at 8:00PM. When the hostess finally appeared, she directed us to the lounge where we waited AGAIN. Finally, we were told we could sit at a corner booth and that our hookah waitress (?) would arrive shortly.\n\nWe were given a tray containing an array of tobacco flavors to choose from, as well as a menu. The choices on the menu are pricier because some are specialty tobaccos infused with alcohol. For $15 you can mix different flavored tobaccos from the given tray and puff on hookah for more than an hour.  My cousin and I chose to mix margarita, peach, and strawberry which is an awesome, fruity blend. \n\nYou can also eat and drink in the hookah lounge. My cousin's friend ordered a couple bottles of Fat Tire beers for himself, while my cousin and I ordered a flavorful Moroccan tea. The plastic containers of honey that our waitress gave us were unnecessary because the tea was already naturally sweetened. \n\nOur waitresses were nice, but they didn't stop by our table as much to see how we were doing, so we often had to play the waiting game.\n\nOVERALL\nReally, I'd rate this a 3.5 than a 4.0, because the service could be better. I'm not sure if $15 is a reasonable price for a round of hookah, but I can say the experience was fun and a unique way to hang out with friends and unwind from a stressful day."
        }, 
        {
            "index": 322, 
            "rating": 5, 
            "review": "I've been here a couple of times, and the service is always fantastic. The food never disappoints (we always get kabobs) and our personal favorite is the Athens fries for an appetizer. The manager and servers are kind, attentive, and understanding. Always recommend this place. First stop for kabobs in town! \n\nP.S. Sit in the lounge for dinner - they have TVs and great music!"
        }, 
        {
            "index": 323, 
            "rating": 3, 
            "review": "Came here for lunch during a trip to Vegas a few weeks back and unfortunately it was nothing from what I had hoped it would be. I was initially going to give this place no more than 2 stars, however the one thing I loved about this place is the decor. It's unlike any I've seen in the US, and I have been to plenty of Persian and middle eastern restaurants as well as hookah cafes. The ambiance and decor in the hookah lounge is absolutely stunning, however the hookah and the food are not. \n\nWe ordered the koobideh jabab and gyro sandwich and both came out dry and way too spicy. The spices used in the koobideh tasted like Indian spices and any Persian that has had real koobideh knows it should not taste like that at all. The meat wasn't cooked all that great and the rice wasn't cooked properly either. \n\nI was very disappointed with the food, however the service was great- the young lady that helped us was very sweet and again the decor was beautiful. \n\nIf you want a nice place for a drink and mediocre hookah, I guess it's worth the shot- as for good Persian food and good hookah, i will have to pass on this next time."
        }, 
        {
            "index": 324, 
            "rating": 4, 
            "review": "Same food as the original location on Maryland Parkway, just a newer feel and more middle-eastern appearance.  Hookah is a must, so yea, I dig it!"
        }, 
        {
            "index": 325, 
            "rating": 1, 
            "review": "Sadly, one of worst visits here. My husband and I usually dine here at least once every month or so and enjoy the meal for the most part. This evening we were given cold fries. I asked for lemons and had to wait for 10 minutes to remind the server. When our entrees came we had 2 steak skewer plates one medium well and med rare. My side salad was warm as they probably left it under the warmer while they waited for the meat to cook. My husbands meat was beyond rare not even close to med rare. He always orders a side of the veggies and the veggies were soggy and watered down. To top things off we could see one of the cooks eating while he was cooking. Major health violation and made me lose my appetite."
        }, 
        {
            "index": 326, 
            "rating": 4, 
            "review": "The Spanokopita was good; generous portions. Would definitely go back and try some of the other items. The two kids with it also liked it; good children's menu."
        }, 
        {
            "index": 327, 
            "rating": 4, 
            "review": "I love Mediterranean food and I have been looking forward to trying Paymon's.\n\nMy Persian friends tell me it is not authentic and there are better places, but we went anyway.\n\nI booked using Open Table and as we got to the restaurant we were expected and warmly welcomed.\n\nOr server was charming and she explained the menu and helped us pick a couple of plainer dishes for our coddled and spoiled unadventurous children.\n\nWifee and I ordered a selection of kebabs,gyros etc. It was fine not fantastic but we enjoyed. Also worthy of mention are the Athens Fries, great seasoning! \n\nFriendly place with above average food and very large portions in an easy location for us suburbanites ."
        }, 
        {
            "index": 328, 
            "rating": 4, 
            "review": "One of the best chicken kabobs I've had in a long time! Perfectly seasoned and cooked very well. You can taste the open flame flavor and orders came out fast from the kitchen.\nWe used to go to the location on Maryland Pkwy and should try it again soon, hopefully they will cook their food the same way as they do here. The Athens fries were good, but not a super favorite in my book.\nGood service and if you want a cozy hookah experience I guess the next little room across the way is for you. I don't like tobacco, but I do like the food here. \nWe'll try the location on Flamingo and Maryland since it is closer to where we live."
        }, 
        {
            "index": 329, 
            "rating": 5, 
            "review": "I absolutely LOVE this hookah lounge..\nMy dear friend took me here late evening to smoke hookah & I immediately fell in love with the sexy ambiance. The rich mediterranean decor, dim warm lighting, smooth sexy lounge music, & great hookah flavors had me in a trance. \nCan't wait to go back again...tomorrow;)"
        }, 
        {
            "index": 330, 
            "rating": 5, 
            "review": "If I could add another star, I would.\n\nI'm particularly a fan of the Lounge area... local lounges don't get better. The atmosphere, the people, it's just all around AWESOME."
        }, 
        {
            "index": 331, 
            "rating": 4, 
            "review": "Had the gyros sandwich and Athens fries which were great. I also tried a couple appetizers which were awesome. I just forgot the names of the dishes. One was a pita with cucumber sauce and paprika and the other was a hot plate of sizzling cheese. It was very good. Service was great too."
        }, 
        {
            "index": 332, 
            "rating": 5, 
            "review": "We were recently introduced to the mysterious world of the hookah.\n\nWhile looking for a happy hour on a recent visit to Vegas we stumbled on Paymons. I absolutely adore this place. From the minute we stepped into the hookah lounge we were welcomed and felt at home. If you want to spend a couple of hours chillin' in an exotic atmosphere eating Mediterranean food--we're talking here fried calamari and baba gnoush served with a huge side of soft pita bread--while sipping any specialty drinks. . . ours were a variation of the margarita, at happy hour half price--this is your place.  And, hey maybe add a hookah to the mix.\n\nThe lounge is dark, sultry and cozy. The décor is \"Persian Sultan den\" with walls and ceiling a deep warm maroon.  A selection of large paintings of women in suggestive poses from past centuries sit in ornately carved frames vying for space with heavily-patterned cloth tapestries which gives the room a tent-like atmosphere. There are plenty of pillows to lounge upon. My wife said, \"we need to create a hookah den in our house.\" I said, \"sure, I'm in.\" At first I was curious why the music wasn't traditional Middle Eastern, but I soon warmed up to the House music, which surprisingly suited the space.\n\nThe server/bartenders had no attitude whatsoever and made me want to spend a long time here. The hookah master gently asked us if we would like to try a hookah. He said he would mix a special novice blend for us. We wondered if his watermelon/grape recommendation would be too fruity, but the concoction had a smooth taste and aroma and I felt myself relaxing with every puff. The crystal ball says there is a heartier mix for me to try next time."
        }, 
        {
            "index": 333, 
            "rating": 4, 
            "review": "I couldn't tell about foods cause I was really starving so I don't remember about how the tastes. But it was okay. And service was good. The one of lady was really helpful. Nice place to relaxing in couch with hookah \nBut I guess they need host to help the customer sitting in. Too busy every time when I visit so it's really hard to find the sit.\nAlso it's  awkward to standing on middle side of the bar for seeking a spot to sittin on"
        }, 
        {
            "index": 334, 
            "rating": 4, 
            "review": "A great little place away from the strip.  The service at this place was extremely wonderful.  The Hummus and fries for appetizers... great!!\nThe Chicken Curry and Gyro was both delicious! Can't wait to stop in again."
        }, 
        {
            "index": 335, 
            "rating": 1, 
            "review": "This place has really been downgraded..It could be under new management...The fries were so salty, unhealthy and uneatable; the wings were the greasiest ones I have tasted in years, probably the greasiest ones in Las Vegas. My wife asked for fried calamaries which taste was so bad, I bet they were not fresh at all.The hookah is horrible in taste and service. Cocktails were terrible. The overall service is way below average. We were very dissatisfied, and would not recommend this place to anyone."
        }, 
        {
            "index": 336, 
            "rating": 5, 
            "review": "I love to hangout here with friends, enjoy my blueberry mist with mint hookah, delicious appetizers and some red wine!!!"
        }, 
        {
            "index": 337, 
            "rating": 4, 
            "review": "Great place for a late night snack or meeting out for drinks!\n\nI've been quite a few times and always eat in the hookah lounge - you can't beat the comfortable ambiance!  I'm quite addicted to hummus, and theirs is fabulous!   They also make pretty decent specialty drinks.\n\nThis place is also great for take-out, but its a bit on the pricey side, yet it gets outweighed when you dine there."
        }, 
        {
            "index": 338, 
            "rating": 3, 
            "review": "The atmosphere was nice.  This location is bigger than the one on Maryland Pkwy and they had a DJ.  Not sure if that's a nightly thing or if they just do it on Friday's but it made for a fun night.  A few downsides in comparison to the other location:\n\n1. They have fewer couches so it's easy to get stuck at a table which is not as comfortable. \n\n2. The staff is not as friendly and helpful.  \n\nAll in all it was a good experience and I would go back again."
        }, 
        {
            "index": 339, 
            "rating": 4, 
            "review": "me and the wife's fav spot..usually we come during happy hour, smoke a few bowls with some hookah wings and domas. The service can vary on who you have, but Jenny always takes care of us! good environment, always clean and comfortable."
        }, 
        {
            "index": 340, 
            "rating": 5, 
            "review": "i go here about once a week.  i like the gyro salad, vegitarian plate, tunisian stew, and fesijan."
        }, 
        {
            "index": 341, 
            "rating": 1, 
            "review": "Dinning out as a single woman is always a bit of a hassle. You can almost be assured the waitress or waiter will ignore you for most of your meal. You will get seated next to the kitchen doors so you get ran down by the wait staff every time they bring out food plus you get a birds eye view of how filthy and noisy the kitchen really is. You may also get to see the dishwashers ass hanging out of his pants while he scraps food off the plates and into the garbage bin, but like I said, after years of dinning out alone I expect this kind of shitty service. Tonight though took on a whole new level of shitty service and I am going to name names so just in case you are a woman and you decide to dine at this restaurant you may want to think twice. The place is Paymon's off Sahara. The experience was so bad that I have no idea what their food taste like because the waitress sucked so bad that I didn't have any appetite left after 15 min. of her attitude and I got up and left. \nIf you are a server do not assume a single woman is going to tip you badly especially a woman my age and in the manner that I dress and carry myself. I was a waitress for years and I know how hard the job is but that is no excuse to be rude and obnoxious to a customer. Two thumbs down for Paymon's"
        }, 
        {
            "index": 342, 
            "rating": 3, 
            "review": "Make that 3 1/2! My first visit here was extremely pleasant. 2nd time, not so much. It took forever and a day to get a glass of H2O!!! Like, seriously, I would've choked to death already. Would I come back? Most likely. But I don't want the Asian chick as my waitress."
        }, 
        {
            "index": 343, 
            "rating": 1, 
            "review": "I am sad to say that our return to this joint was the biggest disappointment in my dinner clique life. We had such a great meal and experience here last year that we selected it for our December gathering. I arrived after two of my friends, who had been seated. He ordered the drink special but was told that they were out of the ingredients for that drink. Ran out THAT MORNING. I ordered my fave from last time, the Mangorita....it sucked. Poorly made and nothing like the fine concoction of our last visit. \n\nThe rest of the guests arrived and they ordered a scotch neat and a glass of wine. 20 minutes later it was still not there. In the interim, they had taken our dinner order. As the waiter is being addressed about the missing drinks...hardly difficult to prepare...we are informed that they are out of meat balls. An Italian menu that is out of meat balls because....wait for it....THEY FORGOT TO MAKE THEM!!! \n\nWe got our meals finally and it was just a disaster after all of that rigmarole. Now the manager comes to speak to one of our group and says he will comp a round of drinks off the bill....well, they defer to the FIRST round ordered which was the first two who arrived, so no, they did NOT comp a ROUND of drinks for the group. Clearly this place has encountered some kind of change. I fully expect it to be featured on Restaurant Rescue it has gotten so bad. They get one star becuse the calimare was great...the rest rated about 100 on teh suck-o-meter."
        }, 
        {
            "index": 344, 
            "rating": 5, 
            "review": "My favourite restaurant in Las Vegas... PERIOD!\n\nSaganaki (Fried Cheese Heaven)\nSpanakopita (Spinach/Cheese Pie with the flakiest crust ever!)\nButtered Basmati Rice (The best rice of all time)\n\nI love their food, I love their service, I always check in via Twitter and they ALWAYS reply back, it's awesome. I've also been to their hookah lounge with friends a number of times and it's a great place to hang out and the ambience is terrific.\n\nAlso, every Wednesday night from 5 to 9, get 25% off your check. Can't beat that!"
        }, 
        {
            "index": 345, 
            "rating": 4, 
            "review": "Very tasty Mediterranean/Indian food & super friendly service. Lots of vegetarian options that can be made vegan upon request, as well as a wide variety of drinks and hookah flavors. Also a great place for happy hour 5-7!"
        }, 
        {
            "index": 346, 
            "rating": 1, 
            "review": "The food can be pretty decent but a few of the chicken dishes really lack seasoning, which some people like. I live like a block away from the Summerlin location and I order from there a lot, out of convenience. I recommend the food for the most part. It's a 6.5 out of a 10 on a good day.\n\nIf you want a good hookah experience, go to an authentic Middle Eastern place, these guys think that a hookah is when you slap some tobacco on a water pipe-it's just not that great and a bit grainy, but it's good for anyone who doesn't have or care for high hookah standards. It's a 3 out of 10. \n\nThe lounge service is the WORST of the WORST in Las Vegas - the worst. If you are hanging out and/or eating here, expect to be ignored, with a bunch of dirty plates on your table all night, wait 20 min for a beer, good luck getting a water, they are clueless about the menu and everyone is incapable of even saying a proper hello. You will never see the management around and especially won't see them taking any interest in patrons. I'm very easy going but their service is just unbelievable. It's 0 out of 1,000. Lost cause and reason for the 1 star."
        }, 
        {
            "index": 347, 
            "rating": 3, 
            "review": "This location (Sahara) is the lesser of the few. The food and service is nothing like the Maryland location which is stars above this one.\n Here at Sahara the food is mostly great, the atmosphere is wonderful It's just a beautiful anf fun decor. The service is not as attentive and you need to ask questions ( Are refills free? etc ) because they might not tell you. \n The chicken parm was a disappointment  last time we went ( Pounded down flat to make it look bigger, gimmee a break) and the salad was smaller than usual ( I would not have ordered had I known). \n However the mousakka rocks , the iced tea is good and you can't beat 25% off night.\n Overall most of the place is worth it. Just remember to ask some key questions as this location is more about cash than service."
        }, 
        {
            "index": 348, 
            "rating": 5, 
            "review": "Love the atmosphere and the food! I can go with a partner for some hookah or with a large party! I Love the decor it is very cosy and the \"hookah baristas\" are awesome!!! i love the gyro salad!!!"
        }, 
        {
            "index": 349, 
            "rating": 5, 
            "review": "I love this restaurant. I love to come here and relax after a hard day of work. There is a wonderful ambience. The food is excellent I come here with my friends frequently."
        }, 
        {
            "index": 350, 
            "rating": 1, 
            "review": "This place sucks !!! Literally threw money at them and they would not receive it! I bought shots for the entire venue they still would not give me an extra coal on my hookah and wouldn't sell me Champagne ! I asked for most expensive bottle or anything to enjoy my night and they would not accommodate me! Place sucks !"
        }, 
        {
            "index": 351, 
            "rating": 4, 
            "review": "Great service, love the Gyro and Athens Fries"
        }, 
        {
            "index": 352, 
            "rating": 4, 
            "review": "Solid food. I usually get the gyros platter (rotisserie beef and lamb, thinly sliced and served with vermicelli pilaf). Delicious. Portion size is large. There isn't a lunch menu, but the gyros platter is cheap enough that I get a good value out of the meal."
        }, 
        {
            "index": 353, 
            "rating": 4, 
            "review": "I enjoyed this place. I came here with my family and extended family who live out in the Vegas area. It was good. I had the saganaki appetizer and mozzarella sticks which were both excellent. I like the Italian/Mediterranean theme they have going on. I ordered the gyro platter for dinner and thought it was delicious. I wish I wasnt with family because I wouldve loved to go into the hookah lounge and smoke. I ordered a side of their anthens fries, and they were really bomb"
        }, 
        {
            "index": 354, 
            "rating": 5, 
            "review": "Many vegan and vegetarian options that are clearly marked! Big portions and yummy food. We got our food so quickly and Alex and Francisco (the servers) were so nice! A great place for meat eaters and veggie lovers!"
        }, 
        {
            "index": 355, 
            "rating": 4, 
            "review": "I usually end up at Paymon's with my buddy, Matt G.  He always picks this place when we share a meal.  He did it again for his birthday, but I never say no because I love the spanakopita here as well as the Athens (crack) fries.  Tonight I needed more protein so I tried the steak kabob and that was delicious, but I still had to take part of it home because of the crack fries.  I think Paymon's Athens fries are the best thing ever, which is not a good thing for my arteries, but once in a while I do indulge.  Everything I've had here is good and we never have to wait for a table.  It's a reliable go-to for good food and good service.\nPS--They have baklava, my fave!"
        }, 
        {
            "index": 356, 
            "rating": 2, 
            "review": "I have given this place two goes and question it's success. The food is nearly terrible. The only upside is that it's a Hookah Lounge and it's a nice little spot for a successful date. But if you're in it for the food, keep on searching. Kabobs and such are NOT done right here."
        }, 
        {
            "index": 357, 
            "rating": 4, 
            "review": "I am a fan but I like the other location on Maryland Parkway better. This location is not as cozy still great service and drinks."
        }, 
        {
            "index": 358, 
            "rating": 3, 
            "review": "Came here for lunch and man, the service was slow. The food took forever to be served- almost 30 mins and the chicken was too dry. I'm sorry I had chicken tandoori before and it was not dry."
        }, 
        {
            "index": 359, 
            "rating": 4, 
            "review": "My cousin recommended me to this location, I'm not a local so I wasn't sure what to expect. The place was pretty big. There is a dinning area that is separated from the hookah lounge which was cool. They also serve food in the lounge and drinks. I really like the decor they have in the lounge it was Egyptian themed. We ordered the skittles flavor which is pretty light from what I usually smoke but it was nice. They have a dance floor and a dj tonight when I went. It was a mixture of pop and Cumbia. It's a very chill homey environment. The employees came by to check on us every so often and refilled our glass of water. It was pleasant. I do wish it was a bit more hyped for a Friday night, but it was relaxing. We didn't get to try the food so I have no opinion in that area. Update* so I came back day 2 of my trip to Vegas and they don't allow coal changes and you only get one coal. That's quite unheard of. I was like 0.o not sure how I even feel about that. In order to get a new coal we would have to order a refill. . . ."
        }, 
        {
            "index": 360, 
            "rating": 3, 
            "review": "I've never been to Paymon's before so I was a bit excited to try. I love Mediterranean food and for a hot summer day what can go wrong? My husband told me that he heard the hummus was good so we ordered it as a starter. Hummus was delicious.... I probably ate the majority of it, but I LOVE hummus. \n\nBy the time our lunch came out I was pretty full on hummus. I had ordered the Chicken Pita Wrap and the husband ordered Gyro Pita Wrap with a side of athens fries. My chicken was really dry and it wasn't very tasty....a big disappointment. However, my husband's Gyro wrap was very tasty and not dry. The athens fries were good, but not blow me out of this world. \n\nOverall, for a 30 dollar lunch, was it worth it? Nope, but I can see why people come here with their late hours and hookah."
        }, 
        {
            "index": 361, 
            "rating": 4, 
            "review": "As always, I enjoyed the fries. This is my second trip to this one and I had the Steak kebab which was nice but not exceptional. The fries completely make this a late night snack place for me though.\nLast time I had the unlimited pasta and that was great value - BTW there is nothing wrong with having a side of their Athens fries as an appetizer before pasta!"
        }, 
        {
            "index": 362, 
            "rating": 4, 
            "review": "The family comes here often since it is very convenient for us. Never really had to wait for a table, they seat us right away. They are very consistent with their meals, so we enjoy it enough to keep coming back. Although, it takes them a while to check up on you as far as refills and getting the check. I enjoy the chicken curry & love the athens fries. Also enjoy coming here with friends because they have really good happy hr!"
        }, 
        {
            "index": 363, 
            "rating": 5, 
            "review": "I just love Paymon's. They have the best happy hour in town and the food is just delicious! The appetizers on happy hour are not small at all. They're the regular huge size. We can't ever finish everything! The staff is very friendly and attentive. The hookah lounge is so nice!! I went on a Friday  night and they had a small dance floor and a DJ. Very cool ambiance! It's a great place to hang out and enjoy!"
        }, 
        {
            "index": 364, 
            "rating": 5, 
            "review": "The food here was great!! I love the fattoush and the Dolma was yummy! Our server was cute ( Mike) my friend wants to eat there every day just to be able to see him lol. But am a Fan of this place ."
        }, 
        {
            "index": 365, 
            "rating": 5, 
            "review": "Came here after dinner for drinks and hookah.. It was great!\nService was awesome! Drinks were always full and hookah was always tasting great!"
        }, 
        {
            "index": 366, 
            "rating": 3, 
            "review": "After seeing so many coupons we decided to give it a try.\n\nI had the gyros salad and my husband had a gyros pita sandwich there.\n\nPortion sizes are overly generous and flavourful however I would say this isn't the best mediterranean food I've ever had (that is reserved for La Shish in Dearborn, MI which is now closed - they made fresh mini pitas served with roasted garlic puree - to die for!). \n\nThe pita bread is ok but not great. Same goes with the fries. The salad was ok but very cumbersome to eat - the gyros meat was also stone cold.\n\nOverall, this was an okay experience - nothing too bad, but not so great either."
        }, 
        {
            "index": 367, 
            "rating": 3, 
            "review": "Paymon's is regularly selected as \"Best of Las Vegas: Mediterranean Food\", so you know the food is not terrible. However, I do not think it is the \"Best of Las Vegas\". The food is good, and the menu is big; it even includes Italian pasta entrees. While I have never had anything sub-par, their falafels are not impressive. The salads are large. (Even a small Greek salad can be shared.) My favorite thing to eat there is the lentil soup. My biggest complaint is that the food is overpriced. However, they are open late, and they have a pretty extensive hot tea menu. All of this balances out to a solid A-OK 3-stars and a rather boring review on my part."
        }, 
        {
            "index": 368, 
            "rating": 5, 
            "review": "This place is a great place for locals to host a party on friday and Saturday nights! We are part of a large group of friends that regularly go. They serve food, beverages, and have a dj with a small dance floor. They also have hookahs which seem to be very popular. \nThe food is Mediterranean and is delicious. The waitresses there are very good and super nice. They know most of us by name. \nThe lounge area is very comfortable and stylish.\nThe music is typically a mix between latin, Mediterranean, and pop. It is definitely danceable!\nThis is truly a fun place!"
        }, 
        {
            "index": 369, 
            "rating": 5, 
            "review": "What a great place. Went to dinner for the first time an it was great. It's a cute little cafe very quaint. The service was great as well as the food. Great menu selections as well.  I had chicken scallopini with no mushrooms an my husband had chicken Parmesan. Both were very good. We also had the Athens fries an wow the are delicious an the sauce out of this world. A must try if you eat here.  We will definitely come here again an it's close to home."
        }, 
        {
            "index": 370, 
            "rating": 5, 
            "review": "MEAT FILLED DOLMAS. MEAT FILLED DOLMAS.MEAT FILLED DOLMAS.\n\nJEWISH FUCKING CHRISTMAS!\n\nHummus was great. MEAT FILLED DOLMAS!!!! were great. Athens fries were great. Greek salad with gyro meat was great.\n\nDISCO LEMONADE HOOKAH!!!! was great. Mango-Melon hookah was great.\n\nThis place is just neato! I will surely be a repeat patron here, especially since it's 10 minutes from my house. GET THE MEAT FILLED DOLMAS!!!!"
        }, 
        {
            "index": 371, 
            "rating": 4, 
            "review": "Hmm...So I guess peer pressure really does work. I never thought I'd be praising a hookah lounge, let alone just trying the stuff, and now here I am!\n \nPaymon's has two locations: one by UNLV and the other in the Northwest part of town (the Sahara location definitely has less criminal activity and is therefore my favorite one). Surprisingly, it's actually pretty classy inside and I didn't expect it to be as nice as it is. Upon walking in, I was pleased to see that both locations are beautifully decorated in a Moroccan style with gorgeous pillows and dimly lit lanterns that make me feel like I'm in Aladdin. Come here to hang out with friends, unwind after work, have a few drinks and just relax.  Even the food is pretty tasty. Mostly locals frequent Paymon's, so it's safe to say that the chances of a tour bus packed full of foreigners unloading there are slim.\n \nThe hookah flavors choices are wide but my favorite by far is green apple.  It's amazing how real it tastes!  AND its calorie free. If you're hungry for real food, don't miss the Athens fries, which are awesome and an order of hummus and pita bread."
        }, 
        {
            "index": 372, 
            "rating": 1, 
            "review": "Will not ever go back to this place even though we probably used to eat there at least 3-4 times a month.  My buddy found a 1 inch piece of steel wire brush, the type you would use for pots and pans in his gyro.  We brought it to the attention of the server.  Without expecting anything free, the gyro should have been comped and at least an apology.  Nothing.\n\nFollowed up with a complaint to their corporate office.  Manager finally apologized with the excuse that our server was a nice guy but not very intelligent.  Next time we could receive a comp dinner for 2.  That's not the point.  Health Code violation and someone potentially getting injured from eating a gyro is the point."
        }, 
        {
            "index": 373, 
            "rating": 5, 
            "review": "Their happy hour is great!!! Dont miss it!"
        }, 
        {
            "index": 374, 
            "rating": 1, 
            "review": "I ate here several month ago. The food was very disappointing. I tried the Mousaka and found it to be dried out and overcooked. The emphasis here seemed to be the bar. Be wary of the food."
        }, 
        {
            "index": 375, 
            "rating": 3, 
            "review": "Overall I think that this restaurant offers great value in terms of their portions and their pricing. One person can easily have lunch their for under $15 and leave being extremely stuffed. However, I would not recommend this place if you were looking for legit mediterranean (Italian/Greek) cuisine, since items at this restaurant are fairly Americanized. Likewise, it is probably because many of the dishes are already so westernized that majority of the customers would enjoy their flavours (some people don't like actual greek flavours). Overall, if you're looking for something legitimately Mediterranean, this might not be the restaurant for you, but if you want something INSPIRED by Mediterranean cooking, I think this would be an excellent place to try out.\n\nI would love to return to this place if I ever return to Vegas!\n\nPS. Order small, b/c things come in big portions. When I went I didn't have enough room to try desert even though I wanted to :( ."
        }, 
        {
            "index": 376, 
            "rating": 5, 
            "review": "Great service and yummi food. Hookah selection is great and i really enjoy the place!"
        }, 
        {
            "index": 377, 
            "rating": 1, 
            "review": "I ate there last night with my gf on Sahara. She had chicken parm and I had chicken marsala. She is a nurse and got sick as hell. Their Italian food is shit. The marinara sauce was old and separating. I am in the food business and know old, canned garbage food some places put out. Dont eat Italian here. Its shit and will give you the shits, guaranteed."
        }, 
        {
            "index": 378, 
            "rating": 3, 
            "review": "This place is awesome however I must've came on a bad night because the service could've been better as well as the food and hookah. For starters when we walked in most of the little sectionals were already taken but the waitress kindly made some room for me and my girlfriend to chill. Once we were seated we were recommended some sort of hookah flavor. I'm not much of a hookah smoker but I'll do it socially. The flavor we had was good however the hookah they brought us barely worked! We had to ask for assistance at least 3-4 times and the burner was messed up. Bummer.. Took a while to flag down the waitress although she was sweet something was still lacking... On to the drips they have they lyche martini that's great and another drink that's similar to a Long Island! Both good! The recommended gyro came out the first time on some stale bread that I had sent back because there was no explanation as to why when I picked up my sandwich to bite the whole thing crumbled.. Literally at this point I was beyond over the experience.. I can see the poets rial and if I'm being treated I may return..."
        }, 
        {
            "index": 379, 
            "rating": 4, 
            "review": "Cool loungy area, ordered the skittles hookah. Good ambience, will be back"
        }, 
        {
            "index": 380, 
            "rating": 5, 
            "review": "I'm so happy to have found this place! They have several vegan options on the menu, including the AMAZING Falamus Pita. The servers are friendly and well informed about what items are vegan. I highly recommend their special spiced fries minus the sauce, which I think is made with mayonnaise. Delicious!"
        }, 
        {
            "index": 381, 
            "rating": 5, 
            "review": "Hands down, the best food and service in Las Vegas. I recently took my fiance there for lunch and and he's SO picky about his food. When we left, he couldn't stop rqaving about how amazing everything tasted. We ordered our meal family style and left licking our plates clean! The restaurant is so well kept, modern, yet still such a cozy atmosphere. And the food... well it's probably the most mouthwatering selection of Mediterranean cuisine in the entire state of Nevada. Above all, the service is fantastic. We had Judy as our waiter and she was so, so wonderful and attentive. \n\nWe love Paymon's so much we've decided to hire them for our caterer for our wedding as well!!! So far, the experience has been seamless. Paymon is truly an expert at what he does and it's the one facet of my wedding that I know is going to be a complete success without any hitches! The wedding is two weeks away and I trust that I'm going to get equally glowing reviews from all my guests about the food!!"
        }, 
        {
            "index": 382, 
            "rating": 1, 
            "review": "I am sad to say one of my old time favorites went down hill. Nothing was fresh, grape leaves must have been days or weeks old, my lettuce was brown, my Hubs rice was full of butter, and our service lacked a hospitable feeling. After having so many new mediterranean places in town ~ I will keep looking...."
        }, 
        {
            "index": 383, 
            "rating": 5, 
            "review": "Paymon's has been one of my all time favorite places in Vegas for years now.  They always offer excellent food and service at both of their locations. \n\nAnis, at the Sahara location, is the best server ever!  Very attentive to all your needs and always in a great mood!  I enjoy going there to see Anis and eat my Gyro salad and hummus with pesto!  You have GOT to try the Athen's fries!!  Even if you don't like fries, you will like these.  The seasoning they use is out of this world!  You can also purchase a container of the seasoning in the front by the hostess stand.  I put it on chicken that I cook at home.\n\nPaymon's also offers great deals like customer appreciation night on Wednesday's!  25% off.... a good deal! \n\nGo check this place out if you haven't yet! You won't be disappointed."
        }, 
        {
            "index": 384, 
            "rating": 4, 
            "review": "$9.99 AYCE PASTA at least that's what it was a few months ago. A few extra dollars and you can add chicken or other meats.  They'll bring you one monstrous plate of pasta first, I was surprised I went for a 2nd and 3rd serving (smaller plates).\n\nTheir servings aren't small but they are pretty reasonably priced, cheap if you can go during Happy Hour. They have a pretty awesome Happy Hour of 50% off almost everything from cocktails, bears, food and hookahs which run from 5pm-7pm everyday.  Tuesdays there have a different Happy Hour but run longer 5pm-1am (Best night).\n\nThey have a large hookah area separate from their large dinning area, always good.  Great service. A fan of their décor and atmosphere. Hey why is there a tree in the middle of the dinning area I hope a bird doesn't poop in my food haha, fake trees gotta love them. I heard their Athens fries are good though I still haven't had them but I want them and some kabobs and hummus next."
        }, 
        {
            "index": 385, 
            "rating": 5, 
            "review": "My wife and I love coming here! \nJust had a great date night. We've never ate in the restaurant we always go to the loinge for happy hour. \nGreat happy hour specials and not too loud that we can't have a conversation. Just left. \nDanielle was a great server and we will definitely be back. \n\nSome of these bad reviews though just crack me up!!!"
        }, 
        {
            "index": 386, 
            "rating": 3, 
            "review": "There hooka is not that good but their happy hour menu is cheap and good. I love the chicken finger, hummus and their calamari. The ambiance is great depending which server u have the service differers. I"
        }, 
        {
            "index": 387, 
            "rating": 3, 
            "review": "When in a pinch, and in the mood for Mediterranean- this place will suffice. \nWe ate lunch. I had the vegetarian plate, and the hubby had a gyro sandwich. Both plates were generous in portion. The gyro meat was a little processed looking, I doubt it was actually carved by someone other than a factory worker. But they had delicious sauces, and the seasoning was spot on. The hostess seemed annoyed, but we had a super nice server(Lisa?). \nIn short: they're pretty alright. Not sure if I'll go back, but if I was taken there I wouldn't run."
        }
    ]
}