{
    "category": "Las-Vegas", 
    "entity": "Ice-Pan", 
    "avg_rating_stars": 4.334328358208955, 
    "review_count": 335, 
    "reviews": [
        {
            "index": 1, 
            "rating": 5, 
            "review": "The owner here is so funny, energetic and kind!! He interacts with his customers with high fives, fist bumps or whatever you teach him! They are very informative with how to order and explain that all the fruit they use is fresh. Their ice cream is also much lower in calories than your typical ice cream or so they claim. I tried the green grape and strawberry ice cream and the taste blew me out of this world! The taste was very fresh and I was surprised how good it tasted! I never imagined whole milk and fruit ice cream can taste so light! I definitely want to try making that myself! I recommend trying their fruit flavors here because they use fresh fruit. I sampled my friends ice cream that we're all just milked base (aka coconut, peanut butter chocolate) and they were just ok. I think what makes this joint stand out are their fruit flavors. Must try!"
        }, 
        {
            "index": 2, 
            "rating": 5, 
            "review": "This place is worth the stop. They make anything you want right in front of you and the wait isn't long at all even though they make it one at a time. The people there are extremely friendly and energetic, and they will make sure you like what you ordered or make you another"
        }, 
        {
            "index": 3, 
            "rating": 5, 
            "review": "Great ice cream. Lots of vegan options which I loved. They make the ice cream right in front of you. It's located on the 2nd level promenade in Harrah's. If you're vegan, go here (or lactose intolerant). The owner was awesome as well. Really funny and really nice."
        }, 
        {
            "index": 4, 
            "rating": 1, 
            "review": "If you have 45 minutes to waste in line waiting for a poor solo worker to make your ice cream, go for it. But it takes way too long and the flavor wasn't worth the wait."
        }, 
        {
            "index": 5, 
            "rating": 1, 
            "review": "nothing wrong with anything except for the taste! first time I didn't finish an ice cream that I bought. healthy ice cream gone terribly wrong :( did not do it for me. don't understand the high ratings!"
        }, 
        {
            "index": 6, 
            "rating": 5, 
            "review": "I was walking through to Harrah's from Inperial Palace and happened upon an ice cream place. But this is no ordinary ice cream place, here they make the ice cream fresh right in front of you, with no nitro to be seen. \n\nI chose red bean ice cream made from soy milk and mochi topping. They gave me extra mochi, too!\n\n I loved that they put on a little show while making your dessert. Don't go without expecting at least 3 high fives from the owners."
        }, 
        {
            "index": 7, 
            "rating": 5, 
            "review": "Besides the super good $2 popsicle they are selling... Another PRO to this place is their honest and caring employees.. I accidentally left my phone by their area and was frantically tracking it and almost ready to give up when one of the employees answered our \"lost page\". I got my phone back thanks to the employees and big shout out to Lorena and her crew for stepping up when someone attempted to take it away with them.. They kept it to their safekeeping until we got back! KUDOS to you!! We need more people like you!!"
        }, 
        {
            "index": 8, 
            "rating": 5, 
            "review": "Ice Pan is such a gem! Aside from the amazing ice cream, the experience is so unique and fun! Jay and June, the guys that are always there will treat you like family and make sure you're always so satisfied! There's always so many options to choose from and since its totally customizable, you're guaranteed something you love. Definitely have to go at some point or another preferably soon! My most recent discovery is mint chocolate chip with soy milk almonds and chocolate sauce, vegan friendly of course(;"
        }, 
        {
            "index": 9, 
            "rating": 3, 
            "review": "The Ice Cream here is good but I've had better. They have a nice range of toppings and the guy behind the counter was a pretty entertaining dude."
        }, 
        {
            "index": 10, 
            "rating": 4, 
            "review": "My brother took me here on a random night while we were sweating to death, walking up and down the strip. I came for the show (and cream) and it was pretty amazing, I've never seen ice cream be made this way! The guys who were working were super friendly and talented; it seemed like they were born to do this? I don't know how to say it, they just make it look so effortless. They gave us a brochure about the health benefits of their ice cream and that they contain a lot of natural soy products. (if you are not used to soy, it will make you go poopy) Overall it was fun, and tasted good."
        }, 
        {
            "index": 11, 
            "rating": 5, 
            "review": "Do you like frozen yogurt because it is better than ice cream? This place is better than frozen yogurt.\n\nThe flavors are perfect. Not sweet, like many frozen treats. Be sure to get fruit added. Delicious.\n\nThe owner is super funny and awesome, too. Lots of high fives and fist bumps. :)\n\nIt's a little expensive, but totally worth it. Where else can you get ice cream made right in front of you??"
        }, 
        {
            "index": 12, 
            "rating": 5, 
            "review": "Fresh and healthy ice cream tastes good after a long day of eating in vegas!  Owner is super fun and nice.  They value customer satisfaction!  Seems like the whole family is working together to bring people this unique ice cream!  I got banana ice cream with strawberries and husband got piña colada sorbet!  Yum!"
        }, 
        {
            "index": 13, 
            "rating": 5, 
            "review": "I got some strawberry sorbet from here a couple nights ago and now I can't stop thinking about it! Wish I could fly back to get more! The owner is so friendly too. Great service!!"
        }, 
        {
            "index": 14, 
            "rating": 5, 
            "review": "So, first things first...the ice cream is amazing. The idea that I can pick out my own milk/cream to be used to make the ice cream is very cool. In fact, as someone who can't handle too much sweet or rich food all at once...being able to pick low fat milk as my ice cream base resulted in me actually for the first time ever being able to finish my entire cup of ice cream. This is nice compared to my standard operating procedure at places like Cold Stone where I get the smallest size possible, then finish about 25% of it due to fat/sugar exhaustion. \n\nThat all being said, what pushes this place into AWESOME territory is the owner and staff. The owner exudes a sense of excitement about what he's doing that's beyond contagious. Upon ordering, my wife and I received high fives commending our ice cream creations being good choices. He also made it a point to offer to re-make for free anything we didn't like. The laughter, smiling, dancing and general cheer that came from the three people working there was just absolutely infectious. The kicker here, is that it all seemed so genuine. I've been to many places that force employees to be cheery, and I usually tend to see straight through it as an act...but in this case the exact opposite is true. \n\nThe cherry on top of this experience is that when my wife and I were enjoying our ice cream, the owner saw that my mother in law didn't order anything...and promptly brought her over and gave her a free banana popsicle that he had just made in the back. So cool. There is a reason that so many reviews mention the owner...he's got that rare ability to inspire happiness. Hell, I think I'd pay money to go here and just talk to the guy for a few minutes when I'm having a bad day. \n\nGo here...this is the type of place that deserves to do great."
        }, 
        {
            "index": 15, 
            "rating": 5, 
            "review": "Super fun to watch--and REALLY good! I seriously try and make it here EVERY trip to Vegas because they are yumyumyummy. They're always really nice and quick to make suggestions and answer any questions. I've been here a few times now and everything I've had has been delicious.\n\nThey have a wide array of options, but dairy/non-dairy, fresh fruit, cookies, nuts, chocolate, caramel, yada yada yada. LOVE this place. :)"
        }, 
        {
            "index": 16, 
            "rating": 2, 
            "review": "Ice Pan secrecy? More like Ice Pan misleading! The \"fruit and red bean\" shaved ice looked good in their picture, but you have to choose between fruit and red bean! Only three fruits are included. It's literally a bowl of crushed ice with some pink-colored fruit syrup. I brought it back and requested the whipped cream that's shown in the picture, but it wasn't much of an improvement.\n\nGo for a $6+ ice cream creation to watch a Slap-Chop commercial in action on an anti-griddle, if you don't lose your sweet tooth after reading the pamphlet on the counter about the sea vegetables and all-natural laxative included as ice cream ingredients. \n\nThis review has been brought to via mobile publishing on the Yelp app."
        }, 
        {
            "index": 17, 
            "rating": 4, 
            "review": "Being a first timer here I was amazed by the people making the ice cream. It was cool watching your ice cream being made from fresh fruits. \n\nI ordered mango and pineapple, after waiting about 5 minutes my order was up. One of the ice cream server poured my liquid blended fruit onto the pan. From there he began the process of mixing the blend and each time he would mix it by chopping, flipping and slapping the \"putty knife\"? The liquid blend started to look more like an ice cream. Once it was done he scooped it up and put it into our cups. I wish it was like the videos I've seen online where they put it into a roll instead of a scoop like regular ice cream. \n\nNow for the taste review. I got mango and pineapple. The fact it was real blended fruit the texture was pretty slimy but that's just me. I never had freshly blended fruit ice cream so it's definitely not the same as regular ice cream. I tasted the mango which was sweet but the sourness of the pineapple was there also which almost killed my mood just a bit. I was craving the sweet more so the pineapple was a thumbs down for me. The pineapple must have not been ripe or I had the bitter end. \n\nOverall the place was nice and entertaining somewhat. Just watching a couple guys make ice cream chopping, slapping, and flipping the ice cream being made was interesting but YouTube made it more interesting in Asia where I've seen it before coming here. \n\nI recommend this place if you haven't seen anything like this. Stuffs you up with fresh fruit I've cream."
        }, 
        {
            "index": 18, 
            "rating": 5, 
            "review": "Cannot recommend this place enough! The staff is phenomenal and the ice cream is beyond compare. It was probably the healthiest thing we ate all day. Only wish I had more stars to give!"
        }, 
        {
            "index": 19, 
            "rating": 5, 
            "review": "Amazing concept. You choose your own milk (nonfat, soy, whole) and your flavor and toppings. Everything is fresh and natural, made to order right in front of your face, and they feature different and interesting seasonal flavors you won't be able to find anywhere else. I tried their green grape icecream today and not only was it made quickly and skillfully, but also service with a smile. Everything looks clean, fresh and welcoming. Great place. I hope i get to see more of these popping up everywhere. Specially in California. I don't like going inside Harrah's, but I do only to visit this location."
        }, 
        {
            "index": 20, 
            "rating": 5, 
            "review": "First off, I have to praise their extraordinary and enthusiastic customer service. I'm from California and NOBODY has ever been this great to me!!\n\nI was staying at Harrah's from december 28 to the 30th and I had to crave ice cream in 30 degree weather. I was at the Venetian shopping with my boyfriend when my mom called me that she and this other family that accompanied us were eating ice cream at a shop in Harrah''s. So my boy and I rushed over and there, we were introduced to Ice Pan. Ice pan is basically a \"create-your-own ice cream\" concept owned by friendly and adorable Koreans. \n\nI ordered green tea flavored ice cream with soy milk and cheesecake bits, but changed to strawberry toppings in the end. It was so healthy and tasty which I love! The owner who took my order was great and high-fived me whenever he thought I made an excellent choice. \n\nThe ice cream creator who upfront made my order together was done within 5 minutes and offered it to me with a friendly smile. Aw thanks!\n\nThe cool part is that the owner seemed to have his own private popsicle stand in the employee room and would call my family over SEVERAL TIMES FOR FREE POPSICLES. I wasn't able to get one since I was still working on my ice cream, but flavors range from fruity to green tea.\n\nThis place put a smile on my face after an exhausting day in Vegas. I applaud them for their energy! Thank you! I will definitely be back!"
        }, 
        {
            "index": 21, 
            "rating": 4, 
            "review": "Ice cream is alrightttt. It's more of the experience of going here that makes it fun.  Lots of flavors and combinations though!"
        }, 
        {
            "index": 22, 
            "rating": 2, 
            "review": "We ordered the strawberry with whole milk and cheesecake bites.  I didn't like it.  We only came here for the experience and I will never be back.  Well... maybe I will come back to try the Popsicle."
        }, 
        {
            "index": 23, 
            "rating": 5, 
            "review": "Excellent ice cream and excellent service. The owner and the people who made us the ice cream said Tui the customers if you don't like the ice cream cone back and they will make the ice cream for free. But the ice cream was so tasty. We had mango with soy milk & pineapple. The second ice cream was coffee with whole milk and pecan. They were so tasty."
        }, 
        {
            "index": 24, 
            "rating": 5, 
            "review": "Really unique ice cream place that is sadly leaving Las Vegas soon. All natural, made in front of you creations. Choose your choice of dairy or non-dairy milk, fruit, candy and vegan flavors. It was surprisingly not very sweet, which I love, but completely refreshing. I got the peanut butter with low-fat milk and Reese's. Sweetened with a natural sweetener that acts as a laxative, you gently go poo in the morning and clean out your intestines! What more could you ask for in an ice cream? Only open until the end of August, they are headed to Cali as their contract is up with Harrah's. It probably will do better in Cali."
        }, 
        {
            "index": 25, 
            "rating": 5, 
            "review": "You basically can't go wrong with any flavor you choose here, and it's a show too! Think of Coldstones, but they actually make the ice cream from scratch right on the pan.\n\nStart off by choosing the flavor, ranging from fruits to coffee and mint chip, then the milk type, and any additional add ins. They have whole fat milk all the way down to nonfat and even soymilk, so for those of us trying to watch the fat intake and lactose intolerant, this place is perfect. The owners get only the best fruits and they're always super sweet. The husband actually drove all the way to LA just to buy fresh pomegranates! They'll make suggestions of what add-ins go best with what flavor, and they've never steered me wrong. They owners are also a blast to talk with! \n\nAny travellers looking for a treat, or locals, should definitely give this place a try! It can be a little tricky to find though, it's all the way in the back of Harrah's, by the parking structure entrance, but it's well worth to walk back there."
        }, 
        {
            "index": 26, 
            "rating": 5, 
            "review": "I think it's really sad that this place is tucked away in an unlabeled corner at Harrah's (it's up the stairs leading to the rooms at Harrah's, on the left)! This place was awesome, I came here with my girlfriend and we shared their pistachio ice cream. The two workers there were both super friendly, chatting as they were working hard to produce the delicious ice cream on the spot. I was quite impressed by the amount of effort they put into making the ice cream.\n\nThe service was excellent as well. The manager was extremely friendly, and even offered us free toppings (along with some of the other guest). She recommended bananas with our pistachio ice cream, which at first sounded rather strange but tasted extremely good! She offered the customer before us oreos and mochi to the one after us, giving what she considers to  be excellent pairings to our flavors (which they were).\n\nI think it's a pity that this place is so hidden and has no signs to direct you to it, but I definitely plan to come back to here the next time I come to Vegas!"
        }, 
        {
            "index": 27, 
            "rating": 5, 
            "review": "I barely give 5 stars for a business but this place can earn more than that! For both service, the ice cream, the fruit, the flavor and whatever related to this ice cream store.\n\nThe owner is hilarious who makes you laugh and enjoy your waiting time. You are required to have at least some high-five and boom! before leaving. Even though he has some accent which is kinda hard to understand but I don't care, i just love this place. I saw he was sweating that meant he put a lot of efforts in order to satisfy the customers.\n\nLet's talk about the food, no sugar, no chemicals, no preservation ... What else do you expect from the ice cream? Delicious and awesome. Let him entertain you and let yourself being entertained. Also have him to serve your ice cream if he's not busy, why? As he said \"the more i'm angry, the more happy you are cuz i will make a better food for you\". He flips and bangs your food like nobody else but believe me, he's right. The more he plays with your food on the pan, the more you will like it.\n\nHow they make the ice cream? You will have to choose your flavor, your milk and your toppings. They make it from scratch that means you will see like how peanut butter can be made into ice cream.\n\nMy recommendation for the ice cream? Try the peanut butter cuz it's the owner's fav. he will make his own flavor for you and you will enjoy it for the rest of the day.\n\nAnd be careful, you will have to pay a bill of nearly 6 million dollar for an ice cream. (that's what he calls for a 6-dollar ice cream) :)\n\nThis place makes my day! I gave it thousand stars instead of five."
        }, 
        {
            "index": 28, 
            "rating": 5, 
            "review": "NO SUGAR!!!  Ice Pan is a healthy alternative for ice cream.  They offer about 12 flavors to choose from, your choice of dairy, and a plethora of fresh fruits to choose from to add into the ice pan.  The process is amazing to watch.  It kind of makes you forget the hefty price you paid at  the cash register.  Kind of...it's about $7 for a bowl.  It's delicious though and worth every penny.  In addition, the owner/manager, will make you another one if your primary choice for ice pan isn't to your liking.  What a nice guy!  He's funny, sometimes, too.\n\nI tried the banana with blue berries made from low fat milk and topped with caramel sauce.  I got the thumbs up for my choices from the man himself.  Way to go me!  I also tried the green tea with lychee made with whole milk.  I needed a little help with this one.  I had to ask his recommendation for a fruit to add with green tea.  Boo...booooo to myself.  I liked them both as well as the red bean flavor my brother ordered with mochi.  The employees are cool and nice.  The place looks clean and eye catching.  Next time I'm in Vegas I definitely will stop by again.  One thing though, Ice Pan is cash only.  ATM's are conveniently located downstairs and all around Harrah's."
        }, 
        {
            "index": 29, 
            "rating": 5, 
            "review": "someone beat me to yelping this place first?? oh man! it's inside harrah's upstairs near toby keith's i love this bar, actually asked 2 front desk in harrah's and the lady said she never heard of it.. save yourself some trouble and just go upstairs.. love this place! super friendly staff.. explained the whole process to us.. pick your flavor, your milk and your mix in.. we had strawberry w/ skim milk, with banana and raspberry mixed in.. it was so good.. best ice cream i've ever had! \n*Natural Ice Cream\n*Instantly Blended with Fresh Fruits and Vegetables.\n*No Artificial Colors or Preservatives! \n*Quick: Made within about a minute\n*Dairy Choices: SOY, Nonfat, Regular, or Whole\n*Flexibility: 15 Fresh toppings, and 10 flavors of ice cream\none of my new fave places!"
        }, 
        {
            "index": 30, 
            "rating": 5, 
            "review": "Incredibly and pleasantly fresh and delicious. Would definitley reccomend this place. Not only that but the lovely lady has incredible service. Made our day!"
        }, 
        {
            "index": 31, 
            "rating": 4, 
            "review": "As I am sitting, in Harrah's in Las Vegas.  I am at Ice Pan having dessert.  It is a small little place on the second floor.\n\nI chose to have their Banana ice cream with soy milk and cheesecake bites topping.  It is yummy, but a bit on the expensive side.  Would order again.  (4 stars)\n\nWatermelon ice cream with low fat milk and strawberry topping was my wife's choice.  It is also delicious!  Would repeat this order again as well.  (4 stars)\n\nThey will be closing on August 30th, but will be opening at Buena Park,  CA.  Look forward to going there.  Hopefully,  the price will be lower!  In the meantime, this is a great place to cool down at the Las Vegas Strip!!"
        }, 
        {
            "index": 32, 
            "rating": 5, 
            "review": "LA's loss is LV's gain. Ice Pan is not only delicious, it's the closest to \"healthy ice cream\" that you'll ever get. Ask the owner Andy (the energetic man behind the counter) and he'll tell you all about it (along with all the secret flavor combinations that will surprise you in the best way possible). The ingredients are always fresh, the service always with a smile, and no one will judge if you have more than one :)"
        }, 
        {
            "index": 33, 
            "rating": 4, 
            "review": "Yummy but pricey! It was really easy to find from the parking garage in Harrahs - just take elevator to casino and its like a minute walk past the toby keith bar. \n\nWorkers were very nice, but hard to understand at times. I had an incredibly enthusiastic Korean guy helping me. There was a list of suggested combinations on the counter, but he was also full of suggestions. We went with the following: chocolate w mochi and coconut, coffee w chocolate chips, red bean and mochi. All turned out pretty well. \n\nThe end result was kinda sorta like yogurtland all mixed up. But the coffee stood out - the coffee flavor was really strong in a good way. \n\nThey put on a good show mixing up the ice cream, like a really p*ssed off version of benihana. Is it really worth $15 for 2 ice creams? Mmmm I'm not so sure, but it was pretty awesome. Guessing high price was a big factor in why the Cali store didn't make it. With so many other equally delicious but cheaper frozen treats, its hard to compete.\n\nI couldn't find a phone number for them to check when they closed, but according to the Harrahs operator they're open 10am-2am. But don't quote me, I'm not sure they'd be open that late."
        }, 
        {
            "index": 34, 
            "rating": 5, 
            "review": "I love Ice Pan! Please open one in London.\n\nI had the green tea soy ice-cream with lychee and my partner had the peanut ice-cream with Splenda and walnuts. I love that you can completely customise your ice-cream so you can have any flavour sugar-free and/or dairy-free.\n\nIt has a really fresh, delicate taste, I wish I could have some right now. I wasn't that into Las Vegas but I would go back for more Ice Pan."
        }, 
        {
            "index": 35, 
            "rating": 4, 
            "review": "This place is a hidden gem! We had just eaten lunch at KGB, and were by no means hungry, but we spotted this place on our way back to our car and had to stop out of curiosity, and I'm so glad we did! The guy working there was really friendly and went out of his way to be helpful. We had seen red bean as a flavor option on the video, but it wasn't on the board, so we asked him about it. He dug around in the back til he found some, then called his boss to make sure it wasn't expired! Thanks for that! So we had red bean with lowfat milk. The ice cream had a yummy flavor, but a grainy texture. I want to try a different flavor next time, as I think the texture could have been partly due to the red bean. We will definitely be back when we have a little more room in our tummies!\n\nOh, PS, they are CASH ONLY!!!"
        }, 
        {
            "index": 36, 
            "rating": 4, 
            "review": "You want how much for this serving of ice cream? $5.95 base price, add $.50 for each topping, and $.85 more if you want a waffle cone. At first, I was put off with the fact that they are so careful with how much of the mix ins they put in. I watched my ice cream maker count out three raspberries and eight blueberries to add into my mango soy ice cream. For $7, I was starting to feel nickel and dimed. \n\nThis all changed when I got my ice cream. It was rich, naturally sweet (treading too sweet, but never overstepped the line), getting raspberries to balance it out was a good choice. My hater mentality quickly went away while I enjoyed this delicious treat. It is hard to stay mad after seeing how much work goes into making each cup. The scraping, slapping, cutting, smashing, and mixing is tedious work. \n\nThe cashier slashes out the gratuity line on the receipt, so bring a few dollars if you plan to tip. After watching them work, it is hard not to throw a few dollars into the jar."
        }, 
        {
            "index": 37, 
            "rating": 4, 
            "review": "$8.05 per cup out the door. There is only 1 size but you can add anything you want. We made our own rocky road if you will and enjoyed every ounce of it. Everything is made on the spot. No preservatives, artificial flavors, or extras. Its as natural as it gets. \n\nOne problem I see though, they only had 1 gentlemen working the counter and making the ice cream which took about 5 minutes per customer. Luckily we were the only ones in line when we arrived. \n\nIts definitely a tourist spot. I certainly won't drive here just for the ice-cream since the Harrah's self-parking lot is one of the worst to park navigate into, through and out of. \n\nLocation: Inside the Harrah's, next to Toby Keith's bar, adjacent to the Starbucks. \nBaby changing table: Yes in women's restrooms are across the walkway (approx 20 ft away)\nKid Friendly: Yes, they would love watching their ice-cream being made. \nBathrooms: Women's (Clean) \nBest part of this place: Everything is fresh, no added sugars or artificial flavors\nWorst: Nothing."
        }, 
        {
            "index": 38, 
            "rating": 4, 
            "review": "Andy just knows how to persuade people lol he was the sweetest though, the other two young workers seemed like his minions hahhaa I chose the low fat mango sorbet with lychee, healthy choice or what. :p it was kind've pricey but it's definitely worth it to go at least once! But I'd go again just because the customer service was good and there's many more other flavors I'd like to try. but the slams of the ice cream to the ice pan though lol I couldn't help but flinch every time they slammed that shit I guess that's what it gets for being so cold :( \n\n\nHEHEHHEHH\n\nOh yeah! Thank you for giving us water bottles in this nasty heat : )"
        }, 
        {
            "index": 39, 
            "rating": 5, 
            "review": "The family that works there has probably the best customer service, very hospitable and the ice cream is fresh! From liquid to ice cream goodness. Had the vanilla with whole mile and oreos, gf had mint chocolate chips and the lady who worked there was even nice to sprinkle some oreos on the top. \n\nThe place is in the 2nd story at harrah."
        }, 
        {
            "index": 40, 
            "rating": 5, 
            "review": "Interesting and delicious ice cream. Everything from ordering the ice cream to watching it being created was fun. LOVE the cashier and the ice cream makers. They are incredibly good people, funny, and make delicious ice cream. I hardly ever tip over a dollar at these kinds of places. Here I want to tip them more. \n\nTry the strawberry! Yum!\n\nPark in the Harrah's garage and walk inside."
        }, 
        {
            "index": 41, 
            "rating": 3, 
            "review": "Pretty cool concept for ice cream! I enjoyed watching them make the ice cream on the pan and putting in all the toppings, but the price just doesn't justify the product. $7 for a regular with 1 topping! Ahhh if only the flavors were more exotic or creative then maybe... but the flavors were pretty generic - Chocolate, Mint Chocolate Chip, Coffee, Mango, Pineapple, Pina Colada, etc. Not to mention the size... I get that it's Vegas but come on... gotta step up your game if you want to compete with the other ice cream shops out there!\n\nEssentially, you are just paying for the guys to mix your ice cream and freeze it on the pan. It's quite a lot of work for a small amount of ice cream, but I guess the novelty is what attracts people. Overall, I won't be going out of my way for this place again."
        }, 
        {
            "index": 42, 
            "rating": 5, 
            "review": "I had to check out Ice Pan's concept of making ice-cream right in front of you so I stopped by during my last visit to Vegas. Ice Pan is located on the 2nd floor promenade at the Harrah's Las Vegas hotel so unless you know about it and come specifically looking for it I doubt that you will ever run into it.\n\nOrdering seems complex but is very straightforward. You start by selecting the base ($5.95) for your ice-cream which could be whole milk, non-fat milk or soy milk, then select the flavor from Strawberry, Mango, Banana, Kiwi, Green Tea, Vanilla, Chocolate, Yogurt, Coffee, Lemon, Pistachio, Mint Chocolate, Red Bean, Watermelon, Pumpkin, or Pomegranate and finally select the toppings of your choice (50c each) from Strawberry, Banana, Kiwi, Mango, chocolate Chip, Blueberry, Walnut, Pineapple, Almond, Granola, Macadamia, Coconut, Marshmallows, Chocolate Syrup, Caramel, Mochi, Lychee, Fruity Pebbles, and\\or Raspberry.\n\nI decided to try Red Bean as that is a really difficult ice-cream to get right specially considering that Ice Pan claims it has no artificial coloring, no refined sugars, no extra sodium, and no preservatives. The milk and red beans are basically blended together and then dropped on an ice pan which causes it to instantly freeze. This is then followed by softening the frozen ice-cream by scrapping it up and trashing it around using two metal scrapes. After a minute of repeating this softening process toppings are mixed in and finally the ice-cream is scooped into a cup. I went with mochi toppings as it goes well with red beans which was a good choice as they seemed to pair up perfectly.\n\nTaste wise this is the pinnacle of not-too-sweet, but believe me its good. If Ice Pan can get someone like me who likes sweet ice-cream to appreciate the natural inherent taste of red beans then they are definitely doing something right. Service is excellent. The owner is very friendly and approachable and could easily be a role model for others.\n\nLeft completely satisfied so will surely return to try something else the next time I'm in Vegas."
        }, 
        {
            "index": 43, 
            "rating": 5, 
            "review": "Ice pan located at the Harrah's Hotel is hands down the best ice cream place I've ever been to. Not only is it a unique form of ice cream, it's tastes outstanding. The owner of the ice cream shop is who helped us and he's super hilarious. Definitely a must try in vegas!"
        }, 
        {
            "index": 44, 
            "rating": 4, 
            "review": "The location is on the mezzanine level of Harrah's if you're walking into the casino from the strip. Fairly good ice cream if you've never had ice cream made on a frozen slab before. The consistency of it is really creamy despite the percentage of fat in the milk you choose. Although it doesn't have that ice cream consistency you get out of the tub, it tastes very clean and goes down easy. The cashier and the guy making our ice cream was extremely nice and offered some toppings free of charge since it was our first time. Watching them make it is probably the best part."
        }, 
        {
            "index": 45, 
            "rating": 4, 
            "review": "Wow...Ice cream benihanas! Ice cream made before your eyes on a ice pan. End result was great tasting fresh ice cream. Great Experience...take the kids and enjoy!"
        }, 
        {
            "index": 46, 
            "rating": 3, 
            "review": "GREAT TEXTURES on the ice creams!!!\n\nfrozen yogurt with pineapple and mochi.. flavor was a bit mild (yogurt could have been more tart AND sweet).. did not like the pineapple chunks that were too frozen/hard\n\npeanut butter with m&m's.. SOLID\n\nwait time is TOOOOOOO LONG.. 30 minutes for two ice creams when you're the only one in line.. thats unacceptable"
        }, 
        {
            "index": 47, 
            "rating": 5, 
            "review": "This place is amazing.   If you're looking for a place that can give you a delicious, fresh, handmade creamy dessert, with or without dairy, and relatively  low sugar (I'm told they use Splenda, which has dextrose), and all natural ingredients, this is the place.   I first time I tried their Lemon ice cream (which I chose with Soy Milk) and it was amazing.  The owner showed me the lemon juice they make it out of.  Then they make the ice cream right in front of you.   And mix in any number of optional ingredients, such as nuts or fruit or cheesecake bites.   \n\nIt's like a combination of Coldstone Creamery and most frozen yogurt places, with the unique twist--again--that they make it all from scratch in front of you.\n\nAt the moment, this place is only in Harrah's on the strip in Las Vegas, but I'm praying the owner expands and opens some up here in the Los Angeles area (preferably in the east san fernando valley :))     It would do AMAZING business out here.  The problem is that given the time it takes to make each order, I could see them having a problem handling the volume of customers they would likely get!"
        }, 
        {
            "index": 48, 
            "rating": 5, 
            "review": "This review is long over due. Ice  pan is truly  a hidden gem. Because I was staying at the Harrah's, I must of walked passed ice pan at least 5 times a day. Finally on my last day, I was craving something sweet and saw a group of people gathered in front of ice pan. They were all watching their ice cream being made right before their eyes. I stopped to check it out and then decided that I too deserve freshly made ice cream. I kept it simple and went with banana ice cream with strawberry bits. Their ice cream packed so much flavor in every bite and was extremely creamy. The reason I gave them 5 stars is because the staff was super friendly and accommodating. I felt they were truly there to please. I cannot wait for their Buena Park location to open up later this year!"
        }, 
        {
            "index": 49, 
            "rating": 3, 
            "review": "Luckily, I was staying at Harrah's so I didn't have far to go to get my ice cream fix. \n\nI was able to find Ice Pan pretty easily. It did take me a while to figure out what I wanted though. I ended up with pistachio flavoring and soy milk as my milk base. I also added in cheesecake bites and strawberries. I loved that I got to taste bits of REAL pistachio. I wish my cheesecake bites were just put on top of my ice cream instead of mixed in...but my fault for not specifying. Otherwise, pretty good ice cream. Not worth the price though, in my opinion. I might come back again just to try out different flavors/combinations. A plus though for having soy milk for those lactose intolerant!"
        }, 
        {
            "index": 50, 
            "rating": 1, 
            "review": "Very cool way to make ice cream,, fun to watch BUT texture is so gummy, it's not at all cold and tastes like sugar free,, my hubby and I couldn't eat more than a few bites until it went in the garbage.. I'm shocked all the good reviews.. Yuck! One star cuz it was unique."
        }, 
        {
            "index": 51, 
            "rating": 5, 
            "review": "5/5!\n\nUnique. Awesome. Healthy. \n\nService: The service is great. The owner (I believe) whom everyone says talks a lot, deserves to talk a lot! He's great and helped us out so much! Their guarantee is if you don't like it, they'll make you another one! Now that's customer satisfaction. He's super sweet and loves doing what he does, so props to you man. Also, his employees seem to enjoy it too. So, friendly owner, means friendly employees, means friendly service. They're awesome and a great help!\n\nQuality: The ice cream here is like no other. Everything is made fresh. Fresh fruit! You can choose the type of milk you want: soy, low fat, non fat, whole. It's honestly one of the greatest ideas I've seen. It's an ice pan and made in front of your eyes. Definitely worth watching and taking lots of videos! The ice cream is really good texture, if you're a fan of just normal ice cream out of a tub, this isn't for you. But if you want to try something new, tasteful, fresh, and on the low calories side, I would definitely try this place out!\n\nOn busier days, wait times can go from 30-45 minutes, but hey, if it's busy it must be worth the wait to try! I would be worried if they didn't get any business. But they are thriving! We went late night on a Sunday so it was no wait, but then after we ordered so many people got in line. So it was perfect timing on our part. Personally, I got the lemon with low fat milk and fresh raspberries. It. Was. Delicious. Not to lemon-y like some sorbets. It was fresh. Soft and creamy, yet still had the sorbet type of feel. My friends got pistachio with soy milk and cheesecake, and mango with low fat milk and mochi. The pistachio tasted like real pistachio and the mango made me feel like I was in the Philippines! You can definitely taste the freshness. \n\nOverall, we had a great experience and will definitely be coming back and bringing the friends. It's located inside the Harrah's and definitely another one of Vegas' hidden gems. I was scared seeing all the reviews and not liking it, but boy did it surpass my expectations."
        }, 
        {
            "index": 52, 
            "rating": 5, 
            "review": "FANTASTIC ice cream with an OUTSTANDING server!   We decided to give it a shot after walking by and watching this gentleman bang around ice cream in a tray...\n\nThis is the perfect treat. Seemed a lot healthier than regular ice cream and it is made with natural ingredients.  Fresh fruit was used with our watermelon ice cream treat. It is by far one of the best things I have eaten as far as ice cream. Everything was fresh.\n\nThe older Asian gentleman making it was INCREDIBLE! He was very personably and you could tell he loved his job! It is what enticed us the first time.\n\nGive it a try! It's worth a shot and a great show from an awesome guy!"
        }, 
        {
            "index": 53, 
            "rating": 5, 
            "review": "This place makes the best ice cream! My wife and I were walking around killing time at Harrah's and we just happened to run into this shop! You choose the ingredients you want to go in it, including what type of milk to use. Then, the workers there mix it all up in a bowl and throw it on this really cold ice pan.\nWe decided to get lemon ice cream made with soy milk and blueberries. Try it out! It is worth it!"
        }, 
        {
            "index": 54, 
            "rating": 4, 
            "review": "Better than Coldstone's? I think so. Park in Harrah's garage and walk right in, it's pretty much right near the entrance of the self-park garage.\n\nPretty cool how you can see it go from milk to ice cream in a matter of seconds right before your eyes. I had the pistachio with whole milk, almonds, cheescake, and mochi. It was delicious and very creamy. To top it off, you must get it in their homemade waffle bowls, it's not overly sweet but has very nice sugary crunch to it that goes well with the ice cream. Only downside is that this place isn't exactly cheap, everything came out to like 9 bucks for something that's really not all that big.\n\nhttp://www.yelp.com/biz_photos/RHi3Bn4HBGBp105LdVlZbQ?select=rZ4Ib8pZ0sAqUC0PvdrfKw#rZ4Ib8pZ0sAqUC0PvdrfKw"
        }, 
        {
            "index": 55, 
            "rating": 5, 
            "review": "SO GOOD! I love that you can get different types of milk in your ice cream. I usually don't eat dairy so it's nice to have the option of soy milk. It is a really great guilt-free indulgence, especially on a hot Vegas day. This is a really popular concept in Asia, so it's cool that we can try it in the US too."
        }, 
        {
            "index": 56, 
            "rating": 4, 
            "review": "INNOVATIVE ice cream experience!!! Problem is, Ice Pan is NOT easy to find.  So you don't have to keep screaming \"Marco!\" in the casino and people start callin' Se-Cur -a-tee on ya for disturbin' the peace, here's da scoop... Nyahh!  Ice Pan sits inside Harrah's Casino, on the 2nd level Promenade.  But there's no signs for it, so follow the 1st level arrows to Toby Keith's Bar & Grill cuz it's right across from it!  Ya know yur close if yur going up an escalator beside the Fulton Street Food Hall (at street level). Take it up to the 2nd level & look to the left... Found ya!  That's half the battle.  WHAT NOW?!?  Now, ya gotta decide creation options with their 3 step choice process: flavor choice, dairy choice (Yay!  They have SOY MILK!!!), and topping choice.  So we sampled a few things...\n\nWhat's cool is the ice cream is made RIGHT IN FRONT OF YOU!!!  But there's NO liquid nitrogen here.  To quote, \"Pan Ice is self Freeze-Teppan style ice cream.\"  The teppan (steel grill) is chilled to a arctic -35degrees Celsius.  After the concoction you request is mixed in the back counter, it's dropped on the teppan and after a lil mixy mixy, Poof!  Pan Ice fo' you in minutes!   Takes longer to decide what to put in yur cool treat!  Here, a cold water SEAWEED emulsifier is used for bonding rather than some unpronounceable group of letters.  The sweetness is created by FructoOligoSaccharide (FOS), a natural sugar found in highest concentrations in the blue agave plant, Jerusalem artichoke, and yacón (Thanks Wikpedia!).  Our creation choices today were pistachio with almonds (with soy milk), strawberry with strawberries, and vanilla with Oreo cookies.\n\nDespite NO artificial coloring, NO refined sugars, NO extra sodium, and NO preservatives, this treat was YUMMY!  I could EASILY go for repeat scoops of this healthy ice cream advancement.  I like the fact that it didn't melt fast, either.  No irritating rumbly tummy that other yelps mention from the laxative effect of FOS by my fams as well.  NO hatin' here, we're fans! ;)"
        }, 
        {
            "index": 57, 
            "rating": 5, 
            "review": "Wow! Just wish this place was not on the strip. It should be across the street from my house!"
        }, 
        {
            "index": 58, 
            "rating": 2, 
            "review": "Was gonna give it a 3 stars but it is simply way overprice for ice cream. \n\nIce Pan brings a unique twist to making ice cream which involves the Liquid nitrogen but they first grind up the ingredient that you ask for(I.e. if you get pistachio they grind up the pistachio and then pour in nitrogen). After that, they put into an ICE PAN, and then literally smack it a lot of times and cut it in half. The cool thing is that for the mango ice cream that I had which we got pineapple topping with, they chopped up all the pineapple in the process with the ice cream making and it goes well together. I don't really know how to describe it.. haha\n\nRegardless, I think the texture to it is not something I'm too used to but i thought it tasted okay. I say if you haven't tried it, you can go try it once because it's pretty cool to see how they make it BUT I simply would not pay almost 8 dollars for ice cream. That's ridiculous."
        }, 
        {
            "index": 59, 
            "rating": 5, 
            "review": "I found this place on my last visit to Vegas . It was when we happen to walk by and it looked good so we thought we should try it. We ordered the red bean ( with soy milk to make it vegan) and had the mochi topping. It was so tasty and refreshing.  We went back during this trip and will keep coming back. The staff is helpful and friendly. This is a sweet treat for everyone. It's a little hidden you have to go to the back of harrah's and it's up the stairs near the exit to the parking lot."
        }, 
        {
            "index": 60, 
            "rating": 4, 
            "review": "What a nice place, the employees are so nice and friendly and the ice cream is beyond delicious, fresh and healthy l would recommend this place to everyone the only bad thing is the prices are a little high but it is so worth it.!!!"
        }, 
        {
            "index": 61, 
            "rating": 5, 
            "review": "This place is amazing!  Never seen ice cream made this way and it's HEALTHY!  If you ever have a chance to get to Harrah's in Vegas, you have to try Ice Pan!"
        }, 
        {
            "index": 62, 
            "rating": 1, 
            "review": "I couldn't find this place on my recent visit so I called them for information.  The guy on the phone told me they no longer had this location open. Ugh....ok."
        }, 
        {
            "index": 63, 
            "rating": 5, 
            "review": "Ice Pan is located in Harrah's on the strip; go all the way to the back and up the escalators and it'll be on your left. As of May 2014, they only accept cash but it's not too expensive.\n\nIce Pan offers made-to-order ice cream using a base mixed with your choice of soy, nonfat, lowfat, or whole milk and is flavored using real ingredients, no artificial flavorings. Once the mix is blended, it is dumped on a super cold and freezing ice pan, scraped, and slapped against the pan to incorporate air until it is the texture of ice cream. \n\nSoy green tea with mochi mix -in - The matcha flavor was deep and the texture was just like ice cream, soft but yet firm and melted in your mouth, but doesn't melt as quickly as froyo. It's not too sweet at all - just lightly sweetened - and no heavy sugar coating on the tongue after it's finished.\n\nRed bean whole milk with mochi and caramel drizzle - the flavor really shined! I find that the red bean flavor often gets lost in a lot of frozen desserts, but you could definitely taste it in Ice Pan's ice cream.\n\nThere was no artificial aftertaste and both options of milk yielded a creamy texture. I think nonfat would yield a creamy texture too - I'll have to try that next time.\n\nYou have the option of adding chocolate of caramel syrup or of course for extra $, additional toppings or whipped cream. I didn't add anything else since the mochi itself would make this dessert sweeter and heavier mind you. \n\nThe staff was great and knowledgeable; the older man who I think is the owner is very passionate about his product and you can see how enthusiastic he is to make it for you. I really think the positively surprised look on people's faces makes his day."
        }, 
        {
            "index": 64, 
            "rating": 5, 
            "review": "I LOVE LOVE LOVE THIS PLACE!\n\nThe workers and especially the Korean store owners are so animated and funny and just the best! They're really friendly and applause you or high-fives you (at least for every time I've ever went). He also gave me and my friend free water bottles. \n\nOther than it's amazing service, they also have reallllllly good ice cream. It isn't your everyday ice cream because its a healthier choice and there's a variety of flavors, topings, milk choices (lol) and all that. You can also watch them make your ice cream from scratch. It's literally the coolest thing in terms of watching your ice cream being made on a \"iced pan\"!\n\nThis is a hole-in-the-wall type of place because it's not near the shopping areas but you'll find it on the second floor of harrah's. \n\nIt's a little pricey but it is definitely worth the cost and visit. Bottom line, I LOVE ICE PAN!"
        }, 
        {
            "index": 65, 
            "rating": 5, 
            "review": "I cannot say enough good things about this place. They literally make the ice cream in front of your eyes. It is definitely an experience! I've never had my actual ice cream made before me (and no, nothing like Coldstone). You pick the flavor, the milk, and the topping and watch as this magical pan freezes your tailored concoction in to ice cream! I had coffee with lowfat milk and raspberries...I never finish traditional ice cream because it's too fatty (and I don't have a gallbladder) but I was able to totally enjoy this ice cream and felt great afterward. As the cashier/entertainer said - \"this not junk food, this healthy food!\". Thank you Ice Pan! Can't wait to get back to Vegas and try a new flavor!"
        }, 
        {
            "index": 66, 
            "rating": 3, 
            "review": "Friendly staff but ice cream is marginal. I don't need to see it made and I don't want it healthy (it's ice cream after all). The staff makes it 3 stars, the ice cream itself is 1 to 2 stars."
        }, 
        {
            "index": 67, 
            "rating": 5, 
            "review": "Ice Pan is really a break from the norm in terms of ice cream. My friends and I were on our way back to our cars after watching the Mac King Comedy Show at Harrah's when we stumbled across a group of people gathered around this place. Upon checking it out we discovered that it was an ice cream shop where your ice cream is made right in front of you! We ended up giving it a try.\n\nIt was incredible! They have a decent selection of flavors to choose from including strawberry, mango, kiwi, and even mint chocolate. After picking your menu you also get to select whether or not your ice cream will be made out of whole, low fat, non fat, or soy milk. Once you've selected those things you can choose to add as many toppings as you'd like although I wouldn't add more than 3 or 4 as it beings to get pricey after that. When your ice cream is finally prepared you can choose to have it served to you in a cup or a waffle cone.\n\nIt tastes amazing. I ordered the strawberry ice cream made from whole milk with almonds, bananas, and cheesecake bites and it was fantastic. The taste of the ice cream was just so fresh. They blended everything together nicely and even the process of making the ice cream was awesome. I definitely recommend this place to anyone on the strip looking for a healthy and delicious treat."
        }, 
        {
            "index": 68, 
            "rating": 5, 
            "review": "So I came across a nice little ice cream joint on yelp because I wanted ice cream and it was 10:30 and what better place to enjoy some ice cream than the Las Vegas strip? So I went to check them out and was greeted by the most ecstatic cashier! I was blown away by the way the ice cream was made! It was delicious, definitely recommend this place to anyone looking for a different experience when going out for ice cream"
        }, 
        {
            "index": 69, 
            "rating": 5, 
            "review": "Really excellent concept fun fresh ice cream! Entertainment and food what else can you ask for they make your order fresh just for you."
        }, 
        {
            "index": 70, 
            "rating": 5, 
            "review": "Ice Pan can be a bit hard to find; located up on the 2nd floor of the Harrah's but ask someone that works there and they will be able to direct you.  Came here during my last Vegas trip and after reading some reviews, just had to try it.\n\nGot there around 10ish and there were a couple people waiting for their ice cream to be made. (NOT SCOOPED, I REALLY MEAN MADE)  Eventually ordered the green tea ice cream with mochi.  The cashier seemed to be the owner of the place.  A very nice and cordial Korean man wants the customer to know the benefits and the differences of Ice Pan and almost every other ice cream shop in the nation.  He mentioned that every was all natural.  He even showed me the powder they used to make my green tea ice cream (matcha powder).  He then opened one of the brochures for me to look over while I waited for my ice cream.  \n\nAfter placing my order, one of the 2 ice cream makers started making my ice cream.  They first mixed the powder with the milk and then added it to the anti-griddle.  Adding in a few bits of mochi and then they started mixing.  The cold structure made the liquid turn into the ice cream quickly and the person would start mixing it all around until it became the right consistency.  Ended up with three medium sized scoops with more mochi added on top.\n\nTaking my first bite, the taste of the green tea was very apparent and the consistency was perfect.  It wasn't over-churned (or hand-mixed in this cased) and the mochi was a great accompaniment.\n\nWatching the mixers make the ice cream was a bit drawing point to me.  It felt like everything was fresh and you actually knew what was going into it.\n\nI would definitely come back.  I really hope I do not come when it is busy because it took quite a bit of time to make the ice cream so i can just imagine how long it would take to get one if there are others in front of me."
        }, 
        {
            "index": 71, 
            "rating": 3, 
            "review": "After reading all of the wonderful reviews, I couldn't wait to get there. I brought 3 others with me and we are all big ice cream fans. We were all somewhat disappointed. The ingredients are healthier than regular ice cream and the show of making the ice cream is fun to watch but those are the only 2 good parts.\nIt took a good 5-10 minutes to make each of ours and there were 2 customers in front of us, so it was a good 30 minutes before mine was ever made (ladies first!). The real disappointment was the flavor. Between us we tried vanilla with peanut butter cup, chocolate with chocolate chips and mint chocolate chip with walnuts. They were all \"OK\" but the flavors seemed muted. It is expensive and so based on the time spent and the overall flavor we will not be back. Why is there no Carvel in Vegas when you need one?"
        }, 
        {
            "index": 72, 
            "rating": 5, 
            "review": "Ice Pan is by far the best ice cream I have ever had. I used to go to the Santa Monica location quite often, and then they closed down on me. So when I found out they had opened one at Harrah's in Vegas, I had to make a stop... or two... or three... fine, four times, okay. Located on the second floor by the monorail and bridge connection between Imperial Palace, I took my boyfriend here as a surprise since he, too, loved ice Pan when I first took him to the one in Santa Monica.\n\nSo I noticed a lot of people were laughing, not sure at or with the owner of Ice Pan. You see, the owner is unbelievably nice and really loves providing people the fresh and sugar-free ice cream he has created. He's enthusiastic to the extreme. Some people find that weird but I find that good customer service. i want the person whom takes my order to be over-the-top friendly. I want suggestions and to be explained how the place works. The owner high five me because it was NOT my first time and fist bump my boyfriend. \n\nSo we got the strawberry sorbet with cheesecake topping with soy milk. You pick a flavor ice cream, the kind of milk you want them to use, and one topping that they'll mix in. In addition, the staff was nice enough to add fresh strawberries on top of our ice cream. Love that they aren't cheapening out. A small is a good enough dessert portion for two, especially after a buffet dinner in Vegas. \n\nYour ice cream is made to order and you can watch them make it in front of you. In fact, it's encouraged and part of the Ice Pan experience to watch the staff make your ice cream from scratch. There are just a couple of tables in front of Ice Pan and those same tables are shared with the Starbucks next to it. Good thing ice cream can be one of those walk-and-eat kind of treats. \n\nA definite hidden gem in Vegas you do not want to miss."
        }, 
        {
            "index": 73, 
            "rating": 5, 
            "review": "As you know there are many ice cream shops, but this one is by far the best! Natural ingredients and you watch them make it. the owner was extremely helpful and just a wonderful experience!  loved the combinations of flavors!"
        }, 
        {
            "index": 74, 
            "rating": 1, 
            "review": "Got the soy mint chocolate chip. Couldn't taste the mint. Overpriced. Slimy. Tiny portions. Lacks finesse. Would NOT recommend. Disappointed."
        }, 
        {
            "index": 75, 
            "rating": 3, 
            "review": "Okay, I'm going to be honest with you. The only reason I came here was to watch how they make the ice cream. I've been seeing viral clips on Facebook and been wanting to go one. Thank god, one open up in Vegas. \n\nLocated in Harrahs hotel. Go on the escalators right before you enter the casino (this is coming from the parking lot side), it's on the second floor, right next to Starbucks. \n\nThe service is really good. I really like the guy who was helping us. He knows how to make jokes and know what flavors to mix. I got the strawberry cheesecake and my friend got the pineapple with coconut. I admit, the ice cream itself was really really good...for only the first few bites. After that, it gets really really heavy. My friend and I couldn't even finish half and had to throw the other half away. Also I don't think it's worth the price, $7 for a small? I guess it's the price to pay for a good show. \n\nI highly suggest if you want to give this place a try, share the ice cream with someone. One person cannot finish that thing by yourself."
        }, 
        {
            "index": 76, 
            "rating": 5, 
            "review": "So I have been here since they first opened in Harrah's.  After walking by all the time, I decided to try it and glad I did. Finally decided to write a review. One of the owners, Angela, is the coolest person ever! Their other workers are friendly too. The whole concept is neat and yes there is a wait time.. That is what comes when they make it right in front of you..dont know why people are so impatient.. But try the strawberry cheesecake, delicious!"
        }, 
        {
            "index": 77, 
            "rating": 4, 
            "review": "This place is friendly, healthy, but hella pricey (pocket change compare to everything nearby). \n\n\n\nA not too sweet ice-cream place.. :-) \n\n$7 for basically 1 scoop of ice cream from Baskin Robin is the amount you'll be getting.. (no cones) (with 1 topping).. \n\nBasically it's specialty ice-cream because they make it in front of you, using an ice table.. (imagine crepe or cold stone)... \n\nEverything is healthy according to the nice man who was helping us..  Super friendly dude..\n\nI would recommend this place \"to try\""
        }, 
        {
            "index": 78, 
            "rating": 2, 
            "review": "The guy behind the counter is INCREDIBLY ANNOYING AND LOUD. It was fascinating to watch. We got peanut butter made of soy milk. It didn't taste very peanut buttery.... so that was a bummer. And I think it was $6 for a pretty small bowl. It's kind of a pain to get to. IT was cool to watch but eh. I'd skip this."
        }, 
        {
            "index": 79, 
            "rating": 5, 
            "review": "So cool!  I had never heard of Ice Pan before passing by a few weeks ago.  My girlfriend Yelped it and we were in.  We ordered Strawberry ice cream with mango toppings and watched our ice cream turn from a few fresh ingredients to a smoothie-like liquid into ice cream!  We overheard the customer before us asking approximately how many calories the ice cream is and the employee estimated about 200.  Good deal!!  Will definitely be back whenever I'm in Harrah's!  Yay for healthy ice cream!"
        }, 
        {
            "index": 80, 
            "rating": 5, 
            "review": "Ice Pan was on my bookmarks list for a long time and when we ran by this place by accident, it was a must-stop for us to go to. The ice cream here is made-to-order meaning that they make it right in front of you when you order what flavor you want! They have a wide variety of ice cream flavors and the best part of this place is that you can choose what kind of MILK you want.. nonfat, soy, whole milk, etc. We opted for the green tea because that's one of our favorite flavors and by recommendation, we went with soy milk. It was such a treat to see the guy make it in this cold.. well, ice pan. He must get a work out every single time someone orders! Watching the process of making the ice cream from this powdery thing to a nice cup in front of you was so awesome! And, we added some mochi in ours as a topping to make it that much more asian! just kidding. The ice cream itself was creamy and smooth, but not too sweet like other ice creams. The guy told us that if we didn't like it, he would remake it as well.\n\nTip: New location (coming soon?) in Buena Park, CA!"
        }, 
        {
            "index": 81, 
            "rating": 5, 
            "review": "the owner is so funny and can make anyone laugh. the service is amazing and he gives you discounts and free topings for everything!!! i have never met anyone who has this kind of amazing customer service. all the ice cream is made for you right on the spot and only uses fruit. i wish i could come here everyday!!!!!"
        }, 
        {
            "index": 82, 
            "rating": 5, 
            "review": "Loved their ice cream! I've only been here once and it was delicious.  It's fun to see how they make their ice cream and for the most part the people working here are all nice and personable. \nTwo friends and I went. I got chocolate ice cream with low fat milk and bananas and the guy also gave me free chocolate chips with it so that was great.  It tasted great. I could taste the chocolate and banana well. One friend got green tea, low fat milk, lychee, and mochi... it was soooo good. Much better than the chocolate. My other friend got coffee flavored with fat free milk and hers was delicious too. I've got to say the best one was the green tea.  Will definitely come back here."
        }, 
        {
            "index": 83, 
            "rating": 5, 
            "review": "I must say that Ice Pan has outstanding customer service! On out first time in they walked us through the menu and how to make our ice cream with great enthusiasm and very polite. Some people say that it may be pricy, but if you like good quality food, ice pan is the way to go! Delicious fresh fruits with great choices of flavor. The process is healthy and who doesn't love healthy sugar free ice cream ???"
        }, 
        {
            "index": 84, 
            "rating": 1, 
            "review": "Man...I was hoping to love this place but like another Yelper mentioned, you may get upset stomach after eating here! Please TAKE NOTE of this since it is not advertised until you look at the brochures.\nAnyways, I was in the mood for ice cream on the Strip and found this place with overall positive reviews on Yelp so decided to try! Ice Pan is located on the 2nd floor in Harrah's near the Toby Keith grill right next to the escalator. I was thinking this was similar to a Cold Stone at first but then saw the ice cream was actually made starting from a liquid then formed into a solid with toppings. The mini \"show\" of the staff making the ice cream is cool to watch and there are plenty of different combinations/toppings you could create. \nPrices are a bit steep, there's only one size and each topping is 50 cents. I had the vanilla with soy with oreos and m and m's for around $7. The guy that made it offered to remake a new one in case I didn't like it also. \nNow back to the upset stomach....apparently the ice cream contains some kind of mystery ingredient I've never heard of called \"FOS.\" Its helps to relieve constipation and accelerate the....well, you get the picture. Now obviously this wouldn't be advertised on signs or warned by the staff when you place your order but I seriously had stomach issues a few hours after.  It mentions ONLY IN THE brochure that you may experience these types of issues. Based on my experience after eating here, I wouldn't return. Cool concept, but not worth the 50/50 chance of getting stomach problems afterwards...especially if you are vacationing in Vegas!!! Bummer."
        }, 
        {
            "index": 85, 
            "rating": 4, 
            "review": "\"If there was a problem, yo I'll solve it. Check out the hook while my DJ revolves it.\"\n\n\"ICE ICE PAN BABY!\"\n\nIm surprised Vanilla Ice is not representing them. With that said, I don't think too many know about this place that's located inside Harrah's only about 75 yards away from the parking structure.\n\nThe concept is simple. \n\nYou choose the type of milk whether it is Soy, Whole, Non Fat, or Whole. \n\nType of flavor which is Strawberry, Mango, Banana, Kiwi, Green Tea, Vanilla, Chocolate, Yogurt, Coffee, Lemon, Pistachio, Mint Chocolate, and Red Bean. Seasonal flavors are Watermelon, Pumpkin, and Pomegranate. \n\nThen your toppings from Strawberry, Banana, Kiwi, Mango, chocolate Chip, Blueberry, Walnut, Pineapple, Almond, Granola, Macadamia, Coconut, Marshmallows, Chocolate Syrup, Caramel, Mochi, Lychee, Fruity Pebbles, and Raspberry.\n\nOnce you all items are selected then your designated Ice Pan worker does their magic by mixing everything together in an actual ice pan, The process takes about a minute and the end result is the freshest ice cream you get for it literally just got done being made.\n\nService is excellent. I have gone here enough times that the owner and his wife know me by my face. That's funny because I don't know their names either. Regardless if you are a first timer or veteran he treats you with good customer service and courtesy.\n\nSince you are in a casino on the strip well, you are gonna be subjected to the usual mark up of strip prices. This is where the one star is subtracted because I have yet to find a place on the strip that is 5 star worthy of paying strip prices. Also, the cell reception is non existent in this area unless you wanna pay the ridiculous price they charge you to use the casino wifi.\n\nIn closing, this concept is as unique as you can get with making ice cream from scratch. Definitely come here for dessert after a good lunch or dinner. It will sure hit the spot. Hours are 11 am to 12 midnight everyday.\n\nYelp 2015 review #7\n506 overall"
        }, 
        {
            "index": 86, 
            "rating": 5, 
            "review": "I really enjoyed Ice Pan. A friend recommended it on a trip to Vegas. This is the 2nd place I've been that makes authentically \"fresh' ice cream in front of you. You get a variety of fresh fruit options and milk options to choose from. My friend and I shared a watermelon flavored ice pan ice cream with strawberries mixed in. We watched the guy make our ice cream in front of us. As he pounded away and mixed on his flat ice pan, the ice cream slowly came together. \n\nWATERMELON FLAVOR was a GREAT choice! It wasn't too sweet and it tasted light. The strawberries mixed in was a good choice. My other friends got strawberry ice pan. It was still good, but a little sweeter, so I preferred the watermelon flavor. \n\nThe prices here are pretty standard and reasonable for fresh innovative ice cream. Overall, I'd love to go back here when I'm back in Vegas. The location though isn't the most convenient as it's a little hard to find and tucked somewhere in Harrah's casino. \n\nI definitely recommend trying this place if you want a unique and tasty \"fresh\" ice cream experience."
        }, 
        {
            "index": 87, 
            "rating": 3, 
            "review": "Located inside Harrah's Casino on the 2nd floor.  Seems to be run by Koreans as the cashier is PSY Gangnam Style on caffeine!...so damn hyper (but in a good way).  You first choose a flavor, type of milk, and toppings. Its pretty cool to watch them spank and slap your ice cream into shape on a frozen platter.  \n\nI ordered the green tea flavor, low fat milk, and before I could say what topping I wanted, the cashier finished my order....\"mochi topping? How I know? Becosss, you ashhun and you lub greena tea flabor withee mochi.\" Well hot damn, I guess I fit the stereotype!  He also counts your money and change by multiplying 1,000. So my ice cream total came out to be $7,000 and I gave him a $10,000 bill and got about $3,000 in change. Maybe he likes counting in korean won?\n\nOverall, good tasting ice cream but overpriced for what it was. It touts being completely natural and low on calories....but if I choose to eat ice cream, I'm not really thinking about how healthy it is am I? Kudos for the manager for having an awesome attitude!"
        }, 
        {
            "index": 88, 
            "rating": 4, 
            "review": "Ice Pan is great new ice cream option where you pick the base you want such as whole milk, non-fat, soy etc. Then you pick your flavor and then mix-ins and the counter person makes on the cold pan surface. The regular is 5.95 and each mix-in is .50 extra, They give you chocolate or caramel syrup as a free topping. It is located in Harrah's on the 2nd floor near the Starbuck's counter. I had the strawberry with whole milk it was very good and had a bright fresh taste."
        }, 
        {
            "index": 89, 
            "rating": 5, 
            "review": "Ice Pan is located on the second floor of Harrah's, right by the Monorail. \n\nJust in case you don't know what Ice Pan is, Ice Pan makes freshly made ice cream right before your eyes. You get the choice of fruits and milk. Then they blend and spread the mixture on an \"Ice Pan\", where it freezes into ice cream. It's like MAGIC!\n\nThe owner is also extremely warm and friendly, who is very passionate about his creations. The price is a little more on the steeper side for ice cream, but its definitely worth every penny. You have to remember that you're not paying for some generic bucket ice cream at the market. These are freshly made custom ice cream to your liking. \n\nIf you're in Sin City and you need a place to just chill out. Give this Hidden Gem a try, you won't regret it !"
        }, 
        {
            "index": 90, 
            "rating": 5, 
            "review": "I just happened to come across Ice Pan while wandering around Harrah's  one night.  This is definately a hidden jewel within everything the Vegas strip has to offer.   At first I almost passed it up due to steep starting price of around $6 for a cup of ice cream, but it is worth every penny.  This was the best ice cream I have had anywhere and I ended up returning 3 times in the next week although I transfered to a different hotel.  Customers can choose from a variety of flavors and ingredients to add in and every order is made from scratch with fresh ingredients right in front of your eyes.  Because fresh ingredients are used and customers have their choice of ingredients and type of milk, Ice Pan's ice cream is relatively more nutritious than other ice cream options at only 200 calories a cup.  After 2 minutes of watching your creation come together, the result is a delicous creamy ice cream with the perfect blend of flavor and refreshment.  \n\nNot only does Ice Pan offer great ice cream, but a fun and unique experience.  The two guys who were working here were extremely friendly, energetic, and made sure customers had fun creating their ice cream.  They even remembered me when I returned two days later!  Since Ice Pan is tucked away in a hidden location that one will probably only find if they are going to the Harrah's Las Vegas monorail stop, there was never a long wait.       \n\nThis is the only location of Ice Pan in the United States and will definately be a must on all future trips to Vegas!"
        }, 
        {
            "index": 91, 
            "rating": 2, 
            "review": "It was nothing special. There is a place in NYC that has the same concept. Except they out the ice cream in rolls. When making it, the guy just seemed pissed and angry. The one in NYC puts in a nice lil performance putting the ice cream together. This place lacked finesse which is what a place like this is really about."
        }, 
        {
            "index": 92, 
            "rating": 5, 
            "review": "Great entertainment and great ice cream.\n\nMy wife and I were leaving after a show and started hearing a loud banging sound. We thought someone was getting beat up so we went to see what was going on. Next thing you know we see this Korean guy (owner) making ice cream. This was the most entertaining thing ever since he puts so much effort and you know he cares about his business. \n\nWe caught the tail end of it so I just ordered something so I can see it again. I was a bit disappointed that his wife was the one making the ice cream and not him and it wasn't as entertaining. Luckily another couple that ordered as well and the show began again. After 2-3 minutes of punching, elbowing, and throwing ice cream around they scooped it into a cup. \n\nI came back again just to see him but he wasn't there and was told he works at night.\n\nAlso the ice cream was very good as well."
        }, 
        {
            "index": 93, 
            "rating": 2, 
            "review": "I've been meaning to try this place out for quite some time and finally made the effort to head over to Harrah's. Ice Pan is located not too far from the parking garage entrance when you are heading towards the casino. Directly next to the Starbucks.\n\nYou get to choose what flavor, type of milk and toppings you want in your creation. They mix/blend your cream together then it's poured on this.. well pan hah. (Think crepe pan but very very cold!) Then they start going at it and before you know it, with a little bit of wizardry, you get ice.. cream?\n\nI got green tea with soy milk and mochi on top. Now I enjoyed the making of the concoction but not so much the texture and taste of it. I wasn't too sure what to call it either. Is it ice cream?? The consistency was a little strange for me and the taste wasn't all there either. \n\nBut to each their own, if you've never seen anything like this before, it can't hurt to give it a go!"
        }, 
        {
            "index": 94, 
            "rating": 4, 
            "review": "The staff is very friendly.   You choose your flavor, type of milk, and toppings.\n\nWe ordered chocolate with added cheesecake bites and strawberry with added banana.\n\nThey asked us if we wanted complimentary chocolate chips in the chocolate ice cream and of course we said yes!  The strawberry ice cream came with fresh cut strawberries.  And then you have the option to top it all off with chocolate or caramel syrup.\n\nThey make the ice cream in front of you with all natural and fresh ingredients.  And the tatste is great.   Usually make my way here if I stay at Harrah's.  It averages to about $6 per order."
        }, 
        {
            "index": 95, 
            "rating": 4, 
            "review": "The korean lady was really nice and friendly here.  She said she'd give me free strawberries on top of my ice cream!  yay for free stuff.  i ended up giving them an extra tip for it!\n\nIt's really cool to watch your ice cream turn form from liquid to solid.  Pour liquid and slap the ice cream on a cold circular slab many times....and then it turns to solid!  \n\nI got a regular for $5.95 which includes one topping.  You choose your flavor, type of milk (soy, whole, low fat, non-fat), and toppings.  50 cents for each topping.\n\nI got the strawberry, low-fat milk, with chocolate chips and got free strawberries on top.  I also got chocolate syrup.  Yummy!  It tasted pretty light and not too heavy or super creamy but a little bit icy.\n\nIt is good ice cream, just super expensive for ice cream!  $7 with the tip, for a small!\n\nI was reading the info leaflet about ice pan...and it has a warning that ice pan has some ingredients in the ice cream that is somewhat like a laxative...I was lol at the comment when I read it."
        }, 
        {
            "index": 96, 
            "rating": 4, 
            "review": "Super cool place at Harrah's, just at the top of the escalator by the rest of the food court area. You get to pick your flavor, milk, and toppings and they make your ice cream right in front of you! I was lucky to go at a time when there was no line but a bunch of people came after me and had to wait a while, and there was only one worker. I'd say it took about 8 minutes to make 2 orders, one for myself and one for my friend. Other than that, very cool experience!"
        }, 
        {
            "index": 97, 
            "rating": 4, 
            "review": "It was ok. Nothing teally bad about it and nothing really GREAT about it thats why i gave 4 stars.\nI got the soy milk/green tea/cheesecake flavor. It was super super thick and didnt melt as fast as the milk one. They had a warning on their pamphlet saying that it speeds up your digestive system so you might have loose stools after consuming. i still ate it anyways. Its been 2 days and i still have loose stools. Not sure if it was from the ice cream or the boiling crab. No one else in my party has it so. Maybe its just me."
        }, 
        {
            "index": 98, 
            "rating": 5, 
            "review": "**Summary**\n       - Fresh - They take milk (whole, low fat, nonfat, or soy), your flavor (ie. strawberry), and their own powder (helps it turn into ice cream) and blend them up. They put the blended mix on a -35 degree surface. They mix/smash in your topping as the liquid turns into ice cream.\n       - Taste - Best ice cream I've ever had.\n       - Location - Second floor of Harrah's near the monorail station.\n       - Calories - Calories/sugar for a cup of Haagen Daz strawberry ice is 500 calories/44g. The calories/sugar for the low fat milk strawberry ice cream I had was 280 calories/36g.\n       - Payment - Cash only.\n**Price**\n       - $5.95 for a regular size + 50 cents per topping.\n**Ordered**\n       - Strawberry Ice Cream with Kiwi topping - Best strawberry ice cream I've ever head. They mash up the toppings in like cold stone.\n       - Oreo Ice Cream - You can taste the Oreo filling in the ice cream.\n       - Red Bean Ice Cream with Lychee topping - The Lychee really sweetened up the ice cream.\n**Recommendations**\n       - I'd definitely recommend this place to anyone. The ice cream is delicious and fresh and the price isn't too bad either."
        }, 
        {
            "index": 99, 
            "rating": 4, 
            "review": "Delicious! Ordered a green tea and a strawberry ice cream! Was made super quick and very little waiting!"
        }, 
        {
            "index": 100, 
            "rating": 1, 
            "review": "Cold stone is considerably better in flavor and I just paid $14 for 2 SMALL single scoops of ice cream. The ice cream has a crushed banana sticky consistency and I was hoping for creamy. The service was not good. The 2 people were overworked and stressed. PASS"
        }, 
        {
            "index": 101, 
            "rating": 5, 
            "review": "Very cool concept - choose flavor, choose ingredients (whole milk, % milk, soy), choose toppings. They pour the liquid and ingredients onto an ice pan and, a la Coldstone, create the ice cream for u right there. Super awesome staff - great energy, great service. If you pass through Harrah's, definitely give it a try!"
        }, 
        {
            "index": 102, 
            "rating": 3, 
            "review": "It's ok. The fruit is fresh yes but the mango literally just taste like fruit blended up and forzen. It really depends on who makes your ice cream."
        }, 
        {
            "index": 103, 
            "rating": 5, 
            "review": "Was delicious ,healthy and entertaining .Took my two year to get ice cream and he love the way they make the ice cream in front of you.He loved it and it's a plus that they only use fresh ingredients.Both times I have been there ,I was impressed by the customer service and making sure you love your ice cream or they will not charge you.thats commitment to their work and to this point they have not disappointed .thank you guys ,will come back soon."
        }, 
        {
            "index": 104, 
            "rating": 4, 
            "review": "A little late (!) review, as I went in January this year! But backtracking on some places I haven't reviewed that I went to while in The Vegas. I found this little ditty by looking up cool vegan spots in town. I can't remember exactly what I had, but I remember really enjoying it, as did my girlfriend. The service and the way the put everything together is also fun. Worth a visit!"
        }, 
        {
            "index": 105, 
            "rating": 4, 
            "review": "I like this place! The workers are so happy and friendly.\n\nI got lemon ice cream with mochi. \n\nAnd watching the lady make the ice cream...it's so intense ha!"
        }, 
        {
            "index": 106, 
            "rating": 5, 
            "review": "I ordered the Green Tea Sorbet with whole milk and was able to get some toppings for free. This place is hidden behind the Harrah's casino on the 2nd floor  going towards the monorail."
        }, 
        {
            "index": 107, 
            "rating": 5, 
            "review": "I LOVEEEEE the ice cream here!! The pistachio one is the best!!! I love how you can customize the ice cream down to what kind of milk is used and watching the entire process just makes it even more fun. The only thing I don't like is the price of just a single scoop, but I guess it's all the labor that goes into scraping the ice cream on the pan over and over again. So sad that the only location is in Las Vegas, but more of a reason to go there and eat and play!"
        }, 
        {
            "index": 108, 
            "rating": 5, 
            "review": "Came here after seeing a concert and wanted a sweet fix. The owner is very personable and upbeat - lots of energy. He told us how they are low sugar and all natural ingredients. Got the vanilla with low fat milk and mochi and it was delicious. I recommend going here as the service was amazing and the show of making the ice cream fresh in front of you is great."
        }, 
        {
            "index": 109, 
            "rating": 3, 
            "review": "Since everything in Vegas comes with a show, this little ice cream joint definitely doesn't disappoint in that department. Tucked away on the 2nd floor of Harrah's, it might be a bit hard to find with all the renovation going on, but we just asked around until someone directed us to it. \n\nThe concept itself is quite unique compared to the other ice cream/gelato/froyo places along the strip. First, you choose your ice cream flavor. Then you choose what type of dairy you want mixed in (whole, low fat, non fat, soy milk, or no milk for sorbets) and finally choose your mix-in + toppings. At $5.95 + extra for the toppings, it is a bit steep for 4 little scoops of ice cream, but I suppose you're paying more for the show since you get to see them pour, chop, and slap your ice cream into shape on the anti griddle. \n\nThe owner is very enthusiastic and engaging with all of the customers, but the wait itself was very very long. Even with only 2 people in front of us, we waited over 20mins for our ice cream.. And they even mixed up the toppings, but we didn't bother asking them to change it since that would've taken even longer. As for the ice cream, the consistency seemed a bit off with more like a taffy texture, and not as creamy or flavorful as I was hoping it would be. This place is good to entertain kids, but if you're looking for some quick, creamy ice cream, I'd say go elsewhere."
        }, 
        {
            "index": 110, 
            "rating": 5, 
            "review": "I got mango-mango. It was so good. Sweet but not too sweet. All I can say is yummy and was worth the money!"
        }, 
        {
            "index": 111, 
            "rating": 5, 
            "review": "This place is incredible! You choose exactly how you want your icecream to be, down to the type of milk and the flavor, and they make it from scratch right before your eyes!\n\nWhile in Vegas, I had a hankering for some icecream and my husband and I decided to give this place a try. He ordered pistachio icecream with blueberries. I was impressed to see that the worker actually ground fresh pistachios in a food processor, before creating the flavored cream mixture. Talk about fresh-from-scratch!\n\nI ordered coffee icecream with raspberries. It was delicious and so creamy, even with the nonfat milk!\n\nIf you are in Vegas, this is a must-try! Yes, it is a little pricey, but where else are you going to have an experience like this? It was worth it!"
        }, 
        {
            "index": 112, 
            "rating": 5, 
            "review": "The ice cream is freshly made right in front of you!  Definitely worth it!  We came back 3 days in a row!"
        }, 
        {
            "index": 113, 
            "rating": 5, 
            "review": "Love this place!  I'm definately hooked!  The location is not the greatest for being a local, but if you get valet and take a walk up the escalator (it's by Toby Keith's bar)  definately worth it.  I feel guiltless when having it.  It's definately a better choice than a traditional ice cream place.  My son loves it, and the staff there definately makes him feel special as they are preparing his treat!  Fav is strawberry ice cream with mango and pineapple toppings."
        }, 
        {
            "index": 114, 
            "rating": 4, 
            "review": "Good concept but not amazing.\n\nI think it's great if you like being able to create your one ice cream and also like watching your ice cream being made in front of your eyes.\n\nThere is something a bit off about the flavor though-- the vanilla doesn't really taste like vanilla. The green tea is good though- even with soy milk. Mochi hardened too much though so maybe just ask for them at the end.\n\nIf you're close to Harrahs then go-- but if you're far away then don't bother- it's not that amazing."
        }, 
        {
            "index": 115, 
            "rating": 3, 
            "review": "Solid 3 stars. \nFriendly staff and fun entertainment. Be warned: the wait is long... like 20 min avg wait long. We had 4 guest in front of us and our wait took about 25 min. \n\nThe ice cream is nothing exciting to me. In fact, I thought it wasn't very sweet (which is good) and that the ice cream lacked richness. We got the green tea ice cream mixed with strawberries and mochi. I do enjoyed the freshness of all the ingredients but there isn't anything that stands out.\n\nWhile you wait, might I recommend grabbing a table if you can and sit facing the walkway. The casino and restaurant nearby draws the most interesting crowd. It was so fun watching the people dressed up in their hot gears wandering around. That made the wait worthwhile in itself for me!"
        }, 
        {
            "index": 116, 
            "rating": 4, 
            "review": "Very good!  Loved the red bean flavor... Can never find it.  We tried \nWhole milk\nRed bean flavor \nAdded lychee, walnuts and mochi to it.  \nFor 8.50 seems like a lot,  but it's fresh and individually made.  And enough for 2 people( if one person likes ice cream a little less than the other:))"
        }, 
        {
            "index": 117, 
            "rating": 4, 
            "review": "This was really delicious! While the price might be a bit ridiculous if you get a topping mixed in and a waffle cone to boot (probably about 8$ with tax), it was very good to say the least. It was also bizarrely entertaining to watch the woman slap and slam the ice cream on the metal surface she was working on. It was nice to be able to make a choice of which type of milk to use. I thought the reduced fat milk worked really well. I did not feel overly full at all after eating it like I do sometimes after ice cream. \n\nThe biggest problem here is the amount of time it takes to have your ice cream made. It may take somewhere in the neighborhood of five minutes. So the person I was with (who eats a bit on the faster side) was almost done by the time mine was ready. I am not sure how well this concept would work if there were 4-5 people in a group wanting this product and only one person was working as was the case for us. The idea and concept are solid but not sure the model is."
        }, 
        {
            "index": 118, 
            "rating": 3, 
            "review": "Concept is pretty cool as long as you're willing to wait several minutes to get your treat. Pick a flavor and maybe some toppings and watch your ice cream be made right in front of your eyes. I ordered strawberry ice cream with cheesecake bites! Pretty good. The ice cream had very creamy texture and who can go wrong with strawberry and cheesecake? I would say it's overpriced though. However, you're already in Vegas so why not splurge a little right?If I had the choice, though, I would go to my local Rite-Aid and get a scoop for just $1.69 instead."
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "Just dropped by at 11PM and it was crazyyyy delicious. Let me just note that it's not your typical ice cream. It tastes slightly slimy, which was totally fine with me (my dad thought it was weird though). I got one of Mango and one of Green tea. They used fresh mangos to make the ice pan (I saw it with my own eyes!!) And the service was great. \n\nIt was slightly expensive for two scoops of ice pan but the experience makes up for it, you should definitely try because I've been looking out and about for a place that makes ice cream this way. Nice job!~"
        }, 
        {
            "index": 120, 
            "rating": 5, 
            "review": "Ice Pan is not just an ice cream shop, it's an EXPERIENCE!\n\nCame here as I was staying at Harrah's and wanted to check out their ice cream.  Was provided with plenty of information on how the process goes, and the employee was very nice in explaining everything to me.  Once I made my choices, he went ahead and did his thang!  Put everything on the counter thingy, and started chopping and mixing, and flipping.  Powder, and liquid soon turned into ice cream!  And if the nutrition facts are accurate, this stuff is 1/9 of the calories of regular ice cream and I chose Whole Milk!  \n\nThe owner then came out and started telling me all this stuff about it.  Very nice guy, and also very energetic.  That's how you know he believes in his store and product.  \n\nCheck it out when you can!"
        }, 
        {
            "index": 121, 
            "rating": 5, 
            "review": "Was on my way to try oyster bar in Harrah's and stopped by icepan. Friendly staff and great tasting ice cream that's freshly made. Definitely worth checking out. I'd recommend creamy flavor rather than fruity."
        }, 
        {
            "index": 122, 
            "rating": 5, 
            "review": "Most definitely innovative but also very delicious. The older gentleman is enthusiastic and super nice. Will be back! Worth a try!"
        }, 
        {
            "index": 123, 
            "rating": 5, 
            "review": "Great service wonderful tasteful ice cream! I am so impressed on how they interacted with my kids. Most definitely coming back before I leave Vegas."
        }, 
        {
            "index": 124, 
            "rating": 5, 
            "review": "Such a interesting and different way to make ice cream! It's a healthier alternitive to ice cream. They make it right infront of you and the ingredients freeze on the \"ice pan\" as they mix the flavors and toppings you chose together. \n\nI ordered green tea with soy milk with blueberries, almonds and mochi. My friend got green tea with soy milk with blueberries, lychee and mochi. And my other friend got red bean with soy milk with oreos, lychee and mochi. \n\nIt was sooooo good that we went back literally 10 minutes after killing our first ones and got another one to share......\n\nI heard there used to be a location in Hollywood, but they closed down!!! Sighhhhhh so sad ... I would have gone probably every day if that location was still open. Oh well."
        }, 
        {
            "index": 125, 
            "rating": 3, 
            "review": "The fresh made ice cream is good but a bit to expensive tried pineapple and kiwi both good but they do have ice pops that's are great and only 1$ try as many as you can those are worth it I recommend the fruit flavored ones peach and watermelon are great                                       It's ok ! I might return."
        }, 
        {
            "index": 126, 
            "rating": 5, 
            "review": "Yummy! It's set up like cold stone, but the flavors are fruiter, better and healthier. The staff and owner are super friendly with our whole family. It's obvious they love their customers and they love what they do. I was very impressed with cleanliness, service and flavor! We'll be back for the recommended Pomegranate."
        }, 
        {
            "index": 127, 
            "rating": 4, 
            "review": "Damn unique way to experience ice cream. I'm a big fan now. The flavors just taste so pure. Have to get this every time I'm in the area. It's also very easy to get to from the self park. Makes it a no brainer."
        }, 
        {
            "index": 128, 
            "rating": 5, 
            "review": "Amazing little gem in Harrah's. I'm an ice cream fanatic and it doesn't get any better than freshly made, preservative free ice cream. I had mango soy ice cream with mangos and strawberries. The staff is so friendly and helpful. I did feel a little rushed during the process even though we were the only ones there but overall it was great and the staff really cares about the customers.  A must try for anyone in the area!"
        }, 
        {
            "index": 129, 
            "rating": 5, 
            "review": "I visit Vegas at least six times a year for work and stay the weekend, and this place is a must visit at least once (sometimes twice) on weekends EVERY visit.\n\nThis is in the concourse leading into Harrah's/Quad from the Monorail and discovered it a few years ago walking into Harrah's from the monorail, and noticed they had soy milk as a milk choice and I love Lychees and I have never seen them offered at an ince cream place before and noticed they were a mixin choice and decided to give them a try and have been hooked since.\n\nIt's like a reverse wok where they put in the ingrediants and they mix it really fast with a spatula and it freezes.   They have a lot of base flavors to chose from, a couple milk choices such as 2% and soy, and then you chose your mixins and they throw it in the \"wok\" and you have ice cream a couple minutes later.\n\nAs others have mentioned it is a little expense, but well worth it.   It is much better than anything you would get at a place like BR, and the price is cheaper than the Gelato place in Ceasars and it's healthier.  \n\nThe man who runs it it is very nice and is really funny.   I normally use the monorail to get around Vegas and usually get off at the Harrahs stop and even if I am not eating there and just walking past to get into Harrah's he will shout out and say hi if he sees me.   The one lady, Angela, who is usually there as well, always remembers me and is always making recomendations that are good.\n\nThey do not take credit cards however."
        }, 
        {
            "index": 130, 
            "rating": 5, 
            "review": "Yeah yeah yeah it's $5.95 for four small scoops of ice cream. Wait a minute it's not JUST ice cream! It's not something that was made two or three months ago and sitting around waiting to get eaten. It's made right in front of you! \nFirst you choose your flavor (strawberry for me). Then you choose your dairy: non fat, low fat, whole or soy milk. Soy for me. Then you choose your toppings. fresh strawberries and mochi balls.\nThey mix the strawberry liquid and soymilk together then put it on this cold metal thing. It starts to freeze and they keep mixing it til its ready for the toppings. They kind of chop and mix it into the ice cream, not really \"toppings\".\nWhen its ready they scoop it into a  cup or cone whatever you want.\nReally good, cross between ice cream and frozen yogurt."
        }, 
        {
            "index": 131, 
            "rating": 4, 
            "review": "Ice Pan definitely is worth it. The owner and his staff are very friendly and cool people trying to make you laugh and enjoy it. Want to see you ice cream made in front of you..? Go here. \n\nThe actual ice cream was really good. They had a good variety of flavors and toppings to choose from, and you could tell the ingredients were fresh. The quality of the ice cream was on point. \n\nPrice reflects the gimmick of having the ice cream made in front of you but it is worth it. And I would rather go here than Cold Stone anyday."
        }, 
        {
            "index": 132, 
            "rating": 5, 
            "review": "Yummy!! This is probably the best green tea ice cream I've ever had! It's pretty amazing to see them make it right before your eyes in only about a minute. It was kind of hard to find, but I'm glad I got to try it. :)"
        }, 
        {
            "index": 133, 
            "rating": 3, 
            "review": "Definitely unique, but for $5.95 for a scoop and a half of ice cream it's on the pricey side. There are a ton of other ice cream, sorbet and gelato places all around the area. They need to step up their game in some way if they want to get more customers.\n\nTaste-wise the mint chocolate chip and mango ice creams that we got were good. Creamy, but oddly, not very cold. \n\nGo if you'd like to see some entertaining scraping and slapping with spatulas on an \"ice pan\"."
        }, 
        {
            "index": 134, 
            "rating": 4, 
            "review": "A pretty interesting concept -- fresh, handmade ice cream right before your eyes! \n\n\nSTEPS TO MAKING YOUR ICE CREAM:\n\n1.) Choose your ice cream base flavor.\n2.) Choose your dairy (whole, low-fat, non-fat, or soy milk). \n3.) Choose your mix-in/toppings. \n\nI was on the escalator on my way to the monorail when I noticed this little ice cream spot and saw the staff pounding ice cream on a metal pan. After 15 minutes of contemplating if I had any more room\nin my stomach after a big lunch (who am I kidding?! There's always room for ice cream!) my boyfriend and I decided to try the soy milk watermelon ice cream with mangos and raspberries. Sounds weird I know, but it actually tasted pretty good and seemed much healthier then regular ice cream. Not to mention there's always something always intriguing about seeing food being made fresh before your eyes."
        }, 
        {
            "index": 135, 
            "rating": 5, 
            "review": "This place definitely lived uo to its reputation. The ice cream is like icecream & sorbet together but doesnt melt fast and has this harder texture. I love love the ice cream here! I got mango with mango chunks.  They make it on the pan and its a pretty fast service. It is kinda pricey for icecream but definitely worth it. Definitely would recommend going here. But signs to the ice cream place is kinda lacking in the hotel. Its on the second floor next to toby keiths bar. A definite visit in vegas!"
        }, 
        {
            "index": 136, 
            "rating": 5, 
            "review": "This is a must MUST see when you are in Vegas. Some fancy new technology magically turns liquid into frozen/creamy ice cream in less than 1 minute.  It is Korean own and the ice cream makers are so cute and funny. Unfortunately, being located at Harrah's does not give it justice.  The modern/stylish look and unique idea definitely belongs somewhere else.  \n\nI ordered the Green Tea ice cream with Soy milk and Lychee. A little pricey at $7 for a small cup of freshly made ice cream. But totally worth it!\n\nPick your ingredients and watch liquid turn into ice cream goodness!"
        }, 
        {
            "index": 137, 
            "rating": 2, 
            "review": "I was super disappointed with Ice Pan.\n\nI'm not at all clear why everyone thinks this is good ice cream.  It isn't.  Mine was a thick combination of guar gum (thickening agent, or something like guar gum) and milk that ultimately failed the texture test.  If you like your dessert  thick and gooy, this may be a good place to visit.  If you like your ice cream pure and true to real ice cream making standards, you may want to skip this place.  \n\nWhile they do have a good selection of toppings and flavors, the toppings hide the quality of the frozen treat underneath.   \n\nOne star for the ice cream/topping selection, one star for the preparation - which is entertaining to watch once."
        }, 
        {
            "index": 138, 
            "rating": 5, 
            "review": "I got stabbed here. Ice cream was on point but I got stabbed here. Would definitely consider coming back! \n\nHands down best customer service. Every business should have a cashier/front man with the kind of hilarious enthusiasm and energy that the lead guy has."
        }, 
        {
            "index": 139, 
            "rating": 4, 
            "review": "So I LOVED my Ice Pan experience (both watching them make it and the delicious product of their work) - it was a spontaneous find and I was so entranced by Andy's personality that I ordered before even checking it out on Yelp (crazy! do not attempt under most circumstances!).\n\nI had such a great time, I had to see \"so what could anybody have dinged these guys for to make them 4.5 stars on Yelp?\"\n\nI saw the 1 star review from Miss H.K. about the organic ingredient that \"may cause upset stomach.\" \"Interesting,\" I thought, and moved on...\n\ndot\n\n\ndot\n\n\n\ndot\n\n\nFast forward a couple hours. Finished a team dinner in Harrah's (yes, I had ice cream right before dinner - I'm an adult and I can do that now) and was wandering back through the Venetian when *BAM* cold sweats kick in. I had to meander through those cursed canal shoppes (adding the 'pe' doesn't actually make it classy, Vegas....) to find a bathroom with some QUICKNESS. (Not that you care but I turned out fine, though it was a fairly uncomfortable night)\n\nNow, how do I not lower my rating to 1-2 stars after that experience? Here's how:\n\n1) In spite of the discomfort, it was still DANG good ice cream and an awesomely unique experience.\n2) There was some funkiness going on with the lunch I had that day and, who knows, maybe I ate something then or at dinner that's the actual culprit - I can't say for sure it was the Ice Pan\n3) I recommended the place to a number of coworkers who all ate it, loved it, and had no negative effects\n\nSo, in spite of the *possibility* of it giving me a Central-American-class punch in the gut, Ice Pan's still an amazingly delicious and entertaining gig in the heart of Sin City."
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "As stated in other reviews, customer service was what made this place stand out. Andy was awesome! I think he was the owner. He even offered us green tea popsicles! I definitely recommend using low fat milk instead of whole milk. Oh and if you're in the LA area...good news! They plan on opening one up in ktown!"
        }, 
        {
            "index": 141, 
            "rating": 5, 
            "review": "LOOOOOOOOOVE. (:\n\nI actually like the ice cream here without the toppings.  Kind of screws with the texture if they over-mix it.\n\nAnyway, this place is bomb and the workers are always really sweet.  They gave my mom a HUGE one when they found out it was her birthday, put in a ton of crazy toppings and what not... Pretty intense.\n\nDeliciously intense.\n\nMy fave: chocolate w/ soy milk, no toppings."
        }, 
        {
            "index": 142, 
            "rating": 5, 
            "review": "Super cool place.  They use an anti-griddle to instantly make any flavor ice cream you desire.  We had the following:\n\nGreen tea ice cream made with low fat milk and lychees in a waffle bowl\nMango ice cream made with low fat milk with fresh pineapple and mango.\n\nBoth were excellent. A little pricey, but worth it since they customize it and everything is natural and fresh!\n\nFYI - Ice Pan excepts cash, or (if you have enough) you can redeem your Total Rewards credits as payment."
        }, 
        {
            "index": 143, 
            "rating": 5, 
            "review": "We ordered a pomegranate ice cream with low fat milk infused with blueberries and mango on top. The cashier was a sweet lady who was describing the whole process of how the ice cream was made.\n\nIt was really neat to watch them make it out of scratch in their -35 degree ice pan thing. (Hence the name). Absolutely delicious! I would definitely come back here again to try other flavors. They should expand to LA if they haven't already! Thank you!!!"
        }, 
        {
            "index": 144, 
            "rating": 2, 
            "review": "With great reviews from my Yelp friends and insistent recommendations to try this place when I'm in town, I decided to finally try it. Sure, why not? \n\nUh the hassle of ordering does NOT outweigh the product. There's friendly service then there's the forceful \"let me upsell you with everything you could possibly not want on your ice cream\" service. \n\nI'm not even sure if I wanna give them a two stars for the product I received.\n\nPS. If you like \"natural laxatives with your ice cream, this is the place to be ;)"
        }, 
        {
            "index": 145, 
            "rating": 5, 
            "review": "I'm a big fan of all things soy!\n\nIf only this place wasn't located all the way in Harrah's!!! Oh well.. that didn't stop me from getting a taxi here. I yelped Vegas bites before my trip and this little gem popped up! After going up the escalators, it's located right around the corner- a cute open ice cream area with a couple tables. \n\nAs I was deciding what to order, I felt so giddy inside knowing that I can eat my sweet treat without worrying about rumblies in my tumbly. This was my first time being able to choose how my ice cream was made! How cool is it that you can choose what goes into your ice cream as well as watch it be made before your eyes??! I chose the red bean ice cream, soy milk, and lychee as the fruit topping. The workers happily took my order and rang me up for about 5 bucks (for a cup of ice cream it's pretty pricey but you're paying for the work and quality). The science in this is amazing. The flavored red bean and soymilk was poured onto this nitrogen cooled plate and magically before my eyes, the goddess of a worker created this icey consistency of the mixture- slapping and scraping scraping scraping until it solidified a bit. Once that was done, she dropped a couple of lychees atop and chopped them into the mixture. Slapping, scraping, mixing, my creation was finally done right before my eyes. I savored each creamy bite. SUPER CREAMY, as a matter of fact! I was a happy camper.  I enjoyed this new experience, greeted by the cutest workers, right within sin city, and came out with something healthy, sweet, and ice creamy- i felt like i walked on a mini cloud above the devil's playground- if that made any sense. As good as it gets for me!"
        }, 
        {
            "index": 146, 
            "rating": 5, 
            "review": "Definitely a must if u r in Vegas! Great, innovative ice cream and the older gentleman was awesome. U can tell he loves his job."
        }, 
        {
            "index": 147, 
            "rating": 5, 
            "review": "This is my favorite ice cream spot!! A bit of a hassle to get to but worth every bit. Ordered a green tea with soy milk plus cheesecake bites (I think a green tea cheesecake would taste like this) and a banana with soy. Guilt free indulgence. It's Teppanyaki ice cream!! They scrape, chop, stir, slap the mixture on a pan till it looks like ice cream. Wonderful customer service, the guy (owner?) behind the counter really cares about your ice cream experience ~"
        }, 
        {
            "index": 148, 
            "rating": 4, 
            "review": "Fun to watch them make any flavor combos from one of four types of milk. My only complaint is it is very expensive. $5.95 milk with flavor and .50 per mixin. Four kids 29.00 - and i didnt get one!  but it is sort of entertainment watching them make them. Taste is really good."
        }, 
        {
            "index": 149, 
            "rating": 5, 
            "review": "Ice Pan rocks!  I remember seeing this place being built and was very curious about it because it advertised them as making Ice Cream from scratch.  Then I checked online and saw the video how they made it (http://www.youtube.com/watch?v=mcXOROJjSgo&feature=player_embedded).  It was impressive and I couldn't wait to try them the next time I would stop by.\n\nThey're located on the 2nd floor of Harrah's next to the Starbucks.  Nice location since they get a lot of foot traffic for people coming to and from the Monorail and those needing some dessert after getting a bite at Toby Keith's.  I really couldn't decide what to order because they have so many different combinations.  But I ended up going for the Mango Ice Cream with Soy Milk with Pineapples mixed in.  I loved the energy they put in to making the ice cream (http://www.yelp.com/user_local_photos?userid=F_5_UNX-wrAFCXuAkBZRDw&select=AMSH3KItrpDss6_jJhoL2w).  It was almost like watching a Teppanyaki chef at Benihana.  After just 1 minute, my Ice Pan Specialist finished my ice cream and it was beautiful (http://www.yelp.com/user_local_photos?userid=F_5_UNX-wrAFCXuAkBZRDw&select=X6gi_mtAxBb2LAFcIaDyFw).  I didn't opt for the chocolate syrup because I didn't want it to interfere with the natrual fruit flavors, but maybe next time.  It was so good!!!  I was able to really taste natural flavors of the mango and pineapples.  The price may seem a little steep at $6.95, but you're paying for a nice one minute show of them preparing ice cream from scratch with fresh ingredients.  It's worth it!\n\nUPDATE 11/28/2010: Found an updated video from the Harrah's location here:\n(http://www.youtube.com/watch?v=BVb8BUtrCeg)\nIt's Awesome!!!"
        }, 
        {
            "index": 150, 
            "rating": 4, 
            "review": "Love the energy of the workers here.  Super friendly, funny and entertaining.  Prices are pretty steep for ice cream but you get to customize the ice cream.  It's also fun to see your ice cream getting made versus the nitrous ice cream.  \n\nThere's plenty of combinations to do.  I went with chocolate and oreos.  There wasn't that much option was made the ice cream creamy."
        }, 
        {
            "index": 151, 
            "rating": 5, 
            "review": "Ice Pan, please come to Boston. You are the most unique and original food concept I have encountered in a long time and you will fit right at home with the hippie locavorian scene of the East Coast. Seriously, we will make you our king.\n\nPlease get out of stinky, stuffy, cigarette-filled Harrah's and come to New England so I can enjoy your banana coconut with mochi and strawberry with cheesecake and mochi ice-cream in a clean, breathable environment. I know you don't want to be there either, so we will join hands, sing \"Kumbaya\" and allow Jesus to work his mojo to magically transport you to Beantown."
        }, 
        {
            "index": 152, 
            "rating": 5, 
            "review": "This place is amazing. The staff is very friendly. They make ice cream right in front of you with whatever Addons you'd like. The ice cream is out of this world. Youll thank me later. Just go and enjoy."
        }, 
        {
            "index": 153, 
            "rating": 2, 
            "review": "Underwhelming.  My mint chip ice cream did not taste smooth and creamy, I guess because it is made with whole milk, not cream.  I paid extra for Whipped Cream on top, and got something labeled \"Whipped Topping\" out of an aerosol can, like Redi-whip, but not real whipped cream.  Really?  Their signage goes on and on about natural and healthy, but I guess that doesn't apply to the fake Whipped 'Cream'.\n\nSomeone else in my family got the banana ice cream with strawberry mixed in.  It did have a nice hearty fresh banana flavor, but still did not taste rich and creamy like traditional high quality ice cream.\n\nI felt portions were rather small for the $5.95 price + extra for mix-ins.  No option for a larger size.  Staff was not overly friendly, rather indifferent.  Hey, this is Vegas, and I want to indulge!  Won't go out of my way for this place again.\n\nMy all-time favorite ice cream spot is Superior Dairy in the little Central Valley town of Hanford, CA."
        }, 
        {
            "index": 154, 
            "rating": 5, 
            "review": "One of my favorite  places to enjoy homemade vegan ice cream.. Made before your eyes with lots of fresh toppings... I love creating mint chip with soy milk and walnuts topped with fresh raspberries .The owner and his wife both have the best personality. We are always greeted with a huge smile and high five.... A must for anyone looking for a delicious vegan dessert option in Las Vegas!"
        }, 
        {
            "index": 155, 
            "rating": 2, 
            "review": "That's a scam -.- ice cream was tasteless,I felt like I am eating ice with fruits lol. I like the idea of it that they make the ice cream from the scratch but I wish it was tasty. They offer you three kind of milk like whole milk , low fat and no fat +toppings  . Thanks God I choose whole one lol. Imagine if I got low fat one and how it would taste. Service  was good. I don't think that I will come here again."
        }, 
        {
            "index": 156, 
            "rating": 5, 
            "review": "It's UNIQUE and DIFFERENT!!!!!\nThe only minor issue is the location - a bit hard to find but definitely worth searching for.\nThe ice cream is super healthy and fresh. The method is fun to watch unlike anything I've ever seen. The ice cream is tasty and ALL NATURAL. The owner is super friendly and very tentative to his customer. As a matter of fact if you really want to know what  a true \"Customer Service\" is all about go and visit him."
        }, 
        {
            "index": 157, 
            "rating": 5, 
            "review": "Oh how cruel is fate to once again give me a place to love but tno where to get it again. We stumbled upon this place while leaving the monorail. A nice size sign said green grape ice cream. HUH?!one of the friends was like no way and the other was like yes like me. We wondered around and came back. The owner was there and super friendly. We ordered one to share the white grape with pineapple and low fat milk. Blend, pour, scrape, mix, and repeat excluding the blend and pour. We are given our order with words \"if you don't like it let me know and I'll make you something else.\" First bite is smooth creamy and sweet. Mouth does happy dance. he one in our group was even pleasantly surprised with how good it was. The owner took our trash and invited us to come back. We told him we would. As far as the price it is about the same as other places that do mixed ice cream. We had our farewell icream yesterday before we left. The owner said that they will be looking to come to Texas and we assured him we would be looking forward to their arrival. One of the highlights of trip."
        }, 
        {
            "index": 158, 
            "rating": 5, 
            "review": "This place is frikking amazing. Absolutely fresh, made on the spot, customized to however you want. The guy behind the counter is super nice, and let my friend go behind the counter to attempt at making her own ice-cream. I believe it can be made vegan as well. It takes time to make each one, and a lot of strength [just look at how they slap it down! - definitely harder than it looks according to my friend who went behind the counter] so if there's a line, expect some wait. It Is Worth It. Will definitely go back."
        }, 
        {
            "index": 159, 
            "rating": 5, 
            "review": "ICEPAN is the best ice cream place I have ever been at! It's so delicious that when I order something and finish it, I want to devour more! Any combination of ice cream flavors, milk, and toppings you choose are heaven in your mouth. I live in California, and I'm always craving for ICEPAN. \n\nYou guys should try ICEPAN. It is located on the second floor of the Harrah's Casino."
        }, 
        {
            "index": 160, 
            "rating": 5, 
            "review": "So this review is long overdue, but this place is definitely interesting. Apparently only 2 place in the US (according to the worker) exists that makes ice cream from scratch on a pan.\n\nBasically they make fresh ice cream from milk/soy base and cool in on a ice pan, hence the name Ice Pan. The owner/worker was super friendly and enthusiastic about the product, explaining how it is a healthy alternative to regular ice cream. I like the fact that they can make it with soy milk, which is great for lactose intolerant folks. Anyways, it tasted good and I definitely recommend it others. A+ for customer service!"
        }, 
        {
            "index": 161, 
            "rating": 4, 
            "review": "My little sis was craving ice cream after the day club, so we yelped up places. This was the closest, and since we were on foot, we decided to go here. Btw, Ice pan is located in harrah's!\n\nI've seen videos of people making ice cream using the same concept as they do at ice pan, but they were in Asia, so when I got to this place, I was ecstatic. They make the ice cream right there for you. There's three steps to their process. You get to choose what type of milk you want to use ( there's a soy milk option). Second step is what flavor, and then you can add toppings. \n\nMy little sis and I chose coffee flavor with fresh strawberries. The guy who helped us was super nice and hooked it up. When he handed us the ice cream after he was done making it, we were anxious to try it. However, we took a bite and realized that we chose a bad combination. The taste eventually grew on me though. I'll come back again when I visit Vegas and choose a better combo next time"
        }, 
        {
            "index": 162, 
            "rating": 5, 
            "review": "Healthy Ice Cream?? More Please! \n\nBeing well over a 100 degrees outside we just had to make a stop at Harrah's Las Vegas Casino. Parking is free and Ice Pan is located before you enter the Casino from the self parking structure. \n\nIf there's a line, don't worry because it's quite entertaining and interesting watching them make the frozen treats, everything is made to order. They can do ice cream or yogurt, so many options the you can choose from. It's up to you if you feel like making it healthy, regardless, it's delicious.\n\nI chose to do a Vanilla, Soy milk with Strawberries and mochi. Watching them work my order in one of the three frozen pans reminded me of a Chef at a Teppanyaki Eatery, skillfully working their magic. \n\nCustomer satisfaction is very important to them, so don't be surprised if they ask you if you would like an additional topping when there making your order, it's no charge. Also if you don't like the choices you made after you take a bite of your masterpiece, they'll make you a new one at no charge! \n\nGreat friendly customer service!"
        }, 
        {
            "index": 163, 
            "rating": 5, 
            "review": "This family-owned hidden ice-creamery is a must stop in Vegas. In fact, it's a must-regular stop! They make the ice cream from scratch with NO ADDED SUGAR! You choose the base ice cream flavor, type of milk - whole, low fat, and soy, and toppings. However many you want. OMG, what a divine concept - FRESH, HEALTHY, and well, they put a lotta LOVE into it when they make it right before you eyes! No fancy industrial get-ups. I had the green tea, low-fat milk one with mochi (which are pounded rice cakes). Yum! They used actual green tea powder -- the real stuff! Located in Harrah's Casino on the strip, their hours are pretty extensive.  Please go check it out!"
        }, 
        {
            "index": 164, 
            "rating": 5, 
            "review": "Freshest ice cream I've ever had! Made from scratch in front of you! We had strawberry mango! Awesome!"
        }, 
        {
            "index": 165, 
            "rating": 3, 
            "review": "Ice Pan is an interesting take on an already saturated chilled dessert market. The iced cream is made right in front of you with subtle variations on your classic flavors. This establishment is indeed somewhat pricey, but if you compare it to every other place on the strip, it is a perfectly acceptable amount to pay for a dessert.\n\nThe taste is nothing phenomenal, but they way they prepare it kinda is. the ice cream is made right in front of you as they turn milk and fruit into customized ice cream. The cream is poured onto this chilled pan / wok and freezes almost instantly. The ice cream masters then proceed to stir, scrape, slap, and slice the ice cream using knife-like spatulas with such speed and precision that you'd think you were watching a Benihana chef in action. Seriously, if they brought a knife to a gun fight, they would still have a chance at coming out on top.\n\nAs for eating the ice cream, the taste was a little light, which is kinda nice after a heavy Las Vegas meal, but deep down, I was kinda hoping for a little more umph from the flavor. Depending on who you get to prepare it, the consistency can be super creamy or hard and dense. If you get a more senior preparer, the cream comes out very smooth and can be almost gelato-like. If your preparer is the young one who has yet to master the tricks of the trade, the cream may be left on the ice pan a bit too long and freeze a little harder than it probably should.\n\nWith both ups and downs to this eatery, I think the Yelp rating system hit this one right on the mark, it is A-OK."
        }, 
        {
            "index": 166, 
            "rating": 5, 
            "review": "I'm vegan so that is the why I decided to try this place. They have soy and dairy options, they make the ice cream in front of you . They use all fresh ingredients, and it's delicious . Not crazy expensive also for being on the strip. A must try for vegans and non vegans !"
        }, 
        {
            "index": 167, 
            "rating": 5, 
            "review": "I've never felt so welcomed at an ice cream joint before. Not only is the staff friendly.. They broke everything down to the T since we were first time customers. It's also nice to know the actual ingredients you're indulging in! Will definitely be back."
        }, 
        {
            "index": 168, 
            "rating": 5, 
            "review": "Originally from Japan, it's the more natural version of sorbet/ice cream depending on what flavor you get.  Watermelon (current seasonal flavor) was quite yummy, but only offered for a limited time.  Future seasonal flavors include pumpkin for the fall and pomegranate for the winter.  We got strawberry with strawberries, green tea with mochi, and watermelon with strawberries and raspberries- all were delish and naturally sweet.  Definitely a must try if you are in town!"
        }, 
        {
            "index": 169, 
            "rating": 5, 
            "review": "The ice cream here tastes fresh and to see how it's made makes it much more enjoyable! The ice cream is not too sweet, the fruits you choose is what makes it takes fresh. I'm an ice cream lover & I definitely would go back whenever I have the chance! The owner is very friendly to his customers and even tries to remember them too! It's a very unique place and there aren't many ice cream places like these around! \n\n-Strawberry & mango combination \n-White grape: unique"
        }, 
        {
            "index": 170, 
            "rating": 5, 
            "review": "It was 100 degrees outside and we were already half baked. We found this nice little ice cream shop inside Harrah's. It has a banner saying its first priority is to provide healthier lifestyle, which sounds ironic for an ice cream parlor, but you'll get the point later. \n\nYou know how there is always various flavor selections in glass display at most ice cream place, prompting you to make the most difficult decision of your life? Well, there isn't any here. This is because they mix everything after you order. How it goes is, you select the ice cream base, then select the milk type and finally the toppings. \n\nAfter some serious pondering, I eventually went with red bean ice cream with soy milk, then mochi and pecans as toppings. The guy started mixing everything up which showed they tried to make things as fresh as possible. The stuff slowly taking shape and while I was busy being mesmerized, it was done! The end result is few scoops of delicious ice cream that is not overpoweringly sweet. So in a way, this is healthier then usual ice cream. We absolutely love it! The chewy mochi and crunchy pecans give an interesting texture combination with every bite, I am proud of myself for choosing those lol. \n\nI would totally come here again when I feel burnt and err.. want something healthy."
        }, 
        {
            "index": 171, 
            "rating": 4, 
            "review": "I love the idea of this place, especially since it strives to offer healthier dessert options and gives you a lot of choices. It's really hard to get used to the flavor though. Certain flavors taste better than others - i.e. strawberry tastes more like a sorbet. My taste buds are too accustomed to the creaminess of ice cream and can really tell the difference - so I have a hard time liking the flavor. People shouldn't call it ice cream because that would be misleading, it's more of an in between of the asian shaved ice that's only slightly creamy. I've tried the coffee, green tea, mint chip, and strawberry so far because I really wanted to like it - I'll give this place 4 stars instead of 3 because I want to support what they're doing and the flavors just might not be for me."
        }, 
        {
            "index": 172, 
            "rating": 5, 
            "review": "This place is SO COOOL!! On the second floor of Harrah's Hotel & Casino there's only three steps: 1. Choose the flavor of the cream, 2. Choose the type of milk (whole, non fat, low fat, soy, etc), 3. Choose toppings!\n\nI got the Chocolate flavored non fat cream with Bananas and Oreos. I feel like you can really taste the banana when they make the ice cream or any type of fruit topping is better than a dry topping. It's 50 cents more for an extra topping! The ice cream isn't as creamy as I like it to be, but I bumped this review up for the experience. \n\nThis place is pretty darn expensive but it's definitely worth a try if you haven't been there. The way they make the ice cream is so cool and it's supposed to be healthier.. But definitely a hidden gem in Vegas"
        }, 
        {
            "index": 173, 
            "rating": 4, 
            "review": "The whole making the ice cream on order is not a gimmick!  It allows you to taste some of the freshest ice cream you will ever experience and the difference is undeniable.  I only wish I got more value for the price but ofcourse this is Vegas."
        }, 
        {
            "index": 174, 
            "rating": 5, 
            "review": "Healthy\nTasty\nGreat Customer Service.\n\nWon't go anywhere else for amazing ice cream after you try this place"
        }, 
        {
            "index": 175, 
            "rating": 5, 
            "review": "Purely excellent service. Now that is how you get loyal and regular customers who are committed to coming every single day they can. \nEasily one of the best services At any type of cafe/restaurant/etc. \nI honestly was simply amazed by the happiness and passion they had for an ice cream job LOL..seriously. An ice cream job they must seriously love their job. This is what brings crowds\nNOW.\nTHE PRICE. Was of course high being on the strip but the service doe. 6$ for something you could get for 1$ at a rite aid but this is entertainment, amazing service, and great and health ice cream. Is it worth the 6$? Well if you ask me yes. CMON! ITS VEGAS! A PLACE WHERE I DONT FIND LOTS OF GOOD SERVICE BUT. THIS. IS AWESOME!!!\nNow enough praise about the service \nFOOD- I got whole milk vanilla and strawberry..  Totaling to 13$ I was like whoa. But then you get the entertainment of making the ice cream ;3 very unique..it brought a huge crowd and the ice cream wasn't bad and it tasted healthy :3 especially the strawberry it's a sorbet..I'm gonna try green tea and see how it goes :)\n\nUPDATE* Absolutely delicious soy milk green tea RECOMMENDED. Tasted much better then vanilla and strawberry in my opinion. IF YOU GET GREEN TEA SOY MILK YOU MUST GET MOCHI TOPPINGS!! 100% recommended\n\nTIP!!! LOCATION!! (PERTAINS TO YOU ONLY IF YOUR STAYING AT HARRAHS CARNIVAL TOWER)\n1. Head to carnival tower elevator (1-24 I think) \n2. Click level 2 \n3. BAM!!! ICE PAN INFRONT OF YOUR VERY OWN EYES! NOT CRAVING ICE CREAM? PERHAPS A STARBUCKS INFRONT WILL HELP :33 very convenient as i thought I would have to walk with these sore feet across jarrahs to find ice pan."
        }, 
        {
            "index": 176, 
            "rating": 5, 
            "review": "I used to frequent Ice Pan in their original LA outpost especially during LA's extremely hot weather.  Makes sense that they would move to Las Vegas as the weather is perfect for an Ice Cream shop.  \n\nAs all the other yelp reviewers have mentioned, this place is completely hidden.  Unless you are deliberately looking for Ice Pan you wouldn't stumble upon it especially inside Harrah's! \n\nThey really put alot of hard work into making your ice cream with your desired toppings.\n\nI really liked the soy milk based, fat free vanilla ice cream with blueberries, mango & banana.  I also really enjoyed the soy milk based, strawberry cheese cake ice cream with mango & strawberries."
        }, 
        {
            "index": 177, 
            "rating": 5, 
            "review": "My trip to this ice cream shop was a delightful break from all the usual hustling & bustling of Las Vegas. I found this place onYelp and had to take a $11 cab ride from Monte Carlo to Harrah's just for this ice cream. I saw a fast talking, very funny, pleasant men and a warm, young lady (perhaps his daughter) making ice cream by pouring liquid cream on pans and tossing the frozen cream hard on the cold pan many times.  I was told that I could choose one base ingredient for each order, so I picked red bean and had it topped with fresh strawberries. The whole process took a few minutes but it tasted delicious, fresh and flavorful. Will definitely come back here the next time I'm in LV."
        }, 
        {
            "index": 178, 
            "rating": 5, 
            "review": "Meet teppanyaki's frosty counterpart! Instead of a sizzling hot flattop griddle, you'll find a metal surface chilled to subzero temperatures to instantly freeze your ice cream. The unbelievably friendly people at Ice Pan will blend, slam and chop up the ingredients to dish up ice cream made on the spot.\n\nTheir frozen-to-order ice cream are fully customizable; beginning with the flavor base, the type of milk used, and finally, the toppings that'll be completely integrated into your scoop of icy goodness. You get the front row seat in watching them transform it from a smoothie-like mixture into your delectable sweet treat.\n\nTalk about a hidden gem though. My friends and I wandered into unknown and unmarked territory to find Ice Pan. There's no signage to help you find it, but you're better off asking a casino employee. It's so unfortunate that this innovative ice cream shop is a secret that's too well kept, because the whole experience is fantastic."
        }, 
        {
            "index": 179, 
            "rating": 1, 
            "review": "Ugh, I dislike writing bad reviews! Trust me, I really wanted to like Ice Pan\n\nFirst of all, it is almost IMPOSSIBLE to find this place inside of Harrah's! Seriously! No signage on the casino floor. I know this is not necessarily Ice Pan's fault, but they need to address this. \n\nWhen you finally do reach the second floor, the place looks awesome. They had two employees making ice cream from scratch in cold pans.\n\nHowever, it takes FOREVER just to make one customer's ice cream! Be prepared to wait a half and hour or more if there a couple people ahead of you.\n\nLike other Yelpers mentioned, the manager/cashier/owner guy is VERY talkative. While he seems cool at first, he does all this hard selling (explains the calorie difference between regular ice cream, shows you fresh strawberries, etc). After about two minutes, it gets really old. He makes weird jokes while you are waiting and tries to have you do all these bizarre handshakes. I was chatting with a client of mine on my cell phone, and the manager guy wouldn't leave me alone! Seriously, it is one thing to be friendly with your customers, but if I'm obviously busy on my phone, there is no need to constantly annoy me!\n\nAfter waiting another 15 minutes, an employee finally started to prepare my ice cream. I ordered decaf coffee with soy milk, raspberries, chocolate chips, and strawberries. The base mix she started with came out of some sketch machine (didn't look as \"natural\" as the manager was saying it was). About 5 minutes later, it was near completion. She added the fruit and chocolate chips in and then asked \"Would you like coconut? It will taste yummy!\". I can't stand coconut and replied with a clear \"No thanks.\". She continued making my ice cream and then tossed a bunch of coconut in like it was no issue and said \"You'll like it!\". Are you kidding me? I paid a crapload of money for this \"trendy\" ice cream and she just throws coconut in after I say I don't want it?! At that point, I just took the ice cream and left. I wasn't interested in waiting any longer. \n\nOn top of the whole situation, the actual ice cream was also disappointing. It tasted worse than any other regular ice cream. Honestly, aside from cutting calories, I would say it tasted like something I whipped up at home in two minutes. Definitely not worth it!\n\nOk, here comes the worst part! I read in some brochure they have after eating a significant amount of my ice cream that it causes \"accelerated bowel movements\". They claimed this was \"natural\" and \"healthy\". Let me tell you, my stomach was so BAD the whole night! I couldn't stop using the restroom.\n\nAll in all, save yourself the time, money, frustration, and bowel movements and head to one of the many ice cream shops inside the other resorts (the cafes inside the Bellagio have excellent, fresh ice cream with professional employees!)."
        }, 
        {
            "index": 180, 
            "rating": 2, 
            "review": "Very much underwhelmed.\n\nIce cream was alright. It wasn't very creamy for me. It felt... hard?\n\nAnd the overtly friendly Korean man running the shop was friendly but he just won't stop talking when you're ordering the ice cream. And when you've been standing in line for a while you get tired of hearing how healthy and organic his ice cream is.\n\nIt's also very expensive for a scoop of ice cream.\n\nI don't think I'll be returning."
        }, 
        {
            "index": 181, 
            "rating": 5, 
            "review": "I'm surprised there aren't more Yelp reviews on this place; this place is the next Pinkberry/froyo phenomenon! This is made-to-order ice cream: you choose from 12-15 flavor bases (strawberry, mango, chocolate, green tea, red bean, etc), then pick what kind of dairy you want (whole, lowfat, nonfat, or soy milk) ~$5 for a regular size, then any additional toppings are $0.50/each. My mint chocolate chip was PHENOMENAL plus it was low fat and friendly to my lactose intolerance since I chose soy milk. The nice owners even suggested extra toppings and didn't charge me for them!! \n\nThis is an Asian-based company (maybe Japanese? I'm not sure) that's taking a healthy approach to ice cream (no artificial ingredients). Instead, their ice cream contains something called FOS (fructooligosaccharide) which I think they use as a natural sweetener (its derived from seaweed). \n\nThe best part of this place is that you get to watch the make your ice cream right in front o!f you...it's a lot of pounding and slapping of the ice cream... a fun show to watch... bring your kids."
        }, 
        {
            "index": 182, 
            "rating": 5, 
            "review": "Yum! Who doesn't love ice cream? Who doesn't like watching ice cream being made? Who doesn't love FRESHLY-MADE ice cream?\n\nNo one, you say? Well, then head on over to Ice Pan. I wish I had known of this place the very first time I came to Vegas...so I could come every day. It's a bit on the pricey side, but come on, you've got to be willing to be pay a few extra dollars for your custom and freshly-made ice cream.\n\nIt's a perfect treat for after that buffet...or before it..whichever one you prefer."
        }, 
        {
            "index": 183, 
            "rating": 5, 
            "review": "Awesome! Made right in front of you from fresh ingredients and the staff are so enthusiastic! It was hard to find though, it's on the 2nd floor of Harrah's, near the back above the reception area"
        }, 
        {
            "index": 184, 
            "rating": 5, 
            "review": "Omg so fresh and so good\n\nStrawberry base with raspberry mix in and low fat milk was super rich and creamy still, the fruit flavors were so refreshing on a hot day\n\nGreen tea base with with sit milk and lychee mix in was the perfect consistency, a touch flavor without leaving a fatty layer on your tongue! The mochi was super soft and yummy as well\n\nIce pan is at least on my top 5 for best ice cream ever!"
        }, 
        {
            "index": 185, 
            "rating": 5, 
            "review": "I wanted to try this place after seeing high reviews from other yelpers. It was hard to find this place as it's not from outside where you can see it. I had to ask someone the location and found out it was deeper into the mall. You will find it on the second floor. When you arrive you see a bunch of selections. You can end up with a lot of different ice cream combination. I ask the servers some popular flavors that people pick and most people choose the strawberry flavor. I instead chose the seasonal watermelon flavor with pineapple, lychee, and soy flavor. I watch them make it fresh. It reminded me of Thai style ice cream making, but it's pretty different in technique. Instead of rolling it into a roll it will scoop up with the fruit toppings infuse in them. I was blown away by the taste of the ice cream. It felt fresh and natural. I really love it! It felt like a magical mix. Like you are the explorer and you discover something wonderful after walking around Vegas. If you're in Vegas and want a cold dessert that is made fresh right in front of you. This will be the place."
        }, 
        {
            "index": 186, 
            "rating": 5, 
            "review": "Best ice cream I have had in a long time.   I love that it is all natural and they make it in front of you.  Very friendly staff.  We will be back!"
        }, 
        {
            "index": 187, 
            "rating": 5, 
            "review": "This is a must stop if you are anywhere near Harrah's and have a hankering for ice cream. You are quickly greeted by a Gangnam Style owner who is very excited and proud to sell you his ice cream. He was very helpful about how they make the ice cream and the hundreds of different combinations they sell. \n\nYou start off by picking what type of milk you want your ice cream made with. You can choose from whole, 2%, 1%, skim and I think they even have soy too. Then you add your mix-in's and then they mix everything together and make your very own ice cream in this ice pan, hence the name of the shop is called \"Ice Pan\". \n\nThe ice cream was very good and creamy, I think this is a great idea, I have never had someone make my ice cream from scratch as I waited. What a great concept!!"
        }, 
        {
            "index": 188, 
            "rating": 4, 
            "review": "Not \"Ice Cream\" as I know it, but I enjoyed the heck out of it. Not sweet and not airy, but delicious. The show of buying it and them making it is worth the trek through the bowels of Harrah's. \n\nAs a side, Toby Keith? Really?"
        }, 
        {
            "index": 189, 
            "rating": 5, 
            "review": "FRESH MADE ICE CREAM!!!\n\nService was nice. Price is kind of expensive for the portion size. Ton of toppings you can add to your ice cream. \n\nLocated on the second floor of Harrahs.\n\nAwesome concept on making Ice Cream. Pick your flavor and milk type and a dispenser pours out a liquid mix. The pour it on a freezer sheet and hand toss the mix until it becomes ice cream. Looked like a workout per order!\n\nSoy Milk Pistachio - $5.95 - Milk mix is combined with a ton of pistachios and crushed and tossed. The ice cream was super creamy and a good sweetness level. The pistachios add a good bite and texture. \n\nWaffle Cone - $.75 - Really nice handmade waffle cone. Was thin but strong, it did not fall apart while I ate the ice cream. \n\nOverall, one of the freshest and tastiest ice creams I have ever had."
        }, 
        {
            "index": 190, 
            "rating": 4, 
            "review": "I like science. I like food. Therefore I like Ice Pan. 3 stars for the product and 1 more for the friendly service. \n\nIt was entertaining seeing the process of how Ice Pan makes their ice cream, and good to see they offer milk alternatives. Although it seems that the ice cream is made from powder, but at least they have lots of fruit choices. \n\nMy choice for my visit was Green Tea with mochi (who doesn't like mochi?), and raspberries. The worker told me the flavor of their Green Tea would really be robust and put shame on the Green Tea ice cream you buy at markets... but I have to disagree. It was okay! \n\nI do think price was a bit steep for the serving size... but it is in a casino. Maybe in the future I'll have a more common flavor like Vanilla to determine its flavor explosion!"
        }, 
        {
            "index": 191, 
            "rating": 5, 
            "review": "This place was GOOOOOD!  Came here for a little birthday treat after passing it about a million times to and from the monorail station at Harrah's.\n\nI ended up getting my classic cookies n cream with caramel on top.  The cool thing is, they make the ice cream right in front of you!  They take a mysterious liquid and add in your choice of dairy (whole, non-fat, soy milk, etc) and put it onto an ice cold metal thingy.  They do all this fancy stuff to it, and it turns to ice cream before your eyes!! Then they add in any mixings you want, which cost 50 cents each.  The guy and girl that were working that night were SUPER nice, and the guy that made mine told me to let him know if I wasn't happy with the choices I made, and he'd remake it!\n\nSOOOO GOOOOOOOOD."
        }, 
        {
            "index": 192, 
            "rating": 5, 
            "review": "I discovered this wonderful place on my last trip to Vegas and I'm so glad I did. Also, I have to give a HUGE thanks to my wife for forcing me to buy the daily monorail pass which is how we found this wonderful - amazing Ice cream place. This spot is right in the Harrahs hotel as you come out of the monorail (No I did not stay at the Harrahs). The ice cream they serve is so fresh, they literally get fruits, blend it with some milk (your choice of milk) and then they throw it in a super cold pan and beat the crap out of the ice cream for like 5 to 10 minutes until the liquid becomes cream. You really have to watch it, the preparation is better than some Vegas shows :) and the end result is freaking magic."
        }, 
        {
            "index": 193, 
            "rating": 5, 
            "review": "Delicious and unique ice cream made by incredibly nice people! The man making our ice cream was very friendly and kind to our big group of friends. We'll be back next time we're in Vegas."
        }, 
        {
            "index": 194, 
            "rating": 5, 
            "review": "This is definitely a hidden little gem at Harrah's.  I am so glad I found this spot through yelp and was not disappointed with the green tea, soy milk, and mochi selection."
        }, 
        {
            "index": 195, 
            "rating": 4, 
            "review": "Great idea. But Too pricey. \nBern here 3 Times\nHad Greentea ICE & chocolate."
        }, 
        {
            "index": 196, 
            "rating": 3, 
            "review": "Ice cream is okay. Not great but okay. Staff and service  is excellent. Watching it being made is cool but finished product is just okay. The experience of it all is worth more than ice cream. After eating the dessert i was reading their literature that says something along the lines that due to the ingredients they use dont be alarmed if you experience stomach troubles! A bit alarming at first but thank God i was fine."
        }, 
        {
            "index": 197, 
            "rating": 5, 
            "review": "Best thing ever. The guy was hilarious! I had green tea with lychee and pineapple and blueberry."
        }, 
        {
            "index": 198, 
            "rating": 5, 
            "review": "I love this place!!! The ice cream is so refreshing and filling. It's seriously the best ice cream I have ever had. I had the vanilla, with nonfat milk, strawberries and bananas mixed in, and blueberries on top. It was all in a homemade waffle cone with chocolate syrup on top! It was to die for! The customer service was 5 stars too!! Angela was the one who made my ice cream and she was so nice! She joked around with us and really made us smile. You could tell she took her job seriously. This place oozes with professionalism.  Everyone was courteous and they even gave us a water on the house! Come here!!! You will not be disappointed!"
        }, 
        {
            "index": 199, 
            "rating": 4, 
            "review": "First of all, it's expensive for ice cream.  But you're paying for the freshness and the experience of watching the process, which is pretty cool.  You get to choose the flavor and what kind of milk you want in it, as well as toppings.\n\nWe tried the green tea, which was good, but probably didn't justify the $8 price with tip.  The worker actually messed up our first batch, flipping a large chunk off the actual ice pan onto the counter, so she whipped up another and gave us both.\n\nI would definitely go again, but I would go knowing that it's more about the novelty and experience than the actual ice cream.  Maybe other flavors have more of a wow factor.  It's worth checking out if you want some ice cream."
        }, 
        {
            "index": 200, 
            "rating": 1, 
            "review": "I was one of Ice Pan's BIGGEST advocates when they were located in West Hollywood, so I was extremely excited to be reunited with the ice cream I missed so much after they decided to close shop for \"remodeling\". I was having withdrawals from their green tea flavor, so I purposely went to Harrah's while I was in Las Vegas a week ago. Unfortunately, I WAS EXTREMELY DISAPPOINTED by the Las Vegas version of Ice Pan and I will probably never eat there again.\n\nI ordered a large and was told Ice Pan now only comes in one size. That size is TINY. (Smaller than Pinkberry's 'small'). At their West Hollywood location, Ice Pan used to give twice as much ice cream and charge half as less!! The tiny amount I was given cost $5.95 + tax and the employee informed me that Ice Pan no longer does punch cards. (You used to be able to receive a free Ice Pan after you purchased ten). \n\nThe funny part is... all of Ice Pan's advertising (like the video reels they play of pseudo celebs eating the product) still show the old sizes. The regular used to be as big as Pinkberry's 'medium' and the large was huge!! Now you'd need to order two 'regular' sizes to equal the old 'large' size... which would cost $12!! \n\nI know Ice Pan is located in Las Vegas and everything is a rip-off on the strip, but DAMN. I'm going to stop recommending Ice Pan to everyone I know now. :( \n\nP.S. The employee informed me the owner probably isn't ever going to re-open the West Hollywood location or any location in CA again. (There used to be another Ice Pan in Redondo Beach). No love for CA. BUMMER."
        }, 
        {
            "index": 201, 
            "rating": 5, 
            "review": "I was craving some ice cream so I decided to take a walk up the strip after I saw this place on yelp. It's rather tricky to find, but I eventually found it after walking around the casino a few times. From what I recall, it's located just at the top of the escalator after you walk past the Fulton Street food hall. \n\nI'm glad I did not give up trying to find it, as the ice cream was amazing. I had the green tea made with soya milk with mochi. The ice cream was surprising smooth and creamy, considering it's made in front of you and not churned in a machine. The ice cream itself was not too sweet which was great. Also, the person who served me was super friendly and energetic. \n\nI would definitely recommend this place. It is well worth the walk from wherever you are on the strip."
        }, 
        {
            "index": 202, 
            "rating": 5, 
            "review": "This place is so unique and delicious!\n\nStep 1: Choose your ice cream flavor\nStep 2: Choose your dairy\nStep 3: Choose your toppings\n\nTheir ice creams are freshly blended with real fruit like a smoothie. Then they pour it onto a freezing pan and spread it throughout the pan so it is evenly freezed. Then they smack it back and forth on pan and ta da you have ice cream!!! The banana ice cream with strawberries was most definitely my favorite:)\n\nThey also sell $1 ice pops made from real fruit! \n\nThe service is very friendly. The two ladies who work there, do a very good job of making the ice creams. They are attentive to their customers and always make sure their customers are happy. At the time I arrive at the ice cream shop, a random man was there complaining about his ice cream. The workers felt bad a immediately gave everyone a free ice cold water bottle. It was very kind of them considering most places wouldn't pay attention to your complaint."
        }, 
        {
            "index": 203, 
            "rating": 5, 
            "review": "Love there ice cream is the best staff is so friendly n helpful will return for more for now my best ice cream place"
        }, 
        {
            "index": 204, 
            "rating": 3, 
            "review": "Awesome idea, but the ice cream isn't great. I even asked for all the fat kid ingredients - whole milk, oreos, vanilla ice cream. It just...didn't taste like ice cream. I guess do not expect it to be rich and creamy or you'll be disappointed like I was. But anyway, it was ultra cool watching them make the ice cream and I loved the customizable options."
        }, 
        {
            "index": 205, 
            "rating": 5, 
            "review": "absolutely awesome! Odd location but awesome ice cream.  A tad pricey ($15 for 2!) but really good and large portion.  Sweet lady making it was awesome too.  We ordered banana with coconut, walnut and reese's, seriously best ice cream ever. Wife had peanut butter + reese's, decadent and tasty."
        }, 
        {
            "index": 206, 
            "rating": 3, 
            "review": "Really friendly service and such a unique idea! You pick out your ice cream flavor and they make it right in front of you! The only downside is if there's a long line the wait will probably take forever since it looks like they only have one ice cream making station and it takes a few minutes for them to make. Because of that it's also not the best place to go if you're in a rush and just looking for a really quick snack.\n\nFor better or for worse though I doubt there is ever much of a line here just because it's tucked away in the Harrah's Casino. It took forever for me to find it so to spare you, if you're in the casino just follow the signs to the monorail or the pool and you'll be lead upstairs. It's on your immediate left next to the Starbucks. Enjoy!"
        }, 
        {
            "index": 207, 
            "rating": 5, 
            "review": "LoveLoveLove!  I was sad because I really wanted to try this place out when I was in LA but they were closed for remodeling... so I was extremely excited to learn that they had a location in Las Vegas!  It's sooo cool the way they make the ice cream infront of your eyes... it's entertainment within itself.  You choose the flavors you want and the type of milk you want (whole, skim, fat free, soy) and things you want in the ice cream too... they start beating it in their pan... the harder they beat it, the creamier it gets (that's what she said, lol)... SO GOOD!  I chose strawberry with whole milk and added mochi... it was really creamy and good but I don't think mochi was a good idea because it gets hard when it gets too cold.  Please open a Bay Area location so I can try different things out!  The owners and workers are so friendly and nice... I feel bad that it's not busier since it's in Harrah's and hidden upstairs in a corner.  They need to move to a higher volume location and they would make more business to expand to the bay! lol..."
        }, 
        {
            "index": 208, 
            "rating": 5, 
            "review": "We stopped here several times during our trip.  As most of us have seen before, they prepare the ice cream in front of you.  I had the pistachio and discovered afterwards that they used milk and didn't add sugar.  I loved our stops here, but often times the line was too long.  I highly recommend."
        }, 
        {
            "index": 209, 
            "rating": 5, 
            "review": "The service here was superb!!! Even til the end of the day, everyone is a ball of energy filled with sunshine. Ice cream that warms the heart!\n\nI got vanilla with Oreos and chocolate chip :)"
        }, 
        {
            "index": 210, 
            "rating": 4, 
            "review": "I finally checked Ice Pan off my bookmark list!  I had wanted to try this place since Atomic #7 closed, thinking it was the same concept.  Well, not exactly.  First, Ice Pan is only located here and has 2 locations in Japan!  Second, they use a frozen \"pan\" to freeze the milk and create ice cream, and boy does it take some serious arm strength!\n\nI told the associate I am a first timer - he welcomed me loudly, fist bumped me, and gave me brochures about the healthy benefits of Ice Pan ice cream.  He also let me see the real matcha powder used to make the green tea ice cream.  I ordered soy milk green tea with mochi.  The price is $6.97 with tax...but woops - it is cash only!  AHHHH.  I had $6.25 plus an enormous amount of pennies.  First, the associate told me I could just pay on my return.  Then he willingly took my $6.25, so I was short 52 cents.\n\nI watched the lady sling and power my soy milk matcha mochi concoction into scoopable ice cream and into the carton.  The associate who took my order made sure I was happy with the taste, then he asked me, \"Are you single?\" after glancing at my ring.  I told him no, and he laughed and told the lady next to me, \"But she is a TEENAGER!\" so that was fun.\n\nEvery person gets greeted, fist bumped, and asked to watch the creation of their treat.  It is a neat concept even if a tad expensive.  Just remember, CASH ONLY!!!"
        }, 
        {
            "index": 211, 
            "rating": 5, 
            "review": "Love this place! Great healthy ice cream even for vegans. Also the customer service is absolutely amazing. Thank you!"
        }, 
        {
            "index": 212, 
            "rating": 2, 
            "review": "I was craving for some good ice cream during my visit to Vegas this weekend.  With such raving reviews, I think my expectations were set too high for Ice Pan.  The hubs and I decided on the coffee ice cream with whole milk.  I'm usually not a fan of toppings so I opted out.  It's 50 cents for toppings.  I liked watching the process of them making the ice cream: they measure out some milk, add a little cup of something (looked like powdered coffee to me), blended it all up and it was ready for the ice cold \"pan\"!  I was so excited but was disappointed with the first bite.  It was way too icy and didn't have much flavor.  Not sweet enough (and that's saying something coming from me!) and wasn't creamy at all.  For a whopping $5.95 it was probably the biggest letdown of the weekend."
        }, 
        {
            "index": 213, 
            "rating": 3, 
            "review": "Tried the kiwi strawberry sorbet. Watching them make it was entertaining. The flavors were great but, I didn't like the texture. Silky and slimy are the words that come to mind..."
        }, 
        {
            "index": 214, 
            "rating": 4, 
            "review": "Sehr lecker....unbedingt probieren, leider etwas schwierig zu finden...jede Portion wird frisch gemacht, ohne Chemie nur natürliche Zutaten und nach Wunsch zubereiten....leeeecker!!!!"
        }, 
        {
            "index": 215, 
            "rating": 5, 
            "review": "This place is interesting 'cause it lets you customize your ice cream to your liking. The owner's wife is the cutest and most friendliest person I've ever met! She made me my vanilla ice cream with soy, m&m's & oreo and it was AMAZING! My boyfriend got the coconut ice cream and she hooked him up with extra free toppings. She even was nice enough to give us free bottled waters. I would definitely come back next time I'm in Vegas :)"
        }, 
        {
            "index": 216, 
            "rating": 4, 
            "review": "So this is not your typical ice cream place. \n\nFirst off - the owner - super nice dude.  Reminded me a bit too much like my dad, probably because he sounded like him.  He explained to me their whole process and what they put in and don't put in to their ice cream.\n\nYou pick your flavor.  Then the type of milk (you can get regular, low fat or non fat) and then if you want any mix ins.\n\nI was drawn to the new flavor of Pistachio.  And he showed me - look, we use real pistachios as part of the mix.   And the guy making my ice cream sat there with a immersion blender blending the pistachios into the milk (of your choice)\n\nsince there is no sugar added to this concoction it wasn't that sweet.  It definitely tasted like pistachios though.  \n\nAfter I had checked in to this place - my bestie told me to get peanut butter with bananas.  I'll have to get a bit more creative with my choices.  I can see how peanut butter chocolate and bananas can be just fabulous."
        }, 
        {
            "index": 217, 
            "rating": 4, 
            "review": "Interesting flavors.... That's all I can come up with. They do the whole dance and song thing but yet I didn't find the wow factor. I still give it 4 stars for a fine show, true sorbet flavors, quantity, great service and prices. \n\nI chose the banana sorbet flavor and strawberry as a topping. I like the sorbets so I really appreciate that this was a true sorbet. The whole show of mixing this on a cold cold cold metal sheet was interesting, but hey we are in Vegas so we need the show!\n\nOverall I would be back to try the regular ice cream flavors."
        }, 
        {
            "index": 218, 
            "rating": 2, 
            "review": "I had high hopes for this place really, but they did not impress. I came here with my husband and ordered the green tea while he had chocolate. My green tea tasted like gum paste! My husbands however was delicious.\n\nI HIGHLY recommend you have a female make your ice cream instead of a male! My ice cream was half the volume of my husbands ice cream because the guy pounded the living life out of mine while making it. So much that there was no air incorporated into my ice cream and it came out as a nasty glob of paste! What a bummer!......he seemed like the owners son or something? He definitely looked like he has worked their for awhile. You would think he would know pounding the living life our of the mixture would make disgusting ice cream by now.....\n\nI probably will not be coming back, that ice cream was pretty nasty that I ended up throwing away my cup after three scoops."
        }, 
        {
            "index": 219, 
            "rating": 5, 
            "review": "One of my favorite dessert places in town, especially if you are health conscious. My favorite flavor is vanilla because you can mix it with anything! \n\nGood customer service too, upfront they offer to make you a new one if you don't like it."
        }, 
        {
            "index": 220, 
            "rating": 5, 
            "review": "Did I just get an FTR in Vegas?  BOO-YAH!!!\n\nOkay, so here's what makes Ice Pan different from other frozen treats.\n\nYou pick ingredients.  You pick milk.  They blend it and then freeze it into delcious ice milk in front of you.\n\nSuper fun to watch (I videoed it; I wish I could put video on Yelp.)\n\nI had green tea with mochi bits.  It was DIVINE.   \n\nEven if you're not passing by, Ice Pan is worth taking a few steps out of your way for fresh made icy deliciousness.\n\n(P.S.   I just checked out their website and there is video there!  http://www.icepanusa.com/whats_different.html  Not as awesome as MY video, but it will do the trick.)"
        }, 
        {
            "index": 221, 
            "rating": 4, 
            "review": "Yum! This mall ice cream store may not look like much, but the ice cream is unique and top notch. You choose a type of milk (whole, skimmed, or soy), a flavor (e.g. chocolate, espresso, strawberry), and then add some toppings for 50 cents each.\n\nThat's when the magic begins: one of the attendants will pour a smoothie made of your milk and flavor of choice into an ice pan and flatten it, twist it and compact it until it mysteriously becomes a delicious bowl of ice cream for you to enjoy. It's great fun to watch.\n\nMy friends and I were all very satisfied by our flavor choices (highly recommended if you're vegan!). They have a rotating menu of seasonal specialties to keep you coming back - some of the summer flavors included watermelon, green grapes, and pistachio.\n\nTaking one star off because the wait time can be long and the price (~6) remains a little steep for ice cream."
        }, 
        {
            "index": 222, 
            "rating": 5, 
            "review": "Visited this place during my recent Las Vegas trip, and it was a blast!\n\nThe first time, I got pistachio with pecan pieces in soy milk. It was pretty good, but after awhile I tired of the pistachio flavor for some reason. The ordering process is energetic to say the least! \n\nWent again the following night, and this is where the five stars come in. The owner recognized me, and I ordered the red bean soy with mochi.  The owner went in the back, grabbed a bunch of red beans, and added it to my cup! it was sooooooooo good, probably one of the best vegan ice creams I have had. He also gave me and my girl bottled waters for free, and didn't charge for the mountains of extras he threw in our cups both times. \n\nWe were both fans!"
        }, 
        {
            "index": 223, 
            "rating": 4, 
            "review": "I LOVE icecream... the rich, creamy dense kind that makes me feel guilty with every bite. \n\nAt IcePan, you can choose between that (above) or a very good alternative.\n\nPros:\nTheir icecream has a low sugar content. \n\nThe preparers let you choose between a base of whole milk, low fat milk, non fat milk and soy milk.  It's great for lactose intolerant people who dont feel like popping a pill before dessert. \n\nThe ice cream is custom made right in front of you (without the guilt!) and doesnt contain artifical colors or preservatives. \n\nWe tried a bunch of different flavors and all were delicious. My favorites were the pistachio and green tea. YUMMY!\n\n\nCons:\nKinda pricy (but understandable.. it's made with fresh, quality ingredients and prepared right in front of you)\n\nIf there are more than a few people in line, it takes awhile to get your ice cream... so if you're in a rush, it might not be the best place for you. My bf and I were just leaving the casino area after a bit of gambling so we didnt mind waiting.\n\n\nIce Pan, please please open up a shop in Studio City!! :)"
        }, 
        {
            "index": 224, 
            "rating": 5, 
            "review": "I never would've found this place if it wasn't for my lactose intolerant friend who lives in Vegas. She said she found it because she was searching around for lactose-intolerant-friendly ice cream and came across IcePan... Dude, IcePan is highly underrated and I have a feeling it is going to blow up real soon especially once it starts to get super hot. \n\nYou have your choice of what fruit, type of milk and toppings and everything is made fresh right in front of you on an IcePan. The technique is so interesting to watch. Their team is super animated and friendly. The guy who made my ice cream kept reminding me that a normal cup of what I got would be about 600 calories and mine was only 100. Wow. \n\nSeriously, IcePan had me at \"healthy ice cream\"... and the fact that it tastes more delicious than any other ice cream just puts it wayyyyyyyyyyyyyyyyyyyyyyy over the top. A VEGAS MUST!!!! Go get it!"
        }, 
        {
            "index": 225, 
            "rating": 5, 
            "review": "I love this place! I ordered their Strawberry Soy Milk Ice Cream. You have the option to choose your flavor, dairy, and toppings. They use fresh fruits blend it with dairy (I chose soy milk), and makes the ice cream from scratch right in front of you! I didn't choose any toppings, just got it plain. It felt like I was eating fresh strawberries when I ate my ice cream. So good on a hot day in Vegas ;)"
        }, 
        {
            "index": 226, 
            "rating": 4, 
            "review": "The lady running this ice cream, milk (?) stand was sooo nice! She let us try leftover samples from other people's creations. They were all so good, it was hard to decide on our own. My only complaint was that it wasn't very clean and we couldn't really all sit together (there were six of us). I would definitely go again if I was at Harrah's."
        }, 
        {
            "index": 227, 
            "rating": 5, 
            "review": "Great little place.  The ice cream is priced a little high, but it's worth every penny.  You get to select the milk you want used and then watch it freeze right before your eyes in their \"ice pan\".  They even follow-up with you afterwards to make sure you liked it.  There was a guy next to me that didn't care for his, so they started adding different flavors to it, at no extra charge, until he liked it!  Unfortunately for them, it's not in the best location.  Unless you are coming to/from Monorail or Toby Keith's, you may not know it's there!"
        }, 
        {
            "index": 228, 
            "rating": 5, 
            "review": "Wow. So basically, my parents we're suppose to drop me off at home after my softball tournament. But then all the sudden, they wanted to go to Vegas! And as stubborn and irritated as I am, I complained to go home. But then I remembered why not try ice pan? Would I sacrifice 8 hours on the road in 90-100 degree weather? Was it worth it? Surprisingly, I was convince by all the positive comments and said why not?! \n\nSo here I am at ice pan, and is just wanted to cry. Watching them make my ice cream. It was just honestly beautiful. The woman (which I think is one of the owners) was nice and welcoming. She have suggestions to which toppings were great to add. If you say you want one that she doesn't recommend, she'll give you a face. And that I found incredibly funny. :) But she says trust her. And my and my mom did! So I knew what I want, but she helped out my mom. I got a soy green tea with mochi and cheesecake. It's crazy how much I was smiling. Prices are definitely worth it if you are concerned with what you eat and want to let go the sweet tooth.\n\nThe way they make their ice cream is insanely aggressive and quite a show to watch. There's so much love involved.\n\nI recommend this place 123840472%! It's amazing and definitely worth a trip here! Please try it, you won't regret it. I can promise you that!! :)"
        }, 
        {
            "index": 229, 
            "rating": 5, 
            "review": "Yay for getting to go crazy on dessert and not having to feel guilty! \n\nTwo things that makes it 5 stars for me:\n1. The green grape/soy milk/chopped strawberries combo\n2. The owner\n\nFirst you must know the location, because it's not easy finding this place. If you're a local, then park in the Harrah's parking right next door to the LINQ. Ice Pan is right by the entrance into the casino from self parking. If you're a visitor, then you'll have to walk through Harrahs, walk towards Fulton Street Food Hall, take the escalators right next to it, and you'll find Ice Pan appear on your left. OR you can just simply ask someone where Toby Keith's bar is and Ice Pan is right across from it. \n\nYou choose your fruit/flavor, type of milk, and toppings, they blend the milk with flavor and slap it repeatedly on a ice pan until it starts to harden a bit and then they mix your toppings in! Simple! You get to watch the ice cream being made in front of you with all the ingredients you picked out.\n\nI don't like to come to the Strip often (like every other local) but I always enjoy making a trip to Ice Pan. The owner is hilarious and super friendly, fist bumping everyone and being everyone's personal cheerleader. It's nice to just come by and get your spirits lifted by him if anything else!"
        }, 
        {
            "index": 230, 
            "rating": 5, 
            "review": "The ice cream is delicious, they make it right in front of you... And it takes a lot of effort! \"No chemical, no color, all natural, good for you!!\". A must-visit in Vegas."
        }, 
        {
            "index": 231, 
            "rating": 5, 
            "review": "Great customer service! And amazing job the employees do at making you EXACLY what you want! I love that they offer a soy milk option and, the finished product isn't too sweet! It's perfect!"
        }, 
        {
            "index": 232, 
            "rating": 5, 
            "review": "Ice cream is natural and made fresh to eat. The owner was super nice. She recognized that we have never tried ice pan before so she explained to us how the process goes. I got the banana ice cream with non fat, oreos, and strawberries. It was perrrrfect. Not overly sweet or bland. Def recommend!!"
        }, 
        {
            "index": 233, 
            "rating": 5, 
            "review": "Harrah's has really got to do something about how hidden this place is, we were staying there and still didn't even know it existed until we went to the pool. Unique ice cream experience, to be sure; make sure you get everything with cheesecake in it for maximum enjoyment!"
        }, 
        {
            "index": 234, 
            "rating": 5, 
            "review": "I love this place. The staff is so friendly and the strawberry cheesecake ice cream is so fresh and sooooo good!"
        }, 
        {
            "index": 235, 
            "rating": 4, 
            "review": "This place is cool. You get to watch them make your ice cream right in front of you. You choose which flavor you want. I got green tea. Then you pick which kind of milk you want. I picked soy milk. Then you pick toppings, which are optional. They cost 50 cents each. I got lychee and mochi. Yes, super asian. Then you pay. Then the entertainment starts. (Meaning the creation of your ice cream) I took a video of it, but it's over 2 1/2 mins long.\n\nThe workers are nice; there was two ladies working when we went. \n\nThe reason I took off a star is cuz they only have one size and it's a good standard size, but I feel like since it is Vegas they should have another size option, cuz honestly I probably would have order a bigger size lol. Also since I order fruit, lychee, they just gave me two of them. They chopped it up, but paying 50 cents for that it was not worth it. Maybe if they gave one more then yes, but one goes inside and they put the other on top after your ice cream is done being made. So for my ice cream I believe it came to $7.65 for it? I don't remember the actual price, but it was around there.\n\nOverall, this place is good, I would come back, but it's not one of those places where I want to or need to go again in my next visit. It's just something to try out and experience.\n\nOh this is also a good place for those who are allergic to dairy. :]"
        }, 
        {
            "index": 236, 
            "rating": 5, 
            "review": "The place is very hard to find. But once you find it, it's definitely worth the search! (It's located at the second floor of Harrah's hotel, just take the escalator up and it's pretty much the first store you'll see on the left) The ice cream I tasted at the Ice Pan was definitely one of the highlights of my vegas trip! Ordering my ice cream was pretty tough because there's so many ice cream flavors and combination that you can come up with! Btw! They have a sheet of paper that is kind of a guide with which Ice Cream flavor doesn't really blend well with which toppings, but even so, you're totally entitled to your own flavor and combinations! \n\nThe best part is seeing the ice cream made, they turned liquid milk into ice cream and the process is so fascinating to watch! I ordered Vanilla flavored ice cream, whole milk with the toppings of strawberries and mochi. I played it safe, but it honestly turned out really great! The consistency was different and the mixing of mochi, strawberry and vanilla turned out very delicious. \n\nP.S! They have healthier milk choices and an alternative for people who are diabetic\nDefinitely would come back to this place for the next Vegas trip. 5/5 stars well deserved!!"
        }, 
        {
            "index": 237, 
            "rating": 5, 
            "review": "Amazing ice cream! Very very fresh and they're so informative on how healthy it is and how they make it. \nThe owner is adorable and so sweet! She gave a discount to one of her returning customers in front of us! She also gave me extra mochi without charging for the extra. \nThey even ask how you like the texture and if you want more toppings in it as they make it. \nI got coffee, soy milk, Oreos, and mochi! Super yummy and only $7.\n\nThis is not the same ice pan in Korea, the Korea ones actually copied the Vegas one and also even took their video.\n\nAs I was sitting down with my girlfriends, she came over and told us that Vegas water is super expensive and gave us complimentary waters and even brought us napkins! Sooooooo extremely sweet and amazing service. Left with a very happy tummy :)"
        }, 
        {
            "index": 238, 
            "rating": 5, 
            "review": "THIS PLACE WILL BLOW YOUR MIND! \n\nThe ice cream is absouley fresh. They make their ice cream from scratch RIGHT IN FRONT OF YOU. You pick a flavor, choose what type of milk (nonfat, soy, whole), and then pick the toppings you would like in or on top of the ice cream. \n\nDEFINITELY GET THE STRAWBERRY ICE CREAM, WHOLE MILK, WITH CHEESECAKE BITES AND TOP IT OFF WITH CHOCOLATE SYRUP. IT SERIOUSLY TASTED LIKE A CHOCOLATE COVERED STRAWBERRY. AND YOU DONT HAVE TO WORRY ABOUT THE CALORIES & SUGARS SINCE ALL THE ICE CREAM IS LESS THAN 200 CALORIES PER REGULAR ORDER. \n\nFor a regular order of ice cream = $6.95. For me I thought the price was worth it because of the freshness. \n\nThe service was unbelievable!! The man who was in the cashier told us about the nutritional facts and showed us the brochure to give us more information. He also told us if we didn't like it, he would make a new one. I never had such fun and nice service from an ice cream place until I tried things here. \n\nHe also saw that my friends and I were thirsty from the water so he gave us free, cold water bottles for free! Such a caring ice cream shop for sure!"
        }, 
        {
            "index": 239, 
            "rating": 5, 
            "review": "The one main positive about staying at Harrahs was discovering Ice Pan.     This was pretty much our daily go to spot.    We tried a variety of flavors during our visit including mango, green grape, coconut, strawberry among others. \n\nThe servers are so nice as well.    Our first visit D learned that the lady working there hailed from Japan originally so she and D struck a conversation just talking about that. \n\nAs she was making my ice cream and talking to D I couldn't help but notice some kind of contraption she had on her face covering part of her mouth.   I realized later on it was there to keep their saliva from hitting any part of the ice pans or your future ice cream.   So cool.\n\nThe remaining days we chatted with a worker from Bulgaria.  The workers were so nice which in addition to the tasty and healthier product was another reason for our return visits.\n\nSo sad they don't have a place like this in Chicagoland.  When we get back to Vegas, this will definitely be a spot worth returning to no matter where we stay at next time."
        }, 
        {
            "index": 240, 
            "rating": 5, 
            "review": "We loved ice pan! The cashier was so friendly. My kids thought the was great! Ice pan is something totally new when discussing ice cream! They take a liquid form of your ice cream and freeze it right before your eyes on a frozen pan! They then add the mix ins. It is all delicious! The head cashier was so kind. He made a special ice cream for my husband's birthday and gave us each a water bottle without charge!"
        }, 
        {
            "index": 241, 
            "rating": 4, 
            "review": "It's a neat and unique \"healthy\" ice cream experience. \nNaturally pricey as it's in a strip hotel. Actually right outside Toby Keith's Country Bar in Harrah's, kind of a weird location but seems to stay busy. \nI had red bean with ff milk and mochi topping; it just wasn't sweet enough for me but my girlfriend had strawberry with soy milk and cheesecake topping which tasted sweet and creamy. They use very fresh ingredients and it's fun to watch the process.\nHOWEVER something went wrong with their contract at this location so they will close by Aug 31st...And re-open in California?! \nSo that was probably a one time stop for me. \nCool concept that seems to work tho."
        }, 
        {
            "index": 242, 
            "rating": 4, 
            "review": "Im loving it. \n\nThis place is located on the second floor of Harrahs. It is pretty small with about 3 tables, so don't expect to sit here to eat. \n\nI ordered Watermelon with Pineapple. You choose your flavor, milk/cream, then add-ins. \n\nPresentation (5/5): As everyone previously already mentioned. People usually come here just to see how it is made. The ice cream liquid is blended and placed on a freezing cold metal pan where it slowly freezes and they hand mix the ice cream till its a nice fluffy texture. Takes awhile but its fun to watch. \n\nFood (5/5): I loved that this random combination worked. I loved that i watched them blend my watermelon from fresh fruit and that they didn't just throw pineapples in/ontop of my ice cream but they actually chopped up the pineapples and folded it into the final product. My only wish was that it was creamier and smoother. \n\nPrice(3.5/5): Its honestly kind of pricey for me. $8 for a small cup. I guess the extra goes to the workers having to work so hard to mix and make the ice cream but still, pretty pricey for a small (but decent sized) cup.\n\nService (5/5): Excellent and very helpful"
        }, 
        {
            "index": 243, 
            "rating": 5, 
            "review": "Yelp did not fail me once again. I am so ecstatic to have come across this little gem. Hidden in the Harrahs casino, this place is great if you're looking for a quick and healthy dessert. Everything is all-natural, no added sweeteners and made right on the spot. \n\nUpon arrival, the owner greeted us and asked if it was our first time. He was adorably enthusiastic and couldn't stop high-fiving us while he described the whole process. It's three parts: 1) base flavor (chocolate/peanut butter/sorbet/etc) 2) dairy option (whole/non-fat/soy milk) and 3) toppings or mix-ins. He then proceeded to show us examples of the matcha green tea and the cocoa powder used in the ice creams. It all smelled wonderful.\n\nI chose green tea ice cream with non fat milk mixed with Oreo. The lady was very sweet and asked if I liked mochi, I said yes and she added some to my cup. \n\nMy friend chose chocolate ice cream with non fat milk mixed with half a banana and topped off with strawberries and chocolate syrup. \n\nBoth were delicious and reasonably priced (~$7 each), which sounds wonderfully cheap compared to the $8 I was swindled out of at Jamba Juice. We couldn't believe they were nonfat. They were just as creamy and just as sweet as any other ice cream you would fine, but without all the bad stuff. The owner insisted we try it in front of him and if we truly did not like it, he would make us something else. Needless to say, he did not need to make us another because we left with happy bellies :)"
        }, 
        {
            "index": 244, 
            "rating": 4, 
            "review": "What sets Ice Pan apart from most typical ice cream places is that the ice cream is made right in front of you! It's not like Cold Stone, where they mash the ice cream together. Instead, they pour the liquid mixture of your ice cream over the Ice Pan, which eventually freezes the mixture over a span of 30 seconds. The person will add desired fruits or toppings onto the ice cream, continue to mix well until firm, and then scoop into a cup for you to enjoy!\n\nSo how does it work at Ice Pan?\n\n1. Choose your flavor: strawberry, mango, banana, green tea, vanilla, chocolate, mint chocolate, kiwi, yogurt, coffee, lemon, pistachio, peanut butter\n\n2. Choose your milk base: whole, low-fat, non-fat, soy milk\n\n3. Choose your topping (extra cost): strawberry, banana, kiwi, blueberry, pineapple, mango, almond, oreo cookies, reese's cups, mochi, lychee, etc\n\nMy bf and I ordered the mint chocolate chip ice cream with whole milk and Oreo topping along with Peanut butter ice cream with whole milk and Reese's topping. This place does not use refined sugar and the ice cream is creamy and does not have that extra sugary taste, which I liked! Overall, it was a very healthy treat.\n\nMy only gripe about this place is that the smallest size costs about $5-6. That's pretty steep in my opinion. However, when one is traveling in Vegas - it's okay to splurge once in awhile for some good healthy ice cream. =)"
        }, 
        {
            "index": 245, 
            "rating": 5, 
            "review": "Kind of expensive, but totally worth it.  The folks that run the stand are hilarious as well.  If you're down on the Strip, definitely check it out.  I think there are only one or two of these in the US, so you're not going to just stumble across another one!  I recommend the green tea or pistachio ice cream (I get mine with soy milk)."
        }, 
        {
            "index": 246, 
            "rating": 5, 
            "review": "One of my favourite must go places when I come to Vegas.  \nThe owners here are amazing, they are really excited when you pick a selection and gives you a high five advising you that you made a great choice. \n\nThis is located on the second level of Harrah's next to the guest elevators, same floor as Toby Keith bar and parking garage. \n\nYou get to pick your base, usually we pick a fruit, their seasonal watermelon, pomegranate or green grape is my favourite.  Step 2 you get to pick the type of milk, non fat, low fat, soy milk, sugar free. \nStep 3 you get to pick your mix-ins, it's an extra 50 cents but makes a big difference!! \n\nThey make it in front of you, put in a lot of effort smacking the ice cream around on the ice pan. And in 5 minutes you have fresh made ice cream. I always recommend this place when my friends visit vegas!! They also guarantee it will taste good, otherwise they will remake it for you.  \n\nI really heart this place!! They deserve the 5 stars."
        }, 
        {
            "index": 247, 
            "rating": 5, 
            "review": "So good customer service *inserts DOGE face*...But seriously, Mr Ice Pan man is awesomely entertaining and knows how to run a business right\n\nIce pan's ice cream is all natural and has NO sugar.  The dessert is sweetened by the natural ingredients so don't expect a sugar rush or complain that it isn't sweet enough.  If you want extra sweeteners, you can ask for caramel/chocolate sauce on top and still feel good about the 5 meals you had that day\n\nBottom Line: Delicious, Creamy, Fresh & Fruity, and mildly sweet"
        }, 
        {
            "index": 248, 
            "rating": 3, 
            "review": "On our last afternoon in town, my fiancee and I were in the mood for a sweet bite after doing a little bit of gambling and shopping. While you can probably find a Ben and Jerry's (or something similar) in numerous places around the Strip, we decided to come to Ice Pan to try something a bit different. Admittedly, part of the 'cool' factor of this place is how they make the ice cream - it resembles a slightly more violent version of whipping up scrambled eggs - but the ice cream itself is pretty good. I went with an Asian-inspired ice cream - red bean with mochi and strawberries - and came away pretty impressed. The red bean flavor was strong but not overpowering, and the mochi was mixed in well enough to give it an interesting texture.\n\nHowever, it's not as good as the straight-up standard ice cream you can get at a boutique shop. Another qualm is the minimum starting price and size; the small is going to set you back at least $5-6 (if you get literally nothing else in terms of toppings), and while you are paying for portion - the size comes out to around 4-5 smaller scoops - it's still quite a bit of ice cream to take down in one shot. The other problem is timing; there have to be more than 2 people working there, or else you simply get bogged down, as one person has to focus on making your ice cream, and that takes at least 3-5 minutes if they don't have to stop in-between to prepare other batches or take orders at the register. It's certainly unique, but the flavor is not so mind-blowingly good that I would wait another 15 minutes just to get served ice cream.\n\nIs it worth trying out once for the concept? Sure - and if there is no one else there, you may as well take the plunge - but otherwise, you may have to wait a while to satisfy your sweet tooth."
        }, 
        {
            "index": 249, 
            "rating": 5, 
            "review": "We got off the monorail at Harrahs and came across this little healthy ice cream shop as soon as we walked in.\n\nPAN ICE CREAM\nThey serve pan ice cream, which freshly ice cream made in front of you on a frozen pan. Someone else just brought this concept to Hawaii, so this must be catching on quickly. You can get non dairy options or put fresh fruit, mochi or other toppings in your ice cream. It's kinda like a healthier version of Marble Slab.\n\nNATURAL ICE BAR\nNatural Fresh Ice bar $1! Like a Popsicle but better! Super good without the guilt! I got the red bean (Azuki) flavor and it hit the spot! \n\nIf you want an icy cold break from the sweltering heat without spending a ton of money, this is your spot."
        }, 
        {
            "index": 250, 
            "rating": 5, 
            "review": "Ice pan is a must! We first discovered this amazing ice cream in L.A.and were completely saddened when they closed :/ Lucky for us we rediscovered them when they moved to Harrah's hotel in Las Vegas. This is the BEST ice cream on the planet!!! It's made fresh in front of you on these awesome ice pans. Coldstone who? Forget that generic, heavy and over priced stuff and come out for the real deal. Make sure and tip these guys well, as their customer service is always above par. If you're fortunate to meet the owners make sure and give them a high five and thank them for showing you what real ice cream should taste like. We love you ice pan!!!"
        }, 
        {
            "index": 251, 
            "rating": 4, 
            "review": "So far, this is my favorite ice cream shop in terms of originality. How many places can make your ice cream out of scratch right in front of you? Milk options include non-fat, low-fat, whole milk and organic soymilk. Great for those who are lactose intolerant. Toppings include nuts, chocolate, fresh fruit, etc. Ingredients are mixed on a pan that's way below freezing temps. The owners have mad skills bringing together all the ingredients. I liken the experience to watching teppanyaki but with more elbow grease applied. Ice Pan has somewhat limited flavors and the healthier options, frankly, don't taste as good but I love the novelty and brief entertainment."
        }, 
        {
            "index": 252, 
            "rating": 5, 
            "review": "The owner is funny and upbeat.  He takes you through the steps of the ordering process, and he high-fived me when I picked lychee as my topping (Step 3) for my Pineapple (Step 1) with whole milk (Step 2).  He showed me that they used fresh pineapples and said that they use all natural ingredients with no preservatives, unlike Pinkberry's.  Take that, Pinkberry! \n\nI don't think that I could work here as the ice scrapers because I would have sore shoulders and arms.  Imagine scraping ice for 8 hours - I would have shoulders like The Rock.  \n\nYes, my creation tasted great - the owner asked me if I liked it, and when I gave him the thumbs up, he said, \"See you tomorrow!\"  \n\np.s. This place is up the escalators next to Toby Keith's I Love This Bar Restaurant."
        }, 
        {
            "index": 253, 
            "rating": 4, 
            "review": "It's interesting to see how they make the  ice cream from scratch. Sort of like a Benihana of ice cream. But I wasn't too impressed with the taste. I had coconut. I've had better, but I needed something sweet and it happen to be in front of me. Stars for the customer service and the demonstration but overall taste what not so impressive."
        }, 
        {
            "index": 254, 
            "rating": 2, 
            "review": "Thought it was impossible to make me hate ice cream but the idiot behind the counter sure did. Not impressed."
        }, 
        {
            "index": 255, 
            "rating": 5, 
            "review": "Amazing customer service, unique product and taste delicious. Super fresh ingredients made right in front of you in minutes. Great experience overall."
        }, 
        {
            "index": 256, 
            "rating": 5, 
            "review": "I'll put in simple words for you all.  The best ice cream i've ever had in my entire life.  It kinda cool how they make in front of you in like a couple minutes.  It is pricey for it being ice cream, prices start at $5.95 and .$50 each topping.  But if you go once in a blue moon its ok to splurge on a craving."
        }, 
        {
            "index": 257, 
            "rating": 5, 
            "review": "Very refreshing! Green grape ice-cream, first time ever! All made from scratch, & super recommend to ppl like me who is lactose intolerant. So gratifying with our first order & went back for another right the way lol! Definitely will be back! Thumbs up!"
        }, 
        {
            "index": 258, 
            "rating": 5, 
            "review": "Being new to vegas has its perks. I get discover vegas slowly and I'm so glad I found this place! Whenever I come here with my friends, we're always greeted and treated nicely by the owner. The owner is very quirky, fun and generous! \n\nI have to say watermelon and strawberry are my favorite flavors!!! I get both with whole milk, strawberries, blueberries, mangoes and lychees. So freaking delicious!"
        }, 
        {
            "index": 259, 
            "rating": 4, 
            "review": "Stopped by this place with a few friends and my wife. We all really enjoyed the employees and the ice cream. The only reason I cannot give it a 5 star is the price. It's a bit on the high side for ice cream."
        }, 
        {
            "index": 260, 
            "rating": 4, 
            "review": "I like this place. It's cool to watch them make your ice cream from scratch. You can pick whatever milk you want as well. The people are super friendly, chatting while they make it in front of you. \n\nThe ice cream is light and low on calories. It isn't strongly flavored and isn't too sweet, which I enjoy. I got the peanut butter with oreos, which ended up tasting like a reese pieces! Delicious. \n\nThe only downside is that it takes a while to make, so I normally will get a scoop when no one is in line."
        }, 
        {
            "index": 261, 
            "rating": 5, 
            "review": "LOVE THIS PLACE! I would always make a trip to Harrah's to get ice cream here. The ice cream is hand made from scratch and you could choose your flavor, type of milk, and toppings. I've had the SOY mint chip with raspberries which was refreshing and the soy coffee with oreos. It's amazing! Can't wait to go back!"
        }, 
        {
            "index": 262, 
            "rating": 5, 
            "review": "It's been the best ice cream ever. Everything is fresh and they make your desired ice cream just in front of you."
        }, 
        {
            "index": 263, 
            "rating": 5, 
            "review": "SOOO good but it was so hard to find! I found out about this place through Yelp and put it on my list of places to try out. I led my friends through Harrah's not knowing where the hell we were going, until genius me went on Yelp on my phone and saw a review here that said GO UP TO THE SECOND FLOOR! There are absolutely no signs for this place cause it's just a little counter right next to the escalators. You can easily miss it if you're not looking for it.\n\nI got the red bean with soy milk and lychee. For $6.97, it was worth it. The ingredients were fresh and there was none of that artificial crap added that nobody knows how to pronounce. And it was pretty cool watching the worker slap the ice cream around on the pan -- looks like it would be a good workout for the arms. It doesn't seem like you would get a lot when it's first being made, but after it's scooped out into the cup, it's a good-sized portion. \n\nI'll definitely come back the next time I'm in Vegas, especially since now I know where the hell it is. Damn."
        }, 
        {
            "index": 264, 
            "rating": 3, 
            "review": "The service was spectacular and the Korean lady made sure we felt welcomed the second we walked up to order. Unfortunately, the custom made ice cream wasn't as flavorful as I hoped it to be. It is cool that we got to see our ice cream made right in front of our eyes, but I wouldn't substitute a simple tub of cold stone for icepan."
        }, 
        {
            "index": 265, 
            "rating": 5, 
            "review": "I just had Icepan inside harrahs casino. One of the best icecreams ive ever had. It's like a cold stone experience but way better. The -35 degree icecream wheel was cool to watch as the icecream artist scooped, scraped, pounded, chopped, splatted over and over again. Also the selctions of different types of healthier milk versions were awesome as well as some cool flavors and toppings. I had low fat banana with chopped almonds and caramel sauce in a whaffle bowl. Simply yummy. Watching it being made was worth a few bucks itself. Can't wait to go back and try new concoctions."
        }, 
        {
            "index": 266, 
            "rating": 4, 
            "review": "I couldn't really hear what the cashier lady was saying...but the sight of the process and the taste were absolutely wonderful."
        }, 
        {
            "index": 267, 
            "rating": 5, 
            "review": "I don't know what else to add that hasn't already been covered.  This made-to-order frozen dessert place is entertaining and an exercise in patience.  Watching the Ice Pan folks slap your (non)dairy atoms on the icepan is definitely a fun show.  Of course, all the while you're watching, you're wishing that the process would just hurry-up-a-bit-because-you-really-want-your-dessert!\n\nChoose from your choice of dairy milk or non-dairy milk, then select your choice of flavour, then decide upon the topping(s).  No preservatives or additives (except what may be in the toppings -- Oreos, Reese pb cups, etc.) and all made in front of your eyes in about 2 minutes.  (I timed it.)  \n\nIt's too bad that one has to fight through the Harrah's smoky casino to get to Ice Pan, but it's worth it.  Be prepared to wait a while; we checked out Ice Pan on a weekday during the late afternoon and despite being 2 of about 5 people in the queue, it still took about 15 minutes for the Ice Pan folks to start our order.  We forgot that pain as soon as we tasted our dessert though.  :)"
        }, 
        {
            "index": 268, 
            "rating": 1, 
            "review": "SERIOUSLY NEVER BEEN MORE SICK!!!\n\n-Do you love eating sweet treats that make you feel like you have the stomach flu? \n-Do you love getting stomach flu symptoms a mere 20 minutes after consumption of said treat only 5 hours into your Vegas vacation?\n-Do you also want said symptoms to mess you up for 2 days?!?! \n\nThis is the place for you!\n\nYou will pay a pretty penny for this \"treat\" but you will pay WAY MORE for all of the travel sized peptobismol you have to purchase from your Vegas hotel to nurse your insides back to health. \nNEVER EAT THIS!!! SERIOUSLY I HAVE NEVER BEEN MORE SICK!!"
        }, 
        {
            "index": 269, 
            "rating": 5, 
            "review": "To be fair I want to point out that I do work on Harrahs and I do get a discount HOWEVER this is not the reason Ice Pan deserves 5 stars. I've seen this place since taking my property tour in orientation. I see it everyday while ordering Starbucks! Well today I got to work a little too early and decided to drop by(out of uniform).\n\nI love pistachios so I chose that as my flavor, whole milk, and mochi as my mix in. She made suggestions as to what goes well with pistachio but I new what i wanted lol. She blended the milk, some flavoring, and pistachios all together the poured onto the -30 degrees ice pan! She scraped and mixed it then added my mochi! She suggested I put caramel on top and I agreed to a little bit so I could still taste the pistachio! Let me tell you! This ice cream is unique and delicious! The pistachios were blended down so there is a nice texture to the ice cream. I chose mochi because its not too sweet and doesn't change the flavor of the ice cream like if I were to add bananas or pb cups. All in all I love this ice cream and I'm excited to explore the menu a little more because there are a TON of options but I was honed in on pistachio :) I highly suggest ice pan if you're have a sweet tooth :)"
        }, 
        {
            "index": 270, 
            "rating": 5, 
            "review": "I LOVE THIS PLACE\n\nWhen i went to this place for the first time. the sweet Asian girl at the front was extremely helpful.\n\nI GOT THE GREEN TEA ICE CREAM!!!! you don't understand... i am obsessed with green tea ice cream...  I also am a very healthy whole organic food advocate....\n\nThere ice cream is freshly made and all organic! not only that but it is so hard to make! the girl making my ice cream explained why she was doing what she was doing and all of the benefits of their ice cream compared to others. \n\nshe BEAT in the texture and the flavor was to die for!\n\nShe even was so kind to make sure i completely loved my ice cream... she made sure i was a happy customer and seeing as how i work in customer service it was nice to see a employee with great customer service skills!\n\nnext time i am in town i will be sure to eat here again!"
        }, 
        {
            "index": 271, 
            "rating": 4, 
            "review": "Kind of a new concept when it comes to ice cream.  Let's you be uniquely creative on how you want your ice cream prepared.  Giving you multiple options from a 3 step process and letting you decide how much milk fat you want to ingest into your system.  While I can appreciate this whole process and it was fairly fun to watch, for $8.05 I would have expected more.  Everything else was great.\n\nItems Ordered:\nStep One - Chocolate\nStep Two - Non Fat Milk\nStep Three - Pecans, Walnuts, Marshmellows, Chocolate Chips and Chocolate Drizzle\n\nThe texture is rather nice, but still produces a hint of slight freezer burn.  I can imagine that this is a result of the ice cream process being at -35 degrees.  The person making the ice cream cleverly chopped up all of my selections into one organized and thoroughly mix of my selections so I could savor each bite.  Was delicious, my only gripe would be the price.  A cold stone ice cream concept with the actual ice cream made in front of you is the only major difference."
        }, 
        {
            "index": 272, 
            "rating": 5, 
            "review": "Best ice cream in town!  You pick your flavor, they make it fresh in front of your eyes!  located right in front of the Diamond Lounge on the 2nd floor.  I highly recommend it!"
        }, 
        {
            "index": 273, 
            "rating": 4, 
            "review": "Been here twice before.\n\nOwner is super sweet, funny, and outgoing. Had a great time making conversation and jokes with him while ordering and waiting for my delicious frozen goodness. Loved his enthusiasm in explaining the way things worked to my friends that haven't been there before. He was keen on making sure they knew how much of a healthier and better alternative this was to regular ice cream, all natural and fresh ingredients, and tastes just as amazing as any other old ice cream\n\nFirst time  I came I think I tried the red bean and green tea both with whole milk which were not bad.\n\nThe second time I came, I got the whole milk with strawberry and cheesecake bites and he topped it off with fresh strawberries, none of that artificial crap, to add even more healthiness and flavor to my selection. This is one of the best combinations guys believe me. I get something similar at cold stones too.\n\nPretty pricey,but entertaining and interesting concept in making ice cream by pounding it intensely in front of customers. Give it a try its at least worth the experience once."
        }, 
        {
            "index": 274, 
            "rating": 5, 
            "review": "One of the most unique spots I've run into in Vegas in a long time. You would never think that such a spot exists in Harrah's.\n\nThe product is great. No preservatives or added sugar unless you choose to add candy or cheesecake. The combinations are endless from what flavor, milk, and toppings you choose. The banana flavor with soy milk is my favorite. What makes this spot so unique is the performance that comes with every order. The owner and his staff are all so animated and welcoming. \n\nI can't imagine anyone leaving ice pan with anything but a smile on their face unless you're extremely critical and just upset with the world...in that case...nothing can please you."
        }, 
        {
            "index": 275, 
            "rating": 5, 
            "review": "Tried the watermelon seasonal ice cream and the vanilla peanut butter. Both were yummy!!!! The guy making the ice cream was hilarious! Most ice cream before toppings are only 150-190 calories! Would come back again."
        }, 
        {
            "index": 276, 
            "rating": 5, 
            "review": "Not only is the custom made ice cream delicious but the people who work there are awesome! My daughter can't eat dairy and they do make dairy free soy milk ice cream. She said it was excellent."
        }, 
        {
            "index": 277, 
            "rating": 4, 
            "review": "This place is so awesome!! I've always seen videos of people making it & it's equally as cool live in person. I love how I have the option to use soy milk with any flavor I want. The texture is so creamy & unlike anything I've ever had!! Plus they mixed the mochi INTO THE ICE CREAM! Genius!! Best $8 spent on ice cream everrrrrr!!!! It's a must try!!\n\nI took a star off because each staff makes the batch a little differently. The first time I had it the ice cream was super creamy & smooth, the second time, I think the guy could had left the ice cream on the pan a bit longer to make it more chilly. Still good, but not as bomb as the first time."
        }, 
        {
            "index": 278, 
            "rating": 5, 
            "review": "Ice Pan, you are the best thing to come out of Korea since Korean BBQ & Kim Jong-il! Ok, so maybe the latter part of that statement isn't exactly true ;)\n\nI had no idea that this place even existed here. But, to be honest, I had never stepped foot inside Harrah's until today. Is that weird? Or maybe you're just weird for having stepped foot inside this place!\n\nAnyways...this place is absolutely amazing! Apparently, it is the only one in the U.S. currently. I believe they had one in Hollywood at one point though. I don't know why they don't have these all over. Forget Coldstone & Marble Slab! This is pretty much ice cream made to order, while you watch. The girl that was working behind the counter was such a spitfire & really friendly & full of information & certainly a master of her craft; by far one of the most enthusiastic & happy employees that I have ever met & that took so much pride in her work; definitely a model employee.\n\nI ordered a banana base, with non fat milk, Reeses' peanut butter cup, and more bananas, finished off with caramel, in a cup. It was a very neat process to watch. She was very fast & methodical, as well as precise, as she slapped it up, flipped it, and rubbed it down, OH NO! & Boom! Ice cream.\n\nIt was soooo good! It is very misleading when they first start to make it, because it yields a lot more than what you think it might make.\n\nI hope this place grows & grows! I think it is a great way to make ice cream & will probably catch on. I know they have plans forlocations in Kuwait & Dubai, which will really do well over there. I think places like this are kind of lost on the U.S. demographic though.\n\nI highly recommend this place!"
        }, 
        {
            "index": 279, 
            "rating": 5, 
            "review": "So ahhmazing! From scratch ice cream! We got Green Grape w/ Lychee & Kiwi w/ Raspberry! No artificial flavors and Andy who served us was the best, so funny and sweet! The best service I've seen in a while! Helped us and several others even after closing! You gotta check it out if you're ever in vegas."
        }, 
        {
            "index": 280, 
            "rating": 4, 
            "review": "Very good experience and a little Vegas fun ice cream was fairly good too, not the best but I think you're paying for the show"
        }, 
        {
            "index": 281, 
            "rating": 5, 
            "review": "Looking for vegan dessert options and found Ice Pan.  It was great!\n\nThe owner helped us decide what to order and engaged us the entire time.  I had the soy milk based \"ice cream\" with peanut butter and Oreos and a banana.  Wonderful!\n\nAs we ate, the owner then insisted we take free bottles of water with us.  \n\nAs someone with a dairy allergy I always appreciate tasty dessert options and this was a good one."
        }, 
        {
            "index": 282, 
            "rating": 5, 
            "review": "This is the most delicious ice cream in the world. It was so great I actually ordered a second bowl after finishing the first. It is fascinating to watch how they make it and the most refreshing thing in the world. It will be my first stop on my next trip."
        }, 
        {
            "index": 283, 
            "rating": 4, 
            "review": "Ice Pan has to be one of the best ice cream experiences you have in Vegas.\n\nThe transformation of natural ingredients in a matter of seconds into a delicious ice cream is truly marvelous!\n\nThe energy and vibes by the owner shows her true passion for her craft and I hope that this review compels you to try their ice cream. Pick any flavor of your choice and I will assure you that you won't be disappointed. We stuck to our favorites- chocolate and banana with toppings :)"
        }, 
        {
            "index": 284, 
            "rating": 5, 
            "review": "and 5 more stars and 5 more stars.  you will never understand if you don't try it.  THEY MAKE ICE CREAM FROM SCRATCH just for you.  You've never tasted ice cream this good!!  Go, GO!  This is a must.  Mint chocolate chip and oreo for the win!!"
        }, 
        {
            "index": 285, 
            "rating": 3, 
            "review": "I was not impressed.\n\nThere were two workers at the time I went.  I seemed to have gotten the less experienced one.  She struggled awkwardly to mix the ice cream.\n\nThere was only one size, and it was expensive for the amount you get.\n\nI got green tea, and was disappointed.  The texture was light and creamy, but it didn't taste as strong as I would have hoped for the price.  \n\nI would try this again, but not at this location.  Ingenious franchise idea."
        }, 
        {
            "index": 286, 
            "rating": 4, 
            "review": "So freaking awesome!\n\nThey literally make ice cream in front of your eyes! Pick your type of milk (whole, soy, etc.), what flavor, any toppings, and BAM! \n\nThey pour the liquid on their super cold pan of theirs and work their magic.\n\nI got the green tea and added mochi in mine. They gave me a lot of mochi too! (I love mochi) It was awesome to watch my ice cream being made in front of me. \n\nEating it was great too. Although, I felt like the ice cream was a little bit dense, so I got lightweight sick of it after my 5th bite. You might want to share your ice cream with a friend or two! Other than that, I thought this place was a fun experience! :) \n\nDefinitely worth going for a try!"
        }, 
        {
            "index": 287, 
            "rating": 5, 
            "review": "It's so delicious. I have never tried this before and I recommend to anyone who likes ice cream. And the most you can get one with low calories!!!"
        }, 
        {
            "index": 288, 
            "rating": 5, 
            "review": "Good lord, Ice Pan.\n\nThis is by far the best ice cream you can get in Las Vegas, and practically the only ice cream you can get at 2:00 am.\n\nI did not expect it to be so above-average, considering it seems gimmicky and overpriced. I was absolutely blown away!\n\nI love the range of flavor selections. I love how they flavor their ice cream solely with whatever fruit/ingredient the ice cream is based on. The banana ice cream is flavored with a pureed banana. The coffee iced cream is flavored with shots of espresso. So perfect!\n\nI have to admit that the furthest I will venture from my go-to coffee flavor choice is stealing bites of whatever my girlfriend gets. Ice Pan's coffee ice cream is the best I've had! The espresso comes through nice and bold, and is not overly sweetened like most coffee ice cream.\n\nWhat keeps me coming back to Ice Pan is the unique texture of their product. If you've been to Humphry Slocombe in SF, you will recognize Ice Pan's texture. The ice cream is densely frozen and very cold, but not hard. It is like a collection of quick-melting micro-crystals of ice. As explained by Ice Pan's charismatic owner, this texture is achieved by forcefully slapping the ice cream against the pan as it freezes, thus eliminating air bubbles.\n\nAll of their employees are very energetic and friendly. They talk to you about the process as they make your ice cream, while they laugh and joke. The owner is a hilarious guy- expect at least three high-fives per visit. He also likes to suggest toppings as he throws your ice cream, throwing them in for free if you approve.\n\nFor their unique product, memorable customer experience, and quality ingredients, Ice Pan is worth the extra few dollars per serving over average ice cream shops, and epitomizes what I love in local food."
        }, 
        {
            "index": 289, 
            "rating": 5, 
            "review": "This place is a wonderful little place that's tasty and healthy:) my kids and I loved our choices and the way they make it in front of you while you wait!  You choose your flavor, choose your milk & choose your toppings. Then they get to work! Oh and no matter what u choose, it's got seaweed in it (that's their secret ingredient) I got Vanilla, Non-fat, with Mochii & M&M's & it was great:)"
        }, 
        {
            "index": 290, 
            "rating": 5, 
            "review": "I recommend ICEPAN for one of your destination when you visit Las Vegas. The ' 'healthiest and fun' dessert's place to go. \nMy fav choice is non fat, pomegranate, with lychee or green grapes (if season)  topping: mochi, lychee, green grape or rasberry. \nThe employees are very friendly and well knowledge. Try it yourself!"
        }, 
        {
            "index": 291, 
            "rating": 2, 
            "review": "Overrated.  I've definitely had better ice cream.  On a bright note, the girl making the ice cream was very friendly, but the ice cream was nothing to write home to mom about.  I much rather have the ice cream selections they offer at the buffet."
        }, 
        {
            "index": 292, 
            "rating": 5, 
            "review": "I recommend it to everybody! not very common and a good place! tasty and healthy! good staff very friendly!"
        }, 
        {
            "index": 293, 
            "rating": 5, 
            "review": "Love this place! Didn't plan on coming here, me and my dad were just walking through Harrahs and stumbled upon it. But it's amazing; incredible ice cream with healthy ingredients made in front of you, and a very friendly staff. Would definitely recommend, and personally plan on coming back here when we return to Vegas."
        }, 
        {
            "index": 294, 
            "rating": 5, 
            "review": "Healthy ice cream! I am a huge ice cream lover. Usually when I tell people healthy they give me the stink eye but when I had them try this, they loved it! This is a must go place. Design your own and enjoy. It is dessert and a show. The owner and his wife are very cute. They used to have a store in Hollywood but it closed down and I followed them here so it must be that good!"
        }, 
        {
            "index": 295, 
            "rating": 5, 
            "review": "Tried this place after seeing it on Yelp. Head towards the back of the casino and go up the escalator to Toby Keith's bar to find it. Tried the green grape ice cream with strawberries, raspberries and mango. Delicious! Guy taking the orders was hilarious and had tons of energy. Possibly the owner? Recommended for anyone wanting something sweet without a bunch of sugar."
        }, 
        {
            "index": 296, 
            "rating": 5, 
            "review": "The guy who seemed like the owner of Ice Pan is a pretty high energy guy that got very excited about his product and absolutely makes you want to try it! The store is also located inside of Harrah's casino where I stayed.\n\nThe main kicker here is that they don't use any sugar, they make it right in front of you, and you can basically build your own treat!\n\nI got a regular strawberry ice cream with a complimentary birthday waffle cone and cheese cake for $6.97... not shabby, I guess... but what ISN'T expensive on the strip?? \n\nHowever, it is definitely a place you should try at least once when you're in the area!"
        }, 
        {
            "index": 297, 
            "rating": 5, 
            "review": "IcePan is SO delicious. Hit every spot and is not bad for you. Let me also just say that the gentleman working there today was SO nice. He explained how it all worked. He has amazing customer service skills. 5 stars for him!"
        }, 
        {
            "index": 298, 
            "rating": 5, 
            "review": "Really tastey and novel idea; takes about 2 minutes to make and is actually a fairly large serving, much larger then it looks in the pan. We had the strawberry with cheesecake and the peanut butter with cheesecake; both were very tastey."
        }, 
        {
            "index": 299, 
            "rating": 3, 
            "review": "I'll start off by saying that it's a great idea.  How many places make the ice cream right in front of you?! The staff that worked there was funny and friendly.  However the ice cream itself didn't match up to the viewing pleasure and staff.  We all found the ice cream to be kind of flavorless and one of us did not get what we had ordered.  Maybe it was the flavors we picked, but overall the ice cream seemed average.  Maybe sometime down the line I'll give it a second chance."
        }, 
        {
            "index": 300, 
            "rating": 4, 
            "review": "This place is awesome. Its worth visiting if youre in Vegas until August 30th of this year. Their license with Harrah's is not renewed so they wont be here forever. They are relocating to Buena Park in CA on Beach Blvd somewhere next year, 2017.\n\nI do not recall how much each ice cream costed but altogether it was over $20 for 3 ice cream. They have a metal pan where underneath, there is liquid nitrogen so they start with liquid mixture and they make it into ice cream creamy mixture on the metal pan.\n\nExpect to wait. There were about 7-8 people ahead of me so I waited what seem to be forever but I guess it was somewhat worth it. I never had ice cream with this chewy texture before anywhere. Making the ice cream this way requires not only time but some good strength too. Dont forget to tip the guys!! It's really hard not to when you see them work hard!"
        }, 
        {
            "index": 301, 
            "rating": 2, 
            "review": "The place is overpriced and the taste is underpriced. If your in Vegas and are constipated this is the right place for you!"
        }, 
        {
            "index": 302, 
            "rating": 5, 
            "review": "I was just flipping channels one night and landed on the Korean channel. I couldn't understand what was going on but they were doing a segment on Ice Pan. Just seeing how they actually make the ice cream from milk and sugar and other stuff was so unique that I needed to see it myself with my own eyes. I drove over to Harrahs and there was no line at all probably because it was raining and cold that day. It was really easy to order here and the lady actually made my ice cream really quickly. I can't believe how fast milk mixed with sugar turns into ice cream. The ice cream looked really good while still in it's early form. I began to drool because of that and also because the girl working there looked real good in her tiny white shorts. Overrall it was the perfect experience."
        }, 
        {
            "index": 303, 
            "rating": 5, 
            "review": "OMG.... Why is this not in LA ?! ); by they are coming to Buena Park soon for all my Cali friends (: \n\nThis is located on the second floor of Harrahs! Right next to the escalators ! The ice cream is made fresh with any types of milk you want ! (Even soy for my lactose intolerant friends!) \n\nMe and my boyfriends family decided to get mint chip, strawberry, and green tea. The Ice cream is amazing !!!!!! The workers really put their backs into it because the more you mix it the creamier it gets! You really can't go wrong with any combination here! \n\nBut what really tops it off for that fifth star is the service! Holy guacamole the ahjumma was the sweetest (; she gave us so much friendliness and she gave us so much stuff extra and charged us only one water bottle and gave us two :D she is the best!! (:"
        }, 
        {
            "index": 304, 
            "rating": 5, 
            "review": "Absolutely love this place. This ice cream is totally new, inventive, and unique. I also love how you can choose from so many flavors and also from different milk options. I went for the yogurt flavor, soy milk, and added chunks of mango and pineapple. Perfect treat. The people that work here are soooo nice and really understand customer service. I love how they chop up the fruit into your ice cream and mix the liquid until it solidifies. Its like eating a science experiment! The ONLY thing that is keeping me from coming back is the location. I\"m a local, and hate going on the strip let alone going inside the Harrahs. Its really unaccessible. The owner however did tell us that they were planning on moving inside the Rio within the next few years so I guess I'll just have to keep waiting longer."
        }, 
        {
            "index": 305, 
            "rating": 5, 
            "review": "I am SO ecstatic that my favorite ice cream shop is BACK!! =] ...not in Vegas, but I first went to Ice Pan in Redondo Beach about 4 years ago and they closed that location.\n\nI was recently creeping on Yelp when I saw that Ice Pan had a location in Vegas. It was a matter of hours before I found myself drooling before the menu. \nThe cute Asian women took my order. I ordered a combination of fruit, milk and toppings. As soon as I ordered she suggested I picked a different variation of flavors. I took her advice and boy oh boy am I glad!!\nNow, don't be fooled by her petite size. She chops, cuts and throws the blob of ice cream on the \"ice pan\" to mix and freeze the mixture. This in itself is a show that brought a crowd of people watching her. \n\nBut really, this is the best ice cream I have ever had. It's fresh, and the perfect amount of sweetness. The only way I could describe the amazing goodness is HEAVEN! \n\nI want to officially welcome Ice Pan to Las Vegas and will continue to visit and eat healthy and sweet."
        }, 
        {
            "index": 306, 
            "rating": 5, 
            "review": "Best I've cream I have ever tasted.  Entertaining to watch and a good value too."
        }, 
        {
            "index": 307, 
            "rating": 5, 
            "review": "Different 'ice cream'! This was a great experience and I loved watching the guy mix and make our orders! He was very friendly, explained the menu and was patience! I had the peanut butter with walnuts, Reese's, cheesecake and chocolate sauce and it was yummy although i could not taste the cheesecake. My mom had the pumpkin spice and she said it was underwhelming and too gooey! Will definitely try other flavors when we are back in town!"
        }, 
        {
            "index": 308, 
            "rating": 5, 
            "review": "I bookmarked Ice Pan right after my last trip to Vegas two years ago since I couldn't believe I missed this place when I passed thru Harrah's last time. Situated on the 2nd floor towards the monorail station of Harrah's Casino, immediately hang a left at the top of the stairs. (For reference, Harrah's is right across the street from Ceasar's Forum Shops and the Mirage.)\n\nIce Pan makes your ice cream or sorbet from scratch right in front your eyes. So it takes time. ALOT OF TIME. I was on vacation so I was all comme ci, comme ça about it. You get to watch all the ice cream \"action\" going on at the very least. So if you're pressed for time this is not the place for you. I waited almost half an hour JUST to place my order. Was it worth it? YES!\n\nFirst you pick a flavor, then you pick a base, and then your toppings and size. A small cup is around $6.\n\nI went the seasonal route and chose the green grape soymilk ice cream with no topping and although a recommended topping of strawberries was made I wanted it plain jane. I've never seen or heard of using fresh grapes in ice cream before and the idea of using it in ice cream didn't even occur to me.\n\nI saw about 1/3 cup of soymilk, & a cup of whole fresh green grapes go into my mixture.  They then take a hand blender to it before it's poured onto this below freezing ice pan where the base cream is mixed & whacked with extreme vigor until ta-da.......you get ice cream!\n\nGreen grape ice cream just sounded so unusual I had to try it. It was good! Top 10 good. It was so rich & creamy I couldn't believe it was made with soymilk. You get the taste of fresh grapes in every delicious bite. So refreshing. Felt healthy and sinful at the same time. One of life's many contradictions.\n\nIf you have dietary restrictions let them know and they are more than happy to make recommendations based on what your needs and likes are. That's pretty cool! I would definitely go back again and try something different."
        }, 
        {
            "index": 309, 
            "rating": 5, 
            "review": "My first time trying this place was last weekend, and I wish there was one near me because they would be getting a lot of my money! \nWe happened to walk by on our way to our car on Halloween and the owners were so cool! Mind you, it was midnight, but I guess in Vegas that's pretty early. Anyway, the man was so full of energy and so nice! He explained all the steps to us on how to choose the ice cream and let us know that everything was ALL NATURAL. No added sugars, or dyes. The fruit were real and not added flavors. My almost 2 year old daughter happened to wake up and he interacted with her and made her smile, which is hard to do when she sees a stranger after just waking up. He reassured me that their ice cream wasn't bad for her at all and it's the healthiest ice cream you could get. \nI ended up choosing green tea with Lychee and it was so good! My sister got green tea with Mochi and it was also delicious and my fiancé got mango with Mochi and chocolate syrup and he also enjoyed it. My daughter loved it as well. The man ended up giving her a king size Reece's candy bar(it's Halloween, remember?) and gave us 3 water bottles for the road. \nWe all recommend this place to anyone that wants a delicious treat in Vegas and will definitely be visiting this place the next time we are over there."
        }, 
        {
            "index": 310, 
            "rating": 5, 
            "review": "Im not the really a big fan of Ice Cream but Ice pan just took the cake.\n\nTheir ice cream is defitnitley one of the best ones out there. They have a on the spot made ice cream which isn't overly sweet but just the perfect taste of icecream.\n\n-The manager is really friendly pretty funny too.\n\nI got the green tea ice cream and it was just amazing we need more of these types of ice cream shops in L.A!"
        }, 
        {
            "index": 311, 
            "rating": 5, 
            "review": "Peanut butter with bananas! This is my most recent flavor discovery, and if you are an everyday fan of this combination, you will go cuckoo for it. I also feel like their serving size has gotten about 10% larger, which means more sweet goodness for you and me. It is still one of our favorite spots to bring out-of-towners."
        }, 
        {
            "index": 312, 
            "rating": 4, 
            "review": "Definitely a unique, yet straightforward concept to ice cream. There's something a little more fulfilling being able to custom order your dessert and having it prepared from scratch in front of you.\n\nIf you're arriving by car or monorail, it's actually really convenient to get to. It's a short walk from the parking deck and monorail station. The ordering process and flavors have already been well documented on this page. If you have further questions when you get there, the employees are very helpful. The manager/owner steals the show though. If he can't bring a smile to your face, I don't know who can. He was so accommodating that he gave everyone in line and in the seating area a  free bottle of water.\n\nMy whole milk chocolate without topping was smooth, creamy, and a good finale to the evening. My wife had the non fat mint chocolate chip which I had a taste of and was delicious. It was interesting though because the natural ice cream did not have the classic green color. Will definitely be back to try more flavors."
        }, 
        {
            "index": 313, 
            "rating": 4, 
            "review": "My boyfriend and I became the happiest people on earth when we came to this Ice Pan. Apparently, our nearest Ice Pan (located in Hollywood, CA) is closed down. So coming to this place made us very happy. \n\nService was o.k since their employee (I guess a new one) struggled with working with the machine. Also, their ice cream can be somewhat pricey. Hence, I gave it a 4/5 stars. \n\nI got myself a strawberry flavor with soy milk. Also topped with mochi and strawberry bits. \n\nOverall, it was delicious. :)"
        }, 
        {
            "index": 314, 
            "rating": 5, 
            "review": "Was a nice small place on second floor.  They make ice cream from scratch and mix our in front of you.  The owners are very out spoken and friendly.  I would recommend trying them out."
        }, 
        {
            "index": 315, 
            "rating": 5, 
            "review": "Best decision we've made on our Vegas trip! So fun-it's like watching art being made in front of you. And the staff are so sweet and genuinely care if you like your ice cream! And if not, they'll re-make it for you. It's the only location in the U.S., 2 others in Japan, so go check it out!"
        }, 
        {
            "index": 316, 
            "rating": 1, 
            "review": "Taste really BAD.... Maybe my expectation for a 4.5 star icecream shop was too high. It kills your appetite for real icecream.  Don't recommend for anyone who wants a good taste icecream."
        }, 
        {
            "index": 317, 
            "rating": 5, 
            "review": "Staff is high energy and polite. The shop is VERY clean! Everything was SO delicious we had to order more!! I hope this shop stays here for many years!! Delicious and good for you!!"
        }, 
        {
            "index": 318, 
            "rating": 4, 
            "review": "4.5!\n\nIce Pan, I walk from Aria to Harrah's in the heat and cold just for you! \n\nThis is my favorite dessert/ice cream place on the strip. I try to get Ice Pan whenever I'm in Vegas and will drag along any (un)willing family members with me. They were kind of hard to find my first time there since I'm not familiar with Harrah's and apologies for my horrible directions but I basically enter from the strip at the door closest to the southside of the strip by LINQ, walk on the pathway east through the casino and away from the strip, pass a small circular round-a-bout thing, until I see an escalator. Ice Pan is located right at the top of the escalator in Harrah's promenade area.\n\nI always get the matcha green tea flavor, whole milk, with mochi and strawberries mixed in. The green tea flavor is spot on and the whole milk makes my ice cream extra creamy. The service here really stands out! All the employees are happy to greet you, take your order, and offer any suggestions. I especially love the older korean guy(owner?). He's so happy and cheerful and really pounds away at that ice cream.\n\nIt's pretty amusing to watch the workers turn liquid into ice cream. They really abuse the ice cream with all that loud pounding, slapping, and beating. Some workers slap the ice cream around louder than others. I've seen other spectators waiting for their ice cream wince every time the ice cream got slapped back down so you've been warned! All the abuse the ice cream gets before consumption makes it more creamy and removes any air bubbles. Keep in mind they are making the ice cream from scratch so it does take some time and sometimes you have to wait a bit if there's a line. \n\nI think the way they make ice cream is a little gimmicky but regardless, they make great ice cream and the technique is pretty entertaining your first time here. I'd highly recommend this place if you're craving ice cream on the strip.\n\nPS to the owners: this is another gimmicky thing, but if you gave the option to make the ice cream into rolls like that thai ice cream roll video, I'm sure people would be willing to come try it."
        }, 
        {
            "index": 319, 
            "rating": 1, 
            "review": "Not a fan.  So, I came by here because it was highly rated.  It was fun watching the guy make the ice cream from scratch.  Unfortunately, I didn't read the pamphlet until AFTER I ate it.  Why do we need ice cream to help us with our gastrointestinal system?!!\n\nweirdest frickin idea ever."
        }, 
        {
            "index": 320, 
            "rating": 5, 
            "review": "As good as the hype. If you've ever had melona bars, the consistency is like that, it's great. Owner's the chillest guy on this side of the state; we fist bumped."
        }, 
        {
            "index": 321, 
            "rating": 3, 
            "review": "I mean...this place was aiyte.  It is a really cool concept but I wasn't amazed because I've seen so many videos on youtube and facebook about it that when I saw it I was like..oh yeah..this thing.  I went with a friend and I shared a small cup.  A small cup is about 2 scoops i would say.  I really wanted to try the fruit flavors..especially the green grape one..but my friend was into the chocolates and mint chip so we compromised on green tea.\n\nThe guy who made it for us was a newbie...he was so sweet and he was sweating trying to get the ice cream into the right consistency.  After 5 minutes he gave up apologized and got the more experienced worker.  I didn't mind that at all.  He was so nice and I felt bad for him.  Looks a lot harder to make than I though it would be.  You need to body slam it a couple times.\n\nWe got our ice cream and the first couple of bites were good.  The flavor is the same as other green tea ice creams, but the texture its different.  The ice cream is chewy and doesn't just melt in your mouth.  Maybe its because we got it with skim milk or something.  But I thought it was cool!  I liked it.  My friend didn't and after 5 bites she gave the rest to me.  I think its the flavor I got but I didn't really enjoy the last of it and just finished it because I don't like wasting food. \n\nThe concept is cool, a little pricier than normal ice cream but flavors are good.  Its a new thing and you should at least check this place out!"
        }, 
        {
            "index": 322, 
            "rating": 4, 
            "review": "Stumbled across Ice Pan on You tube, looked it up and wanted to try it since I was planning a trip to Vegas. The kid working the register was very noticeably new and had trouble taking our order. The lady who performed the making of our Ice Cream was great, she made it look like it was almost an art form to make it. It doesn't get any fresher. My wife got banana ice cream with choc chips and walnuts, they smashed half of a banana into it during the mixing, tasted amazing. I got the vanilla with Oreo and marshmallow, it was also really good, the pan is so cold it froze the marshmallow. A little pricey to eat everyday, $16 for two dishes, but for a birthday trip to Vegas it is a great treat. A little hard to find if walking in off the Strip, all the way to the back of Harrah's and upstairs."
        }, 
        {
            "index": 323, 
            "rating": 5, 
            "review": "When it comes to ice cream this is where its at. You can be as healthy or as fatty fatso as you want, but you will have one thing in common. Its has no chemicals and its completely fresh with the most minimal ingredients. This is a must try when in Vegas. We were told the only other location is in Japan. So bear the grossness of Harrah's and try it,"
        }, 
        {
            "index": 324, 
            "rating": 4, 
            "review": "Checked this place out on Yelp and decided to hit this spot up when I was in Vegas! \n\nThis place reminded me of Coldstone! However, you get to actually choose the ingredients you wish to make your ice cream out of. Soo maybe you can make it a bit healthier with the non fat milk! ;) Everything is in liquid form beforehand and they will magically whip it into an ice cream dessert on their famous ice pan! You get to choose your flavor and type of milk along with the fruits you would like incorporated. I chose their strawberry with mochi mixed in. The gentlemen was nice enough to add in strawberries for me for free! The dessert tasted more like a sorbet than frozen yogurt and it was very good! The fruits used were fresh which made the ice cream a bit tastier. \n\nI would highly recommend you come by and try this place out located in the Harrah's casino!"
        }, 
        {
            "index": 325, 
            "rating": 5, 
            "review": "Ice cream was great and watching them make it was super fun!!!  They were sooo nice and offered to re-make anything we didn't like.  Just fantastic!"
        }, 
        {
            "index": 326, 
            "rating": 3, 
            "review": "Mmmm, the coolest thing about this ice cream shop is that you can see your ice cream being made in front of you. Because everything is natural, it tastes healthier too... but eh, I'm not that big of a fan. I had the pistachio ice cream and I only recommend it if you like pistachio A LOT. And that's emphasizing the \"lot\". \n\nMy friend got the strawberry cheesecake too, and it lacked the usual creaminess of an ice cream. It tasted more like tart - so maybe it should be called \"Tart Pan\". But yea, I say just go for the first time experience, but I don't think I would go again. \n\nThe guy working behind the counter was really helpful though! We kept badgering him with questions about how this ice cream thing works, and he didn't seem at all annoyed with us."
        }, 
        {
            "index": 327, 
            "rating": 4, 
            "review": "Finally!!! We got to try Ice Pan! Their West Hollywood location closed so we were really looking forward to seeing them here!\n\nIce Pan is in Harrah's... it's almost one of the first eateries you see when you get out of self parking. \n\nYou pick a flavor, milk (soy, skim milk, low fat, whole milk), and toppings. Toppings are an extra 50cents each. They take the mix and then freeze it on their ice pan. You get to watch the process.\n\nI ordered a green tea with strawberry but one lady employee suggested I get blueberry instead. She tried all the mixes with green tea and said strawberry just wasn't that happening. OK. =) I appreciated she told me that and also liked that she loved what she made!\n\nHubby got coffee with mochi. Both were excellent and didn't have the heaviness that comes with most ice cream. In fact, the green tea is from organic green tea powder from Korea. Nice... =) They didn't skimp on the powder either so I had a nice dose of tea!"
        }, 
        {
            "index": 328, 
            "rating": 5, 
            "review": "We stayed at the Harrah's during Thanksgiving weekend.  I saw a sign for green grape ice cream and I had to try it.  Just walking past the place, I thought it was like a cold stone.  To my surprise it definitely was not!  What  a cool concept of making the ice cream when you order it.  Choose the type of milk and all the toppings.  There was only 1 person working when we got there, but the wait is totally worth it, in my opinion.  I wish there was a location by me."
        }, 
        {
            "index": 329, 
            "rating": 5, 
            "review": "Great, friendly service! The person working there was very helpful and nice. My husband and I both loved our ice creams (red bean with cheesecake and coffee with Oreos and chocolate syrup). The cones were great, too. Light and crispy. Definitely recommend this place!!"
        }, 
        {
            "index": 330, 
            "rating": 5, 
            "review": "Yes, the ice cream here is expensive, but some things are just worth it! Icepan has such a wide selection of bases - whole milk, 2% milk, skim, and soy - as well as flavors and toppings, but the best part if that everything is made from scratch right in front of you.\n\nI'm a vegan and got the most amazing soy green tea ice cream with mochi. I don't generally like soy ice cream, but I honestly wouldn't have been able to tell you that this was soy. I sat there with a stupid grin on my face the whole time I was eating it, saying, \"Mmmm this is so gooood.\""
        }, 
        {
            "index": 331, 
            "rating": 1, 
            "review": "Good if you want unsweetened fruit. , bad if you want ice cream. It's not sweet. I had it with bananas and strawberrys. .  Tasted bad to me made with whole milk. My friend  had it with soy milk and it tasted like fruit sorbet. His was better. I don't even like soy. My friend said they told him it had no sugar. \n     So it's different but it's not ice cream. My friend loved it. He's a vegetarian. I will never go back!"
        }, 
        {
            "index": 332, 
            "rating": 5, 
            "review": "I've seen this place here and I've always wanted to come but I wasn't sure about it. As a local I knew I would've had to try it eventually, and I can honestly say that I'm glad I did! \n\nThe ice cream was amazing! And it's healthy! I didn't catch the owners name but he was very friendly and very helpful. I had mint chocolate chip ice cream with whole milk and mochi and walnuts and it is excellent! \n\nI can honestly recommend this to anybody, and I will willingly drive to the strip to get me some more Icepan!!!!!!"
        }, 
        {
            "index": 333, 
            "rating": 3, 
            "review": "I would give it 5 stars if I ordered what my boyfriend got. The sorbets are really good! I recommend the watermelon base with strawberries (that's what he got). But what I got wasn't as good. I got the coffee base with whole milk and walnuts with caramel. It didn't taste like coffee (more like artificial coffee from a can). It was creamy, but that was it. I'm not giving it a terrible review cause my bfs was good, so I added the flavor I got just wasn't that good. It is also really entertaining to watch!"
        }, 
        {
            "index": 334, 
            "rating": 5, 
            "review": "I'm like a horse right now with blinders on because I am completely overlooking how much I spend for just a couple of small scoops of Strawberry Ice Cream with Oreo cookies, strawberries, and cheesecake bits mixed in. \n\nThree mix-ins may sound excessive and expensive, but I'll let my taste buds make the decisions for me over my wallet any day. Ok, maybe not. But it's my favorite thing to get at Ice Pan and I refuse to be frugal when it comes to my ice cream!\n\nHealthy ice cream no less... with SEA WEED in it! Sounds weird, right?\n\nNO, IT'S AMAZING."
        }, 
        {
            "index": 335, 
            "rating": 3, 
            "review": "Definitely a cool concept, but in terms of the ice cream quality, it was definitely not the best tasting ice cream I have ever had. Located inside Harrah's next to Starbucks, it was not difficult to find. We came out of the parking structure, and it was a small walk and we arrived to Ice Pan. \n\n\nIt may have been because I got 2% milk instead of whole milk, but I was not in love with the ice cream. But I got the green tea ice cream with mochi as the topping. There is only one size for the ice cream/sorbet. It runs about $6 and if you wanted a waffle cone or cup, it costs 75 cents more I believe. I think it costs like 50 cents extra per topping, so if you were to add multiple toppings, it can get expensive. \n\nThe girl who was making our ice cream was nice and was definitely working hard. I would only come try this place out if you were nearby, but I would not make a special trip out of the way to get this dessert."
        }
    ]
}