{
    "category": "Las-Vegas", 
    "entity": "Crown-&-Anchor-British-Pub", 
    "avg_rating_stars": 3.617391304347826, 
    "review_count": 345, 
    "reviews": [
        {
            "index": 1, 
            "rating": 2, 
            "review": "Don't try ordering a mixed drink at the bar their liquor license won't allow it unless you have food in front off you. Weird right?"
        }, 
        {
            "index": 2, 
            "rating": 1, 
            "review": "Disgusting. We met another couple there for drinks so thankfully my husband and I ate beforehand. About an hour in I saw a cockroach larger than the length of my thumb crawling on the ceiling. I'm talking a Florida sized roach. We had the waitress come take a look and she was like, \"oh, they just crawl back in wherever they came from.\" What?!? This apparently is just a normal occurrence there. It wound up crawling in a little hole near the wooden beams but poked its head out occasionally. And there were also two crickets that were crawling around the beams as well. We got our checks and got out of there.\n\nI would never eat in this establishment nor will I ever be back for drinks. Gross."
        }, 
        {
            "index": 3, 
            "rating": 5, 
            "review": "I don't want to sound like a zealot but this establishment should be in the best of Las Vegas.  It has character and it is fairly decently priced when it comes to Las Vegas as Vegas is pretty pricey in and around the Strip area, when it comes to food and drink. I have been to the Crown and Anchor Pub twice and I must say that I have enjoyed it both times. I had a beer there that I cannot place but it was bitter yet sweet and all in all terrific. One of the most important things about The Crown and Anchor is that it has an authenticity and feel that is lacking in most Las Vegas establishments. This alone makes it a good place to visit. As an addendum I would like to add that the chips served at The Crown and Anchor Bar are great. Also my friend and couldn't help commenting on the fact that our server was quite attractive. So there is eye candy at The Crown and Anchor as well."
        }, 
        {
            "index": 4, 
            "rating": 5, 
            "review": "So if you have read any of my other posts, I do have a bit of a soft spot for the bar. Well, this place has a bar. They even have this promotion going on where they give you a punch card and you get it punched once for every country you buy a pint from. After 30 punches you get a t-shirt. They neglected to tell me that it needn't be in one night. I am unsure if I got the t-shirt. \n\nI have been here several times other than that faithfull night. I have enjoyed breakfast, simple but solid english breakfast. Lunch and diner were top notch. The bangers and mashare at least as good as my usualpub on Maui. \n\nThe kicker is the waitstaff. They always make you feel like a regular. The service at either the tables, the patio, and the bar rivals some of the better establishments on the strip. The naughty schoolgirl thing never hurts either.\n\nGo early in the morning, order a red eye with draught Boddingtons never fails to start the day off right."
        }, 
        {
            "index": 5, 
            "rating": 4, 
            "review": "Best fish and chips I've eaten. The service was spotty. The place is in a real need for a makeover."
        }, 
        {
            "index": 6, 
            "rating": 2, 
            "review": "Stopped by for lunch. It is a small pub. Didn't feel very clean & the chairs had rips in them, the server was working her ass off, she had a huge table she was working on plus us and a few others tables. The wait could have been better. I ordered a coke, it was flat. I ordered the British Burger which I have to say was delicious. Very flavorful & filling. My friend got the pulled pork sliders and she loved them as well. In closing, food is good, service could be better & the dining room could use a little sprucing up."
        }, 
        {
            "index": 7, 
            "rating": 5, 
            "review": "Boddingtons on tap! And a bunch of other tasty beers, but BODDINGTONS ON TAP, people. Also a big fan of the fish & chips and the sausage roll. I've never been to England (except via a layover at Heathrow), so no clue if the food's 'authentic', but I love meeting up with friends here."
        }, 
        {
            "index": 8, 
            "rating": 5, 
            "review": "Another bar in Vegas..?  No big deal.\nThe BEST bar in Vegas... Now that's saying something!\nI learned of the C&A when I lived in Vegas several years ago and it quickly became my \"let's meet here\" place.\n\nThey've got a huge selection of beer and cyder on tap.  A great menu, darts and patio dining.  The uni's the waitresses wear are pretty hot too!  But the best part (IMHO) is they play ESPN World on the several TVs scattered around.  Rugby, soccer, Aussie rules football... none of that candy ass baseball they play in most \"sports bars\".\n\nIf you go to Vegas, stop in at the C&A, you won't be disappointed"
        }, 
        {
            "index": 9, 
            "rating": 3, 
            "review": "Crown & Anchor is nice for a good beer and bar food. Apparently friends of mine like their fish and chips, but I do not eat fish, so I cannot tell you from experience. The potato skins though are pretty good.\n\nThey have a wide variety of beers to choose from, as well as hard liquor. However, you have to remember that you cannot order hard liquor at the bar, only beer. I prefer a Smithwicks, but next time I go in, I want to try something different. That is what I like about variety, so many choices, which means so many reasons to go back! \n\nThey really do not have a daily happy hour, but they have theme nights. Like Thursday is Pub Quiz, you answer ten questions and the winner wins like a $50 bar tab or something along those lines. Our team did not win last night, bummer. They also have $1 draft Sundays at night. \n\nIt is a cool place, nothing extraordinary though. Our waitress was hot, but she was a ditz for sure. She forgot all our orders at one point in time and kept forgetting to place them. I guess it has its days of being cool and \nlame. It is also awkward when your philosophy professor just so happens to be getting drunk in the same place you are. Got to love this place for the attraction of UNLV faculty."
        }, 
        {
            "index": 10, 
            "rating": 2, 
            "review": "And again. Stopped by. While on a cycling route. Great patio where I could look after my bike. Service was sub-par. Cocktail waitress was not to be found. Went inside stood at the desk and waited a long time. I was about to give up when the bartender acknowledged me. I then noticed the cocktail waitress was in deep conversation with someone at the bar while I waited. The beef dip was plain. Light in protein. The au-jus was good but too salty. The chips were good. I'll stick with my initial impression. I'll avoid it unless out for a good beer."
        }, 
        {
            "index": 11, 
            "rating": 5, 
            "review": "The bartenders are all easy to talk to, and they treat you right. The beer selection is pretty great, and the food is as well. They show Premier League and MLS matches as well as other American leagues. The atmosphere is what really gets me to come in, and everyone is friendly, even the customers. I highly recommend this for anyone looking for an authentic pub atmosphere."
        }, 
        {
            "index": 12, 
            "rating": 5, 
            "review": "My wife and I were on vaca in Vegas and after touring the atomic testing museum we wanted to eat somewhere not in a casino nav system in car offered this place way to go my wife loved the fish and chips and my steak and kidney pie was great but best of all was chocolate bread pudding server was busy but friendly and attentive wish it wasn't a 5 hour flight to come back"
        }, 
        {
            "index": 13, 
            "rating": 4, 
            "review": "I really love this place! It's not your fancy shmancy martini glass bar. It's a beer and darts kind of place with surprisingly really good food! The bartenders and servers we have had are all friendly. \n\nCrown & Anchor is located down the street from UNLV. The outside is well lit and easy to find. At the bar, you can only order beer. The pool table and darts are also located on the bar side. But in the separate dining area, you can order food and spirits. This is due to their grandfathered liquor license. Not a big deal for me, but it just sucks when your party is eating in the dining area, everyone has to migrate over to the other side if they want to play darts. They also have karaoke on Wednesday nights. If it wasn't for the place being a little smokey, this would have gotten 5 stars from me.\n\nAs for the food, everything we have tried has been delicious. My favorite thing so far has been the fish and chips. The fish is flaky and moist with a nice crunchy breading. The French fries are hot and crispy. And you know how I know the food is good here? I usually hate peas, like literally hate peas. The fish and chips come with a side of peas and they are freaking delicious! They aren't mushy at all. I ate the whole bowl. \n\nIf you're looking for a chill place to have drink and eat, you should definitely check it out."
        }, 
        {
            "index": 14, 
            "rating": 5, 
            "review": "There seems to be some kind of misconception, I believe, that British food is \"bland,\" or otherwise lacking in flavor.  While that may be true in the UK, it certainly isn't the case, here.\n\nI don't get over to this place as much as I would like, and that's MY loss, because every time I dine here, I'm never disappointed.  In fact, a fraternal/social group to which I belong, used to meet here every Friday night, about 10+ years ago.  We had most of the upstairs section to ourselves.\n\nI can recommend almost everything on the menu, as at one time or another, I've sampled most of the fare offered.  I treated a total of 5 of my good friends there on June 13, 2012, and the total price for all 6 of us was under $100, so their charges are certainly reasonable.\n\nBut best of all, if I may be permtted a totally MALE observation, I definitely noticed the delightfully (and incredibly) SHORT Scottish kilts being worn by the female servers.\n\nNo joking guys, they all have LEGS TO DIE FOR."
        }, 
        {
            "index": 15, 
            "rating": 2, 
            "review": "Was not impressed at all.  The female bartender was nice but the male bartender was a dick.  I ordered a sandwich from the female bartender and 2 minutes later I hear the male bartender talking shit about what I ordered to other guys sitting at the bar (who he didn't seem to be friends with, and for the record, what business is it of theirs?).\n\nThen he came over and said something about ordering the same thing his grandmother ate.  Wow, your g-ma eats chicken too?  What are the odds?\n\nI went here because I was looking to watch a soccer game and another bar by my house recommened it.  \n\nI need to find a different soccer friendly bar somewhere in this city because I will not return here."
        }, 
        {
            "index": 16, 
            "rating": 1, 
            "review": "Cute atmosphere, horrible service. We sat down at a table and waited 25 minutes. We were never acknowledged even though the waitress sat down at the table next to us and had a conversation with the party. She came and went at least 3 times and never stopped to ask if we had been helped."
        }, 
        {
            "index": 17, 
            "rating": 1, 
            "review": "We were sat & waited for an eternity it seemed like just to place our food order. \nFood server took our drink order & we waited again to give her our food order because she was overwhelmed. \nWe ordered the beef & mushroom pie,\nFish & chips,\nChicken cordon Bleu,\nPotato skins,\nChicken wings &\nA side salad. \nThe potato skins were tasty but super soft and limp. \nThe chicken fingers? We didn't order fingers.  WINGS!\nThe pie was delicious but very small, almost like a kids plate for almost $13.00?!?!?\nThe chicken cordon Bleu was dry to the point that my son had to add Tabasco to moisten it. \nThe fish & chips was ONE giant & tasty piece of fish. The batter got smooshie  under it. \nThe wings finally came out and they were heavily battered to the point that it hurt to bite through them. \nWe felt like our food server had no urgency to try and at least give us the proper attention without delay. \nWe still tipped them 20% no matter what, but we probably not be going back again. \nWe are being 100% honest & we hope this review helps you guys out. \n\n[like my wife said: \"the food server was probably having a bad night\"]\nI hope our generosity helped her out :/"
        }, 
        {
            "index": 18, 
            "rating": 4, 
            "review": "Sunday was my first visit to big crown. I have been to little crown on spring mt a few times, and never had a bad experience. A couple buddies and me sat at the bar and the bartender came over and informed us that sunday was 1$ PBR night. Well I was looking forward to a Stella or a Bass, but dam, 1 dollar pbr. So I had a couple of those, we also had some of the homemade potato chips and an order of wings.  The potato chips were really thin and broke easily in the curry which could of had a little more flavor.  The wings were decent, kind of your average bar wings. I'd have to give a low rating on the food, but honestly we only tried those two things and nothing off their traditional menu. I will definitely be back to try those becuase the bartender was really nice. He got our orders right, engaged in a bit of small talk, was able to answer questions I had about their happy hour and offered a sample of Bombadier when I asked what kind of beer it was, having never seen it before. \n\nThe decor is pretty standard, pictures and UK beer decals. They have a little cove for darts and what sounded like a billards table upstairs. They have a board with all their sports offerings, and special events like karaoke and trivia.  So I will definitely be back for some pints, hopefully of something better next time, but cmon 1 dollar is 1 dollar, amirite?"
        }, 
        {
            "index": 19, 
            "rating": 3, 
            "review": "Decent draft selection. Nice \"real\" place off the strip. Great place to get out of the sun and enjoy a few pints in the afternoon."
        }, 
        {
            "index": 20, 
            "rating": 5, 
            "review": "Stopped in for a quick meeting and a bottle of the bubbly. Yet again, A Home Run! Great service and the place I recommend my clients to experience after they are done with the strip and the high prices for drinks. Easy place to drive in and park and right around the corner from the Thomas & Mack."
        }, 
        {
            "index": 21, 
            "rating": 4, 
            "review": "This Las Vegas favorite dive bar will always be a comfy place to plop down for a lunch or a beer. They have what seems like a million beers on tap, and they always have a soccer game playing which means that all British and Europeans that live here, are usually jammed into this place. Sit out on the patio with friends and a drink and your bound to feel like your sitting in London. I hope it stays in Vegas for a long long time."
        }, 
        {
            "index": 22, 
            "rating": 4, 
            "review": "The food is outstanding, and the selection of beers is even better.  I've spent many interesting nights here, and always love coming back.  Just watch out for the bagpipes and college students..."
        }, 
        {
            "index": 23, 
            "rating": 3, 
            "review": "The only factor that makes this dive a three for me is that it is a soccer bar. The food is woeful (there is a reason British food is difficult to find: it is terrible), the atmosphere is the definition of dank, it is not comfortable, the service is indifferent, and it should be cheaper for the dive that it is. But it has soccer and a lovely beer selection."
        }, 
        {
            "index": 24, 
            "rating": 4, 
            "review": "Somehow an English pub wound up in the \"slums\" (I'm told) of Vegas (I live in the slums of Hollywood, which makes the neighborhood where the Crown and Anchor is look like Beverly Hills). But anyway.  I met an old friend here who is now a beer expert and he introduced me to some simply incredible stuff (Delerium Tremens and Young's Double Chocolate Stout). I'm now working on a script that's like Sideways, but it's in Vegas and the characters are beer instead of wine-obsessed.  It's a buddy pic where friend become enemies, enemies become friends. Got a compelling protagonist... an obstacle for him to overcome."
        }, 
        {
            "index": 25, 
            "rating": 1, 
            "review": "I always go to this bar when in Vegas during the soccer season but only because it has the monopoly on soccer pubs in the city.  The lack of competition has lead to complacency and piss-taking on the cover charge for games.  My gripe recently is that my brother and I paid 20 bucks each to watch a game televised on Fox Soccer Channel (basic cable) when we could have watched in any other sports bar for free.\nI've been to games there with the atmosphere rocking, but for the UEFA Cup Final it was only half busy and left me wondering how they justify taking 20 bucks off customers when the average patron will also drop a reasonable amount behind the bar and on food."
        }, 
        {
            "index": 26, 
            "rating": 4, 
            "review": "This is a great spot with lots to offer and good, traditional food and beer. Personally, the beer cocktails tend to have my heart here. And let's not forget about the classic fish and chips. The chicken fingers are pretty tasty too. And if you're into meat pies, there are some good ones here. \n\nThe service is always friendly and fairly attentive. Parking can be tight when it's crowded. The bar area is nice. The restaurant area is ho-hum, but not cramped.\n\nThey have karaoke one night of the week, trivia one night of the week, etc. So there's always something going on here. While close to UNLV, it's definitely not too much of a college crowd.\n\nI tend to be here more often for lunch than anything else. Lunch here is fab as it's usually practically empty.\n\nAll in all, probably the best British pub in Vegas."
        }, 
        {
            "index": 27, 
            "rating": 1, 
            "review": "Grated cheese on a 7 dollar ceaser do no croutons made me long for the time on the rack.  Sorry this is not a hard salad to make and it has just a tiny number of ingredients if you can't get that right I don't think I will be back.\n\n\nRichard it was about two weeks ago."
        }, 
        {
            "index": 28, 
            "rating": 4, 
            "review": "Best \"British\" food in Vegas. I was so surprised that there was not a big crowd. The food was great. Monday night is \"all you can eat\" fish. There was some British guys at the table next to ours and it was awesome to talk about the UK and where we are from. The waitresses kept our plates full and drinks refilled. I will be back for sure."
        }, 
        {
            "index": 29, 
            "rating": 2, 
            "review": "Holy ass-cheeks, batman! If I wanted a show, I'd go to the strip club. I don't need to know what kind of underwear you are obviously not wearing. Service with a flash, but definitely not IN a flash, waiting 5 minutes and still not even taking a drink order? \n\nI'm sure my husband (along with all the others) really don't mind the show, and honestly, I'm not totally offended, its just not necessary. Showing my husband and I your cooch won't get you better tips, wrong venue for this. Even if I had the body for it, I would never be willing to wear their \"uniform\". \n\nI've been here before and noticed the skirts were low, dut I don't remember seeing so much butt flesh. Maybe I just wasn't paying as much attention?\n\nBoth the hubs and I ordered the fish and chips. We didn't notice until after our meal that Monday's (when we went) are all you can eat fish and chips. I guess that's why the server asked if we'd like another order of fish, but it wasn't made clear that it was a special. Partly our bad for not checking the specials, but also poor service for not informing your customers of the special. \n\nI wasn't overly impressed. The steak fries were decent, though not cooked enough for me. I like a little bit of crunch in my fries, not a mouth full of mush. I guess they thought they'd make up for it in my fish? My first piece of fish was SOOOOO overcooked that there was no resemblance of actual fish in about half of the piece. All the meat was so crispy, I seriously thought it was all breading - until I took a closer look. I could have complained and asked for another piece of fish... had we had anything that resembled service. \n\nI guess I would probably go back sometime to see if anything has changed (I enjoyed the chicken curry the last time I was there - ages ago)... but it's not high on my list of places to spend my hard earned money."
        }, 
        {
            "index": 30, 
            "rating": 5, 
            "review": "Came in for the graveyard special the chips are amazing Burger was delicious and juicy. Jason and our bartender was awesome he helped us out in understanding some of the menu. Customers are very friendly I highly recommend this place."
        }, 
        {
            "index": 31, 
            "rating": 4, 
            "review": "Okay.  So my wife and I pull into the auto glass repair shop to get my driver's side window replaced (some &*^%&# broke it and stole about $600 of stuff from my car).  While waiting, we started looking for a place to eat and found this place.\n\nCrown and Anchor is an AUTHENTIC English pub, right down to the kidney pie and the smoky atmosphere.  It was great comfort food--at that time we needed some comfort and this place served up some great food and drink.  We could have done without the smokiness, but that was a small price to pay for a good meal.  Highly recommended."
        }, 
        {
            "index": 32, 
            "rating": 4, 
            "review": "I made my first, but hopefully not last, stop into the C&A Wednesday week whilst on business in LV.\n\nIt can be difficult at times in a big city to find local hangouts, however I fortunately have a UK mate living here who had already sussed the place out and found it up to his British pub standards. Better yet, as I was staying at the Embassy Suites by UNLV I could easily stroll over and avoid driving.\n\nThe C&R is basically everything you want in a local pub with an excellent pub atmosphere, a great selection of beers, imported and domestic and a decent pub menu. My friend went for the curry on chips and I played it safe w/ a curry on rice. Although the curry is not quite London or Adelaide fare, none-the-less the dish was more than adequate (I settled for chicken as lamb or seafood were not available), all things considered. \n\nI would also prefer to have optionally mild, medium, hot or flaming arse curries served rather than the rather less than mild version served. Additionally a variety of curries such as seafood, lamb and veggie would be a nice touch.\n\nWith UNLV so close by a curry night would not be out of the question. I was present for an Adelaide pub's (The Exeter) introduction of curry night in 2000, c.f. http://adelaide.citysearch.com.au/restaurants/viewContent/1119945819643/1137463277210, an event that remains wildly popular to this day.\n\nNot to complain though, all-in-all a great evening of British pints, curry and chit chat. I shall be back."
        }, 
        {
            "index": 33, 
            "rating": 5, 
            "review": "My parents took us out for great fish and chips when I was a kid, for the past 40 years I've tried everywhere to find good fish and chips and am always sorely disappointed (my partner is under orders to stop me from ordering fish and chips because it's usually so bad).\n\nFINALLY!  The Fish & Chips at the Crown & Anchor are better than my childhood memories!  The food was so good, I actually ate peas - and enjoyed it.  This place is fantastic.\n\nEverything was great, real food and dog friendly on the patio,\n\nWhat more could you want, I've found happiness."
        }, 
        {
            "index": 34, 
            "rating": 5, 
            "review": "When you are looking for a true pub- this is it!  In Las Vegas, if you get here, you are out of the tourist scene. Things slow down here, the food is good, the beer and scotch list extensive. It's just a down home pub that serves good food."
        }, 
        {
            "index": 35, 
            "rating": 1, 
            "review": "Absolutely the worst place I've been. No one was friendly, the stole money from me and I was sitting at the bar for a good 20 minutes before anyone even asked if I wanted a drink, which you're not allowed to walk around with liquor, only beer. I will never go to this place ever again."
        }, 
        {
            "index": 36, 
            "rating": 4, 
            "review": "I've been coming here off and on for the last six years. On my 21st this was the second stop on my drinking around the university tour. I got to witness a hilarious argument in which a biologist had a drink thrown in his face by a mean drunk lady. \n\nIf you like to watch football (soccer), this is the place to be. They do have a cover charge on occasion; I guess that is for pay per view games or something.\n\nOn those occasions when I'm a crappy vegetarian and eat fish (I admit it), the fish and chips here are the best I've had in Las Vegas."
        }, 
        {
            "index": 37, 
            "rating": 2, 
            "review": "I have friends that swear by this place, but it is not the place for me. I enjoy a good beer on tap, or a strong mix drink, but there are many places down Maryland that will offer me that. The food is ok, but nothing to rave about. The fish and chips are a crowd favorite, especially during nights when they do the AYCE. I have tried it once and can only do one plate because it is oil laden. I understand that you cannot expect fried food to be grease free, but a good batter and proper prep should leave you with minimum saturation. The generous pieces of flaky fish are moist and flavorful. After stripping the batter, the meal was more enjoyable. The lightly breaded chicken strips are great since I am not a fan of a thick coating. Nothing kills a good strip more than biting into a strip and getting predominantly breading.\n\nThe staff has always been friendly and attentive. Sometimes the male bartender would overlook me for female patrons, but it is not a big deal."
        }, 
        {
            "index": 38, 
            "rating": 3, 
            "review": "Final night in Vegas, my friend took me somewhere on the way from BINGO to the strip.  This was the place she chose, as we were NOT going to eat on the Strip another time.  \n\nWe stopped at Crown & Anchor.  First of all, let me say that I was impressed with the decor.  Being that I have been in London, it was pretty \"accurate\" with the Pub vibe.\n\nService was A BIT SLOW, and they were NOT that busy.  However, this seems to be a recurring factor in Vegas.  No one seems to move.  Maybe it is just that I am from the NYC area and like things promptly.\n\nWe all ordered salads.  The salads, I must say, are pretty dang tasty for rabbit food.  I was really impressed with it.  The chicken was cooked to perfection and the english dressing was fantabulous.  Prices were NOT that bad.\n\nI would definitely recommend this place, if you have some time to kill & are NOT in a rush to get in, grab something to eat, and run."
        }, 
        {
            "index": 39, 
            "rating": 4, 
            "review": "Great beers, good food and fun environment. If you haven't been to the Crown you're missing out!"
        }, 
        {
            "index": 40, 
            "rating": 5, 
            "review": "They are sooooo good! They were friendly, out waitress and the bartenders were nice, and they have really good veggie burgers! (Something I was hoping they would have)"
        }, 
        {
            "index": 41, 
            "rating": 4, 
            "review": "While I doubt I will find another bar that will best my beloved Frankie's, I will let you know that Crown and Anchor comes close.\n\nFrom the cozy pub atmosphere to the selection of drafts available, this is a great place to have a date, hang out with a group of friends, or just chill by yourself.  You can even sit out on the patio and bring your pup!  \n\nThere are 30 beers and ciders on tap and the majority of the selection is great. *Cough cough Miller cough*  Sorry, excuse me.  My personal favorite is Blackthorn Cider.  If you're feeling adventurous you can ask them about their \"Down the Hatch\" club. (Hint: you get a prize for trying all the drafts.  I've got 29 more to go).  \n\nThe seats at the bar fill quickly, but there are some tables nearby.  The smoke isn't too bad, but then again, I haven't been there when it's really crowded.  Please don't hate me if you inhale a pack of cigarettes on a Friday night.  And while the bartenders are attentive, they aren't super friendly.  I'm going to go ahead and say it's because they are uncomfortable in the ridiculous outfits they have to wear.\n\nYou can order from the menu at the bar which might be a good idea if you plan on having more than a couple pints.  Being British food it's not vegetarian friendly, so keep that in mind, my veg friends.  My husband has ordered the Chip Butty which is literally a French fry sandwich.  He likes it and I like to pick at his leftover chips.  They do offer a veggie burger but I just don't feel right eating it in a pub.  For the non-vegetarians, expect Fish and Chips, Bangers and Mash, and various meat pies.\n\nPlease be aware that they have lots of rules about what kind of alcohol you can drink at the bar/restaurant/patio.  \n\nDefinitely a fun place to stop for a drink!  And it's right next to Pinball Hall of Fame- bonus!\n\nNikki Jo's Ladies Restroom Review:\nWhile it's clean, I don't like this restroom due to the creep-factor.  They leave the window open (I'm guessing for circulation) but it opens up right next to the employee outdoor break area.  I didn't have luck closing it but that's probably more due to the fact that I was a spazz and had a couple ciders already.  Instead, I covered it up as best as I could with my purse.  Regardless of whether or not it's closed, there is only a lace curtain covering the window ready for any perv to look through.  Not cool."
        }, 
        {
            "index": 42, 
            "rating": 2, 
            "review": "After a delicious sushi dinner at Sakana down the street my friend and I decided to stop in for a beer. I'm not sure if our bartender was having a bad day or if I smelled (hopefully I didn't smell since I showered and put deodorant on before going out!) but when my friend asked what was on draft our bartender all but threw the menu down. Yes the beer names were on the tap handles but we were sitting far away and couldn't see! Sorry? I didn't have a stopwatch going but it took him a little while to come back to us. After we got our beer he went back to munching on the plate of food he had. Never asked us if we wanted food (thankfully we had come from dinner) or if there was anything else he could get us. If you walked up to him and asked him how we were doing or what brought us in, he literally couldn't tell you because he never asked. I understand that you get hungry in the middle of your shift but eat in the back on your break, not out on the floor in front of customers. Eating out on the floor doesn't look professional at all and I'm not sure if he washed his hands after eating which is why I didn't order another beer. Once our bartender was done with his food is when he started schmoozing with what seemed like his regulars. Which was fine. But in order for a business to succeed you need many paying customers, not just a couple regulars. Overall the guy working behind the bar was a good drink pour and delivery guy, but he wasn't being a bartender. When the graveyard bartender came in is when my friend decided to order another beer. \nOverall, I have very little tolerance for bad customer service, especially since I work in guest services at a hotel on the strip. Will I return? I'm on the fence. \nI gave 2 stars, 1 for my beer being nice and cold and 1 for the graveyard bartender (usually I catch names but it slipped my mind tonight!) who seemed to have a significantly better attitude. Will I return? Maybe but if the same bartender is working when I walk in I will be walking right out. I don't want to feel like an inconvenience and that's how my friend and I felt tonight."
        }, 
        {
            "index": 43, 
            "rating": 4, 
            "review": "You'd think I'd come to a pub and order fish and chips, right? Wrong! I ordered a delicious chicken curry and my date had chicken strips. When we entered, we were not greeted and after waiting for ten mins, I reached over the counter, grabbed two menus and we seated ourselves. After we sat down, a waitress noticed us and came over, took our drink orders and then checked back with us to get our food orders. Drinks came out about fifteen minutes before the food and when the food arrived it was piping hot and delicious. Place is a little dark (it's a bar), and most of the patrons stand around drinking and talking like some bar scene from a cheesy sitcom, but all in all, a great place for late night Eats."
        }, 
        {
            "index": 44, 
            "rating": 2, 
            "review": "I came here last night around 8:30 with my boyfriend to get something to eat. We were greeted and then chose a spot nearby to sit and right away we saw a cricket nearby our table. I didn't mind it, and neither did my boyfriend. We sat down and ordered our drinks and food. My boyfriend mentions how he saw a roach crawling up the stairwell. I got gross out at the thought of it but shrugged it off. \n\nAs we continued to wait, I felt something land on my right shoulder and my immediate reaction was to quickly brush it off. I asked my boyfriend if it was a roach and the look on his face answered my question. \n\nThe roach fell from the ceiling and landed on my shoulder! Either it came from upstairs or was crawling on the ceiling, I don't know for sure. We moved to a different table and the waitress brought our drinks and asked if we saw another cricket, we told her what happened and she looked horrified. She apologized and told us that they spray the place once every two weeks. I told her it was okay. When she left I saw two more roaches. One crawling on the wall behind my boyfriend and one underneath the table next to us, barely alive. \n\nMy boyfriend and I decided to leave, we didn't feel comfortable eating there anymore. We asked if we could just pay for the drinks instead. She understood and asked if we would like our food to go but we said \"No thank you.\" She said we didn't have to pay for the drinks. She was very kind to us. \n\nI suggest you don't come in during summer time. \n\nI'll probably just come here during any other time of the season."
        }, 
        {
            "index": 45, 
            "rating": 3, 
            "review": "Cool sports hang-out place for those near UNLV. Before Yardhouse and Freakin' Frogs, you came here for your beers. Hell, you can still come here for your beers. I want to say they have 60 beers on tap that you can try. They give you a special card too, that they punch for you every time you try a new beer. If you get through all of them, they give you a prize. I don't know what the prize is, since I don't know anyone who has made it through all the beers. \n\nIts a fun looking place too. It looks like a small cottage from the outside, but its a fun place clean place on the inside. It isn't a dive bar by no means. I have never been to an authentic British pub, but I could imagine that they look like the Crown & Anchor.."
        }, 
        {
            "index": 46, 
            "rating": 3, 
            "review": "Fun bar my local Vegas friends took me to away from the Strip. It was great to go away from the hustle, bustle and tourism and come here. I didn't hear a lick of British while I was here though. Maybe next time.\n\nService was unbearably slow, although my friends assured me this usually isn't the case so I'll take their word for it.\n\nFor both food and beer, the portions are giant. You definitely get your money's worth. I liked the variety of British food, but just wanted some chicken wings. Like I said, huge portion size and number. I had a good 8-9 wings. I was a little disappointed that the sauce came on the side, although it was just hot sauce (and also ranch).\n\nThe crowd was lively for a Thursday night, although the television audio wasn't on (because it was college basketball?)"
        }, 
        {
            "index": 47, 
            "rating": 4, 
            "review": "The service is usually terrible, but it's such a fun place. They have real cork dart boards and great beer on tap. Go Monday for the all you can eat fish and chips."
        }, 
        {
            "index": 48, 
            "rating": 2, 
            "review": "Meh... It's really dark so it makes me suspicious of the food. I remember liking this place... but perhaps I was just drunk. Went there today with some friends to eat dinner and shoot some darts. No flights on any of the darts... so bring your own. The food was too greasy, too much cumin spice and the potatoes where cold, gravy tasted like brown envelope gravy and the peas where cold. I really wish they had good food because I really like the pasties crust. The severs are nice, but the wait time for food was long. Probably not going to come here again. Going to find a better pub for pasties."
        }, 
        {
            "index": 49, 
            "rating": 1, 
            "review": "I LITERALLY almost cried of anger after leaving this place the last time I was here. Mind you, it was sometime ago but I pray to the almighty savior of the universe that the bartender who \"assisted\" us no longer works here. Tall, dirty blonde, blue eyed a**hole was our bartender. Didn't catch his name, was literally too shocked to think. Let's just say I've NEVER not tipped EVER. I work in this industry, I know we all live off of tipping but it's called tip service for a reason & there was none to be had here. I grew up in Vegas: I was always taught that if you're a gamer & you're gaming quite a bit at least a few comped drinks (in this case beer cause they don't serve liquor @ the bar) is pretty standard. Nope! Not to tall, dirty blonde, blue eyed a**hole. He told me \"I decide what gets comped!!\" with his finger pointed @ my face after I simply asked why he had charged ME for my best friends drinks when she was playing. My night ended @ PT's sad to say. Never again Crown & Anchor."
        }, 
        {
            "index": 50, 
            "rating": 4, 
            "review": "Its a great pub themed bar with really good food. They are local friendly. I'd recommend it."
        }, 
        {
            "index": 51, 
            "rating": 4, 
            "review": "Pretty good English Style pub. Nice beer selection and they actually have a variety of British Pub food, not just Fish and Chips, but Bangers and Mash, Scotch Eggs, plus a variety of meat pies. Food is good, tasty, the pies are very good, nice gravy, flakey crust. They have a dog friendly patio, although most of the time of year it's either way too damn hot or way too damn cold and windy to sit on it. A big plus to the waitresses, they are all dressed in little plaid skirts and have English accents...very cool."
        }, 
        {
            "index": 52, 
            "rating": 3, 
            "review": "For my first English pub, this was a good cherry popper. The service was decent and friendly. \nThe place is small but, good for groups. \nI ordered the chicken and leek pie. I was craving a flaky meal and that's what I got. IT was delicious! However, the chicken inside tasted very much like it was from a can. Also, the mashed potatoes tasted boxed. \nI probably won't order the pie again, but, the potato skins and Scottish egg will be something I will revisit."
        }, 
        {
            "index": 53, 
            "rating": 5, 
            "review": "They have two locations that I know of. This one is by UNLV and the other is in China Town (I haven't gone to that one yet).\n\nI love coming here for fish & chips. The slice of cod is huge and it comes with a side of fries and peas. If you're like me and don't like peas, you can have them get you some extra fries instead at no extra charge. The fish is not overly battered, I love the batter though, so I would love to have more of it, but the fish more than makes up for it. \n\nI've also had their chicken tenders, which is your average chicken tenders, but they're pretty good. They're the typical ones you find in the frozen section of your grocery store. At least to me that's what they taste like. \n\nI always get a pint a beer with whatever I'm ordering, unless it's the middle of the day, but I'm here usually at night. \n\nIt's a very friendly environment and they have several draft beers and also some bottled ones. This one is close to UNLV and since I'm always at UNLV this is the place I go to when I want some good dinner and a beer nearby before heading home. It's not quiet or loud, but has this nice vibe to it, at least to me. It is a bit dark inside but it gives you the feeling of a real pub."
        }, 
        {
            "index": 54, 
            "rating": 5, 
            "review": "This pub is a Vegas classic. I remember my dad telling me stories when he attended UNLV, and now I have found myself creating my own memories here. Don't come for the food, come here for the drinks. They have so many beers on tap, they have made it into a game. If you decide you want to keep coming back (because you won't finish all in one sitting) then ask for a beer card. There are approximately thirty beers on the card, and you get a stamp for every one you try. The only stipulation is that you cannot try a beer twice. It has to be thirty different beers. I made the mistake of mixing light ales with dark lagers with who knows what else one night to try to fill up my card, and it ended in, well, a mess, if you will. Anyway, it is such a fun place to be (we chose Tuesday nights for our weekly get together) and after dining hours settle, it gets a bit louder, and livelier. Crown and Anchor is the best place around UNLV for groups to get together in a casual atmosphere for fun conversations and drinking. Be careful though. You can get tipsy pretty fast, and nobody wants an accident to happen. We always designate a driver (which always seems to be the party pooper since they cant join in on the debauchery, hehe) and the police always seem to be about. Crown and Anchor is so much fun, but have good fun, be safe!\n\nRecommended drink: The beers on the card. Have your server recommend an order, don't just choose or you will end up in the bathroom all night!\n\nRecommended company: Because it is loud and filled with students, I suggest bringing your own group of loud students to add to the mix!"
        }, 
        {
            "index": 55, 
            "rating": 4, 
            "review": "Atmosphere is great, it one of the older restaurant of Vegas. They have a huge selection of beers. I got the young's double chocolate stout. The potato skins were good, no skimping on bacon. The chicken fingers were great, watch out it comes out hot. The fish and chip were great, the fish tasted fresh. Although the service is slow but friendly."
        }, 
        {
            "index": 56, 
            "rating": 4, 
            "review": "Get past the crowd of UNLV students, or just come during the off-hours of their typical hours of drinking, and overlook the often slow service.\n\nDo these things and you will enjoy Crown & Anchor for what it is... an actual traditional British Pub in Las Vegas. I will be the first to admit I have never been to a real British pub, like say, in London, but hey if this is the closest I can get right now, so be it. \n\nI suggest Fish and Chips and it is typically what I get when I come here, although I have had a few other selections, this is certainly my go to and it's good, EVERY TIME.It's fish, it's chips, it comes with great tartar sauce if you want it. \n\nNot to mention the beer selection. It's works for me. I think everyone should come here at least once."
        }, 
        {
            "index": 57, 
            "rating": 5, 
            "review": "My boyfriend and I went to this place for the first time after talking about wanting to go for years. It is a really laid back pub with English decor and nice waitresses. We both ordered onion rings to start and then an order of fish and chips. The onion rings were huge with crispy batter making it the biggest onion rings I've ever seen. The fish and chips were awesome too, just what I expected. The waitress forgot to mention to us before we got the onion rings that Mondays are all you can eat fish and chips day, otherwise we would have eaten more. My boyfriend is a big beer fan and said he liked their beer menu! Overall, I really like this place! Remember, fish and chips are all you can eat on Mondays!!"
        }, 
        {
            "index": 58, 
            "rating": 3, 
            "review": "Good food. Fish and chips were great. 2 issues. Fish pieces were too big and they put the veggies on the same plate as the fish and chips, so everything got soggy. Great server - Lauren. Would come back again."
        }, 
        {
            "index": 59, 
            "rating": 3, 
            "review": "This review is based more on the service rather than the food or atmosphere , we had a large group of people meeting for a going away party , and basically were just left hanging around , we had to move tables for ourselves , and when server did come by it was rushed !! I realize it's a busy place but if they know it's going to be busy shouldn't they staff more ? For those that ordered food the wait to get it was over an hour , seriously about an hour and 15 minutes !! Our server was argumentative , when we asked what the hold up was , and basically said \" do you want it or not ? Half the group cancelled their orders , the others starved , decided to wait even longer for food that was mediocre at best , The beer selection was nice and I'm sure we would have spent more ( there were some drinkers in the group that just went to bar for their cocktails ) but with no one coming by often to check for empty cocktails I only had about 2 drinks in about 2 and half hours ( usually could have doubled that , lol ) after leaving there I went to a real bar and was served promptly , all in all though there was nothing here that would make me want to come back !!"
        }, 
        {
            "index": 60, 
            "rating": 2, 
            "review": "Cute place, great fish and chips. 2.5 stars is my real real rating.\nNo comps, super tight poker. We played 150 dollars and paid for beers, lame. Service was rushed and the waitress kissed our asses at the end. The coke was flat in my two rum and cokes.\nNot a bad place, but not gaming friendly."
        }, 
        {
            "index": 61, 
            "rating": 5, 
            "review": "I love this place. Food is consistent and the service is spot on. I'm there about once a week after work and Jessica always greets me with a smile. She's a big reason why I continue to come back. The rest of the team there is great as well. \n\nThe beer selection is solid and the food portions are generous. Plus soccer is always on which is a nice bonus. \n\nEnjoy the Crown."
        }, 
        {
            "index": 62, 
            "rating": 4, 
            "review": "When I went here, it was a great atmosphere. Very bustling and the staff were very friendly. The food was absolutely amazing... guinness stew was what my bf had, and he shared some of it with me, and I had bangers and mash. (I'm not even normally a fan of sausage, but authentic british food... hey...)\n\nThey do lose 1 star for slow service. It took forever to get our check when it was time for our group to go and when we did get it, they had screwed up a bit on it. That was the only thing wrong with the entire visit, though."
        }, 
        {
            "index": 63, 
            "rating": 4, 
            "review": "I think the place, overall, is very interesting! I would love to come back there again and try the potato skins. The place is decorated so well. I love the vibe that they give off. Also, I tried the pork pulled biscuits. I think they are called that anyway. Either way they are delicious."
        }, 
        {
            "index": 64, 
            "rating": 5, 
            "review": "Need a local spot for darts? This is your place! My favorite locals pub in the city. Always an interesting group of people. The service is great, Nicole is the hottest waitress in Vegas :) Great beer selection. \n\nIf you go I will suggest Wednesdays for karaoke night- half of the singers verge on professional and the other (like me) are pretty bad but always choose good songs. \n\nThursdays are Pub Quiz nights- although you often have to translate what the quiz reader is asking (very thick British accent) it's a good time and winner gets a $50 bar tab, which, unfortunately, you cannot use the same evening. \n\nTV's are generally tuned into soccer or rugby...I wouldn't know but I hear they get some big crowds at 8AM for important matches.\n\nInteresting liquor license at this place- I mean who wants liquor at a British pub and with their wide variety of beers but if you want a shot you've got to be sitting in the \"restaurant\" not the bar.\n\nGet the chicken fingers they are better than the fish and chips! Open 24 hours this place is the best for after hours! I HEART THE CROWN!"
        }, 
        {
            "index": 65, 
            "rating": 5, 
            "review": "i love this place.  the food is always good and the enviroment is fun.  we've eaten a bunch off of the menu.  fav is fish and chips. pastie, cottage pie, chicken curry...all good.  the scotch egg is great.  dont forget to ask for HP sauce.  they make their own chips wich are tasty.  they have a lot of draft beers too."
        }, 
        {
            "index": 66, 
            "rating": 5, 
            "review": "I've always had a good time in coming here.\n\nI'm a big fan of British pubs, and while my favorite one still remains in San Diego, this is a perfectly acceptable alternative.\n\nThe service has been good, the atmosphere is lively, their beers are extensive and great (I usually go for a Guinness with black currant, myself), and even the food is tasty.  Fish 'N' Chips and a Scotch Egg?  Good times = me.\n\nIt's fun to watch the game, play a few tunes in the jukebox, or even hang out in their upstairs area (there was a lightning storm last night, which made the whole atmosphere awesome).  I've even been accosted by a group of friendly Elvis impersonators there, of which I will definitely rate that particular experience: \"A hoot\".\n\nAll they need to do is run the recent Doctor Who episodes, and I'm set.\n\nRecommended."
        }, 
        {
            "index": 67, 
            "rating": 3, 
            "review": "Food is mostly good. The service is the reason for the three stars though. We had two servers while we were there, one that took our order and one that brought our food. The one that took out order was fine, she got one of our orders wrong but other than that she was fine. The one that brought our food though was rude beyond belief. She acted as though we were the biggest burden and waste of her time. I still plan on coming back but swear if that woman is our server I will ask for anther one. There is no way I could handle an entire dinner of her."
        }, 
        {
            "index": 68, 
            "rating": 4, 
            "review": "Better than 4 stars, but not 5.\n\nFish and chips was jammin!  Icelandic cod!  Instead of bread, you can order a yorkshire pudding app.  Also, the handmade chicken fingers (yeah - they're known for this) was great.  That was also very good.  Apple cobbler dessert with bird pudding was very very good.\n\nJust wished I had enough room to try the scotch egg...\n\nOverall, this place is a good fun local restaurant."
        }, 
        {
            "index": 69, 
            "rating": 4, 
            "review": "Huge fan of the Crown & Anchor!\n\nCome here for darts!  Come Here for English Pub Ales on Tap!  Come here for Soccer matches!  Come here for a  Scotch Egg!  You can even come for an English Breakfast or Sunday Dinner...they will both suffice, but I can't truly rave about either.  And you can certainly come with friends for a good time!\n\nThe food is solid (Fish & Chips / Pub Style Curry...and I'll mention the Scotch Egg yet again!) but not worth coming here for by itself.  The Beer is mostly English & Irish Favorites...more than the average pub, but not everything a beer snob is looking for...again not a sole reason for the average Joe to come here.  But when you include the British Pub atmosphere, I'm sold!\n\nI want to be in a place that feels different than average Vegas.  I want to play darts a few times a year...so I will return again and again, have a great time, enjoy some food and beer and remember the special nights when the world just seems more right...and I'll do that here in a heartbeat!   A little more attention to their food and I'd be handing out 5 stars with a smile!"
        }, 
        {
            "index": 70, 
            "rating": 3, 
            "review": "Fish n chips is good...but..... The SERVICE of the waitress is so awful that i cant even leave a tip coz it hurts me.....waitress on daylight bfore 4pm ...so watch her out..."
        }, 
        {
            "index": 71, 
            "rating": 5, 
            "review": "I love the character of this place and AYCE Fish n chips Mondays! good selection of beers and definitely a spot to visit in Vegas. from the old school euro car parked outside to the White House that looks like it came from a fairy tale story but full with alcohol, beer and good food. it's a gaming bar but they have tables to dine in. they also have two dart boards in the back for friendly wagers but the highlight on my visit was the fish n chips. It was moist, flakey and crunchy batter with some steak fries. Rumor has it that they have some of the best chicken fingers so I might try those next visit. Try it out! You won't be dissapointed."
        }, 
        {
            "index": 72, 
            "rating": 4, 
            "review": "This is my favorite chicken finger and beer spot!!! Kara is my favorite waitress here who is always great with service and attentive. \n\nCrown and anchors food is phenomenal for great prices. I love their interesting selection of stews, their burgers, and their chicken fingers are to die for!!! I also love how they always have soccer streaming on all the televisions.\n\nI recommend their Guinness and pear cider drink. Their drinks are awesome and all the bar tenders are nice! I highly recommend this pub :)"
        }, 
        {
            "index": 73, 
            "rating": 5, 
            "review": "We Went for Sunday Lunch and they had roast beef and Yorkshire pudding on the menu, but when ever I see Fish N Chips ( fries ) I have to try it out as I try and see who has the best, Crown and anchor Fish N Chips are great, fantastic portion and exactly like Fish N Chips from the UK, only thing I would say is it would be better if it was with Mushy Peas instead of the garden peas they serve but beautiful meal, my Husband had sliders and he could not finish it all, the Food Menu is great some real good British classics and American dishes as well, they have a vast choice of beer ( larger) and spirits and cocktails and even ales on tap, the building reminds me of pubs where I come from Chester in Cheshire England UK, the bar staff are delightful, there is a beer garden and dogs welcome. Toilets could do with a air freshener ( gents) but very friendly atmosphere food and drink great and great price, we are gay and was made to feel welcome, there is Dart boards, TV, Video Poker at the Bar, they do specials all week long, its open 24/7 if your in Las Vegas this is a must come and visit. for British people coming in the USA bar staff and waitresses work for their tips as that is there wage, general rule, when you buy a drink leave a $1 tip per drink, for food leave 20% tip example if your bill is say $50 times the 5 by 2 = $10 there is the tip, if $100 $10-20 if the normal, plus if you like great service next time you go back leave a tip, but the tips is their wage!  we Like this bar and we will be back as we live around the corner. would recommend to every one!"
        }, 
        {
            "index": 74, 
            "rating": 4, 
            "review": "A good pub is a wonderful place. Done right, it's a second home for those of us that like to bend an elbow.\n\nNow, Vegas doesn't have a perfect pub.  The main problem in our city is that every pub ruins its ambiance by installing those damn video poker machines in the bar.  And part of the greatness of a pub is a spacious wooden bar (uncluttered by anything except empty pints). So in Vegas, we already start a star down (try resting your elbow on the bar with those blocky video poker machines in the way).\n\nBut when you lower the bar for Vegas, Crown & Anchor is an excellent choice.  They have a solid selection of British, Irish and American beers and a decent whiskey collection.  Add in a nice dart board and a solid crowd of good-humored patrons.  Head there for a big soccer match or rugby match and you'll find a nice batch of rowdy fans yelling at a television.  It's comfortable and fun, with tasty fried food and drinks.  What you'd expect from a good pub.\n\nAnd there are some advantages to drinking in a Vegas pub.  Like all successful Vegas businesses, Crown & Anchor has perfected the art of hiring sexy wait staff.  The staff is very easy on the eyes and a vast improvement from the brown teeth and rolly-polly figure you'd find in jolly ol' England."
        }, 
        {
            "index": 75, 
            "rating": 4, 
            "review": "I really like this english pub. It's one of the few ones that serve a raspberry cider around town. They also have an traditional english item called a chip bunty (or butty) which basically is french fries (chips) served inside of a buttered roll. It's hard to look at without laughing but it's an awesome idea. They have a huge selection of draft beers on tap. This place actually has a better menu than the one on Spring Mtn."
        }, 
        {
            "index": 76, 
            "rating": 5, 
            "review": "Always  a great place to eat.  I've eaten here numerous times over the years and have had a excellent meal every time.  I've sampled most of the meat pies, and the Fish and Chips are great..  They have a wide selection of beers, the desert menu is good and all in all the service is good."
        }, 
        {
            "index": 77, 
            "rating": 3, 
            "review": "Good food and raucous atmosphere during football matches, especially when Liverpool plays. Service is okay and this place is sort of old, so don't expect an uber clean environment."
        }, 
        {
            "index": 78, 
            "rating": 3, 
            "review": "Came here for breakfast on a Sunday. A good vibe and the food was a-okay!"
        }, 
        {
            "index": 79, 
            "rating": 5, 
            "review": "The burly bartender comped me a free drink because I came inside sick! Horrays!\n\nUntil I came here I was giving up on looking for a legitimate UNLV Student hangout. I had the assumption that outside of campus, they either split up to do their own thing or went to Frat and Sorority parties instead. \n\nAlmost half the people inside are attending, attended, or will attend UNLV. It's great to hang out with people my age. \n\nAlso the atmosphere is somewhat divey, however, not bummish! It is however, British, and it is LEGITIMATELY British because they serve ales that, according to my older brother, is primarily served as favorites in the United Kingdom such as Hoegaarden. \n\nHavn't heard that one have you? Hoegaarden is the predecessor of Blue Moon and dates back by 600 years. It's Belgian White production was restarted in the middle of the 20th Century. \n\nMy brother is coming back with his overseas coworkers from the U.K. and he is definitely bringing all of them over here!"
        }, 
        {
            "index": 80, 
            "rating": 1, 
            "review": "You would have to be white or be with a white person to get good service around here.  I felt a racial tension when I was here last."
        }, 
        {
            "index": 81, 
            "rating": 5, 
            "review": "My regular Las Vegas pub. Bartenders and servers are all awesome. I watch all of my Epl matches here. I've met Some of the craziest premier league fans in my life at this bar. The beer selection is amazing. I recommend trying them all and filling out a crown card. Once the card is all filled out the bar gives you a free t shirt. . Also, the chicken strips the best in town. Haven't found better yet."
        }, 
        {
            "index": 82, 
            "rating": 5, 
            "review": "Great spot for lunch with a pint. And they have a doggie friendly patio. I will be bringing Shadow with me next time!"
        }, 
        {
            "index": 83, 
            "rating": 4, 
            "review": "In a town where $10 beers are now the new norm, this is a great oasis in the desert.\nBest of all, the patrons are mostly local.    I recently enjoyed several Delirium Tremens there, just one of the many unique bottled choices C&A offers, and I was seeing pink elephants.   The food is not bad, but go here for the beer.   Nice tap selection also."
        }, 
        {
            "index": 84, 
            "rating": 5, 
            "review": "This is one of my favorite everyday watering holes here in Vegas.\n\nGreat selelction of beers, wonderful patio outside, pool, darts, a few TVs, lots of people--in essence everything you need to stay entertained while drinking.\n\nThe food is also very good... I had the Chicken Curry with Chips, and it was surprisingly good (either that, or I had consumed one too many black and tans). :)"
        }, 
        {
            "index": 85, 
            "rating": 1, 
            "review": "Why the 1 star change you ask? Well I received the following message today from Rob the bartender, I've also added a photo just incase he tries to deny the exact verbage:\n\nI really don't appreciate you attacking me personally and using my name in your review! I am not a degenerate and I don't care for your roid rage comment. You see I recognize your picture and I realize that customers get jealous of the way I look and feel the need to knock me with their roid rage comments, but I understand. Maybe the next time we run into each other you can explain the roid rage and degenerate comment! Look forward to seeing you.\n\nWOW talk about customer service at its finest! Now I definitely will not EVER return. And I will make sure I let all of my friends/yelp followers of this experience. \n\n\n\nPREVIOUS REVIEW:It literally pains me to give a 2 star review but our service the past 4ish times have been utterly unacceptable. We tend to stay clear from the bar because the bartender Rob is such a degenerate mess. He is constantly gambling, slamming the machines, and going on a full roid rage. He's even broken machines before by slamming his fists on them after losing. All while bartending mind you. \n\nSo we choose to sit in the restaurant area. I'm not sure why the waitresses just can't get it together,  but waiting 20+ minutes for a side of BBQ sauce, then another 20+ minutes for our bill is rediculous. Don't even get me started on how long the drinks take.. tonight was an utter disaster. The ending was the cherry on top to a horrible experience  when the waitress disappeared with our credit card. When we couldn't find her I went to a tall blonde waitress and asked if she could possibly locate our credit card so we could leave. Before I even got the chance to finish my sentence she cut me off and said \"do you just want to talk to a manager?\" I said no, I just wanted to pay our bill. She stormed off and we never saw her again. Our waitress eventually came back but this turned into an almost 30 minute ordeal. \n\nLike I said it pains me to give such a bad review, the food is amazing (especially the fish n chips) and they have a great beer selection and we've been going to this bar for years. But the service just can't be tolerated any longer. I really hope this gets noticed by management because I would hate to see this awesome place go under."
        }, 
        {
            "index": 86, 
            "rating": 2, 
            "review": "Went for fish and chips. Mediocre. Miller 'a Ale House is much better. Service was horrible. 20 min. Before the sever checked on us each time."
        }, 
        {
            "index": 87, 
            "rating": 3, 
            "review": "The review is for 3.5 stars. I came here a few times when I was in college at UNLV (back in the day, I remember how small it was- small parking lot too- and that it was busting at the seams- another location opened near Chinatown BTW). Our most recent visit was when a good friend was moving to another state- it's her favorite bar. I didn't eat- it was a little too late for me. A couple of our friends did and their food looked good. I did sample a few fries. We had a couple drinks while remembering all the good times. The server was really nice and came around often, checking on us. Since it was wednesday night, it was karaoke night- which made it more fun- it's great hearing people perform- some people are so animated. We hung out for a few hours. There was a good crowd but it wasn't as crowded as it would be on a weekend, I imagine. \n\nI am interested in trying the fish and chips sometime, since I hear that it is a specialty of theirs- being an authentic British pub and all. The atmosphere is rich dark woods and heavy furniture (chairs). It is a little dark inside too.  \n\nJust a note, be careful with the step on the way (from the front of the bar to the other side of the bar, on the way to the bathroom, I totally missed it and fell! I was ok, though, just a little embarassed, but not sure many people even noticed it."
        }, 
        {
            "index": 88, 
            "rating": 4, 
            "review": "Great place, British pub food & well brew selection. Well worth the trip cross town from Summerlin."
        }, 
        {
            "index": 89, 
            "rating": 5, 
            "review": "I'm pretty sure they fry food in unicorn piss because it's magical!  All of it - chicken fingers, onion rings, mozzarella sticks, etc. You can go wrong. I had a steak and mushroom pie and the crust was...you guessed it, magical. \n\nOur waitress was Tracy she was super sweet and attentive."
        }, 
        {
            "index": 90, 
            "rating": 2, 
            "review": "The restaurant was rated by Restaurant.com and Yelp by many people as having the \"best fish & chips in Las Vegas,\" which is in no way the truth.  I ordered the fish and chips, which came with baked beans and \"fresh\" peas, and my friend ordered a lamb stew with yorkshire pudding.  Sounds tasty, huh?  Keep reading...  \n\nWell, the fish was NOT seasoned at all.  Although the crust was crunchy, the cod fillet was drenched in grease.  Next, the baked beans were flavorless and obviously canned.  Finally,  my peas tasted like they were once frozen, but they had an old, dry and starchy taste.  They, too were not seasoned at all.  In the end, if you like fried fish, I would recommend FRESHLY prepared Long John SIlvers to this...OR even visiting the \"hole in the wall\" in Northtown called Marios Market (MLK/Lake Mead).  The catfish there is AMAZING and made with love.\n\nNow, my friend ordered the lamb stew prepared in a yorkshire pudding bowl.  Would you believe the stew was NOT lamb, but BEEF (my friend is a trained chef...he knows!)  ANYONE who eats lamb can recognise its distinctive, slightly gamey flavor).   And when it arrived at the table in the yorkshire pudding bowl, the stew was cool inside the bowl...as if the \"chef\" hadn't microwaved it long enough.  Really?!  How long had THAT been sitting around!  Even the yorkshire pudding was soggy and old, like it was made a few days ago.\n\nSo, when we informed the waitress that the stew contained beef instead of lamb, she trotted off, frustrated, and returned 15 minutes later and said...\"Yep...the chef says it's lamb.  YOU can SAY it's beef all day long...but I'M TELLING you it's lamb.\"  When I asked her if she had ever eaten lamb before, she responded \"No...I don't like stuff like that.  But the chef told me the stew was made with lamb.\"  Hmmm.\n\nThe waitress then grew rude and condescending, as if she was exasperated by our inquiries.  At least she replaced my friend's \"lamb\" stew with a dry, overcooked steak sandwich, which was again unseasoned.  Some \"chef\" they have at the Crown & Anchor, huh?!\n\nWhat's most disappointing about my experience at the Crown & Anchor British Pub was that I'd been wanting to visit this place for some time now.  I love fish and chips, and I've seen theirs touted as being so delicious.  Hogwash!  They must be paying people to post those comments.\n\nI would NEVER go there again...or recommend any friend to do so either.  It was a 2 on a scale of 1-10.  What a waste of time and money."
        }, 
        {
            "index": 91, 
            "rating": 5, 
            "review": "Been coming to the Crown and Anchor for over 20 years. This is my Cheers. I know the owners and have had many of fun nights hanging out. The food is really good too. I love the cottage pie with HP sauce. My favorite thing about this place is they always have Grolsh in the bottle at the bar!!!!"
        }, 
        {
            "index": 92, 
            "rating": 5, 
            "review": "Came back again and was not disappointed!! The food was wonderful! the server was friendly and quick with refills. I must mention that i am disappointed in one thing, there is no cocktail menu there are many mixed drinks inspired by English fare!  Will be back again!! Yummy"
        }, 
        {
            "index": 93, 
            "rating": 4, 
            "review": "Husband ordered chicken curry and I ordered lamb stew in sourdough bread bowl.  Both were delicious.  We will definitely be back for the food. \n\nHowever, if you are a non-smoker, I suggest you sit outside.  We sat inside and when I got home, my clothes and hair absolutely reeked of smoke.  (I am not a smoker.)  Our waitress was a bit slow but friendly."
        }, 
        {
            "index": 94, 
            "rating": 5, 
            "review": "Crown is the best! Great food and 30 beers on tap. I go here all the time and have had most things on the menu. If you are looking for English food I love the Cornish pasty but if you just want bar food you can't go wrong with the burger. Unlv students get a burger and a beer for $10 on Tuesdays, or every night after midnight for non-students . This is an awesome deal considering you get a huge burger with bacon, cheese, and a big portion of fries. I'd pay at least $12 for the burger alone, the beer is just icing on the cake. Excellent service and a great atmosphere. Patio is great on warm summer nights."
        }, 
        {
            "index": 95, 
            "rating": 5, 
            "review": "The hard cider selection once included Woodpecker.. And now they have a small selection of ciders. I enjoy playing some darts, having a couple ciders, I love the bangers on a bun with grilled onions and the waitresses all wear cute tartan skirts"
        }, 
        {
            "index": 96, 
            "rating": 5, 
            "review": "Authentic atmosphere and menu, excellent service and fantastic food. I'll be going back again."
        }, 
        {
            "index": 97, 
            "rating": 4, 
            "review": "This is a great place to run into a steady stream of Brits visiting from across the sea, apparently it is well known over there. There is also a steady stream of locals which gives the place a real \"character\". \n\nOver the years, both as a tourist and as a local, the Crown had always been a favorite place to stop in and have a pint. Nothing's changed for many years, even some of the staff seem to hang around for years.\n\nNot every visit to the Crown will give you reason to promote it to a 5 star joint, which is why it sits solidly at 4 stars. The food is good, since you weren't really expecting anything spectacular. The service can be good at times and not so much so at others, but overall you should have fun as long as you let yourself enjoy it.\n\nBut if you ever get the chance to make it to the Crown during the World Cup (especially for a match between England and the US like we had just this past summer), you will have definitely have an experience you won't soon forget. \n\nIt is events such as this that keeps this place on the list of some of the best places Vegas has to offer."
        }, 
        {
            "index": 98, 
            "rating": 5, 
            "review": "I love this place! Along with the bartender that has a British accent, I feel like I've been taken away to a real UK pub.\n\nThey are dog friendly! So bring your mutt and enjoy the patio located in front of the pub which is just along the street. Watch cars zippin on bye!\n\nFood is ridiculously good! So far, the Britsh burger with Stilton cheese, chicken leek pie, and fish and chips were slam dunks in my mouth. The last time I was there, the bartender looked at me with surprise when I ordered a second order of the chicken leek pie. That's just how I roll. If its that good, I'm having seconds! This place is my main squeeze right now."
        }, 
        {
            "index": 99, 
            "rating": 4, 
            "review": "Beer! It's my favorite, and Crown & Anchor has a great selection.  Having British grandparents, and a father and uncle who grew up in England, a place like this just feels right.  Fish and Chips are tasty, as well as Cornish pasties!  But I love the giant Yorkshire pudding!  We always had Yorkshire for our Sunday roast beef dinners, and this one taste just like the family recipe. I love the layout, and the outdoor seating option, but I prefer sitting in the bar, near the dart boards, where I can find soccer or rugby on one of the tvs!  Its a great place to gather :)"
        }, 
        {
            "index": 100, 
            "rating": 5, 
            "review": "I love this place! Every time I'm in town I hit it up. Good food, good drinks, and def has that old skool British pub vibe. And I like how they play soccer during football season!"
        }, 
        {
            "index": 101, 
            "rating": 3, 
            "review": "I have made a few trips to England and Ireland sampling their fish & chips. I've got to tell you yours is fantastic. They should learn from you. Excellent!!\nI frequent your restaurant at least three times a month. The last two visits had me somewhat embarrassed with the loud profanity echoing from the bar. I am typically there with my family including grandchildren.\nJust inappropriate ! I think as you grow your business you may want to consider what type customers you want to attract????\n\nThanks for your quick response Richard.\nI was there last Saturday 8/22."
        }, 
        {
            "index": 102, 
            "rating": 3, 
            "review": "Strike 1 right off the bat their website homepage says $1 pbrs Sunday night. I order one and they tell me its now $2 and the website hasn't been updated. Strike 2- almost 40 minutes later for my food to come out and I watch as the now off duty bartender gets served his food first, this after he ordered his meal 20 minutes after mine. Strike 3 food arrives and I'm given an excuse that there was a large table that ordered before me; there's only 1 other table ordering food in this whole place. The strike is because of course my meal is cold! The bun was toasted a long time ago and since dried out and the chicken tasted of burnt grill and is dried out. The bartender saw my disgust and offered to refire me a new one. Miraculously a new hot fresh sandwich and fries arrived in under 2 minutes and am told oh yea the cook said your original order may not have been right..... The refire is hot, fresh and tasty but unfortunately my rating still stands because of the 3 strikes. I did get an apology and handshake from the bartender on my way and that speaks for a lot but I can't get over all of the above."
        }, 
        {
            "index": 103, 
            "rating": 4, 
            "review": "I was expecting something out of Austin Powers but felt like I could have been at a bar at a beach in San Diego.  I was there on a Friday night and it was busy but not butts to nuts like you'd find at a place on the strip.  The beer is a little pricey.  $5.50 for a Newcastle, but this is Vegas.\n\nParking is a little cramped but I got lucky and got a good spot just as another guy pulled out.  They had a dj playing songs off an apple laptop and he was playing a good mix of stuff.  Made me feel like I was back in college when he put on Crazytown.  When you're here, check out the upstairs area where you can kick back with some pool.  Another interesting note about the Crown and Anchor is the it's the hangout of choice for boxer Ricky Hatton when he fights in Vegas."
        }, 
        {
            "index": 104, 
            "rating": 4, 
            "review": "ah yes, i think i finally found my watering hole here in the las vegas.  too bad it's too far, but it has the one of the best beer tap selections in town.  i used to come here a long time ago just for the guiness, the boddingtons, and the john courage.  I learned earlier this year that john courage will not be available on tap anywhere in the U.S., so that was a bummer.  I found a great replacement...kronenberg 1664 from france.  i cant get enough of that beer and tetley's too.  this place has good food, too!  it has all those english pub specialties, even indian curry.  go there on mondays to have all you can eat fish and chips.  the fish is fried fresh...so crispy...so hot...and so yummy with malt vinegar.  they have late nite chicken sandwich and cheeseburger specials.  but the thing to get there at any time....is the chicken wing appetizer...whoa man!!!  fu#$in so delicious, my mouth is watering right now.  i dont know what it is, but it has to be that batter...so tasty,crispy,crunchy, and tangy in the dipping sauce.  we always get our grub on and order hella plates of chicken.  this is a must!!!\r\nfinally, they have a special down the hatch club card where for every beer you drink you get a stamp.  when you get to 30 beers, you get a free gift.   so i and a couple of other friends are on a mission to get as many free gifts as we can.   with my first card, i got my crown & anchor down the hatch club t-shirt.  right now i'm working on the jersey.  so, check this place out.  its open 24hours"
        }, 
        {
            "index": 105, 
            "rating": 4, 
            "review": "Great burger and great vibe! Service could use a little improvement, but granted, we were a large group."
        }, 
        {
            "index": 106, 
            "rating": 4, 
            "review": "BF and I stopped here a couple of weeks ago with  a coupon.  He ordered a martini and I some sort of beer.  Martini was delivered with no olives and I caught the waitress and told her no olives.  She returned sometime later with two olives on a pick, and when she put them into the glass, she pulled them off the pick.  Later I told her that in the future when a martini is served, the olives stay in the drink on the pick.  Guess she didn't serve many martinis.  But I digress.  We started with the garlic mushrooms and a Stilton cheese & crackers plate.  The cheese was good, but the mushrooms were so good we were fighting over them.  I could have made a meal just of those mushrooms.  BF had fish & chips, which he said were good, but not the best ever.  I had lamb stew in Yorkshire pudding, which I thought was fabulous.   Very busy place, and service was a little slow, altho lots of people and not enough waitspeople in my opinion.   However, we will be bringing a big crowd of people back here in March to celebrate an early St. Patty's Day!!!!"
        }, 
        {
            "index": 107, 
            "rating": 4, 
            "review": "Stopped in on the way back from the Pinball Hall of fame for a quik beer and irish car bomb..cool vibe, old school English pub.\nKeri our waitress was great. We'll definetly stop in next time in town."
        }, 
        {
            "index": 108, 
            "rating": 5, 
            "review": "Came here for lunch and to watch an NFL game. This is definitely a soccer bar, but the bartender Bridget was super nice and put on an American football game. In fact, she was the best bartender I've encountered in years. Very funny and engaging. The food was good for a pub, and the beer selection had lots of excellent British options in addition to a serviceable American menu of good IPA's including Dogfish Head 90 minute on tap. They played great 80's music with many obscure New Wave songs. I love this place and wish it had a branch back home."
        }, 
        {
            "index": 109, 
            "rating": 5, 
            "review": "While I'm not British, this place Feels Authentic. They know the difference between a black & tan and a half & half. Lots of rowdy UK folks shouting for their team when a game is on, having lots of fun. It doesn't hurt that the waitresses are cute and wearing little kilt dresses. (They do that in England, right?) And the food seems real, too, like bangers and mash, lamb stew, and things I've not yet raised the courage to try. It's dark, with a few electrical outlets here and there. They don't mind you camping out getting work done on your laptop as long as you're paying your way. One of my favorite places to get real writing done uninterrupted. No WiFi as far as I can tell, so I turn on my phone's hotspot."
        }, 
        {
            "index": 110, 
            "rating": 2, 
            "review": "Nice beer selection & cheap food.  They have Chimay on draft, however they no longer offer this in the beers that they will comp for players.\n\nWe've taken part in their Thursday Night Trivia Challenge twice, but it's rather disappointing due to disorganization and it's impossible to understand the announcer because of faulty audio equipment."
        }, 
        {
            "index": 111, 
            "rating": 4, 
            "review": "Pretty excellent beer selection and good food options.\n\nThe food is honestly a bit pricey for what you get, but it part of the cost be being in such a great environment. The outdoor patio is really nice and great for pets. Late night, it's a perfect place to sit out and have a few beers in the warm, dark Vegas air.\n\nI often recommend Crown & Anchor to both locals and tourists as a great place to get your night started or as a stop over on your way to a show.\n\nAs it is near the strip, be prepared for out of towners who have been hitting it too hard all day and locals who stop in to feel like they are in a Non-Vegas pub. It can get loud and if the wrong people get a hold of the jukebox, you're screwed."
        }, 
        {
            "index": 112, 
            "rating": 5, 
            "review": "The Crown makes better chicken curry than a Pakistani grandma! Get it over a bed of rice or if you have a strong heart it's delicious over fries. \n\nJoin the \"Down the Hatch Club\" by drinking every beer they have on tap. It's a great way to try new brews and keep track of your alcoholism.\n\nEvery Thursday night is quiz night so get some friends together or go solo and make new ones to win the ultimate prize($50 bar tab).\n\nThe juke box is digital so it can be hit or miss but if someone plays really bad music the bartenders will override it. The dart boards are in great shape and the loft has Foosball for all my Mormon friends. \n\nIf you're a video poker player the bar is great, if you're not there's a ton of places to sit."
        }, 
        {
            "index": 113, 
            "rating": 5, 
            "review": "I have been visiting the crown and anchor for 10 years and it never fails to be delicious. I have had everything the menu but I always end up ordering the fish and chips repeatedly. Also, this is one of the only places in town that pours Guinness the proper way. Thanks and I'll be back for at least another 10. Cheers!"
        }, 
        {
            "index": 114, 
            "rating": 3, 
            "review": "Its a cute little british pub with a cute little front patio which is nice on a breezy summer evening. I love to go here while out on a night on the town and stop in for a Pyramid apricot ale along with a scotch egg with some hollandaise sauce. So good!"
        }, 
        {
            "index": 115, 
            "rating": 2, 
            "review": "Went there on a Saturday night for beers after a day moving with friends. The beer selection is great, and they have a happy hour from 3 to 6. The waitress did not let us know of the special and by the time we realized the special, she reappeared 5 minutes too late. She was, however, nice.\n\nThe place feels overall unclean. The good reviews on the walls from past times only added to my impression that the pub is falling apart. \n\nAmbiance was dive-bar like, and they have spotlights instead of regular lights if you like to constantly feel like you're a stage performer.\n\nTo top it off, no hard liquor allowed in the gaming areas.\n\nI just feel like the owner stopped trying. A shame as it has great potential."
        }, 
        {
            "index": 116, 
            "rating": 5, 
            "review": "Yay for local bars in Las Vegas!!!\n\nI am a huge fan of the clubs and the crazy business of downtown Las Vegas, but nothing feels better than going back to your roots and just kicking your feet up at a good ol' fashin bar.\n\nThe company here is great, none of that gliz-n-glam that sometimes we just need a break from... a huge selection of beer is always a bonus! (big beer drinker). \n\nI have only gone here a few times and the bartender is always the same dude and he seems to remember everyone!!! \n\nOh, and their food here is great too and at a good price.\n\n****Will keep returning again and again and again*****"
        }, 
        {
            "index": 117, 
            "rating": 4, 
            "review": "This is a proper English pub, which is definitely hard to come by here. The beer selection is pretty good, but a little expensive. I love the atmosphere in this place and I also love, love, love the beer garden. I can bring my dogs here and they will bring out a water bowl for them and there is a little grassy area for them as well."
        }, 
        {
            "index": 118, 
            "rating": 4, 
            "review": "Fun times to be had at the Crown and Anchor...I just love the beer selection not to mention the great atmosphere.  Anything that stands the test of time in Las Vegas is a feat.  And what more could a girl ask for that 2 women's bathrooms.  They have an Internet jukebox so the music is never dull.  I've never had bad service there and there is always an array of people.  I do adore the food...the ploughman's lunch is my favorite!  Give me wicked cheese and Branston's pickles anytime.  Fries, pasties, sausage roll and even the shrimp is good and the fish and chips EXCEL.  Great conversation seems to flow there.   Cheers!"
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "This place has always been a Vegas staple for me. I used to come here after work every week. The fish and chips are great, jukebox is full of old punk and alternative rock. Bartenders and waitresses are friendly as hell and if you can't find a beer to drink here, you don't want a beer."
        }, 
        {
            "index": 120, 
            "rating": 5, 
            "review": "I've been coming to the Crown & Anchor since I was five years old.  My parents discovered it when we first moved to Vegas many years ago, and we enjoyed it quite well.  I guess we sort of forgot about it for a while, because we stopped going for several years.  However after I started attending UNLV a few years ago, I rediscovered the place after realizing it was so close to the campus.  \n\nI would highly recommend the Steak and Mushroom pie, and you definitely can't go wrong with the fish and chips either.  The staff are very friendly, I'm always seated quickly, and the wait for food usually isn't too long.  Most recently, Jess was my waitress and she was very friendly and attentive.  I'm a serviceman, but unfortunately they don't offer military discounts, something that I would appreciate seeing.  However, they do offer discounts for UNLV personnel which I take advantage of.  The ambience is casual and a little old fashioned (which I like), and it makes for a great stop at just about any time of day or night.  The music usually isn't too loud, so your not struggling to carry on a conversation with the person next to you.  I also enjoy looking at the Naval-oriented artwork and decoration on the walls and ceiling, it only adds to the authenticity of the pub.\n\nAll in all, its a great place to grab a meal, a drink, and a chat!"
        }, 
        {
            "index": 121, 
            "rating": 5, 
            "review": "Nice Pub, BUT the Curry sauce was bland and watery?Only negative thing I found with this Public House!"
        }, 
        {
            "index": 122, 
            "rating": 5, 
            "review": "My husband and I were visiting Las Vegas for a week to check out moving there. We wanted to get a feel of the land and what it offered, if we moved there. \n  My husband is of Scottish heritage and wanted to check out British pubs. I found the Crown and Anchor on Tropicana Ave. Reckon we struck solid gold!!!!!!  \n  It was everything we could have wanted from the atmosphere to the pub grub. I had always wanted to try the Yorkshire pudding and was very happy to see it on the menu and with 2 sides of sauces no less! We were so satisfied, we returned again later that week! A regular haunt if we do move there. \n  The wait staff were fantastically nice and helpful. Our server was Tracy, and she was great! The prices were very good for the quality and portions of the food. We tried many sides, the stuffed potato skins, the fish and chips, the stilton cheese platter, the yorkshire pudding and kept looking at what others around us were ordering.  They have quite a large pub food menu to choose from. \n  We sat next to four people visiting from England, and they said they loved it and  had been there countless times before, when visiting Las Vegas. It WILL definitely be one of our favorite pub/restaurants in Las Vegas! It being one of two there, can't wait to visit the other one on the west side."
        }, 
        {
            "index": 123, 
            "rating": 4, 
            "review": "Love that you can bring your dog! I need to next time.\nGreat fish and chips! My boyfriend and I split  it and we were stuffed from just half each! \nDecent beer selection.\nGood service. \nI dig it."
        }, 
        {
            "index": 124, 
            "rating": 2, 
            "review": "I posted my last review of the Crown & Anchor back in 2009.  I visited the pub again this weekend and was a little less impressed sadly.  The place looks a little shabby  and dirty on the inside these days.  I went there to watch Spurs give Man U a nice kicking at Old Trafford and was sad to see the state of the place.  Broken chairs, dirty carpets, dust and cobwebs hanging off everything.  Makes you wonder what state the kitchen is in.....\n\nFor a bar that shows so much sport I was amazed at the state of the TV's.  Some of them look 20 years old, the quality of the picture on the big screen was absolutely awful.  No HD Box?  Are we living in 1995? It's criminal that any bar showing sports doesn't have good TV's and a HD feed.  You can get 55\" LCD HDTV's these days for $800! I watched the game on a 21\" TV! Just goes to show the owners aren't investing/looking after the property.\n\nThe one thing that was a positive was the staff, they were great, especially the french waitress that looked after us (at least I think she was french).\n\nNext time I want to see a game in Vegas I'll head elsewhere, it's just not worth the trip off the Strip these days. The 45 min wait for a taxi when we tried to leave sucked too!!"
        }, 
        {
            "index": 125, 
            "rating": 3, 
            "review": "After hearing all the craze about their fabulous chicken wings, I had to come and try it out for myself!\n\nLucky me, even though I'm not a beer drinker, my Vegas go to man was willing to drag me along so I can indulge in some much needed deep fried crunch!  I can attest that yes, indeed, these chicken wings and drumettes are big ole things.  There's a lot of batter and meat on these babies, but I couldn't say so much for the taste itself.  Because we were dousing it in ranch dressing and hot sauce, of course it tasted fabulous.  But take away all of that, and I wasn't so sure there was so much flavor in the chicken or batter itself.  Bummer.  They do a fine job though giving it to you on the crispy crunchy end, and we like crispy crunchy things! \n\nThey do have a pretty extensive beer on tap selection, which is always impressive.  I'm a pear cider kind of girl for now...\n\nThey have various specials from late night craving deals to specialties of the day.  And who doesn't love a place that's open 24 hours?\n\nI'm on a mission to find tastier chicken wings that this!  Bring it!\n\nUpdate! 10/08/07 - I'm 1/3 of the way through my \"Down The Hatch!\" card!  Yay!  What the heck is that?!  They have this frequent beer drinker card and when you drink 30 of their beers, you get a free gift.  The BF is on card #3 already and is a proud owner of a Crown and Anchor T-shirt and Crown and Anchor soccer shirt.  (I'm hoping for the baby doll tee myself.)  They have some cool bartenders working here and a pool table upstairs as well.  We brought out of town guests and they loved the place!  I think they had live music the past Saturday.  We got there a bit too late and saw them putting their equipment away.  Yay for live music! And there's all you can eat fish and chips on Monday nights and happy hours from 3 pm to 6 pm!  Another cool thing is that they are showing football (soccer) games on the TV, and if you come by really late at night, they'll still have games on!\n\nSidenote:  They even offer a free shuttle pickup service! Wow!"
        }, 
        {
            "index": 126, 
            "rating": 4, 
            "review": "I can't believe I didn't come here earlier.  This is perfect bar atmosphere.  The bar is a solid area, and it has a nice dining area that's carpeted off to the side.  And, the bathrooms were clean.  Granted, I came at lunch time on a Wednesday, but that bears mentioning.\n\nFor lunch, I had the famous chicken fingers.  They did not disappoint.  Solid breading, but not greasy or overly thick.  Herbs in the breading was unique.  I wasn't crazy about the fries.  They are your basic thick fries.  I doused them in salt, pepper, and vinegar, but that didn't do much.  I just don't like the huge fries, but in a pub that's what they serve so I should get over it.  \n\nThe chicken tenders live up to the hype, and the bar was fantastic.  I'll be back."
        }, 
        {
            "index": 127, 
            "rating": 3, 
            "review": "Not the place it used to be. It has turned into a \"bro\" bar. Now it's a college bar, which makes sense for the location. Still, it used to be better. So sad."
        }, 
        {
            "index": 128, 
            "rating": 5, 
            "review": "Have a beer or two or few. Eat delicious fish and chips and practice hitting a bullseye. No betting though, LOL"
        }, 
        {
            "index": 129, 
            "rating": 3, 
            "review": "Service is very slow - they always are understaffed - the prices are fine, and they say they have the best fish and chips, but it's really just average. Chicken fingers appetizer is surprisingly good though."
        }, 
        {
            "index": 130, 
            "rating": 4, 
            "review": "I never sat inside the place. I love sitting outside. This place has a nice patio and is dog friendly. The food is good and the waitresses that I have met were all great. They have a pretty good beer selection. It is more of a local place not the up-tight tourist trap places that dominate the town."
        }, 
        {
            "index": 131, 
            "rating": 5, 
            "review": "THE place to go if you're looking for authentic British fare (although Cornish Pasty is nipping at their heels). Have been here many times through the years and the fish and chips and chicken pot pie have never failed me."
        }, 
        {
            "index": 132, 
            "rating": 1, 
            "review": "Me and my friend were looking for a late night snack after a night of dancing. This came up on Yelp. We were buzzed but not even close to being drunk. There were two other people at the bar, after all it was 3 am. The bartender was the rudest jerk I have ever met. He had a British accent and was a bit older. The whole time he looked like an angry mess that was about to blow up on somebody. We had to track him down for water refills and he was so annoyed every time we called him. Dude, if you hate your job so much why are you working in customer service? And to whoever manages this dump you really need to train your employees on how to assist customers with a bit of respect and a damn smile. With so many local bars in Vegas this one is not worth your hard earned money. I get better service at PTs. Never again!"
        }, 
        {
            "index": 133, 
            "rating": 5, 
            "review": "Best British food in Vegas. I use to live in Britain so I know what is good and not. Nice servers and very authentic food."
        }, 
        {
            "index": 134, 
            "rating": 3, 
            "review": "So today I thought I would change it up and celebrate my English friends and co workers. Instead of my traditional BBQ meal, I had Sunday roast. Went with the lamb and beef. Finished off with sticky toffee pudding made with Guinness. \nKind of divey, the food was good, maybe a little under seasoned. I opted for the half and half ( beef and lamb) Lots of English memorabilia on the walls and around. They show all the matches- rugby, cricket, and soccer. \nTourist and locals alike come in. 30 beers on tap and open 24 hours with gaming machines in the bars.  Table seating and big parties accommodated. The toffee pudding was the way to finish."
        }, 
        {
            "index": 135, 
            "rating": 5, 
            "review": "Went to watch the Rebel game.  We started with chicken fingers - crispy crunchy excellence!  Next up was the Steak and Mushroom Pie. The steak and mushrooms were waiting below the buttery crust in a delicious sauce.  Love the atmosphere at Crown and Anchor.  The service was great even though they were busy for the LV Weekly event.  And with over 30 choices on draught - you can't go wrong!"
        }, 
        {
            "index": 136, 
            "rating": 4, 
            "review": "I personally don't like the food here but I will give them the benefit of the doubt because there are always tons of Brits eating here and I've never been to Britain. I once saw them do a takeout order of 25 orders of fish and chips for some higher roller at Wynn so that means something to me, too. \n\nSo that having been said, it's always lots of fun here especially now during the world cup and you can't beat the $20 video poker free lunch special. \n\nWord of warning, they do have a weird alcohol license where you can only have beer at the bar but beer or alcohol in the dining area. So get your seat at the bar and whenever you want a shot, order from the waitress in the dining area."
        }, 
        {
            "index": 137, 
            "rating": 3, 
            "review": "I HATE GIVING THREE STARS . . . but this place was just average for me.  I was hoping that this place would be bigger than life with lot going on . . . a great staff . . . lots to do . . . and plenty to drink.\n\nWell one out of four gets you three stars, but only because it was the PLENTY TO DRINK . . . service was slow, even though the place was dead . . . I would like to think that there are times when this place really gets rocking . . . I just know if it will ever be when I'm in town.\n\nReturn trip possible . . . yes . . . but at this point only because of the drink selection."
        }, 
        {
            "index": 138, 
            "rating": 3, 
            "review": "I hate to give this place three stars, because it's actually one of my favorite bars in Las Vegas, but there are some reasons why I don't come here much anymore.  The beer selection is great for me, because I am a big fan of British beers.  This might be the only place in the city that has Bombardier Ale on tap.  The food is very good, and the prices are reasonable.\n\nThe problems: \n\nThe prices on beer seem to have gone up quite a bit over the last couple of year.  This used to be a good place to come for a couple of $5 drinks, but on the last couple of visits I payed close to $14 for two beers.  Their Happy Hour prices are a little cheaper, but not much.\n\nI really hate to mention this, but there is a roach problem here.  If you sit outside, you're going to see a ton of roaches.  That's not such a big deal, but I have also had the same problem when sitting at the bar.  If you are coming here to eat, I would HIGHLY recommend that you sit at a table in the restaurant part of the room.  I have only eaten food on the bar-top twice, and both times there were roaches crawling around on the condiment bottles and near my food.  The food is really good, though, so I will certainly eat here again, just not at the bar."
        }, 
        {
            "index": 139, 
            "rating": 4, 
            "review": "I had lunch with some friends here for a soccer game a couple months ago.  The atmosphere provides a British/European flavor to it.  I've watched world cup games here before and the world cup watching atmosphere is great.  Service was excellent and the dining room waitress was attentive.  She was nice enough to switch the TV to another Champions League game for us.\n\nI really like the fish and chips.  The only better version I've had is when I ate lunch by the sea in Ireland at a restaurant that made the fish from the morning's catch.  The chicken fingers are at or near the best I've had for that dish in Las Vegas.  The beer selection is excellent and you can get a lot of english beers that are not readily available at other bars in Las Vegas.\n\nThis bar is a great place for on-strip tourists to get a flavor of off-strip and a great place for locals.  May want to pass on this bar if you don't like crowds and it is around world cup time (especially an England game or St. Patricks day)."
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "Best authentic pub in Vegas!!! Food is absolutely fantastic with large portions and reasonably priced. Will be a regular there. Highly recommend!!"
        }, 
        {
            "index": 141, 
            "rating": 5, 
            "review": "Being born and raised in England I've had plenty of Sunday roasts so wanted to try this one. We both ordered half beef and lamb. My wife makes great Yorkshire puddings and we have a special pan that makes oversize ones but doesn't compare to the pub ones ( gigantic). For $14 portions were generous, so generous we had enough to heat up later. Not sure about the slow service reviews as our was as good as it gets ( Carra?). I normally drink Bass in pubs but this one didn't quite hit the spot. Blame my taste buds. Switched to a refreshing cider. Would eat and drink here again."
        }, 
        {
            "index": 142, 
            "rating": 4, 
            "review": "I like to watch English Premier League soccer here a couple of times a year.\n\nGreat beer selection on draft and decent food.  The only drag is that it is a bit dusty in there, but it is not a dive.\n\nI like the bangers and mash, fish and chips, ploughman's lunch, and Sheppard's pie."
        }, 
        {
            "index": 143, 
            "rating": 5, 
            "review": "How can anyone not give the CROWN 5 stars?! This is a must whenever the buddies and I make our quarterly trip to Sin City. Where to start with C&A? \n\nThe beer. A huge selection of outstanding beers. The fact that they have Carlsberg makes me smile. Stella and Pilsner Urquel as well. They have beer for everyone there. \n\nThe food. Honestly, I can't really remember what I have eaten there. My buddy Z loves the Scotch Egg. A hard boiled egg wrapped in sausage. He lives for it! \n\nThe real reason we go there. The football. No, not throwball, but the real football. The first experience watching a game there had to be the best. My team lost mind you. Horribly. The atmosphere in the place at 4am was better than any place in the U.S. anytime of day for (insert lame sport here). Chants were being sung. Taunting was taking place from table to table, just before friendly handshakes and rounds being bought for one another. The greatest part of that night/morning had to be at about 7am. We stumbled outside to see the sun up already. Down the parking lot a bit there were 4 British guys. One of which was completely obliterated, yet still felt he could do a jumping spin kick into his friends face. He proceeds to pull down his pants to his knickers. Leaving his black socks on mind you. He lines up his buddy, takes a leap, spins, kicks, misses by a mile and falls on his ass hard. We almost threw up from laughing so hard. Just the thought of this happening again makes us go back. \n\nWe will be visiting the Crown and Anchor in 3 weeks time for the Liverpool v. Manchester United match on 3/14. I am sure it will be just as memorable."
        }, 
        {
            "index": 144, 
            "rating": 4, 
            "review": "I found this place on Yelp! They were SPOT ON!!! The FIsh and Chips are Crunchy, light and Delicious! I always ask for an extra piece of Fish because one is just not enough for me. If you are a Chicken finger lover-you came to the right place! We eat here at least 2X a month!!!"
        }, 
        {
            "index": 145, 
            "rating": 1, 
            "review": "Used to love this place. The last 3 times here in the past 2 months just waited too long for service.  Last night went with husband and daughter to eat outside on the patio and never got served. Left after 15 minutes of nothing. Used to be great place but service is just terrible and there are too many choices to go back somewhere with bad service."
        }, 
        {
            "index": 146, 
            "rating": 4, 
            "review": "Love the fish and chips here.  It's my go to place when I want a quiet break from work during lunch.  The service is always friendly and the food is great.  Maybe someday I'll venture to the bar :)"
        }, 
        {
            "index": 147, 
            "rating": 5, 
            "review": "Very good British food, that is to say true to what you'd get in a good pub overseas. Better than the other supposed \"British Pubs\" in town.\n\nBeer selection is large and reasonably priced. When you need some mushy peas, chips, and pint its worth a stop."
        }, 
        {
            "index": 148, 
            "rating": 5, 
            "review": "Great atmosphere!!! I like hanging out here for football (soccer) games as well as just for dinner! The chicken curry over rice is my FAVORITE thing on the menu.  It's also yummy to order fries with a side of the curry sauce for a game time snack!  I would LOVE to become a regular....!!! :)"
        }, 
        {
            "index": 149, 
            "rating": 4, 
            "review": "Chips and chicken fingers are my favorite items here but then again those are the only items I've ever ordered. It is just at it states a Pub, nothing fancy a bit smokey but you can have a few pints and relax without a hitch. Music is 80's rock mostly, takes me back to those younger years. They also have cork board darts.. I recommend this pub as a good meeting place to either start the night out or to just enjoy some brews. The Tap selection is pretty good but imports, domestic and microbrews. Plus you can bring your dog. They have an area for them. Enjoy!!"
        }, 
        {
            "index": 150, 
            "rating": 2, 
            "review": "I would like to make this clear from the start, we have eaten here a few times and the food is pretty good, as a Brit living in Vegas there are times I get the craving for some good old British food, today was one of those days.\n\nOn one of our trips to the UK I introduce the wife to the British Carvery, to give you an idea take a look here : http://www.tobycarvery.co.uk/carvery/\n\nNow, as these are non existent in Vegas, we are left with places that serve a traditional British Sunday Dinner, right, Crown and Anchor it is.\n\nThe service is always good here, the wait staff are always friendly and quick....... And let's be honest here, whoever came up with their uniforms, you deserve a medal.\n\nBut it is the food we are interested in.\n\nThe wife went for the Sunday Dinner with roast beef, I had the Sunday dinner with lamb and beef, both dishes are served with Yorkshire pudding, veg and A roast potato (more on those in a minute), along with this my wife ordered a small house salad.\n\nAfter a while we had pretty much given up on the salad, no big deal, these things do happen. however, when are meals came out, they each had a house salad on the plate, along with the meat, potatoes, veg, Yorkshire pudding and gravy.....\n\nA pet peeve of mine is when waitstaff know that something isn't right, how a house salad, with gravy even makes it out of the kitchen is beyond me (unless this is the way the owners want it, in which case....WOW).\n\nAnyways, a quick recovery by the lady serving us, my salad which I did not order is gone and my wife has a nice house salad on the side, which would have been better served before the meal came out, but ok, on to the meal itself.\n\nIs it a \"traditional British Sunday dinner\", well yeah it is, in the same way that as a McDonald's 1/4 pounder is a gourmet burger, all the pieces are correct, it looks right, but there is just something missing.\n\nSo let us dissect the meal :\n\nThe meats were good, maybe a little thinly sliced, but that happens to be the way I like them, so I was happy, however, putting beef gravy on to lamb just destroys any taste to the meat, if you are going to offer both meats, it's actually better to serve the gravy on the side and let the customer mess it up.\n\nThe Yorkshire pudding was good, this is something that normally causes all kinds of issues to those not raised with the darn things, but they were good.\n\nVeg is veg, enough said and ignored.\n\nNow for the real crime on this dish, the roast potato.....This is going to be long, it is a story and a rant.\n\nThe Great British Roast Potato, a food that when done right makes a Brit smile and a non Brit wish they had been born a Brit, sounds like exaggeration huh ? \n\nA couple of years ago we were lucky enough to host the family Christmas dinner here, it seemed like half of California showed up, the women folk worked their wonders on the veg, the father in law worked on turkey and prime rib.\n\nOver in a corner of the kitchen the Brit who married into the family was hiding in a cloud of steam, gently giggling to himself, these poor Americans had no idea what was about to hit them. A bag of potatoes had been boiled, cut in half and were now being gently rocked back and forth in a colander.\n\nThe women were looking at the wife wondering, WTF did you go and marry this guy for ? And why won't he answer any questions about what he is cooking ?\n\n45 minutes before we are due to eat, the potatoes are placed in the oven, set at 325, basting in a bath of melted lard and drippings. After 15 minutes the oven door is quickly opened, the potatoes are quickly covered with the oil, 15 minutes later the door is again opened and the potatoes are turned over.\n\nSo 45 minutes pass, what comes out is a potato that is golden brown on the outside with a crispness to it while inside the potato is light and fluffy.... And totally ignored by everyone ! Heretics !\n\nThat is until the father in law becomes brave and decides to try one of these strange things his new son in law has produced.... Or it could of been his daughter kicking him under the table while not so subtly nodding at the bowl of potatoes, but he tries one, then ever so slowly reaches over and grabs the bowl and shovels a bunch of them on to his plate, the family is shocked, the strange new food is a hit with the old man, the Brit sits back with a little smile on his face.\n\nNow the reason for that long story is...... If you are going to serve roast potatoes serve roast potatoes, not two little bits of potato that if I had to guess came out of a bag frozen, were quickly thrown through some oil and then put on a plate and served.\n\nYes doing it right is time consuming, yes it can be a bit of a pain, but if a chain in the UK can do it day in and day out serving thousands of meals a day,there is no reason why a little restaurant cannot get such an important part of the meal right.\nFor this reason and this reason alone they get marked down, is that mean, well no it's not."
        }, 
        {
            "index": 151, 
            "rating": 5, 
            "review": "Jessica provided us with amazing service. The chicken curry is one of the best I've had and I actively look for good curry. \n\nI will return because of Jessica and the curry."
        }, 
        {
            "index": 152, 
            "rating": 5, 
            "review": "Love the ambience, beer selection is great and the food is tasty. Just far enough off the strip to get away from all the tourists."
        }, 
        {
            "index": 153, 
            "rating": 3, 
            "review": "I came here when I would go to UNLV, this place is a good place to hang out if you need to kill 2 or more hours in-between classes, they have big screen TVs everywhere and the food isn't that bad."
        }, 
        {
            "index": 154, 
            "rating": 3, 
            "review": "I've been going to try one of the Crown and Anchors for sometime and never got to stopping there.  I met friends the other night who suggested this for dinner and off we were.  They have been there several times and could reocmmend things.\n\nFor an appetizer, I got a sausage roll, a spiced sausage wrapped and baked in a flaky pastry.  The sausage came sliced and was accompanied by a dish of mustard sauce that was excellent.  It really gave the sausage a nice flavor although it was good without the mustard.\n\nFor the mains, all three of us got steak and kidney pie.  This was a first for me and I enjoyed it a lot.  The steak cubes were very tender and the kidney had a very smooth texture and was quite flavorful.  The pie was topped by a flaky crust and it was piping hot.  (Sweeney Todd fans will get that).  With the pie comes mashed potatoes and gravy and a healthy serving of peas.  It turns out to be a large and filling meal.\n\nService was a little off.  One of my friends ordered water with her drink at the outset and was not brought it until near the end of the meal when she had to ask again.  Also, after being seated, the staff wasn't sure whose table it was until we asked.  \n\nI could easily be a fan of the Crown and Anchor but they have to be better with service."
        }, 
        {
            "index": 155, 
            "rating": 4, 
            "review": "Well, we went back and it's still good!  A pint is a good pint! That Yorkshire pudding is still huge.  The food is still yummy and this is the only place in the states that my dear hubs can find his favorite steak and kidney pie.\n\nPlus, I forgot my camera bag (had camera but forgot the bag) and we walked off to go play pinball.  When we discovered it was missing I called them and our server had put it back in the office for safe keeping.  \n\nPints, steak and kidney pie and keeping my bag for me? Good show!"
        }, 
        {
            "index": 156, 
            "rating": 5, 
            "review": "My favorite place to watch the Arsenal... come on you gunners. Specials every Tuesday and Wednesday. Food is good, service is great, atmosphere amazing."
        }, 
        {
            "index": 157, 
            "rating": 3, 
            "review": "Good beer at amazing prices compared to the Strip.  Very close to the pinball museum.  The bartenders were not friendly at all.  \n\nI can now say I have tried a Scotch Egg, and I can also say I will never try it ever again.  Ew."
        }, 
        {
            "index": 158, 
            "rating": 4, 
            "review": "Really enjoyed myself here! The staff were very polite and on top of there game. The place was filled with a bunch of people drinking beer and eating food. The wings were pretty good, and the beer prices were reasonable. I would come back for sure."
        }, 
        {
            "index": 159, 
            "rating": 4, 
            "review": "I'm going to try to write this without sounding too snooty (I lived in the UK for three years). Great atmosphere, plenty of parking, decent prices, an outdoor pet-friendly patio and a zillion interesting imported beers. The fish and chips was okay, however I'd say it's got nothing on the real thing found in the UK (or even New England). Also, I never knew anyone to wear kilts in England (like the waitresses to here); that's a Scottish thing. I'd be interested to try the Sunday afternoon dinner though!"
        }, 
        {
            "index": 160, 
            "rating": 5, 
            "review": "This is my go to spot for Wednesday karaoke night.\nLet me just say that I don't sing ever but maybe a few drinks I'll probably will go up there and give it a shot till then I'll just sit and watch haha.\n\nI like the chicken tenders here as they're pretty good and pretty fast to get when you order.\n\nOur bartender is pretty funny, I didn't catch his name but he made us feel welcome and when it wasn't busy he will have a great time with everyone.\n\nThe beer selections are great but I always seem to stick with Newcastle , need to open up my options haha.\n\nOverall place is great to hang with a group of friends, there's darts downstairs and pool upstairs"
        }, 
        {
            "index": 161, 
            "rating": 5, 
            "review": "Love this place!  Las Vegas' classic British bar!  2 locations in town.  Careful as the other location has snobby (biotchy) female bartenders.  This place is great.  The drinks are top notch and the food is awesome!  Love us some fish & chips!  Oh the have HP sauce too! Yum!  The outdoor sitting area is a huge plus if your a smoker.  It's very close to the airport and UNLV.  The clientele is diverse as there are tourists, UNLV students and football (soccer) fans.  Epic place to watch Manchester United!!  Make it a point to check this place out on Sunday's as they have a great dinner special.  Bathrooms leave a bit to be desired.  Like that you can open the window to the alley...random but how many allies do we have in Vegas.  Reminds me of back home in NYC.  All in all I highly recommend this bar/restaurant!"
        }, 
        {
            "index": 162, 
            "rating": 3, 
            "review": "Niet het soort plek waar wij normaal komen. Behoorlijk Off Strip, beetje smoezelig, maar wel een sportsbar met enorm aanbod. En daar waren we ervoor. Mijn lief wilde per se Ajax zien. Via tips waren we hier terecht gekomen. Van te voren om te checken. Je staat niet voor je lol om 0430 op. \n\nBij binnenkomst halverwege de dag een nagenoeg lege toko aangetroffen met wat vaste klanten van het type groezelig. Aardige bardame getroffen die voor ons het hele aanbod heeft bekeken. En dat is veel! Werkelijk waar: dat er zoveel sport kanalen zijn is ongelooflijk! Maar helaas....geen Ajax. Wel PSV om hetzelfde tijdstip. \n\nZou hier dus niet voor de gezelligheid naar toe gaan, maar als je Vegas bent en je wilt per se iets zien heb je hier goede kans.\n\nHa Richard,\n\nNo images, just the sound on the radio. Hearing the team loose the championship after being on top almost the entree season. \n\nWe'll visit Vegas twice a year. And I'm sure my husband will watch a game with you on one of those occasions. \n\nThanks for your reaction!\n\nGreetings,\n\nMonique"
        }, 
        {
            "index": 163, 
            "rating": 4, 
            "review": "Yelp came thru once again... I arrived on a late flight and had not had dinner so we decided to look for a place close by to eat and this popped up.  The place was pretty empty around 9pm but shortly filled up for trivia night.  I had a side salad and order of wings and my husband had the fish and chips.  And we also had a couple pints, they have 30 draft choices!  The wings and sauce were superb, the wings are battered but its light not overpowering, the sauce is on the side and just how we love it vinegar and spice.  My husband raved about the fish, I didn't try it.  The fries/chips were good, thick cut awesome with malt vinegar.  My big gripe here is that its a bar and I guess in Vegas they still let you smoke, yuck!  Anyways if in the area I would go back again for the awesome wings.  \nP.S.  We tried the sticky toffee pudding and it was not good, super dry and no ice cream.  If you want one that will knock your socks off try it at Gallagher's restaurant at NY-NY hotel.  Theirs is awesome."
        }, 
        {
            "index": 164, 
            "rating": 3, 
            "review": "They have british pub food...I mean REAL british pub food. Chip buttys!!!!!! Scotch eggs, lots of beer, and its pretty decent...Its not my favorite watering hole in the area as sometimes the bartenders can be shit heads, and you cannot do shots at the bar?? wtf! But if you are jonesing something greasy and british, like russel brand, then go here"
        }, 
        {
            "index": 165, 
            "rating": 4, 
            "review": "I've heard about it for years, but I somehow never made it to the Crown & Anchor British Pub until a couple weeks ago. It's always high on a lot my friend's lists of dive bars along with Frankie's Tiki Room, the Double Down, etc, but those recommendations are typically more for drinks and overall ambiance than food. This is why I was particularly skeptical about this one, even with a few friends swearing by it. Needless to say, I ate it and was more than surprised.\n\nThe pub is located on the east side of Tropicana in an iffy area of town, but you're not coming here for the class. The interior is decked out with British-inspired street signs, posters of boats and the like, with the waitresses wearing skimpy kilt outfits. There's also an outdoor patio which I've heard is dog friendly. I was fully expecting an overly loud, smoky bar scene that would have made eating a bit unsavory, but it was surprisingly quiet on the Saturday night we were there. The menu features all sorts of traditional British dishes that I've heard are hard to find at other locations around town. This is all good, but I only really care about burgers for the sake of this review so I'll have to try some of that other wacky stuff on my next visit.\n\nThe British Burger on their menu comes with a  1/2 pound patty, bacon, lettuce and tomato and choice of a few cheeses. My burger had great char flavor upon first bite, which carried all the way through. It was cooked a bit more than medium-rare but I was ok with it due to the overall great flavor. It was greasy for the first half, dried up a bit in the second half but was still ok because of the flavor. My bacon wasn't quite as cooked as I would have liked, but it still had decent flavor. The thin onions were good but I still pulled them off as to not overpower the great flavor I was experiencing. The lettuce and tomato were fresh, although the tomato was a little sparse, and the swiss cheese was melted and good as well. The bun was soft, gooey and delicious, and was very well proportioned to meat. Overall this was an excellent burger that I wasn't expecting at all.\n\nWhile I typically don't care for them, my steak fries were actually really good; they were cooked well for the most part but there were a few soggy ones in there.  My side pickle slices were good too; they never made it onto my burger but I still ate them. At $9.25 with fries this is very reasonably priced; combine that with a beer or three and you're in for a good time. If you're looking for a unique local pub with plenty of drink and food options definitely stop by the Crown & Anchor."
        }, 
        {
            "index": 166, 
            "rating": 2, 
            "review": "I have repeatedly had the worst service in all of Vegas here. Unless you're sitting at the bar gambling, be prepared to wait: wait to order, wait for your drink, wait for your food, and wait for the bill. This last time wasn't so bad, however the time before that we had to wait for our server to finish taking pictures of herself with some other dude that worked there to get our bill. The food and drink is GREAT (scotch egg is top notch and the tender peas served as a side with many dishes a great comfort food to me), but the consistently poor service has finally eclipsed it. Bummer."
        }, 
        {
            "index": 167, 
            "rating": 1, 
            "review": "Was told this place had soccer games. Called to find out if they had the la galaxy game (which was on fox sport west) and was told \"we have all the soccer games, we've never missed one\". Although the guy had no idea who the galaxy were and was not knowledgeable about soccer.  We drove a few miles there.  The waitress had no clue to anything soccer related and simply pointed to a schedule chalkboard.  As expected only premeir league games.  What made this especially upsetting was that they were playing a college (american) \"football\" game on one tv.  This place does not play any major league soccer games and instead shows college football!!!! Also, so much for the \"we never miss a game\" I was told in reference to major league soccer.  But the guy obviously had no idea what he was talking about and I was skeptical going there in the first place."
        }, 
        {
            "index": 168, 
            "rating": 3, 
            "review": "It had been so long since I had visited Crown and Anchor.  Great ambiance, dimly lit and full of pub style decor.  It was a Saturday night and a friend and I decided to stop for a drink.  We sat at the empty bar and ordered a drink.  The bartender not too friendly which by how busy it was you would think he'd be excited to have some visitors.\n\nAnyways, I was suprised to not see alot of people here.  I love the ambiance.  The best part was we moved our little party outside.  The weather was perfect and it sits right along the side of street where you can watch the cars go by.  Little white lights line the patio-super cool.  I love outdoor seating (sigh)-especially when the weather is good.  I do want to come back and try the food.  I also think it is a good spot to have a party...the ambiance is perfect for bringin in a good group of peeps and they have alot of seating.  See ya soon!"
        }, 
        {
            "index": 169, 
            "rating": 4, 
            "review": "Food was delicious, Staff was attentive and friendly. Nice themed atmosphere."
        }, 
        {
            "index": 170, 
            "rating": 2, 
            "review": "We went for the fish and chips tonight.Was our first visit.We couldn't help noticing that the place could use a good cleaning.The fish tasted ok,but we were not blown away by it.Portion was small.Chips were good,peas undercooked.Server girls were nice,seated us and brought our drink orders fast.Village Pub fish and chips portion is larger,tastes better for less $.We still might return to check out some other menu items,they sound interesting.Free lunch for 20 in play sounds good."
        }, 
        {
            "index": 171, 
            "rating": 3, 
            "review": "Don't go for the food. Looks like it would be a decent drinking place. Hardly any TV's around to watch sports. Went out of our way to go and was disappointed. From my visit, not bad, just average I'm afraid"
        }, 
        {
            "index": 172, 
            "rating": 4, 
            "review": "In a town full of glitz, glam, and gaming, this is one of the only local pubs that I have found that downplays the gaming and focuses on the pub ambiance.  Of course there is gaming, if you choose, but it's subtle, so the dark, British pub feel comes through without being blinded by lights coming from the screens. They have plenty of beers on tap or in bottles, and offer a full menu worth of food.  The food is British pub style, so don't expect an abundance of spice or anything healthy on the menu, but it is what it is.  I go here for the atmosphere, it's what a great hangout pub should be.  It can get a bit loud when they have their DJ's making it difficult to chat with anyone more than one seat down, but during it's quieter hours (before 10 pm) I think it's the perfect place to have a drink and settle in, maybe play a round of darts or pool with the posse.  Of course, they always have football (soccer) on the tele, so if you're looking for a place to watch the game, you've found it."
        }, 
        {
            "index": 173, 
            "rating": 4, 
            "review": "Have yet to try anything off the menu, but I love coming here just for the atmosphere. Great place to end a date or night out with friends. Service is friendly and the whole place is very casual and laid back. Worth a stop if you're over on that side of town."
        }, 
        {
            "index": 174, 
            "rating": 5, 
            "review": "great pub!! the fish & chips and sticky toffee pudding are amazing. strong selection of english brews.  the self-proclaimed \"greatest bartender in the world\" Adam actually truly was!!  excellent service and hospitality...really talks and listens to the customers! so glad we found this place. :D"
        }, 
        {
            "index": 175, 
            "rating": 4, 
            "review": "Karaoke Wednesday's! It's a great time. \nThe karaoke DJ is super cool and he can be pretty funny. \nAll-you-can-eat Fish n' Chips on Monday's!! \nNot a huge fan of the food myself, not that there's much of anything vegan other than the fries. Some of the food is a bit pricey, but there are a select few that are a steal. Lastly, the servers are really nice and personable."
        }, 
        {
            "index": 176, 
            "rating": 3, 
            "review": "This review is for 3.5 stars.\n\nThis is a nice British pub.  I came here on a friday night to enjoy some beer and play some darts with some coworkers.  As far as a bar goes, it is pretty large and has a quality selection of import brews.  There is a jukebox that has some great music available as well.  Come here if you just want to chill near the strip.  The beers are not cheap by any means ($6-$8), but you can still have a good time nonetheless.  \n\nThe biggest thing about this bar is that they do not show prices on their beer menu.  This is one of my biggest pet peeves and really irritates me.  None of the beers are over $8 (I believe), but this always grinds my gears when it comes to bars."
        }, 
        {
            "index": 177, 
            "rating": 4, 
            "review": "I have never been to England to see what a real British Pub is like, but I very much hope it is like this one.\n\nFor an appetizer, my party shared a \"Giant Yorkshire Pudding\".  My mother had a British boyfriend when I was young and she made him Yorkshire pudding. This one was better than some I've had, but not as good as \"Mom used to make\". But since those weren't authentically \"Authentic\" it's tough to deduct points for it.  They got cold quick, but that was probably because of the \"Giantness\" \n\nProbably the best Scotch Eggs I've ever had are here. And you can get them cold OR warm (I personally recommend warm).\n\nI also had the Fish and Chips (Since I was going for \"The Classic\" British Style) and they were good.  Just one fish, but it was a pretty big fillet, so no complaints.\n\nWe finished it off with Sticky Toffee Pudding which was great!\n\nThrough all of this, the ONE waitress kept on top of a pretty busy place.  Considering she was the only one waiting tables her performance was extraordinary. Though as an understandable side effect, service was a bit slow and a member of the party never got the coffee she ordered with the Pudding.\n\nI wish I was in Vegas more often so I could stop in more often. I do hope to come back the next time I'm in town.\n\nOne other side note.. They do have a \"Pet Friendly Patio\" so you can bring your pet for a meal outside.\n\n(PS: Due to some drunkenness, I checked in twice.  I've only been here once. The second check in is wishful thinking. Unless it is very far in the future and I've been here more than twice.  In which case, subtract one)"
        }, 
        {
            "index": 178, 
            "rating": 4, 
            "review": "I love this place! Monday's are all you can eat fish and chips and it's delicious! I'd recommend ordering some hot tea and sitting on the outside patio! Super comfy and cozy place!"
        }, 
        {
            "index": 179, 
            "rating": 4, 
            "review": "fun place. Food was good. the owner is very nice. The waitresses are a little scantily dressed for a pub i think but I am sure it is to keep the men there. I am sure it is a fun place when the footie matches are on. I would gladly go back!"
        }, 
        {
            "index": 180, 
            "rating": 2, 
            "review": "The pub style is great, but the place feels like a sausage party.  The male to female ratio tends to be about 8:1 and of the 8, 6 are pretty douched up.  The food isn't very good....although the pies are decent.  Excellent selection of beer and fun trivia night.  The wait staff is hit or miss, and does feel a little like a strip club.  Dog friendly patio, which is great.  Not a bad place for afternoon summer drinks."
        }, 
        {
            "index": 181, 
            "rating": 1, 
            "review": "So. I've been coming here for years!--And brought these guys so much business and so many regulars in that time. The usual bartenders ( Steve etc.) are amazing. I could always count on Crown and Anchor to go above and beyond the call of duty. And that would be reflected in my tip. I recently had surgery...so after a couple months, My friend and I finally returned to our favorite British Bar. There, we meet the new bartender, Brian! When we said we wanted a \" sweet pussy\" shot... He replied, \" You're really gonna make me make you that fruity drink?\" I replied \" yes, please?...\" \nAfter 10 minutes we finally got our shots. After some time sitting and catching up, I walked up to the bar to place an order for a happy-hour British Burger. After asking me what I wanted, he interrupted me to say \"hold on I got like seven other orders\" and I waited and waited. Finally, he took my order and just seemed annoyed with me. Annoyed when I told him I wanted extra pickles... Annoyed when I told him I wanted cheese. Just annoyed. Clearly Brian wasn't aware that we were... WERE regulars here and have dropped hundreds on a check on any given night multiple times a week. He hasn't payed attention to us since and we have decided to take our business elsewhere! Where's Steve at bro?! Thanks, Brian! For ruining Crown and Anchor for us."
        }, 
        {
            "index": 182, 
            "rating": 4, 
            "review": "Great place to eat late at night.  Some of the best fish and chips. \nFish and chips- 2 big fillets with a crispy flakey crust. Fish is always moist and tastes fresh. Comes with fries. Chicken fingers are good as well.\nThis place is really close to where I live I only eat maybe once every few months. It usually satisfies tho."
        }, 
        {
            "index": 183, 
            "rating": 2, 
            "review": "I had to give 2 stars based on my latest experience.  3 of us stopped by for Saturday morning breakfast at 9:30am today and encountered a lady bartender who could not have been more rude.   The bar/pub had 7 customers - four at two tables and three at bar.  We waited for five minutes to be seated (per the sign) and when she didn't acknowledge us, I asked if we could grab one of the 8-10 empty tables.  She asked us to wait and went on doing paperwork and tidying up behind the bar.  After another 5 minutes we decided to leave.  C&A needs to talk to their staff or get friendlier people.\n\nI gave two stars because I remember how good the food used to be!"
        }, 
        {
            "index": 184, 
            "rating": 2, 
            "review": "Service can be spotty here. I have had some very friendly service that then turns into hanging around and chatting for far too long. Then some service with some attitudes.\n\nFor example, one time when I ordered a Black and Tan, the waitress came by and apologized for it taking so long. Then she sold out the bartender and told me that he didn't even know how to make one! Made fun of him for having trouble with googling it. Very awkward. Another time our waitress seemed to be mad that a friend had gotten his first drink at the bar. She never ever asked him if he wanted another drink when his glass was empty, even after I pointed it out to her that he would like to order something. \n\nFull disclosure: I hate English food so the sheppard pie I got here, I was not a fan. I just don't like English food. I don't really hold it against them because I don't think I am the best judge of this type of food. \n\nI reserve this place for just drinking and prepare myself for mediocre service. In the words of Tupac, that's just the way it is."
        }, 
        {
            "index": 185, 
            "rating": 5, 
            "review": "Arriving here with some friends and relieved I could get off the Strip to some local destinations, I entered a very divey smoke-filled bar. Parking was easy. One portion was a sit down area, while the other area was legitimately a bar with booze, cigarettes, and televisions a plenty. \n\nMy friends and I were quickly seated and waited upon by a incredibly friendly staff. Considering it was a Thursday night, we anticipated a heavy college crowd, but were surprised to find it half-full. After a round of drinks, dinner was ordered. My selection was the chicken curry. I ordered as-is and found the dish to be quite kicking. The medium-sized chicken cuts were doused with a thin yellow sauce. The sauce is what made the dish kick. Unable to figure out whether what made it kick outside of any curry taste, I was baffled and prayed that my stomach wouldn't hurt later. It didn't. The dish, while seemingly small for the famished, ended up being very filling. Complemented by chicken tenders, I was very full and quite happy. \n\nConsider this place if you're bored and want to get out of Vegas, and have a dinner with the locals. Without all the shiny, materialistic, commercialized stuff."
        }, 
        {
            "index": 186, 
            "rating": 2, 
            "review": "Well, its certainly gone down the tube.  I understand ownership is probably focused on their recent opening downtown but they need to do some quality control at the mothership. \n\nThere were two bartenders and the instant I sat down they discovered a million things to do other than come over and take my order.  They were really pointed about it too. Deliberately keeping their backs turned to the patrons, avoiding eye contact and all standard gestures that translate to \"I'd like to order a beer.\"  one bartender went so far as to open a drawer, pull out a pencil, step to the side, step back, and put the pencil away just to avoid having to do the five seconds of work it would take to pour me a beer and take my money.  I waited 10 minutes and nothing.\n\nThe only saving grace is the waitress responded quickly when I moved to the dining room and the food doesn't seem to have suffered."
        }, 
        {
            "index": 187, 
            "rating": 2, 
            "review": "I have been to Crown & Anchor a few times with friends.  I guess I'm just far too old to be drawn into the hype, but I was not impressed.  Perhaps if you just celebrated your 21st birthday and you want to get smashed, this is a good place for you.  I'm not that person, so I just find the droves of college kids annoying.  \n\nI didn't take away stars for that preference, though.  I took away stars for the food.  What is everyone so hung up on here?  I've done the whole fish & chips thing plenty of times in my life, and this doesn't even rate with me.  I agree with a previous poster who said that the fish just seemed like it was frozen.  I wasn't that into it.  I guess I'm nuts, because a lot of people swear by the fish here.  However, I've had better.  I've had WAAAAAAY better in other cities, and I've even had better here in Vegas.  \n\nThe service is slow if you order food.  I do enjoy sitting outside on the patio, but if I'm paying to eat something, I don't wanna feel like I basically paid for the ambiance."
        }, 
        {
            "index": 188, 
            "rating": 4, 
            "review": "Crown And Anchor. How do I love thee? Let me count the ways...\n\nThis place is a unique establishment, which, in Las Vegas, is an achievement. This place has so many draws. For example, the food is absolutely authentic British pub fare. It's the best in town. \n\nThe staff. What can I say? From the plaid skirts to the flirty service, the help is definitely easy on the eyes. And ladies, don't despair, because every male bartender is huge ( I believe a prerequisite for male employment is the ability to bench a Volkswagen). \n\nCrown and Anchor issues to its patrons a challenge. Whosoever can drink all 30 beers available on tap will receive a free Crown and Anchor T shirt in commemoration of their drunken prowess. It repeats up to four times for different swag. \n\nAnd did I mention Pub Quiz?  \n\nOnce weekly, on Thursday evenings, teams compete in an impossibly difficult trivia challenge, wherein teams are asked ten very difficult questions, spanning a breadth of topics. Thehighest scoring team receives a 50 dollar bar tab to be used at their next visit. It's competitive, free, and a blast. Highly recommended. \n\nSo should you ever get the hankering for English culture for a moderate price, a great view, and some stiff competition, the Crown and Anchor Pub is the place to be."
        }, 
        {
            "index": 189, 
            "rating": 3, 
            "review": "Great food. Sometimes slow service. Love that they are open 24/7 and service food at all hours. I Read a review about the place falling apart and being unclean. That has not been my  experience. It has always been clean no matter what time I have been in. And in no way comes close to a Divebar feel. \nOver all, you need to try it for yourself."
        }, 
        {
            "index": 190, 
            "rating": 3, 
            "review": "I am a huge fan of C&A, but I have to give it three stars for one major reason--time.  If you are looking to have great  times without dedicating your entire evening to the cause (well, at one place at least!), Crown & Anchor is not for you.  It WILL take you two hours to get three rounds of drinks on a good night.  Err, while I'm at it, I may as well mention parking as well.  I have only lucked out twice with parking at this place, and that was only because I pulled up as someone was pulling out.  On several occasions, my friends and I have parked at Metro across the street or Sherman-Williams and walked over.  Their parking lot is kind of hazardous, anyway.  It's very tight and really difficult to maneuver around in if you get stuck in a sticky place.\n\nBut now that I got THAT out of the way (I'm sorry C&A, for I do love you so!), let's get to the goodies.  My friends and I love this place for every reason you could love a pub.  Crown is super cozy and completely raucous at the same time!  When you walk in, you will see people from all walks: older groups enjoy it, the UNLV crowd is pretty big, business people head there after work, and clubbers hit it up for the predancetimebuzz.\n\nSome one mentioned the old wood, and wax, and it takes me back to my Nana Wendy's house.  I sit down and look at the menu and see my family's traditional \"home-cooked\" foods--shepherd's pie, bangers and hash, scotch eggs, cod and chips, curries--for even though I'm from the South, my father and his family are British!\n\nThe imported beers list gives a nice sample of the many great UK (and I mean all the countries involved, not just GB) beers, with plenty on tap.  If you're feeling adventurous, the bartender and *some* of the wait staff are very knowledgeable and will happily recommend something to quench what you're thirstin' fer.  \n\nIf sitting around outside with a smoke, a beer, and a group of friends at a great pub isn't enough excitement for you, inside they have darts, video poker, and several televisions for your pubbing pleasure.  They also frequently host events aimed at the UNLV crowd, like the British Comedy bash, music, and more.  Hello AbFab costume!!"
        }, 
        {
            "index": 191, 
            "rating": 4, 
            "review": "I love, love, LOVE Crown and Anchor.  It is that old standby when I can't decide where to go.  They are, of course, open 24 hours.  They have awesome graveyard food specials and a pretty decent beer selection.  I love sitting out on the patio (when it's not scorching hot, of course), and I believe that it is dog friendly.  They have a weird liqour license that only allows food in certain places....I don't get it, but it's never stopped me from enjoying this place!  Crown is the best place to watch soccer (or football for some!) and rugby, and it is easy to access from the strip."
        }, 
        {
            "index": 192, 
            "rating": 4, 
            "review": "The food was amazing but my drink was never refilled and the waitress took FOREVER to give us our check."
        }, 
        {
            "index": 193, 
            "rating": 3, 
            "review": "The decor was nice , it reminded me of a British pub back home.  The bartender was really nice.\n\nThe food on the other hand was something else.\n\nMy husband got fish and chips which he said was an 3 out of 5. He has has better and worse.\n\nI ordered the BIG Yorkshire Pudding. I was SO disappointed. It not only was burnt , but was TOTALLY HOLLOW in the middle.  Not ok at all\n\nThe Plomans lunch was nothing to write home about also not what I remember growing up. \n\nThe chips and butty. Was Good.. \n\n\nFor $43 dollars it to me WAS NOT worth it ..\n\nSORRY"
        }, 
        {
            "index": 194, 
            "rating": 4, 
            "review": "Great selection of beers on tap.  Sarah was our bartender and greeted us promptly when we approached the bar.  We enjoyed a couple of Boddingtons and Stellas throughout the evening while playing the jukebox and darts.  Love the layout of the bar and the dart area.  Only thing stopping me from giving a perfect rating was the condition of the left dart area.  The wall has a hole beneath the dart board and a fellow patron lost a dart through it and was unable to play anymore since there was only one set of darts available."
        }, 
        {
            "index": 195, 
            "rating": 2, 
            "review": "I actually can't even believe I'm leaving this place two starters I've gone to both Crown and Anchor bars and they have both been horrible horrible experiences yucky boring food not to mention slow slow service overall just a dump!  It's kinda a place kids go to watch soccer and game on dirty machines."
        }, 
        {
            "index": 196, 
            "rating": 4, 
            "review": "Was here last night to meet up with some friends for Monday Night Football and to have a couple of Beers before dinner.  We settled in around the bar and browsed the Beer menu.  There was so many to choose from and I was indecisive, so the waitress said she'd bring me a few samples so I could make up my mind....bonus.  \n\nAfter tasting a few brews, I went for the Fullers ESB.  It's a very good tasting English Ale that was very fulfilling.\n\nAlthough I've been here many times in the past, I learned something new.....you can't order hard liquor at the bar!  A friend of ours tried to order a Crown and Coke and they said that you had to be in the dining area and had to order food with a hard liquor order.  The reason is that their liquor license is for a Tavern, which means only Beer & Wine at the bar.....hard liquor in the dining room.  That sucked for the people in our group that didn't drink Beer or Wine.  I guess I never knew since I've only ordered Beer when I come here.\n\nOverall, it was a good time for everyone.  Will definitely be back again."
        }, 
        {
            "index": 197, 
            "rating": 4, 
            "review": "The Crown & Anchor is, from the places I've been to, the best pub option in Las Vegas - and I say this as a girl who was born and raised in a bar and lived in Louisiana for several years, where Miller Lite might as well come out of the faucet.  It's a nice, relaxing atmosphere, and you can play pool in a quiet second floor game room if you would rather not be at the bar. It does get pretty crowded on weekend evenings, but the service, food, and beer are still good.  They have a sufficient selection of beers with an emphasis on British beers (obviously, considering it's a British pub; however, if you're a beer snob looking for a wider selection of beer and microbrews then you should go to the Freakin' Frog around the corner). \n\nThe negatives for this place are that they have a very small parking lot that often can't accommodate all of their guests, and they are right next to a very dangerous intersection: I've witnessed two car accidents in less than half of a year.  Also, there's no easy way to get here without driving.  The whole point of pubs is that you shouldn't have to drive!\n\nThe final, fantastic thing about this place is that it's the only pub I know of in Las Vegas where dogs are allowed (on the outdoor patio, of course)!  I have yet to come across any misbehaving dogs - and fingers crossed it stays that way so they don't get banned!"
        }, 
        {
            "index": 198, 
            "rating": 5, 
            "review": "This used to be a once a week destination while I was in college!  This is a great little bar.  I would love to work there for a day just to wear their cute plaid skirts!\nI haven't eaten a ton of their food...but it's typical bar good...greasy and tasty with a nice beer!\nThey have 30+ beers on tap.  Darts and other bar games.  They have video poker, if you're interested in gambling while you drink.  Really fun to be there while soccer is playing.  The outdoor seating is really nice, especially at night."
        }, 
        {
            "index": 199, 
            "rating": 1, 
            "review": "Says open 24 hours. Went in for breakfast as they had advertised good breakfast somewhere. It smelled like a rank, spicy fart inside. There was only 1 person in the whole place, playing video poker. Unsure if they worked there or not (I don't think they did). No one showed to seat us. After waiting a while, just left because we couldn't take the smell anymore."
        }, 
        {
            "index": 200, 
            "rating": 3, 
            "review": "The food was very good but the restaurant was understaffed. What should have been a 40 minute lunch turned into a hour and a half voyage. The atmosphere was excellent. Know know it's a good British pub when the ex-pats are in to watch the footie on the big screen."
        }, 
        {
            "index": 201, 
            "rating": 5, 
            "review": "Rob is the best bartender and we always have a great time at the Crown!!! They have a great British burger!!! And Rob is so quick with his service when my beer runs low he already has a new fresh ice cold beer ready!!!"
        }, 
        {
            "index": 202, 
            "rating": 2, 
            "review": "It has been quite awhile since we have eaten here. Even though the food was always good we never liked the fact that they didn't have a true non smoking section. The restaurant is non smoking but is adjacent to a bar where smoking is allowed and there is no separation between the two. If I can smell it and need to shower when I get home than it is not non smoking in my book. That is not my complaint however, I knew what I was getting into there. My complaint is about the service.\n\nWe waited a longer than acceptable time to order. We were all pretty hungry and some of us ordered the pies which we are aware take longer than the average entrée so we ordered a cup of soup in addition. Our server was either absent or darting by so fast we couldn't get her attention between when we ordered and our food came out. Several of our drinks were dry and those of us who ordered soup were wondering if it had been forgotten. In addition a couple of us wanted to order something from the bar but gave up on that idea. The soup did came out with the entrees and when I commented that I had expected it quite awhile ago the server just said that the kitchen put everything out at one time.\n\nNow I am not naïve or self centered enough to think that they made a special pot of soup for me so I am not sure what was so difficult about ladling it into a cup, or more importantly why she didn't check on it when it didn't come up very shortly after the order had been placed. I was not expecting a grand gesture but a simple apology would have sufficed. To add to that our glasses sat empty until my husband stood up and called her back and requested refills.\n\nThe food itself was pretty good. The stilton and cabbage soup is excellent and the steak and mushroom pie is very tasty if not a little sparse on filling, especially for the price. The mashed potatoes were the one bleak spot of the dinner, not even warm and hardened as if they had sat out for too long. So overall, pricey for what it is and service seems to be pretty spotty. Not enough to entice me back to contend with the smoking aspect."
        }, 
        {
            "index": 203, 
            "rating": 5, 
            "review": "Very pleasant time at this place. Came on a Sunday night early evening, light crowd. Excellent chicken curry as others have mentioned (if I had to guess I'd say the mushrooms are actually cooked fresh and not just out of a can), let it sit for a bit to cool off, tastes better this way. Bartender, Brian, was great, very attentive to everyone yet made time for some interesting conversation. The GM (friendly British lady) checked on me a few times and seemed to appreciate feedback. Lastly, wonderful atmosphere, like a long log cabin!  No loud music or televisions either, will be back!"
        }, 
        {
            "index": 204, 
            "rating": 1, 
            "review": "I know this is mainly a bar for drinking and watching sports, but they serve up some especially bad tasting and horribly prepared food here.\n\nI initially ordered the steak and mushroom pie, I had it sent away since they felt the need to only put two pieces of steak in the entire pie. The fish and chips I got instead was so flavorless and overly battered. It was noted by my other companions that it looked like I was eating a baked potato with how much batter I was digging through just to eat some fish. The fries were unseasoned, soggy, not crisp, and straight out of a Ore-Ida bag.\n\nIs salt and pepper illegal in Britain? Since I was with my buddies, I was able to try other things at the table. Nothing was seasoned and didn't have any taste unless it was drowning in their brown gravy or came with a dipping sauce. Out the can peas were on both of my plates. Barely warm, no salt, no pepper, no butter, no olive oil.\n\nAfter paying 18+ bucks for food and drinks, and being stuck eating mostly french fries and overly battered onion rings, I left knowing I wont be coming back here."
        }, 
        {
            "index": 205, 
            "rating": 4, 
            "review": "Came here to watch a Man U v. Liverpool match and had a great time! They had plenty of screens, so I had no problem seeing the action. Had the English breakfast, which was delicious. The service was also very friendly. My only complaint is that the service was a little slow, but I'm sure it would be good when it's less busy."
        }, 
        {
            "index": 206, 
            "rating": 2, 
            "review": "EDIT: added 1 more star since the management seems to be good at replying back to customer reviews x\n\nBianca has horrible customer service.\nI asked her for a menu, she asked me to wait for just a moment.\nSo I stepped back and waited.\nBut then she started talking to another server, taking her time.\nSo I asked her if I should just ask someone else, since she was busy.\nShe rudely told me that she would get it and acted as if it was a privilege to have her help me out (like why was I even asking her for a menu??? I guess she doesn't consider it part of her job??????)\nDefinitely ruined the night for me.\nNot coming back.\nAt that point I had already ordered a glass of wine, I gave up on ordering food because I didn't want to give my hard earned money to someone so horrid.\nWe came in with a medium sized group of girls and we were ignored until we flagged a server down.\nI don't know if Bianca is really her real name or if she gave me a fake name, but she was wearing a red plaid skirt with a black top with black hair. Super skinny, around 5'2.\nTry to get a different server if you get her.\nShe continued to act as if she was doing me a favor by finally getting me a menu AFTER I told her I wouldn't be needing it anymore (she handed it to me with a \"there, are you happy now?\" kind of attitude).\nThis review is all over the place because of how mad this girl made me. I literally could not stop shaking with how horrid her customer service was.\nObviously the manager should either have a more rigorous training/hiring process or learn how to fire employees that hurt your business (as I'm sure I'm not the first one swearing never to return due to her rude ass).\n\nEDIT: Hello Richard, thank you so much for replying, it really does make me feel much better to know that you even bothered to read my review. This situation occurred on December 16, 2015 at around 9:50pm on karaoke night. The server \"Bianca\" was talking to the server with curly copper hair and glasses."
        }, 
        {
            "index": 207, 
            "rating": 3, 
            "review": "I liked this place. We wanted a proper British-style roast dinner for Easter and this fit the bill. We got there just after noon on Sunday and had the place to ourselves (I know, we are bad people to go to a bar on Easter, but it is Vegas, so...).\n\nThe food was pretty good, although the lamb was very fatty and the beef was a bit overcooked. The veggies (peas and carrots) were cooked very well. Hot but slightly crunchy - no overbuild mush here. The mashed potatoes were real and the gravy was brown and rich. I question whether we got yorkshire pudding or a popover as it didn't have any beef flavoring, which was expected based on how it should be cooked. Regardless, it was pretty tasty.\n\nI know several reviewers complained about the service, but we had no problem at all. Sure, we were in an empty bar, but I can't discount the service we got because of that. If I had any complaint about the place is that it had a bit of a grimy (not well cleaned) feel to it. Again though, I bet if the other bars we frequented in Vegas were brightly lit I am sure I would have felt the same. \n\nI would certainly come back here again as they had great beers on tap and their prices were great.\n\nReply to Richard: I am from ND but get to Vegas a few times a year. Next time you can buy me a pint and I will repay the favor."
        }, 
        {
            "index": 208, 
            "rating": 1, 
            "review": "As regular (and once happy!) customers of the Crown & Anchor, I thought it would be nice to watch The Grand National over a few pints and some breakfast with my wife who'd never seen the event before and had been looking forward to it for a week prior to the event. We usually visit with friends, family and anybody else we can find to bring along! It's a great atmosphere and worth paying a little extra for the imported draughts! As I'm a British and a US citizen, living in Las Vegas, we thought it would be a nice start to the day as the race started at 8:15am here.\n\nI tried calling the pub three times before arriving to check if you were showing the race on TV, but the telephone went to the answering machine each time. We arrived around 25 minutes before the race and asked a Mexican bartender working there if you would be showing the Grand National. She immediately replied \"Yes, of course!\". Without hesitation, we bought a pint and sat down looking the menu over for some breakfast!\n\nSeveral minutes passed and all the main televisions were still only displaying the Man U and Newcastle football game. We'd all but missed the pre-race commentary and race line-up, I finally had to asked what time she would be turning the TV over. She said \"I'll change it in just a minute\" and walked away. Five minutes before the race started (and after asking the cleaner/repair chap also because the bartender had disappeared on us), the bartender came over to our table and said \"You wanted the Chelsea game?\". I don't believe for one instant that she comprehended what I had asked before purchasing drinks. I told her that \"we came to see The Grand National\". She seemed confused and asked somebody else working there. Another lady in her early 30s came over and asked what we wanted. When I told her, she said something to the effect of \"I don't understand, what's The Grand National?\" having no idea what we were referring to.\n\nWe were very disappointed. Not only did we miss the race (we arrived in plenty of time so that we'd have other options if it was not shown there), but we were lied to. We sat there feeling like idiots with drinks to accompany, quite frankly, nothing! It was also sad to hear that, in a British Pub, none of the workers currently working had any idea what a near two-century-old race even was!! So if you wondered why somebody left full drinks on the table, that was us. As regular customers, I think we will take our patronage elsewhere. I will just have to wait until my bi-annual trip back to the UK to experiences and delights that I am still missing."
        }, 
        {
            "index": 209, 
            "rating": 5, 
            "review": "Ever since my freshman year of college I have driven past this place literally hundreds of times and never gone inside.  It wasn't until my junior year that I went with a few friends to have a drink at this quaint littler tavern, and oh my God was I surprised.\n\nOn the outside it seems like a sleepy little pub on the outskirts of London, but on the inside is anything but.  The Establishment is divided into two main sections: a dining room and the bar area.  My friends and I decided to get a bit to eat first and participate in drunken debauchery afterword (Just Kidding (*Wink)).  \n\nThe dining room had the best of both worlds; the look and feel of an authentic British pub, with four huge Widescreen TVs on each corner of the room, blaring out endless sports center highlights from the day.  The waitresses were dressed in skimpy little outfits and actually knew some of the girls on a personal level from school.  The service was great, but not excellent.  They were very nice to me and my buddies, probably because we were friends, but the service could improve if the hosts and waitresses would treat the other patron with the same level of costumer service.\n\nThe best part about his restaurant was the food.  I had Fish and Chips and I have to say that they were the best damn Fish and Chips I have ever had period.  I have been      here many time since then and I swear the food gets better every time.  They also have a huge selection of assorted British beers which I have to admit is pretty damn awesome.  Th food is great, the beer is great, the atmosphere is great, the girls are great, what more could you ask for in a bar?  I rest my case, Go to Crown and Anchor now!"
        }, 
        {
            "index": 210, 
            "rating": 1, 
            "review": "Came in at Happy hour ordered the fish and chips and was was charged 13.95. Then I check the online menu price and it 10.95. Ordered a Guiness 6.00 happy hour price.  Needless to say I was ripped off. Will not be coming back. I will spread the news far and wide. Service was good. And a well poured pint.  You do realize on the strip at 9 fine Irishman happy hour pint 5.00. Happy hour food cheaper. \nReally disappointed."
        }, 
        {
            "index": 211, 
            "rating": 5, 
            "review": "Bloody Brilliant! Excellent choice of beers on tap. Outstanding traditional menu. Scotch egg is amazing!\n\nLove this place, you wont find any annoying American football idiots here...."
        }, 
        {
            "index": 212, 
            "rating": 4, 
            "review": "My party of six wanted to enjoy the Super Bowl together and were lucky enough to find this gem. Wonderful assortment of beer. Great menu (Don't leave without having the scotch egg) of traditional faire (better add Yorkshire pudding to your order as well), great service -- the skirts rock too! Thanks again! Hopefully this trip and your restaurant becomes tradition."
        }, 
        {
            "index": 213, 
            "rating": 5, 
            "review": "Didn't want to review the place until I had the food.  The first two times I went I was on a liquid diet.  On my quest to find a cool place to watch the world cup games my co-worker told me about C&A.  \n\nMy first visit was for the U.S.-England game it was an awesome experience.  Even though the U.S. fans were out numbered a bit we represented.  Besides a couple cheeky remarks everyone got along wonderfully.  \n\nSecond visit to C&A was for the the U.S.-Algeria game, and unless you are a hermit we all know what happen that game.  Epicness happened.  When Donovan scored that goal it was absolute bedlam.  It is was one of the greatest moments of my life.  What a great feeling to celebrate something like that with your fellow countrymen and women.  But just like the England game all I had was beer.\n\nIt wasn't until recently that I had the food.  I was in the area and decided to give the food a try.  And I'm glad I did.  I had the Fish and chips and they were good.  I'm not really a fish guy, but I thought I would have the house specialty.  The truth is I would give this place a four star, but since I experienced one of the greatest thrills of my life it gets a five.  C&A is hand's down the best place in Vegas to watch Soccer and the food is good."
        }, 
        {
            "index": 214, 
            "rating": 5, 
            "review": "Best burger I've had in Vegas.  Probably best wings too..  Was hoping for more variety as far as wing flavors; but the hot really hit the spot, so I'll be back!  Nice beer selection too!"
        }, 
        {
            "index": 215, 
            "rating": 3, 
            "review": "As stereotypical British pub.  They have all the classics here.  Staffed by women virtually in costume, they were nonetheless very attentive and friendly.  I was unimpressed by the steak and kidney pie, but organ meat is difficult to prepare.  The other dishes at the table were great.  A favorable selection of draft beers was nice, but they were poured in the American style, which takes off points for style. Not a fan of the bar, which has those reprehensible integrated gaming systems, but that is a personal pet-peeve. \n\nAll in all, I'd go back with friends if they want a pub night, but not otherwise."
        }, 
        {
            "index": 216, 
            "rating": 4, 
            "review": "The food is great. The service is okay- nothing to write home about. Their late night specials are good. During the day- it is a little pricey."
        }, 
        {
            "index": 217, 
            "rating": 2, 
            "review": "I usually love coming to this place, the atmosphere is always fantastic and usually the same applies for the food and.service: but today it was leaving. My bangers and mash was so-so, and while our waitress was nice enough, she had no enthusiasm and we waited for her to come and take our check (which needed to be fixed due to a mistake first), for at least 15 minutes. Not sure I'll be making the trip down here again anytime soon."
        }, 
        {
            "index": 218, 
            "rating": 5, 
            "review": "As a frequenter of Vegas, this is easily the best local bar in the whole town. I love starting/ending my nights here. With a great selection of beer and a surprisingly tasty menu, I can't get enough of this place. The bartenders are awesome and definitely take care of you. The regulars are friendly. Having not grown up in Vegas and my parents moving there 7 years ago when I was 18, I didn't have any friends when I go to visit them until I discovered Crown & Anchor. My first night there I walked in by myself and met some new friends and a few girls and ended up staying until 10AM full of shots. Awesome time every time. As many times as I try other places, I always just come right back to C&A."
        }, 
        {
            "index": 219, 
            "rating": 4, 
            "review": "The waitress and bartenders are gorgeous and everytime we've come here they have been pretty nice. Oh yeah the food is great too. I want to try the banger's and mash next. Had the cottage pie and it was delish. Just let it cool down a bit before you chow down or you will fuse your upper mouth with the lower and the only tasting you will do will be your firts bite."
        }, 
        {
            "index": 220, 
            "rating": 5, 
            "review": "Crown.  Anchor.  Either one by itself would be sufficient for excellent dining.  But you put them both together and you get:\n\n1. Bartenders/waitresses with kilts and knee highs.  Damn.\n2. The scotch egg (!) which is a hard boiled egg wrapped in sausage.  Shit yeah.\n3. English soccer, and, better yet, english soccer fans at 430 in the morning on saturday singing and chanting to their teams.\n\nThe food is pretty decent but I have to tell you that there's more, like the huge beer selection and did I mention hot waitresses with kilts and knee highs?  Go there when a live soccer game is playing and there will be a crowd and a cover, even at 3 or 4 in the morning.  I shit you not."
        }, 
        {
            "index": 221, 
            "rating": 4, 
            "review": "We were in Vegas for my bachelor party and we were looking for a place a little bit off the strip with some good beers and decent food.  Crown and Anchor was that place for us.\n\nI am a chicken finger nut, so hearing that they were good here, got my attention.  We were also going to be watching the US world cup game against Germany, and we found out after the fact that C&A had made the Thrillist list for top 10 places to watch soccer in the US.  While it was a little warm, the atmosphere did not disappoint.\n\nMy friends and I sat up a little upstairs nook to watch the game.  We all ordered the chicken fingers before the kitchen closed, as they were grilling burgers for the crowd that day.  The service was pretty good, given the number of people packed in the bar.  We got to try a good mix of beers and had a great time overall."
        }, 
        {
            "index": 222, 
            "rating": 5, 
            "review": "I absolutely love this place, it's my favourite pub in Vegas. Food is great (I lived in the UK and this place serves almost authentic meals), staff is friendly and was very helpful when organizing my birthday party there. Will be going back shortly!"
        }, 
        {
            "index": 223, 
            "rating": 1, 
            "review": "For years me and family members have driven past here and have always wanted to try the experience. I pretty much guessed beforehand going into this that the place would be a little divey since after all it's a pub, however I wasn't prepared for how my meal here went. Walking up to the entrance you see their patio area for pets which I think is a cute idea but then seeing the grass having huge divots and holes with standing water in them going stagnant made me feel like I would never want my dog to visit here. Then came walking inside. We waited to be seated since there is a sign kindly requesting you wait to be helped, well waiting we did, then waiting some more & some more which felt strange since there was only maybe 10 other guests there tops. The hostess was kind, I was surprised to see how hiked up her skirt was but again I thought \"well this is a pub in Las Vegas\" so I wasn't upset. She was kind enough to take our drink orders and return with them a short time later, when she came back she took our meal orders: bangers & mash and fish & chips. We then waited a long time to see the hostess/waitress again it was about 40 minutes for our food, which wouldn't have been a big deal if the food we got back was hot and appetizing. The bangers & beans were Luke warm and the mash was cold with cold gravy where it's more like meat flavored jello than gravy. The fish & chips were okay in the sense that yes it's fried and a huge piece of fish but I wasn't expecting it to be soaked in oil when I received it and the side of peas appeared fine until I watched a small fly crawl out of them and fly away. Trying to make the best of it with my guest we decided to have the food be taken away and we dared enough to try dessert which was probably the only thing we did enjoy. The things I failed to mention through out this review is that while sitting there the entire time we really took in how filthy the place is with holes in the wall, dirty light switches and scuffs everywhere and creaky filthy floors & A LOT of spider webs everywhere A LOT. The tables are spaced out about 2 ft apart which wasn't a big deal, but my prior mention of the hostesses uniform made it uncomfortable when she bent over to fix up the table next to us which was also odd considering the place setting I was seated at was already dirty from someone else eating on it. I think the worst part of all was leaving their one way parking lot and seeing the back door being held wide open with a rope, immediately all of my food handling knowledge & certifications kicked into high gear knowing that open doors are a EXTREME no no because it allows pests of all kinds directly in. All & all its not a place I would go back to and it made me feel awful that I actually invited someone to join me without checking it beforehand, I won't be returning & nothing could make me desire too. So much more happened but I'm done talking about it. I dined in on 10/10/15 around 2:45pm"
        }, 
        {
            "index": 224, 
            "rating": 2, 
            "review": "I am sorry, but I sooooo wanted to like this place.  I mean, what's not to like?  It's a kitschy little bit o'Britain right on Tropicana in the middle of the freaking desert, how can you not like that?\n\nWell, let's just say we stopped by their this afternoon for a wee bit o'food coming back from McCarran and oh my was I disappointed.  \n\nNow, there is no doubt they have an excellent selection of draught beers and I quite enjoyed my Belgian wheat beer, but sad to say, the Mrs, had an ice tea and she had to get a Sprite, because the tea tasted like water, yuck!\n\nAnyway on to the food.  Again like another poster mentioned, the fish & chips were just kind of sad.  I mean here we are sitting in the middle of supposedly  Her Majesty's finest establishment expecting British excellence and the fish seemed like something that had been bought at a Costco.  \n\nOK, you are right, this is the middle of the Mojave Desert and there ain't no friggin' ocean anywhere near here, but come on, I have had better frozen fish at lots of places that are far from the sea.\n\nNow on to my Ploughman's Lunch.  Oh, how I do like a Ploughman's plate, and to tell the truth they did do a wee bit better here than they do with the fish.  But the bread was dry and almost stale, and  the cheddar cheese tasted like something you'd buy at a supermarket.  Now the Stilton was a nice piece of cheese, though not the best bleu cheese I have had but not the worst either.  The tomato was fresh, but I was a bit expecting the beets to be pickled but they were just cold cooked beat slices.\n\nService was fine, though nothing spectacular.  The young lass who served us did a good job, but she didn't provide excellent service, it was just kind of a step above adequate.\n\nAgain, I really wanted to like the place.  The atmosphere is cool in a corny kind of a way.  I am fond of kitsch, but if you are going for kitsch you also have to provide more than a semi cozy English pub type environment.  You also need to have food that is going to live up to the hype, sadly the Crown & Anchor had the sizzle, but no steak."
        }, 
        {
            "index": 225, 
            "rating": 1, 
            "review": "What a dump!! I am a Brit in Vegas so I thought I would go to the Crown and Anchor to watch the footie. One end of the bar was covered with stacks of dirty beer glasses. The place was filthy and absolutely minging. The waitress was awful and the food I saw coming out of the kitchen I would not feed to my dog. I left after one pint. Shockingly awful!\n\nI think the worst bar I have ever been in!"
        }, 
        {
            "index": 226, 
            "rating": 4, 
            "review": "I've lived in Vegas for 9 years. For some reason, I had not made it over here until recently. I've been to most of the well known dive bars and pubs around town. This place has a solid beer selection. The staff is very friendly. Adam is very cool and makes you feel nice and relaxed. The vibe is always upbeat and chill. The food is very tasty! If I had to complain about anything(it's a small one)...it would be the need for a few more upper end craft beers. They have a solid selection...but with the addition of a few more Belgians or sours and it would be great!"
        }, 
        {
            "index": 227, 
            "rating": 5, 
            "review": "I love this local bar \nI won the Halloween contest! \nThey love me there! \nAdam the bartender is so fun and nice! \nIt's only good at night\n\nIn the day it's weird with English tourists and quiet\nThe food is good. \nLove their scotch egg and fish n chips\n\nThey have salads \n\nI even had a catered birthday party here. \nMy friends liked it. \nNice to watch \"football\" games ."
        }, 
        {
            "index": 228, 
            "rating": 5, 
            "review": "This is my favorite pub anywhere! I grew up in Las Vegas and started coming to the Crown and Anchor in the late 90s for the all you can eat fish and chips.  The food is amazing, but the service is somewhat slow at times.  I have since moved to Los Angeles, but everytime I'm back home to visit, I must make a stop into the Crown and Anchor. Bottom line, great food, good price, fun atmosphere."
        }, 
        {
            "index": 229, 
            "rating": 3, 
            "review": "Went here with my wife for lunch and had a great time.  I wanted a british beer so I just told the waitress to surprise me and that she did.  It was excellent.  I ordered the fish and chips and was not disappointed.  HUGE chunks of fish and it was light and flaky and I enjoyed the heck out of it.  My wife on the other had ordered a lamb stew that was very very lamby, and I love lamb but when I tasted it, it made me jerk my head.  I had that lamb smell in my nose so I had to chow down on my fish and vinegar goodness.  It was fun though."
        }, 
        {
            "index": 230, 
            "rating": 4, 
            "review": "Recently enjoyed another dinner on their patio with my lovin' man. This time, we both were in a breakfast kind of mood, so went for the Gammon and Eggs. Gammon is similar to ham, but the British version is called gammon and is a bit milder than American ham, and the steaks are generally round in shape with a center bone. Eggs were cooked properly, although I wish our plates had been served a little hotter. Overall, another great meal at Crown & Anchor on Trop.\n\nIt was a great breakfast, and their great coffee worked beautifully with it to squelch our hankerin' for breakfast."
        }, 
        {
            "index": 231, 
            "rating": 5, 
            "review": "Possibly one of the most authentic fish-and-chips in Las Vegas - the only thing missing - the meal properly wrapped in a British newspaper and a cockney speaking bladdered* gooner**\n\nThis pub has character. Although it has not been opened for long ( I think I saw something that said 1980s or 90s), it feels like its been around for a very long time.\n\nThe dining room is very small and when its at capacity you'll have to wait for a table.  Your best bet is to get a seat at the bar.  At the time of my visit, the waitresses were a bit overwhelmed.  We told the waitress that we'd wait for a table at the bar.  I guess she forgot about us because she sat a party that came though the door before sitting us who were waiting; so, we just opted for sitting at the bar.  \n\nThe bar tender on the other hand, was super nice.  He ended taking our order and noticing that our food had not come out, compensated our wait with a beer.\n\nOf note is the locals and their understated like for the video poker.  Keep an eye on them, its fun to watch them play.\n\n*bladdered = very drunk\n**gooner = Arsenal fan (Arsenal is a football team in England)"
        }, 
        {
            "index": 232, 
            "rating": 5, 
            "review": "Dude. The atmosphere of this place is top notch. The food, and drink is excellent. Monday's are all you can eat fish and chips, and it's probably the best in town. They are a great place, if you love watching soccer, you will be in ultimate heaven."
        }, 
        {
            "index": 233, 
            "rating": 4, 
            "review": "Forget the more American offerings on the menu.  Just have the fish and chips--with mushy peas.  Dip your chips in the mushy peas instead of the tartar sauce.  Their fish and chips are perfection, and English-style perfection at that."
        }, 
        {
            "index": 234, 
            "rating": 1, 
            "review": "Horrible time! I have been going to C&A for 6 year now. I haven't been for about 4 months. Today I went to watch the Arsenal vs. West Ham match at 5:30am. The place was packed with about 12 Arsenal supporters and about 10-12 West Ham supporters. The bartender was a complete tool and acted like he owned the place. He was obviously messed up on something. It took him forever to get our drinks. When the game started he still had to jukebox playing over the audio system. Several people started asking him to put the game audio on. He kept making that fingers rubbing together money signal like we needed to pay him. Finally I cornered him coming out of the kitchen and asked him to put the audio on. In a quick response he said \"If you pay me.\" I threw $2 at him and said here take it. It then took him 10 minutes to get it working. He's a complete tool and thinks he runs this place. Horrible experience and I doubt I will ever be back. I have watched dozens of matches in the place and it has gone to shit. The problem is all the cabbies drop tourists off at this place and there really isn't another football bar in Vegas that I know of. Super annoying and I am pissed off about the bartender. I have been several other times when he's working and its a complete buzz kill. Its a complete shame because this place could be cool."
        }, 
        {
            "index": 235, 
            "rating": 5, 
            "review": "Came here to watch Manchester Unites play today. This place is great to watched the matches. They are open 24 hours so you can catch any game(even the ones at 4am). They have good prices on food and drinks. They also have a great draft selection."
        }, 
        {
            "index": 236, 
            "rating": 5, 
            "review": "My friends and I had lunch here yesterday for the first time ever.  Some very interesting English items on the menu and some I've never had before.\nLet's start with the pasty that one of the diners had. I can't comment truthfully on this because the pasties that I've had all my life living in Michigan are made differently but these were still good. So I'm just partial to the different way of making them.  Have to admit they were large and well-made with a generous amount of mashed potatoes and brown gravy.  Forgot to mention we started with a cup of their incredibly delicious creamed cabbage and Stilton soup. Wow! \n\nThe rest of us had their much touted fish and chips and that I can tell you I've had many,many times in many,  many places but these were exceptionally good.\nOne very large,  thick piece of perfectly done, fresh Icelandic cod lightly breaded-and one was enough. One diner and I substituted the fries for onion rings which we both loved.  The fish and chips come with a generous portion of peas... Very English indeed.\nService was outstanding from the minute we walked in until the minute we left. Our waitress Jessica was not only very friendly and outgoing but treated us like guests in her home.  We definitely will go back and we hope we get Jessica again.\nI would recommend the Crown and Anchor."
        }, 
        {
            "index": 237, 
            "rating": 4, 
            "review": "Looking for dinner while on a business trip. sort of lost, saw this place and stopped out of aggrivation. Small and quaint beer and dart bar with a great British menu. Server (Sarah) was very nice and the food was delicious. Get the meat mushroom pie. Came with whipped mashed potatoes and veggies. Plenty of beers to chose from. Outside is run down, but inside is clean and nice. Got lucky here."
        }, 
        {
            "index": 238, 
            "rating": 1, 
            "review": "We both went for fish and chips,  what a major disappointment,  we got one piece of flavorless fish with fries and undercooked peas.  They didn't even drain the peas sufficiently,  so now the breaded flavorless fish and fries are soggy from the pea juice.  The waitress only came by once to check on us at the end of our meal. My wife had to twice walk to the bar to get her water refilled.  \nAll we got was a,  \"sorry,  that is our feature dish',.  Now that was scary if that's their best plate!"
        }, 
        {
            "index": 239, 
            "rating": 1, 
            "review": "Wow I used to love this place. I just went there and it took me 25 minutes to get my first drink 30 minutes to get my food 20 minutes for each round of beverages and it took me 45 minutes to get my bill at the end , come on...... I think it is because I was not sitting at the bar , I was sitting at one of the few slot machines on the side. Everyone at the bar was getting fast service . The bartenders were either neglecting the waitresses or the waitress that I had just forgot to put in my orders... I dunno!!\n\nRichard it was the same day I arrived there at around 9 PM"
        }, 
        {
            "index": 240, 
            "rating": 4, 
            "review": "I recently started going to Crown & Anchor because of a suggestion from a friend. We usually go to the one on Spring Mtn, but this one is closer to my house. For a Friday night around 10pm, this place was moderately packed. \nLet me start off by saying that THE ONLY REASON I come to Crown & Anchor is because of the Snakebite. I would come here everyday if I could for this  damn drink. I never in my life had liked beer so much until I found this tasty delight. Both locations have darts which is always a fun activity to do with a group of people too. A friend of mine also ordered this dish that included Home Made Potato Chips which were a hit at our table.\n\nI can't say better things about Crown and Anchor. A+ to them."
        }, 
        {
            "index": 241, 
            "rating": 4, 
            "review": "If you are looking for an authentic British pub you found it. Sausage rolls amazing, scotch eggs and fish & chips good. I come here everytime I come to Vegas."
        }, 
        {
            "index": 242, 
            "rating": 3, 
            "review": "Things I like about the Crown & Anchor:\nThe location (off the strip, but not too far off, close enough to walk to Thomas & Mack for bball games)\nThe beer selection (Chimay on tap is pretty rare in LV)\nThey have darts and a jukebox.\n\nThings that are just ok:\nThe parking situation (not too many spots, especially tight on game day, you usually have to park at the paint store or the llantera and hope you don't get towed).\nThe food (burgers and fish & chips are decent)\nThe prices (reasonable, but I wish happy hour went past 6)\nThe ambiance (pub-ish)\nThe service (sometimes good, sometimes slow)\n\nThing I hate:\nThe smoking! (yes, they still allow it!)"
        }, 
        {
            "index": 243, 
            "rating": 2, 
            "review": "Giving this place an extra star because our server was really sweet. We came with a large group of about 15 people and they sat us in the upstairs area next to a foreboding \"Max. Occupancy: 9\" sign. Luckily, we all survived the experience, but the service was exceptionally slow and the food was pretty disappointing. I thought you could never go wrong with fish & chips at a British pub, but mine didn't have any flavor at all. The server felt bad that we had to wait so long so she brought us all plates of \"chip butties\" which are just french fries on a buttered roll. Don't knock it til you try it... that was actually better than most of our meals.\n\nThis place does seem fun as a bar since they had Monday night football on and people were very into it."
        }, 
        {
            "index": 244, 
            "rating": 5, 
            "review": "I'm American, but I lived in the U.K. for 8 years during the 1990s, and I must say that THIS is the best British pub - both in ambience and in genuiness of food - that I have found, or probably ever will find in the States.\n\nI've tried the scotch egg, sausage roll and fish and chips when I have gone there (3 times, so far), and they are spot on - none of this fake \"We'll CALL it a pub and give the silly Yanks what they *think* is \"British\" food, which is really just American food\" mentality of so many pseudo English/Irish/whateverish \"pubs\" - this is the real deal - or as real as customs will allow.\n\nYou must try the fish and chips - get them with mushy peas, because that's good!\n\nThe other thing I've loved about this pub is that you never see any kids there - as a child-free person, this is refreshing and so much more enjoyable than wondering if little Bratleigh will yell, scream, cry, run around and basically ruin everyone else's dinner - Bratleigh's somewhere else - GOD SAVE THE QUEEN!!!\n\nAnd you immigrated Brits now living over here - you'll love this place!"
        }, 
        {
            "index": 245, 
            "rating": 4, 
            "review": "I love this place. It is right around the corner from my house so it is easy to get to (for me). The food is good, not the greatest, but solid for sure. The place is more run down than it should be, the owner should look into touching it up. But if you are looking for a place with great staff this place is great. The bartenders and servers are so unique that it makes it fun every time. My friends and I go to Karaoke Wednesdays and Dollar PBR Sundays all the time."
        }, 
        {
            "index": 246, 
            "rating": 4, 
            "review": "I've only stopped by here for some drinks with a friend, so I haven't actually tasted the food. My vodka shots were smooth, but I just didn't have any room for food, so instead I just watched my husband and our friend chow down some scottish eggs and fish n' chips.. they loved it. And it's too bad that I wasn't hungry, but service was fast, girls working there were friendly, and seemed like authentic European food.. now I just need to find some place like that here in Arizona.."
        }, 
        {
            "index": 247, 
            "rating": 2, 
            "review": "We have been in twice in the previous month to get a British staple: Fish & Chips.\n\nThe first time, we were not told it was AYCE until I saw the sign on our way out. My fish was cooked alright, smallish portions for the price, but not a horrible meal, just a bit overpriced for one serving.\n\nThis go around, we ordered the AYCE Fish & Chips and hoped for a filling meal. For over two hours we were at Crown & Anchor, we received our first PIECE of fish, granted, the one piece per plate was fairly substantial. However, it was still just one piece. Shortly after devouring that one piece, my stomach was screaming for more food. It was not until we had been at C&A for over an hour the second piece made its way out. That was it. Two pieces of fish in two hours. \n\nI feel places like this should change the name from \"All You Can Eat\" to \"All We Decide To Serve\".\n\nAlso, if you are a bar/restaurant... HOW DO YOU RUN OUT OF GLASSES?! The place was not even full and our server apologized multiple times for not being able to bring out drinks in a timely fashion and our friends that wanted a glass of ice to go with their bottled drinks could not have one because, \"We're out of glasses.\" Seriously? There is a serious problem when a bar does not have enough glasses to cover a moderately busy night."
        }, 
        {
            "index": 248, 
            "rating": 4, 
            "review": "Wonderful place for a drink. Four ciders on tap. If you wear your scrubs on Wednesday you get a first free beer and discounts."
        }, 
        {
            "index": 249, 
            "rating": 4, 
            "review": "This is the undiscovered part of Vegas that should be known. I like the food & the atmosphere. The waitresses are uber sexy and the decor is classic British.  Very good fish & chips done right with a side of peas so the food is home style. Unfortunately, it suffers from a weird layout and it being in a shitty neighborhood. They do offer a British black taxi to pick you up from your hotel or house. Good parking too. Just watch your back & your wallet going in & out due to the crime ridden area its in.  If you're a beer drinker,then you'll like the \"Down The Hatch\" club which one has to earn to be in. \n\nI do like this place alot & will go there again."
        }, 
        {
            "index": 250, 
            "rating": 4, 
            "review": "I went for lunch today and I was excited to eat my first Yorkshire pudding. Unfortunately, it came out very over done to almost being burnt.  The Scotch egg with that great mustard dipping sauce was yummy.  Service was great !"
        }, 
        {
            "index": 251, 
            "rating": 3, 
            "review": "Whenever I'm in Vegas and want to watch my Arsenal play I make sure to hit up the Crown & Anchor.  That means I'm showing up around 6 in the AM and I probably did not sleep at all the night before.\n\nThere's a great beer selection but I can't really comment on the food (although I've been told it's good) because each time I've been there I've been just way too drunk to remember anything except the Scotch Eggs.  And those are perfect for eating after you've downed a few pints.\n\nThe last time I was in Vegas we showed up at the C&A so early in the morning it was still dark.  We stayed all day as some lads from England were in town for a stag party (bachelor party to us Yanks) and we ended up drinking with them all day.  The staff was friendly and great fun to chat with the whole time as well (I think we may have even received a couple of free drinks).  By the time we left it was dark again.  \n\nWe didn't step out into the sun all day and we weren't even in a casino!"
        }, 
        {
            "index": 252, 
            "rating": 4, 
            "review": "Had lunch today.  Fish and chips. Great bar service with a pretty lady with an awesome personality.   Games are good and a very  wide choice of draft beers.  Plenty of tv's.  Love it!"
        }, 
        {
            "index": 253, 
            "rating": 1, 
            "review": "RUDE MANAGER. We (7 out of town guests) stopped there before a UNLV basketball game because it was recommended. We got SLOW service on a Saturday afternoon. When the manager said she would take care of it by comping our drinks (2nd round, waitress forgot one, then never brought it) she fooled me by charging my bank card anyway, without my signature!! Not the customers fault they only had one waitress on a game day. I will NEVER go back!!!!!! I will however call my bank."
        }, 
        {
            "index": 254, 
            "rating": 1, 
            "review": "If the outside patio is full, keep driving unless you enjoy smelling like an ashtray after eating inside."
        }, 
        {
            "index": 255, 
            "rating": 4, 
            "review": "Nice server very helpful played $20 on video poker and received full dinner no Yorkshire pudding like the menu said why do servers always forget stuff it happened the other night at Mimi's too when they forgot my wife's blueberry muffin with her quiche. I was there for a memorial of someone I know who died of alcoholism at age 52"
        }, 
        {
            "index": 256, 
            "rating": 5, 
            "review": "I just came here for lunch had 2 smithwicks but not before having chicken fingers. I asked them to make them as hot as they can possibly make it which still isn't it hot enough for me, none the less they are amazing. I also had the garlic sauteed mushrooms in lu of french frys. Please try them, they will brighten your day, way better than french frys."
        }, 
        {
            "index": 257, 
            "rating": 2, 
            "review": "I know this is probably heresy but I have one word to sum up the crown and anchor: Meh.\n\nI think to enjoy this place you need to be  A) in college and B) have never been to any other pub. Ever.\n\nFirst off, I expect a pub to serve more than just beer and wine at the bar. To get hard alcohol (ie. Whiskey in my case) you have to sit in the dining area and order food.  Someone cheaped out on a real liquor license and just doesn't care at this point.\n\nSecond, the fish + chips I've tried twice here and its completely lackluster. Not worth the hype. It tastes frozen. The chips were mealy, both times. Very middle of the road. Maybe they had a better chef or food distributor a while back when it got voted #1 in Vegas, but there's far better elsewhere.\n\nThe jukebox was a little bit crap too. I heard the Police greatest hits for a little too long. Then it was followed by 1990's euro trash techno. Very blah.\n\nOn the upside: great atmosphere, great room, nice pool tables. If you're a major beer drinker, then you'll love it. The whiskey drinker in me was disappointed by their liquor policy."
        }, 
        {
            "index": 258, 
            "rating": 1, 
            "review": "Two words..rancid mayonnaise. Service was less than stellar for chicken curry and a turkey club to go. How could you go wrong? Got mayo packets in the bag with our meals, nothing out or the ordinary until I spread the mayo all over my sandwich. It spread like peanut butter. Uh oh.. I tasted it with my finger, it was BAD. *barf* Upon closer inspection, it had the consistency of cottage cheese that'd been left out in the sun. Trying not to gag, I brought my food back in. Was offered a replacement, which was acceptable since I was starving. Also was brought a fresh mayo, which I was told had been refrigerated. Why weren't the mayo packets put through the same treatment?? New turkey club wasn't great, I couldn't get the rancid mayo taste out of my mouth. Sorry, not coming back to order food ever again. :/"
        }, 
        {
            "index": 259, 
            "rating": 5, 
            "review": "My favorite bar in Vegas! Great staff, food, and beer selection. Best fish and chips in town. Great place to watch sports, and the ONLY place to watch international soccer. Also love the uniforms."
        }, 
        {
            "index": 260, 
            "rating": 4, 
            "review": "Great little place, tasty grub and British fare. Exactly what it's trying to be. A piece of British civilization  inside the vast desert abyss. Came here for breakfast, because the prices are less than half of what they are on the strip. The service and food met my expectations. Cool little groove."
        }, 
        {
            "index": 261, 
            "rating": 4, 
            "review": "Nice place!  I lived in England for a time and developed a taste for British Ales so it is great to find a place that has them on tap here in Vegas.  I had the Sunday dinner special which was excellent.  Bar tenders are friendly."
        }, 
        {
            "index": 262, 
            "rating": 4, 
            "review": "I'm so glad we made it out to the Crown & Anchor.  Unfortunately the place doesn't look like much from the outside, but it was a real treat.  Great service, great food, great drinks, awesome prices.  It's a pub, so go into it with that in mind.  Happy hour draught  drinks!  I grew up on English food, and this meal reminded me of that.  Yorkshire pudding, with butter, gravy &/or honey-butter, to die for!  While we didn't have room, we still ordered the apple-crumble for dessert, and I'm glad we did.  Warm custard/pudding, with apple, and crumble, a real treat to end the meal.  Wish I had discovered this place earlier in our trip, as I would have frequented them more often."
        }, 
        {
            "index": 263, 
            "rating": 3, 
            "review": "Stopped in for the Monday night AYCE Fish & Chips special. Was bummed to learn that clam chowder wasn't on the menu every night. Would have loved to have had some. Fish was good but seemed that the outside was fried too much as there were hard crispy pieces that you didn't want to eat (in the fryer too long). Fish itself was flaky & not dried out. Not a fan of the peas that accompanied the dish. Chips were good as well."
        }, 
        {
            "index": 264, 
            "rating": 3, 
            "review": "Pretty good, but there's a reason the Brits aren't known for their food. Great beer selection, good sausage, other food items were standard meat and potatoes selections at OK prices.  Seemed past it's prime a bit, but I think that may have added some charm more than anything."
        }, 
        {
            "index": 265, 
            "rating": 4, 
            "review": "Been looking for good authentic fish and chips. I really enjoyed it. Staff are nice too."
        }, 
        {
            "index": 266, 
            "rating": 4, 
            "review": "So I came to this place after reading the reviews here on Yelp and planning an annual trip I make with my father.  I wanted to find some good local places, off the strip, where the food was neither buffet nor over-priced.  Their meat pies were top notch, the cider was fresh, the beer was priced well and they carried a lot of imported foods that are hard to find most places.  Being an off strip place - it seems to cater to locals and I really liked that.  The first waitress was fabulous - fast, attentive and smiley.  The second was very friendly but much slower and less on top of things.  However she was adequate.  The only draw back to this place was how smokey it smelled - but its vegas and the law says you can smoke in the pubs so...\nThis is a place I will definitely frequent again when I am in town.  In terms of being traditional, I am a first generation Canadian, raised by a family of Brits and I can say this is good authentic style pub.  WELL DONE!"
        }, 
        {
            "index": 267, 
            "rating": 5, 
            "review": "Can't rave enough about the staff and the Bartender Rob and the sweet waitresses! They even have #Glutenfree #DedicatedFryers and omg if ever gluten allergy person isn't compelled to come here at least once a week for the best GF steak fries, then they're all crazy!"
        }, 
        {
            "index": 268, 
            "rating": 5, 
            "review": "Update: So I've continued to head to this place in an effort to finish my beer cards. I've managed to finish two cards and am Card No. 3! Tracy has been incredible in knowing which beer to random select for me.\n\nThen again, all of the staff is great and I'm glad they're continuing to provide me with a great experience."
        }, 
        {
            "index": 269, 
            "rating": 4, 
            "review": "This place is the closest Las Vegas will get to a college bar. The place is modeled after an English pub situated in a large wooden hall. They have a variety of beers on tap and after you've had them all (all 30), they'll give you some kind of Crown and Anchor swag. \n\nThought it was kinda weird that the place was filled with seats. In other cities, a type of bar like this would also double as a club haha. That wouldn't fly in Vegas I suppose.\n\nIf you're a local and looking for a chill time with a very young and college scene, come here. No grimy old man pedos. \n\nIf you're a tourist and you've ventured this far from the strip, you'll find this place a comforting and unpretentious bar to pass the time.\n\nMinus one star for the service which is also very collegy."
        }, 
        {
            "index": 270, 
            "rating": 5, 
            "review": "Still loving Crown & Anchor. \n\nAs a Vegas-native now living in the UK I can say that Crown & Anchor is definitely the closest experience to an English pub I have ever seen in Vegas. Such a great place to just sit around, drink some beer, eat some food (curry! scotch egg! pies! bangers!) and not be rushed or expected to hurry, eat, leave.\n\nFind yourself a nice quiet corner, bring the newspaper, order a beer and a bowl of stilton cabbage soup and laze the day away. As stated before avoid evenings and weekends if you dont want to run into the lame college crowd."
        }, 
        {
            "index": 271, 
            "rating": 4, 
            "review": "So it's a pretty good English-y tavern, augmented with Vegas' love for gambling.  But if you don't sit at the bar proper, you can barely tell any of that's there.  There's a few TVs up to watch a match, lots of beer on tap (the English assortment of 1664 and Carlsburg), and you can order a large baseball of meat wrapped in a buttery shell.   Oh wait, that's a Cornish Pastie!  And it's delicious.  \n\nDid I mention the wait staff is hot?"
        }, 
        {
            "index": 272, 
            "rating": 1, 
            "review": "Normally I do provide reviews, however my experience last night 31 Mar 2016 warrants it.  First off, the server was attentive and brought food and drinks timely.  The beer was cold and the food  was outstanding as all agreed to, by our party of 4.  However, after eating and waiting for the bill to arrive my friends noticed a HUGE cockroach on my shirt that had come out from the dark recesses of under the table to say hello.  We immediately went to the hostess station to complain and one of the waitresses said \"oh you met Jeff huh?\"  Obviously Jeff the cockroach is part of the experience.  Therefore, if you wish to share your dinner with more friends than you knew you had, go here.  Otherwise pass!"
        }, 
        {
            "index": 273, 
            "rating": 4, 
            "review": "Our favorite pub in Las Vegas.\n\nGood food, great beer and close to the Strip. Make it a point to go!"
        }, 
        {
            "index": 274, 
            "rating": 4, 
            "review": "If you like good beer and need a place to watch a sporting event (Easily the best place to watch soccer matches in town), then you've come to the right place. Nothing spectacular for food. I tried the chicken fingers based on other reviewers suggestions and I would say they're a little better than your average. They give you hot sauce with them, which is probably why they were good. I would rate their game day atmosphere a 5 but the food a 3."
        }, 
        {
            "index": 275, 
            "rating": 5, 
            "review": "We were staying at Bluegreen Club 36 which is very near UNLV and loved the idea of going someplace off the Strip.  We went for dinner on a Wednesday night and it was very popular but we didn't have to wait very long.  The food was good - I love Scotch Eggs and also the chicken and leek pie was delicious! Good choice of beer.  Lots of students but we were weren't the only ones there who weren't.  Fun atmosphere, good service. We'd definitely go back again if we ever return to Vegas."
        }, 
        {
            "index": 276, 
            "rating": 5, 
            "review": "Last time I was here was back in 93, hasn't changed much and neither has the fish n chips...outstanding as usual. I grew in the UK and familiar with pubs, this feels like home."
        }, 
        {
            "index": 277, 
            "rating": 4, 
            "review": "Ugh!  So we had to take a cab to get here because we didn't want to have to trek down Tropicana Avenue ten blocks only to get rolled.  Once we got there we realized something horrifying:  the air conditioner was BARELY on!  Then to make matters even worse NOBODY took our order for a good TEN MINUTES while we sat there (yes, I DID keep track, thank you!)...\n\nSo why the HELL would I give such a lame place four stars?  Probably 4.5 to be exact?  Because C&A is just what I miss about London and definitely lived up to high expectations!\n\nDecor is wild.  Definitely reminded me of the drunken stumbles around Notting Hill during World Cup '06.  It felt VERY pub-esque and I loved it so much.  Beer selection is...  eh?  Well let's just say that if you love them English-style beers then you're in heaven.  It was hard to break from the black and tans (especially for hopheads like my brother and myself) so we didn't -- which was fine.  LOTS of weekly specials...  Kind of makes me wish I was either a UNLV student or a casino industry worker.  Or that at least I lived around here to make it out for their occasional food and drink specials.  Or at least to be able to enjoy soccer (sorry, but there is already another sport in this country called 'football' ... TM Justin Timberlake @ the ESPYs) on the numerous TVs.  But the food, jeez, the FOOD!!!\n\nFish and chips.  Cod was fried EXACTLY the way we love it -- and my bro and I BOTH agreed that it's way better than the Olde Ship's (British pub-ish place here in Orange County) fish.  Thin, crispy outside, flaky yumminess of fish on the inside.  Tartar sauce was perfect.  Fries were perfect.  We chose to throw most of the peas into my chicken curry.  Speaking of which...  chicken curry!  Kind of what I expected -- not spicy, good flavor -- but soooo much food!  I chose to order it on the rice since my brother already had chips.  Good call.  Perfect consistency in the potatoes, LOVED the mushrooms, chunks of chicken were a good size.  It was just SO FILLING!\n\nThe night's ultimate experience, however, came in the form of an impromptu \"Today's Special\" dessert:  the sticky toffee pudding was proudly displayed on the night's chalkboard.  Sooo...  what were we to do?  And DEAR GAWD did we make an excellent decision.  The toffee sauce is TO DIE FOR.  I absolutely despise raisins but I stuffed them in my mouth as far as this culinary sinfulness was concerned.  Bread pudding-ish + buttery toffee moat + whipped cream + raisins = one of the most delightful sweets I'd EVER had in my life!\n\nWe were so stuffed we couldn't even order another beer.  We were so food comatose that we had to get back to the Tropicana and take a nap before going out for the *night*...  And even though the service was HELLA slow (to use the parlance of our times), and the beer selection is essentially the LAST straw for a hophead, and it took the bar forever to call our return taxi...  I give C&A a proud 4.5 stars, especially since I fell in love with London a couple years ago and this joint is the closest thing to London for me :)"
        }, 
        {
            "index": 278, 
            "rating": 1, 
            "review": "basically i'll never go back.\n\ni was in vegas working a trade show and after a whirlwind teardown i had time for a mid-afternoon pint on my way to the airport.  i always wanted to try this place.  i walked in...nice atmosphere..what i expected.  all the seats at the bar were taken except for the ones at the video poker, which no one was playing. i walked up and DID NOT SIT DOWN.  the bartender (pretty, but pissed off looking) walks over to me and without a \"hi\" or anything says:\n\"are you playing?\"....\n\"uh...no, i just want a black and tan.\"\n\"well you can't sit here if you're not playing!\"\n\"okay...but i'm not sitting here, i'm standing.  can i just order a beer?\"\n\"yeah, but you can't sit here!\"\n\"i know...you just told me.\"\n\nafter the snot brought me my beer i downed it in about 3 gulps and walked out...never to return."
        }, 
        {
            "index": 279, 
            "rating": 3, 
            "review": "I was looking for a place away from all the overpriced places on the Strip and I had a hankering for fish and chips. Driving down E. Tropicana I saw the Crown and Anchor and it looked like just the place. \nThe ambience is just what you'd expect except for the gambling machines that dominate the bar. Oh well , it is Vegas after all. I was greeted and seated immediately and the service remained very good throughout my meal.\nThe menu looked very tempting and included all of the standard British pub fair. I was very tempted to try the Steak and Mushroom pie, but I was there for the Fish and Chips.\nThe meal came out very quickly and looked delicious. The fish was maybe haddock and was well cooked, moist and flakey. However the batter had a bitter taste; maybe old oil or maybe aluminized baking powder in the batter, which I'm sensitive to. It was  not overwhelming, but enough that I would not order it again. The chips were great (which maybe points to the batter rater than the oil) and the included peas, well they were peas.\nI gave  them a 3, but if I rated then strictly on this  meal it would have been lower. I do have a feeling a different night or a different entre may have been much better. I may give them another shot next time I am in Vegas, maybe the Steak and Mushroom pie  next time"
        }, 
        {
            "index": 280, 
            "rating": 2, 
            "review": "It was my first time coming to this pub and I was actually kinda excited since we had just gotten out of a concert and were looking for somewhere to just chat and grab food and a beer. I went in with a group and we ordered our drinks at the bar. \n\nAll the seats were full at the bar, but there was no one in the little restaurant area aside from the group outside and a few other people just chatting, not eating at a table not too far from where we decided to sit.\n\nFirst off, we couldn't find someone to seat us which is why we just decided to find an area ourselves. Trying to get one of the waitresses' attention was another thing as well. \nThey were darting so fast to the group outside that they completely disregarded us. \nEventually, someone in our group just decided to try to get her attention because she was so flustered at the fact that we had been waiting so long and the only table that appeared to have ordered anything was a group outside.\n\nI ended up ordering the Mozzarella sticks while everyone else got chicken fingers and/or curry.\n\nOur meal took a good while. At least, it felt like it. We burned through so many conversations that I began to wonder if our server had gotten our order out.\n\nShe finally came around and brought us our food. Keep in mind that during this whole time, everyone at the table had already gotten through their drinks and she had walked past us quite a handful of times and not once even asked us if we wanted any other drinks.\n\nMozzarella sticks were the BOMB.com. \nThe guys liked the chicken fingers, however, the curry order was wrong. It was ordered without chicken but had so much of it that our friend wasn't happy with it at all.\n\nWe finished our food (except the curry plate) and still had to wait for our server to even check up on us.\nThe service on a scale of 1-10 was at a 3 for me.\nI completely understand that she was checking up constantly on the group outside, being that they were a larger group, but if I had known she wouldn't have shown us the same courtesy, I would've opted to go to another pub or bar instead.\nTreat your customers right. All we wanted was to just be checked up on and offered drinks. It wouldn't have been anything complicated. What's annoying to me is that she preferred to give another group good service, but couldn't even provide us with basic service. How are you so sure we wouldn't have left a great tip for you just for checking up on us as you were darting by? Instead, we were ignored. \nThe fact that it wasn't even busy, let alone she wasn't the only server there is just the icing on top of it all.\n\nI'm not sure the food is worth coming back for.\nIn all honesty, I'm the type of person who if I go to a cool bar/pub/restaurant/etc. I always share it with people and bring them back with me.\nMy first experience was mediocre. Pretty disappointing.\nIn the meantime, I think I'll have to stick to Gold Spike or Park."
        }, 
        {
            "index": 281, 
            "rating": 5, 
            "review": "From the service to the food to the drinks, an all around outstanding bar. I'm never disappointed when I come in here. The bartenders I've met are always attentive to all the customers and make it a great experience. They really seem to love their jobs and it creates a wonderful atmosphere. After a long night at work it's nice to know I can unwind and enjoy their company."
        }, 
        {
            "index": 282, 
            "rating": 5, 
            "review": "I'm not one to yelp, EVER! I came into crown & anchor tonight. Ordered the best chicken fingers & mushroom steak pie. Our bartender Brian was beyond amazing! He recommend the best food & drinks. Would recommend it to all my friends in town! Thank you"
        }, 
        {
            "index": 283, 
            "rating": 3, 
            "review": "Went here for dinner on our first night in Vegas.  It's a little restaurant off the strip and being an ex-pat I am always down for some tasty (read greasy) British grub.\n\nThey had a lot of comfort food that I remember from my youth.  Couldn't make up my mind on an app so I tried a Sausage roll and a Yorkshire Pudding.  The latter was very dry as if it had been cooked a few days ago and just warmed up.\n\nI had a Blackthorn draft with Blackcurrent (originally asked for Ribena, but waitress had no idea what this was).\n\nCan't remember exactly what my buddy ordered, I think it was some sort of stew.  I went with a Banger buddy (sausage sandwich) with chips.  All in all, not bad.  I wouldn't be rushing back here any time soon.\n\nAs a plus we were entertained by the two LVPD police officers who were dining next to us.  It was literally something out of Reno 911 as these two argued over the fact that one of them had never tried clam chowder and the other one was forcing him to sample from the bowl that he had ordered."
        }, 
        {
            "index": 284, 
            "rating": 3, 
            "review": "Great \"local\" bar..pool table, plenty of places for friends to sit, eat, and drink. \n\nOpen till cows come home!"
        }, 
        {
            "index": 285, 
            "rating": 3, 
            "review": "Ate here for my last night in Vegas. Experience was ok. Service was slow, and the food only eh. Ordered a snakebite, and got something else than what I thought I would. (Shame on me for not specifying.) Friends said that it's a good time during football (aka soccer) season."
        }, 
        {
            "index": 286, 
            "rating": 1, 
            "review": "Service was very slow. 20 minutes to brew a pot of coffee. Waitress took our order 5 minutes after delivering the coffee. 10 more minutes to deliver our meal. We both ordered fish and chips. Lots of large fries, lots of green peas, small single piece of fish. The fish was mediocre at best. Crispy breading but virtually  tasteless. In fact quite ordinary. We will not return."
        }, 
        {
            "index": 287, 
            "rating": 5, 
            "review": "Great fish n chips. Very fresh!  The batter is amazing, nice and crunchy. .it left me wanting another order.."
        }, 
        {
            "index": 288, 
            "rating": 1, 
            "review": "First time i have ever done this, but i felt like i had to. I was in town for a week and while here looked online for good places to eat. Crown and Anchor showed up so we decided to give it a try. We came in on Monday night for the all you can eat. First off they need to update their prices online, for the amounts are different. To get on with the story though we walked right in and were able to sit down immediately which was nice. The waitress was at our table within 2 min or so and we ordered beverages and our food right away. My friends water was there within 3-5min or so, my coke however took almost 20 min to show up. After that it took another 20 min for our fish (keep in mind this was AYCE so the fish should be ready quick. After getting our fish, i kid you not it was 40 min before our waitress even stopped back needless to say we had been waiting and trying to ask her for fish for 20min at least. We talk to her and fish is there then somehow within only 5 min. It was then another 20 before we see her again and ask for our check. For anyone that took the time to read this, i really hope that we were an exception and nobody else goes through this. The service as a whole sucked. The people on either side sucked (relationship fighting, and a guy talking in a terrible British accent). In whole dinner took around 2 hours. The reason this even gets 1 star is that yes the Fish and Chips were very authentic. I will not be going back, but if you are willing go ahead and give it a try."
        }, 
        {
            "index": 289, 
            "rating": 3, 
            "review": "Reasons I like the Crown:\nLate-night Hangin on the patio with a Guinness (or two)\nOutstanding Fish and Chips (with Peas!)\nSticky Toffee Pudding (with custard on top if you ask nicely)\nThe Chip Butty (which I've never ordered, but just love the idea of butter-covered french fries on a hamburger bun)\n\nThings I don't like:\nService is never what you'd call 'brisk'\nThe place could use a bit of a scrub\nPatrons can be surly on game nights.\nBut what do ya want? It's a pub, right?\n\nThe perfect place to end a long evening on a warm spring night."
        }, 
        {
            "index": 290, 
            "rating": 4, 
            "review": "I had a good experience for each time I visited. The staff is friendly and very efficient. The quality of the food is good, and I cannot complain about the prices. I recommend this place for anyone wanting a pub environment or a late night drink."
        }, 
        {
            "index": 291, 
            "rating": 5, 
            "review": "Excellent prices and awesome fish n chips! It is located very close to the strip, about five minutes away from the MGM.\n\nWe went here on the day of the Queen's Jubilee and they had decorated the place with British flags and pictures of the Queen. Very cool. Best place to go to start out the night. It love how it wasn't rowdy at all and that the service was great. They also have a pool table and darts in the back :) Cool, laid-back atmosphere and good food. What more could you ask for?\n\nIf I lived in Vegas, this place would definitely be a staple for me :) I will have to go back the next time I am there!"
        }, 
        {
            "index": 292, 
            "rating": 4, 
            "review": "Crisps with curry gravy and a cider, is the best ever.\n\nTheir chicken tenders are the best!\n\nAnd a salad with beats - love the beats."
        }, 
        {
            "index": 293, 
            "rating": 3, 
            "review": "Las Vegas, Nevada ---\n\nDay 99 \"DUSA Tour 2016\" ... bar #1\n\n\"Crown & Anchor Pub\" was a British-themed sports bar \n\nmenu is \"extreme\" British food , but not a \"Run-A-Way Bill\" food fare \n\nthey have a \"Down the Hatch\" beer club, plus Happy Hour & Graveyard Hours specials \n\nNo customer interaction other than TV interaction \n\nbartender/serves LK great in her Catholic-school (British) skirts \n\nmy bartender did not introduced herself \n\nNOT  a \"Run-A-Way Bill\" Favorite, but mainly because I do not like USA sports, let alone British sports ...\n\n#RunAwayBill #DUSATour2016 #LivingLarge \n\n\"Run-A-Way Bill\" was here!\n07.18.16"
        }, 
        {
            "index": 294, 
            "rating": 5, 
            "review": "We love coming here once a week with our pit bull Zeus.  They have an outdoor area perfect for dogs that is fenced in.  It's ideal and hard to find in this city.  The service is always great.  My husband loves the chicken fingers and fries.  I love their English Garden Salad.  I have never had a bad meal here.  When we come for breakfast which is served all day, they always bring Zeus some extra bacon and a sausage.  He loves this place."
        }, 
        {
            "index": 295, 
            "rating": 3, 
            "review": "WARNING: This is NOT an Arsenal bar. \n\nI got information about this as an \"Arsenal bar\" from Arsenal.com and decided to go on North London Derby day. \n\nYou know, the day you'd expect the best Arsenal atmosphere...\n\nThe place was split 50/50 with Spuds fans and the TV situation was lame. \n\nThe food was okay but I was strictly attending because of Arsenal, so I'm forced to let everyone know. \n\nI'm giving this place three stars as to not skew their rating, but I felt like I had to warn my fellow Gooners.\n\nThree ***"
        }, 
        {
            "index": 296, 
            "rating": 5, 
            "review": "I have lived lifetimes in the place. Great place to take years off your life, it's all worth it. Atmosphere, food, drinks, gambling. Heaven."
        }, 
        {
            "index": 297, 
            "rating": 4, 
            "review": "i was here last night, not to count the numerous previous visits. this is my friend's favorite pub! and it is my #2 pub for there delicious food. they got awesome apple cobblers, and cottage pie is my favorite dish here.  they got chimay on tab which is one of my favorite beer. everytime i go to this pub i get a kick out of it.  there are times like on the weekends where it will take a while for services but still the staff here is very friendly. :) i'll definitely be back!"
        }, 
        {
            "index": 298, 
            "rating": 1, 
            "review": "Carpet has intense odor of beer/other things spilled on it.  If you like microwave frozen food, you'll love it here.  There's something \"going on\" in this place, like if I found out that there was 400 pounds of marijuana in the basement, it wouldn't surprise me. I think this is a hang out for local residents that are not allowed in casinos."
        }, 
        {
            "index": 299, 
            "rating": 5, 
            "review": "Really great little place.  Lovely chips and curry sauce!  Friendly staff, like a true pub as I remember from my time in England."
        }, 
        {
            "index": 300, 
            "rating": 4, 
            "review": "Tons of English dishes. The sausage rolls and scotch eggs were good. Avoid the Gammon, nothing like the English gammon more like a piece is Denny's ham the lamb was good. The Yorkshire pudding was a little too crispy."
        }, 
        {
            "index": 301, 
            "rating": 4, 
            "review": "This is by FAR the best place to watch football (soccer) in Las Vegas, if you're looking for something more than the glitzy experiences offered by the sports bars on the strip. If you want to watch football with real football fans, to hoot and holler, then Crown and Anchor is your place. \n\nThey have a ton of European beers on tap, and they serve traditional British and Irish fare on the menu. I like the Chip Butty because, really, where else are you going to get a french fry and butter sandwich? But that's essentially what you have here: a french fry and butter sandwich. \n\nFans of all clubs can go here and have a good time; it isn't an Arsenal bar or a Man United Bar. It's a football bar. So if you're staying on the strip, take a taxi here and watch some football, whether you're with your mates or by yourself."
        }, 
        {
            "index": 302, 
            "rating": 5, 
            "review": "Best Fish n' Chips in Vegas and maybe anywhere.  Light batter, thick and flaky fish.  Service usually blows (they don't staff many waitresses) but the food makes up for it."
        }, 
        {
            "index": 303, 
            "rating": 1, 
            "review": "Service sucks.  Their fries suck.  They don't even season them with anything in the kitchen.  \n\nI can get better fries at McDonald's.  \n\nThe table beside me ordered fish n' chips and it's literally 1 piece of fish and a plate full of fries.  That is insane.  You could at least put 3-4 pieces of fish.\n\nTheir menu is too big.  I hate it when a menu is a novel.  I see this a lot in Vegas.  They need to cut it down and focus on just a few premier dishes that they do really really well.  \n\nNo need for 4 pages of food if you do 7 dishes really really well and just knock it out of the park."
        }, 
        {
            "index": 304, 
            "rating": 4, 
            "review": "I would probably give this place between a 3.5 stars and a 4.0.\n\nFood: I had an avocado and turkey sandwich that came with French fries. I thought the avocado was fine, but the bread was a bit dry. I would have preferred less fries and instead maybe a cold slaw side or some salad side accompanying it. 3.0 for the food.\n\nBeer: Both my friend and I had the summer ale. I have to say that it was pretty good. I forgot to ask them if they brewed it themselves, but this pub has an extensive list of beer including imports. The summer ale is a special and it included a dose of citrus. Pretty good light beer. I normally don't drink and even I thought this was refreshing.\n\nService: Our waitress was very friendly. She also invited my friend and I to the quiz night going on that evening even though we did not go to it. The outfits at this pub are pretty cute- note very short plaided skirts. The food was brought out relatively fast along with the beer.\n\nParking: Ample parking in a private lot (free).\n\nPayment: Takes credit card.\n\nLocation: It's off strip and pretty close to the freeway. One can probably take a cab here or drive here if you have a car.\n\nOverall, the pub was pretty friendly and our waitress was awesome. The food was okay, but the beer made up for it. I also filled out a survey with comments and it will be entered for a $25 gift card to the pub."
        }, 
        {
            "index": 305, 
            "rating": 5, 
            "review": "Love this spot, always have a great time going here, sooooo many great beers on tap and love playing darts!!"
        }, 
        {
            "index": 306, 
            "rating": 4, 
            "review": "Love me some crown and anchor. \n\nThe last 2 times I have been in I get the chicken fingers and fries. These are some of the best chicken fingers around. Really good. \n\nThis also a good place to grab a drink and hang out with friends. If you are a soccer fan there almost always seems to be a game on. \n\nIf you like fish and chips Monday night is your night. It's all you can eat fish and chips. This are also very good. \n\nLast but not least Thursday night at this location is bad singer night. If you like to karoke than this is the place to be. If you like hearing your favorite song ruined also the place to be. \n\nI am a fan of crown and anchor."
        }, 
        {
            "index": 307, 
            "rating": 5, 
            "review": "Love the ambiance of this german pub bartenders and patrons are super friendly! May have found my new watering hole!"
        }, 
        {
            "index": 308, 
            "rating": 5, 
            "review": "Here is yet another of my favorite places oh I miss Vegas now. I need to update these reviews when I am there not get back lol! \n\nI love this place sometimes a band great home cooked tasting food, and beer selections and cider and current ohhh.. Out side seating clean and affordable and the darts are supper fun."
        }, 
        {
            "index": 309, 
            "rating": 5, 
            "review": "I LOVE THIS PLACE\n\n1st  time I was here I saw that the waitress's were skinny girls in skirts, and I made the mistake of thinking that these girls were going to be lazy and not care about the fat people sitting in the back. I WAS WRONG... this is one of the hardest working wait-staffs in Vegas, they don't stop moving, and are constantly getting what you ask for. To top it off, they still make you table, no matter how large the amount of the people or how large the people... or both, feel like they are the only Table.\n\nThis is the best Fish&chips you will find in this city, I have been looking for years for this quality of fish&chips. The Fish by the way is HUGE and cooked perfectly.  When I come on a Monday, I gain a good 40lbs due to the all you can eat Fish&Chips, then some how stuff a Toffe pudding in my mouth for dessert."
        }, 
        {
            "index": 310, 
            "rating": 5, 
            "review": "I loved the food and the atmosphere. The service was great and even though it was loud because it happened to be karaoke night, it was great"
        }, 
        {
            "index": 311, 
            "rating": 4, 
            "review": "Cozy bar with lots of English beers on tap. Bartender has a \"Locals Only\" chip on his shoulder but was gratious and pleasant. Monday night all-you-can-eat Fish N Chips. Good drinking hole for those who prefer Vegas the city, not The Strip."
        }, 
        {
            "index": 312, 
            "rating": 5, 
            "review": "As any soccer fan living in the United States can attest to, being a fan of The Beautiful Game in this country can be quite a lonely experience.  From the quizzical looks I get when I wear my Cesc Fabregas Arsenal jersey in public, to the \"huh?\" I get from bartenders at other bars when I ask if they can put a soccer match on, being a soccer fan is sometimes like being the red-headed stepchild.\n\nWhich is why I love this place so much.  Simply put, this is the best British Pub I have ever been to.  It isn't a big bar by most standards, but it's very homely and it just feels warm to be inside.  They have pool, darts and foosball for those interested in bar games.  They do have video poker like in most bars these days, but this is a bar better for socializing or watching a match than playing poker.  \n\nI just got back today from watching Arsenal play Barcelona in a UEFA Champions League match, and while the place was pretty empty when I got there 20 minutes before match time, practically all the seats were taken by kickoff.  The British Burger I ordered was absolutely delicious, and next time I must try the fish and chips.  Even though it was noonish, the people watching the match were rowdy and fun, and despite the intensity of a hugely important match were for the most part friendly.  While the fans are passionate and intense, you probably don't have to worry about brawls breaking out.\n\nThe only bad thing I can say about this place is that the parking lot of quite small and cramped.  If you're going here to watch a match, be sure to get there early, as it fills pretty fast, particularly if it's a popular club or country playing (I.E. Manchester United, Chelsea, Liverpool, Arsenal or England's National Team).  Besides, the smaller lot probably encourages designated driving, so you can experience those many beers and get home safely :)\n\nPROS:\n-Authentic British pub decor\n-Wide selection of beers \n-Plenty of bar games\n-Great Food!\n-Soccer, er, Football fans!\n\nCONS:\nSmall, cramped parking lot."
        }, 
        {
            "index": 313, 
            "rating": 3, 
            "review": "I love Crown and Anchor. It's one of my favorite local bars. But it also sucks, in a fun way. Great atmosphere. Fair service. Smoke in your eyes. Horrid food...  I've tried everything but order the fish and chips to feel authentic lol. Stop putting those gross pees on the plate! P.S. They always override my songs on the the jukebox. Don't have them on there then! They aren't cheap."
        }, 
        {
            "index": 314, 
            "rating": 3, 
            "review": "I've been really excited to come to the crown and anchor pub for a while now. When the opportunity presented itself we visited this location for lunch. Our waitress was amazing. She was extremely friendly and personable. Atmosphere gets an A+. I had the fish and chips as the main course; which was DE. LI. CIOUS. They've definitely done it justice. Here is the bad news... My Yorkshire pudding was burnt. The gravy was tasty but it couldn't mask the taste of char. That lost you a star. The second star disappeared when I wanted to get them to redeem themselves by trying the sticky toffee pudding (one of my favourites.) Unfortunately it was dry and had the same light burnt taste. I'm pretty sure it was old. The ice cream accompanying it was also freezer burnt. Very disappointed..."
        }, 
        {
            "index": 315, 
            "rating": 3, 
            "review": "Food was pretty good and our server was nice. It's a little far from the strip but was a nice change of pace."
        }, 
        {
            "index": 316, 
            "rating": 4, 
            "review": "Stilton Plate and Fullers London Pride pale ale...who wouldve thought that just stilton cheese(like blue cheese), cucumbers, and tomato slices would taste so good!! Also the sticky toffee bread pudding was AMAZING! I ordered two...oops ;)"
        }, 
        {
            "index": 317, 
            "rating": 1, 
            "review": "Worse service ever they lack waitresses and take forever to take your order and drinks. The bartender needs to chill on his attitude and stop using his phone I believe his name was Jason."
        }, 
        {
            "index": 318, 
            "rating": 2, 
            "review": "Food was great but service was terrible. Pop was out for the entire restaurant and the waitress gave no refills on WATER. The restaurant was not overly busy as it was early afternoon but we only saw the waitress three times. We asked for the bill several times and was ignored. We had a game to get to and should not have to wait nearly 20 minutes to get our bill so we could leave. This was our first time eating here and after the horrible service it will be our last. \n\nPer reply from Richard: I wrote this while in the restaurant that afternoon."
        }, 
        {
            "index": 319, 
            "rating": 4, 
            "review": "good service, friendly staff and tasty food. although we ordered wings and got strips. whatever. it was like 430 am and any food tasted good. i just remember the waiter/bartender was really really nice. and he said we could smoke even though there was a sign that said no smoking :)"
        }, 
        {
            "index": 320, 
            "rating": 4, 
            "review": "Always fun to be at this location. Leslie the bartender is super nice and we always sit at the bar to chat with her as well. Love the home made kettle cooked chips here. I wish they served liquor at the bar, but we can do with beer and Leslie's company."
        }, 
        {
            "index": 321, 
            "rating": 4, 
            "review": "Finally! Some decent beers on tap! Odd that you can only drink beer at the bar; cocktails are allowed in the dining areas. Attentive staff. Good goth music the night I was there. Really near the Pinball Hall of Fame."
        }, 
        {
            "index": 322, 
            "rating": 4, 
            "review": "The pub is pretty typical, but the food is outstanding! One thing I like is that they don't try to over do the \"English\" pub thing...   The decor is themed, but it's not overboard."
        }, 
        {
            "index": 323, 
            "rating": 3, 
            "review": "Ever imaged an oasis in the Las Vegas desert? Well, here it is! Great English pub with food and beers to match! The bartenders are nice and the beers are cold. I also tried the sticky toffee pudding and it was pretty average but much appreciated nonetheless."
        }, 
        {
            "index": 324, 
            "rating": 4, 
            "review": "I love this place! Its one of the few British Pubs that actually has a whole gang of Brits hanging out all the time. It may have something to do with the constant showing of Rugby and Football matches on the flat screens, or it could have something to do with the 50 or so ale's they have on tap each one being a treat or maybe the pretty tasty english fare on the menu.  \nI pick all of the above. \nI have been here so many times the past 14 years and never been disappointed. The beer is good, the food is delicious.  The atmosphere is lively and fun a great local places, a great place to get something on tap that is actually worth drinking!"
        }, 
        {
            "index": 325, 
            "rating": 4, 
            "review": "i've been back here several times and i've never been disappointed.\n\ncame here a couple nights ago and i had the chicken fingers. this is one of my favorite places to get chicken fingers. \n\nthe service was better than any other time i have been here. but it was almost to the point of annoying. i think we were asked how everything was going a minimum of 6 times. our server asked the most but then someone else came and asked too. my friend and i were having a conversation so it was a little annoying to keep having someone come up and ask how everything was going. our answer was always the same because neither of us had ordered anything extra and we were fine with our drinks.\n\nanyhoo.. as i said. my friend denise and i always come here when i'm in town :)"
        }, 
        {
            "index": 326, 
            "rating": 5, 
            "review": "First things first: this isn't fast food, it's a place to visit for an extended, leisurely hang. If you're in a hurry, look elsewhere.\nMy wife and I brought our Dachshund \"Dug\" here for lunch yesterday, as they welcome pets on their patio. \nThe food was perfect, and our server Giselle was very friendly to us all, as she started off by bringing our dog fresh water. Nice!\nMy only gripe was that the entrance to the patio was a mud pit from the recent rains... Maybe some stones to walk on would help?\nHomesick Brits and Anglophiles should seek this place out for their fix."
        }, 
        {
            "index": 327, 
            "rating": 2, 
            "review": "Don't get me wrong I love a good dive But this was just ok. Nothing terrible but you can typically get most of the items in any generic \"pub.\" My friend that I went with didn't care for the fish and chips. I got mozzarella sticks and they were ok. My fiancé enjoyed the fries though. It was fair price wise but I wouldn't make a point to return. The service was standard."
        }, 
        {
            "index": 328, 
            "rating": 4, 
            "review": "As a British Ex-pat this is the closest thing i have to being home in Vegas. \n\nThe food is good, although they do seem to have issues making a decent custard to go with the sticky toffee pudding (come on how difficult is it to boil a kettle and mix in the custard powder until it's smooooooooth!!!) anyhoo the atmosphere is authentic, right down to the slightly stinky toilets (a staple in any British pub!) and the chalk boards (so you can write humorous japes to your mates!) \n\nThe beer is good and plentiful; although they did run out of St George Ale just before St Georges day (that's what i call bad planning!) and the selection covers most of the known world; why they even have some luke warm gnats piss that the yanks know as beer! (Lol I'm gonna get lunched now!! ;p ) \n\nThe best thing is on Mondays they do ALL YOU CAN EAT FISH AND CHIPS, OK so it doesn't come with mushy peas, but it's a damn good representation of the dish, and they do use cod (none of that haddock b@llocks here my friends.) \n\nThe appetisers are a little odd, sausage roll, chip butty and scotch eggs to name a few; for those of you who think this is standard faire will be sadly mistaken. A scotch egg and sausage roll is used for picnicking and the chip butty is a cheap student dinner. A true British appetiser or starter is...prawn cocktail with Marie rose sauce, Heinz cream of tomato soup, stuffed garlic mushrooms and pate on toast (not all together of course!!), the main dishes are more authentic, i can recommend the steak and mushroom pie and the roast dinner on Sundays ONLY!!\n\nThere's not much else to say about this place; apart from their world cup coverage was super and they served $4 pints of Stella!! \n\nWankers away my friends, wankers away!"
        }, 
        {
            "index": 329, 
            "rating": 5, 
            "review": "one of the places I truly enjoy drinking and eating. the staff is always chill and nice. and if this is as close as what I can get to British Pub food hey sounds dope to me."
        }, 
        {
            "index": 330, 
            "rating": 4, 
            "review": "All I can say is Love this place. Been coming for awhile for the Ol'Speckeled Hen on Nitro. New to yelp so I figured I would give a shout to a truly great pub they deserve it. Great Fare! English pub food Scotch Eggs kidney pie. Leslie is a great Bartender friendly hospitable and super on it. Over all Crown is worth the trip and if  Soccer or Rugby is your gig its a must...Slainte!!!"
        }, 
        {
            "index": 331, 
            "rating": 1, 
            "review": "Brought my wife here for lunch, the waitress looked at us and walked by us three times and made eye.contact each time (Erica) and finally I had to loudly call out \"excuse me ms.!\" To get her attention. After we got our orders my meat and liver pie was great however everything else was terrible. The chicken was drie the mashed potatoes were dry, the peas werent thoroughly cooked and the service continued to be less than even average... I doubt Ill ever convince my wife to come here again..."
        }, 
        {
            "index": 332, 
            "rating": 1, 
            "review": "Stopped by there today for the first time after reading some positive reviews.  Was craving some fish & chips.  Terrible! Frozen battered fish throw in a deep fryer.  Chips weren't even double fried.  Forgot my tartar sauce even though I asked for it when ordering.  Three bites, then covered it with a napkin paid and left. Never again."
        }, 
        {
            "index": 333, 
            "rating": 1, 
            "review": "Don't know if they got new cooks or what but fish and chips came out cold and my burger came out missing top bun... Haven't been here in 2 months but food taste different"
        }, 
        {
            "index": 334, 
            "rating": 2, 
            "review": "Went here last night and did not have an enjoyable experience. After waiting for more than ten minutes to be acknowledged at the bar I was yelled at by the WWE looking \"bartender\" for trying to order a vodka cran. He abruptly yelled \"no, you can't have that. We only do wine and beer at the bar.\"  Fair enough, but post a sign or be nice explaining that to your customers. Especially when you are working for tips. Also, the interior is completely run down and disgusting."
        }, 
        {
            "index": 335, 
            "rating": 2, 
            "review": "This is NOT the place to come if you're looking for a spot to throw. During my last trip out to sin city, some friends and I were looking for a chill lil dive bar to grab a drink and throw some steel tip darts. This was one of the spots that came up in conversation w a local bar hopper as well as on a Yelp search. We thought we'd give this spot a chance. \n\nHmm, this place was very UNDERwhelming.\nThe waitresses here aren't the most helpful. They don't seem too knowledgeable when it comes to knowing whether or not they have certain brews on draught or if they have ginger beer, etc. They also take too long to ask if you need help. Poor service!!!\n\nThere also seemed to be some odd \"rules\" here about where they could and couldn't serve alcoholic beverages. They said it had something to do with their liquor license but it sounded like some BS to us. \n\nHaving been the DD, I decided to order a soda. Yuck!!!! The syrup was not only gone but it tasted old and spoiled almost. That was disgusting. I sent that back and just had water. \n\nWe threw a few games of cricket and called it quits. The score boards weren't at all in good shape. The boards were super beat up too. The bull line was real worn out. I knew this spot was dicey but this was pretty bad. I doubt I'll be back."
        }, 
        {
            "index": 336, 
            "rating": 1, 
            "review": "Sorry but you are in VEGAS and I have to go to a table and order food to be served liquor? We had just had a great dinner and great drinks elsewhere, decided we wanted to go have a few drinks and some fun. Found this place, went up to the bar ordered a round of Jamisons which we were told we could only have if we had a table and ordered food. Ended up having a round of beer and leaving with a very very unhappy date."
        }, 
        {
            "index": 337, 
            "rating": 4, 
            "review": "The fish and chips were very fresh and well cooked, great beer garden and prices were reasonable at around $4-$5 for entrees and mains from $11. Great variety of beer on tap as well as imported British beer. Will dine there again!"
        }, 
        {
            "index": 338, 
            "rating": 5, 
            "review": "I can say this is probably one of my new favorite places. I came across this place by sheer luck when I was craving some sort of shepherds pie and didn't feel like driving up to the Irish pubs I frequent in town. \"English people eat that shit too!\" I told myself as I made an illegal u-turn in the middle of Tropicana. (ok no I didn't but it adds to the story right?)\n\nThe place has a really cool set up, there's a restaurant and bar area, and also a dart board (for the not too rowdy) The bartender Adam (I think?) was really nice and was ready to explain anything on the menu we had questions about. The good service continued the second time I had returned here, the waitresses are friendly and quick with orders. \n\nI'm the type of person that likes to eat a crapton of food while I drink, cause I'm a fat bastard, and the delicious food here is more than enough for me to get my fill. The cottage pie is probably my favorite thing on their menu, along with plenty of Yorkshire pudding and gravy sauce. I'm getting hungry just typing this. I told you I was a fat bastard."
        }, 
        {
            "index": 339, 
            "rating": 4, 
            "review": "I love this bloody place!\n\nOne of the few places in Vegas that I honestly miss.  The all you can eat English fish & chips (Monday night), chicken curry, chicken & leek pie and Lancashire hot pot are some of my favorite menu items.  Big beer selection and full bar lacking the typical douchebag Vegas tourist is a huge plus.  Most of the out-of-towners are here visiting with a local. \n\nFriendly, prompt waitresses and bartenders do their job well.  Parking can be a bitch at times but that's the only negative that comes to mind.  Oh...that and the mens bathroom sink's water pressure is up pretty high so when you turn it on, you get splashed in the front of your pants making it look like you wee'd on yourself.\n\nCrown & Anchor has done a damn fine job making you feel as if you are in an authentic \"British Pub\"  so much so that you forget you are still in Vegas (which is a good thing.)  \n\nCheers!"
        }, 
        {
            "index": 340, 
            "rating": 5, 
            "review": "One of the few British Pubs that serve my favorite beer, Boddingtons, and they have an excellent choice of British Pub favorites. Never had a bad experience here and love the place. Recommend the fish and chips, the chicken curry and the Ploughman's lunch. Must Do Vegas Haunt!"
        }, 
        {
            "index": 341, 
            "rating": 4, 
            "review": "I had lunch here with work folks. Had the bangers and mash and they had fish and chips. Was good with decent service. Only wish I had a beer to wash it down but maybe next time. Noticed several customers with a British accent so that was a good sign."
        }, 
        {
            "index": 342, 
            "rating": 5, 
            "review": "I've been coming here for over 15 years and I just love it! I've even got the Fiancé hooked, too! For a great dessert, try the sticky toffee pudding. =)"
        }, 
        {
            "index": 343, 
            "rating": 5, 
            "review": "I love this place because- i can go there anytime!!! i can ride my bike up to the back patio! i LOVE the patio!!!! You can have an awesome dinner for two and seriously spend under 25 dollars. The staff is friendly , the waitresses wear short skirts but act like ladies. Its not a 4 star english dining experience if thats what you are looking for its a laid back fun pub with a dart board and a bad ass beer selection!  and delish food. Bangers and mash are good, and the chips are always light and crunchy ."
        }, 
        {
            "index": 344, 
            "rating": 4, 
            "review": "Weve been going to vegas for 15 years and just discovered this place last wrek. We went specifically for the fishn chips because the fish weve been getting at Ellis island is so greasy!  Our fish was delicious! We just got one piece but it was a big ass fat piece crispy, lightly battered and most delicious. Steak fries were yummy and they have what tasted like the make it yourself ranch dressing, yum! Peas had no seasoning but not a big deal salt and pepper were right there on the table! Our server Tracy was fantastic and treated us well, we will most definately be back. They also have Pepsi products as most places do when you get off the strip. Well done Crown, well done. Now if they would just take down those redskin banners...Lol"
        }, 
        {
            "index": 345, 
            "rating": 2, 
            "review": "When you enter the restaurant the smoke odor is overwhelming.  The tables a little sticky.  The restaurant needs a good cleaning.  The wait staff is very professional.  The food is ok."
        }
    ]
}