{
    "category": "Las-Vegas", 
    "entity": "Tamba", 
    "avg_rating_stars": 3.6083150984682715, 
    "review_count": 457, 
    "reviews": [
        {
            "index": 1, 
            "rating": 1, 
            "review": "Don't go to this place\nNot even one item is edible\nVery bad service\nExcept water nothing tasted good\nWaste of money"
        }, 
        {
            "index": 2, 
            "rating": 1, 
            "review": "The only Indian restaurant on the strip and it couldn't live up to the expectation. Never had such a bland Indian food in my life! The service was horrible too. No one attended us or gave us a water refill. Expect better from a Punjabi Indian restaurant. Too disappointed ."
        }, 
        {
            "index": 3, 
            "rating": 4, 
            "review": "One of the places where you can get Jain food. The waiter even wrote Jain in front of the items (so I suppose they might be getting a lot of Jain customers)\n\nWe ordered the following Jain items this time.\nMalai Paneer\nYellow Daal\nMutter Paneer\n\nThe last time (around 2 years ago) they also made Jain Malai Kofta (during dinner)\n\nI have been to this place around 4 times and its always a saviour :)\n\nThis time around they were very busy so the service sucked (its not like this always), but yes sometimes we take the buffet, so not much service is required anyways. We could see several people waiting to be seated and they were also getting a little bit frustrated.\n\nWould definitely recommend this place for good Jain food."
        }, 
        {
            "index": 4, 
            "rating": 5, 
            "review": "The food and ambience are very good. It's been a long while my wife and I had good Indian cuisine something which we miss in Torrance CA."
        }, 
        {
            "index": 5, 
            "rating": 5, 
            "review": "Seriously loved this place! The owner is so nice and kind and so was our waiter! Although we were about 1 hour late for our reservation they still held a table for us! The food was amazing. I really recommend eating here. The butter chicken and lamb biryani is too die for."
        }, 
        {
            "index": 6, 
            "rating": 4, 
            "review": "For an 8pm reservation on a Saturday night, I didn't have a problem getting in.\n\nWhen we got to the restaurant, it was relatively empty.\n\nWhen we left, there were many more people.\n\nThe website is kinda deceiving.  They show the nice lounge area (which is NOT where they seat you for dinner).  The lounge area was nice, but it wasn't open at all when I was there. (and I left at 10pm)\n\nThe food was pretty good.  I couldn't believe that the entrees didn't come with Naan or anything.  Everything (Dal, Naan, etc.) had to be ordered a la carte (for an extra charge).  We ordered the Naan and Roti which only came with four pieces each. \n\nMaybe I'm just used to going to places where the Naan is free and you get it by the basket-load.\n\nI would definitely go back again if I wanted Indian food while in Vegas.\n\nThe service was excellent too.  Very attentive and quick."
        }, 
        {
            "index": 7, 
            "rating": 4, 
            "review": "Best tandoori chicken in the galaxy. No exaggeration. Moist and tender but full of flavor. The buffet was full of great choices and they all seem freshly prepared. Everything tasted great. Great ambience and decor inside. Cool retro concept. The place is a bit hidden in the strip but what a great place to enjoy an Indian buffet. Service was great. Will definitely be back on my next visit to Vegas."
        }, 
        {
            "index": 8, 
            "rating": 4, 
            "review": "easily my fave Indian in the Valley. Great location w/surprisingly convenient parking (for the Strip). Best buffet of its kind in town. Very nicely remodeled dining area & restrooms a few yrs back."
        }, 
        {
            "index": 9, 
            "rating": 3, 
            "review": "Looking for Indian food on the strip, this place is easy to locate. Food is okay. Good ambience."
        }, 
        {
            "index": 10, 
            "rating": 5, 
            "review": "This place is legit!! Hidden in a strip mall and filled with Indian clientele!\n\nWent in for buffet night and was so happy! got to try everything from goat curry (delicious and tender) to chicken Marsala! Well worth it!  The buffet was big with many choices for everyone!  \n\nBar service needs a little help but hey, i should have just ordered beer and not a vodka tonic!\n\nWill be back!!"
        }, 
        {
            "index": 11, 
            "rating": 1, 
            "review": "Waited 10 mins but none of the servers acknowledged us. Had to ask a server to be seated. The food was ok at best. Half the dishes were mislabeled. No one came by to ask us for drinks. Waited 10 mins for the check. There again had to get up and ask for it. Same for the card to be taken and charged. \n\nI've been to Tamba 5 times now and food and service quality has gotten worse every time. Never coming here again."
        }, 
        {
            "index": 12, 
            "rating": 1, 
            "review": "Don't bother ordering off the menu the service is poor. The  good reviews are prolly for the buffet. Al a carte is a disaster here."
        }, 
        {
            "index": 13, 
            "rating": 5, 
            "review": "I absolutely LOVE Indian food but I don't just love any place I go to. THIS place is fantastic! The food was being served buffet style so I got to sample a good array of items. I have to say, the items were in Indian so I had no idea about a few items that I was eating but since I'm adventurous like that, I put a teeny bit of whatever I didn't know and then decided if I wanted seconds. Certain items were a tad spicy but not enough to ruin your meal if you're sensitive to heat. The Tandoori Chicken, which always tends to be dry, was super juicy, the Curry Chicken was fragrant and addicting. The Rice was soft and fluffy and they give u a basket of Naan for your table. I may have been the only Spanish person here, lol, everyone else was Indian, I love that, very telling AND promising. The price is right, $14 for a very clean, well maintained, hot meal. If you want a hearty, savory meal this would be the place to go. Vegas wants to attack your pocket and serve u junk, but this place is the real deal. I would DEFINITELY go back."
        }, 
        {
            "index": 14, 
            "rating": 4, 
            "review": "Loved the food and the service so much that we ate here twice during our brief stay in Vegas. It's a bit pricey, so be sure to look through your resort magazine for the 10% off coupon."
        }, 
        {
            "index": 15, 
            "rating": 4, 
            "review": "excellent vegetarian food,  an oasis for Indian food in Vegas.  Try paneer butter masala and malai kofta., the daal tadka is delicious too!"
        }, 
        {
            "index": 16, 
            "rating": 3, 
            "review": "mediocre indian food buffet.  Not bad, but not super impressive.\nvegetarian options."
        }, 
        {
            "index": 17, 
            "rating": 5, 
            "review": "After so long found one Indian resturant with actual touch of indian food. North Indian food was awesome. Good ambience, nice people and awesome food. Love this place!"
        }, 
        {
            "index": 18, 
            "rating": 1, 
            "review": "I am an Indian, and I love Indian food, which is why I was quite excited to try this restaurant, after reading all the positive reviews. We went there for their Sunday buffet, which is supposed to be the best. I was fairly disappointed with the food, as it was quite bland and flavorless. The north-Indian food was extremely ordinary. The south-Indian Idlis were good, but there was no coconut chutney to go with it. Also, my wife and I were feeling quite weird after eating the food. I would definitely skip this place..."
        }, 
        {
            "index": 19, 
            "rating": 5, 
            "review": "Chicken vandaaloo and chicken qorma both were good. naan was soft and yummy. chicken vindaalo was not too spicy for 10 mo old which is great. 4 year old ate whole naan. pretty good but on expensive side. two entree, naans and samosa came up to be $65."
        }, 
        {
            "index": 20, 
            "rating": 1, 
            "review": "Worst buffet ever. Almost like stale food. The only good thing was the aloo tikki. This place actually is the only one closest to the strip hence takes the liberty to serve food cold and stale. Don't go."
        }, 
        {
            "index": 21, 
            "rating": 4, 
            "review": "Low key spot with good food and ambience away from the fake hotel fare."
        }, 
        {
            "index": 22, 
            "rating": 1, 
            "review": "Bad service food. Was cold order a la carte and bring the food from buffet counter. We ask for manager told us he is not there today"
        }, 
        {
            "index": 23, 
            "rating": 4, 
            "review": "This restaurant was a great find! We love Indian cuisine and Tamba did not disappoint. The food was very good with subtle and distinctive flavor. The service was gracious and accommodating. And the quiet atmosphere was a great break from the hectic Strip. Value is excellent."
        }, 
        {
            "index": 24, 
            "rating": 5, 
            "review": "My friend and I went with the \"feast\" options on the menu, which turned out to be just the right amount of food. Everything was delicious (especially the Rogan Josh), and service was fast and polite."
        }, 
        {
            "index": 25, 
            "rating": 5, 
            "review": "Boyfriend and I were in Las Vegas for a small getaway. Staying a little off the Strip was nice, however, getting food is always a pain in the ass due to constant tourist everywhere. We decided we should try somewhere close that, preferably. wouldn't have very many tourists. Bring in Tamba. \n\nWe made a reservation thinking the place would be jam packed, however, it was not. We were seated immediately, not having to wait at all because the place wasn't crowded at all. \n\nTheir Chicken Tikka Masala was amazingly good. This is one of my favorite dishes, so I enjoy when I go to an Indian place that really makes it the way I like it. Their Naan was also delicious. We got the garlic naan, as well as the Alu Naan, which was also VERY good. \n\nI'd definitely go here again if I am in the area. It is somewhat off the beaten path. I don't think the tourist have really found this gem of a restaurant."
        }, 
        {
            "index": 26, 
            "rating": 5, 
            "review": "I liked the modern Indian atmosphere  The ambiance and light were perfect for a nice date with my wife.\n\nWe had the a meat sample platter which was amazing. Normally I don't go out of my way to eat fish, however the fish in the meat sample platter was cooked perfectly with a light crust and a lot of flavor without a \"fishy\" taste. The lamb was very tender and didn't have excessive fat either. We had the Garlic Naan, Tikka Masala with chicken, curry with Lamb, and a spinach curry with rice and Mango Lassi drinks. All of the meat was very tender and the spices were perfect. We also ended up getting the mango and pistachio ice cream which I was pleasantly surprised at how creamy it was.\n\nOur server was very kind and he seemed like he was happy to serve us. He always kept our waters full at all times without being overbearing. \n\nOverall, it was a great experience at a classy Indian restaurant with a polite server and exceptional food! I would definitely recommend trying it on your next visit to the Strip!"
        }, 
        {
            "index": 27, 
            "rating": 3, 
            "review": "An Indian restaurant with some good and some mediocre dishes. We went there for the lunch buffet on a weekday. There was a decent selection of food in a nicely decorated space. There were lots of \"ethnic\" types which is always a good sign.\nThe chicken curry, tandoori chicken and spiced cauliflower and potatoes were excellent. The naan was good and the dhaal and sambhar were actually not good. So there you have it.\nAlso there was no drink included with the meal for $12.99 which if fine. But what I found quite annoying was that you had to prepay and then if you wanted anything other than water, pay again. This did not make me happy.\n\nExc -Curry, Tandoori Chicken, spiced veggies.\nGood - Decor\nAve - Food\nPoor - Paying policy \n\nWOULD I GO BACK? Probably not. I think I would try another Indian restaurant first."
        }, 
        {
            "index": 28, 
            "rating": 5, 
            "review": "Wonderful food.  It was buffet night because so many people booked - they could only serve that many people buffet style. No worries everything tasted amazing.  Try the mango lassi- \nStaff was so friendly too.\nIt is hidden in the back of the food court at the Polo Towers on the second floor don't miss this place if you love Indian fare."
        }, 
        {
            "index": 29, 
            "rating": 1, 
            "review": "We went to have a dinner buffet during the thanks giving weekend.....They had Stale Biryani in the buffet.....when we informed the staff about it......they just removed the stale biryani from the buffet....but got the same biryani after 10 mins from kitchen and placed in buffet........that's the quality of food they serve!!!!!!!!!\n\nAvoid Tamba"
        }, 
        {
            "index": 30, 
            "rating": 5, 
            "review": "I disagree with any bad comments on this place! Maybe the buffet isn't the greatest but in general buffets are never that good. All the food just sits around. \n\nOn that note, Me and my boyfriend went and ate here about a week ago bc a friend I had in my summer class at UNLV worked here.  Although he wasn't there that night we went anyways and everyone was so nice.  The service was excellent and the food was fantastic.  I completely disagree with the yelp from Sang whatever bc we ordered the Chicken tikka masala and it was awesome.  We also got the lamb vindaloo and the combo together was phenomenal.  The chicken tikka was so buttery and had a great flavor while the lamb vindaloo had the perfect amount of heat.  We had samosas of course and they were pretty good.  From my memory I've had better but everything else was delicious.  Our water was never empty and everyone was so nice.  We also had some dessert, a round cake like ball thing (dont know what its called) and some carrots.  Very good as well.  \n\nThe location is a little strange (I thought it was closed when we were going there) but they were open.  The atmosphere was great, the service was great, and the food was awesome.  The rest of the night me and my boyfriend kept saying how nice of a dinner that was and have been craving Indian food ever since! A+"
        }, 
        {
            "index": 31, 
            "rating": 4, 
            "review": "Pretty good curries and naans. We went here not expecting much but came out impressed. \n\nWe had the veg thali and loved the malai kofta and the raita. The gulab jamuns are also nice here. \n\nWe will surely be visiting this place again. The food seemed freshly prepared. Do try the ginger fresh lime soda. It's pretty close to an indian soda shikanji. \n\nThe best thing is that the saunf (fennel seeds) are not roasted. I usually avoid them at all the indian restaurants as they roast them and/or coat them with stuff. But here, they are just right. They are the thick ones though. Haven't seen the thin ones in any indian restaurant yet."
        }, 
        {
            "index": 32, 
            "rating": 3, 
            "review": "Very conveniently located and authentic, but the food was just okay. Not bad if you're craving Indian food while on Las Vegas strip."
        }, 
        {
            "index": 33, 
            "rating": 5, 
            "review": "Good lunch buffet. We tried veg biriyani & it was excellent. It's right on strip.\nI would recommend to anyone looking for veg Indian food"
        }, 
        {
            "index": 34, 
            "rating": 1, 
            "review": "Awful quality with awful staff. 9 of us had stomach upset after having lunch buffet."
        }, 
        {
            "index": 35, 
            "rating": 4, 
            "review": "Limited decent buffet menu, but the taste is good, esp., when compared to other north indian food located of the strip"
        }, 
        {
            "index": 36, 
            "rating": 3, 
            "review": "I'll start things off by saying the food was good. They had dinner buffet instead of ala carte. The dal, khichdi and custard were really good. However, at $19 per person it was expensive. I'd recommend this place to others but not in the evening. They have tours stop here from the looks of it and they had parties of 30 people come in which lead to lines at the buffet."
        }, 
        {
            "index": 37, 
            "rating": 5, 
            "review": "This is a must visit for Indian good if you are in Vegas!\nBuffet is out of the world -- amazing South Indian and North Indian variety and staff is absolutely great!! The flavors in each dish were so unique and differentiated .. Because of well made food!! You could make out each dish separately .. Thank you Tamba for great food and keep it up!"
        }, 
        {
            "index": 38, 
            "rating": 5, 
            "review": "Even though it is a little hard to find upstairs in the hawaiian marketplace...this place is totally amazing once you get there! We go to Vegas about twice a year and we always make a point of going to Tamba's lunch buffet during our trip. If you like Indian food this place is amazing, the food is fresh and delicious, the ambiance inside is super nice and the service is great! Not to mention the price is so good for all the wonderful food they offer!"
        }, 
        {
            "index": 39, 
            "rating": 3, 
            "review": "The food was fantastic.  My biggest disappointment was the bar.  We wanted martinis.  bartender said they were out of martini glasses.  One drink was so bad, we had to send it back.  If the drinks were as good as the food, I would give it 5 stars.  The host and waiter were super nice and friendly.  But I'm sure it's also bc they were checking us out the whole time we were there."
        }, 
        {
            "index": 40, 
            "rating": 4, 
            "review": "Good food at really nice price ($15 per head) Specially fruit custard and carrot dessert. Also the veg pakora"
        }, 
        {
            "index": 41, 
            "rating": 5, 
            "review": "A hidden oasis! All I wanted after walking endlessly up and down the Strip was to find a reasonably priced restaurant that was quiet. This was it! Strangely placed on the second level of a nearly empty strip mall along the Strip, you might not know it was there. Beautiful inside with soft Indian music playing, this was a place I could forget that I was in Las Vegas and enjoy delicious curry. I shared the goat curry with my husband since the serving size easily serves 2 reasonable appetites along with rice and naan. The naan bread was delicious! The curry had a nice light spice and was probably a bit too salty, but I still loved it. The lime ginger soda was unexpectedly tasty too. I could see going back here a few more times if I were stuck here longer. The waitstaff was attentive too, though there weren't many diners. \n\nOkay, this isn't a place I would typically give 5 stars, but it was just what I needed at the time. One request - draft beer would be a good addition to the menu."
        }, 
        {
            "index": 42, 
            "rating": 5, 
            "review": "I never thought I'd say the highlight of my trip to Las Vegas would be finding Tamba Indian restaurant, but now I am.  I'm so glad we found this charming gem hidden upstairs in the back of a nondescript marketplace.  Kumar, our server, helped make our dinner so perfect.  He was friendly and professional, guiding us with selections from the menu by suggesting his personal favorites.  We started with samosa chaat appetizer and kabuli naan.  We shared a main of prawns in a flavorful red pepper curry with basmati rice.  Each dish was spot-on with a balance of flavor and spice.  We found the prices to be reasonable, especially by Vegas standards.  If you're looking for flavorful Indian cuisine away from the crowds, Tamba is the place."
        }, 
        {
            "index": 43, 
            "rating": 3, 
            "review": "The mango lassi was extremely unappetizing and not at all delicious.  There was no natural sweetness to it and it was super watery.\n\nFor appetizer,  we split the tandoori chicken.  Hugely disappointing.  Absolutely no flavor, not even on the outside. \n\nThe goat biriyani is quite spicy, even if you ask to decrease the spice to a mild level. Our waiter said it ia because the spice is added to the meat itself and that decreasing the spice is hard. \n\nThe rhogan josh was DELICIOUS. I literally tried to lick the entire dish. \n\nThe chicken tikka masala was subpar, not what you would expect because it was sort of bland and did not have well cut pieces.  \n\nFor the best bang for your buck,  order ashoka's plate. You get a lot of variety and option to try many things. The gulab jamun on it was delicious and a great way to end the meal. The dal on it though had a very monotonous flavor."
        }, 
        {
            "index": 44, 
            "rating": 5, 
            "review": "fantastic buffet at $20 per head.\nAmazing selection, very good naan. The food is not over-rich, oily and creamy. Is fresh and each dish has its own taste. Spices are just right.\nHonestly this place was a lifesaver! I had had enough of Las Vegas with its cheesy, decadent food options... everything with mayo on it or some creamy goop. Or loads of carbs everywhere. And then at Tamba's buffet I got really really good food; hugely filling. The dessert - gulab jamun which many people get wrong (too dense or in thick stale sugar syrup) was perfect as well.\nAlthough the 'katories' or styrofoam bowls I took the curries in were flimsy, they helped me taste everything separately and not have everything mixed in my plate. I liked that.\nThe entry to this place made us doubt it but then we saw it was full of people having good good food. I liked the no-fuss atmosphere of the place too. It was a place you could just chill at, relax and eat. Well done guys!"
        }, 
        {
            "index": 45, 
            "rating": 2, 
            "review": "Mediocre. We paid 18 bucks per person for a dinner buffet that was acceptable for a 7.99 lunch. Staff was fine.  Taste and quality very underwhelming.  I usually eat so much at an Indian buffet that I am near exploding, but not this time.  I tried it all."
        }, 
        {
            "index": 46, 
            "rating": 4, 
            "review": "Tried the lunch buffet. It was pretty good and had a decent number of dishes. Dessert could have been better. The ambience is amazing and service is great too!"
        }, 
        {
            "index": 47, 
            "rating": 4, 
            "review": "Yes, very very good. I'd recommend the lunch buffet for value for money. Same as the evening grub, for 2/3 of the price. Great service and vibe!"
        }, 
        {
            "index": 48, 
            "rating": 5, 
            "review": "We had a dinner buffet. It was really good, being a Indian I am always comparing to real Indian meal I liked it to my taste. I would recommend it to everyone."
        }, 
        {
            "index": 49, 
            "rating": 5, 
            "review": "a must place to visit if u love indian food....there goat curry was amazing my husband loved it and as i m vegetarian i liked all their option available in their lunch buffet... definitely worth for every price we paid....the only difficulties which we found was finding this place..."
        }, 
        {
            "index": 50, 
            "rating": 1, 
            "review": "I visited this place after 10 years. Hoping to find the same delicious food and seevice from ten years ago. Food was just OK. its not restaurant quality you would pay for. How could a \"mild\" requested Navratna Korma turn up spicey. This dish is made sweet all throught Mumbai. Not here. Not even upon special request.\n\nService by a certain server named Anand (tall guy, grey hair) was much below par. The only the only thing he did promptly was to take the initial order. For every thing else (water, soda, extra naan) we had to raise our hand in hope that this server would notice and come to the table.\n\n\nWe even had to wait long to get the check and the receipt. All this on a Tuesday night - not weekend.\n\nWhen I tipped him apt to the service reveived (it was not zero. There was still some tip). This server totally lost his cool and started shouting abusive language in front of my kids. \n\nNot coming back here. Not even in a decade. Would prefer McDonald's to this place.\n\nAdvice for the Anand (the server). You are in the wrong profession. Hospitality is not about expcting good returns for bad service. It is certainly not about shouting bad language to your customer for the tip you receive."
        }, 
        {
            "index": 51, 
            "rating": 4, 
            "review": "3.5 rounded up to 4...\n\nMy friend and I were really lucky to find this restaurant, since it was hidden in a deserted mall/plaza. But to the point - it was delicious!\n\nWe decided to share \"Ashoka's feast\", which consisted of a variety of dishes because it was a good deal (comes with rice, naan, dessert, multiple meat dishes, etc.)... it was almost true, but the portions were a tad too small for two people. We had to order extra naan in the end and used it to dip the leftovers with. Everything was pretty good, but I just wish the food was bit more spicier. \n\nThe servers were really friendly and helpful, too! I think this place really is the only Indian restaurant on the strip? Well, that's what they claim on their website...\nOverall, not bad... Price comes out to around ~$15/person... Personally, I think I've had better, but I guess I'm not too picky about my Indian food because they always taste so flavorful to me. I think if I were to come back here, I'd come for the lunch buffet, though."
        }, 
        {
            "index": 52, 
            "rating": 4, 
            "review": "Food and service were excellent.  I went with a group of 16 people and everyone's order was correct, prompt and served at the same time.  Drinks were refilled immediately.  The food was flavorful and as described on the menu.  I would give it 5 stars, with the exception that I didn't have to pay the bill, so I can't really comment on the costs and /or the value aspect of this place."
        }, 
        {
            "index": 53, 
            "rating": 4, 
            "review": "Good food on a busy strip!! Liked the ambience and the quick service. I'm a vegetarian so malai kofta was pretty good. Chicken Tikka for my friend apparently came out really good (in his words)"
        }, 
        {
            "index": 54, 
            "rating": 5, 
            "review": "This is a mandatory stop for us when we are in town. My husband and I enjoy the atmosphere and most importantly every dish we've tried. We live in SD and we haven't found any Indian food that we enjoy as much as we do here at Tamba. \n\nOur favorite dishes here are the Chicken Korma, Chicken Masala, Spinach Pakora, Samosa Chaat, & Aloo Gobi. Oh...and the garlic naan!\n\nFor dessert we always order the Gulab Jamun and Gajar Halwa.\n\nI highly recommend this restaurant'"
        }, 
        {
            "index": 55, 
            "rating": 4, 
            "review": "I recently went from mild vegetarian to full on vegan. I cook a lot at home because its not easy finding restaurants to eat at, especially in Las Vegas, the steakhouse capital of the world. I decided I needed to get out for Valentine's Day and chose to go Indian. I came across Tamba's amazing website and easily made up my mind. After making the reservation I read a few revues on Google and they worried me a bit, but I wasn't going to be shaken. I'm so glad I stayed with it, I loved this place. Staff was very friendly and the food was delicious! We tried the Bhel Puri for an appetizer, based off of the waiters recommendation, great choice. Then for entrees we went with the Aloo Gobi & Chana Masala. Both were amazing and complimented each other nicely, great for sharing. She went with a glass of house Chard, which turned out to be Mondavi(Nice!) and I tried one of the many Indian Imported beers. Hayward 5000 was the beer I went with and was perfect. Gotta find that at Lee's Discount Liquor, hope they have it. \n\nOne side note, when they ask you for bread, it's not included. That was awkward. Also, parking is a bit rough.\n\nOver all this was probably one of the least expensive Vday dinners I've ever had and also one of the most satisfying."
        }, 
        {
            "index": 56, 
            "rating": 5, 
            "review": "Man this place is great.  It is hidden in the back of the Hawaiian marketplace, so you need to seach for it, but wow!\n\nThe first good sign was when we walked in there and saw four Indian gentlemen with the Indian-style turbans (sorry for not being cultured enough to know what they are called) leaving...always a good sign for an ethnic restaurant.  But the food is excellent, and the value for being right on the strip is amazing.  Their chicken masala is to die for, but everything else we had was also excellent, including the saag.  The lunch buffet is a must try.  My wife and I both like Indian food, and this was some of the best, if not the best, we ever had.  Two days in Vegas- two trips to Tamba."
        }, 
        {
            "index": 57, 
            "rating": 4, 
            "review": "Really delicious food. Had the dinner buffet that had everything, got some chicken tikka masala and goat curry. My wife got the rice and sambar and some cheese paneer."
        }, 
        {
            "index": 58, 
            "rating": 5, 
            "review": "We had a fantastic experience at Tamba. We came for dinner and loved how the bustle from the street was completely gone once we stepped inside. Quiet and cozy ambiance, extremely friendly staff, fast service and very good food. We were impressed and will definitely come back!"
        }, 
        {
            "index": 59, 
            "rating": 2, 
            "review": "Being one of the only Indian restaurants on the Las Vegas strip, you would think that they would really take advantage of the situation and show the world how great Indian food can be.  Instead, this restaurant is located inside a mostly vacant building, and the food they serve is very bland.\n\nThe good:\n- great selection of vegetarian dishes\n- the Sambar was the best item on the buffet\n- atmosphere in the restaurant was good\n\nThe bad:\n- Food was very bland, except for a couple of items that were good\n- there were only 3 meat dishes and they were all chicken\n- service was ok, no one ever came by to take my drink order\n- fairly expensive for a lunch buffet ( $15 a person without a drink)\n\nThis place was okay, but there are better places to go for dinner than here.  But if you are craving indian food, then this is basically the only choice you have along the strip."
        }, 
        {
            "index": 60, 
            "rating": 5, 
            "review": "The only downside of Tamba is trying to locate it in the back of the run-down Hawaiian Marketplace. The food is outstanding. The buffet lunch is great at $13.00 per person and features a very good malai paneer. The staff is friendly and attentive. As an added bonus, the interior is very classy."
        }, 
        {
            "index": 61, 
            "rating": 2, 
            "review": "Came here for a Sunday afternoon lunch.Food was decent but we barely had any options.  Slow service. They took 10 min to replenish naan and I waited 20 min to get my mango lassi drink. Buffet was 15$."
        }, 
        {
            "index": 62, 
            "rating": 5, 
            "review": "Awesome food! We ordered Ashoka thali. Best Tandoori chicken I have tasted. It melts in your mouth! Nice service!. Going back again!"
        }, 
        {
            "index": 63, 
            "rating": 5, 
            "review": "We were looking for an Indian Restaurant in Las Vegas and found this one on Yelp. \nWe went there a 8 pm. Many guests were Indians. So... I think this is a good sign. The Service was absolutely friendly. And we had a very tasty Dinner in a great atmosphere. Las Vegas and all the Bling Bling seems to be far far away. Very nice!"
        }, 
        {
            "index": 64, 
            "rating": 1, 
            "review": "Pathetic service, pathetic spread of dinner buffet, pathetic ambiance.\n\nThe servers did not know the scotches available on and off the menu. The dinners quality and taste does not justify the cost of the buffet. \n\nIf you have nowhere else to go, got unnecessary money to spend on tasteless food, then also think twice before going to tamba."
        }, 
        {
            "index": 65, 
            "rating": 1, 
            "review": "Worst Indian food I have ever eaten and definetly not worth the $13.95 for buffet! Mint was asked better then this!"
        }, 
        {
            "index": 66, 
            "rating": 1, 
            "review": "Very mediocre Indian food.  Naans were cold. Currys that these guys serve are cheapest and most commonly available in all Indian restaurants. For this you will be paying ridiculously high price. \n\nPlease improve your food and menu."
        }, 
        {
            "index": 67, 
            "rating": 4, 
            "review": "I had lunch buffet with my family. The food here is real good and everyone of us liked it. It has a great ambience and is really good for large groups too. Also since it's located on the strip, it's a nice place to have lunch after walking down the strip for few miles. I also took the advantage of Yelp checkin, which got me 10% off on my bill."
        }, 
        {
            "index": 68, 
            "rating": 4, 
            "review": "Am Strip gelegen aber etwas versteckt im Hawaii Market Place. Wir haben bei unserem Las Vegas Besuch einmal beim Mittagsmenü zu uns genommen.\n\n\n Das sehr große Restaurant war gut besucht und es waren auch sehr viele indische Gäste im Raum. Dies haben wir als gutes Zeichen gedeutet und haben das Mittagsmenü für ca. 12 Euro zu uns genommen.\n\n\n Man kann america like sich soviel Speisen wie gewünscht an einem Buffett holen. Die Auswahl war ok, man findet von allem etwas und man kann sich auch ohne den Reis satt essen. In den deutschen Retaurants wird man ja meist so satt weil einem Berge an Reis angeboten werden.\n\n\n Zu dem Essen wird einem kostenlos Wasser ausgeschenkt und auch häufig nachgefüllt, ok wir haben das Wasser in Plasikbecher erhalten aber immerhin umsonst :-)\n\n\n Allgemein ist es eine schöne Abwechslung in Vegas auch zu einem Inder zu gehen"
        }, 
        {
            "index": 69, 
            "rating": 3, 
            "review": "This review is for the lunch buffet. Food on the buffet was good, not great. Too many vegetarian dishes. Naan was on the buffet, I prefer fresh naan brought to the table.\n\nAtmosphere was depressing. Tamba is in an indoor \"mall\", with ZERO other businesses. \n\nYou pay before you eat which is fine if you have cash for tip. Several reviews said non alcoholic drinks are included, that wasn't the case on Sunday when we visited. We weren't asked if we wanted drinks until we were seated, since we already paid, we decided to stick with water. Lost revenue on their part.\n\nOverall, it was ok. My husband and I prefer Namaste and Mt. Everest. \n\nAs Vegas locals, we will probably not return to Tamba as the only draw is that we live across the street from it."
        }, 
        {
            "index": 70, 
            "rating": 1, 
            "review": "The worst Indian food ever. Sucks in quality, service and hygiene. Don't waste your money, goto Mint India Bistro instead."
        }, 
        {
            "index": 71, 
            "rating": 5, 
            "review": "Five star Indian lunch buffet. I've been here a few times but only for the lunch buffet. \n\nThe restaurant is the antithesis of the Strip. It is at the back of a Hawaiian-themed, courtyard mall with other restaurants, t-shirt stores, Half Priced Tickets, street performers, etc. \n\nYou enter an office building, take an escalator up a flight, and the restaurant is maybe 25 feet away.  Subdued lighting, calming music, wonderful smells. A little oasis in the midst of the Strip. \n\nFood is very good for a buffet. A little spicy as it should be. Very friendly waitstaff. \n\nPrice at $15 is reasonable for Vegas and even better if you get the 10% off from Yelp for checking in."
        }, 
        {
            "index": 72, 
            "rating": 4, 
            "review": "My first time here. The Sunday Buffet dinner was just amazing. The Idlis were so soft, they just melted in my mouth.\nYou MUST try this south Indian dish to believe it. One of the best Idlis I have eaten outside India.\n\nI had to take a STAR off because they employ kids to serve water and plates.Somehow dint like the idea of that."
        }, 
        {
            "index": 73, 
            "rating": 4, 
            "review": "The food for the most part was fantastic. While this restaurant is on the expensive side, the quality of the food is outstanding. The lamb kabobs are extremely tender and flavorful, and the naan is as good as it can possibly get. The only thing to stay away from  is the saag paneer. It's not bad, but it's not the best either. The restaurant is very nicely decorated and provides a nice setting for dining."
        }, 
        {
            "index": 74, 
            "rating": 4, 
            "review": "Veggie biryani was fantastic, paranthas were hot . Though i had asked for mild it did appear to be a little hot but was delicious. The cucumber Raitha did not have cucumbers at all."
        }, 
        {
            "index": 75, 
            "rating": 2, 
            "review": "This place has a buffet for dinner most of the time I think.\n\nIt's really sub-par indian food, although it wasn't bad, just completely unexceptional.\n\nService was fine."
        }, 
        {
            "index": 76, 
            "rating": 1, 
            "review": "Wait times are awful and the service is horrendous. Food was mediocre at best."
        }, 
        {
            "index": 77, 
            "rating": 4, 
            "review": "The food here was excellent, a little on the spicy side, but probably the best Indian food on the strip. The yellow dal was very good."
        }, 
        {
            "index": 78, 
            "rating": 4, 
            "review": "Nice restaurant and ambience is very good. It is primarily North Indian food with a few South Indian items in the buffet at lunch."
        }, 
        {
            "index": 79, 
            "rating": 4, 
            "review": "I was trying to find a nice place to take my girlfriend for her birthday dinner.  First, we were looking for a Greek place, but didn't find any with decent reviews, so since we have had good luck with Indian food in the past, I figured I'd scour Yelp for suggestions.  I found Tamba to be in the top five on Yelp and found every place in the list to have mixed reviews.  After looking at the web sites of the top five, their menus and plenty of thought, I finally decided on Tamba.  I used opentable.com to make our reservation for 7pm Saturday night.  Since this place is in the Hawaiian Marketplace on the strip, I figured it would be packed.  In fact, one of the reviews said to make sure you get a reservation or your wait could exceed two hours.\n\nWhen we arrived, the place was pretty empty.  I believe there were only four or five tables taken at that point, so we were greeted by the manager and he wished my girlfriend a happy birthday.  Nice touch.  \n\nI am actually glad the place was empty because the waiter spent a lot of time talking over the menu options and giving us recommendations.  During our conversation with the waiter, we talked about the lamb dishes and he could tell we were hesitant, so he brought over sample for us to try.  It was so good, I chose the Roghan Gosht as my main dish.  My girlfriend chose the Butter Chicken and we started with the Sea Bass appetizer.  On the spice scale, I'd say the lamb was a 5 out of 10 and the butter chicken was a 3.\n\nThe wine selection was average, but my girlfriend really enjoyed the fruity martini.\n\nThe price was better than I expected for dinner on the strip in Las Vegas.  We both had two drinks, an appetizer, two main dishes, rice, garlic nan and two desert items and got out of there for around $70 and that included the tip.  \n\nTwo more signs that Tamba serves good Indian food; by the time we left (8:30ish), the place was packed and there were a lot of actual Indian people dinning there.\n\nWe both said that we would go back."
        }, 
        {
            "index": 80, 
            "rating": 5, 
            "review": "Excellent food. \nSamosa Chaat and Aloo Tikki were some of the best ones I have had so far in America. \n \nThe food overall was excellent. \nI'm really glad I decided to come here. First I was skeptical because the place was completely empty. Not a single soul was here. However, a lot of people showed up once we were sitted. \n\nHighly Recommend to any one."
        }, 
        {
            "index": 81, 
            "rating": 4, 
            "review": "Almost everyone in Vegas claims to have a special deal for you.  Usually, it's associated with trying to make more from you off something else (once they get you in), or just offering you something at a discount because it was way overpriced to begin with.  Then there are those deals that are so low because it's crappy food (like many of the prime rib specials.) Well, Tamba doesn't fit into any of those categories, but they have a genuine deal: a $12.95 lunch buffet!\n\nAnd it's not the type of buffet that you're accustomed to running away from.  There are a variety of reasons I stay away from buffets these days, but Indian buffets tend to be an exception. Quality food, and wait for it...fresh food. Shocker!  I had salad with mint chutney, potatoes, rice, marsala, chicken tandoori, and a few other things I can't all remember.  Most of the items contain a description above it, but when I was struggling, one of the employees noticed and gave me a suggestion in a kind matter.  He didn't make me feel dumb at all for not knowing what some things were.\n\nIt's a pretty nice restaurant too, quite large and relaxing ambience, really dim.  It's nice to feel relaxed at a buffet, rather then rushing through buffet lines or worrying that the person in front of you is gonna get it before you.  There was none of that here (at least when I went).  I'm surprised it wasn't more crowded on a Sunday afternoon, but I'm not going to complain.  The waiter filled my drinks up frequently and was really polite.\n\nWhen I want a quality affordable large meal in Vegas, I know where I'll be having lunch."
        }, 
        {
            "index": 82, 
            "rating": 2, 
            "review": "I am in Las Vegas, NV for a conference. As I had visited Tamba few years back and was impressed at that time, I decided to return today for dinner. But this time the experience was extremely bad. I ordered Vegeterian Thali (Buddha Feast) that came with Dal Makhani, Kofta and Sag Paneer (Spinach and Cheese). As I was eating the people in the next booth tried to order Saag Paneer as an Entree and the waiter told them that it has gone bad so he cannot serve them. I called the  waiter and asked him if Sag Paneer was bad then why did he serve me. He did not have a clear answer and tried to wiggle out of the situation. Then I asked to speak with the manager and brought the same issue to his attention. The Manager (guy with beard) started yelling at me - if it was bad then why did I eat it. Shameful answer (blame the customer). \n\nI asked him for the check, paid the bill and left. Not going there ever again. I am stressed right now and feeling I will get sick eating bad food. Do not want to get sick while traveling for work."
        }, 
        {
            "index": 83, 
            "rating": 5, 
            "review": "Order the chicken korma it is to die for. Garlic or plain naan with yellow or basmati rice and you are set!"
        }, 
        {
            "index": 84, 
            "rating": 4, 
            "review": "Given that we were hella drunk and hella hungry, but the food was awesome.  We got 3-4 appetizers and each of them were good, dont remembr what we got though.  For dinner, we got Bhindi, totally awesome, Daal was great, Malai Kofta was good but a very small helping and we got some chicken.  The food was served in exactly 5-7 minutes after we ordered.  The good is it was before time, the bad is, it was all prepared in advance.  The rotis and the paranthas were very good.  We had Kheer and Gajar Ka Halwa.  I highly recommend this place on the strip.  Food was heavy so we walked to our condo at the Signature next to MGM."
        }, 
        {
            "index": 85, 
            "rating": 1, 
            "review": "Pathetic! Stay away from it. Really atrocious food and even worse service!!! The food was not heated and had a stale taste. Nan's were rock solid.. Chicken, both tandoori and chicken tikka masala prolly the worst I've eaten anywhere!"
        }, 
        {
            "index": 86, 
            "rating": 5, 
            "review": "Yippieeeee this place Rocks.\nLove this place on the strip. \nAmbiance,Food,Service, Loved it.\nBeen to this place on my trip to vegas and never imagined that we will get the top-notch Indian Curry in this Sin City.\nLoved their Lunch Buffet $13.95 all you can eat.\nYou can smell the fresh Vegetables blended with spices the moment you enter their facility.\nBuffet was really a surprise package for me and my fellow buddies, enjoyed their Beautiful Buffet spread with Quality Spread (Fresh Fruits, Desserts & Vegetables, good Chicken selection---HEAVEN). \nTo all my fooddiees and Curry Lovers must check this place and you will be Glad.\nBest wishes to Team Tamba and looking fwd seeing you back on my next visit."
        }, 
        {
            "index": 87, 
            "rating": 1, 
            "review": "Over all good food right price however pathetic service & attitude of the staff including manager there it took 45 min for a order to come on weekday and tht too it wasn't complete until we completed the entire dinner they didn't bring the raita / chutney we ordered and they tried to sneak in the 2 items in the bill. Won't recommend due to service and attitude issue."
        }, 
        {
            "index": 88, 
            "rating": 5, 
            "review": "Best Indian food in Las Vegas . Been loyal customer for 5 years. This is my go to spot for halal prepared Indian food. My vegetarian friends love this spot when I bring them also. Feel like negative reviews r their competitors cause who names exact people that get sick from food LOL. Never had bad experience and their garlic nan is always on point"
        }, 
        {
            "index": 89, 
            "rating": 5, 
            "review": "Great Indian food best in vegas ... have been here a number of time and found it amazing always... lunch buffet and budha delight are my personal favorite:)"
        }, 
        {
            "index": 90, 
            "rating": 4, 
            "review": "They do a fine job here.  Most of their vegetarian items beat the hell out of other indian buffet vegetarian items.  Sadly, their meat items do not beat the hell out of other indian buffet meat items.\n\nGood price.  Nice Service.  Nice ambience.  I like it."
        }, 
        {
            "index": 91, 
            "rating": 5, 
            "review": "One of the best Indian restaurants I ever been to...the smells that hit you, when you first walk in, are amazing!.. staff friendly, try this place, you won't regret it!"
        }, 
        {
            "index": 92, 
            "rating": 1, 
            "review": "We went their for dinner, food was okay. It's expensive for amount of food you get. It's not for original indians who like to eat Indian food with flavor and spice.\n\nAlso please be aware that if you are using your ATM card, they will automatically add tips for amount they like so please pay attention. I don't recommend this place for any reason. Service is not that great.\n\nI also read same thing about credit card charges in some other review so please pay with cash if you can."
        }, 
        {
            "index": 93, 
            "rating": 5, 
            "review": "Great food... great service... we had lunch buffet.. it was great... i will come here for sure whenever i will visit Vegas.."
        }, 
        {
            "index": 94, 
            "rating": 4, 
            "review": "Parking sucks here, so try not to drive.\n\nOnce you get over that, then you have to find it.  It's upstairs in the Hawaiian Marketplace.  They have a lunch buffet for $15 which is dang good. usual suspects on this buffet and probably like 15 total choices of things to eat.  I've also eaten here for dinner w/ an Indian client of mine.  And when you eat there for lunch you will see Indians eating there too [great sign in my book!]\n\nI love their Indian techno music.  They have a very nice motif, it's very clean, and the staff is on it.\n\nYou can be in and out of here [minus parking] at lunch time in 30 mins if you needed to be."
        }, 
        {
            "index": 95, 
            "rating": 1, 
            "review": "Not a friendly reception , You have to prepay . When you ask  how many items in the buffet , the answer is \"Lots of items\" with a eye on the credit card.  You don't even know what you are paying for. The food tastes like its been cooked a long time before.\n\nNot a good selection of the buffet menu."
        }, 
        {
            "index": 96, 
            "rating": 5, 
            "review": "Bread portions are small. Loved everything else. Friendly staff, good service, and delicious food. Will come back for sure."
        }, 
        {
            "index": 97, 
            "rating": 5, 
            "review": "I declare this place: The best vegetarian food I've had in Vegas, baby!\n\nFood: They get the spicing right!\nAtmosphere: cool-- but more in a San Francisco than Vegas way\nService: attentive and friendly\n\nIn Vegas for a convention, and not really that happy with the bazillions of \"hotel\" restaurant choices (while recognizing that many of them are exceptionally good) and wanting something vegetarian, I looked these guys up and was impressed by their website.\n\nI went alone, as the rest of my compadres were busy at the blackjack tables, or somewhere else doing more \"Vegasy\" things, and the hostess sat me immediately, gave me a menu, and made sure I received my H20.  \n\nThe waiter came, discussed the wine and beer list and suggested a beer-- the name I forget, but it was great.\n\nI ordered the Navrattan Korma, and sort of expected your typical Indian Navrattan Korma, but was pleasantly surprised to receive it with a nice kick-- seriously spiced right!  VERY tasty.   When he first put down the dish I figured I'd eat about half of it, but I polished it off and would have continued eating if there had been more... I've been to Vegas a few times, and have never been all that happy with the food, so it was a real treat to go somewhere this good.\n\nIt was truly the best meal I have ever had in Las Vegas."
        }, 
        {
            "index": 98, 
            "rating": 5, 
            "review": "The food is amazing! Being of Indian heritage and coming from London home to Indian food, I think I can safely say I know what I'm talking about.  My wife and I ordered Chicken Tikka Masala and Chicken Korma respectively, seriously the food was top notch.  The right amount of spices, sauce and heat.  The garlic naan was great too.\n\nThe only negative thing about the food is that they don't use Basmati rice... Seriously, an Indian restaurant that doesn't use Basmati rice???? UNHEARD OFF!!! \n\nHowever, this is a very minor gripe, the food, decor, ambience more than make up for the choice of rice.  The decor is one that I have never seen in an Indian restaurant, but it works.  The music not being the standard Bollywood or cliche definitely is a welcome choice"
        }, 
        {
            "index": 99, 
            "rating": 4, 
            "review": "Very flavorful and fresh Indian food here!\n\nI was in Vegas with my family from India last summer and we ate here (since almost all of them are vegetarian), and it was delicious! The buffet wasn't very pricey at all and had a ton of choices, both veg and non-veg.  Definitely a yummy place to eat!"
        }, 
        {
            "index": 100, 
            "rating": 2, 
            "review": "The people here are running more a business than a place for some Indian food. I observed the owner & manager to be very business minded & be cared to the customers with such perspective. \nThats different story, who cares if the food end up delicious, which isn't the case. Less than average taste, not all the items in Menu are available. The only advantage its at the Strip. Else I liked the food http://www.everestcuisine.net/, far better than in Tamba during my 3 day visit to Vegas."
        }, 
        {
            "index": 101, 
            "rating": 4, 
            "review": "Dinner prices are very reasonable.  It's surprising how busy it can be considering the location way back in a plaza with nothing else there.  They offer a multisampler dinner which gives you small portions of 4 or 5 things.  I got the buddah's delight which included a few vegetarian dishes and also included rice and naan for $21 but I didn't like everything that was offered.  I would rather just have one large portion of a dish I really liked for $13 instead.  The saag paneer was incredible.  It's amazing how every restaurant does it differently.  This was more pureed than others.  \n\nI looked at their selection for the lunch buffet and it still looks great.  Look forward to checking it out again."
        }, 
        {
            "index": 102, 
            "rating": 5, 
            "review": "I love this place! EVERY dish we had was amazing and the staff was so friendly. Even on a Friday night our food came out in a timely manner and looked great."
        }, 
        {
            "index": 103, 
            "rating": 4, 
            "review": "This place is an exotic gem hidden inside the crappiness that is the Hawaiian Marketplace. Walking through this rundown strip mall and into a mysteriously empty building and up the escalator, I did not expect to find a beautiful atmosphere of Indian decor. I really regret ordering take out instead of staying to dine in but my friends and I all picked up food from various places and we wanted to eat together.\n\nI was immediately greeted by a gentleman who gave me helpful suggestions on all of their vegan-friendly items. This made ordering very easy for me. While there were several options, I decided on the following:\n\nKali Dal (slow cooked Black Lentils and spices) http://su.pr/7Wv21z\nVeggie Samosas (about 5 or 6 pieces) http://su.pr/2wAdc9\nTandoori Roti - whole wheat flat bread\nBasmati Rice\n\nOne sad thing about take out is that the presentation is not as elegant. However, it smelled good, it tasted good, and I was happy. My friends were definitely peering over at my food. I even gave away one of my tasty Veggie Samosas. For the $33 that I paid, I had a full vegan meal plus enough leftovers for a second meal which tasted just as good two evenings later."
        }, 
        {
            "index": 104, 
            "rating": 4, 
            "review": "Great deal for the price. The location of the restaurant is strange. Hidden inside of the Hawaiian Marketplace.\nInside atmosphere is very nice.\nHad the lunch buffet which was very good- spicy food which we loved.\nGood bet if you want to get away from the strip for awhile."
        }, 
        {
            "index": 105, 
            "rating": 5, 
            "review": "Hey, this is really good food! We ordered Chana masala, navratan korma, malai kofta, naan, vegetable samosas, rice, and raita--all prepared exquisitely."
        }, 
        {
            "index": 106, 
            "rating": 5, 
            "review": "Awesome food! Had malai kofta, chicken curry and veg biryani. All of them were great. We loved the food.."
        }, 
        {
            "index": 107, 
            "rating": 4, 
            "review": "We had a really lovely experience!  The ambiance is tasteful, and our service was very friendly and helpful.  He politely explained the items on the menu since we proved to be Indian food dummies.  \n\nTamba does not open until 6:00.  Parking can be a bit confusing.  There is a lot behind Mcdoanld's...there is a booth with a parking attendant...says $5.  We told them we had a dinner reservation at Tamba and he let us right in.  No $5 necessary.\n\nWe tried the cheese appetizer served with spicy mint sauce, tamarind sauce and crackers.  It was really good!  We had lamb korma, chicken tikka masala, eggplant, 2 types of naan, and basmati rice.  The sauces on the chicken and lamb were excellent but the meat was dry in both.  The eggplant was out of this world.  Everything had great flavor.  \n\nI would definitely go back and I'm recommending it to all.  \n\nWe spent $100 for 4 with all the aforementioned and 2 large beers."
        }, 
        {
            "index": 108, 
            "rating": 3, 
            "review": "Slightly overpriced but good. Service was not that great. Hidden on the strip, how can they afford rent?  i wonder!"
        }, 
        {
            "index": 109, 
            "rating": 5, 
            "review": "This place is little gem in vegas\n\nIt is hidden inside mall but the ambience is calming.\n\nThe food is top notch. My favorite includes dosa sambar along with upma.\n\nI went here 4-5 times and not even once i found any food cold or bad . \n\nLastly don't miss the tea . It is really nice.\n\nEnjoy this awesome indian place in vegas !!!"
        }, 
        {
            "index": 110, 
            "rating": 3, 
            "review": "Good tasty food. Very pricy as expected in Vegas. Still they over charged me on my credit card. I would suggest you to pay by cash like in any tourist place. I went for dinner Buffett. Deserts are ordinary."
        }, 
        {
            "index": 111, 
            "rating": 5, 
            "review": "I came here with my coworkers after a long boring sunday at work. Eating here was definitely the highlight of my day. We ordered:\n\n-Chicken Tikka: delicious cubes of flavorful chicken served with sides of mint as well as tamarind sauces. \n-Tandoori Chicken: delicious preperation, i only wish the cuts of chicken were meatier. \n-Chicken Tikka Masala: my favorite dish. Full of flavor and soft tender chicken pieces. The sauce base is perfect for dipping your naan into. \n-Chicken Vindaloo: the spice level was perfect. it was spicy enough for those who are adventurous, but it wasn't so spicy that is took away from the wonderful flavor. \n-Yellow fried rice: great flavor, perfect accompaniment to the tandoori chicken. \n-Naan: plain butter and garlic : both were excellent. flaky with a soft fluffy center. \n-Drinks: Bombay 7, Sapporo beer, Strawberry daiquiri  \n\nThe service was fantastic both from the waiter and the bussers. The ambiance was excellent and the decor and dishes they used to serve the food were very modern. I would not hesitate to take a date here."
        }, 
        {
            "index": 112, 
            "rating": 4, 
            "review": "This review is solely for the lunch buffet:\n\nTamba offers perhaps the best Indian lunch buffet in town.  Unlike most Indian restaurants in Vegas, the cooks at Tamba don't focus on a bland tourist palate.  And as a result, they don't produce spice-less offerings.\n\nWhat the buffet does offer is an amazing array of vegetarian options--tasty, spicy and delicious options--chana masala (chick pea masala), palak paneer and various other vegetable-based deliciousness.  But the buffet isn't solely for the vegetable lover.  The Tamba buffet also carries several chicken dishes in well-crafted sauces.  If you've eaten at a few Vegas Indian buffets, you'll know that tasty and spicy foods are rare.  So if you're near the south side of the strip for lunch, you can't do much better.\n\nAs for the dinner or regular dishes (not in buffet form), I haven't tried them, but several India-born friends have told me that Tamba is the best Indian restaurant in town."
        }, 
        {
            "index": 113, 
            "rating": 4, 
            "review": "Indian food on the strip!!! Yaya!! \nIt was like visiting lil India on the strip. \nWe reached here when it was 10:45PM, yes they were even letting in people when it was 11PM. \nThe food was just ok, not spicy to my indian taste buds. But yes you can ask them to make it spicy."
        }, 
        {
            "index": 114, 
            "rating": 5, 
            "review": "Stopped in for a late dinner and we were greeted very friendly and had the best Indian food!  Kumar,\nour friendly server, kept our glasses full and made sure we were very happy. We had chicken tikka masala - (nicely spicy!) and chicken korma, creamy and delicious!! I highly recommend this restaurant while you are here in Vegas.  Thanks Kumar!!"
        }, 
        {
            "index": 115, 
            "rating": 4, 
            "review": "Amazing food! Great atmosphere! Don't let the location discourage you! Great service on too of it!"
        }, 
        {
            "index": 116, 
            "rating": 3, 
            "review": "I am giving 3 star just because i liked the \"classic chicken curry\" else i was so furious about the service.\nI went on a Friday night and totally understand the footfall volume and that can cause delays in service. However, i ordered a \"tikki-chole\" as appetizer and that took more than 30 mins which is really not acceptable and beside that it wasn't good in taste.\n\nBut chicken curry taste was good and they also give chopped onion with lemon and green chili just like India ;-).\n\nThe wait-staff really need to work on the service and when a customer is asking for something they should return and should not take any request casually."
        }, 
        {
            "index": 117, 
            "rating": 4, 
            "review": "Requested pander tikki masala per other yelp user. Excellent dish.  Solid service. Only complaint is they charge for rice.  I hate that."
        }, 
        {
            "index": 118, 
            "rating": 1, 
            "review": "This is the absolute WORST restaurant I have ever been to. The service is the Worst. The staff is very rude. I was there for dinner the day before Thanksgiving with my family and had a very bad experience. \n\nPlease avoid and try one of the other Indian restaurants on the strip."
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "My boyfriend and I were starving and didn't want to walk very far from MGM for dinner. We found this place on yelp and were skeptical about the place since the location was quite hidden and not many people were dining in. \n\nAnyway, we were there last night. It was our first time to have Indian cuisine, so we absolutely didn't know what to order. Our server was very welcoming, friendly, and very informative. He made very good recommendations for our entrees which was called Karahi Chicken. It was AWESOME! It had the right amount of spice and had such a great thick blend of curry with onions tomatoes, peppers, and cilantro. Served with garlic flavored Nan. I ordered the Ashoka's Feast which consisted a taste of India's most popular dishes and that was amazing.\n\nSo to sum it up. Great service from our waiter. Great food because my boyfriend was very happy at the end of dinner, even though he was feeling down when he lost $150 gambling. Lol."
        }, 
        {
            "index": 120, 
            "rating": 4, 
            "review": "Accessibility (Parking / Wait Time)\n\n1/1 Star: no wait but I think I got lucky. It's a small place and they take walk ins only. \n\n_____\n\nService (Waiter / Cleanness / Ambiance)\n\n1/1 Star: normal service. Clean. Cozy little place. \n\n_____\n\nTaste (0=Not Edible / 1=Edible / 2=Good (average) / 3=Must Try!)\n\n2/3 Stars: food was really good. \n\n_____\n\nOverall Experience\n\n4/5 Stars \n\n_____\n\nLast Words\n\nCozy."
        }, 
        {
            "index": 121, 
            "rating": 1, 
            "review": "If u have no value for ur money and also if u like eating tasteless food ...i suggest u going there.......we went there for eating authentic indian food and ate the worst indian food.......i dont know how they got so many good reviews.\n\nwe ordered fish curry, prawns, briyani and fried rice.............the fish curry and prawns had the same masala they just put some prawns and fish in the curries......also the no of prawns was v less(hardly 4-5 nos) .briyani and fried rice tasted the same except it looked bit different....\n\ni had seen photo of many bollywood (indian stars) coming to  this place.....i am sure they will never come again if they had the chance to taste their plain food.\n\nCONCLUSION- WORST FOOD & PRICEY (100 dollar for 2)"
        }, 
        {
            "index": 122, 
            "rating": 5, 
            "review": "A little off the strip in a deserted mall. Really good Indian food. Just an excellent choice to take break from all those Burgers and Burgrs and Best Burgers Ever on the strip. Also easy on your wallet! Highly recommend it."
        }, 
        {
            "index": 123, 
            "rating": 4, 
            "review": "Legit spot for hangover brunch. If you can wake up early enough for it. I'm very critical of Indian restaurants but this lunch buffet hits the spot like a triple chilled, quintuple distilled, boutique vodka. Service is hit or miss but the food makes up for it. If you're jonesing for different edible fare in Vegas in between the $80 buffets and the Subway in that crappy casino on the Strip, this is a solid choice to soak up your alcohol indiscretions. If you shoot fire out of your bunghole the next day, it might be Tamba. Then again, it might be the result of table service at Marquee. Who knows?"
        }, 
        {
            "index": 124, 
            "rating": 5, 
            "review": "We enjoyed the buffet and it was reasonably price of $12.95. I would recommend visiting here."
        }, 
        {
            "index": 125, 
            "rating": 5, 
            "review": "This place is awesome!! We had dinner here last night and we were pleasantly surprised. Not only was the food delicious, but the portion size was perfect. The price was great and we left very satisfied. This is probably our top favorite Indian restaurant so far."
        }, 
        {
            "index": 126, 
            "rating": 4, 
            "review": "I went there on a long weekend while my stay in Vegas. We could not order ala-carte because  only evening buffet was available due to the rush, that's what they told us. There were many obcains both for veg and non-veg. The only negative point I can say is that the biriyani rice wasn't proper basmati rice and the taste should  have been better but all other food were really nice.\nI recommend this restro if you want to taste Indian food in Las Vegas."
        }, 
        {
            "index": 127, 
            "rating": 1, 
            "review": "I went to Tamba for the Christmas buffet. I ordered with my boyfriend 2 mango lassi (my ultimate favorite drink), and let's say should I have ordered water, I would have been better off! The lassi was very sugary and watery, really really bad.\n\nRegarding the food, the buffet offered a lot of vegetarian options so I went for the butter chicken and it was more of a soup than a rich curry... Plus omg the spiciness!\n\nAll and all I was highly dissatisfied, especially as it was Christmas and I love indian food. Would recommend you to go elsewhere."
        }, 
        {
            "index": 128, 
            "rating": 1, 
            "review": "Pathetic service.. Ordered one chicken biryani.. They took more than hour to deliver biryani and no response from the staff.. wasted my time only because my kid loves biryani and walkable from strip.."
        }, 
        {
            "index": 129, 
            "rating": 5, 
            "review": "I was impressed by the excellent food and good service. You can tell that the food here is actually cooked by Indians. They vary the degree of spicyness, just tell them what you like. I had the Aloo Gobi, which is vegan ny the way. My favorite Indian dish, a potato-cauliflower curry. The portions are pretty big, I took half of it home."
        }, 
        {
            "index": 130, 
            "rating": 2, 
            "review": "The food is expensive, service and taste was not much to write about.  Overall experience below average."
        }, 
        {
            "index": 131, 
            "rating": 2, 
            "review": "I rarely write negative reviews. But, experience at Tamba has been so different that I had to.\n6 of us went for lunch buffet on the 30th December 2015 afternoon. We were happy to find an Indian place on the strip! The ambience was good, location was great and the food tasted ok as well! Upma was very tasty. Idly was very dry - probably because we went around 2:00 pm which was too late for the food to be fresh.\n\nMy main complaint is,the minute we completed our lunch all of us felt extremely drowsy and sleepy. All of us were not up until late evening. We were surprised that all 6 of us felt the same way! Neither we were sleep deprived nor extremely tired to doze off after lunch.\n\nOn sharing this with our friends, we came to know that 12 of our friends had lunch buffet in Tamba sometime in September 2015. Most of them had an upset stomach. \n\nAll other restaurants had a long wait time because of which we chose to go to an Indian place. Had we chosen a different place, we might explored the strip that afternoon instead of warming our beds. \n\nHope this is not happening to anyone else!"
        }, 
        {
            "index": 132, 
            "rating": 1, 
            "review": "No taste what so ever in any of our food. We ordered 3 different kinds of \"shaak\" n all of them tasteless. Even the customer service was bad. We had to ask for water 2 or 3 time. No one even come to ask how was the food.  Very disappointed."
        }, 
        {
            "index": 133, 
            "rating": 4, 
            "review": "Tamba Buffet!\n\nNewly renovated Indian Restaurant. Been there before. Food has improved. Variety as well. Lot to choose from. Great ambiance. Nice seating arrangements.\nWould definitely recommend it if you want to try some Indian food on the strip. \nWalking distance from Planet Hollywood.\n\nTamba is a place to Re-mamba!\nCheers!"
        }, 
        {
            "index": 134, 
            "rating": 3, 
            "review": "3.5 stars!!\n\nA good place to have a quick bite on the strip.\nThe portion size is not that big for the price. But this is Vegas!!\nCame here for dinner, and the food quality was good. Not too spicy, bit just enough."
        }, 
        {
            "index": 135, 
            "rating": 5, 
            "review": "The food was excellent, this place in on the top 3 Indian Food restaurants we have dined at.  I would highly recommend. Not the easiest place to find being on the back upper floor of a shopping plaza but it is worth finding."
        }, 
        {
            "index": 136, 
            "rating": 4, 
            "review": "Had a group of 4, 2 of wich were vegetarian and 1 was Indian.  So we had a variety mix of things from the menu and everything was up to par.  All people in the group were happy with the food.  Things were made well and tasty.  Service was decent.  The wobbly table was annoying.\n\nOnly minor thing was the heat level. We all asked for HOT, the server said Indian hot?  We all said YES... and it was unanimous that it came more a medium.  That didnt ruin anything.  Just a preference.\n\nThere was a buffet for a \"private\" party that all filed in while we were eating. So towards the end of our meal it was quite busy.\n\nThis is a place I would go again. The prices were reasonable, the food was really good, portioned well, good variety and there were no major issues during our visit.  We all found it enjoyable."
        }, 
        {
            "index": 137, 
            "rating": 5, 
            "review": "Delicious food, and incredible service! We had a great time! Our server Kumar is wonderful!"
        }, 
        {
            "index": 138, 
            "rating": 2, 
            "review": "Things have changed tremendously at Tamba from my earlier visit, which was about 2 years back. Unfortunately, things have taken a downturn.\n\nParking is a pain. If you can walk or take a taxi, do that instead. \n\nFirst thing that throws us off is the prepay for lunch buffet. I mean, this is the only restaurant I know where you have to prepay for the buffet. Yes, the spread of the dishes is good; that is where we were deceived :(\n\nThe veggie dishes were bland and lacked the flavor and punch of the Indian spices! The 'Malai Kofta' was too salty. The 'saag paneer' lacked paneer and was only a mishmash of spinach; the chole was OK and lacked the punch as well. The Idlis: like rubber! Upma was OK. \n\nFrom the desserts, the Gulab Jamun was OK and the Custard was alright too. But then, he placed small containers to fill them up. We filled our stomachs with mostly the desserts(not a healthy way, I know) and for a high-price of almost $13 per person. \n\nThere are better Indian restaurants, I would recommend. Go to Gandhi's or India Place instead and be treated to some flavorful food and better service.\n\nAnd waiters in Tamba: Grow up and dont play 'Catch ball' when you have customers...and by 'Ball' I mean...you know what?\n\nAnd to end this, I AM NOT GOING THERE AGAIN!"
        }, 
        {
            "index": 139, 
            "rating": 3, 
            "review": "Even buffet was pretty darn good for 19 dollars .  When they have menu service, that kicks butt.\nA good deal on the strip of excess."
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "Superb food! Great hospitality and wonderfully welcoming hosts. All the food was brilliantly prepared and we were served with a smile!"
        }, 
        {
            "index": 141, 
            "rating": 5, 
            "review": "Good food.. Came here for lunch buffet with parents. They loved the food and so did we."
        }, 
        {
            "index": 142, 
            "rating": 5, 
            "review": "GO for the FOOD, not the ambiance.\n\nWe were in Vegas for my sister's wedding (indian), my extended family pretty much ate here everynight except one (the reception). \n\nThe buffet is great for vegetarians, they keep it fresh and warm. the food is excellent and lots of choices. The meat stuff was good too, but I was too fully from everything else.\n\nThe service was fair, our nephew has some food allergies and they were not overly accomadating in tyring to prepare something outside the buffet. \n\nThere seems to be a caravan of indian tourist buses that roll thru the area in the evenings, so be prepared for it to be busy."
        }, 
        {
            "index": 143, 
            "rating": 4, 
            "review": "Decided to go here for lunch with my brother because we were craving for some Indian food and we were essentially stuck on the Strip so this was the perfect place to go to!\n \nThis place is a bit different since you have to pay upfront before going into the buffet. It is also easy to miss because it is located in the Hawaiian Marketplace Plaza. You have to go into the main building next to the Chili's and just ignore the rundown shops on the first floor as you ascend to the second level where this restaurant is located.  \n\nThey have a good selection of food like naan, butter chicken, basmati rice, tandoori chicken, and some other items. The naan is in the buffet so you can grab as much as you want when you want it! The only downer is that it is plain naan instead of garlic, but it still tastes fine since you can just eat it with the curry for flavor. \n\nI'd recommend checking this place out if you like Indian food and want a change of pace when it comes to eating on the strip. The lunch price with the Yelp discount was about $14-15/ person which isn't too bad considering the food and location. Also, I saw a bunch of Indian people when we walked in so that must mean this place is good! The staff is also very attentive as they refill your drink and take away your plates in a timely manner."
        }, 
        {
            "index": 144, 
            "rating": 3, 
            "review": "Ambience is good and staff is vrry freindly but the food was not at all good. I wud say only buffets are good here"
        }, 
        {
            "index": 145, 
            "rating": 4, 
            "review": "Tamba is an authentic Indian restaurant - hidden in a small plaza across from the Monte Carlo Casino.\n\nClean, Dimly lit, smaller tables and with Indian decor throughout - this place had a casual yet intimate atmosphere.  The service was fast and friendly - the staff seemed to genuinely appreciate our business.\n\nWe ordered authentic Indian dishes - Prawn Mackne, Classic Chicken curry & .  The dishes were generously proportioned, full of spices and flavor.  Combined with the Yelp discount - 2 dinner entrees, 3 drinks & an appetizer came out to a rather modest price of $65.00\n\nTamba may not be on anyone's 5 star list of restaurants - but we enjoyed an unexpected yet exceptional dining experience."
        }, 
        {
            "index": 146, 
            "rating": 2, 
            "review": "Only option for lunch is the $14 buffet and the selection is limited. Food was ok, I have had better.  The area smelled real bad too."
        }, 
        {
            "index": 147, 
            "rating": 5, 
            "review": "This place is amazing. Food is great and good value too. If you are looking for comforting food with cozy setting. Its far from busy street. Navratan korma was great and Nan was much better than other places."
        }, 
        {
            "index": 148, 
            "rating": 4, 
            "review": "A little secret hidden in the Hawaiian marketplace, Tamba was a surprising find and the quality was outstanding.\n\nI was with a party of 5 and we all got something different and spent the evening swapping tastes of each others dishes. I myself had \"Palak Paneer\" and \"Yellow Rice\". The paneer was excellent and generous portions of tofu. The rice was nearly perfect but just a tad undercooked/dry but worked well as a mix with the paneer wrapped up in fresh nan.\n\nThe dishes and the restaurant are well presented with authentic palettes and decor. The music was subtle an unobtrusive and the waiter was superb.\n\nWhile this restaurant is in Vegas, the prices were a little high than I'd normally expect but are a pretty good deal considering the location. Good deals can be had if you check the normal coupon books. There are specific ones for Tamba that could have saved us a bit.\n\nWith all that said, while the food was excellent, the staff was superb, and the atmosphere was inviting, the restrooms were atrocious. I was pretty shocked considering the dining experience to find the bathrooms somewhat trashed and unkept which worried me a little.\n\nOverall I still give Tamba 4/5, but please folks, take care of those frightening bathrooms and you'd easily be a 5."
        }, 
        {
            "index": 149, 
            "rating": 5, 
            "review": "Went there for a dinner buffet with friends and it was delicious. Variety of Indian food and the dessert is outstanding (must try the mango custard)."
        }, 
        {
            "index": 150, 
            "rating": 5, 
            "review": "Ok so I havn't yelped in a while, but this place is just that good and should be way more busy for how good the food is. Do people who go to vegas not like indian food? Seriously, if you get tired if crappy overpriced food on the strip try here.  I have eaten at the best inian places in sf(amber, indian oven, etc) and tamba is right up there with them - in Vegas!  My goodness, what a pleasant surprise. I just pounded the butter chicken, the chicken was like tender like duck confit and the sauce was perfect flavor and not too creamy. The rice is fluffy and my nan was perfect for dipping. I am stuffed, will be back for more!"
        }, 
        {
            "index": 151, 
            "rating": 5, 
            "review": "If you love Butter Chicken, Mango Lassi, and Rice Pudding, this right here is the place to be. \n\nHidden off to the side of the strip, this little gem is a quiet place with excellent service. The Samosas were tasty, and the overall portion size was very good. By the time we made it to dessert, I had to at least try the Rice Pudding. And it was fabulous. \n\nNot to mention I was the only white person among tons of Indians, so you know it's legit. \n\n\n*The word Indian in reference to people from India, not the other word that magically angers social justice warriors*"
        }, 
        {
            "index": 152, 
            "rating": 5, 
            "review": "Found this gem of an Indian restaurant through Yelp while on business in Vegas. This place serves FANTASTIC food and appears to be a locals hangout, not a tourist trap. \n\nI seriously doubt there is better Indian food in Vegas."
        }, 
        {
            "index": 153, 
            "rating": 5, 
            "review": "I've been in this place for a couple times already ,so I decided to bring my mom for a dinner. She loves it ,so I'm . It's just amazing !! Nice warm atmosphere and delicious food. Won't regret"
        }, 
        {
            "index": 154, 
            "rating": 5, 
            "review": "We had such a delicious dinner experience that we came back for lunch. Tamba is located a few steps off the strip and up one flight of stairs. It looked empty or closed but once we walked in we were pleasantly surprised to see a very nice restaurant full of customers. We love Indian food and this restaurant is clean, has nice service,  great food and reasonable prices--especially for Las Vegas.   We will be back for sure."
        }, 
        {
            "index": 155, 
            "rating": 2, 
            "review": "I use to go at this restaurant. But on my last visti, I saw customer bring their used plate or bowl to get food and the employees never say any thing to customers that this is not right. Spechala got tuch their dirty plats or bowl and same Spechala every one elsa use it, Not right. I will never go here again. Taste of food is not same any more."
        }, 
        {
            "index": 156, 
            "rating": 3, 
            "review": "A tiny Indian Resturant tucked away on the strip. Getting parking sucks if you are trying to drive there, I had to park in public park for $5. This place is in a hole twin the wall. It's hidden inside a tiny mall that's mostly vacant; a bit eerie at night. \n\nThe service here is actually pretty good in comparison to other Indian restaurants around town but for a place on the strip it's actually average at best. I used the yelp check to get the 10% off. The server knew immediately when I raised my phone so it's nice the staff is competent and very friendly. \n\nThe quality of food in comparison to other Indian places around town is a bit sub standard. Especially with respect towards price. They have a nice variety from North to South Indian dishes. Your standard tikka masala meal is there as well as a butter chicken dish aka chicken makkni. \n\nThe naan is very good especially when fresh from the plain to the garlic you can't really go wrong.\n\nThis is a three star review because of poor parking accessibility and quality of food. If the staff wasn't so great this would have been a 1 star. All in all average food with above average staff is a 3 star."
        }, 
        {
            "index": 157, 
            "rating": 5, 
            "review": "Me and my husband came twice to this restaurant and we pretty much ate their entire menu! This place is lovely, the food is amazing, the service was friendly and generous, I felt I was in India again with the good vibes! I truly recommend you to visit and to come hungry for spicy dishes and sweet desert! I recommend the palak panir dish and the yellow dal with yellow rise and Roti."
        }, 
        {
            "index": 158, 
            "rating": 4, 
            "review": "Best buffet i have had in US and have has it in all places NY, SFO , Chicago etc but this was the best so far..... Deasset options can be bit better though"
        }, 
        {
            "index": 159, 
            "rating": 5, 
            "review": "Delicious Indian food with great service and good ambiance. On the strip too!! Samosa chaat was good. We also had aloo gobi and paneer tikka masala. Will visit again next time we're in Vegas"
        }, 
        {
            "index": 160, 
            "rating": 5, 
            "review": "Best Indian buffet I've had in my life and I'm not exaggerating.  The dishes that should be spicy were actually spicey.  Very affordable and although the building looks a little rundown on the outside, it's nice and clean on the inside.  The hostess was friendly, too.  Only thing that could've been better was the naan.  It wasn't crispy at all, but what do you expect unless it's made to order?"
        }, 
        {
            "index": 161, 
            "rating": 4, 
            "review": "I love the lunch buffet at this place!  The food is great! The chicken makhani is just awesome. Everytime I eat here, I get up to get food from the buffet around 3 times or so. \n\nThe place looks nice also. Can't wait to go back next time I'm in Vegas!"
        }, 
        {
            "index": 162, 
            "rating": 5, 
            "review": "Excellent food here, had lamb chops and butter chicken, very friendly waiters.  The place is very clean you get a whole lot to eat, at a good price. This is my second time eating here and I will most definitely be back when I'm in Vegas.  Our waiter was Kumar and he was great."
        }, 
        {
            "index": 163, 
            "rating": 3, 
            "review": "We found this place one day when we were walking along the strip and I was not feeling well.  I have hypoglycemia and had not eaten in several hours.  We had been wondering around the Hawian Marketplace and I was feeling so bad I was not sure what I was doing.  We went in the building which sadly is deserted on the first floor and one of the employees directed us upstairs.  He could see I was ill and got the manager who immediately got us a table.  Once I had been seated and started getting back to normal we ordered.  I had the butter chicken which was amazing and my BF had the curried Goat.  Our waiter was shocked he asked for the goat and had to make sure they still had some but came back smiling and letting us know it was still available.  He said it was fantastic.  Our waiter was attentive and kept a positive attitude even though and indian couple behind us ordered several things and kept sending them back unhappy he never lost patience with anyone.   It was a great meal and we would go back.  At the time one of the half price outlets had coupons to reduce the price.  We also ate here on Christmas day for the lunch buffet and while it was good none of the entrees were marked and even a few indian customers questioned what the dishes were.  I was not nearly as impressed with the buffet."
        }, 
        {
            "index": 164, 
            "rating": 2, 
            "review": "Went herewith my friends and had the lunch buffet. Very limited choices. Only chicken and vegetarian. Naan was crispy...not much more to say."
        }, 
        {
            "index": 165, 
            "rating": 5, 
            "review": "From a foodie - Wonderful food and lovely ambiance. Decor is pleasing to the eye and unlike most Indian restaurants - that's a plus"
        }, 
        {
            "index": 166, 
            "rating": 5, 
            "review": "The best Indian food I've tried so far.  And I've tried a lot, in many different places all over the World.  They use a tandoor oven, so you can find some healthy dishes that taste really great.  Their vegetable dishes are incredible as well!  I love their buffet too, because you can try all the different dishes and figure out what it is that you like.  Everything is labeled so you know what you are getting.  The atmosphere is nice, and the service is great.  Oh, their food is so good...I think I will go there now!"
        }, 
        {
            "index": 167, 
            "rating": 4, 
            "review": "For Vegas this is definitely awesome! I went here for Dinner and was very pleasantly surprised with the dishes. I have eaten a lot of really good Indian food and this wasn't going down as the best, but come on, it's Vegas. If this was a restaurant in NYC it would get about 3 stars, but in Vegas it gets 4. The naan was ok, same goes for the raita. The dishes though were very tasty and spicy. The location is really odd, it's in the back of a crappy food court, but it is really nice inside. The prices were awesome for Vegas, and I'll definitely frequent it when I visit."
        }, 
        {
            "index": 168, 
            "rating": 3, 
            "review": "Pros:\n1) Good food. \n2) Great Naan. \n3) Not too spicy or oily. \n4) Great location. \n\nCon\n1) Bathroom is small, dark and dirty. Not enough lighting and paper rolls lying all over the floor. \n2) A $18 buffet should have more variety."
        }, 
        {
            "index": 169, 
            "rating": 4, 
            "review": "I was a bit hesitant from the looks outside and that there was not a lot of patrons inside so I passed, but came back the night after. Come to find out, the patrons are mostly Indian (good sign), the food was delicious, I had the fish masala (spicy) with rice, onion naan, plus tamarind/mint chutney, everything was great, service was more 'human' than other restaurants on the strip, prices were not bad."
        }, 
        {
            "index": 170, 
            "rating": 5, 
            "review": "This is a hidden gem on the Las Vegas strip. It's not in a casino. You can't see it from the strip. It's tucked away behind the Hawaiian Marketplace. And it is totally worth the journey to get there. \n\nI think one way to judge quality and authenticity of a restaurant is by the clientele. There were many people of Indian descent here, and that made us even more excited for our feast!\n\nAnd what a feast it was!  I had Ashoka's feast which included and appetizer and then four small dishes and rice. It also included naan... And this was the first time I had ever been to an Indian restaurant where i did not have to order more naan. They served plenty. \n\nThe lamb roganjosh was prepared with a perfect blend of spices. The chicken masala also prepared just to taste. Everything was very flavorful and though try described it as spicey, nothing was too spicey.  This meal also included a donuthole dessert with a sweet caramel sauce. \n\nThey were able to accommodate our large party (15) on relatively short notice for a Saturday night. \n\nIf you're in the mood for Indian food while on the strip, check out Tamba!\n\nThe staff was extraordinarily attentive and professional."
        }, 
        {
            "index": 171, 
            "rating": 3, 
            "review": "Good Indian is very hard to come by in Phoenix, so I was looking forward to Tamba. The meal and company were both enjoyable. Prices were very reasonable. The meal came out to $55 with wine!\n\nWine: Bonny Doon Riesling. Something about a sweet white wine pairs nicely with spicy, rich Indian food. This retails for $11 and paid $26 at the restaurant. Not too bad of a mark-up I guess. \n\nEntrees: Tandoori chicken--yum yum. Very generous portion. \nPrawn Makhni--rich buttery cream sauce. On the spicy side. \nChicken Tikka Masala -- another rich flavorful curry. \n3 dishes with rice and garlic nan--the 3 of us were completely stuffed."
        }, 
        {
            "index": 172, 
            "rating": 3, 
            "review": "Would I go back? Yes.\n\nOn the Strip, this place is a gift from Guru Nanak. \n\nIf picked up and dropped anywhere else in the world? It's pretty good.\n\nNorth Indian type food here is nothing inspiring, but satisfying. We had the buffet and my vegetarian man was happy. \n\nI was happy with the food--decent naan, mint chutney, tandoori chicken -- the usual stuff I get. The best part was being off the Strip and away from the \"Hey Bro!\" douchebags. It was clean and quiet. This is hard to find on the Strip and a I relished the calm."
        }, 
        {
            "index": 173, 
            "rating": 3, 
            "review": "Too pricey. Ambience is great. Food is just fine. 2 stars down for the price and taste."
        }, 
        {
            "index": 174, 
            "rating": 5, 
            "review": "Great food!!\nReally like the ambience and food.\nSambar was excellent.\nMust try indian food if you are on strip!!"
        }, 
        {
            "index": 175, 
            "rating": 4, 
            "review": "Every time I've been to Vegas I have been wanting to try out this restaurant. So this past weekend when I was in Vegas I dragged my partner there. He had the tikka masala and I had the chicken tandoori, sharing  basmati rice and naan bread. My meal was utter perfection. The service was adequate, we were not in any sort of hurry. My only complaint is that I wished the buffet option was available for dinner. I will definitely go there the next time I am in Vegas."
        }, 
        {
            "index": 176, 
            "rating": 3, 
            "review": "I think where the rating is right now at 3 1/2 is probably right. I also agree with a lot of other yelpers about getting the best indian buffet for your money. First, I dont expect to be amazed by a buffet, and second, i definitely dont expect to be amazed by a buffet that is so cheap (compared to other buffets on the strip). You get a good variety of indian food (mostly vegetarian) and its around $13. What is the funniest thing about this place is where it is located. It is inside a, what seems to be an abandoned food court type building, and is the only that has been running ever since I first came here 4 years ago. Seriously, I have never seen any other store in this food court open. \nI think if you dont mind eating a little unhealthy indian food that tastes decent you should check this place out. I have had their fresh food here once, and honestly this is one place where their fresh food tastes slightly better than their buffet. Usually, the restaurant's fresh food tastes way better than their buffet, but I guess their food quality doesnt change much between ordering off the menu or the buffet."
        }, 
        {
            "index": 177, 
            "rating": 5, 
            "review": "I have eaten at a number of Indian restaurants over the years and so glad to have found this one. Had a wonderful dinner and superb service. The waiter was very professional with great suggestions when asked. I had the fiery spicy lamb dish that was excellent. Nice decor and atmosphere. Reasonably priced, wonderful tastes, and a great value. If you enjoy authentic Indian food you must make take the time to indulge yourself. Thank you TAMBA for keeping it real!"
        }, 
        {
            "index": 178, 
            "rating": 1, 
            "review": "Oh Yelpers, how you have failed me!  \n\nMy boyfriend and I found Tamba's advertisement in one of Vegas's books during our visit, and decided to go here for dinner after reading the \"good reviews\" and ratings on yelp.  After finally having eaten there,  I would give this place HALF a star if I could, for its bad food and terrible service!\n\nI live in Silicon Valley---a mecca of Indian restaurants and cafes-- and eat Indian food at least once a week. (It's my latest addiction).  I know good curry when I taste it, and let me tell you now before you waste your time and money: you will not find good curry here.\n\nWe went for the \"dinner buffet\" which, it turns out, \"was reserved for private parties only.\" So we ended up ordering the butter chicken and a lamb curry with some naan off of the menu.  But the waiter brought out what he called \"chicken tikka masala\", and when we told him it wasn't what we ordered, he then said he misspoke and it was actually \"butter chicken\" after all.\n\nEither way, it tasted like water.  No flavor whatsoever.  The lamb curry on the other hand... was a SPOONFUL of SALT with every bite.  YUCK!\n\nI've never abandoned an Indian meal in my life, no matter how mediocre.  But I could not get myself past even half this meal.  Maybe the bland curry juxtaposed to the salty one made it seem even saltier, or, \"Maybe,\" I thought, \"if i mix the two curries together, I would find a happy medium.\"  How wrong I was! There was no happiness to be found there. :(\n\nTo top it off, when our bill came, we were charged $15 for the \"chicken tikka masala\" instead of butter chicken, and told our server about the mistake.  He said, \"It doesn't matter anyway, they're the same price.\"  Indeed not!  I corrected him and said that the butter chicken is $14.  So he responded, \"Fine, I'll just COMP you the difference.\"\n\n\"COMP\"? \"COMP\"??? Are you kidding me?!  You're not comping us anything!  We're just asking you to charge us for what we ACTUALLY ORDERED!  Don't think you're doing us any favors!\n\nFinally, just to add insult to injury, they advertised 10% off the bill if you showed them the ad from the Vegas 24/7 booklet.  But when we gave him the \"coupon\", INSTEAD of taking 10% OFF, he ADDED 18% to our bill for gratuity!\n\nHA! Unbelievable.  I guess, in Vegas,  you don't have to go to the casinos to lose your money!"
        }, 
        {
            "index": 179, 
            "rating": 1, 
            "review": "Doesn't get worst than this- bland Indian dinner buffet. Ok customer service. Pretty expensive for the quality of buffet- but that is probably because it is Vegas."
        }, 
        {
            "index": 180, 
            "rating": 5, 
            "review": "This place was a godsend for a hungry vegan. I had the lunch buffet and was delighted. \n\nHighly recommend to any vegan visiting the strip and looking for a real meal."
        }, 
        {
            "index": 181, 
            "rating": 1, 
            "review": "Shitty food.. They don't know how to cook simple Indian food.. We ordered salad which was stale..  They have no ideas what Malai Kofta should taste.. Will never go back again..!!!"
        }, 
        {
            "index": 182, 
            "rating": 3, 
            "review": "Mixed experience, first time I happened to get Buffet which was amazing and good price for money. But in my recent visit the buffet was not available and we chose their recommended platters ( Buddha's and Ashoka's ), except for the starters rest of the food item were not upto the mark and the portions were very less too. $60 Dinner for two, I was expecting much better experience. \nWill ensure the buffet next time by calling them before visiting."
        }, 
        {
            "index": 183, 
            "rating": 5, 
            "review": "Visiting from Silicon Valley for CES, pre events.. Authentic North & South Indian food, highly recommend to all. Good food and great service. Special thanks to server Sha."
        }, 
        {
            "index": 184, 
            "rating": 1, 
            "review": "2nd time here...first time we ordered ala carte dishes at night and it was over priced and quality was not up to par.\n\n2nd time, had the lunch buffet and it was absolutely the worst indian buffet I've had in my life.  Everyone in my party (6 of us) felt the same way.  \n\nWill never go there again."
        }, 
        {
            "index": 185, 
            "rating": 5, 
            "review": "Really good food, worth the money. Veg menu had a lot of options and quality wasn't compromised"
        }, 
        {
            "index": 186, 
            "rating": 4, 
            "review": "We had a fairly late dinner there and suprisingly found very authentic Indian food - you can really taste the difference in the spices.  Friendly, efficient service.  I vow to try the buffet next time we are back in Vegas."
        }, 
        {
            "index": 187, 
            "rating": 5, 
            "review": "I just accidentally discovered this place and had the best and most reasonably priced meal of our trip.  It was perfectly spiced, with the heat not overwhelming the flavor of the food.  The service was warm and welcoming.  I never write reviews unless I am really impressed, and we were definitely impressed."
        }, 
        {
            "index": 188, 
            "rating": 3, 
            "review": "I enjoyed the lunch buffet, famished after a flight. Pretty tasty, but leaning to the spicy side. A couple of chicken dishes including a nice tikka masala and good tandoori. No lamb, goat, or tofu. No beverages other than water were offered. I like the one I frequent in Laurel MD a lot better."
        }, 
        {
            "index": 189, 
            "rating": 5, 
            "review": "Sooo good. Amazing naan and the malia kofta was brilliant! Nice atmosphere and friendly staff."
        }, 
        {
            "index": 190, 
            "rating": 3, 
            "review": "I know it looks like you are going into a deserted building on the Strip but there really is a restaurant up the escalator! Hubby & I really enjoyed the food. That said, there were problems too. Our server asked us for a spice level and we said mild and one dish came out quite spicy. We were just too hungry to send it back. We enjoyed it despite being too hot for us wimps. The service was lacking, to put it mildly. Our server was friendly enough but after being seated it took a solid 10 minutes before anybody approached our table and 20 to order. And during the course of the meal, more attention from the server would have been nice. If I had a do-over, I would have gone for the lunch buffet which sounds like a better idea."
        }, 
        {
            "index": 191, 
            "rating": 1, 
            "review": "Bought a tix4tonight coupon to this place, sight unseen.  Got there and it is hidden in a large building with a bunch of empty shops. We were seated quickly and then ignored.  After 15 min we walked out and no one said anything.  Place smelled good. Won't go back."
        }, 
        {
            "index": 192, 
            "rating": 1, 
            "review": "Oily food! Tasteless for Indian palate! Poor directions when we called. No restaurant parking - $5 public parking! All-in-all - not worth it!!"
        }, 
        {
            "index": 193, 
            "rating": 5, 
            "review": "Amazing food ! Went twice over one weekend for lunch buffet. Highly recommended for indian food lovers."
        }, 
        {
            "index": 194, 
            "rating": 4, 
            "review": "BEST LUNCH IN TOWN...\n\nFresh food, well cooked curries and melting appetizers, the place is perfect blend of ambience and awesome food....\n\nHave visited it many times and still looking forward to more visits......"
        }, 
        {
            "index": 195, 
            "rating": 4, 
            "review": "Lunch buffet for $15 including tax. Came at 2PM and all but 3 of the customers were Indian, so I assumed there was a reason. Had some REALLY good tandoori chicken -- tons of flavor and very moist. Lots of veggie options and 3 meat dishes (all chicken). I'd give one more star if they had a goat or lamb dish, just to broaden the choices."
        }, 
        {
            "index": 196, 
            "rating": 4, 
            "review": "excellent food!\n\njust check to make sure they are still serving your favorite things. I  was very disappointed that they didn't have the two items that were the sole reasons I came back to this place and brought a friend : Papad and Gajar Halva    :(\nthe food is still very good so I would rate it high, it's my fault I didn't check to see if they still had my favorite items.\n\nalso if you get to the marketplace after 7:00 you won't have to pay 5$ and call to make sure that they will actually open at 6:00 because today they opened later, 6:30ish, still food worth waiting for but...........may have been able to save money on parking and just gone later."
        }, 
        {
            "index": 197, 
            "rating": 1, 
            "review": "Walked in July 3 for diiner, asked if we were going to order off the menu or from the buffet.  Decided on the buffet, and was told that we would have to pay before being seated. Was told the buffet was $40 dollars for two people. Gave the front desk a $100 bill. \n\nTamba Cashier: Do you have anything smaller? \nMe: No, I don't. (I wanted to get the change) \nTC: We can't break this bill. \nMe: So, how will I get my change back? \nTC: Well, we don't have anything else, because everybody else has been paying with $100 bills. \n\nAt this point, I was going to argue with the cashier, talk to the manager, or suggest that they go to one of the other restaurants nearby to break a few hundreds to manageable change for their register, but my date pulled out her wallet and paid the bill. \n\nDuring the meal, asked for a Coke and a lassi, which added another $5.39 to the total bill. Turns out that drinks aren't included in a $20/person buffet. What?  (But water is free, so don't think you can't get a bargain out of Las Vegas.) If the Coke is coming out from a fountain station, is it normal to ask the diner, \"Do you want ice in that?\" \n\nLeaving the restaurant, had the bill for the drinks with me and $6 ready to pay. \n\nMe: Hey, we also got drinks. I'd like to pay up. (Hands the bill and money over.) \nTC: Sir, we don't have any change available and can't give you your $.61 back ... (while holding $1 to give back to me) \nMe: You know what, just keep it. Peace out. \n\nThe food review: We wish that there were tags describing what we were eating. Wanting to try something new, we had passed by Tamba before while walking the Strip, just because we didn't know it was at the Hawaiian Marketplace. Her being vegetarian, Indian food was a good choice since meat isn't so prevalent in the diet.  She says that the food was spicier than what she was prepared for, but there was a nice variety.  As someone who will eat everything, it was a pleasant meal and flavorful.\n\nI understand the need to economize during this economy, but plastic plates for the buffet and plastic cups for water?  And the containers for sauces are little styrofoam bowls?  What an ecological disaster.  For the Coke and lassi, we were given glass tumblers, which was good, I guess.\n\nMy final assessment is that the food was good, but the experience was bad bad bad."
        }, 
        {
            "index": 198, 
            "rating": 4, 
            "review": "Aloo Gohbi and Paneer Tikka Masala are particularly good. Nice ambience. Short walk from MGM Grand and other hotels.\n\nThe service was also great. They made adjustments to their menu upon request."
        }, 
        {
            "index": 199, 
            "rating": 5, 
            "review": "They had great vegan and vegetarian options. They were extremely friendly and even helped us go through the buffet line and tell us which was vegan amd vegetarian. It's on the strip so it's perfect to just walk there from an hotel."
        }, 
        {
            "index": 200, 
            "rating": 1, 
            "review": "Food is ok.. limited variety... insanely expensive... i arrived at Vegas and was searching for good restaurants...my friend who resides there did mention that this is an overly hyped place because of its prime location. \ni ignored that and did go there ...\n\nThere was some good side dish like raita, aloo gobi.. but i did not know with which main course should i have it along with... \n\nDo they expect me to have rice and sambar with aloo gobi as palya!!!!! and all this after paying 20 bucks!!!! .. \n\nThanks giving dinner, and no fried rice or biryani in the buffet spread... naan was ok... \n\nFor the price i paid i could have gone else where.. and be satisfied..\n\nClosing Comments : go here if you earned too much from gambling and do not know what to do with all that money ..."
        }, 
        {
            "index": 201, 
            "rating": 5, 
            "review": "Tamba offers a lunch buffet on the weekends that is quite satisfying.  Plenty of choice, including salad-y stuff, entrees, desserts, and plenty to satisfy either vegetarians or meat-eaters in your party.  It was all very good, especially the vegetable curry I tried.  The staff is helpful, the dining room is nice.  The only thing that would have improved the experience for me would be 1. being hungrier and 2. labels on the buffet choices (the staff were happy to answer our questions about any of the food, however).\n\n#2 is a perennial complaint I have with Indian buffets... I like Indian food immensely and would like to learn more about it so I can remember what I especially like.  But all of the Indian places I frequent are label-less, so except for stuff that's easy to identify like curry, I am left describing things as \"that green goopy thing\" and \"that orange goopy thing\" and \"that other thing with the lamb\"."
        }, 
        {
            "index": 202, 
            "rating": 5, 
            "review": "Arrived for lunch buffet.  Very well decored, dim, cool, chill vibe..\n\nDelicious food. Variety of Indian cusine.\n\n$15"
        }, 
        {
            "index": 203, 
            "rating": 5, 
            "review": "This was my Indian food de-flowering experience (so I don't really have a lot to compare it to). I had always been hesitant to try it because the curry smelled so strong and that line from Anchorman always made me cringe (\"It smells like a baby's diaper full of Indian food\")....WAS I A RA-TARD!\n\nMy friends invited my man and I to a birthday gathering for a co-worker and were raving about this place. The owners have come to visit us at my work on several occasions so I thought I could at least go and see what it was all about. I knew it was going to be good because it was the only business left in the building (its located inside the Hawaiian Marketplace building by Polo Towers) and there were a ton of Indian people there (always a good sign).Alex was our server. He was very friendly and we left our dinner in his hands....what a smart decision. He brought out an AMAZING prix fixe menu I think of his own creation (nice touch). Now I will do my best to at least describe my favorites:\n\n1) Little fried dough balls with peas and potatoes inside...served with a mint cilantro and some sort of sweet/spicy glaze (tandoori sauce?)\n2) Chicken tandoori....great flavor. Sweet/spicy and BBQ'd to perfection\n3) Lollipop lamb chops with some sort of glaze with a kick (great with the mint cilantro and sweet/spicy sauce mixed together).\n4) Chicken Tikka Masala....HOLY COW! You must get this dish. The curry is mild, its creamy and a little bit of heaven in a dish. \n5) Garlic nan....garlic flat bread which was perfect for dipping in the Chicken Tikka Masala.\n\nI was so happy when we left. My man and I actually went back the following evening because I was craving it again. Just as good the second time and we actually got Alex as our server again...he remembered us from the night before (another nice touch). Will be back again soon."
        }, 
        {
            "index": 204, 
            "rating": 5, 
            "review": "I echo some of the other reviewers by saying that this is my favorite Indian restaurant in Vegas. I don't usually like to go to the strip to eat, unless it's a special occasion, but Tamba is worth it. It is very upscale in decor, yet has good ethnic flavor to it as well. Waiters are attentive, but not overly so (which I hate).\n\nThe buffet choices are excellent and all food is fresh and warm and tasty! \n\nThe only drawback...it is closed for a couple of hours before dinner time (I belive 5:30PM or so?) I like my dinner early sometimes, and it was a bid of a disappintement.\n\nOverall, recommended. Very clean place."
        }, 
        {
            "index": 205, 
            "rating": 4, 
            "review": "Delicious lunch buffet! As a vegetarian, I would have liked some labels indicating what was meat or vegi; if you're not familiar with some dishes, it can be hard to tell. Otherwise, top notch. Clean and nicely decorated. Good service."
        }, 
        {
            "index": 206, 
            "rating": 4, 
            "review": "One thing we were determined to win at, was having a great indian dinner on the las vegas blvd after realizing that everything else out there was only \"by-chance/luck\".. With a palate limited to the vegetarian options, we hoped that their popular dishes -  Biryani and Bhindi masala, were worth the reviews.. Surprisingly, they were of the finest quality and taste. We couldn't have had a more enjoyable and ful\"filling\" dinner.. A lil too conservative approach resulted in the lunch buffet next day.. Hmm.. We quickly realized that Tamba proved to be merely just another indian buffet place for lunch..\n\nDefinite stop-by for an exquisite indian dinner.. Visit them for lunch if you must have indian lunch buffet..\n\nThe review is completely based off of the vegetarian dishes.. Not sure how they fare at the non-vegetarian menu.."
        }, 
        {
            "index": 207, 
            "rating": 2, 
            "review": "Call before you go for dinner to see if they actually serving \"dinner\". I arrived for dinner to be told that it was only a buffet. The wait staff was unsure 'when' or 'if' it will ever return to a regular menu for dinner. The buffet table was too short for the number of people seated in the restaurant. The line was almost out the front door to get food. As for the food- mediocre. Food seems to lose its quality when plopped into a gallon pan. The nan bread was dry and some of it was burnt. Hopefully the food would be much better served as a dinner."
        }, 
        {
            "index": 208, 
            "rating": 5, 
            "review": "At the heart of Las Vegas, excellent buffet for $20. A must visit for Desis"
        }, 
        {
            "index": 209, 
            "rating": 4, 
            "review": "Great food must go good for family malai kofta butter chicken is good buffet looks good too cool place in front of Aria just 10 mins walk from bellagio"
        }, 
        {
            "index": 210, 
            "rating": 5, 
            "review": "I have been here many times and every time  it has been a pleasant experience. This time I thought of leaving a review b'coz their service was exceptionally good. They were very courteous and quick and they even accommodated our dog in the outside patio. Food has been consistently good as always! We'd ordered Budha's feast and Ashoka's feast and they were very flavorful. Overall this place is great and highly recommended!"
        }, 
        {
            "index": 211, 
            "rating": 4, 
            "review": "Aside from the feeling that you are entering a deserted mini mall when you go to Tamba, this place is pretty good.  I am in Vegas quite a bit for work and my coworkers and I are always searching for dinner options that don't require you to win big before you can eat.  Thanks to Open Table, we found this hidden little gem.\n\nThe feeling of the restaurant is pretty generic.  The website gives the impression that you will be walking into a luxurious setting complete with red velvet cushions and dramatic draperies.  Um, not so much, but we clearly weren't looking for trendy so no big deal.\n\nWe had booked a party of 6, which ended up being a party of four.  The host was nice about it, but, unfortunately the restaurant doesn't have too many options for 4-tops so we ended up sitting at a table for six.  I guess they get a lot of large groups?\n\nI started with a manhattan.  When it came out a dark red, I was a little concerned that it wasn't made correctly, but after tasting, it was just right.  I had the butter chicken, which was rich and delicious, but not too heavy.  My friends didn't really know what they wanted so the server just brought out a few different dishes to share.  One of my friends had a spicy chicken dish that was fantastic.  In hindsight, I wish we would have asked what they were.\n\nAll in all, it was a great meal, friendly service, and we were all able to get out of there for around $20 per person.  Woo hoo!"
        }, 
        {
            "index": 212, 
            "rating": 4, 
            "review": "This place is heaven for Indian cuisine lovers.\n1. Nice variety in buffet for both vegetarians and non vegetarians.\n2. Flavorful meal\n3. Variety in deserts as well"
        }, 
        {
            "index": 213, 
            "rating": 5, 
            "review": "I agree with Judd below. This buffet is only second to India House in Chicago. It is simply awesome. The spread is so huge!!! There is so much variety. Food was very tasty in general. I will go here every time I go to vegas."
        }, 
        {
            "index": 214, 
            "rating": 5, 
            "review": "Tamba is the best Indian food in Las Vegas.\nWeird location, but who cares. The food is tasty!\nGo at lunch time for the buffet to try a variety of different foods.\nTake my word for it, this place is good and I'm Indian."
        }, 
        {
            "index": 215, 
            "rating": 5, 
            "review": "Love this place! So cute, so modern! Food portions are huge!!! Can't wait to go back! Butter chicken is delicious!!"
        }, 
        {
            "index": 216, 
            "rating": 5, 
            "review": "Extremely Awesome and tasty vegetarian food. We ate everything up. Loved it. Service was fast, price is quite reasonable"
        }, 
        {
            "index": 217, 
            "rating": 2, 
            "review": "Vegas has mediocre indian food. Butter chicken and tikka masala were both watery and spiced weirder than most tikka masalas ive had. I cant stress this enough- dont go to vegas to get indian food"
        }, 
        {
            "index": 218, 
            "rating": 5, 
            "review": "We enjoyed the food.  Service was great.  We have Mixed Vegetable, Vegetable Korma, Dal Tarka and Butter Chicken.\n\nButter Chicken was horrible.  Everything Else was great.  Service was excellent, friendly with a smiley face."
        }, 
        {
            "index": 219, 
            "rating": 5, 
            "review": "Food is delicious and Kumar is a gem to have as your server. So chirpy n cheerful. Tamba is a must visit every time traveling to Vegas. Conveniently  located on the strip and flexible hours. Must recommend the lamb chops and chicken tikka masala. Oh and yelp users get 10% off."
        }, 
        {
            "index": 220, 
            "rating": 4, 
            "review": "My hunny and I always make sure to eat here on get away day. Good buffet and nice clean restaurant. In five years we haven't missed a visit here yet on our annual Vegas trip :0)"
        }, 
        {
            "index": 221, 
            "rating": 5, 
            "review": "We love this restaurant! We have been going for years. The food is delicious! Samosa chaat Is to die for! The staff is wonderful & extremely gracious!"
        }, 
        {
            "index": 222, 
            "rating": 4, 
            "review": "Great Buffet, Okay service and Not so friendly Manager!!\n\nWe were staying at Monte Carlo and this was the closest Indian Restaurant. The reviews were crap but we decided to check it out anyway. The manager was bit rude coz he asked for 15$ at front without even asking. But when we tasted the food, all was forgotten. There was huge variety of dishes for for Veg and non-Veg. Everything was spiced perfectly and tasted fresh. Here what was on menu:\n-Idli (soft), Sambhar\n-Chutneys (Delicious)\n-Upama ( Best I have had so far)\n-Zucchini curry\n-Kadhi Pakoda ( oh so yumm!)\n-Yellow dal tadka\n-Cumin Rice\n-Navratan Korma ( good flavors)\n- Shahi Paneer (Okay)\n-Pakoris (Crispy)\n- Chiken tikka\n- shahi Chicken curry\n-Lamb curry\n-Chicken biryani\n-Sooji Halwa\n- Kheer\n \nThe server took a very long time to bring the water and clear the plates but food was delicious and we ended up having alot to eat. We again went there for buffet the next day and weren't disappointed in food.\n\nWe didn't try ala-carte so wouldn't say anything. But I will recommend trying their buffet!"
        }, 
        {
            "index": 223, 
            "rating": 3, 
            "review": "I was relaly looking forward to this place but was disappointed upon arrival to find out that they are only serving a buffet. The spice level on the buffet was low. I did enjoy the variety of food but would have preferred to have ordered off the menu."
        }, 
        {
            "index": 224, 
            "rating": 5, 
            "review": "Got there right at 11am opening on a week day for the buffet. Some the most fragrant and delicious Indian food I have ever had. Very authentic, polite and attentetive staff, nice cozy environment. Insanely reasonable for all you can eat for two..came out to be under $30 with the 10% check in discount. This place is a gem. Sweet rice and mini samosas are amazing, they bring fresh naan to your table even when you eat at the buffet. We will absolutely return next we're in Vegas!"
        }, 
        {
            "index": 225, 
            "rating": 4, 
            "review": "Great Indian Food at the Strip. We went for dinner and they had buffet. Veg and Non-Veg items, all were good. and even the dessert was great.\nThe only downside is they do not serve Naan on the table unlike other restaurants. It is kept in bulk alongwith all other food items, hence they get hard and chewy."
        }, 
        {
            "index": 226, 
            "rating": 4, 
            "review": "Tucked away on the strip in the Hawaiian Marketplace area, this is a hidden gem.  So I'll admit it was my first time having Indian food.  Luckily I was meeting friends who had some knowledge about it and helped me out on what to have.  We went 'family style' so we were able to taste a little bit of everything we ordered.  \n\nFirst I want to say the service and staff here were amazing.  My water glass never went less than half full.  Kudos! Our waiter was very helpful also in helping us decide what to get.  I would say he went above and beyond! \n\nTo start off, we tried the Vegetable Samosa's and Vegetable Pakora's.  The Samosa's reminded me of an empanada except stuffed with potato and peas.  Accompanied with the sauces, these were great! The Pakora's were good also but a little too much breading.  For the main course, we went with the Chicken Tikka Masala.  The tomato curry sauce over the chicken was good! I scooped this over the basmati rice and was very pleased.   As for the chicken and rice dishes, there was plenty to be shared between 3 people and couldn't imagine eating this all myself. We even had much leftover! The garlic naan came out warm, flavorful and perfect.  \n\nOverall I was delighted for this to be my first Indian food experience."
        }, 
        {
            "index": 227, 
            "rating": 5, 
            "review": "It was full of Indian customers, which we took as a good sign. And it was! We had the chicken korma and saag paneer - the food was delicious. They have good Naan, too. It's authentic, a nice alternative to the artificial hotel restaurants on the strip!"
        }, 
        {
            "index": 228, 
            "rating": 2, 
            "review": "This was my 3rd time here. I was pretty disappointed with the food this time. Maybe it was due to off-season, but thats not a reason to make bad food. Chicken biryani tasted like Pulao. Rice were un-cooked and appetizers are not that great as well."
        }, 
        {
            "index": 229, 
            "rating": 1, 
            "review": "For all the vegetarian people out there me and some of my friend went there. And among them two were vegetarian. And with the veg biryani they found chicken. And when we tell them the waiter didn't' even said sorry he did changed the plate with no sorry and attitude. And when we said that you should have said sorry he said he did. And also said \"I asked chef and he said there's no way it should have happened\" as if we did it. And then we put a review about It on yelp he commented that we did this to make fun with our vegetarian friend. Please maybe stupid people like you find this funny we don't. And please check your cctv before you accuse someone. Next time if you don't accuse someone with out hard proof you stupid fool. And FYI no one is paying us for this review. It's an honest review for good people who are going to treated bad in the future by you."
        }, 
        {
            "index": 230, 
            "rating": 4, 
            "review": "Good buffet at a decent price. If you're staying in Vegas for a few days and craving Indian food, this is a great place. The location is really convenient and the food is great for the price. Their dinner is really good as well. You can sometimes get a 20-30% discount coupon at one of those tix4tonight stands. Service is good as well. The buffet has lots of vegetarian and vegan options, which is nice. Highly recommended."
        }, 
        {
            "index": 231, 
            "rating": 5, 
            "review": "Everything about this place is excellent. I happen to love indian food, I eat it all the time and this is some of the best I have ever had... I had the chicken Korma and it was superb! Pricing was spot on for the quality, actually I would have gladly paid more! I gave the friendly waiter a nice tip instead :)\n\nThe environment was also quiet, modern, clean, and welcoming with nice soft lighting and interesting art work that really sets the mood. It is a great retreat from the hustle and bustle of the strip. The service was also excellent, the staff were friendly and attentive and always had smiles on their faces. The food also came very quickly. I also have to give them props on their choice of bowls used for serving rice and curry, they use bowls with a slant cut opening which makes it really easy to pour/serve from without making a mess.\n\nThey also had very clean, modern and orderly restrooms which is an absolute must for a fine dining location!\n\nA++++++ Establishment :D"
        }, 
        {
            "index": 232, 
            "rating": 5, 
            "review": "This place was very very good! We celebrated my cousin's 21st birthday here and ahead of time, we called the manager about what was going on and what we will be needing. He said whatever you want, I will make sure you get it. When we got there, the waiters were super friendly and polite when the food was served. The manager made sure everything was there and whatever we needed, we got it. Absolutely wonderful! I highly recommend this place and it's the best restaurant on the strip!!"
        }, 
        {
            "index": 233, 
            "rating": 5, 
            "review": "Best indian buffet i had in sequence of 4 indian buffets the long weekend n monday..... parking is nightmare... unless some had a better idea."
        }, 
        {
            "index": 234, 
            "rating": 4, 
            "review": "The staff was warm and welcoming and even gave me a tour to help me find the vegetarian options. I sampled so many new dishes, everything looked fresh. Some items were too spicy for my Caucasian taste buds, but other than that, I'm happy with my lunch buffet!"
        }, 
        {
            "index": 235, 
            "rating": 5, 
            "review": "When I moved to Vegas from Australia I worried that decent Indian food was going to be a thing of the past. Few Americans I spoke to dreamed of eating a curry (and it's tough to find in supermarkets), but I need not have worried.\n\nVegas has a great array of Indian food available of varying quality. I have tried it all and the one place the wife and I keep coming back to is Tamba.\n\nOddly situated at the back of the abandoned hulk that is The Hawaiian Marketplace Foodcourt, Tamba is in my opinion the best food to be had anywhere on The Strip.  Everything is spiced to perfection and there's a great array both for meat eaters and vegetarians.  The lunch buffet is sensational value.\n\nConfused at the people here saying the service is bad/rude. I can barely take a sip of my water before a polite (to the point of humble) waiter is rushing to top me up!"
        }, 
        {
            "index": 236, 
            "rating": 5, 
            "review": "Just delicious...yellow rice and chicken korma is my fav!"
        }, 
        {
            "index": 237, 
            "rating": 4, 
            "review": "After many visits saying, \"gee, we should try Tamba\", we finally did!\n\nWe visted on a Sunday night and found the place to be nearly full and almost everyone was Indian - always a good sign that the food is pretty authentic!\n\nThey had two different \"feasts\" so we got one of each.    Both gave us a good sampling of what Tamba has to offer.   Since we shared, it meant just a taste of each item but all were very good.      The vegetarian version of the feast started with samosas followed by Saag Paneer, Dal and a korma - not sure of the name along with really good naan.    The meat version started with an awesome tandoori chicken followed by Rogan Josh, Chicken Tikka Masala and dal.     All really good!\n\nService was good.   I saw someone posted they did not have A/C - the night we went, there were no issues with temperature so that's likely just a one time issue."
        }, 
        {
            "index": 238, 
            "rating": 5, 
            "review": "We took a chance as we are not from Vegas. We are really glad we stopped. The buffet was diverse and fresh. Staff was very pleasant and the decor was inviting. Very clean. Hands down THE BEST Indian food we have ever eaten. We will definitely come back here whenever we are in Las Vegas."
        }, 
        {
            "index": 239, 
            "rating": 5, 
            "review": "Love it best indian food ever!!!!! Awesome service and amazing food.. been to a lot of Indian restaurants but Tamba is the best i have ever had simply amazing  love love it so much!!!!! If you haven't been here you have to try it you will love it! The food is simply delicious the flavor in the food is amazing your taste buds will go crazy sooooo  good... I come to vegas just to come eat here every time have to eat at Tamba."
        }, 
        {
            "index": 240, 
            "rating": 5, 
            "review": "Only buffet for dinner tonight but still busy at opening time. Great service, very friendly and accommodating. Took our coupon for $15 off two entrees even though we couldn't order off the menu. Food was excellent. We took the advice of several yelpers and parked at Planet Hollywood where we enjoyed happy hour and then walked to the Hawaiian Marketplace. I'd love to go back to Tamba."
        }, 
        {
            "index": 241, 
            "rating": 5, 
            "review": "I went on a Sunday night and had a great experience. Fantastic service, great food (plenty of vegetarian options), and really nice decor. I also enjoyed how quiet it was and I will most likely be going back before I leave Vegas. I ordered from the menu--there was no buffet laid out that night."
        }, 
        {
            "index": 242, 
            "rating": 4, 
            "review": "Every time I go to Vegas, I get really excited because I know I'll be shoving delicious food from Tamba into my gullet.  Most people get excited about Vegas because of the debauchery they are about to partake in.....yes, yes, that's all good and well done, but aside from my roulette high, TAMBA is why I sing Viva Las Vegas!\n\nGo for the lunch buffet and you will see what I mean--it's a vegetarian dream!  there's like 10 veggie items on the huge buffet and the naan is soooooooo good!\n\nI will warn you, it gets crazy sometimes on weekends, line out the door, raita and chutney slinging to and fro, elbowing people out of the way for the last scoop of halva, etc.  BUT, it's worth the madness.\n\nP.S. Handy-dandy tip: when you are in your hotel room--look for the coupon that gives you 10% off the buffet, I randomly came across this when I flipped through the Vegas magazine last time I was at Caesar's Palace soaking in the tub.\n\nAlso, if you like even more heat, they will hook you up with some extra hot sauce, just ask."
        }, 
        {
            "index": 243, 
            "rating": 4, 
            "review": "Came here on a Wednesday night around 7pm. It was very quiet, but started filling up a bit by 8. The food was fine but came out a bit slow (not buffet style) and everything was mild for my tastes even though I asked for the food to be spicy. My parents loved it.\nI liked the tandooori sampler. The lamb vindaloo was tasty. The paneer tikka masala had a very mild creamy flavor. The garlic naan was what I expected: naan with garlic. Can't go wrong there. Other condiments were served at the table and were fine. \nThe service was very polite and I really appreciated it, however our bill was delivered to the table next to us. All the dishes were little pricy for me; it was $4 for just plain white rice. My family liked the food overall though, and the location is convenient."
        }, 
        {
            "index": 244, 
            "rating": 5, 
            "review": "Food was great and the rice pudding with the hint of ginger was the best I ever had. The decor is modern and clean. I am definitely returning. The lunch buffet was $14 and so worth it!!"
        }, 
        {
            "index": 245, 
            "rating": 4, 
            "review": "4 stars for the Mango lassi!\nI liked the juice:yogurt ratio. There is more juice so the consistency isn't too rich and thick. It's easy to sip through the straw and afterwards it doesn't feel like you ate a liquid dessert.\n\n3 stars: We shared the Ashoka's Feast which was good but not great. In my opinion, the spices were a bit muted. I like indian food that is tantalizing and I love it when I taste new combination of spices. But, Ashoka's Feast didn't do that for me. I'd definitely come back and try other entrees.\n\nOverall 3.5 stars: This spot is definitely a good eatery if you're in Vegas and on a budget. The service is great and the ambience is warm and soothing. As for it's  location, it is in the middle of strip so it's not too hard to get there. Just walk over, break a little sweat, and stuff your face with some good food!"
        }, 
        {
            "index": 246, 
            "rating": 3, 
            "review": "I read the reviews of this place before coming and found it interesting that there was such a spread of opinions.  My experience with yelp reviews has been that they tend to clump together around a mutually-agreed upon rating but this one had people who loved it and people who hated it.  My fellow diner and I agreed that 3.5 stars is just about the correct rating though.\n\nImpressions: The place is nicely decorated with low light and soft music.  It is upstairs in a a grim looking food court in the back of a low-rent outdoor shopping center.  It has a nice ambiance once inside though.  We went for the lunch buffet.  \n\nPros: Very friendly and attentive staff.  My water glass never reached the half-way empty mark.  \nPlenty of vegetarian selections in the buffet\nThe chicken tikka masala and a paneer curry (I missed the name) were both very good\n\nCons: the daal was overly salty\nSome dishes were just okay and not spectacular\n\nOverall we had a nice lunch here but I've had better Indian buffets in the Bay Area.  In the midst of a sea of burgers and undercooked pizza slices however this is a welcomed change."
        }, 
        {
            "index": 247, 
            "rating": 3, 
            "review": "Good and unique flavors. Decent prices. The saag paneer was decent but rice had to be ordered separately. The naan was good and the ashokas feast was a good variety of flavors. Surprising for the strip, a nice change of pace. Would return if invited."
        }, 
        {
            "index": 248, 
            "rating": 1, 
            "review": "I went for the lunch buffet & the quality of food was bad. There was not even one thing that I could eat. All the sabjiz were almost tasteless. Naans were not served hot which made them very hard to eat."
        }, 
        {
            "index": 249, 
            "rating": 5, 
            "review": "Had lunch today and it was wonderful to find this place on strip. Wish I could find them earlier. Food was tasty and upto mark. They didn't put something on table which wasn't needed which most Indians restaurants do specially with  their deserts. Carrot desert was a big hit."
        }, 
        {
            "index": 250, 
            "rating": 2, 
            "review": "I was greeted when I arrived. I was craving Chicken Tikka Marsala. At lunch they only have a buffet which didn't include chicken tikka marsala. The buffet was alright, I'm not sure what half of it was. None of it was really spicy. The service was ok, I had to ask for a refill and the bill. Lunch was a $15.00, a little pricey for just ok food."
        }, 
        {
            "index": 251, 
            "rating": 5, 
            "review": "Whenever i have out of town friends, i bring them to Tamba, i love the furniture and the FOOD!  there are so many vegetarian dishes to choose from.  Pretty reasonable too in price.  Very friendly, spacious and tucked away.  Wish they had parking nearby."
        }, 
        {
            "index": 252, 
            "rating": 5, 
            "review": "Came in for dinner with my friend who has never tried Indian food. Both meals were delicious and prepared very mild as requested. Service was nice, atmosphere was nice."
        }, 
        {
            "index": 253, 
            "rating": 3, 
            "review": "Was excited to try this Indian restaurant since it was recommended by some Indian acquaintances.  I love Indian food.  I generally don't go to the buffet lunches as they usually don't offer the best selection (everything chicken) and quality but my friend said, the buffet is actually good and they even offer lamb curry/korma (you just have to ask for it and the waiter will bring it to  your table).\n\nThe flavors of all the curries were fantastic and deserving of 4-5 stars, the only problem is every curry was WAY TOO SALTY.  Not sure if this was intended being that it was a buffet and perhaps they want you to fill up on rice or nan.  Had they cut the salt in half, they would have gotten 5 stars from me.\n\nApparently they must be doing something right because out of the whole food court in Hawaiian Village, they were the only restaurant left standing.  I would potentially go back again but only if I needed some extra sodium in my diet."
        }, 
        {
            "index": 254, 
            "rating": 5, 
            "review": "I had the lunch special, and it included some very traditional Indian fare that most Americans would not ascribe to Indian food. The buffet was vegetarian heavy, which I loved as I favor the southern style. Waitstaff was friendly. The decor was pleasantly better than expected, considering this was not a strip hotel restaurant. I guess I would describe the food as not particularly gourmet, but utterly satisfying. Not bad for a semi-vacant strip mall. If I ever go back to Vegas, I will have to try dinner a a la carte."
        }, 
        {
            "index": 255, 
            "rating": 4, 
            "review": "The little gem hidden inside the thriving Vegas strip. The buffet the previous night not only disappointed us but was high on meat. So we decided to try the Indian place out for lunch buffet, keeping in mind our friend's recommendation. The spread was apt, with veg dishes having an upper hand. Delicious, warm decor and excellent service. If you are having that sudden craving for desi food in the middle of the strip, look nowhere else."
        }, 
        {
            "index": 256, 
            "rating": 3, 
            "review": "food was good. when I was there they have buffet only. I think that's not right. they need to provide regular menu."
        }, 
        {
            "index": 257, 
            "rating": 4, 
            "review": "Went to this restaurant on the strip with a bunch of guys.. Walked in and it was super quiet and we were a rowdy bunch.. Host was awesome, made us feel at home and guided us on the menu items that would satisfy us.  The platter was awesome with tandoori lamb chops, fish, chicken tikka and lamb kabob.. Butter chicken was mediocre with no taste, lamb curry was so so."
        }, 
        {
            "index": 258, 
            "rating": 4, 
            "review": "This is second time I visited Tamba while on trip to Strip :)\nAgain same absolutely fine taste of Indian cousin.\nProbable I would return again to this restaurant to taste it's all items :-)...."
        }, 
        {
            "index": 259, 
            "rating": 5, 
            "review": "This is best Indian restaurant on the strip. Quality Indian food. Lots of options for lunch buffet."
        }, 
        {
            "index": 260, 
            "rating": 2, 
            "review": "I rarely write negative reviews. I wanted to like this place, but the parking was difficult, the service was apathetic and blah, and the food was just \"okay.\" Our order was of course jacked up. Then to cap it off, got to wait 30 minutes for our bill. There are a lot better Indian places within a few blocks of here. Seek them out. I gave this two stars because the food was edible. I will not be returning though."
        }, 
        {
            "index": 261, 
            "rating": 1, 
            "review": "Went here with 3 of my friends for vacation. Each meal was pretty cheap at $12 each; the waiter was really nice offering to bring two bowls of rice and two baskets of bread which we didn't know costs us $15. Add in the 18% automatic gratuity on alcoholic beverages and you get $115. That was a surprise to me. The food itself was ok, nothing spectacular. I would have rather spent that money on a buffet or something else."
        }, 
        {
            "index": 262, 
            "rating": 1, 
            "review": "Chicken piece was served in vegetable biryani. Upon informing about it they replaced it but didn't even care to apologize for it. The server seemed to be very rude. Didn't liked the service atall."
        }, 
        {
            "index": 263, 
            "rating": 5, 
            "review": "Awesome Indian buffet!! Went there for late dinner, 9 pm -ish and it was still packed with people. 95% were Indians. It is always a good thing when you see natives having a meal at their restaurant :)\nMost of the meat dishes were spicy but tasty.\nLike their selections of dishes (salad, fried veggie, flat bread, some curry sauces, lamb/goat curry, chicken)\nGood price too. Look for their coupon at the vegas guidebook-ask your hotel"
        }, 
        {
            "index": 264, 
            "rating": 5, 
            "review": "My family and I were craving Indian food and were pleasantly surprised by the warm yet contemporary atmosphere of Tamba, which is located right on the Strip. The aroma of the place drew us in and got our taste buds working. We ordered chicken tikka masala, fish tandoori with naan and rice. It was all very delicious - full of all the flavors you'd expect in an Indian dish - tied together with thin and crispy naan. The service was great as well - the waiters were very accommodating to every request we made for our food and water was refilled in a timely manner. Definitely returning to this restaurant next time we're visiting Vegas."
        }, 
        {
            "index": 265, 
            "rating": 2, 
            "review": "They don't serve fresh food. Their buffet is probably the worst I had in USA in recent past. Place and decoration look good."
        }, 
        {
            "index": 266, 
            "rating": 1, 
            "review": "I went to Gandhi indian restaurant the night before here and Im starting to realize that  Vegas does not offer good indian food.  Anyways, the place is located ON the strip.  You can only access the parking lot from the northbound Las Vegas Blvd.  There is a little parking lot behind mcdonalds.  The restaurant is located upstairs in a little strip mall or whatever  it is.  There is an escalator to get up there.  We sat down on a monday night - not busy, but i dont care.\n\nThe waiter took forever to take our order.  I ordered the Meat Thali.  The food was bland and not tasty.  It was better than Gandhi Indian restaurant for sure, but still sucked.  We came here specifically because another yelp review said that the naan melted in your mouth.  I call BS.  No way.  The prices were expensive 15-18 dollars a plate. \n\nThey gave us onions and indian pickle without asking which was nice.\n\nAnyway Bottom line is that I will keep looking for that elusive good indian restaurant in Las Vegas"
        }, 
        {
            "index": 267, 
            "rating": 1, 
            "review": "Unfortunately I was entirely underwhelmed by my experience here. Service was ordinary and I would have overlooked this if the meal was decent but it wasn't. I ordered Chicken Tikka Masala and it was just... tasteless. The chicken cubes were dry and hadn't absorbed any of the flavour, and the sauce was bland. The garlic naan was good and it earned the only star in my opinion."
        }, 
        {
            "index": 268, 
            "rating": 2, 
            "review": "Not a big fan of eating indian food while travelling as i get enough of it in bay area, but this being a common popular place in the middle of the strip i thought i will give it a try. The knowledgeable people I asked eho have good indian food reviewing skills all told me this place is extraordinarily ordinary.  Its USP is it's location.  They were all right !!!"
        }, 
        {
            "index": 269, 
            "rating": 2, 
            "review": "We went in a group of 6 for their Saturday lunch buffet. The vegetarian dishes were pretty good- saag paneer, paneer matar, daal, rice, etc. The non veg weren't that good except for the chicken tikka. Idlis tasted like they were microwaved from having prepared them a few days ago. Sambar wasn't too bad. The Gulab jamoon was OK, hard to cut with a spoon. \nOverall, it was OK considering it is one of the very few Indian food options on the strip"
        }, 
        {
            "index": 270, 
            "rating": 3, 
            "review": "Decent restaurant if you have the patience to wait a while for food. Our meal took an hour to get to our table but it was worth the wait."
        }, 
        {
            "index": 271, 
            "rating": 4, 
            "review": "I must say, the variety at this Indian buffet was impressive.  Also food was good and fresh.  Butter chicken was really tasty."
        }, 
        {
            "index": 272, 
            "rating": 5, 
            "review": "Great nan and vegan options on menu. Will be back for buffet."
        }, 
        {
            "index": 273, 
            "rating": 4, 
            "review": "Found this restaurant via YELP and it was a great surprise. Food was fresh and the wait staff was very friendly. Was here with the family and enjoyed everything that was served. Will definitely be back."
        }, 
        {
            "index": 274, 
            "rating": 3, 
            "review": "Indian food for two?  Walking upstairs at the Hawaiian marketplace, you'll be surprised to see this dimly lit restaurant and its ample seating area.  They offer a buffet lunch and dinner a la carte.\n\nIt's hard when you want to try a bunch of different stuff when it's just you and the BF.  But Tamba offers a couple of 'feasts' to help satisfy that curiosity!\n\nFor $25, the BF got the Ashoka's Feast which comes with:\n\n* Tandoori Chicken \"Spring chicken in a mildly spiced ginger yogurt sauce.\" - It came with two drumsticks and two breasts, a decent amount to start his meal.  There were three dipping sauces - the mint one, a chutney of some sort, and a dark purplish one.  I'm not a particular big fan of tandoori, but the BF ate three pieces of it.\n\n* Lamb Curry \"Cubes of lamb cooked with onions, tomatoes, garlic, red chilies, and pickling spices.\" - It tasted a bit gamey for me, but we did enjoy dipping our nan bread into the sauce.\n\n* Chicken Tikka Masala \"Chunks of boneless chicken roasted in the clay oven and then served in a mild curry sauce.\" - The chicken was white meat, and pretty flavorless.  But the curry sauce was SO good!  I wish I had a bucket of that to dump all over my rice and to smother my nan bread with!  Next time I'll tell them to skip the chicken and give me more of that sauce!\n\n* Kali Dal \"Slow cooked black lentils with a medley of spices.\" The BF thought this would taste just fabulous in a burrito, as in skip the black beans, refried beans, or pinto, and add some black lentils instead.  Pretty tasty stuff and good with the nan bread too.\n\n* Rice - A generous scoop coupled with a few green peas for decoration.  Needed to enjoy all the lovely sauces the meal has to offer.\n\n* Nan \"White flour tandoori bread\" - A must when eating Indian food.  My preferred choice when soaking up any kind of curries, especially those that come with tikka masalas! \n\n* Raita - Condiment based on yogurt used as a sauce or dip.  Served chilled and has a cooling effect when eating spicy dishes.  I'm not a big fan of the raita and was only dumping it on the rice 'cuz the BF was doing it.  I can pass on this.  \n\n* Daily Dessert - Two small donut-like holes sitting in a bath of butter and honey.  Oh so sweet and a nice finish after a hearty Indian dinner.\n\nI ordered up the Buddha's Feast for $21 and this is what I got: \n\n* Vegetable Samosa \"Crisp golden brown pastries stuffed with mildly seasoned potatoes and peas.\" - The order came with two samosas, and two dipping sauces.  The BF was pretty impressed by these, and I'm lucky that I had two to share!\n\n* Malai Kofta \"Chunks of cheese tossed in a mild buttery cream sauce.\" - It came with one chunk of cheese only, which I couldn't even tell was cheese! I thought it was a mixture of chickpeas or something.  The sauce was okay, and good for dipping. \n\n* Saag Paneer \"Spinach with our special cottage cheese cooked in a karahi with house spices.\" - It came with one piece of cottage cheese, and I think it lacked flavor.  The BF said it had been sitting out too long and this is one of his favorite Indian dishes.\n\n* Kali Dal\n\n* Rice\n\n* Nan\n\n* Raita\n\n* Daily Dessert\n\nThe feasts are presented quite nicely on a large platter and it's a decent amount of food.  You definitely get the chance to taste a few different things without breaking the budget or ordering too much food.\n\nThe BF also ordered a Mango Lassi that he found a bit too sweet for his liking.  I thought it tasted fine, but was more watery than what I'm used to.\n\nService was good - our water glasses were filled without asking.  The only complaint was that our main courses came out too quickly after our appetizers.  We had to help the waiter move some dishes around while we were still eating and he was juggling the huge platters.\n\nThere's also a back room available for private parties with a more family style seating.\n\nSidenote: You can get a 50% off coupon/entree at the Tix4Less booth downstairs! Or a 10% coupon from their website.\n\n(Check out the pics of our eating in the business profile!)"
        }, 
        {
            "index": 275, 
            "rating": 1, 
            "review": "We were here a yr ago and really enjoyed the food. This time it was 100% worst - food quality was bad and for $20 for buffet for dinner, it was really not worth it. If they don't change food quality. It's matter of time before this place disappears!"
        }, 
        {
            "index": 276, 
            "rating": 4, 
            "review": "It had been about ten years since we last visited Tamba. We went there for dinner during our last trip to Vegas. We noticed a major improvement in the ambiance of the restaurant. We were informed that the restaurant was renovated internally about 2 years ago. Tampa has made some very nice and noticeable changes to its interior. Tamba could use some improvements to the exterior as well. It is deep set in an aging shopping center which prevents Tamba from completely standing out and getting noticed.\nThe quality of the food and the service was excellent. Service included knowledgeable servers who wasted no time in informing us of the daily specials and the top selling dishes of the restaurant.\nWe had the Pani Puri for an appetizer and it was delightfully flavorful. For dinner we had the Butter Chicken and Tandoori Chicken. Both of these dishes were prepared to our taste buds' liking. The sauce on the Butter Chicken consisted of the right texture, color and flavor. The Chicken Tandoori lacked the artificial color (Thank You) which many Indian restaurants use to make it red however it tasted as chicken from a full flavored tandoor oven. It was tender and had the right combination of the herbs and spices.\nIt was a delightful change at Tamba from ten years ago and we will visit again."
        }, 
        {
            "index": 277, 
            "rating": 3, 
            "review": "Conveniently located near the planet Hollywood but you will have to walk inside in a secluded area to be able to locate it. Nice interiors and staff is cordial. If you are an Indian, food is like home cooked... Average meal. It's pricey for the taste and quantity that it offers. A good change of cuisine away from home but nothing more than that."
        }, 
        {
            "index": 278, 
            "rating": 4, 
            "review": "Pre-pay Indian buffet? Ok, I was a little taken back by this, but glad I gave them the chance anyway.  This buffet had the largest selection of several that I tried in Vegas, including a couple southern Indian items (iddli and sambar).  My water was never less than half-filled, as if the server's sole mission in life was to keep my glass full.  Food was authentic, flavorful, and spicy for a change.  I really liked Tambar."
        }, 
        {
            "index": 279, 
            "rating": 5, 
            "review": "The lunch buffet was big, fresh and delicious.  I tried 4-5 entrees and the salad bar had a lot as well.\n\nEverything was fresh and well prepared.  The service was friendly and prompt as well plus the location off the strip was convenient and the atmosphere is nearly fine dining level inside."
        }, 
        {
            "index": 280, 
            "rating": 5, 
            "review": "Best Indian restaurant on the Vegas Strip.  Very good Indian buffet. Buffet is $15 worth every penny. Ambience is amazing."
        }, 
        {
            "index": 281, 
            "rating": 3, 
            "review": "*Weekend lunch buffet review*\n\nOur plan was to find some grub at Aria but we either found stuff that was too expensive or not very appealing. By this time we were STARVING so I whip out my trusty iPhone and used my Yelp app to find this place just across the street. It's located in the Hawaiian Marketplace all the way in the back.\n\nThe first thing we did after we entered was pay the $15 for the weekend lunch buffet. I thought that was a bit strange but if the hotel buffet places can do it why not. \n\nThey had a lot of variety, at least 14 different items, and thought everything was just ok. One thing I thought was really good was their upma, it's like an Indian version of the Moroccan cous cous. It was my first time having the dish and it was simple yet very tasty. The chicken tandoori had good flavor but was a little dry. The chicken tikka masala sauce was good but there wasn't a lot of chicken, I had to dig around for some. What I noticed is that this place supplied small containers for the different dishes. I've never seen that before and thought it's a good idea for those who don't like mixing their food. \n\nThey were pretty good with refilling our water cups and clearing our dirty plates. Bad thing with this buffet was drinks weren't included so a separate bill was handed to us. Another downside was the food wasn't labeled properly, so I was just grabbing things blindly. \n\nOverall it was just an OK experience. At least Tamba introduced me to a new dish, now all I have to do is find it here in LA!"
        }, 
        {
            "index": 282, 
            "rating": 3, 
            "review": "I had been here last year. This weekend visited the place again. The quality seems to have gone down. Variety was still good. But for the price you pay, having to get dessert and daal in paper bowls doesnt gel well"
        }, 
        {
            "index": 283, 
            "rating": 1, 
            "review": "Worst Service! The waiters did not care to check back on our table. We had to speak to the manager and they all (including the manager) were rude and arrogant. We will never go back to this place again. Food was just average as well."
        }, 
        {
            "index": 284, 
            "rating": 5, 
            "review": "I had been in vegas for a conference and it was about time for me to have my indian fix. The first thing I noticed was that this place was packed with Indian people. That was a good sign, everything tasted authentic, fresh, and healthy like having a meal at home. Like others have stated the chicken tandoori was moist and delicious! The rice pudding was the best I've ever had. I also didn't feel heavy or thirsty after the meal which I usually do from NYC indian delivery spots."
        }, 
        {
            "index": 285, 
            "rating": 5, 
            "review": "Amazing spicy food with a very friendly staff. Would love to come over here again and again. Reminds me of home food"
        }, 
        {
            "index": 286, 
            "rating": 4, 
            "review": "Great food convenient on strip location. Great staff. One down side was naan bread was too dry. Good authentic Indian food."
        }, 
        {
            "index": 287, 
            "rating": 4, 
            "review": "Went to Tamba while visiting Vegas. Honestly, we found this place because we had a coupon from the Entertainment Book. We ended up going twice.\n\nOur first dinner there was on Sunday night - we fell in love with the place. The waiters were friendly and helpful. We were given a second dessert for free because we were told we HAD TO try that one too. We were so happy that we did. My first visit to Tamba - food, service, perks - gets 5 STARS.\n\nWe went back to Tamba a few days later with a friend. The food was still good, but seemed saltier than Sunday. We had ordered different dishes so not sure if the saltiness was just due to our order. We still enjoyed the food and the service was good, but a little off on the timing. Barely touched appetizer before main course came out. One of the servers seemed annoyed by the use of the coupon, but otherwise, it was still good. Second visit: 3 STARS."
        }, 
        {
            "index": 288, 
            "rating": 5, 
            "review": "The negative reviews here are rather ridiculous. First of all, Tamba is all about the buffet. Don't bother ordering off the menu and you won't be complaining about bad service or long wait times for your food. Here's why Tamba has the best Indian buffet in town:\n\n1. Huge selection with plenty of veggie options. I don't  think there's a bigger Indian buffet in Vegas.\n2. Buffet is not set up against a wall so you can go down the row on both sides. No waiting!\n3. Great naan and great rice. These are key.\n4. All you can eat gulab jamin dessert. So good.\n5. Friendly staff. We've been going for years and the owners, staff etc have always been extremely cordial to us.\n6. 30 bucks for 2 adults and 2 kids. Hard to beat that.\n7. Great recipes of standard dishes that should satisfy most everyone.\n8. The place has Indian folks arriving in big numbers. There is no way an entire Indian family would go there and bring their non-English speaking, sari-adorned grandma, who happily eats with her hands, if this wasn't the real deal.\n9. Free parking. Pay 5 bucks next door at the lot and you get it back with your receipt when you leave. Sweet!"
        }, 
        {
            "index": 289, 
            "rating": 5, 
            "review": "Freindly service. Reasonable prices. Nice atmosphere. Tasty food. Lots of vegetarian options."
        }, 
        {
            "index": 290, 
            "rating": 3, 
            "review": "It pains me to give 3 stars to this place when my first experience here only less than two months ago warranted about a 4-ish rating.  \n\nMy boyfriend and I came in here about an hour before closing and instead of being greeted with a \"Hello, how are you this evening?\" spiel, we were told right off the bat to order only one entree since the kitchen was closing soon.  I thought that was a bit harsh and strange as the dining area was a little more than half full already.  The kicker was a group of women that showed up about 15 minutes prior to closing and the same host was taking care and doting over them with open arms.  Guess you have to show some skin, cleavage, possibly more... to override the rules, eh?  \n\nService here on the whole part is excellent.  The food here is excellent and VERY fresh.  However, I highly do recommend not to order spicy as the last dish I ordered was heavily-overpowered with chili powder, but no taste.  Order medium, if you want a kick, but still can enjoy the flavors.  Portions are not big, but that is perfectly fine as they are definitely filling.  The garlic naan is good; samosas are forgettable and not worth it by any means; the korma is great; and I HIGHLY recommend the yellow/cumin rice as a side dish as it is superb. \n\nThe other knock-off is that they automatically added 18% gratuity to the bill.  It's one thing if it was a group of people and I understand that, but for just two people?  At least have a sign at the front desk or something on the menu that says this is going to be enforced.  It has nothing to do with us being cheap tippers or anything as we both vary between 15% to 20% on tipping (dependent on food/service etc...)  I know the last time I went with my boyfriend and a close friend of our's, this did not occur.  Was it because we \"inconvenienced\" them by coming in an hour before closing since the tone of the voice and body language of the host made it obvious?  Bizarre to say the least and this definitely did not go over well with the bf one bit.  The redemption was later on when I won money on the slots at Paris to cover up the dinner cost.   \n\nPricey, yes, but what do you expect in Vegas?  $14 for channa masala (garbanzo beans in a sauce) is hilarious as you can go get a Trader Joe's frozen version of the same thing/taste for around $2 and change.  Expect to pay at least nearly $30 a person to give you a gauge of what to expect.  \n\nUnfortunately, this last experience did not go over well at all, especially with my boyfriend.  We won't be coming back and we'll look for another Indian food restaurant avenue that will hopefully show more class to its customers when we visit Vegas again."
        }, 
        {
            "index": 291, 
            "rating": 1, 
            "review": "was very  disappointed. Tofu was used instead of paneer. There was no briyani, no papad, Nan's were cold."
        }, 
        {
            "index": 292, 
            "rating": 1, 
            "review": "Worst indian food ever tasted.Price($20) is too high taking full advantage of strips .If you really want to eat don't go for indian food on strips.better to try something else."
        }, 
        {
            "index": 293, 
            "rating": 4, 
            "review": "Once you find this place in an old shopping centre, it's well worth it.  Service was great, it was quiet, meals were lovely, butter chicken a little different from the Aussie butter chicken but still nice. Meals were large as I ordered a number to share but there was so much left over.  Very nice."
        }, 
        {
            "index": 294, 
            "rating": 5, 
            "review": "The food at this place was amazing! The decor and ambience were good. Overall a good dining expedience. A good place for vegetarians. Would definitely recommend this place."
        }, 
        {
            "index": 295, 
            "rating": 1, 
            "review": "How does this restaurant have 3.5 stars? The food was mediocre at best. And there really was no service, so I can't even write anything about it. \n\nThe pakodas were downright pathetic, the navrattan korma was drowning in an unappetizing cream sauce, the naan came out of a freezer I'm sure, the saag was the worst I've ever had.\n\nThe dal was OK, but that's because it is almost impossible to screw up a dal. I did like the raita though.\n\nThe dessert was probably for diabetics. Honestly, if there wasn't a sign there that said it was kheer, I wouldn't have known. Seriously, it needed MUCH more sugar, some cardamom, saffron, nuts and needed to be made by someone who knows what kheer is.\n\nNow comes the funny part, they make you pay BEFORE you even sit down!! What is this? A restaurant or a school cafeteria? Our glasses were refilled only once and our dirty plates were never cleared. Needless to say, I did not leave a tip."
        }, 
        {
            "index": 296, 
            "rating": 4, 
            "review": "Very friendly waiter (Kumar).\nHe explained us a lot about the food, including googling pictures of the different dishes. \nGood food."
        }, 
        {
            "index": 297, 
            "rating": 3, 
            "review": "Before you can eat you do need to find the restaurant.  Using a maps app will help until you get really close.  then you have to look.  The restaurant does not border the street, rather it is inside a building with several stores.  You will see a sign right on Las Vegas Boulevard. \nI arrived at around 9:30 pm on a Saturday night and they were quite friendly at that late hour and didn't rush me at all.  Other people came in after me.\nThe seating is comfortable.  I got a booth.  The waiter was attentive and that was nice.\nI had lamb vindaloo and I've been eating lamb vindaloo as my Indian dish for a long time now.  The food tasted good and my raita was pretty nice as well.\nHowever, for the next two days I had \"the runs\" or diarrhea.  I couldn't taste anything wrong with the food there.\nI've eaten a lot of Indian food and it's never given me the runs like that food did for me.  I'm really lucky that nothing ran during my long flight home.  I'm reasonably confident that my upset stomach was not the result of something else that I ate or drank."
        }, 
        {
            "index": 298, 
            "rating": 1, 
            "review": "Totally overpriced. Food was very spicy and bad. Server was acting to be over smart. Food details:\nSamosa was uncooked\nMalai kofta was spicy and kofta's were very hard. \nPaneer was spicy\n\nAlso the main-course had a lot of baking soda which is not good for health. \nFor good food this is a highly  no no place."
        }, 
        {
            "index": 299, 
            "rating": 3, 
            "review": "I went to this place while hiding from some weirdo who was chasing me down the Vegas strip. This place has lovely decor and a nice ambience. The buffet is $15.08 with tax, but there's not too much to choose from and they only serve water. Great flavor - better than what I had at a more expensive buffet, but I would have liked to see more variety and something to drink other than water. Pleasant staff."
        }, 
        {
            "index": 300, 
            "rating": 5, 
            "review": "The most amazing Indian food I've eaten in US.. We are from the NJ area where there is a plethora of Indian restaurants and the taste that Tamba offers still stands out.. The naans were so incredibly soft.. And the kofta (we ordered malai kofta) was so melt in mouth and the gravy was finger licking! We also ordered the daal tadka - it was listed as a favorite and it was truly so very flavorful!! Also the green chutney that accompanied the mix pakora we ordered had the amazing homemade flavor (usually the ones I've eaten at the restaurants are more liquidy) and the perfect consistency .. The pakoras were also very nice and crispy.. I'd definitely recommend, you wouldn't be disappointed"
        }, 
        {
            "index": 301, 
            "rating": 1, 
            "review": "One of the worst Indian food I had in my life too much salt in almost every dish I hadTotal waste of money.its a lunch buffet or breakfast buffet I didn't get dat... 80% of food was breakfast just 2 or 3 items were lunch dishes... I hate it the taste overall sucks"
        }, 
        {
            "index": 302, 
            "rating": 4, 
            "review": "My family recently visited us from London and we all went to this excellent place. Upon our arrival we were greeted nicely and then they seated us in this exclusive area because they thought we were the people taking a tour. It was hilarious when they came and told us how they had made a mistake and apologized extensively for there inconvenience. I think everything is fine with this restaurant but I would prefer ordering over their buffet. The bathrooms need to be more clean. Besides that the place is nice and chic. There is this huge  market below this where you can get cheap stuff- from sunglasses to shawls and other materials."
        }, 
        {
            "index": 303, 
            "rating": 1, 
            "review": "I visited this place few times in past several years and the food was always pretty decent. However, last year i noticed that they had started serving tourist buses which hoard the place like bees to honeycomb. Last year I ignored it but this year when we visited the place again it turned out to be a big mistake. The server asked us to wait outside while they kept accepting 3-4 tour buses(about 100-150 ppl) one after other in front of us. In addition, they asked us to pay upfront for the buffet which is something I have never experienced at any decent restaurant.  We waited for 20 mins watching hoard of Indian tourists going in and out of the place. We asked the server if we can go in and check the spread of buffet but we couldnt even get a sneak peek of the spread because the place was full of overflowing tourists like washroom of a football stadium. We left place and returned the next day for lunch. It was the same story all over again. I am guessing the management only cares about making money and not providing any service.  \nI am sad this place was so good before. I dont think I or any of my friends are going to visit this place again."
        }, 
        {
            "index": 304, 
            "rating": 3, 
            "review": "I was excited to know about the presence of an Indian restaurant right on the strip, and we were happy to shell out 40 bucks (including tax) for a dinner buffet for two of us (which is highest that I have paid for an Indian buffet!) The experience turned out to be just okay. The quality of food was not bad. In fact, the naan and Gulab jamun (dessert) were excellent, and  most of the other items, except Idlis and Sambhar were also okay (not great). Idlis were certainly stale by at least a day! \n\nI have more problem with the variety aspect of the buffet. I have seen more variety in $10 buffets!! The number of vegetarian entrees especially was limited. How can any Indian buffet be complete without a single Paneer entree? And Really, Zucchini as an entree in an Indian buffet !? :-o Also, I would expect more starters than just pakodas and  at least, a complimentary chai in a $20 buffet!  (Chai was $2, and wasn't good!)\n\nNext time, if you  are on the strip and you crave for Indian food, take the DEUCE to Indian Masala! You can thank me by a \"Useful\" vote here later! :-)"
        }, 
        {
            "index": 305, 
            "rating": 5, 
            "review": "Tamba is a delightful Indian restaurant in the Hawaiian Marketplace (http://www.yelp.com/biz/EjqdQTB9ZbWOyEwD9cPutA?hrid=E2wUGRJTYitv5q7wUOzC3A).  With a spacious dining room and exceptionally polite staff, Tamba offers a $11 lunch buffet.  You can get a 10% off coupon from their website or by picking up the free restaurant guide near the entrance.\r\n\r\nThey claim to be the \"Only Indian Restaurant on the Strip.\""
        }, 
        {
            "index": 306, 
            "rating": 4, 
            "review": "We got a chance to have exclusive holiday buffet on Christmas holidays. It was awesome, most of the curries are prepared perfectly. The only thing is that it is over pricey. We need to pay approx $3.5 for a cup of tea which is not part of buffet. But the good thing is that they provided you disposable bowls for curries which I haven't seen at any buffet places. Overall recommend place on strip to have indian food. :)"
        }, 
        {
            "index": 307, 
            "rating": 4, 
            "review": "Grabbed a buffet dinner. The spread was great, lots of vegetarian options. Desert was probably the weakest, but very good food overall"
        }, 
        {
            "index": 308, 
            "rating": 1, 
            "review": "I went here with 3 other friends for dinner for the first time. We ordered 4 dishes (~15 per) and two alcoholic drinks. The bill came out to be ~$120. That was ridiculously high. It turned out that the waiter charged for the rice, tortillas/bread, and something else. He even slapped a 18% gratuity on it! Wow, I'm never going there again!"
        }, 
        {
            "index": 309, 
            "rating": 1, 
            "review": "I can't even give 1 star for this but since it does not allow I have yo. The worst buffet in US"
        }, 
        {
            "index": 310, 
            "rating": 3, 
            "review": "We ordered the saag paneer, malai kofta and naan. The food was quite good and the naan just melt in your mouth.  The decor is pretty nice too. Service was attentive. The food was reasonably priced.\n\nThe only reason I did not give this place a 4 star is because they didn't have air conditioning on and it was a hot and humid Las Vegas evening."
        }, 
        {
            "index": 311, 
            "rating": 3, 
            "review": "Had this today was feeling for some Indian food. I know going in I knew it would be subpar but I wanted curry and didn't have a car to go better places. It's really average food, service also average I had to get up and ask them to get some drinks for me. If you have a car try out the better places on yelp. The bathroom was clean thought I did end up taking a huge dump. I knew I wouldn't make it waking back on the strip so I let it go there lol."
        }, 
        {
            "index": 312, 
            "rating": 5, 
            "review": "The food is delicious and the people are very polite.  They were very quick in serving our meal. I'm glad I just happened upon this restaurant."
        }, 
        {
            "index": 313, 
            "rating": 5, 
            "review": "We went to dinner here last night. It was amazing! We ordered the Chicken Tikka Marsala with rice and nann bread. Would definitely recommend this place. When you first walk in, the place looks dead because it's in an old mall type thing, but the seating is around the corner and there were lots of people there."
        }, 
        {
            "index": 314, 
            "rating": 5, 
            "review": "Shockingly good! I am most grateful to my fellow Yelpers for drawing our attention to this establishment. We never would have ventured into the Hawaiian Marketplace for food--never. After reading the reviews and finding a coupon in the Vegas 24/7 booklet, we went.\n\nIt was exactly as stated, totally deserted. We wondered whether it was open when we arrived at about 8:30. By the time we left, it filled to overflowing with mostly Indian clientele (which is telling). I think the dinner buffet began around 9 PM. \n\nMy husband and I are big fans of Indian, but we always find it hard to get really good and not just mediocre Indian cuisine. There's lots of mediocrity out there in terms of Indian. Tamba was really really tasty. We tried two new dishes which we enjoyed. \n\nThe first was Panipuri, an Indian street food, which involves a hollow shell made of Indian crispy bread which you fill with a green spicy sauce which is supplied separately. Thanks to our server who told us how to eat it. It's fun. Like a shot of mild spice. \n\nThe other dish we had was the dessert which came with the Ashoka's feast. It was made of dried carrot and nuts. Now, I have this weird thing against cooked carrots. They make me gag, but I love raw carrot. It's strange. So anyhow, I was not aware of what this dish, Gajar Halva, was made out of. I asked the waiter. It tasted nothing like carrot. It has this amazing texture and sweetness. I highly recommend it. Like most extra-American dishes, I find that you should eat it without knowing what it is. I think many Americans have preconceived notions of what things should taste like and their texture so knowing what you're eating is more apt to gross you out than allow you to experience it. \n\nOh yea, while the food was excellent here and the service, the Ashoka's feast is not really enough food for two people. We ordered the pani puri as an appetizer with this in mind and even though I wasn't starving, it was barely enough food. It was all very tasty, but I wish we had ordered a bit more food (especially now as I write this really wishing I was in Vegas eating some Tamba).\n\nI also did not find Tamba to be generic in any way, it was decorated nicely and was lit well, somewhat romantically, and quiet."
        }, 
        {
            "index": 315, 
            "rating": 1, 
            "review": "The most horrible indian food I have eaten after coming to US. Being in Las vegas does not mean that you can charge your customers a fortune for crappy food. The food tasted like the ones served in hospitals with no spices , no aroma and no flavor. Everything was just boiled and served. There are plenty of other options in vegas for indian food, please skip this useless place."
        }, 
        {
            "index": 316, 
            "rating": 5, 
            "review": "Great selection in the lunch buffet- loved the upma n idli ( exactly like back home in India).\nAwesome customer service\nLove the ambiance n decor n this is the only Indian restaurant that actually serves achaar (Indian pickle) for free"
        }, 
        {
            "index": 317, 
            "rating": 3, 
            "review": "Not many indian restaurants in Vegas. This one was ok. Was a buffet when we arrived, werent sure what half the stuff was! Coming from England, we love a good indian curry, but found this pretty average even though there were many indians eating here which was a good sign. The pakora batter was waaay too thick and the currys not spicy enough for my liking. Not a bad choice though if you fancy a curry. The vegetable dishes and chicken curry was good. They also provide goat curry and saag which i didnt rate too much. worth a try."
        }, 
        {
            "index": 318, 
            "rating": 5, 
            "review": "It's been 5 years, and this place was even better than we remembered. \n\nI had the Malai Kofta with the yellow fried rice, Hubby had the chicken Tikka Masala, with basmati rice. We had the pakoras for our starter. A couple of naans as well. The naans are amazing. So light and fluffy.\n\nWe have enough food for another meal tomorrow. We might even go back on Thursday for their Thanksgiving Dinner Buffet. It's THAT good.\n\nOne weird thing though is the water. It's disgusting! No clue why. Guess we'll have real drinks next time."
        }, 
        {
            "index": 319, 
            "rating": 5, 
            "review": "Value for money 5/5\nService 5/5\nFood 4/5\n\nNot the best place for taste or number of items. It's on strip and totally worth a visit if you are looking for decent Indian buffet for $15."
        }, 
        {
            "index": 320, 
            "rating": 1, 
            "review": "This for their terrible service since I did not get to try their food.  We called them 10 minutes before getting there and they said that I did not need to make a reservation.  When we got to Tamba, there were 4 groups ahead of us.  What is worse that for about 15 minutes no one was at the front desk where it said \"please wait to to be seated.\"  We left after waiting for 15 and no one showing up to tell us how long it would be."
        }, 
        {
            "index": 321, 
            "rating": 4, 
            "review": "I am a regular visitor to Vegas like 3 times a year. Every Time i make sure to have their buffet. Loads of variety & quality always consistent. Its a little pricey but hey what is not on strip. For long weekend holidays they do dinner buffet too. So ask them if u miss ur lunch."
        }, 
        {
            "index": 322, 
            "rating": 1, 
            "review": "We went for dinner buffet on the Christmas Eve and the Gobi manchurian was the worst I ever had. Aloo tiki was dripping in oil. Dal was super spicy.. Roti was rubbery.  And the price was 20$ for this kind of food. Do not go to this place. Not worth it at all."
        }, 
        {
            "index": 323, 
            "rating": 3, 
            "review": "Place is convenient on the strip and price was $14/person. Mostly catered towards vegeterian but the food was alright for the price and location. Service was quick and efficient and the allowed us to linger for a bit while we talked and took our time with our food. Disappointed they didn't have any dessert at the buffet."
        }, 
        {
            "index": 324, 
            "rating": 5, 
            "review": "Me and my mom went to dinner here tonight. It was awesome and mega yummy. \n\nFood wise we got the petite veggie samosas, which were delish, but a bit small. I got a lassi which was yummy. We also got rice and chicken tikka masala which was so good. I highly recommend. We also had naan which was nothing special but good non the less. \n\nNow service wise, it was great. Not only was it super quick, and my water was always full, everyone was super nice. We had the best server ever. Not only was he fantastic to talk to, very attentive and so sweet, he was also incredibly cute. I would def rank him in one of my favorite waiters ever. \n\nI cant wait to go back and eat their again."
        }, 
        {
            "index": 325, 
            "rating": 3, 
            "review": "Meat was dry & a little salty but was still really good & the service was great."
        }, 
        {
            "index": 326, 
            "rating": 1, 
            "review": "I was very much pissed off with the restaurant today... After a long drive and not had enough food since morning found an indian restaurant nearby and my bad luck was sticked at Tamba.. Came at around 8.20 pm and order was taken at 8.35 and immediately served a soda that we ordered to have it with food and we thought that was so quick and eagerly waiting for the order and enquired about it with few waiters and they told will get it in few minutes and finally nothing happened and we left the restaurant without eating anything at 9.50pm .. They concluded that its a machine problem and order was not taken at all... That was strange.. I never faced such type of delays anywhere.. I am writing this review because my kid was feeling so hungry and she was very unhappy and she didn't get her favorite biryani that time and slept without eating anything.."
        }, 
        {
            "index": 327, 
            "rating": 2, 
            "review": "As an Indian (from Fiji) who eats Indian food daily, I think I can bring to light that this place is not average. It is slightly below average. For one, the prices are ridiculous. I understand this is Vegas, but who doesn't include naan or rice with their entrées? This was definitely a first for me. \n\nI was asked if I wanted my food mild or spicy, but my wife wasn't. When she got her meal (Yellow Dal) it was very spicy and not to her liking. She barely ate any of her food. She didn't return the food either because she was already so unsatisfied with the service she didn't feel the need to wait again. I'll give them credit for my Butter Chicken meal for being slightly above average and the spice (heat) level to be of my liking. \n\nDecor is nice, except for the random book shelf wall diving the kitchen from the dining. Atmosphere is above average.\n\nService was bad, to put it simply. Our actual waiter only came to the table when we got there, when we ordered, and when we got the check. Other waiters helped us in between. Also, our waiter waited over 15 minutes to bring us our check. He was wandering around and had clearly seen us just sitting there waiting. I'm not a bad customer or just rude, but I couldn't stop thinking about just walking out if this place and not give them any of my hard-earned money. \n\nOverall, I won't ever be coming back here. I'll wait to go back home and get my Indian food instead of wasting time and money here. I'm giving it two stars simply because this place gave me a chance to eat something that reminded me of home."
        }, 
        {
            "index": 328, 
            "rating": 1, 
            "review": "My experience in this place was horrendous. First, they deceived us into coming to their restaurant by not mentioning that it was buffet only. The buffet itself was quite bad with left over food that tasted like it was a week old. I am not sure why anyone would choose this place over the many other choices available (especially the awesome buffets at the casinos at the same price). Do learn from my mistake.\n\nDO NOT RECOMMEND at all!!"
        }, 
        {
            "index": 329, 
            "rating": 5, 
            "review": "Indian Food is by far my favorite, and I was so pleased to run into Tamba on the strip! We came during lunch and were able to eat off of the buffet and get unlimited non-alcoholic drinks for $13.\n\nBeing vegetarians, we were totally stoked that they had at least 5 different dishes in addition to rice, naan, and those weird soda break things.\n\nI learned that I love Dal Makni, Malai Paneer, and Punjabi Curry, which would be things I would normally not get to try because I always order my favorite, Muttar Paneer.\n\nAnyway, the service was really great, the location was awesome, and the food was so incredibly tasty. Five Stars alllll the way!!!"
        }, 
        {
            "index": 330, 
            "rating": 4, 
            "review": "Escondido en una galería vacia, lindo por dentro.\nLas carnes están excelentemente condimentadas.\nUno se lleva una sorpresa en cada plato al estar el nombre en idioma extranjero sin su explicación. \nRecomendado."
        }, 
        {
            "index": 331, 
            "rating": 3, 
            "review": "On the Vegas strip.. We had the buffet kinda average .. Order fresh garlic naan and they make fresh Paneer .. Off the menu kinda pricey but OK ."
        }, 
        {
            "index": 332, 
            "rating": 1, 
            "review": "Have been a visiting this restaurant once every few weeks or so for several years. Over the last 6 months, I started seeing that some staff changed, more importantly, attitude and arrogance has snuck in. \n\nLast night's experience made sure that I will never visit this place again and would never recommend Tamba to any visitors to Las Vegas. Main issues that they have:\n\n1) Extremely arrogant staff that leads to Horrible service and also wrong dishes being served.\n2) Very poor quality of food. One out of 3 dishes we ordered had double salt in it!! When questioned about these, their answer is: Sometimes these things happen.\n\nLong story short, AVOID this place if you want to be treated well for the price you pay!! Not a wallet friendly place....Nickel and dime you for everything...."
        }, 
        {
            "index": 333, 
            "rating": 4, 
            "review": "Great food. Lots of vegetarian options. Good value for money. Can do better in terms of the ambience."
        }, 
        {
            "index": 334, 
            "rating": 2, 
            "review": "Ate the $12.95 lunch-time buffet on a Monday and it was very disappointing. The food was oily and seemed to be sitting out for a long time. Oddly, the place seemed busy, which made me think one of two things:\n\na) Being the only Indian restaurant on The Strip, Tamba's owners clearly aren't worried about quality \n\nb) Tamba's dinner menu must be amazing to compensate..."
        }, 
        {
            "index": 335, 
            "rating": 5, 
            "review": "This is probably Vegas' best-kept secret! FANTASTIC lunch buffet! Unlike the fancy hotel buffets which may look nice but lack substance, Tamba provides consistent Quality ingredients and delicious flavor. It is quite an extensive buffet with food that is fresh and perfectly seasoned. It is hard to find healthy, delicious cuisine at a reasonable price on the strip but if you appreciate indian food, I would head to this Beautiful restaurant before the secret gets out! We had dinner here once and lunch 4 times and already can't wait to go back! Our favorite dishes: malai kofta, dosa, samosas, garlic naan, kheer, gulab jamun. Great variety of north and south indian cuisine, done equally well. Definitely a must-do when in Vegas!"
        }, 
        {
            "index": 336, 
            "rating": 4, 
            "review": "First, this review is for DINNER.\nTHE MENU has a good selection of Indian fare. The mixed tandoori grill and two mixed feasts represent a good mix of Indian dishes for those new to Indian food. \nTHE FOOD was excellent. I am no expert of Indian food, but everyone raved about it. My tamarind shrimp was definitely spicy, but not excessively so. The mixed tandoori grill was excellent for those who do not like spicy food.\nTHE PRESENTATION was good, especially for the mixed feasts and the grill. instead of just slopping the various dishes on the plate, each one is in a nice  stainless container.\nTHE SERVICE was excellent, even though we had a large party. We had several people who had never eaten Indian food and the waiter took the time to explain the various dishes, how to eat them and various nuances of Indian food. \nRECOMMEND"
        }, 
        {
            "index": 337, 
            "rating": 1, 
            "review": "After reading all the reviews and not haven Indian food at all on our vacation I was looking forward to experiencing some authentic Indian Food..... But even though they say they are open on Thursdays when we got there they were closed!!!! Make sure you call first!"
        }, 
        {
            "index": 338, 
            "rating": 1, 
            "review": "Food is not good. Service sucks. Not worth paying $15 for lunch buffet and eat in flimsy foam cups and plastic glass."
        }, 
        {
            "index": 339, 
            "rating": 1, 
            "review": "Bad food, buffet is for $14 and my statement had a charge of $20, my friend had the same charge. \nFood was cold and not indian"
        }, 
        {
            "index": 340, 
            "rating": 4, 
            "review": "We have eaten here many times always great experience... this place is really good. we have been here for lunch buffet, it was great, amazingly huge. We have had dinner ala carte and it was even better. True indian Restaurant food. very falvorful and they actually used real spices. Very good quality."
        }, 
        {
            "index": 341, 
            "rating": 5, 
            "review": "I had my nephew's 21st birthday party, and this was the only restaurant I found on the strip. I called and talked to the owner about 25 people coming to the party and I told him what we need. He was very gentle and said anything you guys like, we'll make it for you. So, when we got there, our table was all set up, and I had the chance to meet the owner. He told me how the food will be prepared. Our guests were surprised to see the quality of the food and the service. The food was awesome and starters were amazing. I highly recommend this place. The waiter was very friendly and helpful."
        }, 
        {
            "index": 342, 
            "rating": 4, 
            "review": "First of all, moderators, can you correct the name of the restaurant? It's really Tamba Indian Cuisine/Lounge. I see that the right URL is provided, so let's make it easier for other people to find this Indian gem.\n\nSince this was my first time out as a Las Vegas resident, I was extremely pleased to discover that Las Vegas does indeed have stellar Indian cuisine. I read the first review carefully and already knew it was considered excellent by Indian natives.\n\nBut when I arrived and saw that virtually everyone in the restaurant was Indian, I knew it was going to be superb and it was. My perennial favorite, Lamb Vindaloo, was as spicy as it should be. The lamb was tender, although I've tasted superior lamb, namely in Paris.\n\nAs a starter I ordered Onion Kulcha. The waiter brought out the nan accompanied by a plate of tomatoes, onions, jalapenos and pickled vegetables. I knew then and there that I would be in for a treat.\n\nThe rice was excellent although I prefer mine laced with peas and authentic cardamom seeds, but for most food lovers this is probably adventurous enough. ;)\n\nIn all, a great find in Las Vegas. Don't let the Hawaiian Marketplace surroundings fool you, this is truly outstanding Indian food and Las Vegas deserves it."
        }, 
        {
            "index": 343, 
            "rating": 5, 
            "review": "Yeah, I went 5 stars. Why? Because the staff was great when I showed up and was the first one in for the lunch buffet. Fresh naan delivered to the table? Yes, please.\nThen, the place started filling up. Next reason: I was the sole Anglo there, everyone else seemed to be from the sub-continent or at least know their way around a tandoor. The long buffet had a variety of great dishes, veggie and carnivore. It could have been sliced up more for my taste, but that's why we hit the chutneys.\nIt's a little pricey since I don't wallow away from the trough overstuffed and miserable but I'll be back. Great place.\nLook inside the crazy Hawaiian-themed outdoor mall/whatever it is.\nBeautiful place, clean, lovely, large, comfortable."
        }, 
        {
            "index": 344, 
            "rating": 5, 
            "review": "Nice and tasty food. Reasonably priced. Great location.  Upscale ambience.  Good service.  Worth the visit."
        }, 
        {
            "index": 345, 
            "rating": 5, 
            "review": "Every time we good back for our annual vacation in LV, a trip to Tamba is planned!  We always do the lunch buffet - the price is good and the buffet is plentiful.\n\nWe love Indian food - we are not Indian so we know what we like.  Tamba has a great selection of vegetarian food with minimal meat items - we are carnivores but are just as happy with meatless dishes there.  Each time we have gone, we have found several items on the lunch buffet that we have never tasted before so we know that they change up the buffet items regularly.\n\nTheir tandoori chicken is the best I have had - it is always moist and tasty, not dried out or overcooked.  they always have a paneer dish there, a soup, lots of veggie dishes like aloo gobi, etc.  they always have a dessert on the buffet and loads of hot naan.\n\nI would recommend this place to anyone who enjoys Indian food or is just learning - their buffet is a great way to jump in!"
        }, 
        {
            "index": 346, 
            "rating": 4, 
            "review": "Had dinner here with my fiance when we were in Vegas. The food was excellent! We ordered Kurkari Bhindi, Mutter Paneer, Garlic naan and rice. Everything was excellent. The bhindi was spicy and tasted great. The Paneer was rich and went well with the Garlic Naan and rice. The only reason i'll dock a star from this place is because of the service. Although initially, we didn't; have any issues with being seated and all, the service slowed down throughout the night. It ended with a long wait for the bill after we were done and my drink never really being filled up during dinner. I will definitely go back another time though, and if the service improves next time i'll easily give this place a full 5 stars."
        }, 
        {
            "index": 347, 
            "rating": 1, 
            "review": "Food is Overpriced but very poor quality . Chicken was reused from morning an lamb was old and not properly cooked . I would not recommend this place for the money. \n\nBuffet is $19 which covers only basic items"
        }, 
        {
            "index": 348, 
            "rating": 5, 
            "review": "Must Try!! I was here in March. On my second visit and it is just as amazing as the first time. Ask for Kumar he's awesome. Great food and atmosphere that's tucked away Ina inconspicuous shopping plaza. Try the classic curry chicken w/garlic naan. You'll be day dreaming about it!"
        }, 
        {
            "index": 349, 
            "rating": 4, 
            "review": "Very nice selection of fresh Indian food. We ordered mainly vegan items and they were packed with fresh that vegetables. Very nice service. A good alternative to the madness of the strip or just eating every meal in your hotel. Most of the clientele appeared of Indian/Pakistani  descent and therefore they know a good place when they see it!"
        }, 
        {
            "index": 350, 
            "rating": 1, 
            "review": "VEGETARIANS BEWARE ! \n\nTamba serves meat in Vegetarian Dishes and does not even care to apologize.\n\nMyself and four friends visited Tamba for lunch buffet on Jan 18, 2015. While having our buffet lunch, I realized there were \"chicken pieces\" in \"Sambar\". I thought it was just my bowl of Sambar , NOPE all my four friends also found chicken pieces in their Sambar bowls. (Sambar is a South Indian dish made with lentils and vegetables)\n\nPlease see the pictures attached as proof. (go to photo gallery of this restaurant in yelp in case you do not see it along with my review post)\n\nI was SHOCKED and called the waiter to show our Sambar bowls with chicken, he neither was apologetic and said he would check and get back.\n\nAs I did not see the waiter come back for a while, I walked to the elderly person I believe he was the owner of the restaurant and explained him the issue with chicken pieces in Sambar. \n\nTo my utter dismay, instead of being apologetic he raised his voice and was acting shocked saying that he himself set up the Sambar dish in the buffet.\n\nBeing an Indian, with respect to elders (here the owner of the restaurant) I continued to be polite and informed him that it is a SERIOUS OFFENSE. One cannot serve a vegetarian dish with meat in it, if it does have meat they need to highlight in the description of the dish in buffet table.\n\nHe continued to raise his voice and was defending himself, whereas I was trying to be polite and making sure that this NEVER happens. I pity the vegetarian customers who ate their lunch with Sambar earlier in Tamba on same day.\n\nThis elderly person continued his arguments and in no ways was apologetic and instead was saying someone else would have done that. Whatever might be the reason one cannot serve meat in a pure vegetarian dish.\n\nWhile he continued to defend himself in a high pitch voice, the customers around that time stopped by and were shocked to know about Sambar having chicken pieces in it.\n\nFinally, the waiter intervened, took this hot headed elder person away and they removed the Sambar from the buffet menu.\n\nNeither the Owner nor the waiter offered a sincere apology for their GRAVE mistake.\n\n*** At the end, I would like to WARN all VEGETARIANS who visit Tamba restaurant to be careful when eating any dish they serve. ***\n\nI am glad my wife was not around with me for lunch buffet on that day, she is a vegetarian. It would have been a life time regret for her."
        }, 
        {
            "index": 351, 
            "rating": 3, 
            "review": "The food was good, not great. I have definitely seen a better spread for an Indian buffet,  but considering it's location on the strip , the quality of food and the price, it's definitely worth a trip, especially of you're craving spicy vegetarian food."
        }, 
        {
            "index": 352, 
            "rating": 4, 
            "review": "Do you know how hard it is to find vegetarian food in Vegas??? I didnt think it would be that difficult, but turns out all people want to eat when they gamble is crab legs and steak! After walking forever and searching endlessly on Yelp, FINALLY we found vegetarian food! They have some meat items like chicken tikka masala, but tons of veg options (at least in the lunch buffet).\n\nThe idly are fluffy and the sambar is very good. The paneer was mostly missing in action and not very good when it was to be found, but the halwa was delicious!!\n\nGiven that it was lunchtime, I'm shocked that this place wasnt more crowded. In fact, there were only a couple other patrons there (They are kind of tucked away). Cheapest buffet ever! It was small, but only like $13 and had many good options.\n\nTo find it- just follow the signs, and they'll lead you into some weird sliding glass doors of a deserted looking building. Then go up some escalators and you're there!"
        }, 
        {
            "index": 353, 
            "rating": 5, 
            "review": "Looking for someplace to eat around 9pm and stumbled across Tamba.  Looked it up on Yelp, and decided to check it out based on the reviews.  It wasn't crowded at that hour, but there was a steady stream of customers, many of them India.  \n\nFood was great - lots of great choices at the buffet.  Filled my plate before getting to the meats.  At first was dismayed, because I didn't want to waste food, but I put away the first round in no time and headed back for the vindaloo I missed the first time through.  Yum!  \n\nNot sure when I'll get back to Vegas, but if I do, Tamba will see me again for sure.\n\nNote: I'm not an Indian food expert.  We don't have many Indian restaurants in Hawaii, but what I tastes at Tamba I really enjoyed."
        }, 
        {
            "index": 354, 
            "rating": 5, 
            "review": "Great reasonably-priced buffet on the strip.  Not a huge variety, but every dish I tried was great.   Chicken tikka masala, chicken curry, paneer makhani, yellow lentils, aloo mutter, etc.  Spicy and perfectly seasoned.  Highly recommended!!"
        }, 
        {
            "index": 355, 
            "rating": 5, 
            "review": "It was a great restaurant. It was decently priced and excellent food. The decor was inviting."
        }, 
        {
            "index": 356, 
            "rating": 5, 
            "review": "So, to begin with... I only found this place because my husband and I happened to be walking along the strip and glanced in the right direction. We LOVE Indian food and decided to try this place out. Man O man am I glad we ate here!!! It's Delicious!!\nHeres what I liked the best about this place: It's buffet style; all you can devour.\nThe service Fantastic. Everyone working here is attentive and helpful. So quick to clear old plates and fill drinks! Love that! \n\nWe've eaten at many Indian food buffets and have never had a selection of this size. \nThe atmosphere is calm, inviting, romantic and clean. \nThe food: Are you vegan? If so, this is the place for you. There are several vegan options. Like meat? The butter chicken is perfectly made and the Tandoori chicken is to die for!!! \nCome to this place! You will be so happy you did if you Love Indian food. Enjoy!!"
        }, 
        {
            "index": 357, 
            "rating": 5, 
            "review": "Best indian lunch buffet in town. Very good value, too!"
        }, 
        {
            "index": 358, 
            "rating": 3, 
            "review": "The food was delicious...the service was not.  I'm not sure if our Asian (perhaps philipino) waiter did not have strong English but he would not take my order to switch the paneer for veggies.  I asked if the paneer in my dish could be substituted for veggies and he kept trying to convince me to get a completely different dish.  It was VERY frustrating I've never dealt with that before.  Finally I became extremely irritated and told him to go ask because that's all I wanted. Sure enough I got what I asked for which restaurants are usually very accommodating about so I figured he was just a bad waiter."
        }, 
        {
            "index": 359, 
            "rating": 3, 
            "review": "Nothing special..decent seating, good service, nothing extraordinary about the food. It tasted like any average Indian place, but I don't have high expectations from an Indian place in las vegas! \nWould I go there again? Yes"
        }, 
        {
            "index": 360, 
            "rating": 5, 
            "review": "I have never tried the sit down dinner menu, but I am a huge fan of the all you can eat lunch buffet for $12.95! \n\nGreat environment and very clean....Yum Yum for Tamba!"
        }, 
        {
            "index": 361, 
            "rating": 4, 
            "review": "Ambience - Although the entry to the Hawaiian market place isn't impressive,  the ambience inside the restaurant is great !\n\nService - excellent.\n\nStarters - aalo Tikki choley chaat was one of best I have had ! \n\nEntree - mutter paneer was good. Looked freshly made, light ( not the usual greasy gravy)\n\nLiked the place !"
        }, 
        {
            "index": 362, 
            "rating": 4, 
            "review": "Its a good place to get ur dose of Indian food when in Vegas. Its almost in the middle of the strip. They had a dinner buffet going on when we went their. They had really great samosas and biryani. They even gave us complementary drink with the buffet. Would surely satisfy indian taste buds."
        }, 
        {
            "index": 363, 
            "rating": 4, 
            "review": "Good place to eat if your looking for decent Indian food on the Vegas Strip. \n\nThe ambiance and service was very good.\nThe food tasted more like homely....it was good but not great. \n\nWill visit again"
        }, 
        {
            "index": 364, 
            "rating": 4, 
            "review": "The food was OK and the service was meh. The ambience seemed to be confused more than anything.  There's a bookshelf in the restaurant that didn't belong. The servers all need a course in what it takes to do the job."
        }, 
        {
            "index": 365, 
            "rating": 1, 
            "review": "My cousin has nut and cashew's alergy and even after informing them about the same atleast 5 times, they still made a mistake and added cashew in it. Luckily nothing happened to him , but we literally had to run and gave him medicines before anyrging happen to him. Owner even though understood our language, never came to our table once. 25% discount doesn't solve the problem. \n(Ideally, they should have made whole order free, but   I am not going to argue for that). \n\nAlso, they add lots of food color especially in paneer curry . Please be aware of that..!! My wife also had allergies due to that afterwards :( :(.\n\nGiving 1 star because service wasn't too bad. Servers and Manager was not as good as thry should have been in mistake they made, but that s fine.\n\nI dont know , if they take this seriously or not, but from now onwards, anytime I am in Vegas, this restaurant will be my last option..!!"
        }, 
        {
            "index": 366, 
            "rating": 5, 
            "review": "I've been to Tamba many times over the last few years but this year, I found the place had been renovated and the food choice and especially the food quality were outstanding! This was amongst the best Indian meals I've had in the US. And I say this as an Indian who's tried dozens of Indian restaurants across the country and certainly all in the Las Vegas area. Tamba's location on the strip and its reasonable pricing are both a big plus too."
        }, 
        {
            "index": 367, 
            "rating": 2, 
            "review": "Lunch buffet...poor tasting food.. they tried to cover the taste w spiciness.. would not recommend"
        }, 
        {
            "index": 368, 
            "rating": 3, 
            "review": "Good food at a reasonable price. The staff was friendly but the place is a bit stuffy- the tables were all crowded together. For people craving for Indian food esp veggies.. Can go and give it a try!"
        }, 
        {
            "index": 369, 
            "rating": 5, 
            "review": "Good food. Very nice ambience and dinner options are great.\nVegetable biryani is different"
        }, 
        {
            "index": 370, 
            "rating": 5, 
            "review": "When I headed off to Vegas for the weekend with two of my girlfriends, we had planned our dinners out a week before.  Because we are nurses and therefore love to eat.  Two of us are Indian food junkies and knew we'd need a fix while there.\nGreat choice in picking Tamba!  We had made reservations for Thursday night at 7, but didn't need them b/c the place was dead when we got there.  It picked up as the night went on, but I think the location (hidden in a building behind the Hawaiian market) makes it a tough find.  We both ordered entrees instead of the buffet.  She ordered a chicken curry and I ordered the eggplant dish.  Both oh-so yum with excellent spice and seasoning.  We also got rice and naan to split, and a $30 bottle of wine.  Our total damage?  About $60.  Cheap for Vegas, huh?\nDecor was nicer than the usual Indian restaurant, dim lighting, and I liked the way the restrooms were decorated.  No loud Bollywood music videos playing here.  And it's always a good sign when most of the customers are Indian families!\nOur cheapest and BEST meal of the trip."
        }, 
        {
            "index": 371, 
            "rating": 5, 
            "review": "Stopped in for dinner buffet and every single thing was delightful! Really good sauces and flavors, would highly recommend. Lots of vegetarian options."
        }, 
        {
            "index": 372, 
            "rating": 5, 
            "review": "Amazing food! Amazing service and reasonable price for being on the strip..\nWent there twice in a week stay in Vegas.. :) Loved it.."
        }, 
        {
            "index": 373, 
            "rating": 5, 
            "review": "My Vegas trip isn't completed until I visit Tamba at least once. Having lived in India as foodies for 20 yrs i can say that this is undoubtedly the BEST high-end Indian restaurant in the city. The food isn't loaded with spice... and the ingredients are fresh and aromatic. Been here couple of times whenever I visited Las Vegas.  To begin, this is a fine dining experience & the ambiance is good.  Brilliant food, brilliant service and a wonderful atmosphere! The waiters were very friendly. The atmosphere is very calm, perfect for a dinner after sunset. The food is a perfect replica of authentic indian food, and the most real indian food you'll find in Las Vegas possibly in even The whole west coast. The menu is vast and full of variety. Can be a perfect setting for a romantic or group dining. For all veg/ Non-Veg eaters, I recommend you should try their signature dish because you will be blown away, trust me. What else can you ask for. Definitely one of the best Indian restaurants in town.  A special note to Mr. Rishi Kappor ( GM of Tamba ) \n\" It was a tremendous experience dining at your restaurant. Thank you so much for your outstanding professionalism and warm hospitality shown to us. The service and food quality was excellent, a credit to you all. Thank you for a most enjoyable evening.....God willing I will return some day soon, rest assured that your business cards will be passed along, so thanks again and a hearty CHEERS!! \""
        }, 
        {
            "index": 374, 
            "rating": 5, 
            "review": "Very friendly and humble staff.  The place is a hidden gem in vegas.  They have an amazing ambience and a huge variety of dishes in there buffet.  We came in just for chai and walked into the place and we were very impressed."
        }, 
        {
            "index": 375, 
            "rating": 3, 
            "review": "I was very happy with my 1st visit so i went for lunch buffet on my second visit in Vegas. They have variety of food in vegetarian and non vegetarian too. Moreover, they also have few South Indian dishes in buffet. Usually in buffet you get served with fresh bread called'NAAN'. But they just put it in buffet and it was dry, hard and cold.\nOne more thing is that they might have contract with Thomas cook or some other travel agents so they bring their travellers during lunch time. So it's all crowded and mostly you have to rush to get the food and especially South Indian since most of them were South Indians!\nIt's bit pricy compare to the food and service!"
        }, 
        {
            "index": 376, 
            "rating": 1, 
            "review": "The only good this about this place is that its located right at the strip. buffet was very below average, I will not chose this place at first."
        }, 
        {
            "index": 377, 
            "rating": 3, 
            "review": "should have more options for that dinner buffet price. food was nice, right in middle of the strip was a plus which tempted us to visit this place"
        }, 
        {
            "index": 378, 
            "rating": 1, 
            "review": "The manager does not understand common etiquette of reading out the order to confirm. He got it wrong and then comes back to fight.\n\nFood had too much salt."
        }, 
        {
            "index": 379, 
            "rating": 2, 
            "review": "Bad food, flavorless indian food and i have almost always had better. I think survives because of the tourist crowd in Vegas.\nI went for the lunch buffet and I found that the pakoras were without spice and a little soggy, sambar was lacking salt and tamarind, chicken was overcooked and the bread was rubber like. At $14, that is indeed a waste."
        }, 
        {
            "index": 380, 
            "rating": 4, 
            "review": "Great food..We tried their Vegetarian dishes and food was really awesome. Would love to go there when I am in Vegas next time"
        }, 
        {
            "index": 381, 
            "rating": 1, 
            "review": "The lunch buffet was really horrible and pricy. \n- nothing was tasty and most of them were salty\n- they dont serve naan on table \n- no goat curry :(\n- low quality rice\n- not much option in main course or desserts \n\nI was really disappointed at this place. I guess they are still in business only for the location."
        }, 
        {
            "index": 382, 
            "rating": 5, 
            "review": "We loved Tamba! We love Indian food and are vegetarian, but don't have an Indian restaurant in our town. So when we travel we usually go Indian. We've been out in Paris, London, San Francisco- and Tamba was as good as all our favorites! We'd never had Samosas Chaat which was exquisite (samosas with special toppings).  We have two boys (10 and 14) and all four of us were trying to plan how to go back when we could on our stay here. We had dinner one night (ordered off menu) and buffet two days later for lunch- both times it was awesome. Lunch is less expensive of course. We tried several new dishes in the buffet and we all loved everything.  We lamented our shows all started at 7pm and they didn't open until 6pm for dinner :( but we found a way to get there for lunch! The service was outstanding- a super classy place tucked away in an odd little location. Well worth searching it out! ;)"
        }, 
        {
            "index": 383, 
            "rating": 5, 
            "review": "Best indian food on Vegas strip and the employees are pretty friendly. Must visit."
        }, 
        {
            "index": 384, 
            "rating": 1, 
            "review": "The food was ok but the service for the lunch buffet was pathetic! My wife and I wanted the buffet and take out for our son. The manager or owner said they could not do anything, no take out boxes, no orders to go since they have a large catering order. Also during the buffet, not one staff member came to ask if we wanted to have any drinks. Will not want to come back here again, ever!\nI think their business is only alive by Tory traffic and catering orders. The mall also is dead. I feel sorry for the staff who seemed really de-motivated, while cleaning the tables the dropped the salt shaker, and another one dropped water taking plates and glasses from the tables, pretty shabby!"
        }, 
        {
            "index": 385, 
            "rating": 5, 
            "review": "Great food- just like what you'd eat at your grandmothers house. Staff is energetic and super helpful!"
        }, 
        {
            "index": 386, 
            "rating": 2, 
            "review": "Came here because it was on the strip. Proved to be an absolutely mediocre restaurant. The buffet choices for vegetarians were horrible. The food tasted OK hence the two stars otherwise I'd given one star. \n\nDon't get the mango lassi. It's basically mango juice. When I confronted the server he said that it's how it's made which leads me to believe the staff is misinformed regarding their own cuisine and not accommodative."
        }, 
        {
            "index": 387, 
            "rating": 4, 
            "review": "Certainly above average. Great selection on the buffet. Good for vegetarian. Best part is that they are easily accessible but far enough from the strip to be a nice and easy escape from the crowds."
        }, 
        {
            "index": 388, 
            "rating": 5, 
            "review": "The food here is great, recommend the chicken masala   it was so lovely. Overall I would highly recommend a visit to this restaurant, would deffo come here again.  Kumar gave us very good service and made sure all our requests were seen to. Kumar really good !!!!!"
        }, 
        {
            "index": 389, 
            "rating": 3, 
            "review": "My friend was looking for a place to fit her new diet for a girls night out on the strip, and this is what she found. I had never really been into Indian food before, but not trying it and having other places, this place is pretty good. The service is good if you're a bunch of girls...haha. There are a couple of waiters that the girls lust over, so they definitely pay attention to us when we come in. The service has been delayed in that regard, but only delayed with us getting the check. \n\n I've been there for the buffet and I've ordered individual dishes. I love every dish I've had with chicken in it. I don't usually like curry to much, but I love the curry dishes here. I usually get 7-10 on the spice level as well. There are also a lamb dish that is amazing, which is best spicy. I think most things are best spicy. \n\nThis is a great place to go on the strip for Indian food, and if you have a large group. They also have a back room that people seem to use quite frequently for large parties."
        }, 
        {
            "index": 390, 
            "rating": 5, 
            "review": "This place is excellent in many ways. \n\nHusband went exploring the strip while I of course slept in. He discovered Tamba and brought me their card knowing that I love Indian food. \n\nWe walked from the MGM at about 9:00 which is a pretty weird scene. The mall is empty except for this restaurant. \n\nThe restaurant was about 3/3 full with more than 1/2 of the people eating there Indian or Pakistani. \n\nWe ordered on basmati rice, 2 naans, 1 began bharta and 1 matter paneer. ALL excellent, literally the best roast eggplant curry I have EVER had. They roast the eggplant in their Tandoori oven which adds a smoky flavor. The texture and heat were just right.  Paneer was perfectly made.\n\nThe portions are more than twice the size of what I normally get here in San Francisco/Bay Area.\n\nPricing a bit higher, but it is Vegas and 10-12.00 a dish is not unreasonable. \n\nWaiter and hostess and bus staff were all very nice and efficient."
        }, 
        {
            "index": 391, 
            "rating": 4, 
            "review": "A lot of mixed reviews here! We have been here twice on different trips (once for dinner and once for Sunday lunch buffet) with a group of 6 and all of us enjoyed our meals both times. Yes the service is lacking with odd waiters who could use a few lessons in good manners but the food was always delicious. \n\nFor dinner, highly recommend ordering pani puri to start with. The puri was crispy and the pani perfectly made. Also don't miss out on the lamb chops! Weird to order at an Indian restaurant but honestly they were incredible. We kept ordering more and more plates because we just couldn't stop eating them! Oh course we tried all the stables, butter chicken, chicken biryani, paneer tikka, palak panner, garlic naan and raitha. Everything was delicious and nothing was left over. The dishes are kinda on the small side so it's good for sharing and trying a bunch of items. \n\nOk, so this lunch buffet is pretty extensive and basically has everything your hungover tired body needs--samosas, upma, uttapam, idli, sambar, kadhi, naan, fish curry, chicken like 5 different ways and everything in between.\n\nDefinitely give Tamba a try and be your own judge :)"
        }, 
        {
            "index": 392, 
            "rating": 3, 
            "review": "Tucked away in a quiet part of the Hawaiian marketplace, this little gem is a perfect spot to escape the hustle and bustle of the strip. Just steps from the actual strip, the lunch buffet offers a great value and authentic Indian fare."
        }, 
        {
            "index": 393, 
            "rating": 1, 
            "review": "I'm not too sure what is going on here. I looked at this restaurant's Yelp profile and it lists their hours 11:30 -3pm for the lunch buffet after getting back from Vegas. According to the profile they are supposed to reopen at 6. We went here around 4, not knowing what their hours were and they were of course closed. On the business hours listed on their door there was no mention that they reopen at 6. Otherwise we would have held off and waited. In a city that never sleeps it makes sense that they have the hours posted on Yelp and not what we saw on the door when we tried to go in and dine there!"
        }, 
        {
            "index": 394, 
            "rating": 4, 
            "review": "Our friends were feeling Indian, so we came here to this Indian restaurant. This is located in the Hawaiian Marketplace between the MGM and Planet Hollywood filled with many vendors and eateries so it may be hard to find. Going inside the building where this restaurant is located was kind of creepy because it was super empty! However, going inside the restaurant, we saw multiple patrons enjoying their food and the atmosphere proved to be very cool and modern. \n\nI shared an order of Malai Kofta and Chicken Tikka Masala with my bf, because we were hungry but not super hungry...? Hahaha what does that mean I don't get myself... anyways both items were really good... my boyfriend and I gobbled both of them up! Portions were pretty big compared to other Indian restaurants I've been to... also their bowls are pretty cool (they were shaped like a spoon? You have to see it, I can't really explain the weird shape right now) but need to be handled to great care as you can easily spill whatever item on your pants (like my boyfriend on his favorite khakis... RIP favorite khakis).\n\nWaiters here were pretty friendly, cool, and funny. What I liked was that they kept filling up my water! It's like they know me... they know I need to quench my thirst.\n\nOverall, a good time having Indian food here in Vegas! I definitely would come here again for some Indian food. Enjoy!"
        }, 
        {
            "index": 395, 
            "rating": 4, 
            "review": "Went here for the lunch buffet. This is only the second Indian buffet I have ever been to and it does not disappoint. The butter chicken was my favorite. The chicken was tender and the sauce was tasty and had a nice spice to it. I also got the mango lassi drink. It tasted like a mango sorbet. It was a bit sweet but still good."
        }, 
        {
            "index": 396, 
            "rating": 5, 
            "review": "Great place. Great Service. Plan on trying their buffet tomorrow.\nThey always come around asking if you need anything.  \nKumar was great."
        }, 
        {
            "index": 397, 
            "rating": 4, 
            "review": "Pretty darn good Indian food. My only complaint would be that we weren't asked how spicy we wanted our dishes and thus our chicken masala was just a little spicier than I would have desired.  The restaurant is located inside a semi-derelict mall , so it is a little hard to notice from the street. The service was very good."
        }, 
        {
            "index": 398, 
            "rating": 1, 
            "review": "I am still thinking about pricey $40 (Dinner for 2) I paid Saturday night. Though the ambiance was good, I thought it was a rip off.  I was asked to pay in advance even before eating! - this is a good hint to save you from being ripped later.\n\nBeing a vegetarian, the only item I liked was Dal. Half way through my dinner I encountered a messy situation in the restroom, which spoiled my mood for the rest of the dinner. When I complained about the restroom to the manager, he was very condescending with me. He thought this was the best Indian restaurant ever. I did not like the arrogance he displayed. \n\nI will not go to this place again! \n\nI would be happy if I get my $40 check back from them. Even now, I think about this money as a waste."
        }, 
        {
            "index": 399, 
            "rating": 3, 
            "review": "So the 1st thing would be that as soon as we walked up to the restaurant, the hist told us that its $20. Without even us asking what the menu was, what we were looking for etc. He just saif pay $20 for the buffet.\nThe buffet itself was OKish.Not too many options. Just the basic paneer, chole for veg and butter chicken and tandoori chicken for non veg. The cutlets were cold. The chicken biryani was pretty good. \nOverall, average is the word that comes to mind."
        }, 
        {
            "index": 400, 
            "rating": 4, 
            "review": "Found this gem right on the strip. I ordered the aloo gobi, garlic naan and gulag jamun. Can I just say they get an extra star for all the damn garlic they put on their naan!?!?! I enjoyed the aloo gobi, and they gave me a huge portion. Idk how they even fit the lid on because it was practically overflowing. It was convenient to get to because it's right next to MGM. There is a place to sit and wait right outside the restaurant. The food came out quickly as well. This food just really hit the spot and it was great left over food when I had the munchies."
        }, 
        {
            "index": 401, 
            "rating": 3, 
            "review": "Service was slow, felt unwanted in the restaurant. Food was decent but again the service left a \"meh\" taste in my mouth.  I found a decent Indian place at the end of my trip with great service and amazing food.  Hope you all have a better visit."
        }, 
        {
            "index": 402, 
            "rating": 4, 
            "review": "My boyfriend and I tried this place late in the afternoon and it was pretty empty. The buffet was stocked and refreshed while we ate and we had good service being seated and at the table. I found the food flavorful and enjoyed everything I tried (which was a little of everything!). The restaurant was romantic and we were able to have some great conversation. I would love to come back here."
        }, 
        {
            "index": 403, 
            "rating": 4, 
            "review": "Food was really good . Always enjoy Indian food when I come to Vegas . The rice in the buffet had become hard, but they replaced it for us."
        }, 
        {
            "index": 404, 
            "rating": 2, 
            "review": "Had come here about 8 years back and really liked the food and ambience. This time the experience was not at all good. Out of the blue they decided to not have a la carte menu and only had buffet. The reason was that they had a tourist group and hence no a la carte menu. We had walked all the way with kids so decided to go ahead with the buffet anyways. The ambience was just horrendous, people were loud and very ill mannered. They probably should have closed the restaurant for the general public. The only consolation was that the food was good."
        }, 
        {
            "index": 405, 
            "rating": 5, 
            "review": "I am staying at a hotel off strip and so I tried two off strip Indian restaurants and Tamba on the strip, all for lunch buffet. Food at Tamba was hands down the best, even though the most expensive, but not by much. All vegetarian dishes were very flavorful. Decor also improved from 2 years ago when I last visted them. It was also the only restaurant of the three where I saw Indian customers, for what is worth."
        }, 
        {
            "index": 406, 
            "rating": 5, 
            "review": "It was so delicious!! We can't wait to come back! I had the chicken korma. Our server was Kumar and he was delightful! We celebrated my husband's birthday. Yummy! We will be back soon!!"
        }, 
        {
            "index": 407, 
            "rating": 4, 
            "review": "Tamba was my first Indian food experience.  I went here for the the first time a few months back for dinner, and I would really like to go back again.  It's kind of hidden all the way in the back of the Hawaiian Marketplace, but the  food is really good!  I tried the Murg Biryani, which was a very flavorable chicken & rice dish with nuts and raisins! My favorite part would have to be the raisins...it gave the dish a very surprising sweetness to it!  I also had a sample of my friends' Chicken Korma curry and Tandoori chicken, which were both good as well.  I would love to go back and try more different dishes!"
        }, 
        {
            "index": 408, 
            "rating": 5, 
            "review": "From a gori \nThis restaurant changed my mind about Indian food.  I'd tried Indian twice before and hated it.  My bf (who is from Mumbai) persuaded me to give his nationality's dishes one more shot.  \nMost people go to Indian buffets (a cheaper and pretty good option) but I went initially to a normal meal.  I loved it!  The butter chicken melted in my mouth and I was ravenous after the chutneys.  \nI'm converted.  I love Indian food now thanks to Tamba.  \nnote:  Although technically on the Strip, it is isolated from the crowds and meets a steady stream of repeat customers."
        }, 
        {
            "index": 409, 
            "rating": 3, 
            "review": "Middle of the grade food. Went there with a large group for the lunch buffet. Watch out! The strip mall where they reside is actually a ghost town with this the only establishment that's viable. \n\nBut once you get past that, the food is a solid \"B grade\". Stay away from their tandoori chicken or the \"paalak paneer\" gravy dish. My friends had a \"difficult afternoon\" shall we say mildly after the meal. \n\nThey also refused to split the bill amongst the 13 of us who wanted to pay separately on our credit cards. The person serving us \"suggested\" that we charge it on one card and deal with splitting the bill ourselves in a not very polite way."
        }, 
        {
            "index": 410, 
            "rating": 5, 
            "review": "Second time to Tamba. It's friggin' awesome!\n\nSarah and I first stumbled upon this charmer on our 2009 Vegas trip after falling out of the Luxor and walking a hangover off.  \n\nDeep inside the Hawaiian Marketplace where even the KFC failed and shuttered it's doors lies Tamba, the lone restaurant in what at one time was a glorious food court. \n\nUp the escalator and inside, you get a whiff of the buffet and hear the soft and trendy music. The perfect sound track for the inevitable food coma that the awesome buffet is about to give. \n\nLoved this place so much the first time we skipped the Indian spot across from our hotel and drove straight to Tamba. \n\nTamba in 2010. Tamba in 2011 too I'm sure!"
        }, 
        {
            "index": 411, 
            "rating": 3, 
            "review": "This was decent Indian food, it was especially welcoming in Las Vegas where it seems like you pay out the nose for mediocre food ( so they would get 3.5). We ordered a sampler platter, garlic naan, chicken tandoori and fish masala. The chicken and garlic naan were very nice. The platter was also tasty for a group appetizer. \nAsk for Kumar he's a sarcastic waiter who may make you laugh. Check-in and you may get a 10% off food coupon for lunch or dinner. \nThe decor is also quite nice, very calm dinner environment. It also had several Indian families as customers, which seemed like a great sign to me. We ordered a bottle of Cabernet wine and it was about $35 per person not bad for the strip."
        }, 
        {
            "index": 412, 
            "rating": 4, 
            "review": "Overall good place..Here are some points\n\nPros\nGood food,Great taste.\nNice ambience.\nLocated at Strip.So you can probably walk from Paris or Planet Hollywood.\n\nCons\nQuantity is not much..Chicken biryani quantity was not sufficient.\nPricy..Slightly pricy.."
        }, 
        {
            "index": 413, 
            "rating": 2, 
            "review": "Very customer friendly and generally good people, but one of our guests threw up an hour after eating here. Won't be coming back, but I wish them the best."
        }, 
        {
            "index": 414, 
            "rating": 4, 
            "review": "Authentic Indian food on the strip. We headed to this place before starting the ride back to San Diego.This restaurant is tucked on the second floor right behind the all the shopping cabanas.\n\nThere were a complete of options for veg and non veg appetizers and main course at the buffet during the lunch. Tried the Sambhar(Lentil Soup), Idli(Rice cakes), tandoori chicken for appetizers. For main tried the Chicken curry, Chole (chick peas) with naan and rice. The food was really nice and everything was fresh. Though desert was a disappointment."
        }, 
        {
            "index": 415, 
            "rating": 5, 
            "review": "Best Indian food I've ever had!! The lamb is to die for and our server Rishi was amazing. A must go if your on the strip."
        }, 
        {
            "index": 416, 
            "rating": 1, 
            "review": "We ate on  a Wednesday  in mid May to Tamba during our vacation. Service  of Tamba is poor. It took over 2 hours to get the meal after they took the order. Quality  of food  and quantity of food is  below average. Our Naans were  not evenly cooked properly.  It was a disappointment for the money we spent. They must improve or they will go under. \n\nNext day, we ate dinner Buffett  in Aria  on the strip across from Tamba.  They have Indian Tabdoori food in buffet menu and many others high quality items such as crab,  sea food, deserts, Asian,  American and Italian food.  For what we spent  in Tamba, we  got many times  the value and top service that of course one can expect from a five  star hotel.  I will like to patronize  Indian food but I will recommend to explore other choices that offer Indian food and Tandoor dishes such as served in Aria hotel and casino."
        }, 
        {
            "index": 417, 
            "rating": 3, 
            "review": "Good food. We tried there Dal and Baigan Bharatha it was very good. Panner was ok. I am not big fan of Paneer anyways. \n\nI will go back here if i am in town. No cocktails on menu"
        }, 
        {
            "index": 418, 
            "rating": 5, 
            "review": "My friends and I were walking down the strip really hungry and we had no idea what to get until we saw Tamba.  The restaurant is kind of hidden in a shopping center,  but I'm glad we found it. Great service and great food! I got the buttered chicken with rice and garlic pita bread soo good!"
        }, 
        {
            "index": 419, 
            "rating": 2, 
            "review": "I ate here once for Valentine's Day dinner. The image I gleaned from their website made it appear to be all plush pillows, flickering candles, and meditating statuettes. \nThe internet can be so deceiving. \nFirst of all, the chic dining area they prominently display on their website, which is (and I quote), \"designed as a hipster hangout and features plush seating beneath the striking murals of international artist Farhad Elahi\" is their reserved banquet dining room, tucked far away in the backend of the restaurant. Regular parties eat in a much less interesting and unromantic dining space, complete with standard tables and chairs. I suppose the general vim of this spot is acceptable for lunch or a casual dinner, but it was V-Day and I wanted to sit on a sexy red pillow damnit! Exacerbating the ambiance situation was the food situation. Being adventurous- not to mention gluttonous- we pretty much ordered one of everything. The mulagatani soup was an unremarkably flavorless bowl of pepper and water, while the other Pakistani style dishes were just as boring and lacking in flavor and heat. The service sucked, especially considering it was V-Day. This place is in sync with the line of reasoning adopted by its sister restaurants around the valley (Gandhi's and Gaylord's), in that hiking up your prices and offering a wine list somehow makes you less of a mediocre North Indian/Pakistani spot and more of a, and I quote, \"hipster hangout.\" Next please."
        }, 
        {
            "index": 420, 
            "rating": 1, 
            "review": "Visited this restaurant on 4/12/09 for lunch and had their buffet. Food was horrible, not fresh and presentation was equally bad. This restaurant gives bad name to Indian cuisine. I am surprised Las Vegas (with some excellent restaurants) does not have a single top quality Indian Restaurant."
        }, 
        {
            "index": 421, 
            "rating": 1, 
            "review": "It was the worst Indian food I ever tasted in my life... It's a shear waste of money. The food was highly unpalatable and the restaurant should never be called as INDIAN Restraurant. This restraurant not even worth to be rated."
        }, 
        {
            "index": 422, 
            "rating": 1, 
            "review": "I was excited to discover an indian restaurant bang in the mid of the strip. But is a disappointment. They only have Buffett for $20 and no Ala Cartè menu. The restaurant has huge seating area but the problem is they have just one small Buffett bar which makes the bar really crowded. One literally has to fight for the food. In a Buffett it is advisable to have breads served fresh on the table but they had it in the bar..cold and old. Any good - no! They are just making money because of their location."
        }, 
        {
            "index": 423, 
            "rating": 4, 
            "review": "Great food, love the fact that some of it is from south India.  Decor is nice, they have a really big lavish room in the back as well as a spacious dining room and \"patio\" seating. Service was good, their ice tea is super good, and the bathrooms are really cool. (I'm a sucker for nice bathrooms)  ALSO, you can get free parking with this place.  I'm sold. It is, however, in the back of a deserted strip mall, but if you can get over that its a good place to visit.  \n\nI have to say, the food made it all and the food was stellar!!! Great amount of vegetarian choices spiced just right and with a perfect amount of kick.  Nothing was bland, and everything was presented beautifully.  Really great place! I'll stop by here again next time I'm in Vegas!"
        }, 
        {
            "index": 424, 
            "rating": 4, 
            "review": "Don't be confused with the name tabla mentioned on the first floor of the building its renamed as  tamba \nThey only serve buffet at lunch time but it's good.\nThe service is also excellent all the servers are always smiling and polite.\nWorth a visit had vegetarian food at the buffet"
        }, 
        {
            "index": 425, 
            "rating": 3, 
            "review": "It's difficult to find restaurants that are unique and not homogenized and typical Vegas style Americanized offerings. We were in the mood for Indian and with the help of the Yelp app, found this place and quickly made a reservation through opentable. The reservation wasn't really necessary since upon arrival, there were plenty of tables available. \n\nWe were seated and it took much longer than necessary for any of the servers to acknowledge us and provide menus, drinks, etc. I think this was because there was a large party in the back room which occupied their time. This party also had a buffet setup that contained some of the most unique and appetizing Indian food I had ever seen. Unofortunately it was not open to people outside of their party. Shucks!\n\nThe food was decent and the price was ok. I was glad that we had the opportunity to not eat in another casino buffet or chain restaurant. If you like Indian, check this place out."
        }, 
        {
            "index": 426, 
            "rating": 5, 
            "review": "Don't let the location distract you, this is a real gem! \nWe had the chicken tikka masala and the butter chicken both were great!\nThe mango lassi was very tasty too.\n\nI would strongly recommend you leave the standard food on the strip and enjoy this place!"
        }, 
        {
            "index": 427, 
            "rating": 4, 
            "review": "Very good North Indian food.Tried buffet on a saturday. All vegetables were good. Aaloo tikki was awesome. Will definitely come again. I am giving 4 stars as  paneer  got over cooked and they could have done better job."
        }, 
        {
            "index": 428, 
            "rating": 5, 
            "review": "We had great food and service from Anand.   He had great recommendations and was thoughtful about the timing of everything. We ordered a chicken tikka korma and the aloo gobi. Both were delicious and one of them was off the menu. The tamarind sauce was great. Ambiance was good - the entrance to the mall is off putting but once inside its very comfortable."
        }, 
        {
            "index": 429, 
            "rating": 1, 
            "review": "Hands down the worst Indian buffet I've ever been to. And to the people who say that you can't expect much from buffet food, you just haven't been to a good Indian buffet. I admit there are some things I've come to expect from an Indian buffet, like that the naan should probably be freshly brought out to the table, rather than wasting away en masse under a hot light. The core of the meal, the proteins, should also not be mystery meat bobbing in a thin gruel of oil and colored sauce. The most edible thing was probably the goat curry, and only because I love me some lamb/goat. There were little signs to help you navigate the curries (as we discovered later), but they misidentified stuff and were hard to read. The place looks nicer than it tastes, fo sho."
        }, 
        {
            "index": 430, 
            "rating": 1, 
            "review": "Don't waste your time or money!!\n\nWe have been coming to Tamba for the past few years, every time we make a trip to Vegas and the food and atmosphere were phenomenal.  There is new ownership and the food is now served buffet style. The taste of the food is only ok. No waiter ever came to our table to ask us about a drink order and I had to flag down someone to clear our dirty plates. Tamba used to be a great place, now not so much."
        }, 
        {
            "index": 431, 
            "rating": 4, 
            "review": "Went here during a conference with some Indian friends. Had a wide assortment of dishes.  Standouts were lamb chop appetizer, lamb vindaloo and okra.  They also had a nice looking buffet which I will try next time.  Great change from the usual Vegas madness."
        }, 
        {
            "index": 432, 
            "rating": 2, 
            "review": "Tamba...Indian restaurant on the strip\nAuthentic and it has spacious dining area. We had been there for lunch buffet and to my surprise I had to pay the bill before you kick off your lunch. There are not too many items when compared to other Indian buffets. \nIdly's.... too hard and totally disappointed (Most of the Indian's hesitate to eat idly's which are not soft...it's my personal comment) \nWe had Pakoda and Tandoori chicken which are fine and I would expect to have more starters.\nChicken curry was the best among the buffet and also tasted couple of vegi curries chole (chick peas) and Dal. \nLittle expensive for such kind of food (It's Las Vegas and won't comment about the cost).\nTotally it was not a great indian buffet!!!"
        }, 
        {
            "index": 433, 
            "rating": 3, 
            "review": "The food was very tasty.  A touch on the spicy side, but that can be expected with Indian food unless you ask for it to be mild.  The setting was beautiful, calm and relaxing.  Most of the staff was wonderful.  Our main waiter paid no attention to our table at all, but the other staff made up for it.  If you want a great beer, try the Taj Mahal!"
        }, 
        {
            "index": 434, 
            "rating": 1, 
            "review": "Worst food. They don't know how to make dal tadka, mutter paneer infact not even masala papad. They should realize idli is not whiskey, the older the better."
        }, 
        {
            "index": 435, 
            "rating": 5, 
            "review": "I know my Indian food as I lived in Fiji for two years and this place is one of my favorites. The food is excellent.  The service is possibly the best I have ever had at a restaurant.  The tomato soup is top notch.  I hit up this place every time I stay on the strip."
        }, 
        {
            "index": 436, 
            "rating": 4, 
            "review": "Friendly and quick service (admittedly very early in their dinner hours so near empty), good food (not the best but no complaints) especially the naan, nice atmosphere inside, and reasonable prices for Vegas."
        }, 
        {
            "index": 437, 
            "rating": 4, 
            "review": "Amazing delicious original food.taste of Indian/punjab.Good courteous staff Good ambience.We have enjoyed food.we ordered vegetarian food like paneer tikka masala.malai kofta with onion prathana and many items. Our group realy enjoyed."
        }, 
        {
            "index": 438, 
            "rating": 5, 
            "review": "we visited Tamba during our vegas trip and it has the best indian place on the strip. the price is reasonable, food was fresh and tasty, service was great too."
        }, 
        {
            "index": 439, 
            "rating": 3, 
            "review": "[ October, 2015 ]\n\nGood food on a strip seemingly-devoid of anything truly ethnic. The buffet looks great and I'll try it next time I'm in town."
        }, 
        {
            "index": 440, 
            "rating": 1, 
            "review": "Worst service of all time. They served, chicken piece in a veg biryani. Server didn't even cared to to apologize. They did waived off the Biryani charges, but it didn't helped us at all. Party was already spoiled."
        }, 
        {
            "index": 441, 
            "rating": 5, 
            "review": "My absolute favorite Indian restaurant in Vegas,  hands down.  Try the tandoori fish,  palak paneer and butter chicken. .. to die for!"
        }, 
        {
            "index": 442, 
            "rating": 3, 
            "review": "Being vegetarian the place had few good options paneer / masala dosa / appetizer and good gulab jamun.\nSome items were stale and i would ask you to avoid"
        }, 
        {
            "index": 443, 
            "rating": 5, 
            "review": "Been here four times over two vegas trips. The food is great!\n\nProbably some of the best Indian food I have had (I'm from Portland, OR).\n\nI highly recommend going for Dinner, as Lunch is buffet-style and there are just so many other great dishes on the full menu that are worth checking out.\n\nDefinitely go."
        }, 
        {
            "index": 444, 
            "rating": 5, 
            "review": "Awesome food & service. Everything we tried was extremely tasty. Great selection of food items as well. I will absolutely be back again, wish I had known about it sooner!"
        }, 
        {
            "index": 445, 
            "rating": 5, 
            "review": "Food was amazing and service was great!  I got a thali dinner (off the menu).   The thail is a sampling of differnt dishes. I got a vegetatian thali option which came with somosas and nana. however, I gave them my gluten-free card explaining my dietary restrictions and they made some great adjustments giving me some other great veggie options and replace my fried carrot dessert with mango ice cream.  Husband ordered a chicken thali plate and love it.  I will be back for more.\n\nBefore posting, went back a second time with friends.  Be warned items on the menu do not come with rice or nana.   It was about $4 for rice, $3 for nana.   Order the thali plate instead, it came with the rice and nana.  Food was still great second time around!"
        }, 
        {
            "index": 446, 
            "rating": 4, 
            "review": "The lunch buffet was very good with many options.  There were three or four meat items and six or seven veggie items.  The naan was excellent and all the items seemed fresh and were very hot.  There were many Indians eating here, which is always good.  They could lose the plastic water cups though, that seems a little silly."
        }, 
        {
            "index": 447, 
            "rating": 5, 
            "review": "Mighty tasty. Service was excellent. \n\nHighly recommended if seeking well prepared indian cuisine. \n\nGreat recommendation from Caesar's Palace Conceirge.\n\nThis really is the BEST Indian food in Las Vegas!"
        }, 
        {
            "index": 448, 
            "rating": 4, 
            "review": "Indian restaurant on Vegas strip. Good Indian food, Restaurant interior was awesome but the shopping center its located inside was very bad."
        }, 
        {
            "index": 449, 
            "rating": 5, 
            "review": "Dinner is amazing!! We loved it so much went back the next day for the Buffett.  It was great but the naan could have been better and we wish there would have been chicken tikka masala but everything that had was excellent"
        }, 
        {
            "index": 450, 
            "rating": 2, 
            "review": "Customer service is worst. The night buffet is worst. The food doesn't look fresh. Recommend not to go there, specially in the night."
        }, 
        {
            "index": 451, 
            "rating": 3, 
            "review": "When I am in Vegas, very rarely  do I wake up in time to have lunch. I have been to Tamba 2-3 times before and always for dinner/pre-dinner. There food has always been good, but the service with attitude has always turned me off. I would not waste my time typing this if it was not for their value for money lunch buffet I had last time. It comes to $15 per person and it has lots of variety. None of the items are truly great, but none are bad too. Now only if they would serve you water in something other than those cheap iparty plastic cups!"
        }, 
        {
            "index": 452, 
            "rating": 5, 
            "review": "OMG!  So I am very picky about Indian food, and this is prop ably the best Indian I have eaten since I left home.  Between my friend & I, we ordered the Veg & Meat Thalis.  The appetizers (Tandoori Chicken & Veggie Samosas) were AMAZING!!! Honestly everything from the appetizer and salad to the dessert was amazing. Even the ice cold water tasted soooo good  \nI would definitely come back to Vegas just for this place if nothing else :)"
        }, 
        {
            "index": 453, 
            "rating": 4, 
            "review": "Great hidden gem! Delicious, fresh, most reasonable pricing ($15 for buffet). Enjoyed their lunch buffet (jack fruit curry!), friendly and prompt service. Greeted by the owner. \nVast majority of diners were Indian...a good indicator."
        }, 
        {
            "index": 454, 
            "rating": 5, 
            "review": "Located in the Hawaiian Market, this is a hidden gem that many may over look. At first I was a little hesitant to try Indian food, but what better way to try it than with my Indian BF and his entourage of cousins, aunties, uncles and parents? We came here one Saturday evening for dinner and I fell in love with the setting. It's nothing like restaurants you see on the strip. It had a buffet, large lounge love seats with over stuffed pillows and an orange and gold scheme that made you feel like you were in India itself (or so I imagined).\nBeing with the crowd I was with, it was great because some of them were not too fond of extremely spicy food so we got a lot of mild dishes. You can just tell the staff to make it mild and they will do so. The vegetarian dishes were great. We started off with dishes like the Kurkari Bhindi- okra with brown onions and had chicken tikka for our entree.  The Naan had a great texture for scooping up all the sauce left over. I really enjoyed the dining experience and I think that I owe my love for Indian food to this restaurant.\n\nThis is a great for a first timer!!!"
        }, 
        {
            "index": 455, 
            "rating": 1, 
            "review": "The good: decent service that's usually not provided at typical Indian restaurants run by FOBs. The location.\n\nThe bad: food safety is a big issue here. My boyfriend and I have been up all night vomiting since our dinner at the buffet last night. A quick research online shows that this place had been shut down multiple times in the past due to several violations.\n\nConclusion: avoid this place."
        }, 
        {
            "index": 456, 
            "rating": 4, 
            "review": "Where to do I begin?\n\nI was searching for a place to eat that would fit my newly discovered vegetarian diet and be acceptable for the rest of my lady friends for a night out.  \n\nWe walked in and were seated, immediately (of course there were only 8 other people in the restaurant).  The aroma of spices were all around and our appetites were ready to get down.  We were greeted by a gorgeous Morrocan man.  (Yay!  What a way to get the night started.)  And soon after a Philipino hottie joined in.  Two servers + four ladies = an exciting dining experience.\n\nHakim hooked us up with suggestions on food and drinks (that would be alcohol beverages).  What a delight!\n\nEverything was good...except how distracted our 2 servers would get.  Something went wrong with the bill...for them.  I don't even remember the details.  I just remember having a great time.\n\nI've been back several times now with my lady friends.  We always have a good time and good eats at this place.\n\nIf you like Indian food and you're looking for a place on the strip, this is it.  If you're looking for a place to hit up before a night out, this is it.  If you're looking for an Indian buffet, this is it.  (Yes, they do a lunch buffet and the price is low.) \n\nNummy nummy in our tummy tummies."
        }, 
        {
            "index": 457, 
            "rating": 4, 
            "review": "I was pleasantly surprised by Tamba Indian Restaurant in Las Vegas. Being Indian, I feel like I am slightly harsher than the average individual when it comes to judging Indian food. \n\nTamba is situated conveniently near the middle/ mid South area of the strip. The restaurant was clean and had a very pleasant ambiance that is a fusion of modern and traditional elements. The staff was very friendly and attentive to us during our meal. The buffet itself was quite good. There was a variety of options for vegetarians and non vegetarians. The food quality was surprisingly good and there were a number of healthy options. The buffet was pretty reasonably priced for Las Vegas- about $15/ person including tax. \n\nTamba is definitely one of the better Indian buffets that I have been to and I look forward to returning."
        }
    ]
}