{
    "category": "Las-Vegas", 
    "entity": "Slice-of-Vegas", 
    "avg_rating_stars": 3.644186046511628, 
    "review_count": 430, 
    "reviews": [
        {
            "index": 1, 
            "rating": 5, 
            "review": "Not just pizza available here!\n\nPaninis, pasta, pizza and some fantastic apps and desserts :)\n\nGreat service too! And there's a jukebox!!"
        }, 
        {
            "index": 2, 
            "rating": 4, 
            "review": "We were looking for food that would satisfy our vegan, vegetarian and meat eaters. This was an excellent choice. It was nice to have a vegan menu to choose from and there were plenty of options for the meat eaters. You have to try the Mama's Garlic Bread (and Not Your Mama's Garlic Bread for the vegans). It comes with a cooked garlic head you spread on your bread and it is so delicious. We ordered pizza and burgers and they were all excellent. The staff was friendly and provided great service. We ate here twice during our short stay in Vegas and will come back again next time we visit."
        }, 
        {
            "index": 3, 
            "rating": 5, 
            "review": "This is a great restaurant to frequent if you're staying in Mandalay Bay or the Luxor (or attending a Convention in Mandalay Bay).   I ate here twice during my stay and was happy both times.  \n\nFirst I tried the Vegan Faux Pie which was good.  The second time I got the vegan meatball sandwich, the \"Not You're Momma's Garlic Bread\", and the vegan cake.   The vegan meatball sandwich was good, but the \"Not You're Momma's Garlic Bread\" was amazing - incredibly uniquely flavored, and unlike anything else I've ever had.  It comes with three large slices and on its own would probably be almost enough for a meal. I also recommend the cake - the cake portion was good, and very moist but could have been slightly more chocolatey.  But the frosting was unbelievable."
        }, 
        {
            "index": 4, 
            "rating": 3, 
            "review": "My group is staying at Mandalay Bay, so naturally we ended up checking out the shops.\n\nMy brother and I stopped in here for happy hour since we needed a snack to tide us over until dinner time.\n\nWe sat at the bar and a nice young lady showed us the specials. One thing that really impressed me was the beer selection. TONS of craft beer. Most of it was stuff distributed out to the east coast, so I've seen or tried most of it before but there were enough new things from out west for me to try.\n\nWe each ordered a slice of cheese pizza and the garlic parmesan fries to split. The pizza was pretty sad. Dried out, overcooked, not very cheesy. Reminded me of something you'd get in a high school cafeteria or gas station. The fries were good, and I really liked the pesto aioli. \n\nThe crappy pizza is the real reason for three stars. Everything else was good. Even for the cheap price, it seemed pathetic. When your logo is a damned pizza slice, you should make an effort to make a better pie.\n\nMaybe we were there on a bad day, but at least the happy hour prices were good!"
        }, 
        {
            "index": 5, 
            "rating": 4, 
            "review": "I stopped in for some appetizers during my conference break and it was amazingly delicious! I ordered the calamari which was on point. I was surprised how delicious it tasted because deep fried calamari is not easy to cook. I also had a side of the garlic fries. It was some of the best fries that I've ever had! I love how it comes with the dip on the side. I wanted to try the pizza but I ate alone so appetizers were enough for me. Great customer service!"
        }, 
        {
            "index": 6, 
            "rating": 3, 
            "review": "We came here on a Groupon. We ordered a curry pizza, margarita pizza and rosemary garlic fries. Curry wasn't that great, but margarita was good. Lots of TVs. Good beer selection. It is located inside of the Shops of Mandalay Bay\n \nWould we go back without a Groupon? Probably not. It was pretty good though, but there are so many place to eat in Vegas."
        }, 
        {
            "index": 7, 
            "rating": 4, 
            "review": "Good & cheap... Just how i like my pizza!! Had a slice before the show.. Perfect for on the go :)"
        }, 
        {
            "index": 8, 
            "rating": 5, 
            "review": "The pasta is fantastic here! So flavorful. I had to share but wished I had my own plate. We are here twice and I hope to come back again solely for the pasta. Service is also great as well."
        }, 
        {
            "index": 9, 
            "rating": 5, 
            "review": "A great place for food, fun, drinks! Great food, strong and cheap beer/drinks, and in a hidden place within the hotel. Will defiantly go back. The service was good and they offer vegan options as well for people who prefer that. Check it out!"
        }, 
        {
            "index": 10, 
            "rating": 4, 
            "review": "Slice of Vegas is located in the Shoppes at Mandalay between Luxor and The Mandalay Bay Hotels.  NY style thin crust pizza is their specialty.  I must say I ordered the slice a little well done and it was cooked to perfection.  A little crispy, and just the right temp.\n\nLost of different beers on tap and even more in the bottle for you beer drinkers.  Nice TV's to watch games but no sound, and the location are the only things preventing this place from being five stars.  If you happen to stay at either Luxor or Mandalay, you should come here!"
        }, 
        {
            "index": 11, 
            "rating": 4, 
            "review": "Was starving one night and didn't want to spend a ton of cash, which is a problem if you're staying at Mandalay, since there aren't any real \"fast food\" places south of Excalibur.   \n\nFound Slice of Vegas by chance.  Wasn't looking for pizza, so I tried something else, and wound up having a damn good burger / salad combo.  Service was outstanding as well.  Would definitely go back again."
        }, 
        {
            "index": 12, 
            "rating": 1, 
            "review": "Came in here on a Tuesday night and sat at the bar. \nOrdered a Bruchetta as an appetizer.\n It tasted great, except for one thing; it had a large chunk of tin foil inside the garlic. After politely bringing it to the bartenders attention she quickly took it off the plate and threw it away; immediately went, and started speaking to a manager on the other side of the bar.\nA few moments later, said manager approaches and casually asks about how the appetizer was, while feigning ignorance. \nAfter explaining to her about the tin foil she replied that they cook it in tin foil and that it was perfectly normal. \nI told her to make sure it doesn't happen to any other customers as it is \"not perfectly normal\" \nThat was the end of that.  No compensation.  No apologies.  No nothing. Just your typical Las Vegas customer service that we've all grown so accustomed to. \nThe bill was around 100$ for 2 drinks an appetizer and two entrées. \nYou decide if this is a place you want to eat at."
        }, 
        {
            "index": 13, 
            "rating": 4, 
            "review": "Stopped by here randomly for lunch this past weekend and was pleasantly surprised!  The pizza was actually really good.  My 3 cousins and I split a large pizza with half/half toppings and it came out exactly as we ordered.  It was pretty greasy but c'mon... it's pizza!  It's supposed to be greasy!  \n\nThe crust was really good as well.  Nice and Crispy!  We also had the Calamari to start which was also pretty good.  \n\nI got to try a bit of the bloody mary which was 'mehh' to 'just ok'.  Service was decent although we did have to ask for our sides of ranch twice.  \n\nI would definitely come back here!"
        }, 
        {
            "index": 14, 
            "rating": 1, 
            "review": "The garlic bread was hard as a rock! It hurt my teeth when I tried to eat it. When we mentioned it to our server, she tried to tell us that it's always like that, but said she'd have her manager come to speak to us. He came over and said that's just how it is because of the bread they use and then they toast it. No attempt at customer service whatsoever! When our pasta came, you could tell it had been sitting for a while. The pasta was so hard it couldn't even be considered al dente and the sauce dried up within minutes. Seriously, the best thing we had there was a tequila shot, and that's because they didn't have to cook it!"
        }, 
        {
            "index": 15, 
            "rating": 5, 
            "review": "Before leaving for Vegas last week, I did a quick Google \"Vegan in Vegas\", and am really glad I did.  This little gem is in Mandalay Bay up by the shops.  They have a separate vegan menu that does not limit you to just pizza.  As I am a die hard pizza fan, I had to have the personal pan.  This is one large pie! The crust is paper thin and to die for.  They put on  just the right amount of garlic and Daiya cheese. Since I polished off the whole thing, its a good thing I had to walk back to my hotel. \n\nI have been to Vegas before and ate a lot of Subway. This time, I had better options almost everywhere I went.  I saved a copy of the menu so I can reminisce!  I did have to laugh when the waiter came to take our order and I ordered off the vegan menu, he actually said, \"You know that's vegan, right?\" Yes, my friend, that is why I plowed  through 2,957 tourists to get here before lunch!\n\nI can still taste the garlic..."
        }, 
        {
            "index": 16, 
            "rating": 5, 
            "review": "OMGGGGGG \nHubby and I met a group of about 15 other people here for Vegan Pizza Day 2013.\nHubby and I just ordered water but I did notice they carry wine and beer. I'm not sure if but I thought I saw a full bar.\n\nWe ordered an order of Not Your Mama's Garlic Bread and WOWOWOWOWOWOWWWW it was sooooo good! The pesto on it was perfect (not too much) and the whole clove of roasted garlic on the side...I ate almost the whole thing by myself. I saved the last of it to spread on my pizza and I even squished out the last tiny bit and licked it off my finger...yep it was that good!\n\nHubby and I ordered an 18\" Vegan Faux Pie and let me tell you...it was perfect. Not toooo much cheese. Even though I'm not a huge fan of Daiya cheese I really liked it on this pizza because they did not use too much. Sometimes it can get all goopey if your not careful with it. The veggies were cooked perfect and the sauce was seasoned perfect and I liked the little kick that it had to it. I was excited that we had a bunch of pieces left over :)\n\nI convinced our friend to trade me one of his vegan buffalo pizza pieces and it was super duper good also. I just really liked our veggie pizza better and I'm trying to limit my soy meat products right now.\n\nOur service was perfect and with our large group...we have zero complaints! I can't wait to go back and try some of those yummmmmmmy vegan sandwiches on the menu.\n\nYummmmmmm!"
        }, 
        {
            "index": 17, 
            "rating": 3, 
            "review": "Average at best, not sure why it has high ratings.  Are people that clueless on pizza?\n\nThey are also way overpriced, but then again we are in Vegas and at a hotel tourist trap lol"
        }, 
        {
            "index": 18, 
            "rating": 1, 
            "review": "I would give this place 0 stars if I could. My husband is gluten and dairy intolerant and can not eat these items without getting violently ill. He even throws up blood from time to time due to the severity of his sensitivity. I wanted to treat him to a nice lunch and got very excited when I saw that this place was advertised as gluten free and vegan. Upon ordering we were informed that the pizza was cooked in an oven with other items but that it was still gluten free so we proceeded with the order. The waitress then informed us that the pizza was very small and we would want to add something else to our order. I asked which items were gluten free and she informed me that the wings were gluten free. Upon receiving the appetizer we were told they were cooked in the same fryer and were not in fact gluten free after we had started eating. After leaving my husband got violently ill and called to complain. We were informed that it was our fault for ordering the items because of cross contamination that we should have been knowledgable of. \nWe only went to this place because it was advertised as gluten free. We would not have ordered if we knew that NONE OF THEIR ITEMS ARE ACTUALLY GLUTEN FREE\nThe customer service after this mistake was just added insult. The manager was unapologetic and uncaring of our situation. He claimed that they ask about celiacs disease and give warnings about cross contamination which was not even slightly hinted at. He also said that there was a miscommunication when in fact we were blatantly lied to. We specifically asked questions regarding my husbands allergies and were instructed to purchase items that conflicted with these allergies. If you advertise that items are gluten free they need to actually be gluten free. \nYOU WOULD NEVER SERVE SOMEONE WITH A SEVERE NUT ALLERGY A DISH CONTAMINATED WITH NUTS"
        }, 
        {
            "index": 19, 
            "rating": 4, 
            "review": "Went here while waiting to see the Chris angel show at the Luxor. the hostess was obviously new but she seated us right away. It was around 3:30 on a Tuesday so there were only like four other booths taken. \nOur server was nice with cool tattoos and recommended her favorite dishes. We ordered wings and since they were half off for happy hour we ordered a BBQ and a hot. Both were delicious! My favorite part of the meal. The BBQ had a little kick too it and was that sticky sauce you lick off your fingers..yum! They were very big with a lot of moist meat. My only complaint would be that the hot flavor was not hot enough for my taste. We also ordered a Caesar salad which was really good too, the croutons were very garlicy and the sauce very creamy. The pizza was kind of greasy and the crust underdone. So the app and salad was what brought my rating up to 4 stars!\nNot great on the pizza, but the wings were amazing! And salad great!"
        }, 
        {
            "index": 20, 
            "rating": 4, 
            "review": "Stopped in for a casual lunch while staying at the Mandalay.  We had the pizza by the slice last time we were there and it had too much oregano, but this time we ordered chicken parm at the bar with the sauce on the side and buttered fettucine on the side.  SOOOO good!!  The sauce would have been overpowering for me and probably too much on the chicken, making it soggy, but with it on the side, the crispy chicken and fettucine could shine through and I added the sauce as I wanted.  \n\nAlso, the bartender was so friendly and nice and totally made all of our weird requests seem like no big deal.  Will definitely be back!"
        }, 
        {
            "index": 21, 
            "rating": 2, 
            "review": "Don't bother unless your starved. Fairly average at best slice. Probably good if you trying to get some filler before drinking cuz you'll get it quick. Otherwise pass."
        }, 
        {
            "index": 22, 
            "rating": 4, 
            "review": "Easy to access from Mandalay Bay or Luxor hotels. Thin crust pizza, but on the expensive side. An 18 inch pie runs you 34 bucks (after tax) for specialty. All in all, a decent pizza."
        }, 
        {
            "index": 23, 
            "rating": 3, 
            "review": "If you are a vegan in Vegas, you should eat here. It is located in the Shoppes in Mandalay Place. We always have great service and they have awesome music playing on the restaurant juke box, BUT when 2 salads and 2 drinks total up to over $50 with tip, it just leaves a bad taste in your mouth. BEST ADVICE: come during happy hour and eat off that menu. Otherwise, it is wayyyy overpriced for a pizza place. The vegan chick'n wings are good and reminiscent of cafeteria chicken Mcnuggets. My sister, the vegan, likes the meatless meatball sub with fries. For the non-vegan food, the Caprese salad is delicious, but adding some extra protein will cost you - a lot. I really wasn't that impressed with the pizza, and none of us ordered it again after our first visit. Overall, lots of options for vegans but with a hefty price tag."
        }, 
        {
            "index": 24, 
            "rating": 3, 
            "review": "We had a free $25 restaurant.com certificate and chose to use it at Slice for no other reason than we saw it on the list of restaurants and recognized the name.  It was a Saturday night and the place wasn't too packed.  There were a few booths available but they sat us in one of those booth/chair combo tables where a bunch of tables are lined up in front of one long booth.  I explain this because it becomes an issue later on.  \n\nWe ordered drinks (good selection of beers.  My husband was happy to get Magic Hat #9).  We chose Mamma's Garlic Bread as an appetizer.  When it came out, the runner was going around to each table asking if it was theirs.  Ahh!  I want my garlic bread, come here!  Served on a small pan with a roasted garlic head.  Interesting and kind of waste of a garlic head if you ask me but I'm only a moderate garlic lover, not a garlic-loving freak who needs a side of garlic head lol.  But the bread was pretty good.  \n\nFor dinner I ordered a bowl of pasta(bilities) (haha, cute.  Yes, I'm easily amused) and chose rigatoni with the spicy marinara sauce.  The server asked me if I wanted to add a side of meatballs or a salad and I said no.  My husband ordered the meatball hero which came with fries, and he substituted regular for garlic shoestring fries.  I'm so glad he did - they were delicious.  Anyway, my meal arrived with 2 meatballs on either side of it.  I didn't order meatballs so I just scooped them off on to a side plate.  (Not a vegetarian, I just don't like things that are too \"meaty\".  heh.  I just walked into a bunch of one-liners, I'm sure.  But you know what I mean.)  The server apologized and offered to bring me a new bowl of pasta if I was a vegetarian.  I told her there was no need for a new bowl, but I was glad she offered. \n\nThe marinara sauce wasn't bad but it tasted as though a lot of red pepper was the only reason it was \"spicy\" and not regular marinara sauce.  My husband enjoyed his meatball hero.  For dessert we had the sack of dough balls.  I thought these were going to be lighter, like zeppoles.  They could have been a lot more enjoyable if they had more cinnamon/sugar sprinkled on the outside and they didn't pour so much sea salt over the chocolate/hazelnut sauce. \n\nWe're nearing the end of our meal and they seat a family of five right next to us... in a table of 4.  They did this on the side we were sitting on so a young boy wound up sitting RIGHT next to me as though we were in the same group.  This really didn't bother me except I thought that if I were that family I'd be pretty pissed that one of the kids has to sit in between two different tables.  We were almost done - they could have had the family wait 10 minutes to put two tables together.  And of course, I had to slide to the other side of my table to exit, which was only a small inconvenience but just made me annoyed that they would consider this setup in the first place.  \n\nThe prices were not over the top, but you just don't get enough \"wow\" for your money here.  A single cheese slice (which I didn't try) is $4.95.  The decor is very hip and environment is pretty chill.  There is an internet juke box and the music playing was very good.  Some classic rock and you could tell the bartenders skip over songs they don't like.  It could be good or bad depending on who's listening.  \n\nOverall we probably wouldn't choose to come back unless we were in Mandalay Bay with others who wanted to try this place.  It was a decent one-time thing.  If you're there and you're feeling it, give it a shot."
        }, 
        {
            "index": 25, 
            "rating": 4, 
            "review": "For what is basically a restaurant in a mall, this place isn't bad. The meatball appetizer was great and my gluten free penne with pesto was pretty good as well."
        }, 
        {
            "index": 26, 
            "rating": 2, 
            "review": "Needing a food fix while walking through various casinos, we stopped here to check out the happy hour for a small nibble. We were drawn in by half price cheese slices, so we walked in and got a table. They also offer half price appetizers. We decided to start with one slice each, as they are pretty big. We also wanted to try the meatball appetizer. Upon placing our order, we are told that there is a minimum of two cheese slices per person...odd! Clearly the intention is to fill you up on cheap cheese pizza so you order less of the more expensive stuff. We didn't fall for that so one of us ordered two slices and had our one slice each. How was the food? Nothing terribly special unfortunately. The cheese pizza was super salty and the meatballs while good were generic and seemed about the same caliber as the frozen variety. Would we come here again to try the actual entrees?....no, there are far many better options in the same building even."
        }, 
        {
            "index": 27, 
            "rating": 2, 
            "review": "Went for the counter service as a quick thing to grab on my way out of town.\n\nThe pizza looked appealing and had that essential layer of grease but fell short of what I'd even consider passable pizza ala Sbarro. (Setting the bar really, really low). \n\nThe cheese, sauce and toppings were all tasty however since the pizza had been setting out and they don't reheat it prior to serving, the cheese got hard and lost its hold onto the crust. \n\nThe crust was the real disappointment though. The crust had no rise and no chew but it wasn't thin crust. It was a dense crust with a thin ring around similar to what I would expect at a high school cafeteria. On top of that the crust was burnt on the bottom, but not in the good way like you'd expect from a Napoletana pizza. This just had a crispy exterior and a light acrid flavor. \n\nIt's not really fair to judge a whole restaurant based on a slice from the counter so take this review with a shaker of salt."
        }, 
        {
            "index": 28, 
            "rating": 5, 
            "review": "Love their vegan menu and happy hour drinks. Friendly staff and good service. We had the roasted cauliflower, BBQ wings, and garlic bread"
        }, 
        {
            "index": 29, 
            "rating": 3, 
            "review": "The overall look of this place is great, however, it seems as though that is what you are paying for. Food is overpriced, most items are $20+ while just a few are $15 and below. The coupon you get when checking into this, does not make up for paying as much as you do.\n\nWe ordered an 18\" meat lovers pizza that was $30. We wanted to get a create your own pizza, but doing that with just one topping would have been $25, so we went with the signature pizza instead. It was very greasy, but there was more than enough of meat on every slice. We also got a pasta; angel hair-Alfredo ($15) with chicken (extra $5). The portion was good enough to split with two people, but the taste was very bland, there was also very little cube cut chicken pieces so paying the extra $5 was not worth it.\n\nBefore we sat down we noticed one of my family members wasn't doing so well due to his diabetes so we asked our server to please quickly bring us bread, water and anything else they had ready. Although we had stated why we needed it in a timely matter, we still had to wait about 10 minutes before we even received our water! One of our other family members had to go across the store to a mini mart and buy a few snacks for him, and also went in the \"walk in buy a slice\" area of this restaurant to get a pizza. Many waitresses were just looking at us nervously, which was bothersome.\n\nOverall: overpriced, nice, but slow staff, food could have tasted better."
        }, 
        {
            "index": 30, 
            "rating": 4, 
            "review": "I was surprised by garden salad. Really fresh, dressed well. It was a nice change from typical vegas fare.  The hangover pizza  was unique and delicious. My server did every thing right."
        }, 
        {
            "index": 31, 
            "rating": 4, 
            "review": "This place is a must go to while in Vegas! They have a whole vegan menu that is elaborate & delicious! The truffle style fries, the Salad romelias (one of the best salads I have ever had), buffalo pizza & pesto pasta is to die for! So freaking good we went three times while in Vegas!\nMy one complaint was that my vegan pasta came with parmesan cheese on it. When I asked the waitress said it wasn't cheese. I looked closer & it was melting like cheese. So I asked again & sure enough. Cheese. It took over 30 minutes to get my pasta back the right way. That was a huge bummer. \nOther than that mix up, it is an amazing vegan paradise!"
        }, 
        {
            "index": 32, 
            "rating": 5, 
            "review": "I cannot wait to get back to Vegas to have their 4 Cheese Truffle pizza!!! Thin crust was perfect, cheese was perfectly blended and melted, and the truffle taste made it heaven in my mouth!\n\nMy vegan friend brought me here and am sooooo grateful she did! I went in April and wrote this review now bc i was drooling as i was reminded of it after eating something else with truffle oil recently."
        }, 
        {
            "index": 33, 
            "rating": 4, 
            "review": "I had the buffalo chicken pizza and it was really good. We were seated quickly which was ultimately a reason we pick the restaurant because the burger place next-door had a huge wait. I was really glad we did as everyone like their food. Our server was friendly attentive and helpful. The price is reasonable but in typical Vegas fashion slightly high. I would certainly eat at this place again. They also have a quick takeout window if you just looking to get a quick slice."
        }, 
        {
            "index": 34, 
            "rating": 5, 
            "review": "So I have only been here 2 times and I think it's pretty good. I'm a vegetarian and I shared a (what I think is) vegan cake with my vegan friend and it was pretty bomb. Had the vegan \"chicken\" wings and they were really good... but a little bit too small for the price. Had the \"meatball\" vegan pizza and it was to die for. I absolutely love their \"meatballs\". If you are a vegan or vegetarian that likes to eat vegan food, I definitely recommend this place because it has a good vegan menu."
        }, 
        {
            "index": 35, 
            "rating": 5, 
            "review": "As a vegan this place is great.  Ive tried the vegan bbq chicken pizza, & the meatless meatball pizza, both were delicious.  They have the meatless meatballs as an appetizer, so delicious its really a must try.  The staff is amazingly friendly and tentative.  Definitely visiting again, probably sooner than later."
        }, 
        {
            "index": 36, 
            "rating": 4, 
            "review": "We got here at a shift change and the server had us wait for the other server to come on but he did get us our drinks.  Food was great!  We always come here for happy hour whenever we stay at mandalay bay.  We usually order the same thing but this time I tried the toasted cheese ravioli.  I liked the outside crispiness but not much flavor at all otherwise."
        }, 
        {
            "index": 37, 
            "rating": 5, 
            "review": "The food was good, our waiter was nice. The service was quick and the prices weren't too bad."
        }, 
        {
            "index": 38, 
            "rating": 4, 
            "review": "This place gives me mixed feelings, sometimes I really love it and sometimes I can go without. Even though they are known for their pizzas, their salads are the best. Mainly the caprese salad loaded with fried capers and bitter greens, I would regularly come here for that. Id give them 5 stars but their pizza is a miss for me- the more toppings the undercooked dough you'll end up eating. Thumbs up for their salads, and thumbs down for their pizzas. Oh the cannolis are pretty good though."
        }, 
        {
            "index": 39, 
            "rating": 4, 
            "review": "Not a bad place for a quick slice and a beer.  The pizza is decent and the staff is friendly.  I had a meat lovers type thing and it was delicious.  I don't have any complaints at all about the food.\n\nThe only reason I can't give it 5 stars is because the restrooms are outside the place and way down a long hallway.  It's a sit down place that serves beer without a restroom ?  It was just weird and bothered me.  Felt like a food court with sit down prices."
        }, 
        {
            "index": 40, 
            "rating": 5, 
            "review": "Great pizza at Mandalay bay shops area between Mandalay bay and the Luxor. Get it by the slice or s whole pie. You can even bill it to your room. Staff was attentive and friendly. Price point is not over priced for Vegas. I ate here a couple times and both times it was great!"
        }, 
        {
            "index": 41, 
            "rating": 5, 
            "review": "1. We just happened to be at the Minus 5 ice bar next door and needed to find lunch.\n2. We had to go to the airport in less than an hour, so it couldn't be a drawn out meal.\n3. We are foodies\nMan, were we blown away. All we ordered was a 'Choked Pig Pizza and it was the greatest pizza I've had since I can remember. Service was fun and personal, and very accommodating to us needing to get out. 3 of us girls DUSTED the pizza, and should have ordered a second one to go for the flights home.\nWill definitely be back there on my next Vegas vacation!"
        }, 
        {
            "index": 42, 
            "rating": 1, 
            "review": "Horrible experience! Found this place while we were walking between casinos. They looked open so we walked in and sat at the bar. We could tell the bartender was busy but she took care of us pretty quickly and got our order in and got us some drinks. We were hungry so we ordered a pizza and some fries. After 40 minutes it was apparent there was something wrong in the kitchen. No one had a pizza at their table.  A few finally came out and they were for people who came in 15 minutes after us!  So, after an hour of waiting, with no one coming to check on us or tell us anything i asked the manager, Christy, about the status of our order. She was completely unprofessional and rude. According to her they were technically closed and re opened to accommodate \"your group\" and they were shorthanded. We should be patient and grateful that they were serving us.  WHAT!?  I was not part of any group that caused her back up. And furthermore, lady, you were not accommodating me, you reopened cause you saw a chance to make some money. If you didn't have the manpower, CHRISTY, you shouldn't have opened.  Minimum you should APOLOGIZE and check on my freaking order. And if you were having issues you should have stopped by sooner to let us know. Horrible customer service.  Will never go back and will warn EVERYONE."
        }, 
        {
            "index": 43, 
            "rating": 2, 
            "review": "How does Nadine C. have such great experiences everywhere!?  Granted, we went to the deli area to get some slices to-go to eat in our room since we had crawfish for dinner like five-hours prior but does it make that much of a difference to dine-in?  Apparently!\n\nFor $21-something, we got three giant slices of pie [one Hawaiian, one veggie, and a meat combo].  The pizza itself was thin and soggy and all the toppings were on the verge of sliding off and into my lap.  Not a great start.  While the bites with toppings and cheese had okay flavor, once you hit the crust, it's game over.  Tasteless!  \n\nSlice of Vegas is quick and speedy but they could use some work on developing more flavor.  What I would have done for a packet of crushed red pepper.  Meh!"
        }, 
        {
            "index": 44, 
            "rating": 4, 
            "review": "Had food poisoning when I came here (not from this place). I was not in the right mind to be eating, but I figured some bread and fluids might work. Bread turned into pizza which delicious cheese. My cousin got the 5 cheese I think and it was way better than mine. The ricotta was super good. Started feeling good and ordered a beer with dinner too. It was a nice easy casual dining experience. I plan to go back when I am in town next month."
        }, 
        {
            "index": 45, 
            "rating": 3, 
            "review": "Slice! is set up like a NY-style Italian restaurant -- or at least what I think of as one -- with plush red leather cushions, lots of wood, and slate grey walls.  There's plenty of pizza and pasta on the menu, of course.  The food's pretty good, although I think the pasta soundly trumped the pizza.  The menu of bottled beer is surprisingly huge.  The staff is friendly and patient."
        }, 
        {
            "index": 46, 
            "rating": 5, 
            "review": "It's hard to find a place with good veg options AND good carnivorous options.  This place fits the bill so well we ate here two days in a row.  The entire back page of the menu is vegan yay!  I had the buffalo chik'n ranch pizza which is AMAZING, the bruschetta, and the supreme pizza with big hunks of field roast yum yum.  Hubby had burger and fries both days.  Lots of TV's for watching sports. Real chill atmosphere. Friendly, attentive service.  A little spendy but hey it's Vegas."
        }, 
        {
            "index": 47, 
            "rating": 4, 
            "review": "This place was awesome!  After spending the entire day traveling to Vegas we wanted a substantial dinner to welcome us.  Definitely got what we were looking for here.  Started with an order of calamari and the sauce was absolutely amazing.  I ordered a Mobgarita to enjoy while we waited for the pizza.   We ordered a large il Mangino pizza thinking we would have leftovers to take back to our room and chill on for a couple of days.  That pizza barely lasted the night.  Great food and quick, friendly service.  Definitely worth a visit if you are looking for pizza on the Strip."
        }, 
        {
            "index": 48, 
            "rating": 4, 
            "review": "Excellent food. Portions are really big. Pizza is really big for the small personal size. Staff is super nice and attentive. \n\nDrinks were really weak though and the ticket times for the food took 40 mins. Restaurant was half full. Other wise I would've gave this place a 5 star."
        }, 
        {
            "index": 49, 
            "rating": 5, 
            "review": "I found Slice of Vegas by accident when I was on groupon looking for some discounts on food. read reviews about it, and lots of people have been bragging about how good the service and the pizza is at this place. Slice of Vegas is located in Mandalay bay, just right next to Burgr bar. The place is big for a pizzeria but there is always a lot of people waiting to be seated.  \n\nThe menu contains a typical selection of pizza, and my favorite pizza is the \"miles 10 meat\" pizza. like the name implies, the pizza has 10 different kind of meat on it. good thing about slice of vegas is that, the pizza was never frozen, u can really taste the freshness of it. The pizza slices were thin. it has that crispiness that I really like, with a perfect amount of chewiness. and the flavor is really good. \n\nI have only tried 2 of their pizza at this place, the miles 10 meat and the 4 cheese truffle. The sauce on the pizza was good. its the perfect amount. on the miles 10 meat, the sauce was dark red, and a bit sweet. u cant really taste the tomato flavor of it, which is a good thing for me, since I hate tomatoes. The amount of cheese on it was in good balance. All the ingredients on the miles 10 meat were tasty. The 4 cheese truffle is good, but tends to be very oily. \n\nOverall, the pizza were really good and I would really recommend it. its not really a wow factor but we are in vegas and not nyc. I think the pizza really taste good. it has the perfect balance of sauce, toppings and cheese. it has that perfect crispiness with every bite. ull even lick ur fingers, coz its that finger lickn good. lol."
        }, 
        {
            "index": 50, 
            "rating": 5, 
            "review": "Sunday evening I dined here with a large party.  We had amazing service and an unparalleled culinary experience. The truffle pizza is to die for! I also got to try a few items on the vegan menu. One of their signature drinks, 6\" and hard was a delicious treat! The vegan chicken wings and vegan pizza was amaze! I will definitely be back."
        }, 
        {
            "index": 51, 
            "rating": 4, 
            "review": "This place sits between the Luxor and Excalibur. Stopped in for a slice. Pizza was fresh and the cocktail cold. Cool stop for something quick and paked with flavor. Service was ok"
        }, 
        {
            "index": 52, 
            "rating": 4, 
            "review": "Super awesome, especially if you're looking for vegan options in Vegas. They had a whole menu full of specialty items and they were super attentive to our order (ie pointing out that my drink had milk in it when I ordered a vegan pizza to share with my boyfriend). \n\nThe drinks were delicious, the garlic fries and BBQ Chik'n pizza were wonderful, and the service was excellent. I would absolutely come here again next time I'm in Vegas."
        }, 
        {
            "index": 53, 
            "rating": 4, 
            "review": "The pizza was fresh and delish! The chicken wings are really good! Could have eaten  much more than the six  that comes in the appetizer portion. Waitstaff was very helpful. Would eat here again!"
        }, 
        {
            "index": 54, 
            "rating": 4, 
            "review": "Very good Pizza in the Luxor/Mandalay bay corridor.  \n\nThis place is conveniently located in the walking corridor between the Luxor and the shops at Mandalay Bay. The pizza looked very gourmet on all the signs and in all of the advertisements I saw at the Luxor.  We had just gotten to Vegas and were famished so we decided to have pizza for lunch.\n\nWe ordered a Sausage, Mushroom, Onion, jalapeno pizza.  Everything on top was incredible.  Fresh toppings, tasty sauce, good amount of cheese. The crust was thin, which was perfect for us, but it was a little too crispy.  Probably about an 1/8 of an inch of hard crispiness. This is totally personal preference.  We thoroughly enjoyed the pizza and the friendly service.  \n\nGreat place!"
        }, 
        {
            "index": 55, 
            "rating": 3, 
            "review": "Pizza new York style. Service is not so hot. Beware they bring all food at same time. Vegan items were pretty good.Locals beware Mandalay bay charges $7 for parking! No validation."
        }, 
        {
            "index": 56, 
            "rating": 5, 
            "review": "Great place to grab some vegan eats with a vegan or non vegan alike! They have a great vegan menu, and an awesome omnivore menu. I love their vegan cheese cake and pizza! The fish bowl was a fun drink to try."
        }, 
        {
            "index": 57, 
            "rating": 1, 
            "review": "We went here last night with a group of six. We decided to try it because I had a coupon to the restaurant and reviews seemed fair. Our server was very unenthused to serve us and our over all experience was maybe 3 stars. \nThe reason I'm leaving them one star is after the restaurant my brother-in-law and I started feeling sick. We both ordered a side Caesar salad and a small pizza. Not only did we stay up all night throwing up but we stayed in our hotel room the entire following day with food poisoning. \nI was curious if it was from the alcohol but I was the only one in our group that was actually drinking that night. Our vegas trip was ruined."
        }, 
        {
            "index": 58, 
            "rating": 3, 
            "review": "Good pizza, but not at their terrible pricing. Ordered a small BBQ chicken pizza and it was just under 20 bucks and not very big either since it was a small...maybe like 10 inches? We weren't too hungry so it was perfect to split between 2 people as a snack. Service was mediocre but at least we got steady refills on our water. \n\nThe good thing is that they're open late when nearly everything else in Mandalay Place is closed. I would only come here again for happy hour, otherwise this place is way too pricey for what you get. So many other pizza joints you can hit up that have better pizza and more reasonable pricing!"
        }, 
        {
            "index": 59, 
            "rating": 4, 
            "review": "I love their special vegan menu with a lot of great options. However, don't attempt to sit to long in the booth or you will be asked to leave even though the place is not even half full and your bill is over $200."
        }, 
        {
            "index": 60, 
            "rating": 2, 
            "review": "Wasn't as advertised... 'Slices'.\n\nMight as well buy a whole pizza instead of individual slices.\n\nthey do have happy hour and different deals throughtout the week. I've uploaded them... See photos. \nYou're paying for rent for the prices of these pizza. \n\nCommon food and strip prices."
        }, 
        {
            "index": 61, 
            "rating": 1, 
            "review": "Had a Groupon so decided to try it. Wait was FOREVER even though there were plenty of tables available. I hate when restaurants do that. The two pizzas we ordered took a while. We began to get antsy. Where is the management??? Nothing here but young people who don't try any harder then they have to. Then the pizza came. They were cardboard thin and greasy. The buffalo chicken one had an interesting taste, but I was still hungry. Then we got the check. They automatically charged 18% gratuity on the check. I saw they automatically charged 20% for parties of 8 or more so beware. Our 18 inch buffalo chick pizza and 18 inch pepperoni pizza came out to about $50 even though we had a Groupon for $20 for $40. The automatic gratuity came out to be just as much as a pizza!  Not worth it."
        }, 
        {
            "index": 62, 
            "rating": 4, 
            "review": "I thought the food was ok here. We waited for ever (over an hour) for a table to get seated. Our server was very diligent, quick, and friendly. I would not recommend going with a big group (over 10) because they just don't have that many tables to accommodate large groups."
        }, 
        {
            "index": 63, 
            "rating": 1, 
            "review": "We went there because the lamb sliders looked good. After rearranging schedule to make it possible to eat there we find out that they don't have the lamb sliders on the menu. They didn't bother to remove it from the online menu not the physical menu when we got there. After sitting and ordering drinks they finally let us know they don't have the sliders any more. There was no other indication anywhere they no longer served he sliders. Apparently it was just sold out but actually removed from the menu. \n\nYou may want to call ahead to confirm they actually have the food on the menu!!"
        }, 
        {
            "index": 64, 
            "rating": 1, 
            "review": "It was a Sat. evening, so it was pretty busy. First time here, so unfamiliar with the rules of this place. They have two sides...A takeout side when you order and seat yourself and a side where you are seated and then order.\n\nWe ordered a slice of pizza from the takeout side..not really thinking...and after deciding we would rather sit at a table...we waited to be seated. After being seated we informed the hostess that we ordered from the togo side, wherein we were told by a manager I'm guessing (who was very pleasant) we would have to order more food if we wanted to sit at a table. Okay, not a problem :) let's do it...and she left.\n\nThen the waitress came over and ...if looks could kill...we would be dead...lol. She was extremely rude and refused to hear the fact that we were going to order more food. Once my date left the table to check on why the food was taking so long, she walked over and demanded I leave....and at that point I lost my appetite and didn't want to even bother causing a scene or addressing the manager... there was really no reason to ruin our night over whatever issue this waitress was having. Customer service is not a priority here."
        }, 
        {
            "index": 65, 
            "rating": 5, 
            "review": "Diet Pepsi. I am a Pepsi fan always..Diet Pepsi is my favorite, it was there and they made Veggie burger real nice and side fries\nHi\n\nI thought I should bring to your attention....how nice and great during visit to COLLAB'2015 at Mandalay bay and resort.\n\nAwesome and wonderful.\n\nfirst I wrote \" by the girl who served- sorry could not find the receipts\"\n\nFinally it took 25 minutes to search and found the receipt finally\n\n\n\nIt was TAble 110/1\nServer: Heather\n04/15/2015 - 09:58 PM Pacific which is 12:58 in Orlando or east coast\n\nShe did a great job, very quick, sharp, friendly and super nice. these are people. I forgot the person who put me to the \n\ntable hostess i wanted to write her name\n\ni could not find\n\nthis all happened on 04/15/2015 \n\ntransaction :40058\nPLease ensure to send to both of them or inform the management\n\nthey could understand Asian Indian English too:))))))))))) Just kidding\n\nSri\n\n\nHi\n\nI thought I should bring to your attention....how nice and great during visit to COLLAB'2015 OAUG Conference at Mandalay \n\nbay and resort.\n\nAwesome and wonderful.\n\nfirst I wrote \" by the girl who served- sorry could not find the receipts\"\n\nFinally it took 25 minutes to search and found the receipt finally\n\n\n\nIt was Table 110/1\nServer: Heather\n04/15/2015 - 09:58 PM Pacific which is 12:58 in Orlando or east coast\n\nShe did a great job, very quick, sharp, friendly and super nice. these are people. I forgot the person who put me to the \n\ntable hostess i wanted to write her name\n\n\n\nthis all happened on 04/15/2015 \n\ntransaction :40058\nPlease ensure to send to both of them or inform the management\n\nPlease ensure to send a hostess also who did a great job\n\nthey could understand Asian Indian English too:))))))))))) Just kidding"
        }, 
        {
            "index": 66, 
            "rating": 4, 
            "review": "Gary was a great server steering us to try the cannoli and it was fresh and better than most. The filling could be more dense but it hit the spot regardless. Pizza is NYC style and good. A tad expensive which is the norm on the strip. Speedy service. Would go again."
        }, 
        {
            "index": 67, 
            "rating": 3, 
            "review": "It's a nice relaxing place to take the kids.  They loved the pizza and the zeppoli pizza bites for dessert.  I really enjoyed the garlic bread with a baked head of garlic.  I wasn't wild about the Chicken Parmesan.  The spaghetti was good, but nothing special.  The service was good both times we were there. We'll definitely go back with the kids."
        }, 
        {
            "index": 68, 
            "rating": 3, 
            "review": "We stopped here because we were in Mandalay, short on time, and didn't want to spend a lot on dinner.  Slice Vegas offers a main restaurant as well as a little bar area where you can order slices and sit down for a minute.  \n\nWe got the special at the time- two cheese slices and a draft beer for $10.  A little more than it's worth, but a good deal for the Strip.\n\nThe pizza was fine.  It wasn't bad but it definitely wasn't as good as Secret Pizza.  The pieces were huge and my husband and I each had one and we were full.\n\nYou can order slices with toppings but those are at least $5 apiece.  Also, if you order a draft beer without the combo special, it's $8.  If all you are looking for is a drink, you might as well just pay the two extra dollars for the combo and feed some hungry people walking by.\n\nI can't see myself making a special trip to eat here (like I have for Secret Pizza), but it's a good choice to have if you are in Mandalay or Luxor."
        }, 
        {
            "index": 69, 
            "rating": 4, 
            "review": "4 stars just for offering a full vegan menu along with a standard menu!  That's huge. Full meaning appetizers, sandwiches, pizza and dessert.  Garden salad and zeppolis are excellent. I would prefer they made their own meatless meatballs in lieu of purchasing from a manufacturer.\n\nService is on point. Located along The Shoppes at Mandalay Bay."
        }, 
        {
            "index": 70, 
            "rating": 3, 
            "review": "Stopped by for a slice only.  It was the last cheese slice in the display.   So.....who knows how old that slice was.   But......i review 'em as I get 'em.\n\nWasn't impressed. Crust was hard.  Cheese was average at best.   I didn't like the sauce. It seemed a bit too heavy on herbs.    Also, 15 seconds after I placed my order, a fresh cheese pie came out.  Why wouldn't they have given me a fresh slice????? At $5.25 for a slice of cheese piazza,  they should have."
        }, 
        {
            "index": 71, 
            "rating": 2, 
            "review": "This place is just ok. Just like all eateries in Vegas, it's overpriced for the did you get. One sandwich, one pasta plate and two kids meals was about 70. To make the visit worst our server seemed like he didn't want to be there or seemed annoyed at doing his job. My cup was empty for almost 15 minutes before he noticed. It was a Tuesday evening and not very busy. Will not return or recommend."
        }, 
        {
            "index": 72, 
            "rating": 4, 
            "review": "We were at Mandalay Bay for a show and wanted to have a late dinner afterwards.  The Slice of Vegas was busy but was able to get us a table pretty quickly.  Our waitress was good about checking on us often.  It did take a bit to get the final bill from her but overall she was good, very friendly.\n\nI had the Choked Pig pizza.  Toppings included Pesto aioli sauce, Mozzarella cheese, sun dried tomatoes, bacon and artichoke mix finished with chopped basil and a whiskey sour cream.  It was very tasty.  The Pesto was delicious but not overly strong.  The other toppings were great.  My mom had a basic pepperoni pizza which she enjoyed.  I ate both pizzas cold the next day and they were still good.\n\nThis is definitely a great place to go if you are looking for a really good thin crust pizza.  It looks like the place gets pretty wild with music and drinks on some nights."
        }, 
        {
            "index": 73, 
            "rating": 2, 
            "review": "Came in here for lunch as we were hungry and in between the Luxor and Mandalay Bay. This place is closer to Luxor.\n\nOrdered soup, pizza and 2 drinks. The soup was okay, but sadly had a beef stock when it didn't need one. Ordered the veggie pizza. It was very soggy and laden with cheese even when we asked for light cheese.\n\nThe server was nice, but for the price and quality of pizza at a pizza place, I'd rather go somewhere else."
        }, 
        {
            "index": 74, 
            "rating": 1, 
            "review": "The service sucked. Took forever for our pizza to come out. Not once did the server check in with us."
        }, 
        {
            "index": 75, 
            "rating": 3, 
            "review": "Not the best nor the worst dining experience that I've had in Vegas. This restaurant is located in the Mandalay Place right on the Strip.\n\nI have been to this spot two different times and have experience the good and the bad that comes with dining out. First time I came here, I was here with family during dinner time.We came here to get a bite to eat as we had been drinking and needed to sober up.\n\nWe shared a pizza and a Caesar Salad. The Caesar salad was different from any other one of its kind that I've ever had. Made with romaine, broccoli, croutons and their house Caesar dressing, which in my opinion of of the best tasting dressing I've had!!! Topped with fried anchovies, grilled lemon and fresh Parmesan. Cost $11.95. The portion was big enough to share among four adults. We also shared a 18-inch Nonna's Margherita pizza, which is made of fresh mozzarella cheese and fresh basil. Not the best, but not the worst. Flavor was good, but it was dry. This cost $29.95.\n\nSecond time I came, I came during lunchtime. This time, we had to wait as there were so many people. I waited about 20-25 minutes before I was seated. I was seated toward the back at a tiny table with hardly any elbow space. To make things easy, I and my guest decided on just getting waters as it took forever for our waiter to get to us. Upon looking over the menu, my guest decided on the Delitalino sandwich, which is made of imported Itailian meats of cappicola, salami and ham. Along with provolone cheese, tomatoes, onions, pickles, romaine lettuce and seasoned with dried oregano and Italian dressing. It came with a side salad of their choice. Cost $14. I ordered the Scotty's Chicken sandwich with a side garden salad. The sandwich was made of a grilled chicken breast, which was so tender and moist. Topped with a roasted tomato, pickle, basil pesto, fontina cheese and jalapeño bacon. The garden salad was made of spring lettuce mix, cherry tomatoes, cucumbers, red onions and edamane. Seasoned with an Italian dressing, which I replaced with ranch. Their ranch dressing here is so delicious!! This also cost $14. Both sandwiches and salads were amazing. Which almost made up for the lack of service we received during this visit. \n\nCon's:\n1. This place is so popular that there is always a line of people waiting to eat here. The tables don't get cleared off quick enough to accommodate the the customers.\n2. It is always so loud. Don't come here if you want an intimate experience or want to be able to actually have a conversation with your guest without having to yell.\n3. During popular hours, don't expect to get great customer service. I feel like for the amount of people that come thru here, they never have enough staff working. Our waiter had a huge section all to himself and was running around crazy trying to take orders and make sure his customers were satisfied, but in the process, I had to wait forever to get my lunch and for him to bring my check to me. \n\nI would come back again, as the food is really good here."
        }, 
        {
            "index": 76, 
            "rating": 1, 
            "review": "Yeah, not a good place to eat pizza, not a good place for customer service... not a good place. (Period) It looks nice from the outside. However, the attitudes of the server(s) and manager leave a LOT to be desired. Funny thing the manager stated that they put a premium on service... as I was walking out the door 100% NOT satisfied. There are too many other places to eat to have to worry about BAD attitudes."
        }, 
        {
            "index": 77, 
            "rating": 5, 
            "review": "Making food choices while is Vegas is daunting; there are so many great places to choose from. This pizza shop is actually inside a mall, which made it a little difficult to park and find at first. Once inside the mall, it was super easy to find and it stuck out.\n\nThe hostesses were very nice, as was the female server we had. The boy and I ordered salads...just kidding! What do you think we ordered? Pizza of course! We opted for the 18 inch 'Choked Pig' which had pesto aioli sauce, mozzarella cheese, sun dried tomatoes, a bacon and artichoke mix, then basil on top. This pizza was delicious; and HUGE! I think we ended up saving 4 pieces which equated to a whole 'nother meal which was awesome. This size pizza was roughly $30 but they also have a 12 inch for $19, or a 10 inch gluten free for $17. I would have loved to try the gluten-free, and it's awesome they actually offer it.\n\nFor dessert, we order the cannolis. The best I've ever had was up north in New England, but these were a close second! You can tell they know how to make em because they only fill them RIGHT after you order them. Lots of places keep them filled and this results in a soggy outside. These were yummy with pistachios, chocolate chips, and chocolate sauce and were nice and crunchy!\n\nOh, I also had a Restaurant.com voucher and we were able to use it. I think we ended up having to order a coffee or something so we could reach the certain amount of money we were supposed to spend, then we got a certain amount off. Pretty cool! They are very willing to accept anything from Restaurant.com. Made the meal EVEN cheaper!"
        }, 
        {
            "index": 78, 
            "rating": 3, 
            "review": "Service was excellent.  I just went to the deli part to get a slice of cheese to go.  The gal was sweet and they put them in a brick oven to reheat each slice.  Bonus!  \n\nPizza was just, eh.  Maybe the fresh, made to order pizza is much better.  Very well priced and if I ever need a quick bite I will be sure to return!"
        }, 
        {
            "index": 79, 
            "rating": 4, 
            "review": "I am going to rate their Vegan Pizza because they are one of only 2 places that serve vegan pizza in Vegas ( that I know of) \n\nTo start, I am dumbfounded that other places don't offer it. All they have to do is use a different cheese and charge a premium for it. Not like they have to change all ingredients in making the pizza. So I am very glad this place allows me to come with my friends and we are all able to get something to eat. \n\nI tried their Vegan Supreme Pizza. I have to say that while vegan pizza will probably never be as good as the \"real thing\", this rates a solid 7/10. \n\nThe dough is very good, the sauce used was not that bad ( a little too thick for my personal taste but good nevertheless) the cheese used I believe is regular Daiya, which vegans have a love or hate relationship with. It's not my cheese of choice for pizzas I make at home but it's decent. \n\nThe only con is the price. It is quite expensive, I ended up paying about $35 after taxes for an 18\".  \n\nI understand they charge a solid $7-8 premium on top of the vegan pizzas, and again, no complaints at all, at least they're giving us an option. BUT it's not like I can go there every weekend and grab a pizza, so unfortunately the price is much higher than i'd expect to pay for a pizza. \n\nVery decent taste. Very Expensive as well. Will I go back?  On rare occasions due to the price. But I can see myself trying their other flavors."
        }, 
        {
            "index": 80, 
            "rating": 4, 
            "review": "The pizza was delish, we ordered in the short order by the slice area.  We had a slice of pepperoni and a slice of cheese.  I wouldn't say it's the absolute best, a place in Austin, and a place in Chicago take that title, but it was in the running for a solid 3rd!  I knocked off a star for price.  $5 for a slice is a little ridiculous, but I guess it's just another price you pay for a trip to Vegas, especially since a couple hours earlier I had the worst Vietnamese food in my life.  You can read that review here on yelp!"
        }, 
        {
            "index": 81, 
            "rating": 4, 
            "review": "Located in a mall area between the Luxor and Mandalay Bay. They have good vegan and gluten free options which is so rare in Vegas. Service was very slow with some big groups there at the time. Took forever just to pay our bill."
        }, 
        {
            "index": 82, 
            "rating": 1, 
            "review": "Avoid this place like the plague. I'll keep it simple; service was horrible, management etiquette was crap, food was poor. To be faIr, perhaps the waitress, manager, and cook were all having a bad day, which led to my dissapointing experience. If so, my advice to those people - moving forward ensure  2 of the 3 of you  are having an ok day to hold the place together or at least be professional and put your personal drama aside when working with patrons."
        }, 
        {
            "index": 83, 
            "rating": 3, 
            "review": "Got the BBQ pizza special and some soup. The soup was very yummy. loved it!\n\nThe pizza was nothing special IMO and i was starving. But we got a groupon for it and it was the cheapest lunch choice for us on the strip.\n\noh and tried some of my brother's cajun fries. they were pretty good."
        }, 
        {
            "index": 84, 
            "rating": 1, 
            "review": "Worst pizza I have ever had. The manager Anthony was so rude after messing up my order twice! How ridiculous, he didn't even treat any of the employees with an ounce of respect for their mistakes. Horrible corrupted company. Never returning to this establishment"
        }, 
        {
            "index": 85, 
            "rating": 4, 
            "review": "Food was satisfying.  Salad was delicious as was the pizza and pasta."
        }, 
        {
            "index": 86, 
            "rating": 5, 
            "review": "We were looking for a quick place to eat that had vegan opitons (hard to find). This was on the way to the Shark Reef we were going to and YAY they had a vegan menu. We got the Buffalo Chicken Pizza and the Pesto Garlic bread. Both were sooooo good. I wish the pizza had more toppings but it was still great. Would go back in a second."
        }, 
        {
            "index": 87, 
            "rating": 3, 
            "review": "The pizza was ok. Thin crust style pizza. Very crunchy. Crust was way too crunchy to chew. I would have liked it softer. We had meatball n green pepper toppings. Meatballs were really good. \n\nHad their calamari was really good. Nice and soft, nut chewy or tough. Sauce was really good. Can't out faster than expected. Pizza took a little longer.\n\nThe service was good. Happy hour was half off apps and single slices. Calamari was $6, 12 inch meatball n green pepper pizza was $14. We visited on Wednesday around 5pm.\n\nI would not come here again for the pizza, but I would go back to try other items on menu, because the app was good. Got three stars for app."
        }, 
        {
            "index": 88, 
            "rating": 5, 
            "review": "So I'm not sure why the other ratings ware so low. I had a wonderful experience here.\n\nKeep in mind this is a pizza joint. This isn't 5 star dining. They have a juke box, a bar, beer, and pizza.  FAN-TASTIC. It's in Mandalay Place next to the burger place.\n\nI got the truffle white pizza [$18.95] and antipasto salad both were delicious. Friend got gnocchi and calamari both very good.  Thank God we made a reservation b/c b/w this and the burger joint next store there were 20 people or so hanging outside waiting to get in and seated.  We got there around 7:45 pm on a Tuesday night.  We walked right up, told the girl my name, and sat right down. Service was outstanding!  I can't say enough about how much they checked in on us to make sure we were doing ok. And like 6 difft people. One guy brought our apps, another guy brought our wine, another guy took our order, another person brought our food, all the while the waiter was making sure we were doing fine w/ every round of food."
        }, 
        {
            "index": 89, 
            "rating": 5, 
            "review": "Ordered a burger to share with my wife. Spot on. The sweet potato fries went really well with the burger. Burger looked like a juiced up hotdog and tastes great. Service was bit spotty. Got 15% discount from yelp for which the waitress took our phone back to the manager."
        }, 
        {
            "index": 90, 
            "rating": 4, 
            "review": "Forget all the glitz of the strip when you decide where to go to get pizza in Vegas. I mean Wow. We ordered the meatball appetizer and the build your own pizza.  Both were awesome!  This is some of the best crust we have had on a pizza in a long time."
        }, 
        {
            "index": 91, 
            "rating": 4, 
            "review": "Very solid. Big portion for my meatball sandwich. Sat at bar and everyone was very nice and attentive. I just went solo for a quick lunch and watched some sports while also working."
        }, 
        {
            "index": 92, 
            "rating": 5, 
            "review": "Great place to grab a great Italian meal. In town for the Vegas Marathon great place to \"carboload\". Very friendly service. Highly recommend this place for a great delicious quick meal."
        }, 
        {
            "index": 93, 
            "rating": 2, 
            "review": "Stopped in here about 9pm on a Sunday night, not very busy. Friendly hostess told us we could sit anywhere.  Sat right at the bar.   Bartender very slow to provide service.  We ordered 2 beers and she came back shortly there after.  Simple order, basic 3 topping pizza.    Pizza came very quickly brought out by the kitchen, asked if we needed anything else.. Told him plates and silverware would be nice.  Bartender comes over and throws down 2 plates...  Pizza was actually very good, sausage, chicken, pepperoni, nice crust sauce not too sweet.   Price was kind of high, $38 for a 12\" 3 topping pizza, a Peroni and a Stella. Asked once for the check, not sure if she didn't hear us or just wasn't up to customer service this evening, never asked how anything was.  Lucky we had cash or we may still be waiting.  \nBottom line, would go back for the pizza, but horrible customer service by the bartender on a slow night and a bit pricey."
        }, 
        {
            "index": 94, 
            "rating": 5, 
            "review": "The vegan menu is fabulous!! Everything we ordered was fantastic. The pizza had perfect veggies, 'cheese,' and Gardein 'sausage.' We also had a side of sweet potato fries and vegan ranch dressing. Yum!  The beer menu was also fab with lots of regional brews and IPAs. Even though it was a busy lunch service during football, we got great service.  I wish I didn't have to go to the strip to get this amazing vegan pizza!"
        }, 
        {
            "index": 95, 
            "rating": 3, 
            "review": "As mentioned many times in reviews, Slice of Vegas is overpriced for what you get. The environment is fun and welcoming. It would be great for a group of friends and they have TV's  all over so you can catch a game from any seat in the place. The hostess was friendly. The server was nice but seemed to be robotic in his approach. \n\nIt was not very busy when I dined here and service was mostly prompt. TV's were everywhere but the volume was not too loud so you can easily have conversations with your group while dining and watch the games. \n\nThe pizza was very good, NOT great but very good. Ordering a small (12') will set you back $20. It is good but not at all worth that price even being in Mandalay Place. The cocktails were well made. The presentation was weak but the flavor was perfect. The What's 6\" and hard  is cucumber Efiin and very refreshing. The Mob-a-rita is an Italian Margarita and also quite nice, They do pour a little heavy handed but the balance is still nice for the cocktails. $14 for cocktails and they are about 10 ounces. \n\nThe concept is good, the atmosphere is fun and the food is pretty good. The cocktails were the star but when considering the price of everything I can't give it more than 3 stars. It is nice to grab a bite before a show at the House of Blues or if you are shopping but it is not worth making a special trip to check out.  Much better in concept than reality."
        }, 
        {
            "index": 96, 
            "rating": 3, 
            "review": "You'll be paying an outrageous amount of money for some below average pizza, I got four 12 inch pizzas and ended up spending 90 dollars. The crusts were rock hard and there was a scarce amount of sauce. The quality of the actual pizza was alright, really nothing special I honestly think dominos is better. The crust was extremely thin and was not filling at all. The only reason this review got three stars is because the woman who served use as extremely nice and I believe service is one of the most important parts of any business"
        }, 
        {
            "index": 97, 
            "rating": 5, 
            "review": "Slice of Vegas became our regular visit while in Vegas. We were fortunate that they were at Mandalay Bay - it made the visit a quick one! \n\nOver three visits, we had Mama's Garlic Bread spread with pesto, Buffalo pizza, Barbecue pizza, basil pesto fettucini, the pomodoro rigatoni, and the chocolate cheesecake.\n\nAll Vegan.\n\nAll prepped on a separate line from their other items with meat.\n\nAll really, I mean REALLY, good.  \n\nOh, and really great moscow mules.  \n\nWe are so grateful for this spot since it made dining in Vegas very pleasurable. \n\nAside from the food and their specialty menu, the comfort here along with the engaging staff makes SOV a favorite Vegas spot in my book!"
        }, 
        {
            "index": 98, 
            "rating": 2, 
            "review": "Dined here with friends on Sunday night, and due to slow service/food arrival thinking 2 stars is fair.  Our server was good until he had taken our food order, after which, he pulled a Copperfield and went invisible.  While waiting for our meal, one of our party finished their drink, and we had to ask another server to help us out as our guy was MIA.  My friend had the lasagna and was happy, I had the chicken Parmesan, and was happy with the size of the chicken breast, but the food was warm at best. My wife had the fettuccine Alfredo, and liked the flavor but was also disappointed in the heat of the dish when it arrived.  After waiting a more than reasonable time upon completion of our meal, we again had to ask another server for our bill.  Would give it a shot again, but very hesitantly."
        }, 
        {
            "index": 99, 
            "rating": 3, 
            "review": "Tuesday Special from 2pm - 4pm, you can get a slice of cheese pizza for 2 dollars or a 1 topping slice for 3 dollars.\n\nPIzza dough was really bland and it was soft even after heating it back up in the pizza oven. The cheese and sauce were OK. \n\nIt's not in the Settebello, Metro, or Secret Pizza league.. but it's far better than a Papa Johns or Domino's. Probably compareable to a Rosati's. It's a good deal for that time period."
        }, 
        {
            "index": 100, 
            "rating": 4, 
            "review": "Good food, bad prices. That about sums up Slice of Vegas. I came here on a Monday evening with my fella and Groupon in hand. The wait was minimal, although I was surprised that there was a wait at all on a Monday. \n\nOnce seated, our waiter slash bartender was extremely attentive and friendly. He didn't even give me a snarky look when I mentioned I had a Groupon, kudos for that. I ordered the gnocchi with alfredo sauce and my fella got the barbecue chicken pizza. He really enjoyed his pizza, despite the $19 price tag for a single serving. My gnocchi wasn't bad for price and taste. I would probably order it again, since it's not too expensive. The food didn't blow me away, but it was solid and service amped up the star-rating on this review a bit too. \n\nI probably won't go out of my way to go back to Slice of Vegas, but if you're in the area and craving a slice of 'za and beer, this place is for you."
        }, 
        {
            "index": 101, 
            "rating": 2, 
            "review": "Michelle was a very offensive waitress. When she came to our table she offered soda and water and then proceeded to say \"idk, are you old enough to drink?\" when I asked about any drink specials/for a drink menu. I am 21 and definitely look old enough to drink so when she assumed my friends and I were underage we were all very offended and didn't like her judgmental tone. She was sloppy, unfriendly and brought checks without asking if we were finished or if we wanted another round of drinks. So rude and made my friends and I feel unwelcome. Would not return. As a waitress in a the past, I always tip 25%. I still tipped her okay in case it was a fluke but I was very unimpressed with the service."
        }, 
        {
            "index": 102, 
            "rating": 5, 
            "review": "We love this place! We have been here multiple times. All of the pizza is good, my favorite is the 4 cheese truffle.  BUT, you have to try the appetizers! The roasted cauliflower is so good and the Not Your Mamas Garlic bread is to die for! It comes with an actual clove of garlic that you squeeze out and spread on the bread, amazing! I highly recommend!"
        }, 
        {
            "index": 103, 
            "rating": 1, 
            "review": "By checking in on Foursquare at Mandalay Bay, I unlocked a special at Slice of Vegas called Happy Hour at Your Convenience--no restrictions listed. The hostess would not honor the special stating that the restaurant does not offer happy hour on Fridays and Saturdays, but I could return tomorrow. In that case, the special should be called Happy Hour at Hostess' Convenience.\""
        }, 
        {
            "index": 104, 
            "rating": 5, 
            "review": "This place is inside Mandalay Bay Hotel . Its nice . They have a music player you can request music to listen to . The server is helpful . There pizza is good and really big . The alcohol drinks are pretty strong . The kids meal is good came with meal and a side order and drink for 10 .  Are bill  came out to 100 with food and appetizer and drinks . The food is good but can be pricly"
        }, 
        {
            "index": 105, 
            "rating": 2, 
            "review": "Just went once, and once is enough. I had a slice of the veggie pizza. Who knows how long it was sitting there, as I just went to the express side. It was just ok. Pretty tasteless and the crust was really hard and bland. I sat at the bar on the express side, there was a lot of crumbs covering the surface. It wasn't busy so I'm not sure why it hadn't been wiped down. The cashier seemed to be just going through the motions, super average place at best."
        }, 
        {
            "index": 106, 
            "rating": 2, 
            "review": "Fettuccini was okay. Overcharged me by $10. Still trying to get that resolved. Manager and server were nice.\nUpdate:  they straightened out the overcharge issue and sent a nice email to apologize."
        }, 
        {
            "index": 107, 
            "rating": 4, 
            "review": "Looking for a fresh, laid back bar scene in Vegas without the flashy lights and cigarette smoke? In that case, definitely check out Slice of Vegas. This little gem is hidden in the Shoppes at Mandalay Bay and we wandered in during their happy hour from 3 to 6p. If you have ever been to Vegas you know that prices are all over the place and the majority of places range on the pricier end. Looking at the menu, SOV is also one of those places but during happy hour, all drafts, slices, and select apps are half off. SCORE. \n\nWe posted up at the bar and had two bartenders during our venture here - both were lively, super friendly, and attentive. We order two slices of pepperoni and sausage plus their mild wings and a few beers. The slices were large and foldable - not quite NY style huge but close enough for me. The sausage had great flavor and the crust was just slightly crispy... exactly how I like it. The wings were fantastic. Period. Crispy outside. Juicy inside. Mild sauce had great flavor without being too spicy. In fact, there were so good we ordered a second batch and stuffed ourselves full. \n\nThis bar had a great local selection as well - plenty of Las Vegas brews as well as a handful of domestics and other well- known craft breweries. Looking at the menu, I was tempted to order the Miles 10 Meat pizza but didn't have the stomach to do it.... seriously, I was so damn full. But the Miles 10 is cheese and 10 meats. Yes 10 MEATS and no stupid veggies to ruin the heart attack pie. Topped with proscuitto, capicola, pork, bacon, and more, this is definitely going to be a go to spot of mine next time I'm in Vegas just for that pizza. \n\nThe place is pretty small (but hey, it's located inside shops) and I hated to see it closed at 11pm. Maybe it was just the time of year we were there, I'm not sure. But all in all, if you are looking to grab a beer and some grub, this is definitely a spot to go - heads up, be sure to go during happy hour. The wings we received, while delicious, we $5.50 for six of them meaning they are $11 normally. Holy hell. But hey, when in Vegas...."
        }, 
        {
            "index": 108, 
            "rating": 2, 
            "review": "This place is straight up garbage... The pizzas are just ok. Honestly I would rather eat dominos that this place. My friend ordered the meatballs and wow is was like frozen meatballs overcooked and dump in sauce. Would not recommend this flavorless meal. Also we ordered both soups and they were both really disgusting. The Tuscan had wayyy too much Tabasco added into it, and I love Tabasco... The other soup was just flavorless. It was like drinking water. Honestly a waste of money. Go to the food court a little farther down and get something cheaper."
        }, 
        {
            "index": 109, 
            "rating": 3, 
            "review": "The pizza was pretty good, but I was highly disappointed that they didn't offer their special tanked drink at a smaller size. I really wanted one but there was no way that I could have drank a whole one by myself. However they did have cheery Lambic and that drink paired really well with the pizza."
        }, 
        {
            "index": 110, 
            "rating": 5, 
            "review": "Great Place for Vegans! They had more than plenty of options on the back of the menu. The entire back page is vegan, and delicious. I had the Gardien Meat Balls, and they where awesome, followed by the BBQ Chick'n Pizza with buffalo sauce, It was amazing, and not to spicy. The next day I had the chick'n wings with two sauces. The staff was super accommodating, and fun to chat with."
        }, 
        {
            "index": 111, 
            "rating": 4, 
            "review": "Real good pizza.  My mom loved the titan veggie burger.  A little expensive or I would give it a 5."
        }, 
        {
            "index": 112, 
            "rating": 1, 
            "review": "Over priced for what you got.  Didn't see the slices only until we ordered that might have been better.  Very disappointed.  Also $6 for a soda is outrageous."
        }, 
        {
            "index": 113, 
            "rating": 3, 
            "review": "The pizza was just aight. I had a slice of pepperoni. The pepperoni was definitely a step up from most pizza joints. The sauce was okay, a little salty. If I had a beer with it I think it would have been perfect. It could've used more cheese. The crust was crunchy how I like it. It didn't come out all that hot either. I would have felt better paying $3 for slice but it is in Mandalay Bay so enough said."
        }, 
        {
            "index": 114, 
            "rating": 4, 
            "review": "Delicious drunk food but extremely pricey even for the Strip.\n\nTypical \"American\" style pizza.  Not NYC.  Not Chi Town.  The pies are, dare I say, Pizza Hut on steroids.  Chewy, bready crust slathered with sauce, generously topped with quality ingredients, finished with an almost excessive amount of cheese.   Over the top in true Vegas Strip fashion.\n\nSauces are bold and flavorful.  The pies are well seasoned and not excessively oily thanks to the fresh (not processed) cheeses.  The \"Miles 10 Meat\" pizza with its outstanding three meat bolognese sauce and toppings of prosciutto, pepperoni pancetta, sausage, bacon, mortadella and cappacola toppings is a meat lovers delight.  The \"Mushroom Ragu\" is another standout.  The perfect mix of earthy mushrooms paired with creamy, melted, fresh mozzarella.\n\nAll is not perfect, the crust in the middle of every pie so far has been soft from excessive sauce.  It becomes the stuff of legend if you like to indulge on cold pizza the next morning.\n\nYou can build your own pie from an extensive list of ingredients.  Slices are also offered along with salads, pastas, and sandwiches.\n\nService is fast and friendly.\n\nVery good selection of beers on tap or by the bottle.  Prices are higher than it's Mandalay Place neighbors.\n\nStrip indulgence comes at a price:  $19 for a 12\" pie, $30 for an 18\"; build your own starting at $15 (12\"), $23 (18\") adding $2 per topping.\n\nRecommended."
        }, 
        {
            "index": 115, 
            "rating": 4, 
            "review": "Pizza is pretty good. Tuscan Soup good, but no where as good as mine! lol Not your mama's garlic bread, yum!!! But the cannolis, sooooo GOOD! I have to say, that the shells for these cannolis are the best I've ever had! So if you come here, definitely get the Cannolis, you will not be disappointed. Also, super friendly staff."
        }, 
        {
            "index": 116, 
            "rating": 3, 
            "review": "The short: Not craving pizza at this pizza place? Try their burger and meatballs.\n\nWe wanted to stop by at another restaurant, but the wait was over 40 minutes at 9 pm, and we were so very hungry. So, we decided to mosey on over to Slice of Vegas. We were tempted by the stall offering small slices, but decided that we wanted to enjoy the meal sitting down.\n\n+ Meatballs: delicious with rich flavors doused in a marinara sauce.\n+ Immortal Burger: half pound of meat. Pretty good and is pretty big for one person.\n\nThe meal was over $30 for two people, and for that price, I had hoped for fantastic food. Was it? Nah. Just a typical meal. The service was fine, and the booth was comfortable. I think it must be a Vegas thing for food to be so expensive. \n\n*I know, I know. We didn't even order pizza, haha\n\nNote: there are no bathrooms inside the restaurant. They're in a hallway shared by all the other tenants"
        }, 
        {
            "index": 117, 
            "rating": 2, 
            "review": "This is a decent casual dining option.  The prices are ok and you can get in and out quickly.  The service is ok as well.\n\nI ordered a 12\" Miles' Ten Meat pizza.  The crust, sauce and cheese or ok.  The pizza comes covered in several different meats.  You get a good amount of toppings.\n\nThere are other options as well if you are not in the mood for pizza.\n\nThis place is realistically a three star.  I am taking away one star for one petty thing that annoys me.  They offer a 10\" pizza as well.  That would have been the preferred size for me, but it is only available in gluten-free.  I am not sure why I cannot get what I want just because hypochondriacs found a new \"allergy\".  Evidently lactose intolerance is no longer in so they needed a new go to issue."
        }, 
        {
            "index": 118, 
            "rating": 5, 
            "review": "I walked by and what caught my attention was their sign advertising a full vegan menu! Awesome! My friends and I went in and there was something for everyone! I am so happy at how many vegan options they had! It was very good too, everyone was satisfied!!!"
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "I absolutely loved this place! So excited to see they had a whole vegan menu. The vegan wings were hands down the best I have ever had, and I eat at a ton of vegan restaurants. The service was excellent and the waitress was so wonderful. I had the best pineapple cider in the world. The vegan buffalo chicken pizza was unique and on point! My boyfriend got the vegan BBQ chicken pizza, and we both loved it so much. I am so happy about the experience we had here , thank you!"
        }, 
        {
            "index": 120, 
            "rating": 3, 
            "review": "I can't believe that I came to a pizza place and I didn't order any pizza! My friend and I shared an order of the not your mamma's garlic bread. I loved the pesto spread and the roasted glove of garlic. I had a garden salad which was filled with all the regular ingredients- tomatoes, cucumber, red onions, etc. It was almost big enough to be shared. I am a part time vegan so I was excited to see all the options on the menu. \nService was friendly. There were plenty of seats for an intimate time or a big group of friends. TVs at the bar to keep you up to date on scores. There is a To Go section as well."
        }, 
        {
            "index": 121, 
            "rating": 5, 
            "review": "Can you say HANGRY?!! Except it was more like inner white girl needing copious amounts of carbs to soak up all the drinks we downed hours before! \n\nMy friend and I were so drunk; almost felt like this place was a mirage except when we clutched the wall, IT WAS REAL! We did the drunk girl excitement and raised our hands to the Italian Gods for creating pizza dough! \n\nBefore the waitress said anything, she knew we needed a reservoir of H2O. We finally choose to go with the Back East Buffalo Pizza & devoured it in minutes! I'm not that big fan of thin crust because sometimes it's so thin you can't put any yummy toppings on their without falling off or the crust gets burnt, but this crust was to die for (and that's not the tequila talking)! Although the prices may seem high, it's Vegas!! I rather pay more money for quality than have a free nasty meal! \n\nA good side effect of a thin crust pizza is it's enough to soak up the alcohol, but doesn't make you feel all bloated and nasty and lethargic, so you can still get into your skank dress and not feel like a sausage!"
        }, 
        {
            "index": 122, 
            "rating": 4, 
            "review": "The wife and I had just checked into our room and we're starving after a long drive from LA so we decided to walk around and find something to nibble on before dinner... we walked past Slice of Vegas and saw the Happy Hour special so figured \"why not\".\n\nThe slices were good... I'm an east coast Italian and I'm  hard to please but these are passable. Very good... we also split the meatball appitizer...that was an excellent  choice. Very tasty. Will visit again."
        }, 
        {
            "index": 123, 
            "rating": 3, 
            "review": "A 12 inch pizza for twenty bucks? I guess...\n\nI ordered the hawaii 5-0 pizza, with canadian bacon, bacon, nori and dehydrated pineapples.I thought the nori was a unique touch, gave the pizza more depth of flavor. I also liked that the pineapple was dehydrated so it didn't make the pizza soggy like pineapple usually does. It also gave a nice tang, which balanced out the saltiness of the bacon quite nicely. I would say it was an enjoyable pizza, but pretty typical."
        }, 
        {
            "index": 124, 
            "rating": 4, 
            "review": "A little late (!) review, as I went in January this year! But backtracking on some places I haven't reviewed that I went to while in The Vegas. I loved this joint! In my hotel, it provided me with excellent vegan friendly choices! I brought back my brother and his girlfriend so he could get involved in some veggie friendly meat substitutions. I tried both the Meatless Meatball and The Vegan Faux Pie- both were delicious. As far as sides go, the Meatless Meatballs were good but a very small portion for the $ & the what I thought were faux 'chicken wings' turned out to be what we in the UK would deem were chicken nuggets? That was v disappointing, but I'm not sure what I expected I would get in a vegan chicken wing! Maybe over-expectation! Great, great pizza's though for vegans! Well worth the trip."
        }, 
        {
            "index": 125, 
            "rating": 5, 
            "review": "There are vegan options on the menu, but if you are a plant-based eater...ask for the vegan menu, which has more options.  The salad and pizza we ordered were both great.  They also have a delicious chocolate cake - it's the only chocolate cake the restaurant serves and it happens to be vegan (shhh).  We will return next time we are in Vegas."
        }, 
        {
            "index": 126, 
            "rating": 5, 
            "review": "Awesome pizza and sweet potato fries are good. Open til 12 on friday nights. Drinks are decent prices . Wines range $6-8 and beers $5-8"
        }, 
        {
            "index": 127, 
            "rating": 5, 
            "review": "Came here because they have a whole vegan menu but also regular pizza as well which is perfect because I am vegan and my boyfriend isn't. We came during happy hour so he got half off wings and then a personal BBQ chicken pizza which is huge I got the vegan BBQ chikn pizza. It was so good the perfect amount of daiya ! Our server was Michelle and she was so attentive and really sweet. We will definitely be back not only because of the good food but because of the great service (:"
        }, 
        {
            "index": 128, 
            "rating": 4, 
            "review": "1st off I didn't eat there but I did stop in for a beer. They have an awesome craft beer selection and the waitress was super friendly. Will definitely go back for more beer!"
        }, 
        {
            "index": 129, 
            "rating": 4, 
            "review": "With so many pizza choices in Las Vegas, it's hard to distinguish them all.  Even with that said, this was definitely the best thin-crust \"NY style\" pizza that I've ever had.  I love the atmosphere and the fact that you can control the music with just a simple app on your smart phone.  It's a fun, casual place to hang out, watch some sports and enjoy delicious Italian cuisine."
        }, 
        {
            "index": 130, 
            "rating": 4, 
            "review": "Came here yesterday pizza pie was really good had half/plain half pepperoni pizza I didnt have none of these crazy food,some people on here had so I wouldnt know but as far as if you are looking for pizza this is a good place to sit and relax after a long hot day at the strip"
        }, 
        {
            "index": 131, 
            "rating": 4, 
            "review": "Slice of Vegas!!! A must stop. First visit was for a quick take out. Grabbed a Italian deli sandwich for my son,  I was very lucky to get a taste of, it was great. I myself had The Bootlegger burger a.k.a, Bleu cheeseburger. Being from Chicago, I feel my opinion on burgers can be taken seriously. This was an incredible display of flavor. The burger meat itself was top notch, tender and flavorful. However the flavor doesn't stop there. Mushrooms, grilled onions, JALAPEÑO BACON, and avocado, yes avocado. This complex burger is perfect in texture and flavor. Try it with sweet potato fries. The very next day I had to have it again, so I did. There are many different options for food, but I couldn't bring myself to pass it up. Cool bar and even cooler bartender. Johanna said it was her first day, but that was very hard to believe. She was very attentive and knew how to handle the rush, a true pro, not to mention very friendly with a great smile. I have to finally recommend the Red Tail Ale, what a brew. Can't wait to go back, it will be my first stop for a bite and brew. Thanks for a great time Slice of Vegas, and of course our superstar bartender Johanna!!!"
        }, 
        {
            "index": 132, 
            "rating": 4, 
            "review": "Food and service is good. We eat here when we are in a rush or really don't want to think a great deal about what we want for lunch or dinner. It is close to the room, is always good and service is nice. Plus they offer gluten free pasta so I can have an Italian dinner. Perfect after a long day of shopping or sitting by the pool."
        }, 
        {
            "index": 133, 
            "rating": 4, 
            "review": "The food here was good and it came out fast which I appreciate. If you're a vegan you will be amazed at their vegan menu. Service was typical, nothing special there. \n\nHusband and I got BBQ chicken pizza and some hot wings. It was really good. They have a really good bar. If they turned up the lights a bit more I'd be more willing to give 5 stars it was too dim in there!"
        }, 
        {
            "index": 134, 
            "rating": 5, 
            "review": "Omg!!! me and my ex went there yesterday for dinner. This was the best food ever the garden salad the dressing was so yummy. Then the thin crust pizza was to die for. Then i got the fish bowl drink which was also awesome. I will deff have to make a stop here again when im in Vegas!!!"
        }, 
        {
            "index": 135, 
            "rating": 3, 
            "review": "Had my first dinner in Vegas here and it was my late-night go-to throughout the rest of my stay at Mandalay Bay. From the specialty pizza to the pasta, garlic bread, and wings, everything was good... not AMAZING, but def good if you're looking for a reasonably priced menu of comfort foods. The take out was also a life saver for when I just wanted to relax in the hotel room for a bit!\n\nOther than that, the ambiance is fun and if you're into that sort of the thing, they have plenty of vegan options!"
        }, 
        {
            "index": 136, 
            "rating": 5, 
            "review": "So many choices for vegetarians and vegans.  We had a vegetarian meatball pizza, meatball sub, and the vegetarian wings (they are gardein).  I always stop here when I am in Vegas, because I appreciate the effort!    The real star is the service.  Our order got mixed up in the kitchen, and our server came out to apologize, rushed the rest of the order out so we could eat while we waited for the other pizza (which took all of 10 mins, tops).  Then the host came over to apologize, and offered us a free desert.    Now all you need is truly great vegan pepperoni!"
        }, 
        {
            "index": 137, 
            "rating": 3, 
            "review": "We needed something quick to eat. My husband just got off work and met me at Mandalay Bay for a concert. I remembered they put in a pizza by the slice place, so this is where we headed. It was quick but  wasn't cheap which I knew it wouldn't be. I had a cheese slice, he got pepperoni. It's pretty basic pizza that you get at any shopping mall. It was edible and works if you're drunk or hungry but I wouldn't choose to eat here or recommend it."
        }, 
        {
            "index": 138, 
            "rating": 5, 
            "review": "Excellent!\n\nI especially loved the Pesto Pizza!!\n\nThe plain slices are fantastic.\nIt's a bit pricey, but worth it for mid mall snacking.\n\nGive it a shot!!!"
        }, 
        {
            "index": 139, 
            "rating": 1, 
            "review": "Horrible crew tonight...it's like everyone decided to dumb down for Memorial Day weekend. \n\nOur server with green hair was a bit awkward...\"oh I forgot the diet coke...I heard so many water orders...ready to order?\" You're joking right? Not even, \"let me go grab that real quick.\" No sense of urgency. \n\nThe gentlemen who brought our food out were nice. \n\nAs we were ready to close the check, to our knowledge we didn't know who was a busser and who was a server...the busser comes over and says \"I'll get your server...\" My father gives a confused look...and then a lady comes over and says \"I'll take care of that...(death stare to our table).\" And then she states \"he can't handle the checks he's a busser...AND! He's my son!\" Like you have shirts to differentiate what your job is...\n\nLast I checked, it's a place of business...him being your son has nothing to do with it. Business is business...\"he's my son\" BS!"
        }, 
        {
            "index": 140, 
            "rating": 2, 
            "review": "Service was good, but that is all I can probably say about this place, because the food wasn't.\n\nI ordered the Tuscana Sausage Soup, the potatoes in it weren't cooked/boiled all the way, it was sort of too salty, but the sausage in there was pretty good.\n\nBuild your own Pasta seemed like a good choice besides Pizza, but I was wrong. I chose spaghetti, bologonese sauce (meat sauce), meatballs and mushrooms for my pasta. It came out to around $22 - 24 for the pasta and those two added ingredients. While the spaghetti and sauce tasted fine, it wasn't hot, it was semi warm, and everything else that came with it. The meat balls tasted like frozen meat balls from the market, it was also warm like the pasta.\n\nAll in all, I didn't like the pasta, maybe I will opt for a slice of pizza instead."
        }, 
        {
            "index": 141, 
            "rating": 5, 
            "review": "Best pizza I've ever had in Las Vegas! Neat atmosphere and great service. If you're staying at Mandalay bay check out this place."
        }, 
        {
            "index": 142, 
            "rating": 5, 
            "review": "Pizza was excellent.  Our server, Bianca, was pretty and very sweet.   She helped us with our food allergy questions which we appreciated. The large pizza is really big, if it had been pan pizza instead of thin NY style we would have left a lot on the table.  The location is nice as well, between the casinos and lots of shopping.   All indoors to stay out of the heat is nice too.  Service was a little slow at the end of the meal but not because of Bianca, she was working her tail off all around us, I think they were just short staffed.  \n\nWe would easily eat here again on another visit."
        }, 
        {
            "index": 143, 
            "rating": 4, 
            "review": "I got Hawaiian pizza, it was thin crust with 6 slices in a 12in. The pizza itself was neither good nor bad, just average.\n\nThey don't have cheesy bread so they offered to make us some. It was 4 slices of sourdough garlic bread with mozzarella cheese on top. I appreciate that they waned to accommodate but it wasn't great. \n\nProbably not worth the $36 we spent but definitely helped the hangover"
        }, 
        {
            "index": 144, 
            "rating": 5, 
            "review": "Absolutely the best pizza I've ever had in Vegas. The all-meat pizza does NOT mess around. Pure awesomeness."
        }, 
        {
            "index": 145, 
            "rating": 5, 
            "review": "They get 5 stars from me just for the vegan menu.  Beyond that, the staff was prompt and attentive and the food was delivered hot and quickly."
        }, 
        {
            "index": 146, 
            "rating": 1, 
            "review": "Dear Slice of Vegas,\nIt disheartens me to have to write this letter about the experience myself and 9 of my friends had at your restaurant tonight. \n-Tonight 10 friends of mine all got together to celebrate an upcoming wedding in our group of friends.\n-We arrived at Slice of Vegas about 7:45 PM and were promptly seated in your nice back room by no later than 7:55 PM. \n-We were greeted by our waiter who took our drink order and then followed up to take our dinner order with normal service.\n-Before ordering we requested our bill to be split about 5 ways, that's just how it is when you are in big groups. \n-When it came time for us to order while ordering we specifically asked for some extra sauce on the side of our meal. \n-All of our meals came out promptly/hot but were delivered by somebody other than our waiter and that's when everything started to go downhill for our group. \n-This is the beginning to when we never saw our waiter again. \n-After 15 minutes of having an empty water cups, and not receiving the extra sauces I requested on the side of my wife and my meal I went out to the main dining area with my wife's and my water cups to be refilled by the bar tender. The bartender wouldn't fill my cups instead she flagged down the original waiter who from the other side of the room shouts \"What do you need!\" In a disinterested tone. I raised up my two empty glasses of water and approached him, he said he'll bring them to the table, I also requested the sauces that I had ordered with the meal (ranch and marinara). \n-He did then promptly came to the table with 2 waters for us after I did this, and told me the sauces are on their way, but he didn't take the time to ask anybody else if they needed anything (3/4 of the drinks, waters and $2.95 sodas were empty). We still had never had the usual \"Did everything come out alright?\" that you get, especially when you weren't the actual waiter that handed out the food. \n-After about 7 more minutes of waiting for the sauces (and ¾ of all the food eaten on the table), I approached the main dining room where he looked at me from across the room and shouted again \"what do you need!\" This time seeming irritated and not caring at all, it was at this exact time the sauces were being delivered by another waiter. \n-We continued to complete our meal, but still had absolutely 0 interaction at our table in the back room with our waiter since we gave him our order at the beginning of the evening. Everybody still had empty drinks and nobody had come by to check up on us.\n-After about 20 minutes of us all sitting there, waiting for our checks I had, had enough of this nonsense and talked to the \"manager\" of the night. I explained to him, verbatim what I just described to you, drinks had never been refilled, sauces didn't come until the meal was practically completed, never seen our waiter again. I asked the manager \"Joseph\" if he felt the service we had received was \"unacceptable\". Joseph would not agree/use the word unacceptable, he would transition into saying it's busy, and apologized. I informed him again about the horrible and lack of service that was provided and once again inquired to see if it he felt it was \"unacceptable\" once again he changed the subject to doing their best and it's really busy. So I inquired as to if this is what service should be like and is expected to be like in this restaurant, because if so I'd like to inform my friends. He said \"No, it isn't\" so I informed him then it's \"unacceptable\" isn't it.\n-The checks were finally brought out. No nice check folder, just a Hodgepodge of nonsense handing them out willy-nilly. To my frustration, we all found that a 20% gratuity was automatically added to all our checks. This I felt was beyond unacceptable for the amount of service/lack of service rendered for the evening.\n-I Approached the manager about it, he said it's company policy and he \"can't do anything about it\", I explained again all the things we had been through in the evening again (we just had this conversation less than 4 minutes ago) he continued with his story of \"it's corporate policy we can't change it\" this went on for over 8 minutes until I told him, if that is company policy then we are all paying cash and leaving no tip at all if that is how the company does business. He then finally agreed to remove the tip, but in a last attempt to still do little to nothing about the situation he tried to just take it off my 1 check out of the 5 at the table. I then requested he take it off all 5 of our checks, which he finally did. After this was all said and done we noticed that your waiter had put 2 $.50 sauces on everyone's bills. There was no notification that it was an upgraded charge for sauce, and not everyone wanted sauce or ranch and I guarantee there were more charges for sauces on all our bill than actual sauces were provided to our table which is fraud.\n\n-It was very clear this waiter thought they would automatically get their 20% tip from our t"
        }, 
        {
            "index": 147, 
            "rating": 3, 
            "review": "Two slices filled the spot.  Watered down expensive drinks.   Love the big bottle of Jack on the counter.  Service was fast but was a quiet night"
        }, 
        {
            "index": 148, 
            "rating": 3, 
            "review": "We ordered a BBQ chicken pizza. The proze I think it's okay. The pizza is great but I counted the chicken strips that they put. They only put like 4 pieces of chicken strip. Anyways service is okay. The waitress forgot to put a plate on our table. She seems rush but I think bec this company is trying to save money. There is only one waitress roaming around the area. Anyways we just dont have any choice thats why we are here."
        }, 
        {
            "index": 149, 
            "rating": 5, 
            "review": "I want to preface this with the following review to be a combination of both dinner and and after dinner visit for alcohol only. They must be doing something right if we went back two times in the same night, right?\n\nEarlier in the experience I did go for dinner and once again had the hangover pizza. It didn't quite have the same flare as last time so I'm open to trying the meatball sandwich next time since from the previous experience I sampled a meatless meatball and couldn't tell the difference. Not to say that the pizza was bad this time because that's far from the truth as I found the dough very soft and light on the muffin top as I walked away!\n\nLater on after watching Michael Jackson one we decided to come back and mosey up to the bar for some alcoholic hi-jinx. What stuck out was the Italian Creamsicle. It was what I call a sleeper drink because it goes down sweet, but once consumed takes you to an inebriated happy place. The bartender appeared like she was training, but beyond being amazingly beautiful she made sure we were always taken care of. Although the drink sounded fruity on paper with banana liqueur, orange juice, and pineapple juice she made mine a bit more heavy on the rum which I had no complaints about.\n\nI would recommend this for a more quieter paced setting and drink selection was pretty extensive between mixed drinks and otherwise. It was reasonably priced and thankfully not overpriced compared to other places. On a plus you can shell out $14 and get a souvenir glass to take home. Cheesy and touristy in that regard, but at least it's memories nonetheless"
        }, 
        {
            "index": 150, 
            "rating": 4, 
            "review": "Heeding our fearless and awesome CM Misti's advice, we opted for dinner before the \"Welcome to Yelp Vegas\" party at the Cathouse later that evening.  \n\nThe plan was to get a slice but when that was $6, we decided to sit and have a whole pizza instead.  A small specialty pizza with a ton of toppings was $18 opposed to 4 slices for $24.  You can't get any more toppings than their ridiculous Miles 10 Meat pizza.  That's \"made with a bolognese mix of veal, pork, and ground beef, smothered in mozzarella cheese, and topped with prosciutto, pepperoni, pancetta, sausage, bacon, mortadella and cappacola.\"  No pizza could possibly be bad when it has all this.  It was really good.\n\n$18 for a small pizza is a little more than I want to spend but this is probably one of the cheapest places to do dinner at Mandalay Bay.  I wouldn't go out of my way to come back here but it's not a bad option for something casual."
        }, 
        {
            "index": 151, 
            "rating": 4, 
            "review": "This place was one if my sons favorite places to eat. He recommended we eat here because of the reasonable prices and great local food. Me and my family had a great time and the server Brandon was excellent and on his game. It's nice having a server that has great timing and a great attitude. The Alfredo pasta was very nice as well."
        }, 
        {
            "index": 152, 
            "rating": 4, 
            "review": "There aren't a ton of restaurants in Las Vegas that make a conscious effort to be Vegan-Friendly. Slice of Vegas happens to be one - you just have to be okay with paying for it. \n\nI got a Buffalo Chik'n pizza. I believe they used Gardein for their meats - fine in my book. Delicious, filling, and unique - it had pizza sauce and buffalo sauce which made it a bit different from standard buffalo fare. Definitely passed my meal grading scale, but failed my I'm Cheap scale, $18.95 for 12\". Thankfully, there are deals to be had. Just do some Googling. \n\nAlso - Happy Hour is legit! 1/2 off appetizers, wine, and beer from 3-6 M-Th.\n\nMy server was great - attentive, friendly, and even suggested another vegan-friendly restaurant, Hussongs Cantina.\n\nAll in all - a solid choice for vegans. I'll be back next time I'm in Vegas."
        }, 
        {
            "index": 153, 
            "rating": 5, 
            "review": "Great people working there! Thanks Gary ( bartender) and Monica (manager) you guys were awesome! We had a fabulous time having drinks and talking. We enjoyed our dinner, thanks Monica!"
        }, 
        {
            "index": 154, 
            "rating": 2, 
            "review": "Passable. Nothing was bad and surely nothing was great- with the exception of the roasted elephant garlic which accompanied the garlic bread. No way that was a 12 inch pizza. Thank goodness I only ordered one with one topping. I would have been really miffed if I would have gotten one of the specialty ones that was 19$ for that dinky of a pizza. Salads are crazy over-priced- I mean crazy...$12 for a salad they said was supposed to have a variety of items besides lettuce. Was almost all lettuce and a pittance of the other items. Beer prices are a little high as well. Service was a mix- waiter was very nice and helpful. However one of the hostesses was literally a deer in headlights. She must have literally stared at me for 4 or 5 minutes while I stood in front of her. I finally had to say I had a reservation and she was like \"Oh\" It was really weird and then sadly her manager remarked that she's \"highly qualified to be a hostess\" instead of saying he was sorry for what happened. Strange management. Incredibly overpriced. A big waste of your time. The taste of the food is just over a 3 out of 5, but their cheapness in ingredient use and price-gouging lands them an overall 2. If you come here, you surely won't leaving saying the food tasted bad, but you might be mad at yourself for the reasons mentioned above. There are SO many better places to go in Vega$ @ all price points where you get your money's worth whether high or low. This is SURELY not one of them."
        }, 
        {
            "index": 155, 
            "rating": 4, 
            "review": "This is a hidden gem located in the Mandalay Place shops. They are reasonably priced, have exceptional pizza, meatballs and typical Italian fare, which are all freshly prepared and at an awesome price point. The staff and barkeeps are always on their game. They have a great selection of beers as well, after all, is there anything better than pizza & Beer! \n\nThis casual establishment is a great alternative to the $200 a plate high end  Italian restaurants you will find on the Strip! Save money and eat well my friends!"
        }, 
        {
            "index": 156, 
            "rating": 4, 
            "review": "We had a personal pizza with pepperoni and meatballs and a pitcher of beer, it was enough for two people. Service was great!"
        }, 
        {
            "index": 157, 
            "rating": 5, 
            "review": "Great experience @ Slice of Vegas!  Thank you for offering gluten free pizza!!!  Delish!  We'll be back!"
        }, 
        {
            "index": 158, 
            "rating": 5, 
            "review": "When we were making last minute plans to take my cousins to Vegas, I prayed and I hoped that we could find an affordable room at the Wynn (vegan paradise!), but with the cheapest clocking in at $900/night (*SOB*), it just wasn't going to happen this time.  So we booked at the Mandalay, knowing there'd at least be the best pool in the world to soothe the pain of not being at the Wynn.  What I didn't know was that there'd also be Slice of Vegas to make me SO SO happy!\n\nIt's a casual Italian eatery, and coming from the suburbs of Philly, I felt right at home.  Nothing fancy, not too much hoopla, just standard American-Italian fare that fills your belly with a warm light (and maybe acid reflux) that you'll carry with you for the rest of the day.  This, my friends, is comfort food.\n\nWhat sets Slice of Vegas apart from the pizza joints of my youth is their amazing vegan menu!  Not even kidding you, it has everything you could possibly ever want at a place like this.  Pizza, pasta, salads (really? you're eating a salad?), appetizers, sandwiches, DESSERTS.....oh lordy, they thought of everything.  They left no stone unturned.\n\nI was lured by the meatball sandwich, and went high to hog heaven with the first bite.  A great roll (they even call it a hoagie roll, like my people back east!!), a rich balanced sauce, the perfect amount of daiya mozzarella, and gardein meatballs, which are probably my favorite outside of homemade.  It came with sweet potato fries, and our darling waitress said the magic words, \"Would you like a side of ranch with that?\"  WOULD I?!  Gimme gimme gimme.\n\nSam was perfectly content with his spaghetti and spicy marinara, and would've come back for it every meal if I'd let him.  We stuffed ourselves silly and had no room for dessert, which was the saddest thing.  I even tried to come back later after a night of dancing, but they were long closed.  Alas, I can add this place to my repertoire of super vegan friendly restaurants in Vegas, and I'm very happy that I don't absolutely have to go to the Wynn to be well fed (to the point of bursting)."
        }, 
        {
            "index": 159, 
            "rating": 3, 
            "review": "Big prices for small portions,  but I guess that's vegas. The flavor was ok. I got the fettuccine alfredo, baby daddy got pizza. Satisfied but won't be back anytime soon."
        }, 
        {
            "index": 160, 
            "rating": 3, 
            "review": "We came here with a party of 15 and got seated in about 10 minutes on a Saturday night.  This place wasn't our first choice, the Burger Bar next door was our first but wasn't able to sit our party.\n\nPrices are decent.  I shared a large Pizza with 3 others and it came out about $20 bucks.  Pizza was thin crust, don't remember seeing any choices for thick crust on the menu.\n\nThey also have a nice tap selection and the service was good.  We also got lucky and got some NFL drink specials while the playoffs were on."
        }, 
        {
            "index": 161, 
            "rating": 4, 
            "review": "Big slice for $5. The pepperoni was good- lots of flavor, wide, flat slices. The crust was thin and crisp. I would've preferred more sauce but I enjoyed this pizza"
        }, 
        {
            "index": 162, 
            "rating": 4, 
            "review": "Inexpensive, gluten and dairy free options. A great little find in an otherwise expensive and glutenous vacation..."
        }, 
        {
            "index": 163, 
            "rating": 1, 
            "review": "If I could give zero I would.  Worst pizza, awful service.  Should never be considered the best gluten free option for anything.  Even the non-gluten folks in our party were horrified- stick to Ellio's."
        }, 
        {
            "index": 164, 
            "rating": 5, 
            "review": "This restaurant is awesome. They provide both vegan & gluten free menus - as a vegan, having options is awesome! They have special drink deals during NFL games & half off appetizers during happy hour. They have quite a few tvs for sports fans. Last time we were in Vegas, we went 4 times because it was so good!! Their vegan meatball sub sandwich is fantastic."
        }, 
        {
            "index": 165, 
            "rating": 3, 
            "review": "Taste-wise, this place deserves 3 stars, I've definitely had better. However, since it's on the strip, the price was very decent and the service was excellent.\nIt's located next to Burger Bar and Hussongs in Mandalay Bay. The have a sit down restaurant as well as take away, where you can order 1 slice. If you sit at the bar, it's a 2 slice minimum and slices are $5 each. If you order from either of these places, the pizza slices are not necessarily fresh. Sitting in the restaurant will guarantee a freshly made pizza.\nWe sat in the restaurant and ordered a 12\" pizza, plain. The menu has some sandwiches and salads and a design your own pasta choice. It was Sunday and they also have a brunch menu.\nThe service was excellent. Our server was attentive and gave us some free dippings for our pizza, Parmesean cheese, ranch and blue cheese dressings.\nThe pizza was eh. I am not a fan of dried oregano and man, they use A LOT of it. I like a sweeter sauce and no dried spices. But, the cheese was good and it wasn't greasy at all. \nIt was $16 and change for a decent size pizza on the strip, not to bad. Just wish it tasted it better.\nI dont know that I'd go back, but I wouldn't say never.\nIf you dont want to spend an arm and a leg and dont mind dried oregano on your pizza, you might want to try this place."
        }, 
        {
            "index": 166, 
            "rating": 3, 
            "review": "Nothing special, nothing terrible. Slightly over priced but then again it is in Mandalay Bay. If you're looking for a decent meal in the resort that won't destroy your bank this is a good place to go."
        }, 
        {
            "index": 167, 
            "rating": 4, 
            "review": "If you are looking for something casual and not too overpriced, then try some pizza at Slice of Vegas.  We started off with the yummy garlic bread and marinara. The New York style pizza was delicious however the pepperoni was a bit too greasy...nothing a little blotting could not fix! The server was very attentive.\nI wish we were there for lunch hen you can order pizza by the slice!!!\nOh, and don't forget to check in for your 15% discount! Every bit of savings counts in Vegas!"
        }, 
        {
            "index": 168, 
            "rating": 5, 
            "review": "The best pizza on the strip hands down! Reminds of a New York pie. Great staff and great food. Tell the Big Slice I said hi!"
        }, 
        {
            "index": 169, 
            "rating": 5, 
            "review": "I don't know how their regular pizza compares to others, but their vegan pizza is the best I've had anywhere! I started with the vegan hot wings, which were just Gardein chicken tenders with their hot sauce and vegan ranch. All good. Then I ordered the meatless meatball pizza.  Seriously, the most legit vegan pizza I've ever had! Our server was also great. We had a party of 11 people, which he handled without a hiccup."
        }, 
        {
            "index": 170, 
            "rating": 4, 
            "review": "Stopped for a quick slice of pizza and a beer, that's what I call lunch in Vegas! It's located in the passage from Luxor to Mandalay and you can't miss the picture and smell of pizza as you pass by. for $4.50 you get a slice with cheese on it and then you build your own pizza using whatever ingredients on the list for like $0.50 each. Pretty large selection of beers and a lot of TVs if you want to watch some sports. They will constantly ask you if just 1 slice is enough for you - don't fall for that, the slices are pretty loaded, you won't fell hungry for the rest of the day!"
        }, 
        {
            "index": 171, 
            "rating": 5, 
            "review": "I discovered Slice on a recent 5 day trip to Vegas.  I went there 3 times.  Since The Strip is primarily a meat eaters paradise full of overpriced tourist traps, I was particularly thrilled to find Slice as a reasonably affordable vegan & vegetarian option.    \n\nTheir roasted cauliflower is served in a cast iron skillet and is drenched in an amazing pesto sauce.  It is an amazing appetizer.\n\nThe Titan Veggie Burger was delicious.  The black bean patty was tasty and the \"secret\" sauce was a nice touch.  \n\nThe pizza was just the way I like it - thin crust, not greasy, with a good sauce.  I had a basic cheese & mushrooms pizza.  My wife had the vegan pizza with shredded daiya which she gave two thumbs up to.  Sometimes places put too much daiya on vegan pizzas, but this one had just the right amount.\n\nTo top it all off, they have a top notch beer selection.  Lots of wonderful west coast craft beer choices.\n\nThe servers and bartenders were very friendly, which was a departure from most of the other places I visited in Vegas during this trip.\n\nThey are located in the Mandalay Bay Shoppes.  Check 'em out!"
        }, 
        {
            "index": 172, 
            "rating": 5, 
            "review": "price is reasonable compare to other restaurants in LV. The garlic bread is good, I ate all the garlic too lol, the steak is sooooo delicious.  My dad loves it."
        }, 
        {
            "index": 173, 
            "rating": 4, 
            "review": "Excellent!\n\nI love Groupon deals because it allows us to try restaurants that otherwise we won't care to visit. This was a Groupon deal that did not disappoint and I would come back and dine here again because of what I ordered the first time. I had the Salmon Portofino and it was delicious!  The filet of grilled salmon was tasty and fresh and served with angel hair pasta tossed in garlic and olive oil with cherry tomatoes and fresh basil. My husband had the Bisteaka, chef's cut of steak grilled to how you like it and came with potato hash and red wine mushroom sauce.\n\nIt was a little crowded that evening so the atmosphere was a little loud. Dimmed lighting. As crowded as it was, though, we were seated immediately and our server was very attentive, always checking on us if everything was alright. This restaurant is located in the Mandalay Bay shopping area. Great experience!\n\nReview #159"
        }, 
        {
            "index": 174, 
            "rating": 4, 
            "review": "Food was very tasty. My wife had a personal pizza with 2 toppings and I had pasta with meatballs. Both were done very well. A little expensive though. With 2 non alcoholic drinks the bill was about $46. Luckily we had a restaurant.com certificate. Would certainly eat here again, preferably with another certificate though."
        }, 
        {
            "index": 175, 
            "rating": 2, 
            "review": "The service was so bad, we were laughing as we left. The manager felt bad and paid for our dinner. Basically as long as you don't get \"Stanley?\" as your server you should be fine.\n\nThe food is mediocre. Pasta's probably from a box and the sauce from a jar. We didn't try the pizza though. \n\nAt least we were just visiting, but never again!"
        }, 
        {
            "index": 176, 
            "rating": 5, 
            "review": "Great place with good food, and a good selection of craft beers.  The bartenders were very nice."
        }, 
        {
            "index": 177, 
            "rating": 4, 
            "review": "Vegan offerings include gooey pizza and the best chocolate cake ever!\n\nAlso, there is a giant cocktail bowl for 4 normal people--or enough for me and a date :)\n\nThey have a fun setup with the menus on cans that double as pizza stands. I brought the whole family and the kids loved the zeppoli!"
        }, 
        {
            "index": 178, 
            "rating": 5, 
            "review": "This sweet elderly woman asked me for help. I thought I would be doing her a favor by taking her $100 restaurant.com coupon off of her hands since she didn't have a smart phone or access to a computer/printer.  My bad...\n\nFirst,  I tried a really nice restaurant,  but they would only let me use $25 at a time. Next,  I drove to 2 Japanese restaurants,  but they both didn't accept the coupon.  Then I drove to a diner, but they closed at 3pm. I should have checked my Yelp app since the restaurant.com app didn't update the diner's hours. \n\nFinally,  I called A Slice of Vegas and made reservations with the friendly receptionist.  I walked all over Mandalay Bay casino,  but could not find the restaurant.  By this time, I was at the fainting/exasperated point.  I called the receptionist again and she patiently guided me through all of the shops to her smiling face! \n\nThe energetic and helpful server, Pete,  called his manager to help me figure out how to use the restaurant.com app where I had to order $75 worth of food to use $50 of the coupon. It was so worth it!\n\nThe \"Choked Pig\" pizza had a fantastic thin, crisp crust which went well with the bacon,  artichoke & whiskey sour cream topping.  The Salmon Portofino was seared perfectly with the moist, fresh, firm fish salted & peppered just right!  I ate the Brownie Sundae with gusto and took the cannoli & tiramisu to go with my doggie bag. Am enjoying the leftovers now as I compose this review. \n\nEveryone at A Slice of Vegas was attentive and understanding.  I really appreciate their help and their amazing food!  I learned a lot and will return again for the sandwiches and salads or maybe another pizza!"
        }, 
        {
            "index": 179, 
            "rating": 5, 
            "review": "This is the Las Vegas spot! Great happy hour, super cheap drinks and 2.50 slices of pizza. What the heck, a diamond! So glad we found this place especially since we have been cashing out this whole trip. Brandon was our server and he was great.  He paced out our apps, salad, and entrees.  He suggested great local draft beers and was super informative about the happy hour menu!  Loved his service and the food was tasty af. If your in the luxor/Mandalay bay area stop in for a cold brew and smiling faces.  High marks!"
        }, 
        {
            "index": 180, 
            "rating": 1, 
            "review": "I stopped by this place because there food seems and looked good, but I was disappointed.\n\nFor a $21 chicken Alfredo pasta I'd expect it to be good and instead I got a flavorless stale cold pasta. \n\nThen for the slice of cheese pizza there was nothing good about it, it was just as flavorless as the pasta I got.\n\nGood employees, good atmosphere, flavorless and overpriced food."
        }, 
        {
            "index": 181, 
            "rating": 1, 
            "review": "We are here on March 27th, first night there, we got there a couple hours before eating and was preparing ourselves for a big night out! We were originally going to the burger bar next door but due to the long wait we decide to try this place. So, With the idea in our heads about eating burgers, we all decide to eat the burgers there. Everyone who had a burger threw up. 5 Of us. Also it was my 21st birthday at midnight so throwing up 2 minutes before my birthday not even able to have my first legal drink from bad meat really was the icing on the cake. \nThanks."
        }, 
        {
            "index": 182, 
            "rating": 3, 
            "review": "Great menu options for all eaters. Service is pretty slow so don't go on a time crunch because they are helping large groups. We spent a total of an hour there waiting mostly. Vegan menu is awesome service not so much. Had to flag somebody down to get our check. Waited over a half hour for the food."
        }, 
        {
            "index": 183, 
            "rating": 3, 
            "review": "Ordered from the vegan menu. Food was okay, but not special, especially considering the prices. I will say the vegan chocolate cake with peanut butter frosting was delicious."
        }, 
        {
            "index": 184, 
            "rating": 2, 
            "review": "Tastes like Totinos!"
        }, 
        {
            "index": 185, 
            "rating": 5, 
            "review": "So excited to find a vegan menu in Vegas!  The garlic bread was amazing, and the server was so friendly and helpful.  Best part of our trip!"
        }, 
        {
            "index": 186, 
            "rating": 3, 
            "review": "After 6 days in Vegas (for work), all I wanted was normal food. Ingredients I understood with familiar flavors. Slice of Vegas is exactly that. \n\nThe Not Yo Mama's Garlic Bread really does come with an entire garlic bulb on the side. Great for you, bad for your neighbors and any surrounding vampires ;) \n\nThe spicy marinara has a good kick too it. Not overly spicy, but enough to satisfy your taste buds. Restaurant has a sports bar vibe with TV's in every direction and an impressive beer menu. Worth eating at when you want a relaxing, casual evening."
        }, 
        {
            "index": 187, 
            "rating": 5, 
            "review": "We were in Vegas for a couple nights, went the first night at the happy hour. Service was great, lots of selection for beer. Roasted cauliflower appetizer was great. Went the next night, service was excellent, beer & food were great. Talked with the manager about the service and he was great. When we go back, we definately stop here again!"
        }, 
        {
            "index": 188, 
            "rating": 5, 
            "review": "What a cool place to grab a slice, this place Is awesome with tons of tvs playing sports and they have an old timey jukebox. Pizza was amaz-balls!!! I did notice they have a to go window if you don't want to sit down and eat. Will be putting this in my rotation when visiting Vegas."
        }, 
        {
            "index": 189, 
            "rating": 4, 
            "review": "I had read some mixed reviews for this place, which is true of many places I have visited.  In town for a conference at the Mandalay Bay, we wanted to try someplace inside the hotel complex and avoid walking in the 100 degree plus heat. The menu looked pretty good, so why not give it a try?\n\nThe food was pretty good, and I would go back again if I find myself in Las Vegas again.  I had the soup with sausage in it - sorry, forgot the name - and it is a much better version that the similar soup from Olive Garden.  The cheesesteak sandwhich was tasty, although a couple of pieces of the steak were a bit chewy.  Nice thin fries with the meal.\n\nThe others had pasta, which you can build by picking the pasta, sauce, and proteins, and they looked very good.  Like any good Italian restaurant, there was more than enough pasta for a meal.\n\nSlice of Vegas offers desserts, and they sound pretty good. However, we were too full from the meal.  Maybe next time.\n\nI would go back again and try the pizza because the selection is fairly wide."
        }, 
        {
            "index": 190, 
            "rating": 5, 
            "review": "The pizza and calimari are to die for! Best calimari I ever had, full of flavor. And the drinks are nice and strong! A little on the expensive side for pizza, but worth every penny! Oah and there is free valet parking"
        }, 
        {
            "index": 191, 
            "rating": 4, 
            "review": "My waiter was really cool. He made most of our food choices. He kept the food flowing and our cups full. He helped us compare prices and serving sizes. He took this place to the next level.\n\nWe ordered Mama's Garlic Bread with Mozzarella. It was very yummy. It came as a serving of four. Four was more than enough to hold us over until the pizza arrived.\n\nWe also ordered a pizza. With the waiter advice, we ordered the 12\" Sausage pizza. It was greasy as heck. It had small puddles all over it, but it was just so damn appetizing. It tasted like a oily heaven. We finished every slice of it.\n\nWe wanted to order the chocolate cake for dessert, but our wonderful waiter mentioned and recommended the Homemade Chocolate Chip Cookie with Vanilla Ice Cream and Caramel. drizzles, that wasn't on the menu. I decided to order it. It took about 10 minutes for us to get the cookie, but when we did get it, it looked delectable.\n\nWe tasted the cookie and it was so warm and gooey. We got maybe half way through the cookie before we discovered that the caramel was salted. Not only was the caramel salted, it was salty. It started to become very unbearable. It wasn't the best. I wish I had just ordered the Cake instead.\n\nOnce the lunch was over, my stomach fell. I had to rush to the restroom. Sorry, I couldn't think of a nice way to say it. My friend's stomach didn't start hurting until she got home, maybe 2 hours later. I believe it was the pools of grease mixed with the taste of the cookie.\n\nI know it was sounds stupid, but it was worth it. We will definitely go back. Next time, we'll just  pour off some of the pizza grease and skip over the cookie."
        }, 
        {
            "index": 192, 
            "rating": 5, 
            "review": "I was recently in Las Vegas with my mom and sister. My mom is a very picky omnivore and my sister is a salad aficionado who is vegan friendly. I knew from word of mouth that the vegan menu was stellar here and was not disappointed. I ordered the BBQ Chik'n Pizza and my sister ordered the Romelia's salad. Her salad looked good but didn't taste very good after I had coated my mouth in barbecue sauce! She loved it though. I thought my pizza was great. Both my mom and sister enjoyed the non-vegan garlic bread and my mom seemed to enjoy her non-vegan pizza slices. I wanted an order of the vegan bread but knew I wouldn't have room. Things have sure changed a lot vegan-wise since I was last in Las Vegas in 2003! Slice of Vegas was great and worth the walk and tram ride over to Mandalay Bay."
        }, 
        {
            "index": 193, 
            "rating": 4, 
            "review": "Pretty darned good pizza, and at a price that allows you to still walk away with some cash in your pocket. I like getting a quick slice here while walking by."
        }, 
        {
            "index": 194, 
            "rating": 4, 
            "review": "This was actually my favorite restaurant that we went to on my last vegas trip and boy did we go to a lot of restaurant. \n\nMy friend lysette was in charge of finding a restaurant to eat. She decided to come to this place since there was a lot of vegan choices for her. Which I love that this restaurant does this.\n\nWe decided to order: \nNot your mamma's garlic bread-the bread had roasted garlic with olive oil and pesto. I love pesto. It was super yummy. However, I didn't think it was worth 8 buck but don't get me wrong it was delicious.\n\nHouse shoestring's fries: we decided to get our fries with garlic and rosemary. Fries are fries. Can't go wrong with them. \n\nBoth appetizers were from the vegan menu which was great so we all got to share together. \n\nSwitching over to the meat-eater menu:\n\nChoked pig pizza-we ended up going with 18 in. It was very good. Thin crust just the way I love my pizza. All the ingredient all came together really well. The pesto, the mozzarella cheese, the tomatoes, the bacon, THE BACON, haha was yummy! \n\nOverall, good stuff."
        }, 
        {
            "index": 195, 
            "rating": 4, 
            "review": "Awesome place if you're vegan, vegetarian, and/or gluten free. This place has a TON of vegan options from pizza to pasta to chicken wings! I ordered some vegan chicken wings and a vegan pizza with vegan meatballs. Holy crap, it was good!\n\nOur service wasn't the greatest. Our waiter seemed like he was in a big hurry and was walking away as we were trying to order our appetizers. They also screwed up my dad's pizza twice. All he wanted was a pizza with sauce and grated cheese. They made him a pizza with cheese and sausage and then another with mozzarella and parmesan. He clearly stated, \"Just sauce and parmesan.\" Maybe if the waiter wasn't in such a hurry he would have gotten it right the first time. \n\nThis place is located in the Mandalay Shops in between Luxor and Mandalay Bay. I was staying at Vdara and it was well worth the walk. Next time I'm in Vegas I'll visit this place."
        }, 
        {
            "index": 196, 
            "rating": 3, 
            "review": "I feel that a first time review of this establishment is not a true depiction as we went with an expectation for one certain pie, the mile 10 meats. We were disappointed in the lack of volume of meats on the pie. The toppings did not overtake the pizza and the business may receive reviews from scorned customers throughout the spectrum. \n\nThe location is ideal for access to Luxor and Mandalay Bay and allows for excellent people watching. The shot and drink selections promote an air of indulgence to entice more carb loads food."
        }, 
        {
            "index": 197, 
            "rating": 1, 
            "review": "A greasy, cold shingle sold to me as a pizza slice. \n\nNever again."
        }, 
        {
            "index": 198, 
            "rating": 4, 
            "review": "Came here late at night to satisfy my pizza cravings. They have an option for take out and different types and sizes. I had the margarita pizza which was delicious. Service was quick and they were friendly, I'd go here again."
        }, 
        {
            "index": 199, 
            "rating": 5, 
            "review": "We went to Slice of Vegas last time we were staying at Mandalay Bay.  I was really happy to see they had a vegan menu.  It's not often that you can find great vegan food and great regular food and keep everyone happy.  So this was perfect for my family.  I had the meatless meatball sub which is served with a side salad and then I ordered a vegan chocolate cake to go and it was all excellent!  My family enjoyed their meals as well and we all agreed we would like to return next time we are in town and I will have to try the vegan pizza."
        }, 
        {
            "index": 200, 
            "rating": 5, 
            "review": "I ordinarily wouldn't go Las Vegas, but my wife had a conference to go to, Grandma volunteered to watch her Granddaughter, so I came with for a short weekend away. Being vegan isn't hard, but I wish there were more places like this around.  We were there a month ago and I am still craving that Vegan Buffalo \"chicken\" pizza and those vegan dough balls. \nThe next time come back to Las Vegas will be in a couple years when the new NHL team starts up but the only things I want to do are: eat at Slice of Vegas, watch your new hockey team, play Metallica pinball at the arcade in NY,NY and hike at Red Rock Canyon."
        }, 
        {
            "index": 201, 
            "rating": 3, 
            "review": "This is for the express side only\n\nWe ordered the vegetable slice and the hawaiian. The toppings were really scarce and the vegetable slice I got had one piece of sausage on it. I'm not a vegetarian so I didn't mind but I can see this being a problem for someone who is.\n\nThe crust is actually not bad but overall the food was just \"Meh\" \n\nI did like the fact that the caesar salad came with broccolini which I haven't seen before. I always like more vegetables in my salads so this was a welcomed addition.\n\nIt will do if you want something quick and cheap(er) - but other than that there is no reason to come here."
        }, 
        {
            "index": 202, 
            "rating": 4, 
            "review": "Love the all VEGAN menu! Many choices and all very delicious."
        }, 
        {
            "index": 203, 
            "rating": 5, 
            "review": "The pizza and beer selection fantastic! \nOrdered a small 'Choked Pig' and it was plenty for two\nThey have some great options on tap; if you're not sure, ask for a sample!\nCannoli for desert was good: crisp flaky crust and balanced filling.\nLate lunch= great service. Immediately seated and very little wait for food and drinks."
        }, 
        {
            "index": 204, 
            "rating": 5, 
            "review": "Amazing vegan options. We had the vegan garlic bread and vegan BBQ chick'n. Also, the mussels as an appetizer. I tricked my parents to eating vegan food without their knowledge and they liked it a lot!"
        }, 
        {
            "index": 205, 
            "rating": 4, 
            "review": "It was a very good place to eat for a full sized meal...it didn't have that \"wow\" factor flavor i was hoping for...but the bread appetizer with a roasted garlic came close and is a must try"
        }, 
        {
            "index": 206, 
            "rating": 5, 
            "review": "I love this place! My friends and I ordered an 18 inch pizza with huge pepperoni and meatball slices. It was a bit greasy, but all in all a good pie. Oh also you have to try the watermelon lemonade! Yum!"
        }, 
        {
            "index": 207, 
            "rating": 5, 
            "review": "It was a nice little Sunday afternoon of sightseeing but it was time for some football. The Bills/Raiders game just started and I was looking desperately for a decent bar that was showing the game. I had previously visited 3 bars but the TV's were either small or scarce. As I walked into Slice of Vegas, I noticed that it was impossible to have a bad seat so a friend and I decided to have a seat at the bar. I asked if one of the TV's in front of us could be changed to the game and the bartender kindly obliged. I checked in via Yelp and received a 15% discount. I knew right then that I was at the perfect place.\n\nWhen I found out they offered pizza by the slice, I decided to order a pepperoni along with some Stella. It was a blissful 3 hours. The bartenders and manager were really friendly and funny. If I lived in Vegas, I would definitely return for some yummy bar food, beer, and football."
        }, 
        {
            "index": 208, 
            "rating": 4, 
            "review": "Wow. I'm actually kinda shocked this place has a good amount of bad reviews. \n\nThis is one of my more favorite places to go out of my way for in Vegas for many reasons:\n\n- It's easy to get to. Since it's on the Luxor side of the bridge to Mandalay, don't even bother with the nightmarish Mandalay Bay parking lot, and opt for super easy parking on the Luxor upper parking deck. It always seems to be a shorter and easier walk.\n\n- They have an AWESOME VEGAN MENU with so many amazing offerings. I'm so glad they are advertising this now because before it was kind of by word of mouth only.  The vegan meatballs are a must! You can also get GLUTEN-FREE pizza, although it's only offered in one size (I believe 10\") and does take a bit longer for them to make. They use Daiya Cheese, which is the best! They'll also add it to your vegan salads and other dishes if you ask nicely.\n\n- Great beer selection. Lots of imported stuff. Lots of good stuff on tap. Read the blackboard for the latest.\n\n- They have a to-go window. Convenient!\n\n- Wait staff is friendly, but yes, a little slow. This place gets busy though, and there is a back room where they have a lot of parties from the conference goers. So most of the available wait staff is stuck having to deal with that. No completely their fault. They could do with one less person at the front.\n\nNEWS ALERT FOR THE VEGANS: was told by the waitress last night that the chocolate cake, cheesecake, and the zeppoli (from the normal dessert menu listed on the coffee cans at your table) are all VEGAN! Don't miss out on these."
        }, 
        {
            "index": 209, 
            "rating": 3, 
            "review": "Service was great, with friendly and attentive servers.  We had a party of 3 adults and 3 kids under 10, one a 7 month old. Definitely a kid friendly atmosphere. We went for a late lunch around 3. It was happy hour so drinks and appetizers were 1/2 off.  Calamari was slightly overdone, more brown than golden.  The family size pizza was enough to feed us all.  It had a thin crust, and we got 1/2 pepperoni and 1/2 cheese. Both halves were very greasy with oil dripping off.  However, the menu is extensive with sandwiches, burgers, specialty pizzas and pasta, so I wouldn't rule out a return trip."
        }, 
        {
            "index": 210, 
            "rating": 3, 
            "review": "Very friendly staff at dinner last night and lunch today.   The pasta was pretty good.  It was great to have a vegan cheese option for the pizza.  Unsurprisingly for a strip restaurant it was pricey.\n\nI would have given it another star but for the utter lack of attention I received at lunch.  Sat at the bar for 5 minutes without a bar tender coming over.  Then I sat at a booth.  The waitress promptly took my order and brought my soda.  That was last time I saw her until my lunch was finished.  The restaurant wasn't that busy so I don't understand why I was ignored."
        }, 
        {
            "index": 211, 
            "rating": 4, 
            "review": "Quite honestly, don't understand the awful reviews. Yes its pricey BUT when you go out to dine, do you mind paying a little extra for great service? Nuh uh..I sure don't.\n\nFood is good, not great orgasmic great. My first experience was latenight in their deli side of the restaurant. We went to dine in but it was too late so we went over to the other side. The young girl with the cool hat was a sweet heart. My fiance was very specific about tri cutting her slices and light on this heavy on that and despite the five people behind us, she kept a smile on her face and said absolutely. We ordered five slices because we didnt want to wait for a whole pizza so we paid twice what we could've if we were fifteen minutes patient. I wanted my pizza pronto! The pizza once perfectly customized had good flavor but pepperoni was a bit salty. Try shrimp with garlic...mmmm....Great service not easy on pocket. \n\nRestaurant we dined in a couple days later. Hostess was friendly and server was very attentive as well. We orderd the capri sandwhich with garlic fries ((delicious)) .  My boo ordered the feducinni alfredo with marinara and meatballs extra cheese , She enjoyed it as well. We couldnt resist so we also ordered a loaded slice sliced in half. Tasty but a little cold by the time we ate it, \n\nOh and they have a jukebox.,make everyone listen to what you wanna hear,,,awesome!\n\nWe will be going back for a quick bite"
        }, 
        {
            "index": 212, 
            "rating": 5, 
            "review": "Great food! Great service! Ate here a few weeks ago with a bunch of guys from work that were out here for business. We ordered a bunch of pies for us all to split and some yards of beer. Our server was Meg, she took great care of us and she was super cute to boot. Next time we are in town for business we will definitely go back for the all meat pizza and craft beers."
        }, 
        {
            "index": 213, 
            "rating": 2, 
            "review": "I'm not trying to be a jerk. I'm just a bit confused why this place is closed on a holiday weekend on Forth of July at Midnight. I think"
        }, 
        {
            "index": 214, 
            "rating": 4, 
            "review": "A nice stop for pizza or Italian food on your walk through the mall at Mandalay Bay. They have cozy black leather booths to have a romantic dinner. I tried the meatball sub and it was delicious! It had soft large meatballs that were well seasoned. The sub was also loaded with cheese. They added extra sauce on the side so it would not get soggy. The pepperoni pizza was also fresh and piping hot."
        }, 
        {
            "index": 215, 
            "rating": 5, 
            "review": "Amazing atmosphere and great food. Full list of bottles beer from all over the country. Choice of vegan and gluten free options!"
        }, 
        {
            "index": 216, 
            "rating": 5, 
            "review": "My girlfriend and I go to Vegas about twice a year. Once for a family reunion and once just for us . Regardless of the reason or the time for which we go a Slice of Vegas has become a tradition for us. As a vegan I can attest to the amazing selection of vegan friendly menu items, my absolute favorite is their BBQ chicken pizza and of course the vegan chocolate cake . As a vegetarian my girlfriend loves their pasta and Mac N Cheese. This place is an absolute must!"
        }, 
        {
            "index": 217, 
            "rating": 3, 
            "review": "I came back with kids and sat at the Restaurant this time, and not the To Go counter.  It was much much better.  Calamari was good (ask for marinara on the side).  Pizza and sandwiches were solid as well.  Would be 4 stars as a stand alone, but I can't forget the terrible pizza by the slice."
        }, 
        {
            "index": 218, 
            "rating": 4, 
            "review": "I've gone here twice. The first time, I was extremely happy, because it was Vegan Pizza Day, and their vegan pizzas were all half off! Around $10 instead of $20. Their extensive vegan pizza menu is very exciting and delicious. \nHowever, without the half-off deal, I'm not very excited about this place. It doesn't seem like a good deal. But to be fair it is a restaurant on the strip."
        }, 
        {
            "index": 219, 
            "rating": 4, 
            "review": "I was definitely impressed by Slice of Vegas' vegan menu. I had the meatless meatball pizza and, while certainly not revolutionary, it was tasty. Although the music was a little loud, the restaurant was clean and well-decorated, and we had excellent service. Overall I was pretty happy with my experience."
        }, 
        {
            "index": 220, 
            "rating": 2, 
            "review": "The pizza was adequate: not bad, but definitely not great.\n\nI ordered the garlic bread because some raved about it on Yelp, but after trying it I have no idea why anybody recommended it.  It could have easily been called \"greasy bread\" instead of \"garlic bread\".  It was just THIN slices of Italian bread with some garlic butter smeared on it.  It was better if you took some of the fresh garlic provided with it and put it on top.  I ordered it with cheese which I thought would be a sprinkle of cheese, but turned out to be a big glob of cheese on every slice.  My stomach hurt after eating this stuff.\n\nSome of the folks I was with said they accidentally ordered the vegan pizza earlier in the week and said they regretted it.  You are probably better off eating at Burger Bar next door."
        }, 
        {
            "index": 221, 
            "rating": 2, 
            "review": "First, this place is in a perfect location, right in the middle of the Mandalay Place shops.  Great for pulling in people who want a quick bite.  \nFor this reason, they rip you off with a charge of 7 bucks for a simple slice of pizza.  Didn't notice this until I had already placed my order and that is on me. But I also added a side salad for almost 4 bucks, which I thought would come in a nice container with it all dressed up. No, it comes in a plastic bowl, just some greens thrown in with dressing on the side. Throw in a drink, with lousy options in their dispensers, and you've got an expensive quick bite for almost 16 bucks.\n\nThe pizza wasn't too bad, though nothing special and the salad was too plain.  It was in a place to kill some time, but as much as I love this area, I will not return to eat here."
        }, 
        {
            "index": 222, 
            "rating": 3, 
            "review": "I am giving Slice of Vegas only 3 stars for the simple reason that I got food poisoning somewhere during my stay at the Mandalay Bay and this was one of the places I ate.  I will say, I liked the food better than that and would probably give it 4 stars if I didn't get sick.\n\nI really enjoyed the bruschetta which included tomato bruschetta, olive tapanade, roasted garlic and Italian white beans.  It was really yummy and a nice size portion.  I also had the make your own pasta and got it with mozzarella cheese, pomodoro sauce and artichokes.  I also ordered it with mushrooms but they forgot to add those in and brought them to me on the side.\n\nThe service was ok but it was not busy while we were there.  Overall, I liked this place for lunch but not sure if it was there that got me sick.  I will say, I am leaning towards the buffet..."
        }, 
        {
            "index": 223, 
            "rating": 1, 
            "review": "Worst service ever. Came from Los Angeles with family stayed at the Mandalay bay and asked front desk for a recommendation on pizza because the kids were starving after the pool. We went ahead and took the advise went to this slice of Vegas place waited 20 mins to be seated. Got in sat down ordered and waited an hour for the manager to finally come talk to us about the ridiculous wait time. He said he will check after the waitress had already told us she was very sorry and her manager was made aware of a back up they had in the kitchen. He came up to us very unapologetic and more clueless about the situation. As he was there telling us he will check the times on Order, ...as if we would sit there and lie about wait time., point blank our kids left crying and we decided to leave and not do business with this location where management sucks. Service was the worst. Mad we didn't get to taste the pizza we were recommended."
        }, 
        {
            "index": 224, 
            "rating": 5, 
            "review": "Great food. Be careful when ordering the atomic wings. I ordered them but asked for them to be hotter.  They did it I'll tell you what it just about took me out. Great service they were on it with the milk when I needed it."
        }, 
        {
            "index": 225, 
            "rating": 3, 
            "review": "Not bad pizza wine is pretty good for house red also the 5 for 25 coupon on restaurant .com is a good deal"
        }, 
        {
            "index": 226, 
            "rating": 4, 
            "review": "It was great to see that this place had vegan options.  The vegan pizza and sandwich were actually very tasty.  Just beware that if you order from the counter, that you must sit at the counter seats.  This was not specified when we ordered so we had to find seating downstairs with tables."
        }, 
        {
            "index": 227, 
            "rating": 1, 
            "review": "I'm with the others, why would anyone give this place more than 1 star?\n\n First, it would be awesome if they knew how to cook a pizza or just even serve it hot. \n\nSecond, at a slow bar, it took over 10 minutes to even be acknowledged. \n\nVegas has seen a lot of my money , but this awful place never will again."
        }, 
        {
            "index": 228, 
            "rating": 4, 
            "review": "The service was friendly and the food came out quickly.  The sliced chili dogs had a great tasting chili on them and the fries were crisp and tasty with a slight salt and pepper seasoning.  The wife had the meatball sandwich. The sauce was good and the meatballs were tender and fresh.  The atmosphere was good,  they have a juke box and bar.  In the middle of a great shopping area between Mandalay Bayan the Luxor."
        }, 
        {
            "index": 229, 
            "rating": 4, 
            "review": "We stumbled into Slice of Vegas after having a not so great experience while trying to get a table at Burger Bar next door. I'm so glad we came here! I got a Philly cheesesteak and my husband got the Immortal burger. My husband referred to his burger as \"life changing\" and my cheesesteak tasted like it was really from Philly. The service was fast and great as well, we got in and out in under an hour and 15 min.  We also took some cannoli's to go that were really good."
        }, 
        {
            "index": 230, 
            "rating": 1, 
            "review": "Shoestring fries with Parmesan garlic and garlic aioli was very tasty.  I had a meatball sub with a side of marinara sauce and my wife had the pasta Alfredo with shrimp. Food was okay but nothing spectacular. Service was decent but nothing out of the ordinary. Server refilled our drinks a couple of times and asked how everything was. The shocker was when we got the bill and there was a mandatory 18% tip already added although it was just my wife and I. I don't have a problem adding a service charge for groups of 5 or more but for 2 people. Plain ridiculous. What's worse is there is a line for additional tip on the bill. Not coming back again. Would not recommend to my friends."
        }, 
        {
            "index": 231, 
            "rating": 4, 
            "review": "The service is excellent here.  Last time I went I had 3 servers helping my table. The food is good for the price considering we're in Las Vegas and not NYC.  \nGood beer choices as well"
        }, 
        {
            "index": 232, 
            "rating": 5, 
            "review": "This pizza was amazing! My friends and I stopped while we were visiting. My cheese pizza was amazing. The personal pans are large enough to share it so if you're on a budget it's a good idea."
        }, 
        {
            "index": 233, 
            "rating": 3, 
            "review": "5 stars for having a Vegan menu!\n-2 for the overpriced tiny portions.\n\nOverall, the food was pretty tasty. I had the Buffalo Vegan pizza, while my brother had the sandwich special which he enjoyed. \n\nService was quick and attentive. \nI'd return, but solely because it's one of the few places with an vegan menu on the strip!"
        }, 
        {
            "index": 234, 
            "rating": 3, 
            "review": "Pretty good... not great but good. I had the chicken parm... The lasagna is supposedly really good. The pizza looked really good too"
        }, 
        {
            "index": 235, 
            "rating": 3, 
            "review": "This was my second time here (first time being the same time last year) The service started off a little spotty at first but got much better as the evening progressed. Everyone had different items but I had the roasted cauliflower and a side salad as my meal. The roasted cauliflower was quite flavorful for a pizza place and I wish I had ordered another one. My friends Salmon left something to be desired however and we sent back the first one as it was way over cooked. The second one came out better but we learned our lesson, do not order a fish dish at a pizza place even i they advertise it. All in all, everyone else seemed to enjoy the rest of there meals and drinks. I am sure that when I  am back in Vegas again for work, I will be heading up to slice for either pizza or just the roasted cauliflower."
        }, 
        {
            "index": 236, 
            "rating": 5, 
            "review": "Seriously awesome pizza ! Try the Il Mangino ! It's freakin awesome . Totally boss service and just as tubular staff. Their specialty drinks are to die for and the garlic bread comes with A REAL CLOVE OF GARLIC !!!"
        }, 
        {
            "index": 237, 
            "rating": 4, 
            "review": "Really enjoyed this choice after a morning of walking the strip - wanted something simple and good and found it at Slice of Vegas. Was skeptical of the \"NY Style\" pizza advertised (I'm from Jersey).  Nonethless we ordered two personal pizzas (the meat one - and the Il Mangino). I was wholely impressed - I just loved the Il Mangino - the salad on top of a pie with prosciutto and ricotta was amazing. Our waitress let me try several of the beers on tap - recommending a few. All-in-all a great experience."
        }, 
        {
            "index": 238, 
            "rating": 3, 
            "review": "Eh ... I'm not entirely sure how I feel about this place. I've been to slice of vegas twice now. Both times the wait to sit was entirely too long, so I opted for the to-go bar area instead. I will say that having this little bar area is great for people who want their food without waiting for a seat. \n\nThe quality of the pizza is only so/so (it's a bit too greasy for my taste), and the ready slices taste kinda stale. Definitely opt for making your own pizza if you have the time/money/friends to eat with you (because the pizza size is actually decent). \n\nAs far as trying anything else, I've only had the 'Not Your Mama's Garlic Bread' - which was a let-down (not very garlic-y). \n\nOh also, this place isn't cheap - but where in Vegas is?? But there is a saving grace - it's right next to a Fat Tuesday's - SCORE!"
        }, 
        {
            "index": 239, 
            "rating": 5, 
            "review": "The vegan options at Slice of Vegas are absolutely delicious! My hubby and I shared the chik'n wings and roasted cauliflower and I had the Romelia's salad as an entree while hubs had the meatless meatball sandwich with Cajun fries. While an amazing dinner, our sever Bianca made the experience memorable (especially since it was my birthday) and made me feel like we were her only table. Also, Katie the bartender knows her stuff! Go see these amazing ladies for a delicious meal and fun time!!! We can't wait to come back."
        }, 
        {
            "index": 240, 
            "rating": 5, 
            "review": "This place was perfect!  I was looking for setting of quality and quick.  We  had a few minutes before catching a show in the (Mandalay Bay) a Hotel.The atmosphere was ideal for families.  I will definitely return and tell my friends."
        }, 
        {
            "index": 241, 
            "rating": 5, 
            "review": "Pizza here made my night... Good people and great pizza. They can do anything you ask with a great attitude!"
        }, 
        {
            "index": 242, 
            "rating": 2, 
            "review": "Food was good and price was as expected for a restaurant on the strip. Only issue was the manager was hitting on the hostess when we arrived. They appeared to be uncomfortable, they had to look around him (he was hunched over podium) to greet us. VERY unprofessional..."
        }, 
        {
            "index": 243, 
            "rating": 2, 
            "review": "Walking from Mandalay Bay to the Luxor, we were hungry and saw this Pizza place.  There are two options, sit-down or quick \"order by the slice\" counter seating/to go.  We decided to stop by the quick side and order a couple of slices to dine at the counter.\n\nIt's a typical \"order by the slice\" joint....you select your Pizza slice and they re-heat it and call your number to pick it up.  We ordered 2 slices of Cheese Pizza.\nhttp://www.yelp.com/biz_photos/slice-of-vegas-las-vegas?select=e7il4LoTHrBJ4bjvybT2CA#e7il4LoTHrBJ4bjvybT2CA\n\nIt didn't take too long for the Pizza to be ready.  The Pizza itself was forgettable though.  It was a little Salty and lacked flavor beyond the Salt.  The Crust was a bit like cardboard, very tough.....there's a difference between chewy and tough....I like chewy, but dislike \"tough\" dough.\n\nOverall, we felt like we wasted calories.\n\nReturn Factor - 10%"
        }, 
        {
            "index": 244, 
            "rating": 3, 
            "review": "We jumped in one night looking for a quick nosh without breaking the bank. Food was good and the pizza (we ordered a large pepperoni extra cheese and garlic) was above average; decent crisp crust, tangy sauce and generous toppings.\n\nOne of the better \"on the strip\" pizza places\n\nCons:\nLOUD - they think they're a night club after 6pm\nPricey - Three topping pizza is over $30"
        }, 
        {
            "index": 245, 
            "rating": 3, 
            "review": "Being a Saturday evening, it's hard to find a good eatery without the long wait.  This place, located in the mall between Mandalay and Luxor, was still half empty around dinner time so we sat down right away.\n\nMy BIL got me an Italian Creamsicle to start with, as I needed a drink (one of those days).  Pretty yummy if you like sweet drinks like me.  I ordered the Bowl of Pastabillities (create your own pasta) with rigatoni, pomodoro sauce, and shrimp ($14.95 pasta/sauce + $5.95 shrimp = $20.90).  One of my kids got the spaghetti and alfredo sauce with sausage and shrimp (+ $3.95 sausage = $24.85).\n\nThe pasta was just okay, nothing special.  My hubby's meatball sandwich ($12.95) was okay too.  My mom and sister shared a Caesar salad ($11.95) and an 18\" Choked Pig pizza ($29.95), which had pesto aioli, mozzarella cheese, bacon and artichoke mix, topped with chopped basil and whiskey sour cream (they wanted to try something different).  They said that the taste of anchovies in the Caesar salad dressing was strong, and the pizza was eh (I tried it and I didn't really like it).\n\nOverall, the food was average at best but overpriced.  Service was nice so I gave it 3 stars."
        }, 
        {
            "index": 246, 
            "rating": 3, 
            "review": "Came here in a pinch with my cousins for a quick and affordable bite to eat.\n\nThe calamari we ordered wasn't fried and crispy. It was also served with marinara sauce, which was unexpected. It wasn't horrible but definitely needed to be more crispy.\n\nWe ordered the 12\" personal size Hawaiian 5-0 pizza to share. We each ended up with 1.5 slices each. The dehydrated pineapple made it the saddest Hawaiian pizza we had ever seen. Again, it wasn't horrible, but was definitely unexpected.\n\nLastly, we ordered Mama's Garlic Bread. We opted to get cheese with ours and all I could taste was cheese. At least the order came with 4 slices. It also comes with a roasted garlic for you to rub the garlic on yourself. That was different...\n\nOverall, the food isn't horrible but could have been better. Quite average. The service was decent."
        }, 
        {
            "index": 247, 
            "rating": 2, 
            "review": "I came here with a friend who purchased a Groupon. I don't think he realized it was in a strip hotel. Anyways, we made the commute from Henderson and we were pretty disappointed When we arrived We were directed to the bar, unless we wanted to wait even though the place was 30 percent full. \n\nWe started with the garlic bread with pesto. They brought us regular \"garlic bread\" which was 4 slices of Italian bread with a roasted bulb of garlic on the side. It was OK. The bread didn't have any kind of butter or oil on it. It was kind of an interesting take on garlic bread. For my entree I had the meatball panini. It was just OK. The best part were the garlic fries it came with. The meatballs we're homemade, but not that great.\n\nUnless I'm stranded at Mandalay Bay and starving, I will not be returning to Slice of Vegas."
        }, 
        {
            "index": 248, 
            "rating": 5, 
            "review": "If you're Vegan you GOTTA check this place out. They have a full vegan menu of Pizzas, pastas, salads. sandwiches and desserts which include an AMAZING Cheesecake! Worth the trip!"
        }, 
        {
            "index": 249, 
            "rating": 4, 
            "review": "Our waiter Daniel was great!!  Side salads are not listed on menu but are $3.99. Buffalo chicken pizza was good. I ordered the Romania  chicken salad. The chicken was dried out,  but Daniel & the mgr were quick to bring out new chicken. Maybe stick to the pizza imo."
        }, 
        {
            "index": 250, 
            "rating": 3, 
            "review": "Service: Excellent and efficient, super friendly hostess and servers. \n\nMenu: a nice variety of salads and pizzas, Plenty of great beers but the best ones are not on tap. Prices are high but its the strip so I guess that is expected. $18 for a 12 inch cheese pizza is kind of ridiculous but again, being that it's in the Luxor, you know you are overpaying to begin with. \n\nPizza: pretty damn good. It's not what I normally get, which is traditional cheese NY pizza but this is the type of pizza that is great if you get some toppings. We enjoyed it and would definitely get it again. \n\nSalad: perfect amount of dressing to veggies. Tasty and fresh.\n\nOverall: if you are in the Luxor this is a good option. Would I go back just to eat here again, probably not. But if I was over this way, I would def eat here again."
        }, 
        {
            "index": 251, 
            "rating": 5, 
            "review": "Good bang for your buck if you are staying in the hotel! The crust has a nice garlic flavor and the pizza was really fresh and hot"
        }, 
        {
            "index": 252, 
            "rating": 2, 
            "review": "Despite the recent 5 star reviews, I really think the 3.5 star rating on Yelp is an accurate representation of the food and service you'll get here.\n\nThe pizza was incredibly salty, which made me want to drink more water. But the waiter never came! She seemed really busy because the restaurant was closing in 30 minutes, which resulted in us waiting a long time to put in our orders. My water never got refilled either. \n\nThe food is a 2/5 and so is the service."
        }, 
        {
            "index": 253, 
            "rating": 2, 
            "review": "I wanted to like this place but I just don't. They have an entire menu that is Vegan and I love that but honestly the pizza was mediocre and WAY overpriced. You can get a better tasting and cheaper vegan pizza at Whole Foods. The roasted cauliflower was good but nothing amazing. I feel bad for the amount of money that we spent here, it could have been used for something much better."
        }, 
        {
            "index": 254, 
            "rating": 3, 
            "review": "This was OK pizza, we ordered the 10 meat specialty pizza and it was super salty; the crust was perfect though.  I ended up scraping most of the topping off to cut the salt and then it was edible...the waitress knew it was salty, she brought us water and told us a story about her 10 meat pizza experience, I wish she would have warned us. The restaurant had a great sports bar atmosphere and our waitress was attentive."
        }, 
        {
            "index": 255, 
            "rating": 5, 
            "review": "Awesome vegan options! Totally loved the food and the service! I will so be back...even though I was the only Vegan at the table--- all the non Vegas LOVED their food--- Pizzas and fettuccine Alfredo... Wonderful family dinner... Thanks Slice of Vegas!!"
        }, 
        {
            "index": 256, 
            "rating": 1, 
            "review": "DON'T WASTE YOUR MONEY.\nPizza slices are not fresh nor can you get a topping as simple as garlic on your slice. Fried raviolis are obviously frozen and thrown in the fryer. There are a lot of great pizza places around, New York New York has a great one. Service was horrible. This was the only negative eating experience we had in Vegas. I don't like \"fast food\" pizza (Pizza Hut etc.) but honestly, this pizza was worse."
        }, 
        {
            "index": 257, 
            "rating": 3, 
            "review": "Items Selected:\nPepperoni New York Slice - $3.95 \nMamma's Garlic Bread - $8.90 with Mozzarella - Italian bread infused with roasted garlic, brushed with more roasted garlic butter and accompanied with a roasted garlic head\n'Choked Pig - $18.95 - Pesto aioli sauce, Mozzarella cheese, sun dried tomatoes, bacon and artichoke mix finished with chopped basil and a whiskey sour cream\nZeppoli - 8.45 with Caramel - Golden fried pizza dough balls tossed in a mix of cinnamon and sugar, drizzled with chocolate\n\nLocated in the Shops at Mandalay Bay close to the entrance of Luxor it was largely a matter of their participation in restaurant.com's discount program that led me to Slice of Vegas and having received $100 in gift certificates to the website nearly one year prior it was with $25 towards a minimum $37.50 purchase that I sat down at a rounded booth made for four, the USA vs. Brazil basketball game and Dallas Cowboys preseason matchups playing on televisions beneath the din of some forgettable pop songstress.  Billed as a space for \"Fun Italian Dining\" with a take-out station to the left and bar-full of craft brews tucked behind it was just moments before 7:00pm that I took my seat and with the majority of diners tourists with small children the scene was decidedly rambunctious, a duo of servers including the young woman in charge of my table clearly struggling to keep pace with large orders despite efficient back-servers helping to bus tables and refill water.  Unapologetically overpriced like the majority of Strip-side dining it was only after a few questions regarding the possibility of a half-and-half pizza (no for specialties, okay if you build-your-own) plus  a description of the daily specials that I eventually placed an overzealous order and with an appetizer slice of foldable New York style thin-crust quickly arriving from the exterior facing window my first taste was quite favorable, the gentle crunch and pliable crumb on par with that at Pop-Up or Secret beneath a subtly sweet sauce and bubbling fresh mozzarella.  Moving next to mundane garlic bread that no Italian mother would likely lay claim to it was fast on the thick loaf's heels that my gourmet pizza would arrive and with ample toppings showing a keen eye for balance over the nearly cracker thin crust the meal was soon back on good footing, the punchy sour cream a particularly inspired pairing to mellow the marinated artichokes and herbal topnotes from the pesto and fresh basil.  At this point just shy of my gift-certificate minimum I was left with a decision between the restaurant's signature chocolate cake, a glorified brownie sundae, or balls of fried dough and opting for the later with a sidecar of caramel I'm confident to say I made the right choice - each of the seven cue-ball sized doughnuts perfectly crisp and virtually oiless beneath a hefty shake of cinnamon sugar as the duo of sauces jockeyed for position on the tongue's already overcrowded sweetness receptors.\n\nDramatically overpriced without the benefit of a 2/3 discount but featuring a more than competent slice along with the best Zeppoli I've yet to find in Las Vegas there are certainly worse options for quick casual dining on the strip and although neither service nor setting are likely to win any awards I'd happily come back to explore more of the menu if armed with another coupon, a distinct likelihood considering the general dearth of quality on restaurant.com ever since the rest of Mandalay Bay pulled out several months ago."
        }, 
        {
            "index": 258, 
            "rating": 5, 
            "review": "Ranked among the best pizza I've ever had. Will stop there on every trip to Vegas. Loved it!!!"
        }, 
        {
            "index": 259, 
            "rating": 4, 
            "review": "Last review of my Vegas trip: this is a casual shindig located in Mandalay Bay. It's got a huge menu and reasonable rates. Eating here won't break the bank, and then you can go ahead and use the money you saved on Michael Jackson: One tickets. I'd eat here again."
        }, 
        {
            "index": 260, 
            "rating": 3, 
            "review": "Had casual dinner here.  Service was excellent. Food was good.  I had cheese and truffle pizza - so yummy!  My husband had pasta with salmon, but salmon was dry.  Caesar salad was delicious.  Kids shared pasta with spicy marinara which was ok.   All in all a good casual meal."
        }, 
        {
            "index": 261, 
            "rating": 3, 
            "review": "After checking in at Mandalay Bay, we decided to grab some food before heading out for the night. Slice of Vegas is located in the Shoppes at Mandalay Place, which is connected to the hotel and casino, and is perfect for a casual, quick, bite to eat.\n\nMy cousin and I ended up sharing the chicken wings ($9.95) in the medium sauce which was really good. I'm not usually a fan of wings but I loved these! We also made our own pizza and ordered a 12 inch pepperoni pizza for $14.95 and added mushroom for $1.95. The pizza was pretty standard but hit the spot. \n\nIf you are looking for a quick bite or a place to relax after drinking and spending time in the casino, Slice of Vegas is perfect. Also, the pizza is good for hangovers ;)"
        }, 
        {
            "index": 262, 
            "rating": 2, 
            "review": "This place has a nice atmosphere. It's good that they have a menu for vegan/vegetarian but... The food is not good. The pastas have a sauce that contains Flour and water. No spice at all and just basically bland food. Really nice staff and hospitality!"
        }, 
        {
            "index": 263, 
            "rating": 3, 
            "review": "Was ok pizza. The employees were friendly and helpful with their suggestions. Il Mangino was pretty tasty the second pizza which was basically a build your own margherita was so-so."
        }, 
        {
            "index": 264, 
            "rating": 1, 
            "review": "At 4:00 on Sunday 1-26-2014 the young woman at the take out slice was occupied by whatever was on her phone and acted put off by me trying to order. After ordering two two topping slices I was told that the price was fifteen dollars. I stated that a slice on the menu was less than that. This scholar hunched her shoulders and told me the prices were on the menu. After looking at the pool of grease on the display slices and considering her attitude I left. Then, as if I couldn't eat anywhere else, she shouted \"next!\"  Maybe it would have been effective if someone had been waiting. Too many options to have to put up with stupid. Come on folks, teach your servers the basics of customer service. How many bad reviews before people stop even giving you the chance?  And if you are having relationship problems, call in sick. It should not be your customer's problem."
        }, 
        {
            "index": 265, 
            "rating": 5, 
            "review": "Met friends here for dinner.  I had the salmon, vegetables and french fries.  They were all great.  Service was good and the waitress was very attentive to us.  Cool restaurant.  The place was packed, but they got me seated quickly.  We spent a long time talking and eating but they never rushed us to finish and get out.  Classy place."
        }, 
        {
            "index": 266, 
            "rating": 5, 
            "review": "VEGAN REVIEW*\n\nI love this place. It's a must go to for any Las Vegan. There's a full vegan menu containing chikn wings, pizza, pasta and dessert, friendly staff and decent prices. I've had all 4 of the vegan pizza options as well as the chikn wings, pesto pasta, and the zeppolis. Everything I've tried has been perfection! The staff is always extremely friendly! If you're staying in vegas, this place is DEFINITELY worth visiting."
        }, 
        {
            "index": 267, 
            "rating": 5, 
            "review": "So good.  We make it a point to go to this pizza place whenever we are in Vegas.  I'm vegan and my husband is not, and we are both totally satisfied.  I like the buffalo chicken pizza, whatever it is called . . . delicious!  Also last time we got the ridiculous fishbowl drink and it was super tasty and really fun - and huge."
        }, 
        {
            "index": 268, 
            "rating": 1, 
            "review": "Place was cool the first time we went, but we decided to go out of our way again but what was waiting for us, changed it all... 2 hostesses we're sitting, talking and when i asked about the vegan menu, i got sarcastic looks and an even stupider answer. So therefore, i will never return unless i'm starving and happen to be in the Mandalay Bay. Just cuz someone is vegan doesn't mean you should treat them different."
        }, 
        {
            "index": 269, 
            "rating": 5, 
            "review": "We needed a vegan dinner while in Vegas. This place has a complete page of their menu devoted to vegan choices. We had the  buffalo \"chicken\" strips and a deluxe pizza. All was excellent!"
        }, 
        {
            "index": 270, 
            "rating": 5, 
            "review": "Great service and food. Happy Hour prices and selection of appetizers is awesome.\nPortions are big. Definitely going back. Bartender was friendly and attentive."
        }, 
        {
            "index": 271, 
            "rating": 3, 
            "review": "Located inside the Mandalay Bay Hotel (2nd floor), this place is a chic sports bar serving pizzas, burgers and other Italian food items at reasonable prices.  Menu is relatively extensive for a sports bar and certain food items like \"curry pizza\" sound pretty interesting!\n\nSo, 2-3 months ago (sometime in June 2013) two friends and I went in for late night and shared a truffle pizza, a burger, 2 cups of Tuscan soup, and roasted cauliflower appetizer, all of which tasted not bad at all!  I loved the roasted cauliflower, and the boyfriend loved the pizza.  The soup was sorta bland and too watery, though.  Service was prompt and friendly.  Total paid just about $70 including tax and tips, and all three of us walked out with full, happy stomachs."
        }, 
        {
            "index": 272, 
            "rating": 5, 
            "review": "Yummy vegan pizza! The buffalo chicken pizza was delish and the crush was equally as good. The small \"individual\" is enough for two people if you're not terribly hung over or starving. The beer is expensive - $8 for a pint - ouch - but I guess by the 3rd day I was used to Vegas prices! The vegan menu looked so good - can't wait to go back and try more."
        }, 
        {
            "index": 273, 
            "rating": 3, 
            "review": "Kids meals good deal..entree or pizza, one side, beverage for $10.95. Mac and cheese kid entree was good. Fruit bowl as choice of side dish was huge and fresh. On adult menu, skip the Il Mangino. Prosciutto was super salty and over baked making it hard. Ricotta was sweet. Weird. Overall flavor was just not right."
        }, 
        {
            "index": 274, 
            "rating": 3, 
            "review": "Fast and quick pizza at the pickup counter.  Food was reasonable.  Staff was very helpful and friendly.  For a quick bite to eat, stop by.  Not the best pizza I've had, but also it certainly was not the worst.  Atmosphere is casual and friendly."
        }, 
        {
            "index": 275, 
            "rating": 5, 
            "review": "I had the chicken parm witch I thought was pretty damn good but my opinion could be clouded by the great tasting mules and the very beautiful staff. I came here alone but never felt by my self. The bartender/waitress Melia was very attentive and helpful with recommendations. Definitely coming back with the wife and friends"
        }, 
        {
            "index": 276, 
            "rating": 5, 
            "review": "Great food. The il Mangino pizza is amazing. Wings and fries super tasty.  Great service and super friendly staff. Will definitely come here again next time I'm in Vegas."
        }, 
        {
            "index": 277, 
            "rating": 3, 
            "review": "This is only a review from the take out.\n\nShort: Pizzas were okay and great when you've been drinking, but not Cosmopolitan Secret Pizza great. Crust was a bit bland. Service was spotty. A bit pricey too ($23) for a 18 inch pepperoni \n\nCame here at 11:15PM or so I believe and they we're half way closed, but no problem could still buy the pizza by the slices!\n\nI could not order any new pizzas, but in case you wanted to, it is $18.95 + $1.95 per topping for a large (18inch), 12 inch was $9.95 + $1.95 per topping and have specialties already made that range something like $25. They had some interesting ones like prosciutto and pesto, but I suppose I will have to try next time. \n\nThe girl who helped us was nice, but did not really listen well. My friend asked her to double slice the pizza and with her verbal reply we believe she understood. Unfortunately we walked quite the distance already to realize that she didn't, nor did she reheat the pizzas. I suppose reheating is a personal preference as the pizza was still warm, but to me, if I'm paying $23 for a large pepperoni, I expect it to be hot. \n\nIn the end, a good spot for drunken eats, but many better options on the strip."
        }, 
        {
            "index": 278, 
            "rating": 5, 
            "review": "I absolute love the vegan menu! From the meatless meatball subs to the garlic Rosemary fries own could be in Italian heaven for a while. Oh, and yes, there's vegan dessert !!!!!"
        }, 
        {
            "index": 279, 
            "rating": 5, 
            "review": "I had heard from many people that eating vegan in Vegas was fairly difficult. I found quite the contrary. I also was coming from a highly isolate hunting community in the middle of northern Canada, so I could be a bad judge but many restaurants in Vegas not only offer vegan options but have a fully vegan menu available upon request. Slice of Vegas was of our first stops, the night we arrived. We were famished, of course. Slice of Vegas is located in lovely Mandalay Place which is easily accessible from the Luxor hotel. Unfortunately, the restaurant was full, so we didn't get to dine in but the waitress told us we could order from their take-out window. That's what we did. Ana and I opted on sharing the BBQ chick'n pizza, Dave went for the meatless meatball sub and we all got a slice of their peanut butter chocolate cake for dessert.\n\nThe food was incredible, flavourful and even the biggest meat-eater would not be disappointed with the vegan food. The cake was simply delicious that I can't help but rave about that all on it's own. It was moist and extremely chocolatey, along with that delicious peanut butter creamy frosting. It was the perfect place to start off my palate's vacation."
        }, 
        {
            "index": 280, 
            "rating": 3, 
            "review": "FYI, this is located in the Shops at Mandalay, across from LUSH.  It might be easier to get here via Luxor than the Mandalay parking garage..... \n\nI hit up this place with a Groupon in tow.  I was here on a mission -- try the vegan pizza.  Sat at the bar, ordered a (crazy expensive) beer, and ordered the 18\" vegan \"faux pie\" pizza to share with the BF.  Pro tip: the 12\" pizzas are TINY and a rip off at $20 each.  For $30, the 18\" pizzas are still really pricey, but at least you can feed 4 people off of it. (Or two people with plenty to take home!)\n\nThe pizza was super tasty - good crispy crust, nice sauce, good vegan (Daiya) cheese to veg to crust ratio.  If I didn't have to fight my way through the hot mess that is trying to park at Mandalay Bay, and it weren't so expensive, I would eat here all the time! That said, I probably won't frequent this place due to those problems.\n\nThey have a great selection of very expensive beers (I think the cheapest is a $6 bud light equivalent), but that's probably par for the course at a casino.  They have a few good quality drafts (Stone IPA!) and lots of good bottles.\n\nThey also have a few vegan/veganizable pasta options ($12+) and salads ($10).\n\nPizza was delicious leftover cold the next day, so if you're staying at Mandalay, just get the large and eat the rest when you're hungover then next morning.\n\nService was Ok, not lacking nor exceptional.  No restroom.  There are lots of TVs for sports watching (did you know there's a CrossFit Olympics?! that's what was on while I was there.  Nothing helps you work up an appetite like watching impossibly thin and muscled women doing 500 deadlifts and pullups, amirite??)"
        }, 
        {
            "index": 281, 
            "rating": 2, 
            "review": "Food was good.  I got the lasagna.  Amazing. Wife got fettuccini and was brought out luke warm at best.  Kids got pepperoni pizza and sauce was awful.  Our server was super nice but not attentive to say the least.  Drinks are strong and worth the money.  Would com back again but not my favorite."
        }, 
        {
            "index": 282, 
            "rating": 5, 
            "review": "I went back because my vegan pizza was so good I had to try something else. Got the meatless meatball sub and it was great as well. So nice to have vegan options close by and on the strip. Well done."
        }, 
        {
            "index": 283, 
            "rating": 4, 
            "review": "When I stay at the Mandalay I prefer to eat outside of the resort. I love the pizza here, the sauce and cheese portion is the way I like it, on the light side.\n\nService is quick, staff is friendly.  If you want to get away from the buffet line, this is the place to go."
        }, 
        {
            "index": 284, 
            "rating": 5, 
            "review": "This place was the biggest surprise of my Vegas trip. I went in expecting just some generic meat/cheese replacements, and that is not what I got at all. \n\nWhen researching places to eat with vegan options, this one came up, but I immediately thought to myself, ive done the fake za before, many times, might want to go with something different. I am glad I made the time to come here. \n\nI ordered the not your mommas garlic bread as an app, since it was happy hour this was half off!!!! Then a Back East Buffalo and the \"cheesecake\" for dessert. \n\nThe garlic bread was good. It was probably what I was most excited about, being a garlic bread fan, although it ended up being my least favorite of the three (but still, very good). There were just enough for 2 to share, so if you have more than 2 I would suggest maybe getting a second order or second ap. \n\nThe pizza was great! It was almost perfect, a refreshing bed of carrots and celery with buffalo sauce, vegan ranch, and gardein chicken and daiya. The carrots and celery made this pie for me, and I hate celery! but this was cut thin and the mingling with buffalo sauce and the ranch made it all delicious. I am not usually a big gardein fan, but this seemed to be marinated in the sauce, and tasted fairly good. My only complaint is that the crust was not evenly cooked, with some burnt like spots on one side, but it wasn't very bad, just that part was extra crunchy. \n\nAnd now the star of the show, the cheesecake. I was expecting generic vegan cheesecake, and I got a great tasting cheesecake if it were to stand alone, but alas it didn't, it came with a pineapple compote that was probably the best tasting fruit compote I have had in my life! So good, lighly herbaceous, just delicious. \n\nService was great throughout, and my dining companion enjoyed her slices as well. Next time im in Vegas, this place I will be!"
        }, 
        {
            "index": 285, 
            "rating": 5, 
            "review": "Was in Vegas for the weekend and ate at this place three times. Newly Vegan but still wanting to eat some good food we checked this place out... \n\nWhere They Excel:\nService - we had a male server the first night and Franni (maybe Fani, can't remember her name) at the bar the two second times... they were both fantastic... particularly the bartender, engaging but not over bearing, attentive and made a great moscow mule... food always came out promptly and food runners did a great job... TV's are plentiful so its a great spot to just sit at the bar, drink and watch some games..\n\nFood - awesome. We had the buffalo pizza, the bbq one, pasta, garlic bread and a  custom made noodle combo.. all vegan, all delicious... the roasted cloves of garlic on the garlic bread were amazing... pro tip, get the buffalo sauce and throw it on the garlic and pesto bread... you're welcome...\n\nThere really isn't anywhere they don't excel... this place was great... the non vegan stuff actually looked really good as well and I didn't see too many dissastisfied customers... definitely recommend.."
        }, 
        {
            "index": 286, 
            "rating": 4, 
            "review": "A rarity in Vegas: A fun spot that's not too spendy and a damn good value. Had the angel hair with salmon and the piece of fish was as well cooked as you'll ever find and it was high quality, too. Nice, casual beer and wine list. The kind of place you run out to for a quick bite if you're ever on a three-hour layover ... and a place I'll get to on every trip to Vegas from here on out."
        }, 
        {
            "index": 287, 
            "rating": 4, 
            "review": "Mmmmmm big pizza slices with huge pepperoni slices . Hot and fresh and greasy mmmmm ate before fantasy show . The 5 dollar pizza slice beats the 8 dollar popcorn at the shows . Did not have time to sit down and eat so we took a slice to go"
        }, 
        {
            "index": 288, 
            "rating": 2, 
            "review": "Food was fair but service was horrible!  Took an hour to get 2 gluten free pizzas and 2 pastas.  Not busy at all yet the waiter never came to our table either before or after food came.  When mentioned to him upon receiving the bill his reply was \"yeah - it happens!\""
        }, 
        {
            "index": 289, 
            "rating": 4, 
            "review": "We used a restaurant.com coupon which made a great experience better. The offering of beverages both alcoholic and non-alcoholic was large. They had a great suggestions of combo pizza, pasta, and sandwiches, but then you could build your own of all these offerings. They also had gluten free, vegetarian, and vegan options. This flexibility creates a great place for picky eaters. The atmosphere was fun and lively and the shirts offered for sale were hilarious. \n\nThe family size pizza was good for 2, not sure it would feed 4. The individual feeds 1 nice size adult. The bowls of pasta are substantial and the add ins were worth it. There was enough protein and added veggies to have with your last bite of pasta.\n\nWill be returning for great thin crust pizza."
        }, 
        {
            "index": 290, 
            "rating": 4, 
            "review": "Excellent service.  I can't remember his name but he was extremely attentive and accommodating. \n\nGreat happy hour. Pizza by the slice.  \nWould like to try the specialty options next time.  They offer sauces other than marinara A+++! \n\nThe calamari was cooked perfectly."
        }, 
        {
            "index": 291, 
            "rating": 5, 
            "review": "This pizza is a thin crust that is fantastic! I am not gluten-free but my best friend is and she ordered a fantastic pepperoni pizza and I could not tell the difference! Also the manager came out in and asked if we had any requests, we wanted gluten free beer which is Estrella Damm Daura, a gluten-free beer, so we had of beer pizza party on site! Thank you Andy and crew!! Capital awesome!"
        }, 
        {
            "index": 292, 
            "rating": 5, 
            "review": "I wasn't sure what to expect, but it all worked out just great. Laid-back atmosphere, very friendly staff, great selection of local beers, and most impressively, a full vegan menu!! Thank you thank you for being so accommodating & delicious."
        }, 
        {
            "index": 293, 
            "rating": 5, 
            "review": "I didn't know Slice of Vegas has the largest vegan friendly menu in town! The food is scrumptious, vegan cheesecake is a fantastic dessert and the staff is the coolest!!!  Love it"
        }, 
        {
            "index": 294, 
            "rating": 4, 
            "review": "4-stars for Happy Hour, otherwise a bit pricey but what in Vegas isn't? $15 for Spaghetti Marinara in a Mall (Yes it's not in the hotel but in the Mandalay Mall) is a bit pricey.  I like NY Style pizza and they have it although the sauce is a bit bland.  Big pieces.  $2.50 a slice for cheese during Happy Hour (min two slices per person) is great plus half off beer and wine. Good service.   It's SO hard to find decent dining at a reasonable price on The Strip. Everything in the hotels (aside from fast food) is SUCH a rip off. This is one of those few places that is attached to Luxor/Mandalay Bay and is decent food at a reasonable price in a good atmosphere. So as a result, I'm giving it 4 stars."
        }, 
        {
            "index": 295, 
            "rating": 5, 
            "review": "Great pizza/Italian spot in Mandalay Bay.  We tried the fried ravioli as an appetizer and it was the best I've ever had!   The pizza is very good as well.  It's more of a thinner crust that has a crisp bite to it.  I have ate here many times and it never disappoints.  The staff is always friendly and the service is quick and easy so you can get in and out and get back to gambling in the casino!   Keep up the great work CHEERS!"
        }, 
        {
            "index": 296, 
            "rating": 2, 
            "review": "It seems we had a one time bad experience this past sunday. The Tuscan Salad was good but the Nonna's Margherita pizza was very soggy and tasteless. We could see the basil but there was no taste. We told our server ?Brent? but he didn't really seem to care. He brought us our check instead. Having lived around the US including Brooklyn and having italian pizza in Italy, we won't be returning here. I'm glad others haven't had this experience. The prices like most things in Vegas are inflated."
        }, 
        {
            "index": 297, 
            "rating": 3, 
            "review": "Have you ever had Tombstone frozen pizza? Because that's what this place reminds me of. \n\nMy gf and I split a pizza, half cheese and half The Garden. The pizza is thin, the crust is dry. The crust is crunchy and very dry. I wasn't too stoked on it. It's not horrible, but it's not awesome. It seriously just tastes like Tombstone frozen pizza. They do have a decent beer selection though, so that's cool.\n\nThe service was mediocre. Our waitress was cool. She was nice and pleasant and took care of us. The service is just slow, maybe she had too many tables? It took awhile to get our food, it took even longer to get our check. At least she was attentive. \n\nIt seems to me most people who are giving it high ratings are eating off the vegan menu. I would have gladly eaten some items from the vegan menu to try it out, but my gf wasn't feeling it. \n\nI wouldn't eat here again off the normal menu, but I'd try the vegan menu just to see if it really is all that it's hyped up to be. The only reason they got 3 stars is because they have some solid craft beer choices."
        }, 
        {
            "index": 298, 
            "rating": 4, 
            "review": "We found this place browsing for events on facebook. They had a special for National Cheese Pizza Day.  $1.99 for a 12 in cheese Pizza. Available only on 9/5/2016. Incredible deal considering that the pizza is huge and delicious!!! Limit was 1 per guest and additional toppings was $1.75 each.\n\nWe were one of the first there so we were greeted and seated right away. Julie was our waiter who waited on us very nice and kept making sure we were ok.\n\nWe ordered the jalapeno mac n cheese. I'm usually not a fan of restaurants mac n cheese but this. Omg. So good. It had bacon bits in too. My husband and I shared as an appetizer. It was served in a bread bowl. Which made it even more amazing. We also ordered my boys dough balls to play with while we waited for our food.  They were $2 each and so worth it.  The boys really enjoyed them lol \n\nOnly down fall for me was that they had no discounts on beer for locals. I understand being inside a casino on the strip they up beer prices for that reason. But again being local I wish I got a discount. They had some pretty awesome beers on draft that I wanted to try more of.  \n\nAll in all this place is awesome! I'd come back again."
        }, 
        {
            "index": 299, 
            "rating": 5, 
            "review": "Five stars with all !!!\nPizza, sandwiches, desserts, beer on tap nice and cold, second time here and always delicious"
        }, 
        {
            "index": 300, 
            "rating": 4, 
            "review": "I went to Slice of Vegas and was very impressed.  The ambiance was classy yet chill.  The food was wonderful.  We ordered two pizza's upon recommendation of our server David (who was great by the way) and they were gourmet quality.  The salad was fresh and tasty and cannoli for desert was the best!  Don't forget to try the Bannana Bread beer."
        }, 
        {
            "index": 301, 
            "rating": 4, 
            "review": "I love their vegan menu!! Their selection was great and my mushroom and bell pepper sandwich was super tasty! I love the garden salad too!"
        }, 
        {
            "index": 302, 
            "rating": 4, 
            "review": "Loved this place! The vegan pizza was so good. My husband and I shared the buffalo one.  There is a huge assortment of beers but most are bottle, unfortunately.  We alse had some appetizers like the vegan garlic bread, vegan wings and vegan cauliflower. Delicious!  Definitely a must for any vegan in Vegas if you want some good bar type food!"
        }, 
        {
            "index": 303, 
            "rating": 4, 
            "review": "Exactly what the doctor ordered.  Good pizza, great service, casual atmosphere.\n\nWent twice in three days!"
        }, 
        {
            "index": 304, 
            "rating": 4, 
            "review": "Absolute surprise and great find! We were looking for a place to eat and my kids wanted pizza. To our delight not only did they have pizza for one child (really good size portion for kids menu), some of the best mac 'n cheese I've ever had. Plus I had their Antipasto salad and my husband a sandwich. We loved it so much we grabbed a few slices one evening after hanging out in the pool. (You can get it by the slice  - but I recommend if you are gonna need a whole pizza order ahead. It takes 15 -20 min. or they overcharge for by the slice.)"
        }, 
        {
            "index": 305, 
            "rating": 3, 
            "review": "We stayed at Luxor therefore the restaurants as few minutes walking distance from our hotel, my son is craving for Italian so we went for lunch at this place.\nThe boy had Lasagna, as I noticed the food is made in good quality that comes with layers of goodies plus a garlic toast and a very reasonable price for Las Vegas. Wait until my order the server was not happy (dark face) at all since my lunch was only a small side dish (just a soup). ! You cannot force guess to order food then end up throwing it away!\n\nFood quality:  good price good food 5 stars.\nService: 1 star totally  :( !\n\nPS: I have the same small size dish at Tom's Urban, the sever was so pleasant...! Guess who would get the better tip?"
        }, 
        {
            "index": 306, 
            "rating": 4, 
            "review": "My favorite pizza is BBQ chicken and they serve up a very good version here. The prices weren't too bad with the Groupon my girl had. Service was decent, they have a good amount of beer on tap and they air football in the bar. What's not to like about this place?"
        }, 
        {
            "index": 307, 
            "rating": 4, 
            "review": "Been here a few times, always a good experience.  Food is excellent, not as over-priced as most strip places. Not a vegan, but love the roasted cauliflower. Great location in Mandalay Bay Place."
        }, 
        {
            "index": 308, 
            "rating": 4, 
            "review": "Once I heard that Slice of Vegas has a Vegan Buffalo Pizza, I knew it was only a matter of time before we would wind up here once our plane touched down in Vegas.\n\nLocated in the Mandalay Bay along with another Vegan-friendly restaurant by the name of Hussong's Cantina, Slice of Vegas offers a full on Vegan menu. It mostly consists of Gardein and Daiya based recreations of their regular menu. Hey, this is Vegas damnit! Nobody comes here to eat salad.\n\nWith so many options to choose from, I skipped the Buffalo Pie in favor of the regular version so that my babygirl would be able to share the pizza with me as she isn't too keen on spiciness. The thin crust was so so, but the rest was Daiya & faux meat heaven. I'm not the biggest Daiya fan, but it is great substitute for pizza.\n\nI ordered a side of Vegan Buffalo Strips as an appetizer for myself. If I had known they wouldn't be very spicy, I would've went with the atomic sauce instead. It was odd they put the sauce on the side, rather than smothered into the strips. Perhaps it would've given it more flavor as well as the joy of getting your fingers messy as you much away on Buffalo sauced goodness. I enjoyed this but at $10.95, it's a bit pricey. Even for Vegas...\n\nI wish I was hungrier on this visit as the menu had so many options to from. Various appetizers, pasta, soups, salads, desserts and more. So many pastabilities, so little room in my tummy. The prices could be lower for the quality of the food, but I can't complain too much. Even though I'm rating this 3.5 stars, I'm rounding up for the simple fact that this type of Vegan food in Vegas is a rare find, and the simple fact that I will be back again to try out more things. Oh, and to get that atomic sauce."
        }, 
        {
            "index": 309, 
            "rating": 3, 
            "review": "This was a good place to grab a quick bite to eat. Pizza and sandwiches were both yummy, service was friendly. Not gourmet but a nice switch up from the usual fancy restaurants or buffets that you get in Vegas."
        }, 
        {
            "index": 310, 
            "rating": 3, 
            "review": "Starting out w/ full disclosure, I am not a fan of NY style pizza so I was never going to love Slice of Vegas.....but in the end, I felt this pizza was only okay.....greasy, flimsy crust but there was a nice toppings ratio\n\nExtra props go to the poor staff who was forced to deal w/ the masses of drunken Mandalay Bay beach / concert goers who were completely wasted by the time we showed up at 7pm\n\nThey took orders efficiently & served up the pizza choices quickly\n\nI also appreciated the fact there were many choices for toppings & you could choose or build your own.  They also had quite a number of good-looking side dishes ( such as spicy, roasted cauliflower ) and I imagine this would have been yummy on their cheese pizza..... alas, Sis doesn't like spicy & we wanted to get something Sis, Mr & I could all share\n\nSo we opted for the 4 Cheese w/ Truffle Oil.  I liked the creamy ricotta & the truffle was pungent in smell but unfortunately not in taste\n\nSo all in all, this wasn't all that bad but I'd probably look elsewhere, in seeking pizza nirvana"
        }, 
        {
            "index": 311, 
            "rating": 3, 
            "review": "If this place isn't overrated - I'm not sure what is.\n\nI'll start by saying that I was inclined to try Slice of Vegas because of a Groupon.  As a local - it's always entertaining to spend a few hours on a Friday night at the Strip - looking at all tourists so we figured we could be entertained AND eat for cheap.\n \nNeither one of is drinks alcohol on any regular basis so cocktails were not in the mix so thererefore cannot comment on prices. \n\nWe started our night with about a 15 min wait for a table - which really wasn't so bad.  The staff seemed friendly so I will give them a + in that department aside from the fact that our waitress was a bit peeved that I only ordered water with lemon.  As someone who tries to pay attention to the calories that I put into my body - I don't normally drink soda or juice and I'm sorry but I'm not paying $2.75 or $2.95 for water that had a Lipton tea bag in it .  There are a lot of things that I spend a lot of money on but I'm not going to be ripped off when I don't even want the item.  Had she not been peeved - she would have gotten our standard 20-25% tip. \n\nAs far as food - we ordered an antipasto app - I think it was about $11.95.  It was decently sized and had a good amount of taste but I think I'm just spoiled coming from back east.  I'm used a really hearty platter when I get an antipasto.  I am also looking for more meat and cheese in Vegas and it seems no one gets it right. In addition to the antipasto - we ordered a 12\" meat lovers pizza.  It too was tasty and I will say that it was MUCH tastier than Grimaldi's (who everyone raves about) but seriously - damn near $20 for a 12 inch pizza and $30 for a large .. You have to be joking.  There is no way in hell that I would EVER pay $30 for 16 inch pizza - I don't care what's on it. \n\nSo - all in all - for a tourist walking thru the Shoppes at Mandalay Bay dying for pizza - more power to you.  For a local - don't waste your money.  There are plenty of places in town with mediocre pizza for less money."
        }, 
        {
            "index": 312, 
            "rating": 4, 
            "review": "This place is good if you're craving pizza especially as a vegan. Service was good, every employee was really friendly and smiled.\n\nOrdered cauliflower, vegan wings, chicken parm and the vegan hot sauce with ranch pizza (forgot what it was called)\n\nAbout $70 with iced tea. \n\nEverything was awesome just the prices dig a little deep in your pockets for a small portion."
        }, 
        {
            "index": 313, 
            "rating": 5, 
            "review": "Stopped by for lunch after sitting at the pool all morning. Honestly just hoping for even a decent slice in the middle of the desert but the waitress Bianca had a great personality and recommended the il Mangino. Not the type of pizza I would normally order but turned out to be really good. I should knock off a star because the water they brought us tasted TERRIBLE but their solid selection of craft beers (~20) made up for it."
        }, 
        {
            "index": 314, 
            "rating": 3, 
            "review": "Convenient location with ok italian food. The spaghetti were super bland (cooked without any salt), the salad was fresh. Loved the takeout counter."
        }, 
        {
            "index": 315, 
            "rating": 2, 
            "review": "Very disappointing! :-(\nGood food, but tons of problems!\n\n1st, waitress almost skipped me for drink orders (she would've if I hadn't waved her down as she was leaving!)\n\n2nd, I had to ask for a drink 2 separate times & still didn't get it until friend was like \"he's still waiting for his drink!\", so 3 times total!\n\n3rd, friend ordered shrimp alfredo & it had ZERO shrimp ($2 increase!), so it was sent back only to be returned with a bunch of shrimp tails! It's in a wrap style, so shrimp tails should've totally been removed!\n\n4th, the check was very clearly split up, but still charged wrong!\n\nNot somewhere I'd recommend for groups. It might be ok for 1-3 people, but not sure...\n\nI'm not a person to typically be harsh, but this was kinda ridiculous! I'd've given it a 1 star rating, but my food actually tasted good... But very overpriced!\n$40 for a personal pizza & 2 martinis!"
        }, 
        {
            "index": 316, 
            "rating": 3, 
            "review": "The staff and service was fantastic! The pizza is above average but a bit pricey for what you get. My wife had dirty silverware and I had a dirty plate which got exchanged for another dirty plate...seems like the dishwasher should be fired."
        }, 
        {
            "index": 317, 
            "rating": 5, 
            "review": "Vegan in Vegas isn't always an easy one! Walking Mandalay Place shops my friend pointed out that this place has a vegan menu. Monday night I order the meatball pizza which was amazing with the NY style crust!  I love the fact there is a full menu dedicated to us non meat eating individuals and those of us allergic to Dairy.  I did inform the waiter I had a dairy allergy and he made sure the kitchen staff was fully informed. I was highly impressed and next trip to Vegas will come back and try something different and maybe a dessert."
        }, 
        {
            "index": 318, 
            "rating": 1, 
            "review": "We came because we were suckered by a Groupon. I recommend checking Yelp reviews before buying. The hostess was nice and seated us promptly. Our server was friendly and knowledgeable. We ordered Wings, a 12\" Four Cheese Truffle Pizza, and some Stone IPAs. The craft beer is awesome but at 9$ a pint it's nearly extortion. The wings were some of the nastiest things I've ever tasted and were left untouched without comment from the server, despite his acknowledging that we enjoyed our pizza. The pizza was good, but at 19$ for a 12 inch pizza, there are many stronger options in town. Tip, a Brita water filter cost 12$. Invest in one, your water is third world. \nOverall, this is one place I will avoid with every fiber of my being. \nYour TGI Fridays service cannot overcome your mediocre food, constant  skipping of music thirty seconds into a song and over playing of The Killers."
        }, 
        {
            "index": 319, 
            "rating": 5, 
            "review": "Love it! I'm vegan - whole vegan menu with pizza, pasta, salads, sandwiches and dessert! \nMy dad is a carnivore and also had a great burger!\nLove love love."
        }, 
        {
            "index": 320, 
            "rating": 3, 
            "review": "This place was OK. $30 for a whole pizza. Service was slow to get seated when there were plenty of booths open. Service was also slow to get the check. Both were annoying because we needed to get going. The first time I went here was just to get a slice of pizza and service was fast. I think I will do that next time if I go there."
        }, 
        {
            "index": 321, 
            "rating": 3, 
            "review": "Very friendly service with very mediocre pizza.  THe caesar salad was fresh and yummy but the pizza was caca."
        }, 
        {
            "index": 322, 
            "rating": 5, 
            "review": "Strolling through the shops and decide to get a slice of pizza for fuel.  Walked to the side where we can order to go.  Got a pepperoni and sausage pizza.  The pepperonis were big and pizza was thin.  Flavor was really good especially when it was piping hot.  Definitely got my fuel back after that slice."
        }, 
        {
            "index": 323, 
            "rating": 5, 
            "review": "I often bring family when there in town here. Good pizza and I like the location because I go to Luxor and Mandalay Bay often. Just a slice to go or sit down for a whole pie its all good."
        }, 
        {
            "index": 324, 
            "rating": 2, 
            "review": "I guess I expected better pizza in Vegas with all the former east coasters that have set up shop here. This place goes down as another fail in my book. Service and atmosphere was just fine, but the pizza was just meh and bland. Got a large with meatballs and ricotta to share with wifey and I, a lover of pizza, had one slice and decided it just wasn't worth it. Crust was dry, had no flavor, and I guess same went for the cheese and sauce. \n\nIf you are looking for good pizza on the strip, my bet is still secret pizza."
        }, 
        {
            "index": 325, 
            "rating": 5, 
            "review": "My family was staying at Mandalay Bay for my son's wedding in the Vegas area so we decided to have the rehearsal dinner in the Marquee Room in Slice of Vegas restaurant.  We loved the casual decor of the room and and the convenience for all the guest because it is located right in the hotel.   When I called to reserve the room I spoke with Tiffany Easton, the Group Sales Manager, who was wonderful to deal with.  I contacted her about 3 months before the dinner by phone (I live in NY) and she couldn't have been more helpful.  If she wasn't available when I called she always quick in getting back to me.  There was an extensive menu to choose from (much more than the  menu in the regular part of the restaurant)  and the food was very good (we had several appetizers, pastas and entrees and everything was good except the shrimp scampi was too chewy) .  The servers were excellent and very attentive.  When the dinner was over they let use use the room for another hour over what was contracted for so that other friends and family could stop in and spend some time with my son and his bride to be.    We had a wonderful time and I just want to thank Tiffany and the servers for making it a great night."
        }, 
        {
            "index": 326, 
            "rating": 4, 
            "review": "We had a restaurant.com certificate so we decided to take our friend here for his birthday before the Counting Crows concert at Mandalay Bay beach. I made a reservation but I think it was kind of slow. When we walked up, it looked completely crazy but I think a big party was waiting to be sat. \n\nOur server was friendly and efficient so no complaints there. We ordered calamari and an 18\" ham and pineapple pizza. Everything was really yum. The ONLY complaint I have is that the pizza could've used a bit more cheese. The crust though, omg. I LOVE thin crust pizza but hate how sometimes it gets too soggy or other times it's too crispy like a cracker. This crust was just perfect. It was crispy on the bottom, but soft and chewy on top. If the pizza had more cheese, it would have been AMAZING and deserving of 5 stars. I'd like to go back and next time request extra cheese.\n\nAlso, I got the berry martini and it was TINY and tasted like juice. At $10 a pop, I'd skip the drinks."
        }, 
        {
            "index": 327, 
            "rating": 4, 
            "review": "It's probably 3 star pizza, but I arrived hammered and usually pizza eaten in that state always tastes one star better to me.\n\nWe ordered the garlic bread with pesto ($8) and the family sized 10 mile meat ($29.95).\n\nThe garlic bread was decent, though I like my pesto spread a bit chunkier where you can distinctly taste the pine nuts and parmesan. Overall, not a bad starter.\n\nThe pizza was good, not the greatest in town, but worth coming back to (especially with the restaurant.com deal $25 off when you spend $37.50. Can't beat that!). I like my crust all around to be a bit more chewy and airy...the rest of the pizza was very good, ample toppings. \n\nThe service was friendly and attentive and the restaurant was clean. \n\n+Bonus points for the parmesan condiment on the table being real parmesan (as opposed to the crap they hand you at a pizza chain).\n\nI would return, not at full price, but def with the restaurant.com deal...it was a score."
        }, 
        {
            "index": 328, 
            "rating": 5, 
            "review": "Delicious pizza, excellent service, reasonable prices (for the Strip).  Of note is the vegan menu--they don't treat vegans like they are bothering the staff.  There is a special menu and my wife loved the vegetarian meatball sub."
        }, 
        {
            "index": 329, 
            "rating": 5, 
            "review": "Great options for a gluten free diet!  Food is great and service is wonderful.\n\nIf you like spicy wings, order the atomic, extra spicy.  These will be so hot, they will make you cry."
        }, 
        {
            "index": 330, 
            "rating": 5, 
            "review": "Best vegan restaurant on the strip. The also have regular food but vegan meatballs, and vegan burger are amazing. They also make a vegan chocolate cake that is unbelievable. The waitress Megan rocks. She will recommend all the best tasting food.\""
        }, 
        {
            "index": 331, 
            "rating": 5, 
            "review": "We had a simple 12' pizza and a 32 ounce beer, which they let you keep the class. \nThe pizza was super thin crust, we had mushrooms, garlic and green peppers on it. It was hot and very fresh and tasty, can't wait to go back here again. Delicious, and our waiter Brent was really welcoming and helpful, thank you, Brent."
        }, 
        {
            "index": 332, 
            "rating": 4, 
            "review": "Stopped in here while in the Casino and I was shocked to see a full vegan menu! Our server was great, and we didn't realize we walked in right before close but she insisted we stay. I shared the personal size vegan BBQ chicken pizza with a friend. There was plenty for us both and it was about $18.50. Pretty steep, but it was great. My stomach kind of hurt after, but thats because I don't eat pizza very much. I would go back."
        }, 
        {
            "index": 333, 
            "rating": 4, 
            "review": "Love the VEGAN menu! Thank you so much for so many options. Atmosphere was fun and the food was quite yummy. They had tasty shot specials which made dinner even more fun. Their pesto cauliflower (yes, vegan) was just delicious, even for carnivores. Impressed overall."
        }, 
        {
            "index": 334, 
            "rating": 5, 
            "review": "I'm so hungry today I need something good , just order ribeye with potatoes . Omg the flavor was so good , the meat tender and juice , just perfect ."
        }, 
        {
            "index": 335, 
            "rating": 4, 
            "review": "Located next door to Burger Bar inside Mandalay's shopping area, Slice is a large eatery with full bar, several televisions and a varied menu.\n\nService was prompt and friendly as there was quite a few servers working for early Saturday lunch shift.  Slice offers, pizza's, pasta, sandwiches, salads and burgers.  We tried a burger and a Philly cheese steak sammie.  Both entree's came with choice of sweet potato or regular fries.  We both got sweet potato fries and the portions were huge!  Both of our sammies were well cooked big and flavorful not to mention the prices were considerably cheaper than Burger Bar.  \n\nOne cool item we noticed was the big glass beer taps you can order and have placed on your table or in front of you at the bar.  Basically at least a yard size glass tube with its own tap on the bottom so you can pour your own glass, totally cool.\n\nI strongly recommend trying this place if your stuck in Mandalay and want to eat some place good but still affordable."
        }, 
        {
            "index": 336, 
            "rating": 4, 
            "review": "Good place to go with the family! Tasty pizza and nice staff!\nPrices are on the high side for pizza but it's Vegas! \nOverall it's worth going to this place. Will go back again!"
        }, 
        {
            "index": 337, 
            "rating": 5, 
            "review": "Overall this place was amazing.  We got the garden veggie pizza alone with a hoagie sandwich.  Both items were full of flavor.  Definitely will return here when I come back to Vegas."
        }, 
        {
            "index": 338, 
            "rating": 4, 
            "review": "Except for the pizza, prices are highway robbery. For a shrimp and mushroom pasta with hard garlic bread and a bottle of water, it cost me $28. I know this is Vegas, I don't know what I expected...but I do have to say the pasta was really good. The shrimp were ginormous! Would I pay this again for this same meal? Absolutely not. But it's a decent Italian joint."
        }, 
        {
            "index": 339, 
            "rating": 4, 
            "review": "So great to have a place with a Vegan Menu right by the strip (we stayed at Luxor, and it's accessible from inside of the hotel).\n\nIf you're vegan and in Vegas this is a great spot :) \n\nRecommend the Not Your Mama's Garlic Bread and the Buffalo Pizza, the fries are good too! They do a great job on their sauces (spicy marinara, pesto, etc). I also tried the Spaghetti with meatballs and garlic, the noodles and sauce were delicious, the meatballs were okay, but not exceptional."
        }, 
        {
            "index": 340, 
            "rating": 4, 
            "review": "Came here specifically to try out the vegan options. I got the personal veggie \"faux\" pie, which comes with pizza sauce, daiya mozzarella, and various veggies. It was really tasty and they used a good, moderate amount of the daiya. \n\nDefinitely recommended!"
        }, 
        {
            "index": 341, 
            "rating": 2, 
            "review": "Nothing special here except for the beer selection.\nThe 10 meat pizza was decent.\nThe caesar salad was the most bland salad I've come across.\nThe waiter had no idea what was going on, but it was his first day so I'll forgive him.\nI can't say that the decor was anything special, just looked like every other pub/lounge I've ever been in."
        }, 
        {
            "index": 342, 
            "rating": 5, 
            "review": "Had to head to the South end of The Strip on a tram to get to Slice of Vegas in the Mandalay Bay Resort. It was so worth it. This pizza place has a full vegan menu and super friendly staff. I asked for a taste of the vegan Daiya cheez so my non-vegan sister could try it before we ordered and the chef accommodated my request. Sis liked it just fine so we ordered the meatball pizza and chickUN fingers. It was really a delicious meal. I was also excited that my sister enjoyed it. They also offer Strongbo Cider by the bottle. I haven't been able to find that since I was in England years ago. Their sister restaurant Hussong's Cantina that is just a few feet away also offers a full vegan menu. We did not eat there but absolutely will my next visit. All fellow vegans please support these restaurants that have made the effort to offer us wonderful dining options!"
        }, 
        {
            "index": 343, 
            "rating": 4, 
            "review": "Stopped by for a late night slice of pizza.  Not exactly east coast quality, but still a very good slice.  Crispy crust with some elasticity in the edge, nice and cheesy and the pepperoni was thin and crisp with lots of flavor.  Will definitely grab another slice when I have a craving while in Vegas."
        }, 
        {
            "index": 344, 
            "rating": 1, 
            "review": "Worst pizza i've ever had. Even pizza hut (which sucks) is better than this. We didn't even want the leftovers. My girlfriend which likes most places hated it. Save yourself. You've been warned."
        }, 
        {
            "index": 345, 
            "rating": 2, 
            "review": "They have an awesome beer selection and our waiter (who was also the bartender) was incredible....but the pizza was ehh. We were buzzed and excited we had stumbled upon a pizza place. When our pizza finally came out, 45 min wait by the way, is wasn't a pizza but bread with a pool of grease on top. Super disappointing, but as we walked out the sandwiches looked decent...so maybe give those a try."
        }, 
        {
            "index": 346, 
            "rating": 1, 
            "review": "You know how many times in my life I walked away from a pizza place because they can't manage to take in order properly? Never . The staff thought it was more interesting to chitchat then to help put a slice of pizza in the oven and took forever to charge the room credit. Won't last long here if they keep this up."
        }, 
        {
            "index": 347, 
            "rating": 5, 
            "review": "A caveat, I didn't have any pizza.  I actually had lunch @ Julian Serrano Tapas at the Aria about 1.5 hrs before coming here, so I was already full.  \n\nThe GF remembered this place while wandering from Mandalay Bay to Luxor the previous time we were in Vegas.  It was already closed by the time we wandered through, but she had bookmarked this spot for dinner next time out.\n\nWell, we finally made it back and we came over here from the Vdara.  We actually arrived at 5:30pm so we hit happy hour, which is 1/2 off select booze and select appetizers, as well as individual slices.  This included vegan versions of some of the apps, which was great.\n\nI ended up ordering Not Your Mamma's Garlic Bread and Sweet Potato Fries tossed in truffle oil.  Since they were half off, why not get both?  \n\nThe Garlic Bread was fantastic...thick slices of bread and instead of butter and garlic, Slice of Vegas topped it with an almond based pesto that was quite tasty.  They served it with a side of a roast garlic bulb, which you could drop a knife into and grab a clove like it was butter.  That roast garlic but this over the top.\n\nThe Sweet Potato fries weren't anything special, but you could smell the truffle oil they tossed it in after.  It wasn't a huge amount, they probably drizzled it and gave it a few tosses, but it was plentiful as a whole and delicious.\n\nTheir pies were a little pricey; 12\" for $19.  I did try the crust on my GF's Vegan Buffalo Chicken pizza and it was cooked very well.  She loved it; but I didn't really taste the toppings itself so other than the crust, I can't comment on if it was good or not.  \n\nService was friendly and excellent.  The waitress was very patient. happy, and cheerful when assuring us that the ranch dip that came with the fries is vegan.\n\nI'm definitely coming back, but this time I'm going to order a pizza for myself or, if I hit happy hour again, get a slice."
        }, 
        {
            "index": 348, 
            "rating": 3, 
            "review": "Service: Excellent and efficient, super friendly hostess and servers. \n\nPrice: Its high for what they offer but it is conveniently located near the Luxor. \n\nFood: They have a nice variety of salads and pizzas, and a variety of beers. I enjoyed there 10 meat pizza. It was really good and enjoyed it. The crust was not soggy and it had the right amount of meat and sauce. I also ordered a salad and it was okay but it did lacked dressing. I would not recommend the soup. Both soups were salty and not that tasty. \n\nOverall: If you are in the Luxor this is a good option. I had 2 groupons and went there twice. I would not go out of my way to eat here otherwise."
        }, 
        {
            "index": 349, 
            "rating": 3, 
            "review": "Expensive but decent thin crust pizza. Good bartenders. 3 cheese with truffle oil was good. Good stop between convention center and Luxor"
        }, 
        {
            "index": 350, 
            "rating": 4, 
            "review": "So good to find a place on the strip, near my hotel room at the Luxor that served up decent vegan food.  I'm not normally a pizza guy, I've lost the taste for the fake cheeses, preferring for less processed fair.  But this was good quality and delicious.  Go Vegan!  Eat Pizza!"
        }, 
        {
            "index": 351, 
            "rating": 5, 
            "review": "AMAZING vegan food! \nWe ordered bruschetta, Cajun fries as appetizers. I ordered a custom pizza with Basil, bell peppers, onions and vegan cheese. My husband ordered vegan pasta. At the end of it, nothing was left. It was a lot of yummy in my tummy!! I'm definitely coming back again."
        }, 
        {
            "index": 352, 
            "rating": 2, 
            "review": "I'm a pizza fan and was really excited to discover this restaurant on Yelp! I was even more excited when I saw that there was a deal on restaurant.com. I am all into meat lovers' pizza and I came into this restaurant, already knowing that I was going to order the 12-inch 10-meat pizza. The pizza was okay. I think the choices of the 10 different meats were misjudged. A lot of preserved and salty meat that made my pizza overall, pretty salty. I had to eat it with a side of ranch to get rid of the saltiness. I like that they made thin crust pizzas. For dessert, I got the cannolis, which I really liked! I was here around 6pm on a Friday and the place was 2/3 empty. The waiter was somehow pretty busy and we had difficulty catching his attention several times. Wouldn't go back and would've been disappointed if I actually paid full price and not used my deal. If craving pizza, I would recommend Secret Pizza at the Cosmopolitan. The white pizza is divine there."
        }, 
        {
            "index": 353, 
            "rating": 3, 
            "review": "Bf always wants pizza so we gave this place a try. Quiet, not too busy because we went early in day, friendly staff. Food was good but not really rave worthy. Ordered a pizza and a meatball sammy. I thought it was a little strange my side salad had edamame in a mostly italian place."
        }, 
        {
            "index": 354, 
            "rating": 1, 
            "review": "Came here on a business trip and was really disappointed. The pizza is about the same as Chucky Cheese, thin and greasy. Hopefully their other food is better."
        }, 
        {
            "index": 355, 
            "rating": 5, 
            "review": "Excellent vegan options. I recommend the vegan buffalo chicken pizza. Amazing!! Also the Not Your Mama's garlic bread is a must!! \nFor the rest of the group, the il Mangino pizza is great!! \nService has always been on point and the restaurant has a great atmosphere!"
        }, 
        {
            "index": 356, 
            "rating": 5, 
            "review": "The Caprese rocks! \nGluten-free spaghetti with bolognese sauce and meatballs was the bomb. \nThe Irish Mule is a must have drink."
        }, 
        {
            "index": 357, 
            "rating": 3, 
            "review": "I tried this the other night, and I had mixed feelings. My friend and I ordered the Mama's Garlic Bread with Melted Cheese on top. It was $6.95 for the garlic bread and an additional $1.95 for the cheese. It came out with 4 small pieces of bread. I guess that's the price that you pay for dining in a casino. They had a huge garlic clove where you could squeeze on top of the bread. The garlic clove itself was really good. We ordered the Choked Pig pizza which was pretty good. It had an aioli pesto, mozzarello cheese, sun-dried tomatoes, bacon, artichoke mix, and whiskey sour cream drizzled onto the pizza and topped with basil. I liked the flavoring of the pizza. It was awesome. My friend covered his pizza with the chili peppers because he thought it had no taste. I hadn't noticed it until my friend mentioned it, but the pizza was so difficult to chew. My mouth hurt so much. The pizza was really tough. I prefer chewy pizza to crunchy pizza."
        }, 
        {
            "index": 358, 
            "rating": 1, 
            "review": "First of all the food was bland, and took forever, the service was absolutely terrible I saw our waitress twice in an hour and we had to ask for a soda refill and what really toped it off they take it upon themselves to charge a %18 tip automatically,and so I now know why she didn't care she knew she was getting a tip regardless, I would not recommend this place to anyone unless its free, but the bar tenders seemed ok but giving an %18 tip to someone that barely earned there pay for that day really made my stomach turn!"
        }, 
        {
            "index": 359, 
            "rating": 5, 
            "review": "Had the buffalo chicken pizza and it did not disappoint. Dough was cooked perfectly and had just the right amount of garlic. The buffalo chicken topping was just right and not to vinegary. \n\nService was great, we ordered from the deli counter and our pizza was ready before the promised time. \n\nTax and tip included I believe the 18\" pizza was under 40."
        }, 
        {
            "index": 360, 
            "rating": 4, 
            "review": "I loved their Garlic Shoestring Fries which was tossed in salt, black pepper Parmigiano-Reggiano and garlic and served with a delicious pesto aioli sauce....  The New York style pizza was also delectable with a thin, chewy crust and fresh ingredients.  I will definitely come back for more!"
        }, 
        {
            "index": 361, 
            "rating": 4, 
            "review": "The pizza is a little on the expensive side but still pretty good. The pizza crust is probably the winning point. If staying at the Mandalay Bay stop by and give it a try."
        }, 
        {
            "index": 362, 
            "rating": 2, 
            "review": "Bought a dining certificate from Travelzoo $39 dinner: 2 glasses of wine, 2 appetizers and 2 entrees. We called in advance to make a reservation for Friday at 7 o'clock; it was totally unnecessary. The restaurant was only half full. \n\nWe were first seated in booth overlooking the mall, but I became nauseated from the overpowering scents wafting over from Lush. They moved us without any trouble.\n\nWe asked to substitute beer for wine, but no go. House wine was the only option. Two pinot grigios were brought over. It was really sharp, way too much acidity.\n\nWe started with the tuscan salad ($10.95) Fresh spring mix, tossed with diced Roma tomatoes, mozzarella cheese, sliced red onion, basil, parsley and toasted chunks of herb \ninfused bread. Finished with an aged balsamic vinaigrette. And garlic fries ($6.95). The salad was nicely dressed and fresh only complaint was the lack of mozzarella cheese. The fries were shoestring and crisp, but pretty average. The garlic aioli was heavy; not a fan.\n\nNext we had the Margherita ($18.95) pizza and the rigatoni with meatballs and bologonese ($17.90). With a name like Slice of Vegas I had to try the Pizza. I wish I hadn't. The rigatoni was far superior. The margherita crust was tasteless and the ingredients lacked that high quality flavor. It was a real disappointment. The meatballs were ok, they tasted too bready to me, but the bolgonese sauce with the rigatoni was a real surprise. My husband and I both liked it.\n\nIf I were judging the pasta and salad on its own, I'd give an A-OK rating, but since the signature item is pizza. This was definitely \"meh\" and we were thankful our tab was about 50% off. It's definitely not worth full price."
        }, 
        {
            "index": 363, 
            "rating": 4, 
            "review": "Found this place on happycow.net while searching for some good vegan food to eat in Vegas. Lucky for me this places has a new vegan menu with many delicious items. They may still be getting the details worked out as my garlic fries did come with parmesan cheese on them, but it was immediately taken care of. My veggie meatbull sub was pretty delicious. Prices on many of the items seemed a bit high, but they all sounded amazing. I couldnt't bring myself to the try the nearly 20$ vegan 12 inch pizza, but it sounded great. Service was above and beyond as well. My boyfriend enjoyed his non veg sandwhich as well, even eating all his peppers which he normally does not enjoy. I do think the beers on tap could be expanded, but they do have a large selection of bottles available."
        }, 
        {
            "index": 364, 
            "rating": 2, 
            "review": "Very average pizza!  Very over priced based on the cost.  Asked for a side of sauce to add to my pizza, had to pay for the side, was tiny and when I asked about it the response was its our policy.  Hate to say it was a waste of time!"
        }, 
        {
            "index": 365, 
            "rating": 4, 
            "review": "Such a great time! Went on a Monday midday. Had a restaurant.com certificate to use and it came in very handy. I was anxious to try this place because it has lots of vegan offerings. When I asked the server about what they had that I could try, he brought me an entire menu full of choices. We had the vegan chicken wings (with vegan ranch), and though a bit salty, they were pretty good. In addition, we ordered a vegan pizza, but when the waiter saw that it was not prepared properly, he made sure to buy us a round of drinks. Service was efficient and very friendly. I would go back in a heartbeat."
        }, 
        {
            "index": 366, 
            "rating": 5, 
            "review": "Oh. My. God. \n\nLocated  in the shops that connect Luxor and Mandalay, I ate at this place TWICE in one day. Ordered the vegan pie, garlic pesto bread, garlic fries and chocolate cake with peanut butter icing on the lunch visit. \n\nLets start with Mama's garlic bread. Holy hell. This is probably the best garlic bread I have ever had. They give you a roasted head of garlic and the pesto on top is life changing. We ordered ours with Daiya as well. I just scooped out garlic (eventually resorting to squeezing every last drop of garlicky goodness from it's vessel) and spread it across the slices. It comes with four pieces of bread, so enough to share, if you are feeling generous. Well, everything we ate the portions were perfect for splitting.\n\nThen the garlic fries. I don't know what kind of magical mayo like basil dip they came with as well as ketchup and a generous heaping of diced garlic sprinkled over top, but it draws you to it like a moth to a flame. The fries are super thin and cooked to perfection. Not over salted as often is the case with fries.\n\nThe pie. We ordered the 12\" vegan pizza with diced eggplant, zucchini, roasted pepper and Daiya cheese. It too, perfectly seasoned and portioned.\n\nAfter all that, we still had room for the moist chocolate cake with whipped peanut butter frosting. Our slice was about 4 in. x 4 in. Atop a chocolate drizzled plate beside grapes rolled in sugar and a sprig of mint. It was nice to go from a well balanced and not overly sugary dessert to that little kick of wow. I have never once thought of doing that to grapes but it worked.\n\nFor my return dinner visit I ordered the vegan wings and more garlic, Daiya bread to go to eat on my return flight home. I was pleased to find I still got my roasted garlic in the box for the bread.\n\nThe wings were Gardein chicken strips with a sauce cup of buffalo sauce and one of ranch with carrot and celery sticks.  \n\nVegas is not a place I will be returning anytime soon but if I did, you better believe I would find my way back to this place. Much better than the Cantina a couple of doors down which also offers vegan options (3 star review to follow). I was also impressed our waitress Bianca, though not vegan herself and with us being her first vegan customers had been telling people that the cake was vegan after they'd eaten and raved about it. She said people often have stigmas about vegan food being disgusting and it's just not the case. :)"
        }, 
        {
            "index": 367, 
            "rating": 5, 
            "review": "AMAZING pizza! Will eat here every time I come to Vegas! White pizza FTW"
        }, 
        {
            "index": 368, 
            "rating": 4, 
            "review": "Three stars for so-so Italian food. One extra star for excellent customer service. I came here with a big group, and we had the back room to ourselves. I was really impressed with the service we received. The servers did a great job of checking up on our table - refilling drinks and bringing extra napkins or utensils as needed. I wasn't particularly impressed by the food but it wasn't bad either. And it did come out very quickly which I always appreciate. Based on the overall experience, I'd definitely give this place another try the next time I stay at the Luxor or Mandalay Bay."
        }, 
        {
            "index": 369, 
            "rating": 3, 
            "review": "In search of a spot on day 3 in Vegas to not spend a fortune on food we came across this unassuming pizza joint.\n\nEmployees were very friendly and the place was clean. Because it was busy we were seated at the bar. Side note: the bar stools aren't very comfy on the ole' back. \n\nI opted to \"make my own\" pizza while my girlfriend went for the \"Greek\". I'd say it took slightly longer than average for the pies to come out. And they were just ok... not bad, not great, just ok.\n\nI will say that I never could have imagined that a gyro inspired pizza would be good, but it was definitely the better of the two. \n\nI should also warn that their sausage is very very very very finely ground.  Why is that important? It reminded me of the cheap stuff on the $1 frozen mini pizzas I ate in college when I was broke. No me gusta. \n\nLike I said: not bad, not good, just ok for what the place is..."
        }, 
        {
            "index": 370, 
            "rating": 2, 
            "review": "The four-cheese truffle pizza with alfredo sauce was good.  I had the chicken sandwich with avocado and the chicken was really dry.  Friendly service though."
        }, 
        {
            "index": 371, 
            "rating": 3, 
            "review": "I came here around lunch time craving pizza. I left mildly disappointed. \nThe service was brilliant, all of the TVs showing sports confused me (disclosure, we had been in Vegas for two days at this point, I'm from England, we normally have a maximum of one TV showing the news) and the pizza gave me mixed feelings. \nIn the UK I have never experienced a pizza that has a puddle of grease in the middle of it. This pizza tasted absolutely wonderful but you had to hold it up and let the grease drip off of it before attempting to eat it. The portions were also a lot larger than we had expected. Upon finishing both my partner and I felt rather unwell and we had to rush back to our hotel room, there was far too much grease on the pizza and that caused us to feel rather nauseous. \nAll in all three stars, after the excess grease had dropped off of the pizza there was a rather pleasant taste to it but after leaving us attached to the toilet for the remainder of the day we weren't too impressed."
        }, 
        {
            "index": 372, 
            "rating": 3, 
            "review": "I've been to Slice of Vegas multiple times and for two reasons: 1) it's a convenient option to eat at right before a concert at HoB and 2) restaurant.com offers up a $25 off when you spend $37.50 certificate, making Slice easier on the wallet. \n\nHere's what I've had most recently:\n\nPASTA FAGIOLI SOUP ($4.95): Progresso's canned vegetarian minestrone soup packs more flavor than what Slice of Vegas is serving up. I added Parmesan cheese, pepper, and salt to my petite bowl of soup to no avail. There simply was no saving this soup. 1/5\n\nMEATLESS MEATBALL SUB ($13.95): Dripping with marinara, the sub was falling apart before my first bite. I'm already a messy eater- I don't need help. Meatballs were tasty though. 3/5\nPRO TIP: You get to add a flavor (such as garlic-rosemary) to your fries at no cost! Fries were on point.\n\n ZEPPOLI ($7.95): Truthfully, I enjoyed Olive Garden's Zeppoli better. The dough was thick and super chewy, giving my jaw a workout. The added Cinnamon was an unexpected flavor, but the zeppoli just failed to deliver. 2/5\n\nPRICE: On our last visit, dinner for two (even with 2 draft beers) came to $13 pre-tip after the restaurant.com gift certificate. 5/5, especially for the Strip!\n\nAMBIANCE: It's usually noisy here, especially when you're seated towards the back of the restaurant. Decor sticks to a red and black palette and the restaurant has fun fixtures on the wall (like a bike!). Music goes between country and low-key rock. 4/5\n\nCUSTOMER SERVICE: Average. 3.5/5\n\nPROS: Vegan Menu and affordability\nCONS: No bathroom in the restaurant, mostly underwhelming food\n\nReturn Visit?\nFor now, I've had my fill of Slice of Vegas. The only thing that has impressed me are the fries.\n\nYELP 100 CHALLENGE 2015: #29"
        }, 
        {
            "index": 373, 
            "rating": 3, 
            "review": "Their slices are roughly $5-6 bucks each so if you think you'll eat around 3 slices -- just get a personal pie -- you'll get more bang for your buck.\n\nWe got the 4 cheese truffle pizza -- which was good flavor-wise but pretty greasy . The Caesar salad was pretty standard, but I enjoyed the parmesan crisps that were in the salad that was a nice touch. Their pizza won't blow you away, but it's a  solid choice for your pizza craving. \n\nService wise -- our waitress was pretty lackluster. She was friendly -- however didn't provide great service. Our waters were almost always empty unless we initiated a request. Took a while to order our drinks and food respectively.. below par service."
        }, 
        {
            "index": 374, 
            "rating": 2, 
            "review": "Slow service, mediocre food. Waited for about ten minutes before being greeted at our table. Took another ten minutes to get a water and a soda. We got a bbq chicken pizza. The chicken was truly disgusting--low quality, not marrinated, unseasoned, undercooked and definitely wasn't grilled, perhaps boiled or pan cooked. I found it inedible. Once I removed the chicken, the pizza was pretty good. Sat ten minutes at the table after we finished our food (empty drinks also) and we finally had to flag down our waitress for the bill"
        }, 
        {
            "index": 375, 
            "rating": 5, 
            "review": "Tried this place while we were in Vegas since we had a coupon. The husband got the meat ball sandwich and I got the Philly cheesesteak. We both loved our sandwiches! So so good! I had a side Caesar salad and loved that as well! For desert we tried the cannoli sand they also were very tasty! Glad we tried this place!"
        }, 
        {
            "index": 376, 
            "rating": 5, 
            "review": "We had a group of 10 every where we went in Vegas to eat, when that happens everyone charges you 20% for tip and then gives you poor service. This place went above and beyond for us. They are extremely kid friend and have pizza dough balls you can get for them. And the food will not disappoint! Can't wait to come back to this place on my next visit!"
        }, 
        {
            "index": 377, 
            "rating": 5, 
            "review": "I took my family there for dinner and really enjoyed the experience. The atmosphere was casual and friendly. The service was very efficient and quick. From salad to pasta, we enjoyed\nthe food very much. The marinara sauce was delicious.  Being a former New Yorker, I felt at home...in a  good way. So glad I found this place !"
        }, 
        {
            "index": 378, 
            "rating": 5, 
            "review": "Great staff.  Great food. Good variety on the menu.  Comfortable seating. Conveniently located between Mandalay Bay and Luxor. I recommend it! \n\nI travel to Vegas twice a month and this place is worth visiting every time."
        }, 
        {
            "index": 379, 
            "rating": 4, 
            "review": "A comprehensive vegan menu with appetizers, entrées, and a desert. The food was great and the servers were very helpful and friendly. A must visit for vegans in Vegas."
        }, 
        {
            "index": 380, 
            "rating": 3, 
            "review": "The 10-Meat Pizza was actually really good and the atmosphere and music were nice. It's got a decent beer list, with some very different selections. No microbrews, but still some unique beers. \n\nThe service, unfortunately, was terrible. Our waiter must have been a ghost, because we never saw him. When he did finally appear he brought my wife the wrong order and then had his thumb in her pasta when he finally brought the right order out. Later he took her Diet Coke for a refill and brought back an iced tea. We gave it back to him, but we were ready to pay and go by the time he finally showed up again. \n\nI hate when a restaurant takes your glass away from the table to do a refill. Just bring a new glass!!!"
        }, 
        {
            "index": 381, 
            "rating": 4, 
            "review": "Great thin crust pizza place in the area. The meat lovers had a good portion of meat, and the ambience wasn't too loud."
        }, 
        {
            "index": 382, 
            "rating": 1, 
            "review": "I cannot believe the high ratings this place had. Granted, I got it to go by the slice, here is my story:\n\nI was nursing a pretty sick hangover. It was around 3pm. Staggering back to my room at the Luxor, from my friends room at Mandalay Bay, I passed by Slice of Vegas, and was drawn in, if by nothing but the fact it would be quick and to go. There was no one in line. I placed my order, as did about 10 people that lined up behind me. It wasn't until all 10 had been placed that cashier started to dish out slices from the case which I had until this point figured had been for display only. I mean why else would it have not been served as soon as I ordered it? About 20 minutes later, everyone's orders placed she began throwing the slices out. my room was a brisk 3 minute walk away, and by the time I arrived the slice was cold. It didnt even look appetizing. Didnt taste any better than it looked. It had that concession stand pizza taste, only older.\n\nMuch better options for a quick bite to eat, maybe you have to get the whole pie to not have a horrid experience?"
        }, 
        {
            "index": 383, 
            "rating": 5, 
            "review": "Stopped here while shopping for a quick bite, wasn't too hungry for dinner...\nWe for caprese salad, bread with garlic, and meatballs. Waitress was super friendly, quick, abd knowledgable when helping to pick out beers to try...\nCaprese salad was great, and very large.\nMeatballs were an unexpected treat! They were absolutely delicious!!!! The bread with the garluc5 spread was also great... \nNot a random pizza spot, the chef was on point!!!\nCan't wait to come back here again...."
        }, 
        {
            "index": 384, 
            "rating": 5, 
            "review": "I hosted a group of 20 here on just a few hours notice.  I was transferred to their sales manager who handled the details efficiently and made the whole process completely stress free for someone not used to organizing events.  The servers and manager at the restaurant were just great.  I had to increase the guest count from 15 to 25 and order more food which was taken care of efficiently and with smiles.  Because this was a business event and I couldn't cover drinks, we had to have individual drink tabs which made things more difficult for the staff.  They handled it smoothly and without a hint of annoyance.  The food was great too."
        }, 
        {
            "index": 385, 
            "rating": 1, 
            "review": "Worst pizza in the world! I wouldnt take there pizza for free let alone 30$ for it. Much better choices in town. Service is not professional and lacks attention mid week afternoon shifts. The bartender has to serve you because theres no waitstaff on floor. The place is so dead, they dont staff and it effects service."
        }, 
        {
            "index": 386, 
            "rating": 5, 
            "review": "We were attending a comedy show the other night at house of blues and we decided to give this book mark a try;) so so so glad we did! \n\n  It's Located right next to the burger bar in the shoppes area of Mandalay bay. We made a reservation on yelp and were seated promptly. \n\n  Our server, Johanna was very helpful. We had a restaurant.com coupon (yes, check them out because they are on there)! She informed us of what we needed to spend ($37.50) and went on to take our drink order. My boyfriend ordered the absolute gimlet (it sounded good, but it wasn't) and we had to send it back. We offered to pay for it, but Johanna had no problem replacing it. We decided to play it safe and just order a bottle of Pinot noir. Their wine prices on bottles are fair and they carry some very drinkable brands;) \n\n  The food... Oh my gosh! We ordered off the vegan menu (yes I said menu)! We opted for the almond pesto cauliflower, truffle sweet potato fries, and a vegan veggie pizza. Everything came out pretty quickly. Seasoned to perfection and generous portion sizes, everything tasted amazing. I can honestly say I can't find one thing to complain about. Their vegan dessert menu looked great (vegan zeppollis! Chocolates cake with pnb frosting!! Ny cheesecake!!!) but we just couldn't fit anything in. We figure it's just another very good excuse to come\nBack. \n\n  They have a happy hour mon-thurs from 3-6pm. Apps are half off and we were informed that their house wines were cheaper than a soda! By far one of our new go to's when we are on the strip!!"
        }, 
        {
            "index": 387, 
            "rating": 4, 
            "review": "Very nice and convinient in Mandalay Place.  Pizza thin and tasty.  Little expensive.  Good menu choices of appetizers and sandwhiches.  Very good drink menu."
        }, 
        {
            "index": 388, 
            "rating": 3, 
            "review": "A place on the Strip with a Vegan menu?! I thought I was in heaven, alas, the vegan pizza is sub sub par. I pay extra to have the pizza veganized yet I end up with way less 'cheese' than others, where's the justice?! Don't bother with it, I'd rather have frozen Amy's from whole foods than this. Step up your vegan pizza game Slice O Vegas! Still giving three stars since at least they're trying :/"
        }, 
        {
            "index": 389, 
            "rating": 5, 
            "review": "Super good vegan pizza. They even have gardien vegan chicken and meatballs. Went back again today. Still amazing. I had a vegan meatball jalapeño onion and garlic pizza today. Delish"
        }, 
        {
            "index": 390, 
            "rating": 2, 
            "review": "Ok you guys...\nTook Sarie out for a little 5th of July lunch.  I was pretty hung this morning, so we thought some sausage and carbs would definitely do the trick. Found a groupon for this joint. It's in Mandalay place, nice location. (It's always fun to stare at Pete Rose sitting at an empty autograph table).\nAt the podium we were quoted a ten minute wait, which was exactly how long it took. Seated at a crappy corner table, then I asked to move to a slightly less crappy corner table. Oh well.\nThey have a very nice beer selection. Great microbrews including my favorite beer ever brewed, New Belgium's 'La Folie.' Try it if you dare: a sour brown ale aged in merlot casks. Very well babanced, perfect use of Brettanomyces and tannin. Whoooohooo.\nThe people next to us had a gigantic pepperoni pizza on the table.  It looked alright, a little soggy for my taste. I also saw some spaghetti and red sauce dishes that appeared to be nothing spactacular.\nSarie ordered a cup of coffee and we relaxed a minute. The menu looked good, we decided to share a 'panini'... We ordered the proscuitto and brie. \"That sandwich is no longer on the menu\" our server tells us. What are you talking about, I think to myself, it's printed right there, stupid. Obviously it's on the menu. How about saying something like 'Oh, i'm very sorry, we're out of that one. maybe you'd like the _____ instead.' But I said Ok, we'll take the meatball sub.  \nBig mistake. \nFirst of all, it had very marginal flavor. The 'meatball' was more like a mushy sausage patty than a meatball. The red sauce was equally flavorless and I only knew it has cheese because I could see it. No taste there either.  AND it was certainly not a panini, which should be pressed and grilled. This was more like a toasted sandwich. Im sure Quiznos has a better one, anyway. \nThe garlic fries would have been wonderful if they were not served cold. 80 degrees is perfect for San Diego, not frenchies. I would have sent for some fresh ones, but our server might as well have been David Copperfield's sister, as good as she was at vanishing. We got the bill, and I was surprised to see that Sarie's cup of coffee cost about as much as a footlong meatball sub at Subway (which is where we should have gone in the first place).\nStarted feeling sick on the way home (although that might've been due to last night's festivities, which included copious amounts of liquid courage and about 65 cubic yards of mentholated smoke).\nOh, and the groupon isn't even good until tomorrow, so now I'll have to go back, although I really don't want to. But when I do, it'll be for 2 bottles of La Folie and some hot garlic fries.\nAll in all, this was a terrible way to spend $20 and an hour of our time. Blah food, blah service, blah blah blah. I'm giving it 2 stars only because of the great beer list and clean atmosphere.\nThanks you guys. Always a pleasure telling you how it is."
        }, 
        {
            "index": 391, 
            "rating": 2, 
            "review": "The bottom line: STAY AWAY\n\nOver priced, middle of the road, food even with restaurant.com certificate.\n\nHorrible service! Waiter was NOT interested in waiting on us. We're not demanding with special orders or extra things either.\n\nWaiter helped himself to a 20% tip (suppose to be 18% per cert) and over charged my credit card by $10. After I got home I called and spoke with a manager and he corrected the credit card charge. When I told him about the tip he gave me his email and said he would mail me the 2% back. The tip issue isn't worth my time. \n\nI recommend staying away from Slice of Vegas. There are WAY too many other better places to eat. If you have eaten here check your credit card statement."
        }, 
        {
            "index": 392, 
            "rating": 5, 
            "review": "Wow!  Hands down the best pizza I've ever eaten! I travel way too much for work, and I get a chance to eat one of my favorite foods - pizza - in a lot of place, and Slice is the best I've had.  Somehow they've made the normal pizza flavors just pop!  Great atmosphere and very friendly staff.  I would highly recommend Slice."
        }, 
        {
            "index": 393, 
            "rating": 1, 
            "review": "Dying for a slice of pizza and the bartender was a complete jerk.  Too busy talking to fellow workers.  Had to get up and ask for service. Then she had and attitude. TOO many places in Vegas to have a bartender have an attitude.  Manager was nice. Wanted to help.  Her name was Angie and she needs to go.  TOO many other places to put up with that!!!"
        }, 
        {
            "index": 394, 
            "rating": 3, 
            "review": "Ate here last night. Decor was nice and friendly staff. Ordered the calamari which was pretty good and a hand tossed pizza. I was hoping it was going to be more tasty and authentic, wasn't too impressed. But nice to say I ate here while in Vegas ."
        }, 
        {
            "index": 395, 
            "rating": 4, 
            "review": "great thin crust pizza; great vegan chicken wings! My dad ordered the pasta fagioli and roasted artichoke and he loved it! My brother ordered one of the pasta dishes and enjoyed it also. I ordered the gluten free margherita & another without cheese and it was great. Great vegan & gluten free options overall"
        }, 
        {
            "index": 396, 
            "rating": 2, 
            "review": "Slight wait for a table even though many were available. Found our server and overall service to be very good. The croutons on the salads were stale. Pizza looked to be on par with CPK, but the taste turned to be extremely bland. Bland like a frozen pizza. Again the service was good."
        }, 
        {
            "index": 397, 
            "rating": 5, 
            "review": "Have eaten here twice during vegas trips, and it has been great both times! Prices are pretty high ($11 for a salad, $19 for a \"personal pizza\", $10 for bruschetta). But the personal pizza is large enough to split, so we paid around $45 for an app, pizza and beer."
        }, 
        {
            "index": 398, 
            "rating": 4, 
            "review": "I can't compare Slice of Vegas to high end places or top of the line pizza parlors so I'll review it for what it is and the level it operates at.\n\nWith that said, I actually enjoyed what it brought to the table. Located in Mandalay Bay, the majority of customers are hotel guests. The atmosphere is completely casual and you can choose to sit at a table or the bar.\n\nI ordered a basic pepperoni pizza and the crust was at the perfect crispiness to me. There was a brick oven taste to it and the ingredients seemed fresh. All of my friends enjoyed their meals as well.\n\nWe had plenty of Mandalay points and chose to spend some here. I'm glad we decided to stop in and I wouldn't rule out Slice of Vegas."
        }, 
        {
            "index": 399, 
            "rating": 5, 
            "review": "My husband and I went there last night once we landed in las vegas, and I am happy we did. The slices are huge, and delicious. \n\nI did however, just get the basic cheese pizza.. kind of hard to screw up. But I have no complaints.\n\nI will definitely be going back for another slice before I go home."
        }, 
        {
            "index": 400, 
            "rating": 5, 
            "review": "The best italian food ever.....the buffalo greek pizza on the vegan menu is mind blowing, other dishes we ordered were  great too and the staff is amazing.....fantastic experience and a must visit!!!"
        }, 
        {
            "index": 401, 
            "rating": 2, 
            "review": "I took my little family here garlic bread was amazing pizza was decent service well that's y the got 2 stars we were sat before a table of 7 another waitress came greeted them n got them drinks it took them 10.75 min to come greet us I timed it no BS the MANAGER came got us drinks he was nice we ordered got out food my wife is allergic to parsley we ask for no parsley It came with parsley so we let them know the server not our waiter gave us a glare like we are making his job harder by asking to not add an item he takes it and brings it back even more mixed in my wife didn't want to make a big deal about it but I was ready to she took a couple bites of what didn't have parsley and still had to go buy benadryl for her allergies we really felt unwanted here"
        }, 
        {
            "index": 402, 
            "rating": 4, 
            "review": "They serve a decent slice here, given that good pizza can be hard to come buy, though I much prefer the pizza joint at the cosmopolitan. A slice, after tax, costs $5.86."
        }, 
        {
            "index": 403, 
            "rating": 5, 
            "review": "OMG! RUN to Slice! Food is legit! If you want fresh, delicious homemade Italian dishes & pizzas, this is the place! You can taste the top quality ingredients in their dishes. We had homemade meatballs, Caprese salad, cheesy garlic bread, calamari, chicken parmigiana, BBQ chicken pizza and REAL cannolis! (Hey, what can we say-we're Italian-we like our food!) \nServers are friendly and fast! Great food, great atmosphere & great prices! I will be back!"
        }, 
        {
            "index": 404, 
            "rating": 2, 
            "review": "Went here expecting to have some great pizza and it ended up being trash. Ordered a family sized Greek pizza and it was disgusting. Will not be recommending or coming back."
        }, 
        {
            "index": 405, 
            "rating": 5, 
            "review": "I highly recommend eating at happy hour. From 3-6 they have a half off menu that includes chicken wings, cheese pizza slices, garlic bread and draft beer.   The service was great and the food was good."
        }, 
        {
            "index": 406, 
            "rating": 2, 
            "review": "It was somewhat busy but there was no trouble seating our party of four for dinner.\n\nMeh. Nothing memorable about the food though except that the meatball sandwich was bland. The mozzarella cheese and the sauce didn't do much for it. The sprinkling of parmesan helped but there still wasn't much flavor. The spaghetti with meatballs was insipid and lifeless too. \n\nService was okay and the food did come out quick, but please do something about the flavor of the food."
        }, 
        {
            "index": 407, 
            "rating": 4, 
            "review": "It is your standard pizza joint. Nothing spectacular for food. It was super crowded during dinner on a sunday evening. We waited about 30 minute to be seated. They gave the kids crayons once seated which is nice. \nWe ordered for the table pizza and salad. Waiter was really nice. I guess for Vegas I was expecting more. There are several tv screens with sports playing on it. I guess this would be a good place for guys to hang out."
        }, 
        {
            "index": 408, 
            "rating": 5, 
            "review": "I was here during a family vacation with my kids.  I absolutely love this place for good, kid friendly food.  The appetizers were out super fast and the cheese with Italian sausage pizza was perfect for my family."
        }, 
        {
            "index": 409, 
            "rating": 4, 
            "review": "We eat here every time we go to Vegas because of the vegan options.  Everything I've eaten here has been great and the vegan pizza really is one of the best that I've had.  I took off one star because it is quite pricey for a pizza joint, which I'm sure is because everything is expensive in Vegas."
        }, 
        {
            "index": 410, 
            "rating": 3, 
            "review": "Pizza was good. I ordered a slice and it was sitting on display then warmed over. If your like me, I like freshly made hot pizza. I am sure that if I ordered a whole pizza it would have been fantastic, because this warmed over pizza was good. Will go back if I'm in that mall again, but I'm not going to make the journey to walk through the casino for this pizza."
        }, 
        {
            "index": 411, 
            "rating": 5, 
            "review": "I wanted some pizza and I remembered seeing Slice of Pizza while walking through he other day. So I stopped in and sat at the bar...the place wasn't empty so that was a good sign, then again it was Football Sunday lol. Anyway I  sat down at the bar and someone had the Buffalo Chicken Pizza that really looked good. I asked how was it and she said excellent. I ordered the Margherita Pizza and it was awesome. This place style of crust is very unique and crispy. The bartender was outstanding and attentive.  The atmosphere was great. I highly recommend and I'll be back the next time I'm in Vegas!!! Btw they had other good looking options to decide from on their menu if Pizza is not a must."
        }, 
        {
            "index": 412, 
            "rating": 1, 
            "review": "Customer service was horrible, the food was gross i found out that most of the chef and the servers do not wash there hands after in the bathroom which was nasty! Not to mention I asked to speak to the manager and the manager took a long time."
        }, 
        {
            "index": 413, 
            "rating": 3, 
            "review": "Decent, for \"NY style\" pizza this far away from NY. Slice is in the Shops of Mandalay Bay (the connector mall between Mandalay and Luxor) and next door to Burger Bar. Generally, I'd say if you're trying to decide where to eat Burger Bar is way better but I had lunch there recently and wanted something different. \n\nThe interior is nice enough, with mostly booth style seating that should accommodate groups well. For once the person seating me didn't ask \"oh, just one? Do you want to sit at the bar?\" which was nice, because no I do not want to sit at the bar. The menu is your standard Italian offering - lasagna, build your own pasta and pizza. Because it's called \"Slice\" and not \"Pasta\" I had pizza.\n\nFirst, the crust is really good - nice and crisp with a little chew. I'll agree with a few other reviewers that their sauce is pretty bland - it's just lacking in flavor, period so plan to use the shakers of oregano and hot peppers. Overall, it wasn't as good as the slice I had at Sal's in NY but it was better than the garbage at Famous Original Ray's so a-ok.\n\nService was a-ok too. My food came quickly but I wasn't checked on after - the standard \"single diner\" treatment again....."
        }, 
        {
            "index": 414, 
            "rating": 1, 
            "review": "Server had no personality-bad start. Pizza was more like one you would purchase in the frozen food aisle. Crust tasted stale and flat. Cheese quality was below average. $25 price tag was over the top. Many better choices in Las Vegas ."
        }, 
        {
            "index": 415, 
            "rating": 5, 
            "review": "Love this place! \n\nGreat happy hour, happy and helpful staff, and great vegan pizza! \n\nMade our own pizza- vegan style :) they have an entire vegan menu and great atmosphere. \nI will be coming back here every time I am in Vegas for pie and happy hour beer."
        }, 
        {
            "index": 416, 
            "rating": 5, 
            "review": "Left Burger bar after too big a tab for just 2 beers and came here. This place is awesome.\nThey have a great happy hour, great beer on tap, great beer in bottles, and daily specials. Our stone IPAs were only $4! SO we each had two and ordered \"not your jams garlic bread\". just needed something small before the show-It was incredible! Garlic bread covered in pesto served with a head of roasted garlic! SO delicious! I would come in here every time before shows, and maybe even make special trips!  (I don't live near the strip, in fact I hate the strip.)"
        }, 
        {
            "index": 417, 
            "rating": 5, 
            "review": "Been here 3 times to eat while in Vegas. It is convenient to the Luxor hotel. A little pricy but pretty good pizza. You can get a whole pizza or they have specials by the slice. A tad bit too much garlic on the seasoned fries. I will return because of the great location, and sometimes they have a Groupon offer."
        }, 
        {
            "index": 418, 
            "rating": 4, 
            "review": "Really good pizza. Their crust is done right and both the garden and bbq chicken pizza were great. We ordered the Caesar salad as well and it was very good. Good casual eats in Mandalay."
        }, 
        {
            "index": 419, 
            "rating": 4, 
            "review": "Nice to have another Vegan option I can enjoy. We stopped in Saturday night for a bite and a beer. They have a great beer selection!! I had the pasta and sauce, my wife had the veggie burger both were good. The manager brought me out a vegan meatball to try. A very nice gesture....it was good but not great it lacked flavor. They were busy but were stil able to smile and provide good service. We will be back."
        }, 
        {
            "index": 420, 
            "rating": 1, 
            "review": "Not recommended. \nI was waiting to get a server for 15 minutes. Server came back with attitude issues and treated us like garbage.\nThe server needs to be more educated and learn how to treat Asians."
        }, 
        {
            "index": 421, 
            "rating": 3, 
            "review": "Service was great, everyone was very nice and attentive. Which is always a good thing at any restaurant. \n\nThey had a Sunday brunch special, so my husband and I really wanted breakfast food because for those two days in Vegas we were NOT able to get up early for breakfast, must be the Alcohol! \n\nWe order steak hash, pieces of steak toss with season potato in a skillet topped with two over easy eggs and served with toast. This was really good and the steak wasn't chewy and nasty. Seasoned potato, good. \n\nWe figure that since this place is called Slice of Vegas, we should try their pizza, 12 inch pepperoni. Pizza was pack with flavor BUT the pepperoni was salty and made the pizza really greasy. We had to ask for napkins to daub the grease off. The grease turned me off, it made the pizza soggy because of the grease. Ugh."
        }, 
        {
            "index": 422, 
            "rating": 4, 
            "review": "Excellent pizza! Good crust to sauce ratio. Plenty of toppings. Very cheesy just the way I like it. The service was prompt. The order came out fast. It's open late to which made it perfect after a concert at mandalay bay. Plenty of tvs too with sports on to add atmosphere."
        }, 
        {
            "index": 423, 
            "rating": 5, 
            "review": "This place was fantastic. A full vegan menu, which the pizza was great, awesome service, AND I left my credit card at the restaurant and didn't realize it until I got to the airport. I called them and they were nice enough to mail it back to me. They're awesome!"
        }, 
        {
            "index": 424, 
            "rating": 2, 
            "review": "For a pizza spot with a vegan menu....this place had no vegan options after 1030p? Of course every other pizza option was offered but no vegan style pizza. As a past customer I feel so let down. They should at least offer some type of vegan pizza late at night same as the rest of the pizza styles. And no offer to have a pizza made either. I think that's whack costumer service. Again....feeling let down. :("
        }, 
        {
            "index": 425, 
            "rating": 2, 
            "review": "Meh. I've DEFINITELY experienced better...\n\nFood was extremely greasy. My friend got the pesto pasta with chicken and mushrooms and it felt like olive oil pasta. The noodles were DRENCHED in oil, it was kinda gross. This is the only time I have never liked pesto sauce!!\n\nI ordered the blue cheese burger with sweet potato fries. The sweet potato fries were yummy and the burger was alright. The meat was kind of dry but all the other addings made it a pretty tasty burger.\n\nThe one cool thing here though is the big glass beer taps you can order and have placed on your table! It is a glass tube that's probably yard size with its own tap on the bottom so you can pour your own glass. Very awesome if you want some beer to go with your pizza or burger!\n\nI'd really only eat here if I was staying in the Mandalay Bay and wanted to eat somewhere convenient. Otherwise, it's kind of pricy for the quality but they do give you huge portions! However, they're not to die for leftovers. There is no 'wow' factor with the food here but it's decent Italian food for a decent price. There's soo much better in Vegas though. If you're only here for the weekend, I'd try something else!"
        }, 
        {
            "index": 426, 
            "rating": 3, 
            "review": "There seems to be some sort of hype around Las Vegas pizza joints this month, Slice of Vegas included, so my Mom and I decided to try this one out.\n\nThere was a small wait when we arrived because the place was actually pretty busy, which in my book is usually a good sign. My mom can't eat dairy products due to a food allergy, so she was asking the manager if they had a Vegan cheese they could put on the pizza. The manager actually went to the kitchen and came back with a piece of what she called \"tease\" cheese for my mom to try to see if she liked the taste before she ordered a pizza covered in it. Mom claimed it was the best Vegan cheese she has ever tasted.\n\nWe were seated and the waiter came up right away and took our drink and food order. He was a nice guy, but it was so busy that he forgot the drinks, so we flagged down another waiter to bring them for us. \n\nWe ordered a 10-meat pizza and a dish of Pappardale pasta with spicy marinara sauce. Both of the items we ordered were excellent! The pizza had a nice thin crust and wasn't overloaded with toppings to the point where you couldn't pick it up...it was perfect! Plus, they made half of the pizza with the vegan \"tease\" cheese and the other half with Mozzarella, so Mom and I could both enjoy it :) The pasta had a great flavor as well, and though it wasn't the best pasta I've ever had, it was pretty damn good.\n\nTo top it off, I had a cannoli for dessert, which was just about average :)\n\nMy major gripe with this place is the SUPER inflated prices. I understand that we're on the Strip and everything is more expensive, but $18.95 for a 12-inch pizza is pretty outrageous. The pasta dish was $14.95 and the cannoli was $6.95. Way too pricey, although the food was good and the staff were extremely nice...especially the manager!"
        }, 
        {
            "index": 427, 
            "rating": 3, 
            "review": "Overall, the food was good, but I didn't feel that it was worth the price we paid. A bit over priced. My favorite was the Romelia's salad. The citrus Italian vinaigrette was the perfect dressing. Their homemade croutons were so crunchy and tasty. We also had the il Mangino pizza which wasn't bad, paired with their garlic bread."
        }, 
        {
            "index": 428, 
            "rating": 4, 
            "review": "Loved their separate vegan menu! We ate there twice in one day and had a fantastic vegan pizza with roasted veggies and Daiya cheese, and salad (both options available were delicious). Loved the sweet potato fries too. Good service overall and well located, near the House of Blues, which was our destination. Would definitely go back."
        }, 
        {
            "index": 429, 
            "rating": 5, 
            "review": "If you like fresh roasted garlic, try the appetizer garlic bread and squeeze the daily fresh roasted cloves on the bread. Buffalo pizza was spot on--not to hot but not mild either. Great drink selection."
        }, 
        {
            "index": 430, 
            "rating": 5, 
            "review": "A vegan dream! We strolled by late after a show and they had an entire vegan menu. It was like stumbling into Disneyland on accident. The bruschetta was some of the best I have had. The vegan buffalo pizza was delicious as well! Service and atmosphere were excellent. There seems to be a lot of mediocre reviews but I guess what we ordered may have been exceptional. No complaints!"
        }
    ]
}