{
    "category": "Las-Vegas", 
    "entity": "Chicago-Brewing-Company", 
    "avg_rating_stars": 3.591780821917808, 
    "review_count": 365, 
    "reviews": [
        {
            "index": 1, 
            "rating": 1, 
            "review": "If I could give zero stars I would!!!!! I ordered chicken wings and they were pink on the inside so I told my server she said she was going to go to the cook so they can recook them so she did and brought them back out meanwhile my lunch break was over so I had to take them to go a few hours later I try to eat them again and they were still pink. I then went back to talk to the manager and he was the rudest person I've ever met in my life!!! He tried to tell me that All chicken is pink on the inside, when have you ever ate a piece of chicken that is pink on the inside???!!!! That means it is not cooked fully. I am pregnant and I can't be eating raw chicken and get salmonella. Worst customer service ever I will never be going back there and my life!!! Don't give them any of your money!"
        }, 
        {
            "index": 2, 
            "rating": 5, 
            "review": "Service was great, food was really good. We have gone back 3 times now. Pizza is top notch.  Portions are perfect. I highly recommend."
        }, 
        {
            "index": 3, 
            "rating": 4, 
            "review": "They changed the menu and went once after that and we were disappointed since it wasn't the same and thought \"another restaurant goes corporate....\" after a time, some months and in the middle of the week we decided to return and see if it improved, it has! The burgers are once more great, good steak sandwich, best root beer and onion rings, they now have dessert which before they didn't have anything at all to speak of, and of course their beer is excellent. They did take some items off the menu, hope they still serve the Alfredo Pizza which we highly recommend.... We live close by so we were happy that we have this local's place available again."
        }, 
        {
            "index": 4, 
            "rating": 1, 
            "review": "one of the worse experiences of my life, let's just say the GM knows nothing about customer service!!! never going here again, and definitely not recommending anyone here!!!!"
        }, 
        {
            "index": 5, 
            "rating": 5, 
            "review": "I go to this restaurant all the time, so I'm not sure why it took so long to write this review.  Anyway, there is no better deep dish pizza in Las Vegas.  My wife and I always get the Hawaiian and it never disappoints.  Note:  this pizza isn't for health nuts, so if you're on a diet I would avoid it.  The 9\" is the perfect size for two and, though it looks small, it will fill you up.  Chicago Brewing also has excellent beer, with 4-5 standards that they serve all year and some wonderful seasonals.  Last night, I tried the Fauxlanders Red (a sour) and it was outstanding.  For a casual night out with the family or a friend, this is the perfect spot.  Staff is friendly but not suffocating and they have a nice small patio out back.  You can fill up your growlers here too."
        }, 
        {
            "index": 6, 
            "rating": 5, 
            "review": "Went here over the weekend! It was a Saturday night about 7pm, we walked in with a guest count of 20 people. The person who was going to make the reservation forgot too... I was amazed by how nice they were to us and got us right in even though it was a busy day!\n\nIt had been some time since I had been here, not to much seemed to have changed. Still good food and good beer! \n\nWe ordered \"The All Nighter\" for the the ber and then orders an few finger food to eat. The wings were very good! Everyone in all was happy and the service was great!"
        }, 
        {
            "index": 7, 
            "rating": 4, 
            "review": "I come here for my Iceacholics fantasy football drafts but this year decided too add fantasy hockey too draft night at Chicago Brewing Co. One of teammates gets us the hook up if weather permits we get a reserve section out in the beer garden area (they only run that during the summer months) just did it inside since too cold. We were upstairs bar area. Part of the restaurant that most people don't know about but lot more spacious then the downstairs bar area. It carpeted upstairs, the lounge chairs lot more comfortable (downstairs more stand up bar stool/chair), and even have little arcade type area have golden tee and couple other games.  Watching any games have more then enough televisions upstairs or downstairs. They do also sell cigars if in the mood for stogie and cognac. The restaurant area not all that big but have ample amount of booths and tables too choose from. It interesting setup since you literally have three different area can hang out at! \n\nThey do have great prices for HH. It been while since came here for HH. The beer here is delicious! Every time I keep coming love mixing up my brews from darker stouts too lighter ales. I know not many brewery in Vegas but feel Chicago Brewing Company Brew the best craft beers in Vegas. They mix it up from time too time and they do seasonal beers all the time.\n\nThe food I order the Italian Beef Sandwich. I believe it first time ordered this sandwich and why not ordered it sooner. Not that I had problem with any of there sliders (they have few too choose from) I love! Especially if put some Ghost sauce on the sliders or just about anything goes well. The KEY is NOT ON THE MENU.......So if want too get kicked by some SERIOUS heat just have ask the server for some Ghost sauce. We got some last night. Italian Beef Sandwich had so much flavor no need too kick it up. The pickled jalapenos, roasted bell peppers, onions, and something else all combine put on top of the sandwich. You have cup of au jus dip it in. So good!! The fries nothing special skinny cut fries. Even if nothing special refreshing basic fries come out hot and well seasoned. Sure this sandwich would order again and again."
        }, 
        {
            "index": 8, 
            "rating": 4, 
            "review": "We came to try this place again, we'd been here a few years ago and brought guests, I don't remember what we ate, it wasn't that impressive, so my husband and I thought we'd try it again.\n\nI was trying to stick with a fairly health meal and I ended up ordering the soldier's cobb salad.  It has chopped tomatoes, egg, smoked bacon, and crumbled blue cheese tossed over mixed greens.  It was a decent size and very fresh.  My husband got the ribs and chicken.  I was able to try a few of the ribs and they were very good.  \n\nOur service was good, the food was decent, since they brew their own beers, it will be something we come back for to try another day."
        }, 
        {
            "index": 9, 
            "rating": 1, 
            "review": "Recently visited the boy he has to try out one or two of their crafted microbrew beers.\nThe ball was half-full yet they have two possibly three bartenders behind the bar. I had to wait about five minutes if not more, to order a beer. \nThe bartenders, what children that work there, with busy playing Games with each other or chatting with you all the customers and not paying attention to that job.\nWith so many choices in this town, this is not one that will be on my list of places to return to. I think management has dropped the ball by not paying attention to their business."
        }, 
        {
            "index": 10, 
            "rating": 3, 
            "review": "I really liked this place, very cool atmosphere we sat outside and I loved it, food was really good too, our waitress was a little rude, I think her name was Alicia if im not mistaken, wasnt the most friendliest person but like I do with most females like this I just pay them no mind and then dont tip them well. other than that I willl def come back."
        }, 
        {
            "index": 11, 
            "rating": 3, 
            "review": "Tried their beer sampler- it was very good! I tried their garlic knots and calamari, both are very good! I look forward to trying the rest of the menu!\n\nHowever, these are my complaints: my friend ordered a grasshopper for me. Don't get me wrong- it was very delicious. However, when it came to the bill, it appeared charged as a Colorado Bulldog (those are two COMPLETELY DIFFERENT drinks). Also, my friend asked me to suggest him s drink to order at the bar (I'm a bartender) and I suggested a Sombrero (milk and Kahlua, nothing special) the bartenders apparently were clueless on what it was, apparently googled it and still had no idea what it was or even nearly claimed it does not exist. But yet they have a button on the register for a Colorado Bulldog?! (basically a sombrero with a splash of cola)\n\nWell, I really want to like this place. I'm giving it another try, just because the food was great."
        }, 
        {
            "index": 12, 
            "rating": 1, 
            "review": "The food is good, but the service is terrible.  I've been there 3 times, and it's always been horrendously slow, despite the place not being very busy (5 tables seated max).\n\nToday was the last straw.  My friend ordered the artichoke spinach dip, and the waiter botched it.  The waiter put the order in as chili.  By the time the corrected dish came out of the kitchen, my friend had to leave, and couldn't even eat her food.\n\nWhen I got the check, I found the waiter had rung up my friend's Diet Coke as a 14 oz beer, charging me $5 for a soft drink.\n\nI will never go back there, and I told the staff why."
        }, 
        {
            "index": 13, 
            "rating": 4, 
            "review": "Good selection on the beer, especially when they're having the seasonal beer. Great atmosphere at second floor bar/lounge. Food selection here is pretty good too. Whoever likes spicy food you must try the Ghost Wings. Chicken wings with ghost Chilli pepper sauce, hottest pepper in the world. They should have a challenge here for eating those wings. Another signature item must try is their garlic knots.  Overall a fun place to hang out and enjoy their hand craft beers."
        }, 
        {
            "index": 14, 
            "rating": 2, 
            "review": "Long story short. \n\nThrew the \"dirty\" rag on the table I was sitting at- to the other table, when walking into the bar seating area.  Waiter saw that and gave me a dirty look. Had 20 minutes until his sexton closed, he gave some girls some stuff and helped them, came to us 5 minutes before shift (yes, 15 minutes passed) and then said here's so menus, I'm leaving. \n\nThen, we pick what we want and go to bar, he says, \"wrong menu\". Gave us another one, finally ordered and they delivered. Overall it was okay- not so bad, but not so good. I figured for having table seating it might be a little better than standard bar food, but not that impressed. \n\nI get the waiter, but just get over it, obviously I wasn't purposely being a jerk, I just didn't see you. \n\nI also got eye-rolled for smoking and as well as they held their noses, by two \"dimbo\" girls.  It's a bar, 2AM, get over yourselves. Speaking of them, the crowd was young, too much for me. Can't believe I'm saying that and I'm not even 29, that's both: depressing and pitiful."
        }, 
        {
            "index": 15, 
            "rating": 4, 
            "review": "Based on the beer alone, I'd give Chicago Brewing Company 5 stars.\n\nThe selection of beers is great and the prices during happy hour are awesome! Definitely try out their beer tasting sampler if you're curious about the selection of beers they have.\n\nThe atmosphere is really nice and fun to hang out in. I dig the brick walls and views of the brewery. The servers are friendly and make sure that you're doing well regularly.\n\nAlthough the food is a bit overpriced, the portions are huge and everything I've tried has been good. The chili fries are perfect to share among friends, although I wasn't stoked with the beer cheese sauce they make. The burgers and sandwiches have not disappointed, and I really enjoyed the homemade ranch chips.\n\nFor a couple beers this is place is perfect, the food is consistently good but not amazing. However, the quick service and chill vibe will bring me back."
        }, 
        {
            "index": 16, 
            "rating": 1, 
            "review": "I've been to the brewery a few times and enjoyed it the fruit flavored blueberry beer is really good so ordered the beer the bare tender told me we are all out of any fruity beers. I seriously doubted it. Cus the guy next to him said under his breath keep that fruity shit downstairs. How are you of of beer at a brewery what a joke. \n\nBeing that it has a Chicago name most would assume it's a Chicago sports friendly bar. Well the other night during the Chicago Hockey game there were plenty of Chicago fans I jokingly said to the bartender hey were in a Chicago bar why aren't you a Chicago fan?! \n\nWow the attitude I got from the bartender and the customer at the bar was amazing. He responded this isn't a Chicago bar!!  I will never return there again used to be my go to spot to watch football games. \n\nJust a price of advice have Chicago friendly bartenders at least support the name. Jeez. I felt like I was in LA with the way they acted."
        }, 
        {
            "index": 17, 
            "rating": 4, 
            "review": "From 1/9/16\nWe came to Chicago Brewing company after a movie to nosh on some burgers and have a drink. Chicago Brewing Company is located in Village Square, on the Fort Apache side of the street.\n\nWe were seated, and the restaurant area was practically empty, no complaints there. Our server seemed kind of blah; I'm assuming she was drained by the tone of her voice. But hey not her fault, sometimes you just have an off day!\n\nWe ordered the burgers; they were soooooo good, cooked perfectly and just all around good flavoring. \n\nI will be back for sure to try their other items."
        }, 
        {
            "index": 18, 
            "rating": 2, 
            "review": "Went for first and last  time yesterday. I am from Chicago and went to watch the Cubs playoff game. We were excited to meet other fans, but disappointed to learn this is not really a \"Chicago\" establishment as the name implies. Different tables of us were given conflicting information about happy hour and about their policy on watching the game. We were told in the downstairs bar that they only provide sound for the game in the upstairs bar, so we had to move upstairs. That was fine, but once there we were informed that a private party had reserved the space, so we could not listen to the whole game. Another employee then told us that the party would be in a separate room and we actually could keep the sound. We specified that we needed to know for sure so we could decide whether to stay or go watch the game elsewhere and were reassured we should stay. So, we ordered more food and drinks and invited other friends to join us, bringing the group up to 6 people. It was extremely frustrating when employees then turned off the sound and we then had to watch several innings while listening to crap music instead. The bartender did take mercy and we were able to hear the final inning. The bartender was actually amazing, running drinks and food out to us from behind the bar even though he was the only one up there. The beer was good, pork sliders good, and pretzel bites were good. The caprese salad was disappointing, and the garlic bites were cold by the time they got to us. Overall, it was a disappointing and frustrating game watching experience, for which I blame poor management. The employees did their best given a poorly planned event."
        }, 
        {
            "index": 19, 
            "rating": 4, 
            "review": "Try the chili cheese fries for an app!!  Huuuge portions.  The beef dip sandwich is  a fav lunch item."
        }, 
        {
            "index": 20, 
            "rating": 5, 
            "review": "We have eaten here many times and everything we've ordered has been fantastic.  My favorite is the filet mignon skewers with horseradish sauce along with an order of their crispy onion rings.  It fills me up for dinner and I have the other half for lunch the next day -- two full, top notch, meals for about $20.  That's hard to beat."
        }, 
        {
            "index": 21, 
            "rating": 5, 
            "review": "If you are looking for pizza that is not from you know the normal carry out this is it! They have the best deep dish pizza!!! Their wings are amazing 2 oh yeah you need to try their clam chowder their potato soup or their French onion soup they re the absolute best!!!"
        }, 
        {
            "index": 22, 
            "rating": 5, 
            "review": "Sitting here watching basketball and enjoying the decor. The staff is very helpful, and accessible, but don't feel the need to check on you every three minutes. Our waiter Billy is was good, and the manager seemed nice too. \n\nThe food was stellar. Our group had pulled pork sliders, pulled pork mac n cheese, a miracle mile meat pizza and the pretzel bites. The sliders weren't spectacular, but certainly above average. The pretzel bites themselves weren't anything special, BUT, the dipping sauces (cheese and mustard) wwre AMAZING.\nWe had a thin crust pizza, and it was great.  Crust still had a little chewyness to it, and didn't seem like it was made on crackers like many thin crusts.\n\nThe root beer was really good (I think they make that in house too). I only had the Weizenheimer Bavarian wheat from the beer list, and as a wheat fan I have to say it was pretty good.\n\nThis was our first time here, but it certainly won't be our last."
        }, 
        {
            "index": 23, 
            "rating": 4, 
            "review": "Yes, it's a \"theme\" restaurant, but in my opinion the only thing that may appear theme-ish is the fact that they serve deep dish pizza, (which is quite tasty, by the way).\n\nI do not like beer, but for those who do enjoy the frosty beverage, they have several local and on-site drafts on tap. My boyfriend really enjoys their summer ale at the moment.\n\nThey have a fairly extensive menu, which ranges from gourmet pizzas to pot roast to standard bar fare. The food is definitely good, but some items are a little on the expensive side. For example, a large chicken caesar salad will set you back $12 (it's decently portioned, but it's still chopped lettuce with some chicken). Conversely, the chicken parmigiana, which is absolutely delicious, is $12.99; but any average eater could easily get two meals out of it.\n\nThe staff is nice and fairly attentive, but sometimes the service is a little slow, depending on if you sit in the bar or not and the time of day.\n\nI'd definitely recommend, but know you're probably going to throw down about $20 to get the full Chicago experience."
        }, 
        {
            "index": 24, 
            "rating": 4, 
            "review": "Great service and a cozy bar environment. They have a back section where you can get away from people and chat with your friends. They have deep dish pizza, but just like Windy City, it's not REALLY deep dish. It's not deep enough! I don't understand why they can't make the crust thicker by using a deeper pan. The crust was REALLY good though and the pizza, in general, was delicious, so I'm not going to complain too much. They brew their own beer, too; I had their light ale and it was very drinkable. :) If I'm in the area again, I'll stop in fo' sho'!"
        }, 
        {
            "index": 25, 
            "rating": 4, 
            "review": "Beers were a mix bag, some good, some not (to be expected), service was good, though they goofed on the bill. Chicken strip were very good, above average chicken went into making them, that was clear. Perfectly cooked as well.. Only thing I'd suggest is asking for them to be tossed in the sauce, they serve it drizzled on which leaves some bites with more flavor than others. The teriyaki sauce was extremely sweet as well, more than most I've tried."
        }, 
        {
            "index": 26, 
            "rating": 1, 
            "review": "TERRIBLE!  I so wanted this place to be great...unfortunately, it was disgusting!  The ahi plum salad had fish that should not have been served atop over-dressed wilted greens. They DID take it off of our check, but it never should have made it to our table. Half of my bf's fries were over-cooked, half were under-cooked...you could see the color difference. It was the first time I've ever seen BBQ sauce on a burger not move; he was able to hold his burger, shake it and the sauce still not drip or even slide around at all. While I had no beer, the bf ordered their blonde and it was flat. My \"date night\" ended an hour ago when my bf went to bed sick to his stomach. WY to cock block Chicago Brewing Company!"
        }, 
        {
            "index": 27, 
            "rating": 2, 
            "review": "Stopped by here for a quick dinner on a late Sunday night. They have a midnight menu that starts at 11pm and happy hour that starts at 10pm. Their menu is limited to pizza, sandwhichs, typical bar food. We didn't order the pizza or beer because we just had it for lunch. I had the chili, my bf ordered the pastrami sandwhich which was just ok but I didnt like the bread it came on. He also had a side of mac and cheese that looked like it was kraft from the box. I could of made that for 25cents. The only cool thing I thought they had was chicken wings or tenders with ghostpeppers. It is supposedly the hottest pepper on the planet? Its pretty expensive too, $14 for 4 tenders or 6 wings. Since no one in our group wanted to eat it for a challenge we ordered the tenders and each took one. I think we all had about 1 bite and immediately needed a jug of water and glasses of milk. It was SPICY!!\n\nIf you ever have friends to want to take a challenge, Chicago's ghostpepper chicken wings are the place to go for it."
        }, 
        {
            "index": 28, 
            "rating": 4, 
            "review": "The happy hour is now 4-7 again but still no late night happy hour and you no longer have to leave the bar area to get your food. They deliver it right to your table as before. It is annoying that the happy hour is only offered in the smoking venues. I would love to drink my $6 pitcher and eat my $6 pizza without having to go home and shower and wash my clothes afterwards. Other than the smoking complaint, this place is great. Maxx is a great server and takes good care of my party at least once a week. \n\nAll of the food I have tried at CBC has been above average. This place has been a staple for my friends and I for the past two years and we will continue to frequent this place even though they discontinued our favorite 10pm happy hour. The seasonal beer right now is awesome! I hate it that the springfest is no longer available but the brew they replaced it with is a 9% ABV Belgium beer. It's not sold in pitchers but during happy hour it's available in a 16oz goblet for $3. Well worth it."
        }, 
        {
            "index": 29, 
            "rating": 3, 
            "review": "Since this is a brewing company, I had to try the beer. The best way I thought was to go with the sampler... It comes with 9 (i'm not sure, I stopped counting after the first buzz kicked in!).. \n\nOut of the beers, I enjoyed the seasonal beer which was the blueberry vanilla. Guess it's cause I like fruity. I don't usually like dark brews but I enjoyed the black star stout. Had a very yummy coffee taste to it. The other beers I didn't really care for.. and actually some had a really really bitter to it. (Yes, I know beer is suppose to taste bitter but I didn't care for these). \n\nThe food was good. Nothing I'd actually really crave again. The chili cheese fries were good.. reminded me of an upgrade weinersnitchel  chili cheese fries. I liked that they used thin fries instead of a thick cut. \n\nI don't like blue cheese but it went well with my sliders. The carmelized onions added a nice sweetness to it...\n\nAnd there you have it, my review of chicago brewing company."
        }, 
        {
            "index": 30, 
            "rating": 5, 
            "review": "Upstairs bar is way better.  Great bar staff.  Quick service.  Cheap beer and wine."
        }, 
        {
            "index": 31, 
            "rating": 5, 
            "review": "The food here is good - some items are definitely better than others, but I've never been disappointed. If you're looking for an appetizer - get the spinach and artichoke dip in the bread bowl. The bread bowl takes the dip to a totally different level. \n\nThe real key components that set Chicago apart are the phenomenal house-brewed beers, and the awesome staff. They're all knowledgable, give great suggestions and are quick with a recommendation. \n\nThe ambience makes for a great place to grab some drinks on the weekend, and especially during happy hour (crazy amazing prices for craft beer). If you're in on the weekend, make sure you pop up to the Loft upstairs and see Brad. Quick with a joke and always phenomenal service.\n\nAll in all a great place to stop in if you're in the area, or just want a good beer."
        }, 
        {
            "index": 32, 
            "rating": 4, 
            "review": "Pretty good food. The beer was great. Enjoyed the whole experience and the server was on his game. All-in-all, the food, the service and the atmosphere was great. Will come again."
        }, 
        {
            "index": 33, 
            "rating": 5, 
            "review": "It's my neighborhood favorite bar always a great time always great service never a dull moment here"
        }, 
        {
            "index": 34, 
            "rating": 2, 
            "review": "We were told this place was amazing. I think amazing might be a bit of a stretch.\nGood food, at a great price. Absolutely! But that is about it.\n\nThe beer drinkers at the table loved the selection of beers.\nMaybe that is the secret? Go to get drunk and have good pizza?"
        }, 
        {
            "index": 35, 
            "rating": 4, 
            "review": "Its been a few years since i last frequented Chicago Brewing.  I was really pleased with my recent visit!  Chicago was opened in 1999, and back then the craft beer and the menu would have been a real exotic in Vegas.  They have several slider hamburgers with odd meats like alligator, bison, kangaroo, and antelope.  These days, it might be just a novelty, but I loved it!  \n\nI had alligator sliders with the house stout.  My coworkers tried the house IPA, the cheese steak, and one of the salads (the one with tuna on it).  My alligator sliders were awesome.  They each had an egg sunny side up, a tomato, lettuce and sauce.  The dish came with a side of sweet potato fries.  I've never had alligator before!  It tasted kind of like a cross between fish and beef.  The patty itself was lightly fried with some spices that really made the flavor quite nice.  \n\nMy friends both enjoyed their lunches as well.  The salad wasn't the best, but it wasn't an iceberg bomb either.  The beer was pretty good.  Back in 1999, this beer would have been top notch.  Today, the West Coast style of brewing is to make bigger beers.  None of the beers crafted at Chicago are above 6.5%.  Chicago has kind of fallen behind the times a little, but the beer is still awesomely fresh.  You can see the brewery through glass walls in the center of the establishment!\n\nOverall, while not the best brewery in Vegas (ahem, Draft House), it is a real treat for craft beer drinkers.  The food is good too.   The restaurant is small enough to be cozy and intimate, so even non-beer drinkers should have a visit to check out the strange sliders or maybe a pizza!"
        }, 
        {
            "index": 36, 
            "rating": 4, 
            "review": "I took my sister out for dinner here. This place is awesome! We had Teriyaki wings and deep dish chicken Alfredo pizza soo delicious!! Loved the beer sampler as well! When I come back to Vegas def coming back!"
        }, 
        {
            "index": 37, 
            "rating": 3, 
            "review": "Sunday nights, I don't get out of work until 10 PM. Like many towns, there's not a lot open around 11ish unless you want to pay exorbitant prices on the Strip, or eat fast food. \n\nWell on Sunday, 4/17/11, Lawrence T., came to see the show I work for and afterward, we were in search of some food. Having missed out on Ken M.'s UYE \"Pizzas, Peppers & Pints\" and living too far away to come here by myself, I was dying to try this place because they serve Ghost Peppers and luckily, it's right around the corner from Lawrence's apartment, so that's where we ended up going.\n\nIt was a ghost town when we walked in. There was one person in one booth when we walked on in. We were seated right next to the kitchen. I was torn when I saw the menu. \"Chicken fingers in ghost pepper sauce or ribs.\" It was a tough choice because I'd been dying for ribs for a good week now, and to add insult, my parents had went to Lucille's BBQ earlier that day with my youngest siblings and brought my sister and me back nada. The pull for BBQ was too strong, and I ordered the ribs and fries ($19), and Lawrence ordered the BBQ chicken sandwich ($10)  topped with breaded onion strings, and macaroni salad.\n\nWe didn't have to wait too long for our meal to be delivered to us. The food runner switched our plates and seemed a bit surprised that no, the meat was my order. My ribs were good, but not fall off the bone. They weren't the Memphis Dry Rub ribs that I love so much, they were smothered in some sort of BBQ sauce. I regret not trying the Ghost Pepper... anything because common sense tells me I can eat BBQ anywhere. Lawrence took half his sandwich home for the next day but I assume he liked it.\n\nOur bill came out to $31.35 with tax, which is a little steep for late night food, but that's my fault for ordering ribs. Would I be back, eh... only if I'm for sure going to order something with the Ghost Pepper, otherwise, nah."
        }, 
        {
            "index": 38, 
            "rating": 3, 
            "review": "Food was pretty good but service was lacking. We sat outside and enjoyed the day. Would return if I was in the area but definitely not seeking it out..."
        }, 
        {
            "index": 39, 
            "rating": 3, 
            "review": "Nice spot to meet up wit frenz & chill out...They got the upstairs 4 folks 2 get loud...Family area downstairs, if U got the kids...Amy & I went 2 this joint & thru down a few beers...DAMN!!!  Took us a memorable glass home 2...Food is aight...I-candy, 4 sho..."
        }, 
        {
            "index": 40, 
            "rating": 4, 
            "review": "Cant beat 24hours.  I had sliders with caramelized onions and blue cheese... delicious. Their IPA isnt half bad either."
        }, 
        {
            "index": 41, 
            "rating": 3, 
            "review": "I've been here twice. The first time, we sat up in the loft area.  There was a pungent overpowering smoke odor and I just felt like I wanted to shower as soon as I got home to get the smell out of my hair.  We sat at a table and one of us had to get up each time and order pitchers at a time since it took awhile to get drinks.\n\nThe second time, I sat with a few friends at the tables on the first floor by the fireplace.  The service was extremely slow and I realized after awhile it was because the main bartender was also running around grabbing table orders too.  I'm not sure if that's usually how it is, but that definitely caused a delay in service.  Again, we'd preemptively order a couple drinks at once to hold us over until he came back around.\n\nDon't ask why, but I ordered the ahi tuna salad. At a bar. Hmm.  It was actually pretty okay though.  Too much salad to tuna ratio, but it was okay.  I wouldn't order it again though.  The general agreement from my other friends about the food was that it was okay.\n\nIf I was rating just beer, I would give this place 4 stars.  They have a house blueberry vanilla kinda beer that is really yummy.  Their house beers are good and I'd go back for that alone.  I really like their house blonde, it's light and tasteful.  But the service is just terrible and the food is just okay. And they don't have that famous big glass drink thing they used to that I've heard people talk about (sorry for the ambiguity since I've never actually seen it)."
        }, 
        {
            "index": 42, 
            "rating": 5, 
            "review": "Went there tonight to celebrate daughter's graduation from UNLV.  They were having their Holiday party and we were told it was Open Bar from 6-9. Could not believe it.  Was also informed a free prime rib buffet.  Had a great time.  We'll definitely be back even if we have to pay. Lol"
        }, 
        {
            "index": 43, 
            "rating": 4, 
            "review": "I've had a restaurant.com GC for Chicago Brewery for about 6 months as I knew Id eventually find myself hungry in the middle of the night. Last night was that night.\n\nThey had only their late night menu available, but there were plenty of options available.  My girlfriend and I ordered the filet mignon sliders, garlic knots, and chicken fingers. All were well above average, but not amazing enough to come back exclusively for.  We didn't get to try the pizza because of the late night menu, but I remember it being pretty darn good.\n\nWe also had the beer sampler... I'm not much of a beer drinker but all their beers were pretty good. The sampler was more than enough beer for the both of us."
        }, 
        {
            "index": 44, 
            "rating": 3, 
            "review": "Not bad but most of this is smoking video porker.  Had the chicken enchilada soup, which paired nicely with the sun down stout, on nitro."
        }, 
        {
            "index": 45, 
            "rating": 5, 
            "review": "Ronika!!!!!! Is truly the best and because of her amazing service, we will be coming again. Chicago Brewing Co. you are lucky to have Ronika on your team! The food was delicious and your beer is tasty. We now have a regular hang out spot. Thanks!!!"
        }, 
        {
            "index": 46, 
            "rating": 3, 
            "review": "The happy hour is great for beers, but food choices are limited. For $2.00, you will get the 16oz glass and for an extra .50 you can upgrade to the 22oz. The two beers I was struggling between were the Seasonal Daisy Triple and the Fruit Seasonal Mango Hef. Jeff, our server, was helpful in helping me choose between the two. I was looking for a lighter beer and he steered me toward the first option and offered me a sample to make sure I enjoyed it before I committed. The beer was a nice balance to the snack that we ended up getting.\n\nWith four choices of food on the happy hour menu, we decided to get something to tide us over and wait until later to get real food. We decided on the chicken tenders ($6) tossed in the Brew-BQ sauce with a side of ghost sauce. I had experience the insane heat of ghost sauce before and was willing to press my luck again. My lips were on fire and I was in sweet agony. I am truly a sadist when it comes to hot and sour foods. If pain is not something you strive for while eating, don't get this sauce. Jeff was kind enough to keep watch on our waters. I drink a lot while eating and it was only intensified ten folds. The tenders came in an order of five large, juicy strips, dosed in the BBQ sauce."
        }, 
        {
            "index": 47, 
            "rating": 5, 
            "review": "I love this place. Used to live around the corner and would bring the kids for dinner. I think it's the best pizza. But it has to do with lots of great memories with family and friends. I'd get the 22oz Hef and the fat meat lovers pan pizza. The dough is great.  Just chewy enough with a hint of sweetness.  The wings were great too. Great times, great memories. This place is a winner in my book."
        }, 
        {
            "index": 48, 
            "rating": 3, 
            "review": "The service was great but, the food and atmosphere (restaurant side) were mediocre. I had a philly cheese steak & my husband had a hamburger.  I didn't get any feelings that made me want to come back and try something else."
        }, 
        {
            "index": 49, 
            "rating": 4, 
            "review": "Went in for dinner, hostess was nice and friendly.  My friend ordered a chicken sandwich and I ordered country fried filet.  Both dishes were really tasty and the service was very good. We had the garlic knots for an appetiser and they were really tasty.  Would definitely go back!!!"
        }, 
        {
            "index": 50, 
            "rating": 2, 
            "review": "New menu recently went into effect. Literally 90% of the dishes my family ordered are now not available or changed. For example the steak sandwich is still available but now it's a flat iron instead of a New York strip steak. No more fried filet mignon entree or sliders. No more ranch chips....and the list goes on. \n\nI tried to keep an open mind even after the disappointment of the new menu but unfortunately the food we ordered was just as disappointing. The biggest disappointment was the under cooked under seasoned hot wings. The skin was slimy not crisp and the hot sauce flavor was nonexistent. \n\nSo sad to see another good restaurant go downhill."
        }, 
        {
            "index": 51, 
            "rating": 2, 
            "review": "The food wasn't that great. The sliders were lacking flavor. The thin pizza was made with some funky dough. The kind of dough that you get from Pizza Hut. The service was spotty. Our server would disappear at times. He also didn't have much of a smile in his face and it felt like he didn't want to be there."
        }, 
        {
            "index": 52, 
            "rating": 4, 
            "review": "I've now had my return visit to CBC and it is definitely a 4 star for the food. We went with another deep dish pizza and also had chips and salsa as we had a friend with us. The veggies on the Lakeshore Veggie are cooked perfectly (we get it without mushrooms because I can't stomach the fungi). The crust is crunchy a buttery, the sauce tangy but not overpowering. The chips and salsa (plus beer cheese dip) were also good. I loved the chips and the salsa. The cheese beer dip was sweet. I don't know what that was about, I don't know what beer they used, but it just didn't taste right. I could have eaten more chips, but thank goodness the pizza came out just in time.\nI also had a full mug of the Ramblin' Reck Red. It was quite delicious. I bit more carbonation than other reds I've had, but still a nice malty flavor. \nI would have considered a 5 star, but our service just wasn't good. It was dinner time and happy hour so CBC was hopping. Our server was working tables inside and outside. We kind of got the shaft. He was very apologetic, which was nice, but not fun. \nI am looking forward to my next time so I can have some more beer."
        }, 
        {
            "index": 53, 
            "rating": 4, 
            "review": "In my search for local brewed beer I was led here to Chicago Brewing Company. Chicago is one of the bigger breweries in the Las Vegas scene and pretty much anyone into craft beer has been or heard of this place. My review really just applies to happy hour so keep that in mind.\n\nCBC features several standard beers along with a few rotating seasonal. The hefe, IPA, brown, stout and some others comprise the regular beers, keep an eye out for the Hawaiian Honey with an astounding 14% ABV. My personal favorite, the Hefe is true to it's German roots with a crisp wheat taste and golden color. Service is hit or miss during happy hour and may have to wave down a bartender to get your order in. \n\nHappy hour is M-F 3pm-7pm in either the upstairs or downstairs bars. I was a little disappointed that there is no late night happy hour which probably explains why this place is a ghost town after 8pm. They offer up $6 pitchers along with $2 14oz and $2.50 22oz. Great prices on awesome beer you can't get anywhere else in town. CBC is pretty weak on the food offerings, $6 for chicken fingers, a cheese pizza and garlic knots. Meh. The upstairs bar doubles as a cigar lounge so if second hand smoke isn't your thing, stay away."
        }, 
        {
            "index": 54, 
            "rating": 5, 
            "review": "All I have to say is the blueberry vanilla wheat beer is AH-mazing! Haven't been able to find anything like it anywhere else."
        }, 
        {
            "index": 55, 
            "rating": 5, 
            "review": "This place is great! Awesome friendly bartenders, great food, fun gaming. Love this place, I have included Chicago brewing in my favorite bar list. Great service great food :) try the black & blue sliders or any of the pizzas you won't be disappointed."
        }, 
        {
            "index": 56, 
            "rating": 4, 
            "review": "Really good New York style pizza,better then their Chicago style in my opinion."
        }, 
        {
            "index": 57, 
            "rating": 3, 
            "review": "Late night burger & wings - burger rocked but the fries & wings lost their crispness since the chef forgot to pop a few holes in the styrofoam but it's ok - next day I broiled em & yum yum gimme some!"
        }, 
        {
            "index": 58, 
            "rating": 1, 
            "review": "Horrible food, Buffalo sliders tasted like puuure salt sweet potatoe fries tastes burnt and hard as a rock, servers were rude and non helpful."
        }, 
        {
            "index": 59, 
            "rating": 5, 
            "review": "Best service I've ever had, The server was great and after a minor incident he took the drinks off of the bill. What he did was very respectful and I am very glad I had him as our server. Next time you go ask for Billy, because he is by far one of the best. Their other service is good but this man gets a 10/10"
        }, 
        {
            "index": 60, 
            "rating": 4, 
            "review": "First off this place had the best food! The garlic knots are the shiz. Pizzas as well! Not to mention brews on brews! I love the heff w/ an orange! The only thing about Chicagos that sucks is the vibe. It's just a regular bar, cool but nothing special. Quality wise Chicagos has the upper hand though over mainstream bars like PT's. if you're looking for custom brews and some serious bar food Chicagos is your place! If you're looking for something high class and date worthy it's definitely not going to knock the socks off your potential mate. Four stars."
        }, 
        {
            "index": 61, 
            "rating": 4, 
            "review": "Stopped by here on a lazy Monday afternoon with a buddy of mine.   The place was easy to find and it was about half full which was surprising for a Monday afternoon around 1.   We were greeted and shown to a table.   We looked over the beer selection which was pretty decent, but we wanted to try the stuff they brewed.   We both ended up ordering the IPA.  It was good, it had a nice bitterness to it.   Since we really weren't that hungry, we ordered some steak fries to snack on.   Those were pretty good.   It was a good match for the beer.   \n\nOverall, this is a nice place to go.   Will I be back?   Yeah, probably, but I need to see more of what's around first."
        }, 
        {
            "index": 62, 
            "rating": 3, 
            "review": "Decent-Good craft beer (big selection) but their menu is so-so for me. I always end up noshing on their food after a couple drinks, but the menu is kind of pricy to go there just to eat. Cool environment, can get pretty busy but is often really low key."
        }, 
        {
            "index": 63, 
            "rating": 4, 
            "review": "The food here was excellent. I went for lunch and ordered a ginger ale and the cheesesteak with beer cheese and it was so hot and delicious. The fries were skinny and so tasty. But...the service was okay. We waited over half an hour for our drinks to come and i had to ASK  for a refill. Mind you, it wasn't busy (2 pm) and we were at the bar, there were 4 of us, so please do the math. And our food did not come at the same time. The guy waiter (he reminded me of Jordan Peele) was courteous, but he didn't seem like he wanted to be there. Other than that, this would've been a 5 star review!"
        }, 
        {
            "index": 64, 
            "rating": 5, 
            "review": "Absolutely love this place! We are locals and stopped in for a brew and had a great time! Special thanks to Bob our bartender for being awesome! We will be back!"
        }, 
        {
            "index": 65, 
            "rating": 4, 
            "review": "Went for dinner last Friday.  The most notable item consumed was definitely the spinach and artichoke dip!  ($10) probably the best I've had in Vegas.  Delicious thick white cheese and not a ton of pesky vegetable spinach.  Comes with baisc tortilla chips.  Nice portion!  Also had a decent buffalo chicken wrap served spicy style...not too spicy...came with thin fries. ($10)  Wanted to try the mango wheat but resisted.  Good job by Jonny our waiter keeping the iced tea flowing."
        }, 
        {
            "index": 66, 
            "rating": 4, 
            "review": "We went here on a high recommendation from a friend who brought us. I got the beer sampler and absolutely loved the red, brown and IPA. The seasonal beers were too fruity for my taste. The food: sliders, seafood and wraps were surprisingly good for bar food. I really liked the atmosphere and our waitress was great. Finished with some great Bacardi and Cokes. I would like to revisit this place when I return to Vegas. A lot better of a deal than the Strip."
        }, 
        {
            "index": 67, 
            "rating": 3, 
            "review": "My boyfriend and I went for happy hour. Its was really good we has the calamari, beef sandwhich, Reuben. Was really tasty except for the ranch chips, I would not recommend to salty. Taste like They just put ranch mix seasoning on chips. Overall I recommend coming here!"
        }, 
        {
            "index": 68, 
            "rating": 5, 
            "review": "I went here to watch the Bears game and they are losing the game.  Had a bit of fun time last night dragged myself here. Alex, the waitress was like a cute little sister she sat down with me and helped me pick the menu. \n\nThe hostess was very friendly and put me in a booth to watch the game. I ordered the Reuben. I must say all the staff seems genuinely friendly relaxed and it was refreshing in a NON smoking  environment in the dining room downstairs. The Reuben was stacked high & freshly sliced which came with cross cut sweet potato fries. Very good!\n\nThe only issue I would like to hear the game here but perhaps in the bar the  game audio is on.  The dining room had Christmas carols playing  in the background."
        }, 
        {
            "index": 69, 
            "rating": 4, 
            "review": "Chicago Brewing Co. -\n\n- An UPDATE \n\nTHREE THINGS..I NOTICED IN LAST SUNDAY's Happy Hour:\n1. Its Happy Hour STARTS at 4pm, NOT at 5pm as I had mistakenly thought before.\n\n2. Beware:  There is \"NO Happy Hour SEATING at the Bar Counter downstairs\"!\n\n3. Its HH is POPPING during game time with excited screaming fans (me included)!\n\nYES, its attractive offers are still ALL there, i.e.:\n- 22oz draft for $2.50; wine, 3; well drinks, 4; delicious HH bar dishes ($3-6) ); \n- Its reverse HH still goes between 10-midnight (I've got to give it a try after movies sometime)!\n\nYELPY DETAILS YOU CAN IGNORE:\n- After a long walk in Pueblo Park yesterday (Sunday) afternoon, I wisely decided to hydrate myself properly, well, deliciously! So, I went to CBC for the 22oz draft and thin crust pepperoni pizza($6 plus $1 extra for pepperoni)...over exciting NFL games! \n - And...What a healthy HYDRATING experience it was, indeed! \n\nNow, here's something STRANGE about \"Seating at the BAR COUNTER\", though: \n\n- When I got in CBC around 4:30, I first went upstairs to take a look at their small loft bar. The bar counter itself was completely full; the lounge area still had a few bar tables. However, other than the lone barkeep, I did not see any server upstairs (perhaps, not until after 5pm). \n\n- As I was alone this time, I wanted to sit at the bar counter, so I went back to the downstairs lounge.   Here I was surprised to find out that the Happy Hour seating is \"restricted\" to the lounge area! In other words, one cannot have HH at the downstairs bar counter itself! \n- I think the reason for CBC's doing this is that they want the gaming machines available to playing customers. Perhaps, CBC knows that most their HH customers are NOT INTERESTED in playing video poker machines?\n- There's no such restriction in the loft bar lounge, however. \n\n- Well, luckily, I got a comfy bar table along the wall, with a great viewing angle for several tv's! The food and drinks were great! My server was pleasant and attentive. And the atmosphere was just right for the occasion! The lounge area was almost completely full by 6pm, full of screaming fans for the 49ers and later for the \"home team\" Bears [who lost, if you care to know, to the Texans!]\n\nBTW: - Oh yes, there's an elevator, too, hidden around the corner of the bar. So, CBC is handicapped friendly.\n\nPeterskis, Nov 2012\n--"
        }, 
        {
            "index": 70, 
            "rating": 3, 
            "review": "This place was just okay. Service for happy hour was pretty nonexistent. Yes, I know I am ordering one beer and one appetizer but that's why it's happy hour--some people choose to get happier than others, and you still have to wait on me. $5.40 is ultra-cheap for a beer and an appie, but we were there for a couple hours and my friend (who was of the getting-happier variety) had to wave down the bartender who would pass us on his way to and from the other happier tables. Also, the loft is a cigar bar, which I didn't know going into it. I'm not that bothered by that type of smoke but some people might be.\n\nI did have a blueberry beer which I did like a lot, but it would have led to a severe case of gutrot were I to have had more than one. My friend kept downing their IPA and believe me, her happy hour mission was accomplished."
        }, 
        {
            "index": 71, 
            "rating": 5, 
            "review": "On the Saturday afternoon of Memorial Day Weekend, my Dad and I decided to check out Chicago Brewing Company.  He loves beer and I love daytime drinking so our only requirements were somewhere that you could have/do both. We got the BEST seating outside, directly under the speakers that were playing the BEST 80's songs.  We had so much fun guessing artists and song titles while drinking in the shade. The beer flight there is a STEAL! You pretty much get to try every beer (I don't recall the exact number) and for a great price (I don't recall the price either, sorry!). They also have chilled Fireball just WAITING for you to shoot. \n\nThe best part for me was complimenting our server on what a great job she was doing, only to find out that she's actually a busser! She said our original server got too overwhelmed with his other tables so she had to take over our table.  I was just in awe that someone with such little serving knowledge gave me one of the best dining experiences that I can recall.  I wish I could remember her name but CBC I hope you promoted her to be a server!!\n\nI highly recommend the hot wings as well.  If you're gonna go big and get beer and Fireball -ya gotta get hot wings.  We tried their 'death sauce' or whatever they call it - basically the hottest of the hot. But being hot sauce connoisseurs it wasn't anything we couldn't handle. \n\nThis was my first and only experience at CBC but I can't wait to go back!"
        }, 
        {
            "index": 72, 
            "rating": 4, 
            "review": "Chicago Brewing company does beer well, has a great patio, a separate smoking bar for pipes and cigars, and is perfectly average for quality of bar food.  \n\nThe Beer:  Chicago brews a lot of great beers that keep the beer snobs coming back ...Coconut Porter, Hawaiian Honey, Blueberry Wheat... and a solid selection to keep novice beer drinkers happy as well. \n\nThe Patio: My favorite thing about Chicago is the beer garden (patio) when the weather is nice.  Cool lighting, nice feel, great Happy Hour!\n\nTwo Bars:  Both bars are separated from the restaurant to allow for smoking, but the upstairs bar is cool, classy, and comfortable.\n\nThe Food:  Chicago has a huge list of food, with a lot of interesting options...but all-in-all the food is just average bar quality...maybe slightly better...but nothing to write home about."
        }, 
        {
            "index": 73, 
            "rating": 4, 
            "review": "Went here on a Wednesday evening to hit up the 5-7PM Happy Hour (5-7PM and 10-midnight, I do believe).  Parking lot was crowded, but the place was not.  Busy, but not like we expected from the lot.\n\nSat in the downstairs bar area, and got a table no problem.  Great service.  Our waiter kept checking on us, even though we took our sweet time looking over the menu.  Settled on an all Happy Hour fair.\n\nThe beer ($6 pitcher):  We got the All-Nighter first.  It was good.  A nice, light blonde.  As expected.  Round 2 was the seasonal All-Nighter (Sommerbrau, maybe?).  This one was better.  Definitely worthy of my ordering it the next visit.\n\nThe food (prices guesstimate, from what I THINK I remember):  They had Chicken Fingers ($5- mild, hot, bbq, teryaki), Chili Cheese Fries ($4), Spinach Artichoke Dip ($6), 10-inch thin cheese pizza ($5), and there was one other item, but I can't think of what it was.  We had the Mild Chicken Fingers (pretty tasty, and plentiful), Spinach Artichoke Dip with tortilla chips (good, have had better, but have had worse), and the cheese pizza (filled the void, but probably wouldn't order again).\n\nOverall:  $30 total (incl. tip) for 2 people, 2 pitchers, 3 apps, all HH items.  Will be back for more.  Next time, I'm thinking we'll try the 10LB burger though.  Sounds yummy!  And as we left, we peaked our heads upstairs and will probably look to sit up there the next time, as the couches were full but the tables were empty.  I would just question the amount of service attention we'd get up there."
        }, 
        {
            "index": 74, 
            "rating": 5, 
            "review": "Came here for happy hour yesterday and didn't really go in with any expectations. \n\nHappy Hour\nPrices were super awesome, $9/pitcher, which was perfect to split with my buddy. They also have a few $6 app choices like pizza and pretzel bites. Apparently they no longer have a late night happy hour which sucks for those who work til 12 on the strip.  \n\nService\nOur bartender was Brad, who really makes you feel like you're a regular on your first visit. He was hilarious and you can tell he has quite the customer base that come back to visit. \n\nAtmosphere\nWhat I like about this location is the three distinct experiences you can have. There is a gaming-bar area which would be somewhat similar to PTs, there is a restaurant as well which caters to more families I'm sure, but then there is the upstairs bar area which includes a cigar area. It's nice to have a bar you can sit at and not feel pressured to gamble at. \n\nTaste\nThe beers we had were super yummy. We did a pitcher of Hef and a light beer selection. The pizza was just alright but the other foods that people were ordering looked bomb. \n\nI will definitely go again! Just wish it was closer to my house."
        }, 
        {
            "index": 75, 
            "rating": 5, 
            "review": "came here for the first time with a few friends and tried the beer sampler and got a 22oz Old Town Brown which was great... was able to discover that i don't like light beers and really only like dark stout beers... IPAs just aren't my thing.\n\nPS, beer buzzes feel interesting when you aren't a beer drinker and start getting pretty drunk off 40+ ounces of beer. definitely will be back!"
        }, 
        {
            "index": 76, 
            "rating": 4, 
            "review": "They are right across my house, they have nice beer, and  good prices. So definitely in my favorite beer place.\n\nI used to be a Gordon Biersh fan, but after I discovered this place, it's my go to place for beer."
        }, 
        {
            "index": 77, 
            "rating": 2, 
            "review": "Things that have brought me great disappointment:\n\n1. The Minnesota Vikings \n2. The discovery there is no Santa Claus\n3. The quality of the beer at Chicago Brewing Company\n\nLas Vegas lacks a brew pub with great beer, great food, and fun atmosphere. (Big Dogs comes close, but not quite.)  Chicago Brewing Company offers okay food coupled with mediocre beer.  The cavernous (and usually empty) dining room gives off a forlorn vibe.  Combine this with the quality of the beer and you have the epitome of depression right on Sahara Avenue.\n\nWhat can Chicago Brewing Company do to save itself?\n\n1. Start brewing truly original (and tasty) beer.  They are a prime example of how microbrew doesn't always mean good.  For example:  A porter should have a hint of roasted coffee aroma, not taste like someone's excrement after a trip to Starbuck's.\n2. Expand upon the more creative options on the food menu.\n3. Rearrange the dining area to make it more intimate and less \"cavern of doom.\"\n\nUntil then, I will wait for someone to open a great brew pub in Vegas.  However, I won't hold my breath."
        }, 
        {
            "index": 78, 
            "rating": 4, 
            "review": "Good pizza open 24/7. Great for a night owl like me who needs a margarita pizza at 2 AM. Still haven't had the beer here yet. Will reserve posting a full review until then but the pizza alone was warranting of a good partial review."
        }, 
        {
            "index": 79, 
            "rating": 3, 
            "review": "Chicago Brewing Company (CBC) is alright in my book. They're open 24/7 and have consistently decent food. The variety isn't much and there's nothing healthy options on the menu. \n\nI will highlight that the soups and house-made root beer are too legit to quit. The bar section is separated from the actual restaurant. Happy Hours during the game are extended into the main dining room.\n\nGood service, decent prices, and portions are large. I always need a to-go box when dining here."
        }, 
        {
            "index": 80, 
            "rating": 5, 
            "review": "Had a great lunch! Appetizers were fabulous drinks were awesome, and service was amazing! Our server Ronika was very informative, upbeat, and quick. She delivered  exceptional  customer service. Just move into town from SoCal and this was the best customer service I have experienced since arriving in Las Vegas. We will defeat be coming back.\n\nMy favorites eats were the garlic knots the deep dish pizza (magnificent meat lovers), and the spinach artichoke dip. Also enjoyed the house beers very delish."
        }, 
        {
            "index": 81, 
            "rating": 5, 
            "review": "Excellent deep dish pizza, craft beer, garlic knots, onion rings, and chicken.   Nice service, as well. One of my favorite places to invite friends and family to."
        }, 
        {
            "index": 82, 
            "rating": 5, 
            "review": "After seeing the sights downtown we wandered into the 4 gueens for dinner and we ended up going to the Chicago brewing co because there was a very long at another restaurant on sight ,what a nice find it was ! Our waiter said they are known for their pizza , ( many restaurants have told me that over the years and been very average ) our waiter was right , we ordered a sandwich and a deep dish pizza and both were excellent ,especially the pizza ! And to top it off the bill came to less than $ 50 , ( pizza ,a sandwich and a few cocktails ) .Next time in Vegas we will definitely be back !"
        }, 
        {
            "index": 83, 
            "rating": 4, 
            "review": "Beers are great!! Food is outstanding.... from the salads (yes, salads) to the deep dish pizzas to sliders to the baked ziti that probably weighs 4 lbs, DELISH!! My boyfriend and I have been 5 times now and has become one of our favorite spots, and we're picky!!\n\nWould have rated it a 5 star but due to the terrible service we receive EVERY TIME we are there, yes, EVERY TIME, I just can't rate it a full 5! Such a shame! Between the servers sitting in the back soda station complaining about anything and everything to the curt disposition the servers posses each time they need to refill water or to take your order is beyond me!! Even when I ordered my salad with no olives yet came out with olives I did not complain, the server quickly realized the mistake but without apologizing or even making eye contact takes my plate away and brings me a new one. This new one, clearly picked through for olives, STILL HAD OLIVES.... which I placed on the rim of my plate so she'd notice, oh, she noticed yet did not mention a word!! Folks, I'm not asking for a foot rub or someone to bring me food on a gold platter but is a smile or even an attempt at pretending to care about a guest that loves this bar/restaurant, that keeps returning such a large request?! \n\nI rate this place between food and beers a 5 star, service on the other had? A 1 star!!"
        }, 
        {
            "index": 84, 
            "rating": 5, 
            "review": "Great service.  Ashley was so nice and explained the menu items. The garlic knots are super good. Great place. Can't beat it!"
        }, 
        {
            "index": 85, 
            "rating": 4, 
            "review": "So yah, here I go with yet another Groupon-related review!\n\nI have wanted to check out this location for a while. Honestly, if I'm in the area I'm usually too tempted by some of the other restaurants to check this place out, but I'm glad I finally took the plunge.\n\nI came with my two fellas for some burgers and beer. I ordered the Bar Brew-Q Burger, as did my main fella and my friend Ryan B ordered the Chili Burger. I was very happy with my food. Huge, I'll definitely be doing some sharing next time I'm there. The burger was moist, flavorful and cooked perfectly. Great price for the quantity and quality. \n\nTo top that glutton fest off, we couldn't resist some delectably indulgent deep-fried treats. We ordered the deep-fried ho ho, honey bun and caramel apple (I refuse to type carmel, lol). They were interesting options and I was quite happy with the choices. I liked the honey bun and apple the best, but I definitely would suggest sharing at this place. \n\nThe beers are great too. Tasty and they go well with the pub grub. We'll definitely be checking this place out more regularly."
        }, 
        {
            "index": 86, 
            "rating": 1, 
            "review": "Never EVER will I go to Chicago Brewing Company after my experience tonight. I had a bad experience here last month when they completely overlooked a 40-person birthday reservation with no staff to assist and a server that would only stay upon the promise of \"being taken care of,\" but tonight topped the charts for the WORST service I have ever received anywhere. \n\nI decided to go back to try again, as I had been sent a $100 gift certificate by management for the last experience I had. \n\nThe host, Destiny, became very visibly upset as she literally pushed me aside, through my group to walk us to our table. We had only walked a few feet from the hosts booth and were all so confused why she suddenly seemed so angry, as she had basically ignored us upon walking in. As we approached the table that she was throwing our menus down at, I proceeded to ask her if there was something that we did to upset her. She responded with, \"I don't appreciate when people walk ahead of me that I am seating. I'm the host!\"  \n\nDestiny, you work in the service industry as the front of house staff. You set the tone for your guest's experience and you are the LASTING IMPRESSION of the business. If you get that upset over something so minuscule, work in a cubicle and don't plague mankind with your terrible attitude. \n\nNever again, I'm in disbelief that a business could be run so poorly. You have just lost a LOT of business. And I gave the $100 worth of gift certificates to guests in your restaurant. Cheers to even more business lost for you guys tonight."
        }, 
        {
            "index": 87, 
            "rating": 3, 
            "review": "This was not our first visit, but it pretty much sums up the others.  Last time we sat at the bar, but this time in the dining room.  It's pretty, all brick, high ceilings, nice circular booths and also tables.  \n\nThe service was excellent.  I ordered a glass of wine and was happy to learn that it was not overpriced.  My husband had the brown ale, and he reports that it's very good.\n\nOur server had to return numerous times, because it takes me forever to figure out what I want to eat, but he never displayed any impatience.  I finally decided on a burger with avocado, and my husband orderd the Chicken Piccata special ($10 - such a deal!), and the Split Pea Soup special.\n\nHe liked his chicken a lot.  It was a good-sized portion of chicken, and came with green beans and fresh red-skinned mashed.  The soup was good, too - a large-sized bowl with thick pea soup.  I tasted it and, as usual, it was way too salty for my taste, but he doesn't care about that.\n\nMy burger arrived on a huge bun, with the avocado, lettuce and tomato.  The tomato was a slice of completely white tomato CORE.  I asked the waitress who delivered it to bring me a slice of real tomato, and she promptly delivered a whole plate of red, sliced tomato.\n\nThe burger was big, and is supposed to be Angus, but it was dry, somewhat overcooked, and definitely not flavorful.  Instead of fries, I ordered a side salad.  The waiter had said I could substitute the salad for the fries, but he didn't say there'd be a $3 extra charge.  I didn't make a fuss when we got the bill because a) we had a $25 restaurant.com certificate, and b) the salad was absolutely huge, a composed salad of greens, iceberg, carrots, chickpeas, tomato, cucumber, olives, and croutons.  I gave half of it to my husband and still had enough to fill me up before the burger arrived.\n\nI like this place:  great atmosphere, great service, and if the food were a tad better, I'd ramp up my rating.  But we'll be back."
        }, 
        {
            "index": 88, 
            "rating": 4, 
            "review": "Place had a really good IPA. I went with a local that has lived here for 30 years. He was right about this place it is really good. The beer was good as well as the pizza and appetizers. Would go there again.  I could recommend it."
        }, 
        {
            "index": 89, 
            "rating": 4, 
            "review": "This place is crazy cheap and it is 24 hours!  I rarely come out to bars but this is a pretty nice bar that isn't too sketch and has plenty of sitting space.  I hate when I have to stand the whole night waiting for a stool.  This place has plenty of tables downstairs and lots of couches and seats upstairs too.  Definitely a good spot to hang out.  Fireball shots are only $6 each!  Cost-effective if you ask me."
        }, 
        {
            "index": 90, 
            "rating": 4, 
            "review": "First time I came here was with an old friend.  We sat upstairs at the bar and enjoyed each others company along with 50 others that were nothing but friendly.  The bartender was a sweetie and so was everyone else.  Drinks were average, but at least they listen to you when you say \"No Ice.\"  I enjoyed my evening as we wondered downstairs since they close the upstairs. \n\nEveryone was wonderful and our bill was only half of what we expected.   It made my night wonderful and I'll never forget it.  Thank you guys for making that evening wonderful!"
        }, 
        {
            "index": 91, 
            "rating": 4, 
            "review": "Awesome place to go with my family we get\nPizza and it is always good. Good costumer service. But it always smells like smoke I thought that was from the bar. Other than that it is a good place to eat at!!!"
        }, 
        {
            "index": 92, 
            "rating": 3, 
            "review": "DISCLAIMER: BEER AND SERVICE REVIEW ONLY!\n\nI dropped by here and caught a bit of Monday Night Football in the upstairs sports bar area.\n\nThe bartender hooked me up with some samples and I ended up enjoying a hefeweizen (although they call it something else) and a stout.\n\nI preferred the hefeweizen to the stout. It had a nice finish.\n\nService was fine, nothing special.  \n\nThat is all."
        }, 
        {
            "index": 93, 
            "rating": 2, 
            "review": "Beside the hostess having the personality of a rock, the service to follow wasn't to impressive either.\nThe food was great from everyone at the table point of view from it being quiet the whole time until we couldn't eat no more.\nThe drinks were good, no crafted beers were partaken at our table.\nMaybe they were having an off night....."
        }, 
        {
            "index": 94, 
            "rating": 1, 
            "review": "the beer may be good but the food and the service was terrible i wouldn't reccommend this place to my worst enemy"
        }, 
        {
            "index": 95, 
            "rating": 5, 
            "review": "Delicious juicy burgers and beer! I went with my girlfriend and friend on a recommendation. We were met within a minute to be seated and our server followed right after we were seated. Good start!\n\n First off, I was recommended the Old Town Brown Ale. Absolutely fabulous! I must say that this beer was better than one of my tried and true favorites, Newcastle Brown Ale. (I never thought I'd ever say such a thing)\n\nThe pizza looked amazing but I was more inclined to try their BBQ burger, medium, of course. Very savory and delicious burger! I was absolutely enamored with the combination of burger and beer that I had ordered. I also had a chance to sample my friend's filet mignon slider and the au jus that it came with. Another fabulous choice! The burger was tender, juicy, and the au jus was excellent. Not over powering or to salty like some. Mouth watering!\n\nNeedless to say, I will be back to try their tempting looking pizza soon!"
        }, 
        {
            "index": 96, 
            "rating": 1, 
            "review": "Disgusting and awful.  Their \"Chicago deep dish\"  was a watery mess.  It's obvious this is a gambling establishment and not actually there for good food."
        }, 
        {
            "index": 97, 
            "rating": 3, 
            "review": "From the outside the place looks great. Inside decor is not so much - nothing special. Saturday night place was kind of dead, yet the service was really slow. Our server asked if we wanted to reuse our beer glasses and we were drinking different kinds of beers.  Food came out, our server did not ask if we wanted refills on our drinks - glasses were empty. Food was pretty good and seemed fresh."
        }, 
        {
            "index": 98, 
            "rating": 4, 
            "review": "This is the first time I have been here in years.  The previous time the beer was average at best.  I was very surprise on how nice the brews have come along.  I only had the Red and the IPA.  But both were ver good.  I was disappointed that I could only get the IPA in a pint and not the 22 oz.  The food was above average bar food.  the bartender was kind of stand offish but nice when she came around (sidenote...she is/was pregnent so I have to assume it would be hard to be in the  work mood)"
        }, 
        {
            "index": 99, 
            "rating": 2, 
            "review": "It's getting downgraded and fast - 2 stars.\n\nListen people, we understand that times are tough - their tough on us too. But if you're going to cut back on your happy-hour offerings, don't use the lame excuse that it because there were too many drunks making trouble.\n\nNo more $10 yard beer specials and who knows what else was lost in this recent management decision.\n\nIf you cant manage your restaurant and its patrons, just close down and make room for someone who can."
        }, 
        {
            "index": 100, 
            "rating": 3, 
            "review": "The quality in food has dropped in previous years, the pizza tastes like a 99 cent frozen pizza with little flavor and the crust feels like cardboard. The garlic knots are not soft and tasty like before, they feel hardened and also loss of flavor, the beer is still good though"
        }, 
        {
            "index": 101, 
            "rating": 4, 
            "review": "I have to talk about the beer I fell in love with initially: the stout of order. Now if your a Guinness lover, like me, this little number will have the similar joy that it brings but with a bigger coffee kick that lingers at the end. Oh buddy!\nAs for food, my boyfriend and I got a garlic, mushroom and spinach deep dish pizza that included roasted tomatoes which pulled the entire pizza together. I would love to high five to creater of the amazing sauce and crust that went into this pizza. Its as if the pizza Gods came and just delivered this piece of heaven to my neighborhood brewery. And its crazy to think that I've been living in this area for years and never thought to stop in. Count me in as a regular!"
        }, 
        {
            "index": 102, 
            "rating": 3, 
            "review": "I love the way this place looks from the outside.  The inside is also very nice and comfortable.\n\nThe beer here is worth stopping in to try.  I enjoy their Amber ale, very good taste.  I've eating here a few times over the years and the menu changed recently, probably for the best.  One time I got the exotic animal meat sliders like rattlesnake, alligator and deer.  Not bad, but no need to try it again.  The last time I got the Cajan chicken sliders and they are an above average slider.\n\nThis is a good place to stop for a beer and some sliders.  Check it out if you're in the neighborhood."
        }, 
        {
            "index": 103, 
            "rating": 5, 
            "review": "I love CBC.  Consistently good service, tasty beer, and yummy food.  Their IPA is my favorite.  There is plenty of booth seating for the restaurant downstairs, and a nice bar area upstairs (elevator available- we met an elderly gentleman who was unaware and had taken the stairs).  CBC used to have big game sliders- which was my favorite menu item, but I have been told they were removed from the menu. Still, plenty of delicious items to choose from.  I have not been disappointed."
        }, 
        {
            "index": 104, 
            "rating": 4, 
            "review": "Great beer here, and a better atmosphere to boot.  I ventured out to this place and was quite impressed with the beer offerings that they had.  I had the Black Star Stout, the Hardway IPA and the All Nighter and all of them were stellar.  For dinner I had the Cajun pasta, which I would highly recommend to anyone.  The guy sitting next to me at the bar, who appeared to be a regular, told me the deep-dish pizzas here were stellar, but since I was a party of one I thought that a whole deep dish would be too much my waistline.  The rest of the menu appeared to be standard brewery fare with a solid selection of pastas, pizza, sandwiches, burgers and appetizers.\n\nThe atmosphere of this place was kinda nice.  Downstairs had a enclosed smoking area bar (where I learned the bartenders can take your food order but not deliver it to your table due to smoking laws; they leave you food right outside the section, tell you it's ready and you have to get it yourself) complete with many TVs, and there was an upstairs section as well that had a Golden Tee machine and a cigar lounge.  There also was a normal dining area and a patio as well.\n\nService in the smoking area of the bar was a bit slow, as the bartenders seemed a bit preoccupied by the girls at the end of the bar rather than my empty beer glass, but I can't really blame them too much since the girls were hot.\n\nGreat food, great beer, great atmosphere.  Hit his place up if you are ever in the area."
        }, 
        {
            "index": 105, 
            "rating": 5, 
            "review": "Never eaten here but the beer is some of the best. The Saison is to die for!"
        }, 
        {
            "index": 106, 
            "rating": 5, 
            "review": "We have been to Chicago Brewing Company (CBC) a few times now and always have really enjoyed the fun atmosphere, the great hand crafted beer, and the food. CBC sits in the corner of the parking lot on the Ft Apache side off of Sahara. Very cool looking brick exterior which really reminds of you of a older restaurant from back east, possibly Chicago. \nWhen you walk in they have a few areas for you to choose from on where to sit and eat, and of course drink. Off to the immediate left when you first walk in is the enclosed bar and gaming area. They do serve food in here as well, and with all the TV's neatly tucked up under the bar we usually choose this area. Off to the right hand of side when you walk in is the main dining room which is pretty good size with all different sizes of tables to accommodate a couple or a large group. There is also a second story that is accessible through the bar area, but if I remember right its strictly drinking up, no food. \nLast time we were there was about 3 days ago. We went into the bar area like I said we normally do, and as usual it did not disappoint. We mad small talk with the bartender who is very friendly and even more knowledgeable about his beers. I always go for the Chicago style stuffed crust pizza. They offer many toppings of meat and vegetables. I kept it pretty plain on this night and ordered just pepperoni. I ordered the large which is a little pricey at over 25$, but the pizza is huge and very filling. I also ordered their soup of the day which was the Cajun chicken. My girlfriend ordered the steak sandwich which turned out to be the star of the night....more on that later. We then ordered a few of their hand crafted beers, I ordered the blond, and my gf the stout. Both were very good and not over powering, but not watered down either. \nNow onto the food. My soup came out first. It was a huge bowl of soup, with plenty of great tasting veggies and chicken. The broth was very satisfying and eventually I ate the entire bowl. Next came out my pizza, and my gf's steak sandwich. The pizza was great as usual, very thick, very meaty and the sauce is something that will keep you coming back for sure. True Chicago style pizza. Now the steak sandwich stole the show with a nice 7-8 oz what looked to be NY strip steak, a garlic aoli, lightly breaded onion rings and a very nice bib lettuce. All together this sandwich is top die for. At one point I found myself trying to steal more of the sandwich and left my pizza to the side. \nOverall we cannot get enough of CBC. We always take the extra time to figure out how we can get over there at least once a month, maybe more. True Chicago style pizza, but with a lot more. Check it out, I don't think you will be disappointed."
        }, 
        {
            "index": 107, 
            "rating": 3, 
            "review": "Very good selection of beer at very reasonable prices. The food is also very good, my only complaint was the service was horrible. I will try it again hoping for much improved service."
        }, 
        {
            "index": 108, 
            "rating": 3, 
            "review": "I gave a mid rating only due to the fact that I only had alcohol & the place has a smoking section. First time here & the place is broken into a smoking & non smoking area seperated by a door. This is awesome for non smokers as they get to enjoy the bar & restuarant w/o the issue of smoke. The downfall is if you sit in the non smoking area there's no bar. I tend to want to sit at a bar because normally it's faster service & you can chat w/ the bartenders too.\nWe decided to go to the bar which is located in the smoking area, both. We chose the upstairs bar which is small about 8 seats total. There is a small table w/ lounge type chairs, about 6 in that same area. It was great because we got to interact w/ the bartender who was very tentative to us & all the other patrons as well. He even suggested a twist on an old classic. There is a small balcony which we got to step out to to grab some air.\nWe must have come at the right time because there was very little to no smoke around us. Either that or people were just being very respectful to the non smokers, which is hard to find at a place these days. The drinks were on point & we were never fully empty before the next round came. That's a sign of a good bartender. Solid place! Next time we will try the food!"
        }, 
        {
            "index": 109, 
            "rating": 4, 
            "review": "Do groupons work, here is proof. They are all the way accross town for us but worth the drive. I had the patty melt which comes on rye. Cooked to order, juicy and tasty. The had a board full of beers (i didnt think to ask about a sampler.) Had a Weizenheimer with lemon. Very good. Would also reccomend the homemade potato chips, the pizza and the handcraft root beer. Service very good. Found out they have great happy hour specials. $2.5 for a 22oz, $11 for a pizza, $6 for a pitcher, yeah...i'm there."
        }, 
        {
            "index": 110, 
            "rating": 2, 
            "review": "The look of the building made me feel right at home. We have these types of buildings in the midwest so I was looking forward to the visit.  When we walked in we were advised by the hostess that the upstairs would be a fun place to sit, so we went up there. \n\nUpstairs There are three small  seating areas, but only small group was there. The  first thoughts I had were that the rug looked like it had seen better days and that table bussing was apparently not a priority. The little bar was crowded with happy people and the bartender was great- wonderful smile, nice personality. \n\nI didn't find the leather club chairs to be especially comfortable and would have preferred a real table, but overall, it wasn't a bad experience. There were two nice flatscreen TVs showing basketball, which the bar group enjoyed loudly. I loved how the natural light looked, streaming in through the windows and hitting the brick walls. Ah, Ohio...\n\nThe food? Meh.  When you serve cheese sauce with beer in it, the beer does not make up for using VELVEETA. Ok? REAL cheese, please. The chips weren't that good either. I was so disappointed. I tried the garlic pretzels and they were good, but more like soft, kosher-salted rolls. My friend's steamed clams did not taste fresh to her, but she thought they were ok.  \n\nI don't know that I would come back here. I don't have anything awful to say about it, but I was underwhelmed during this visit."
        }, 
        {
            "index": 111, 
            "rating": 3, 
            "review": "First time eating here, and likely the last time. My wife and I decided to try it out. The beer was good, and the food was fine. Our waitress was very nice, and the reason for the 3 stars is that these following items should be changed: 1) they don't offer any Military discounts and 2) I intentionally went during happy hour only to find out, it was for the bar only, not the dining room side of the place.\n\nNot sure why Happy Hour wouldn't be in all areas. After all, the website has no disclaimer related to this. Regardless of where I receive the food and service, Happy Hour should apply.\n\nUpdate: Michelle responded to my concerns, so moving up the rating as at least they listen to the customer. thank you!"
        }, 
        {
            "index": 112, 
            "rating": 2, 
            "review": "Had a craving for potato skins, so went here before a movie at Red Rock.  To my surprise, was told they changed their menu and no longer make them.  What's up with that?  They didnt bother to change their online menu and that's the only reason i went.  Since we were already there, had the trio of filet mignon sliders served with au jus which were tender and actually good.  Also had their onion rings, good but not as yummy as fleming's stack.  Also ordered their chicken quesadilla.  Yuck, made with overgrown dried out triangular crackers.  Tried their light beer they brew themselves.  Not impressed.  The highlight of the whole dining experience was seeing the girl next to us win 800 bucks at keno, of all things!"
        }, 
        {
            "index": 113, 
            "rating": 4, 
            "review": "We live within walking distance of this place, which is one of the reasons we initially tried it! The food is good! Love the Greek salad and the chicken cordon blue sliders. The deep dish pizzas are excellent and very filling! On Sunday's, they sometimes make a ravioli bolognese. It is unreal! The only thing we don't like here are their burgers. They are a tad too greasy for us. But other than that, we love it here!"
        }, 
        {
            "index": 114, 
            "rating": 1, 
            "review": "I live in the neighborhood where this place is located. I used to go there all the time. They USED TO have some really great food but over the past year the food and service have declined horribly to the point where I will never again spend another dime in this place. The last few times I have tried to order food from there they have messed up my order. I ordered a pizza with artichokes and instead they put anchovies on it and no artichokes! It was SO NASTY!!! Also, it looked like they forgot to put the sauce on the pizza and then put it on last minute as the sauce was on the TOP of the cheese! Never seen a pizza like that in my life, or a nastier excuse for a pizza for that matter! Recently I decided to give them another chance and tried to order the meatball sliders. My boyfriend phoned in the order which they took, only to call him back 10 minutes later and tell him that they've taken the meatball sliders off the menu. They couldn't have told him that when he called and ordered it in the first place? Rude & unknowledgeable staff. They recently cut their menu in half, or more. They took everything that was good off! Baked ziti, gone! Quesadilla, gone! Chicken cordon bleu sliders, gone! Meatball sliders, gone! Chicago hotdog, gone! Pot roast, gone! I literally have no reason to ever return to this place again. Way to piss off & lose all your loyal customers Chicago Brewing Co.! Also, I think the old hag, rude, nasty female bartender who bar tends downstairs threw my iphone 6 in the garbage there & claimed that it was never found when I called right after I left! Also, the last time I was inside, I saw the upstairs male bartender (Not Josh) refuse to take a pregnant woman's food order because he was too busy serving hipsters alcohol. This place just doesn't care about it's customers."
        }, 
        {
            "index": 115, 
            "rating": 1, 
            "review": "Jesse in the bar started an argument with my elderly Veteran father and then kicked him and my entire family out of the restaurant for life. We have been eating dinner here every Friday for the last 7 years. Jesse is a hot head that should not be in customer service!!\n\nBilly and Johnny have been very kind over the last 7 years so we will miss them but as long as Jesse is around we will express our dissatisfaction with Chicago Brewery! What a joke!"
        }, 
        {
            "index": 116, 
            "rating": 5, 
            "review": "Brad is I great bartender had me feeling like I wanted and the Hefe beer here is awesome. They also sell cigars. I also like there pizza it was delicious.  They have a great happy hour from 4 -6pm. I'm not a big beer drinker but they even have a good alcohol happy hour special. . If you are looking for some good beer come to Chicago Brewery and have a drink but make sure you come while Brad is bartending AF Get A Hefe with a shot of blueberry Vodka."
        }, 
        {
            "index": 117, 
            "rating": 5, 
            "review": "We love the chicken tenders tossed in their hot sauce. The Chicago style pizza is very good too  be sure and enjoy it with one of their own brewed beers. They have draft root beer for the kiddos."
        }, 
        {
            "index": 118, 
            "rating": 3, 
            "review": "Great place to visit and have drinks and finger food with friends. The beer is pretty good and the food is tasty (try their wings--they are very good). I would have given it 4 stars but the service was not the best...table was a little sticky, first pizza was unusually sweet (they apparently put brown sugar on their caramelized onions) and the waitress forgot about us a couple of times. Overall, not a bad place to visit."
        }, 
        {
            "index": 119, 
            "rating": 2, 
            "review": "This won't take long.\n\nIt seriously was just MEH. Nothing to get excited over. Nothing bad. Nothing great. Just, MEH!"
        }, 
        {
            "index": 120, 
            "rating": 1, 
            "review": "I was just at this restaurant a hour and a half ago and it was HORRIBLE!!! We waited at our booth for over 20 minutes and NOT ONE server came over to us. We never even got Drinks! I watched as all the tables around us were served including two tables that were seated 5+ minutes after us.  We closed our menus and just watched as no one paid any attention to us. At that point,  I got up and left. There wasn't even someone at the front desk for me to talk to about this HUGE ISSUE! It wasn't even busy and there were at least 4 servers at the time. I used to go here but NEVER Again...THIS PLACE HAS HORRIBLE SERVICE. No one even stopped us as we walked out! ZERO STARS!"
        }, 
        {
            "index": 121, 
            "rating": 4, 
            "review": "I'm giving this place four solid stars. My friend and I ate here during happy hour after seeing a movie at Red Rock. We stuck with the HH menu - some Garlic Knots, Chicken Tenders, and of course, their draught beer. The knots were delicious and definitely a HH crowd pleaser. The chicken was pretty good; they were tender fingers, but even though we ordered them hot, I could almost detect no spiciness.\n\nTo wash down the food, I had a Blonde Ale, while my friend started with their Hardway IPA and then switched to the Blonde Ale. I found the Blonde Ale to be quite tasty. At $2.50 for 22oz, it's definitely a steal. I tried a sample of the IPA and it tasted like a solid IPA! I wasn't in the mood for something that hoppy, but I can see myself ordering it next time. I also had a sample of their blueberry and vanilla wheat. I'm glad I did the sample first because it wasn't something of which I'd want a whole glass. It reminded me of another beer I've tried in the past that tastes like Fruity Pebbles!\n\nWhat I truly appreciated about our visit today was the service that John provided us. It was just the little things he did to make sure we were happy. After all, it was happy hour. For example, when my friend ordered the IPA, he warned that it might be getting towards the bottom of the barrel, so he brought out a sample first. He also suggested that I get a sample of the blueberry and vanilla wheat first because other people have found it to be too strong in its fruitiness. I was actually going to ask for a sample, but he suggested it ahead of me. (And I'm really glad because I ended up not ordering it). He was also mindful of the fact that we were there for happy hour. He offered and came through by warning us when happy hour was almost over.\n\nI can't speak for their entire menu, but this place is certainly on my list of good happy hours. Oh wait, I need to update my list! It's a little out of my way, but I will definitely return if I'm in the area, especially since I've now decided to see all my films at Red Rock."
        }, 
        {
            "index": 122, 
            "rating": 2, 
            "review": "In the interest of full-disclosure, this was my first visit here and I have not had another since. \n\nOverall atmosphere was less than impressive. Service was average, but nothing worth coming back for. The beer was fine, but also nothing worth making a specific trip back for. \n\nBeing huge fans of BBQ chicken pizzas, we tried their version - the Brew BQ Chicken Pizza. I imagine the chicken used is the pre-cooked, sliced strips you can buy at the grocery store (which, if you've ever had, is terrible). We picked most of it off or even had to just spit it on the plate. It lacked an adequate amount of sauce and the crust was about as good as crunchy cardboard. \n\nNot saying this place doesn't have other tasty options, but I certainly won't be back to try and find them."
        }, 
        {
            "index": 123, 
            "rating": 4, 
            "review": "Went here about a month ago, very enjoyable meal.  We shared the Chicago deep dish pizza (excellent) and the garlic knots.  My wife and daughter split the ziti dish and I had a buffalo chicken wrap.  All of the food was very tasty and fresh.  My wife, who is from Chicago, also greatly enjoyed her meal.  The portions are enormous, especially the deep dish pizza.  We had plenty of pizza, garlic knots and ziti to bring home and enjoy for a couple of days after.  The buffalo chicken wrap was also very good and had just enough \"zing\" to satisfy my spicy food cravings.\n      As we had a child with us, we did not check out the bar area, only the restaurant, which is physically seperated into two different rooms to accomodate both families and bar customers.  Overall, I found the Chicago Brewing Company to be a very good find, and would definately recommend giving it a try if you haven't been there already...."
        }, 
        {
            "index": 124, 
            "rating": 5, 
            "review": "Chicago brewing Co is a 24 hour drinking, gaming and late dining place in the Summerlin area. I really love this place. I used to come here often when I lived close and had a late schedule. Nowadays it is few and far between to have days off and late nights. Anyway my favorite thing about this place is that it has freshly brewed beer. The best beer of my life was had here. It was an apricot heffewissen that they brewed in house. And they don't discriminate either- they make beers in all colors and styles so all beer lovers can enjoy this place no matter what your preference.\n\nThe next best thing about this place is the staff. I have been coming here over 5 years and in that time they are one of the only restaurants I have ever seen maintain the level of quality in their products and the same staff. That says a lot about a restaurant. The staff is always friendly, on top of things and it doesn't matter when you come. I love that there is always room in the dining area even when it is busy you never feel ignored by he staff here.\n\nLastly I of course love the food here. Their menu is pretty varied so even if you want something different every time you come, that is possible here. They have everything from thin or thick crust pizza, to burgers, to steak, quesadillas, sandwiches, sweet potato fries and also full entrees and desserts. My favorite meal here is the chicken quesadilla with a side of sweet potato fries and nacho beer cheese! A lot of food but so worth it. I will for sure be back for awesome beer, awesome food and awesome times here."
        }, 
        {
            "index": 125, 
            "rating": 3, 
            "review": "Las Vegas Brewery Stop #3\n\nThey have a restaurant and a bar area with the brewery in the middle, which you can see through glass windows. Open 24 hrs. We tried there:\n\nAll Nighter Light Ale\nRamblin' Reck Amber Ale\nOld Town Brown\nHardway IPA\nWeizenheimer\nBlack Widow Stout\nSeasonal: Raspberry Wheat\nSeasonal: Belgian Double\nSeasonal: Honey Ale?\n\nAll the beers were light...flavorful, but not too exciting. The most exciting thing was that they have a variety of sliders with different meats....alligator, antelope, bison, jackelope, rabbit, wild boar. You can order a sampler for $30. I wish we could have tried them, but we were short on time.  Next time."
        }, 
        {
            "index": 126, 
            "rating": 1, 
            "review": "So, we decided to stop in for a bite to eat, my husband had been here before years back and experienced good appetizers and beer. A lot must have changed because the food was simply the opposite. When we walked in the host was very helpful informing us that one of the areas offered happy hour and we decided to take advantage. We ordered garlic knots and 6 huge and very appealing knots were presented. I love bread however after just eating one of these knots I was already OD(over doughed) we then ordered Fillet Mignon sliders served with au jus and that proved to be straight up maggi seasoning, the meat itself was decent but the buns were just cold strait out of the bag slapped on, then came out a cracker like and overly salted pizza and as if we did not have enough awfulness we decided to ordered their highly recommended freshly baked brownie but that turned out to be freshly over baked almost burnt brownie with a low quality scoop of imitation vanilla ice cream. Perhaps the real chef called out that day, but its hard to say if we will be back for take II"
        }, 
        {
            "index": 127, 
            "rating": 3, 
            "review": "I'm giving them just three stars because their happy hour menu used to have way better deals. Otherwise though the beer and food are great."
        }, 
        {
            "index": 128, 
            "rating": 5, 
            "review": "Great food! Great bartenders.... Brad and Jason upstairs are awesome! I always get great service from them both. Ty have the ability to socialize and continue quality service. Def comin back!"
        }, 
        {
            "index": 129, 
            "rating": 5, 
            "review": "A great place to come and enjoy yourself! I have only been to the bar a few times but plan to check out the upstairs soon. The regulars who attend are as much fun and notable as the staff, which are always friendly and nice. I haven't had a bad experience here yet, and the food is always so good!"
        }, 
        {
            "index": 130, 
            "rating": 4, 
            "review": "Not bad. Their happy hour goes pretty late. I would recommend their large pan crust BBQ chicken pizza. Yum!"
        }, 
        {
            "index": 131, 
            "rating": 2, 
            "review": "Nice place to relax and have some drinks. Their beer selection isn't vast. It is more quality over quantity. The patio is a little small but it's nice and welcoming. Sadly, I ordered pizza for carry out and was extremely disgusted. Aside from the order being messed up and the wrong toppings on the pizza the dough was completely UNDERCOOKED and raw. I am glad I checked before eating it...total health hazard. Will not be going back. Not to mention when I called to complain the lady who answered was rude and argumentative. She insisted I had ordered ham on my pizza. I don't eat meat so why would I order it?!"
        }, 
        {
            "index": 132, 
            "rating": 3, 
            "review": "Good food, great beer prices, and cozy atmosphere.\n\nFood-Good, but nothing special. We ordered 6 sliders...3 Black n Blue and 3 Filet Mignon, plus a order of their steakhouse fries. Black n Blue had more flavor in my opinion; Filets were too salty. Fries were decent, but the cheese on them was GOOD! Beer was good as well and I liked their selection. \n\nPrices-Food was average, but their beer was cheap! 60 oz for $6...how could you go wrong!??\n\nAtmosphere-Cozy almost at\nhome feel for the dining area. I think made the service better. Bar was a different story. Just not my thing to eat in areas with smoke. Just drinking? Sure.\n\nOverall, I would definitely go back to Chicago Brewing Co., but only for their cheap beer."
        }, 
        {
            "index": 133, 
            "rating": 4, 
            "review": "If you want to get off the over priced Las Vegas strip go to the Chicago Brewing Company.  This is where to locals go for a great locally brewed beer without the overpriced Strip pricing.  Walk into the brewpub, bear left and proceed up the steps to belly up the small bar where the bartender (Jason?) will actually introduce himself and will try to remember your name for the next visit. (Some kind of word memorizing gig he does.)  Had some pizza which was OK.  The upstairs got crowed after 9:30PM."
        }, 
        {
            "index": 134, 
            "rating": 5, 
            "review": "Mia and Alex were our servers. The food, beverages and service were simply outstanding!! Happy New Year"
        }, 
        {
            "index": 135, 
            "rating": 4, 
            "review": "have been trying out some Brewery's around town.  My friend went to this one said I needed to try it out.  The beer we had was the Amber and their Stout.  They were both pretty good.  I had the Chicago Dog, in order to fulfill my chicago cravings.  It was a good dog, but nothing like what you get at Wrigley.\nUpstairs is a smoking/cigar lounge.  Its a cool place to hang out, specially if you like cigars.  In terms of the service, it was to be expected.  The bartenders there were friendly and accommodating.  There isn't much more to ask for from an environment like this.  Either way, a pretty good place to grab a beer."
        }, 
        {
            "index": 136, 
            "rating": 2, 
            "review": "I went here on Fourth of July around 9 o'clock not expecting it to be busy and it was not, I figured everyone was doing their own thing. I was craving some great cracker thin, crispy style pizza. We ordered the artichoke dip to start. It had a nice cheesy layer on the top, which was piping hot, but the inside of the dip was not that hot, which leads me to believe this thing came straight from the freezer. Aside from it being unbelievably salty, the flavor was just bland. We also ordered the veggie thin crust pizza, that looked super nice but the only parts of the crust that were crispy were the edges, they didn't cook it long enough for the whole pizza crust to crisp throughout. The veggies seemed fresh enough, but there was barely any cheese and I felt like the sauce they used came straight from a can. The food was just meh, but the server was nice and they had a decent beer selection. My friend also left his phone there and they were honest and kept it at the bar for us. I would maybe consider going back to drink at the bar, but probably never eat here again."
        }, 
        {
            "index": 137, 
            "rating": 5, 
            "review": "I come here all the time and the service is always amazing. Bella has been my server the last couple times and she's absolutely wonderful. She helped me find my favorite beer! The garlic knots are soooooo delicious. 10/10 love this place."
        }, 
        {
            "index": 138, 
            "rating": 1, 
            "review": "This was my first and sadly my last time here! A friend of mine who has eaten there on several prior occasions suggested the place. Since she spoke so highly of it, I really wanted to try it.\n\nAt first glance, I was very impressed with the decor, but that's about the only thing that impressed me. My dining companion said that she only gets one thing when she dines at Chicago Brewing Company -- the Shrimp Cocktail. When they brought her plate of shrimp out(it was previously served in a cocktail glass), the first thing she said to me was \"the shrimp are smaller and the price went up since the last time I ate here.\"\n\nI wanted to try a Chicago Style Pizza and so I ordered one. The first one came out, I didn't like the sauce they used although the toppings were quite tasty (bacon and chicken) We asked if they would re-make the pizza this time using a white sauce and they obliged. The second one came out but was obviously under cooked. I had one piece of each pizza, a coke and just because I didn't eat much I ordered a root beer float.\n\nMy companion and I both left unsatisfied. Within less than an hour, I became physically ill. From reading the reviews here it seems like most of the people like the place but that was not our experience. Unfortunately, I can't agree with everyone else this time. In my opinion the food is mediocre at best and priced a bit on the high side. A complete and total waste of $40 and talk about something that will ruin someones day? Everyone is entitled to their opinion and I have posted an accurate, fair review. Thanks for taking the time to read. Hope your experience (if you decide to go here) is leaps and bounds better than mine was!\n\nIf the business owner is willing and should happen to see this review; I would graciously accept a refund but I don't believe you could ever convince me to return."
        }, 
        {
            "index": 139, 
            "rating": 4, 
            "review": "Although I live right across the street from this place, I don't eat there often.  This time I enjoyed it.  The baked ziti deep dish was a treat!  They take ziti, mozzarella, parmesan and fine marinara sauce and bake it right in to a deep dish pizza crust!  Fantastic.  The salad was good.  I got a beer but found it too warm.  I asked the server to make it colder so she brought a frozen mug to pour it in.  Didn't help much.  For $4 I would have preferred her bringing me a newer colder one."
        }, 
        {
            "index": 140, 
            "rating": 1, 
            "review": "Came here to watch Cubs playoff, game one against the Dodgers. They pride themselves in being a Chicago sports bar. Well, apparently not. They closed off the loft bar until 6:00 pm for a BABY shower of all things. I guess so the mother-to-be and baby can inhale cigarette smoke and drink. What where they thinking. Really!!!! Oh wait they weren't. One more thing, the downstairs bar they will not put the volume on for the game!!!!!! They should be re-named to Gamblers brewery. That's who they cater to."
        }, 
        {
            "index": 141, 
            "rating": 5, 
            "review": "Holy moly. I think I just ate an entire cow. And then some.\n\nFirst off, heads up: If you're looking for a beer review, go check out Elite Emily's review. I'm not a huge beer drinker and can't really tell the difference between a stout or an IPA, I can't tell which one had more hops and which one had more malt. I'm even worse at beer than wine (and I'm pretty bad at wine), so if you're looking for that, sorry.\n\nBut if you're looking for a food review, I just had the Chicago Chili Burger. This thing should have its own ZIP code. It's huge. They serve a huge patty open-faced -- not even trying to hide it, like, \"Oooh, we put a tiny bun on top so it looks bigger...\" No, it was like, \"MAN UP, SPARKY, THIS AIN'T OUR FIRST TIME AT THE RO-DEE-O.\" Then, on top of this delicious hunk of meat (the burger, not me) they pour on some sloppy, messy chili and green onions on top of it.\n\nThis is no sissy burger. This is not one of them chain restaurants \"Oh look we dropped a bit of chili on this burger\" burger. This is a burger that looks your daddy straight in the eye then makes out with your momma then slaps your sister upside the head while walking out your front door and fist-bumping with some very bad dudes.\n\nGrab your fork. This burger ain't here to f**k around.\n\nIt was a test, but it was also really good. The meat was juicy and tender, and the chili was really tasty. It was a sweeter chili, since of course it was Chicago-style, so I wish it had a little more spice to it, but that would be my only complaint. Otherwise, A+, gold star, attaboy.\n\nBUT WAIT! There's more!\n\nOne look at their dessert menu will give anyone a foodierection. I was looking at something called \"Blondie & Clyde\" which is like a mash-up of a brownie plus a butterscotch bar, but on the bottom of the page were their deep-fried treats. Elite Emily and I share a weird love/hate relationship with deep-fried anything, and she spotted the deep-fried carmel apple (which was either a caramel apple or an apple from Carmel, CA). Hector went with the deep-fried honey bun, and I couldn't be the odd man out, so I indulged in the deep-fried Ho-Ho.\n\nI loved mine... the deep-fried Ho-Ho reminded me of a chocolate chip donut bar, and the deep-fried honey bun was like a bear claw. But I was most impressed by the deep-fried carmel apple. As you bit into it, you heard a \"crunch.\" This is because somehow, after the apple is deep-fried, somehow it still comes out crisp and tart! It's really great, you have to try it to believe it.\n\nGreat place, I highly recommend it, under one condition: don't go see a movie right after it, because it's bound to lead to food coma."
        }, 
        {
            "index": 142, 
            "rating": 5, 
            "review": "This place has fantastic deals on food during Happy Hour and I love their Pot Roast and Full Rack of Ribs!"
        }, 
        {
            "index": 143, 
            "rating": 3, 
            "review": "I came here with two of my Co workers for Ken M's UYE Pizza, Peppers, and Pints event. Unfortunately I didn't see anyone from Yelp so we sat in the bar area because my co workers didn't want to sit around children. \n\nI really wanted to order some of their Sleeners but my co workers and I are participating in a weight loss challenge. That means we shared two salads. We ordered the Greek Salad and the Buffalo Mozzarella Salad. I mostly ate the Buffalo salad. It had mixed greens, Roma Tomatoes, sliced Buffalo Mozzarella, and we had the Balsamic dressing on the side. The croutons were two small slices of  toasted French bread. Everyone was being good and didn't really want to eat them except for me. I mainly had veggies all day and needed some substance! The two salads can easily be shared between three people with enough to take home. It also makes you full fast!"
        }, 
        {
            "index": 144, 
            "rating": 4, 
            "review": "Great food. Bartenders are hit and miss.\nBrady who is a bartender there is awesome. There is also some Hispanic lady there and it seems like she hates her job. \n\nPeople don't go to a bar to just drink. They go to talk to someone and having an impersonal bartender does not go along very well.\n\nFor shock factor. Their ghost pepper wings are awesome.\nFood is always good and reasonably priced for the area.\n\nDo try their happy hours. Chicken nuggets for $8 during happy hours. Well worth the price."
        }, 
        {
            "index": 145, 
            "rating": 3, 
            "review": "If you like hot wings try the spicy with a couple drops of ghost pepper sauce.  Gives it a good kick!"
        }, 
        {
            "index": 146, 
            "rating": 1, 
            "review": "Chicago Brewing Company... Wow I'm not really sure what happened to this place... Years ago they had amazing food and amazing service now I refuse to go because the service is terrible and the food is even worse the atmosphere in this place isn't even good anymore"
        }, 
        {
            "index": 147, 
            "rating": 5, 
            "review": "Friendly service, awesome beer (All Nighter especially) and great food at great prices. They even made us one of the biggest and best nacho plates ever though not even on the menu. And best of all, it is right across the street from us. Couldn't ask for more !!!!"
        }, 
        {
            "index": 148, 
            "rating": 4, 
            "review": "Great atmosphere and very accommodating. Put tables together, Alicia was very attentive and took care of everything."
        }, 
        {
            "index": 149, 
            "rating": 4, 
            "review": "I'm going to upgrade my rating for Chicago Brewing Company to 4 stars based on the last 2 times I went there prior to moving away. The food which I originally thought was just OK seemed to have gotten better and more interesting. The last time I was there, my friend and I shared a sampler of their wild game sliders. I believe we got the alligator, jackalope and wild boar. And, as always, they have a nice, rotating selections of their own locally brewed beer."
        }, 
        {
            "index": 150, 
            "rating": 3, 
            "review": "We went to Chicago Brewing Company last weekend at my wife's suggestion.\n\nWe started with a bowl of clam chowder. The presentation was nice and had a fresh clam shell on the side of the bowl. The taste was okay but had a little too much pepper and more vegetables than I care for in my clam chowder.\n\nWe both got one of their micro-brews to drink. I ordered the Weizenheimer which is their hefeweizen. My wife got the black widow stout. Both were decent though we both preferred the beer the other ordered so we swapped.\n\nFor our entree we split the wild game sliders combo plate. It consisted of six different sliders: alligator, antelope, bison, rabbit, jackelope (antelope and rabbit), and wild boar. I was really excited to try all the different types of game but was underwhelmed. \n\nThe alligator tasted like seasoned salt and cumin and was a little heavy on the spices. The fried egg on top was a nice touch though.\n\nThe antelope was really dry and I had to choke it down. It had a licorice/anise taste to it.\n\nThe bison and jackelope sliders were also dry and not particularly memorable.\n\nThe rabbit had a very mild taste and wasn't as dry as some of the others.\n\nThe wild boar was my favorite. It was a little dry but the meat had a nice taste and wasn't masked by spices.\n\nThe sliders had animal toothpicks in them labeling what kind of meat they were which was a nice/cute touch.\n\nThe sliders were served with waffle-cut sweet potato fries. They were pretty good and not too sweet.\n\nNot sure if I'll go back. If I do, I'm gonna try something else."
        }, 
        {
            "index": 151, 
            "rating": 3, 
            "review": "Place isn't too bad to stop and have a drink. It was kind of packed for a Thursday night. We saw a guy getting helped out by his friends. He was stone drunk, legs dangling. Have a feeling this happens more often than you think. \n\nIt's basically a PTs with a slightly better draft list since it's a brewery. The beer isn't that great. It's not something you would purposely go out of your way for. They are slightly better than the normal bar options. The brown ale would be the way to go. \n\nI put some money on the machine to play and cashed out when the getting was good (up $10, big spender!). Bartender asked me to sit at a table to free up the machine to those who wanted to play. That's a normal thing in these bars to do that but it was nice as the bartender comped our drinks so that we would move. I thought that was a little nice touch."
        }, 
        {
            "index": 152, 
            "rating": 3, 
            "review": "BABY DON'T YA WANNA GO?  Sweet Home Chicago!\n\nAs a born and bred Chicagoan, I was really excited when I first  saw the glowing 'CHICAGO\" shining on to Fort Apache.  I've been several times since then and always come to the same conclusion:\n\nAwesome variety, average food, good beer.\n\nThis menu has something for everyone.  They have wild game burgers such as Alligator and Elk, deep dish pizza, and a lot of standard fare.  What has got me buzzing since my last visit though was the Ghost Burger.\n\nFor those of you who have ever watched the TV show Man Vs. Food, you know all too well about the hauntingly hot ghost chili, but have you ever tried it?  A lover of all things hot, I was thrilled to learn that Chicago Brewing Company had several items on the menu featuring the ghost chili.  I have a good tolerance for heat, but let me tell you that the ghost chili is the REAL DEAL!  After my first bite, my mouth was an inferno of pain, my face began to sweat, and I couldn't reach for my mug fast enough.  I struggled to get through all the burger, but did it. \n\nIt was an experience I'm happy to have had, and would never relive.  Expand your horizons, and taste some fire!\n\nBottom Line:  Great selection on the menu and good beer make this brewery a great destination for happy hours and group gatherings."
        }, 
        {
            "index": 153, 
            "rating": 5, 
            "review": "They have a friendly staff. Food is always great. I'm from Chicago...& this is pretty darn good. Love their pizza. One of the closest to the real deal. Their hot dog is my favorite. \n\nCan't forget their homemade brewed root beer. You can get a jug really cheap. I get the root beer to go..and buy vanilla bean ice cream..so good. Gotta try it. And if you bring back the jug you can get a refill for cheaper. Also you can buy their home brewed beers in jugs too. Refills also cheaper."
        }, 
        {
            "index": 154, 
            "rating": 3, 
            "review": "Food is okay at best but the beer is AMAZING! My favorite is the All Nighter and the sampler (you get to try 9 of their beers, including specialty and seasonal ones ) Its also really cool to bring beer lovers here or friends out of town because they brew their own beer in house which makes for a great visual."
        }, 
        {
            "index": 155, 
            "rating": 4, 
            "review": "This is a difficult review, because if it were a bar/brewery only, I would EASILY give them 4 stars. I think their beer is pretty solid, and the happy hours prices are excellent. There are a few things that irked me, but we'll get to them. \n\nI was here with a pretty large party, so I suppose you should take that into account. Service wasn't exceptional, and maybe serving a large party affects that somewhat. The manager of the restaurant was extremely polite and accomodating, and I appreciate that. I don't regret celebrating here at all-- I'm glad I chose this place. I probably could have done just as well picking a big ol' corporate BJ's brewery or a Yardhouse, but as always, I give preference to smaller businesses and experience their unique spin on food. \n\nI tried their standard pale, which was very smooth but perhaps a bit uninspiring. Perhaps it could have been a bit more floral but it was very easy to drink and that is a plus. Their amber is sweet and comforting. Better than a bottle of Fat Tire no doubt. I also tried their brown ale. Slightly less malty than a New Castle, but again, fairly easy to drink. Trying these beers was fun and I would like to try more of them. The coconut porter looks especially tempting, so I'll have to save that for next time.\n\nMy food experience wasn't phenomenal, but it was decent enough I suppose. I ordered the italian beef sandwich, because my understanding is that its' an authentic Chicago food item. The meat was perhaps a tad more well done than I would have liked, and salty, but the Au Jois was adequate. The macaroni salad was pretty standard. The chicago pizza that others ordered looked pretty agreeable, and the Reuben looked delicious-- I think I will choose it next time. \n\nI think it's a bit silly that happy hour is not allowed in the dining area. Several from my party walked over to the bar and brought back beers at a much better price than the rest of us who had to order at full price. I don't quite see the purpose of this policy, but hey it's not my business. \nFor my birthday, a complementary chocolate pizookie was served.  I am partial to chocolate but it was honestly pretty damn good, and I do appreciate gestures such as this. \n\nSo how does this place stack up to a BJ's or Yardhouse? Probably about even. I'd give them a 3.5, rounded up to 4 because of that personal touch, and the novelty of brewing their own beers. I WOULD certainly recommend this place for an event , just manage your expectations I suppose. It was a cool looking, fun environment to celebrate in and I thank them for helping me have a fun night."
        }, 
        {
            "index": 156, 
            "rating": 4, 
            "review": "This is as close to Chicago as I'll get for now.  Such a grand theme outside and in.  I like the look.  I also like how they have tall cushioned booth seating.  It sorta keeps meal conversations with some privacy, although the ceilings are super high.  The brick walls are cool!\n\nYes Florence dear... Double tiered beer sampler and it turns like a carousel.  So neat :)  good flavor variety with their beer menu.  Guess which we liked?  And it's not wimpy just cuz they're not dark.  We prefer the fruity beers.  Except however, the one that literally tasted like coffee (shoot oh forgot the name).\n\nOoooh MUST TRY their prosciutto wrapped skewers!  I enjoyed it with the horseradish.  Yeah I like horseradish don't snicker at me... Ppptthhh.  I woulda if I coulda ordered anotha...\n\nBut we had pizza to work on.  Deep dish margarita pizza with chicken.  Delicious for sure.  The deep pan crust was its own - not my chalky dough type of preference.  It was good though.\n\nPlace is good for any reason to have pizza with anywhobees you want company with.  This includes young kids who like to repeat \"mom mom mom mom mom\" until the parent pays attention (not with our party).  Have a slice of pizza and chug a beer!  Not for the kid..."
        }, 
        {
            "index": 157, 
            "rating": 4, 
            "review": "Great happy hour and always friendly service.  They offer 2.50 large beers and 6.00 personal size pizza during daily happy hour.  Great fresh brewed beer and decent pizza.  Lots of parking and a good atmosphere.  Only complaint is they dont have sound on for sports."
        }, 
        {
            "index": 158, 
            "rating": 1, 
            "review": "Used to be good. Horrible service food has gone way down hill. Been coming here for 20 years must be new management last few times it's gotten worse think I'm done, too bad."
        }, 
        {
            "index": 159, 
            "rating": 3, 
            "review": "Was here for Small Business Saturday, and scored a giant pint glass for $10. A decent price, and for $15 they will fill it with a cold one.\nThe bar area is typical poker bar chic (I use that term loosely) and is relatively inviting. Chicago Brewing usually has some unique flavors on tap, and I was pleased to enjoy a Coconut Porter. This one deserves kudos, the coconut was not too prevalent but was definitely there. I haven't had their food in a while, and ran out of time to get some garlic knots or pizza. Outdoor seating is available too."
        }, 
        {
            "index": 160, 
            "rating": 4, 
            "review": "Been here a few times with friends. The service is fine, a decent happy hour, good brews and tasty food. Been to a couple other brew pubs in town and Chicago leads the pack. I will be going back.."
        }, 
        {
            "index": 161, 
            "rating": 4, 
            "review": "Nice staff, clean, lots of places to watch games etc pizza is not bad and the beer is good, I reccomend this place"
        }, 
        {
            "index": 162, 
            "rating": 1, 
            "review": "We were there last nite and will never go back the food is the worse than words can say the bartender was rude extremely dissatisfied"
        }, 
        {
            "index": 163, 
            "rating": 2, 
            "review": "Me and my husband have never been before, so last night while we were trying to figure out what to eat I suggested Chicago brewing company. Big big mistake, my husband ordered hot wings. He said they were some of the worst he had ever had. He said they weren't hot enough and were terribly dry. I had a chili burger with fries. The one thing that was right was the way my burger was cooked, other than that it wasn't good. My fries were cold, my chili was cold and the flavor was off. The food in mine and my husbands opinion was a huge let down, especially since we had heard such great things. The service was good, our server was very attentive and accommodating. We can be pretty tough customers when it comes to certain things and she handled it well, she was a wonderful waitress. If you want to go for the food beware, steer clear of the hot wings and chili burgers. Such a let down."
        }, 
        {
            "index": 164, 
            "rating": 4, 
            "review": "I have only had the bar menu, but I like the Chicken Fingers.  The chicken fingers tossed in ghost sauce are terribly spicy and are not worth ordering, but definitely get a side of  ghost sauce for dipping."
        }, 
        {
            "index": 165, 
            "rating": 3, 
            "review": "On the few times a year I am out late, this is a dependable place to get okay food and a drink before heading home.\n\nI am not a fan of their beers, but they have plenty of other beers in bottles.\n\nI like the ghost wings and pizzas.\n\nI would go to BJ's over this place during the day, but a good place to go ending a night out."
        }, 
        {
            "index": 166, 
            "rating": 3, 
            "review": "My boyfriend and I tried this place out a few days ago and weren't impressed with the food. He didn't really like their American Amber? I don't drink beer, but I think that's what he called it. He liked their hefeweizen, though.\n\nFor an appetizer, we got the steakhouse fries. The menu said it was topped with beer cheese and I'm not a huge fan of beer, but we tried it anyway. I didn't like it much, but it was all right. I probably wouldn't order them again, but if my boyfriend wanted to, I'd munch on the fries on the bottom that didn't have much (or any) cheese on them, which is what I did that day.\n\nWe both tried the country fried filet mignon. I didn't really like the mashed potatoes -- they were sour for some reason. I've had mashed potatoes like that and I'm not sure what it is in them that makes it taste that way, but I don't like it much. The meat was kinda tough and dry; the fried batter just fell right off. I just felt like I was eating a kind of dry steak and some chips.\n\nAs for service, the staff was nice. However, we got the wrong drinks three times. We had a guy that was in training as our server, but I don't blame him for this. The first time, my boyfriend ordered I think a 16oz beer, but the bartender poured him a 20z, which he said was fine. Then a waitress refilled my raspberry iced tea with unsweetened iced tea. I let our server know what happened and he got me a refill of the right drink. Lastly, my boyfriend was trying to ask our server for the hefeweizen before he walked away; however, he had already swiftly walked out of earshot. The busser was handing us our plates of food and heard my boyfriend, so he said he'd send the server back our way. The server was nice enough to return with a beer, but it was a refill of the same beer. I'm guessing the busser just told him my boyfriend wanted another beer, but didn't specify which or did not indicate that the server should come and ask. He also could've, but the server didn't bother to. Can't really know for sure, so I can't say who's responsible.\n\nThe place didn't seem that busy as there were empty tables, so I don't think that was the problem. I think they need to work on communicating or fulfilling orders a bit more. Overall, it was decent. We're not sure if we're going to come back, but if so, it won't be because we enjoyed the food. I'm willing to give them another chance, though."
        }, 
        {
            "index": 167, 
            "rating": 1, 
            "review": "The service from the bar was not great when the waitress came over it became worse. Food was blah.  The staff was worried more about the gamblers at the bar. Waitresses were more worried about the bartenders."
        }, 
        {
            "index": 168, 
            "rating": 3, 
            "review": "CBC is pretty solid as brewery/restaurants go, but nothing special. Though, as far as micro breweries in Las Vegas, it's the best I've tried. The beer selection is decent but nothing I tried struck me as special. And isn't that the point of brewing your own beer? To be different than all the other guys? The food is typical brewery fare, comfort food, pizza, and a lot of fried stuff. \n\nThe service is quick and friendly, and the prices are reasonable."
        }, 
        {
            "index": 169, 
            "rating": 3, 
            "review": "I've been driving by this place now and then for years, always meaning to stop in and check it out.Well, the wait is over, today I finally parked and went in, ready for what awaited us...\nInteresting layout. You walk in, straight ahead is what I'd call the well lit main dining area, the the left behind the doors is the darker bar area, can get food in there too, then upstairs from that is the cigar room. We choose the bar area, sat at a table and was immediately served by a friendly woman. Not bad so far. Menu is the pretty standard bar food, peppered with 'Chicago' styled food, pizza, sandwiches, etc. I tried a Ramblin Reck amber ale, a very tasty house draft, highly recommended. Also ordered the Chicago Italian Beef and the wife got a cheese pizza.\nThe issue here was the food service. A lot of what we ordered came out wrong, I would not recommend the coleslaw (too dry, like cabbage and nothing else) nor the fries (limp). The pizza was good as was the Italian beef. \nI may give it another shot one day, at the very least, to enjoy a few of those Ramblin Recks."
        }, 
        {
            "index": 170, 
            "rating": 5, 
            "review": "Super awesome!!! 5 star food and 5 star friendly service.  Baked ziti with Italian sausage to die for.  Definitely two meals, baked in a garlic crust. Heavenly.   Black and white sliders delicious.   Angus beef, blue cheese, carmilized onion.  You have to have the ranch chips......yummmy...home made food at very affordable prices.   The lemoncello is secret Italian recipe.   Do eat and drink here.   Will be back...."
        }, 
        {
            "index": 171, 
            "rating": 5, 
            "review": "I used to live across the street from this place so I ate there quite often. Beer is pretty good but I'd have to say the food is what sets this place apart from other breweries anywhere. I live in the bay area now and theres nothing like this out here sadly :(.\n\nI have to say, this place has the best Ruben sandwich I've ever had in my life. You seriously need to try it."
        }, 
        {
            "index": 172, 
            "rating": 1, 
            "review": "I was charged $25 for Mediocre Pizza and when I asked the bartender why it was so expensive she told me to go to little ceasars if I want cheap Pizza. Wow. Won't be back."
        }, 
        {
            "index": 173, 
            "rating": 5, 
            "review": "Oh my gosh I'm dying to go back to Vegas just to eat here again! The pizza is so delicious! U must try it!!! Don't get fancy and  start adding all kinds of toppings just keep it simple cheese and pepperoni! U will not regret it (deep dish/Chicago style). The wings are so good and the prices are so reasonable I'd drive all the way from Cali just for dinner to eat here!!! Service was ok pizza takes long to come out so be prepared to wait! I love that we arrived in town so late but this little delicious slice of heaven (literally) was still open!"
        }, 
        {
            "index": 174, 
            "rating": 3, 
            "review": "Thanks to Ken M. who organized an UYE here tonight, I got to try their new wild game sliders.  They were added to the menu last fall.  The six sliders are made from the following game animals:  alligator, antelope, buffalo, jackalope (rabbit and antelope meat mixed together), rabbit and wild boar.  They come 3 for $16 (must be all one kind of meat) or a sampler platter of all 6 for $30.\n\nThree of us shared the sampler and we each had a taste of all 6 meats.  My rating would be from best to least: Rabbit, wild boar, alligator, antelope, jackalope, and bison.  All had sauces to enhance the flavors of the meat.  For example, the wild boar had red currant jelly and sharp cheddar cheese while alligator had a remoulade sauce and a fried egg.  There was a toothpick to break the yolk and make the alligator meat really flavorful!  The platter also came with some waffle cut sweet potato fries which were really yam fries--not sweet potato.  This was a good choice, and I'm glad Tony and Clint shared the sampler with me.\n\nService was good, and I had a mug of their on site brewed root beer.  Another great UYE (Unofficial Yelp Event) with a nice bunch of people at a good place.\n\nPhoto of the six sliders with the animal depictions on the toothpicks:\n\nhttp://www.yelp.com/biz_photos/XeDLyY2a7nZ3IEY4RYslXA?select=1iaD27IslbUgrrdPt1O2sg"
        }, 
        {
            "index": 175, 
            "rating": 3, 
            "review": "The BF and I sat on the patio to enjoy some beer. It was during their happy hour so we ordered off of the specials of select appetizers. Beers are $2 off, $1 off wells, half off the house wine. \n\nTheir patio is pretty nice and in the afternoon part of it sits in the shadow of the building so it isn't too bad. There are TVs out there if you want to catch a game.\n\nOrder of teriyaki chicken tenders - these were crispy but the teriyaki was too salty for me since it was tossed with it. Probably would order them plain and just put a little. \n\nMini cheese pizza - this was pretty alright flatbread type. I wouldn't really order those again. \n\nWe also got some waffle sweet potato fries which were crispy and really good. \n\nWashed it down with their Black Star Stout which was really nice, nitro nice dark malt and dark chocolate notes.\n\nService was decent, but standard. \n\nI definitely love their beer and some of their food, but this visit was just A-OK."
        }, 
        {
            "index": 176, 
            "rating": 3, 
            "review": "Hadn't been in years when I stopped in after a movie with my Mom and Yelp's own guru: Downtown Steve (5*;) Used to live within walking distance and was a reg years ago. \n\nWe were the only patrons in the dining room and had a young, very charming waiter. My ahi tuna salad was good, and a large enough portion to take half home, but some of the grape tomatoes were just the wrong side of fresh. Mom had chicken fingers and fries which she enjoyed. Steve had a pastrami sandwich, and asked if the onion rings were fresh. The waiter had a puzzled look on his face and asked: \"they do that?!\" We all nodded and giggled; to his credit, he asked the Chef and came back to report that they are frozen. \n\nFood was good, service was good, Pinot Grigio was A-ok and the company was great. The bar area (smoking) seemed busier as did upstairs. The patio is usually a fair weather favorite spot and lots of folks enjoy their Happy Hour specials. Will have to visit a few more times to see if it is as I remember.  For now, 3*"
        }, 
        {
            "index": 177, 
            "rating": 5, 
            "review": "This place is just good. I have been twice now and regret not eating here sooner. I have only been in the dining area so I can't speak for the rest of the place, but apparently there is a beer garden, cigar room, full bar and outdoor seating. \n\nmy fellow yelper buddy, Ethan Z., has been trying out some pastrami sandwiches in my honor. I decided to try out the pastrami sandwich here just for him! Too bad he couldn't be here to taste it because it was damn good. I also tried a chili cheese dog that was very good. The dog had homemade beer chili, cheese and green onions on it. The dog came with a side of fries that were good especially dipped in their homemade ranch. I would order both again and probably will.\n\nThe service here is great and the servers checked on us often."
        }, 
        {
            "index": 178, 
            "rating": 2, 
            "review": "Signed up for yelp to leave this review. \n\nMaking this review while waiting for my check. It's been at least 30 minutes since my bartender has even acknowledged me, though he has helped customers to my immediate left and right. I have had my empty beer mug pushed as far to the inside of the bar as possible and I haven't even been asked if I'd like another drink. \n\nService is atrocious and I will never be back. I will also advice everyone e I know to stay away."
        }, 
        {
            "index": 179, 
            "rating": 4, 
            "review": "Been coming here for years, it's in Village Square located on the northwest corner of Sahara & Fort Apache. They have thier own parking lot, no trouble finding a spot. I have only eaten in thier restaurant side a few times so won't be reviewing the food part of it but thier bar that has its own entrance on the north side of the building. \n\nAs the name suggests they have all sorts of types of beer, thier Hefenweizen is really good! The bar as TV'S all along the bar along with gaming machines. There's seating area for 2 or 4 on the bottom level. Upstairs has more loung  type atmosphere with sofas and comfortable seats. You can order food at the bar, it's your typical bar food. \n\nThe prices are good IMO, me and the wife had 8 vodka soda water's and it was under $65 and left pretty buzzed. Late at night the crowd gets shady but then again that's everywhere. The younger crowd hangs out upstairs. I live very close to here so will be returning."
        }, 
        {
            "index": 180, 
            "rating": 4, 
            "review": "Great place to hang out and just chill. Ambiance is good, music is ok, not too loud so you can still have nice conversation with friends. They serve good food and good drinks. Servers are really nice and orders come out fast. Would love to come back! =)"
        }, 
        {
            "index": 181, 
            "rating": 5, 
            "review": "Excellent Beer and appetizers and service. I highly recommend for tapas, good beer and cigars during happy hours. The calamari was excellent and cooked to perfection."
        }, 
        {
            "index": 182, 
            "rating": 2, 
            "review": "Stick to the beer and pizza and you'll be fine.  I've had most of their beers and they are very good.  I like the amber beer in particular.  The pizzas that I've had are good, although, I have to wonder what they mean by thin crust, Chicago pizza.  I don't think the menu writer has been to Chicago.  As to the idea of eating anything other than the pizza, forget it.\n\nOn a recent trip to Chicago Brewing, we got the steak sandwich and the Huli chicken sandwich.  The steak sandwich comes on a large roll with the steak inside smothered in some sort of mayonnaise based glop.  You would have to unhinge your jaw to take a bite.  No problem though, the greasy stuff they coat the steak with acts as a lubricant and with only a slight tilt, the top slides right off.  After I scraped off as much of the oily mess as possible, I took my first bite. I found the meat sufficiently tough that it would take a school of Piranhas about a week to consume.  Resorting to a knife, I chiseled my way to a second bite only to discover I was eating a solid piece of gristle.  Disgusting.  My waitress agreed and I was spared paying for this tribute to the lowest consumable grade of meat the USDA permits restaurants to legally serve. \n\nThen there was the Chicken sandwich.  It was so dry that I do not believe it could have been served in a place where smoking is permitted due to the imminent fire hazard posed by the flammable material found in the bun.  The skin on the chicken could not be pierced by anything short of an industrial laser, although,  I'm certain that any Texan would love to have a pair of boots made of this stuff.  Eating it, however, is out of the question.\n\nGo to Chicago Brewing for beer and pizza and avoid getting too adventurous when ordering from the menu."
        }, 
        {
            "index": 183, 
            "rating": 5, 
            "review": "I spent a few hours here today and must say I was impressed. \n\nThe food once ordered was top notch, delivered fast, was plentiful and was fresh and tasty.\n\nI sat upstairs at the Bar with a few local/regular patrons and they were both inviting and great to talk to about current events and most importantly micro brews.\n\nI love heff beers and theirs was pretty darn good. When I commented on the color and taste the bar tender I believe his name was Max was happy to share his extensive knowledge on the subject.\n\nIts a pretty far drive from home but if Im in the area I will be happy to stop in and have a great brew, great food and great company."
        }, 
        {
            "index": 184, 
            "rating": 2, 
            "review": "We LOVE their pizza! We get it downtown all of the time so we tried the HQ. We sat at the bar and WOW they couldn't care less that we were there! This is an old people gaming bar so they don't need our measly beer and pizza money. I put in a $20 but that's small potatoes here, I guess. They didn't take our order, they were short with us and the SECOND I cashed out, they through down the \"reserved for gamers\" sign on my machine. I'm sure they won't even care about this review. Why would they? The staff is getting tipped from all of the old gamers... Who are we?\n\nThe location in the Four Queens is closer anyway."
        }, 
        {
            "index": 185, 
            "rating": 3, 
            "review": "We have been to this restaurant several times and like it enough to bring family to it. The menu is pretty big and offers something for everyone, but in my experience I will say that the Deep dish baked ziti is AWESOME! The ziti comes out and the outside is like a deep dish pizza. Inside you have a well spiced ziti that we also included itailan sausage, onions, and mushrooms. There is more than enough for 2, and this is what my wife and I usually share when we dine here. Now like the name states this is a working brewing company and they have about 10 of their own beers. I always get the Black Star or Black Spider (can't remember the name) stout. I think it has a great creamy roasted flavor. Only complaint would be that it never comes to the table very cold. I really think they could step up their beers and their beer service if they would serve it ICE COLD in a frosted mug."
        }, 
        {
            "index": 186, 
            "rating": 4, 
            "review": "Chicago Brew Co. has become our neighborhood bar over the past five years we have been going there.\n\nI am not a HUGE fan of their food but I can tell you that their Spinach Artichoke Dip is KILLER and if you catch Happy Hour, you can get it for a helluva deal at $4 or so.\n\nTheir Happy Hour in general has a lot to do with why this is one of my favorite bars. They have traditional happy hour along with a reverse happy hour that starts at 10 and is good in the Beer Garden (fantastic outdoor patio with stringed lights) and the Loft (located upstairs and where you can find me a majority of the time). Their (tasty) brewed-in-house beer is 1/2 off and I think it's $1 off wine and well drinks, too. \n\nThe atmosphere and staff of this bar is what got them the \"Yay! I'm a fan\" rating from me. Everyone is super friendly and it's one bar that doesn't feel like your run-of-the-mill PT's thanks to The Loft and the Beer Garden. \n\nMy only complaint is they recently got rid of their Big Buck Hunter game machine. This may sound ridic but a girl's gotta hunt."
        }, 
        {
            "index": 187, 
            "rating": 5, 
            "review": "Three words: Brad, Brady and Jake.  The best bartenders in Vegas.  True story.  The Llyods to my Jack.  Chicago is the Cheers for Vegas.  Everybody knows your name.  They are always glad you came.  \n\nNot only is Chicago Brewing company one of the best zombie apocalypse strongholds in Summerlin,  the food is always on point.  Chipotle ranch 4 lyfe. \n\nShout out to Jake for his stellar performance in The Hunger Games as Peeta Mellark"
        }, 
        {
            "index": 188, 
            "rating": 5, 
            "review": "Great Place!! I felt at sweet home here thanks to the bartenders!  The Italian Beef was EXCELLENT!!   Add some Provolone and you're in heaven.  My BF got the BBQ Bacon Burger and also loved it. It was huge.  The beer was great too."
        }, 
        {
            "index": 189, 
            "rating": 4, 
            "review": "I don't want to stray from my burger reviews with so many places in town yet to try, but I feel compelled to talk about an interesting meal I had last week.  My girlfriend and I wanted to try something different for dinner, and I quickly remembered hearing about the wild game sliders that they serve over at the Chicago Brewing Company. One thing I like almost as much as burgers is trying weird and new foods, this promised to do just that.\n\nWhile I suppose I should come back to try their burger at some point, this establishment is more on the 'typical' pub food side, and isn't necessarily on the top of my list for burgers to review. Still, the wild game aspect was intriguing enough to drag me in. The interior of the restaurant as well as the bar side are nothing fancy, pretty standard faire for a local restaurant. We went there on a random week night around 6pm, and quickly decided that based on the large amount of families and screaming kids the bar side would be better for our needs. Even though there are high top tables away from the bar itself, you can still anticipate a smoky atmosphere with mediocre service. We waited a bit too long to get our menus and first drinks, but after that it wasn't too bad.\n\nThere are six wild game sliders on the CBC's menu, each paired with what the chef believes to be the perfect complement to that meat's flavoring. You have the option of trying 3 of one style, or all 6 for a little less than twice the price. Based on a slider meal we had a couple days earlier, we knew that 6 sliders between the two of us would be more than enough and would allow us to divulge in all flavors.\n\nHere's the rundown:\n\nAlligator: from what I'm told alligator meat has very little flavor, so it is always seasoned to give whatever dish it is served as more character. Having a connotation with the cuisine of the south, this one is quite over seasoned with Cajun flavors. Don't get me wrong, they're good, but you really don't get an idea of what alligator tastes like based on this. The soft egg, Remoulade, and other toppings paired well with this.\n\nAntelope: almost too gamey for my liking, but quite good. The meat was pretty much what I anticipated it to taste like. Again the jalapeno jelly and toppings all paired quite well with it. The meat might have been a tiny bit dry, but I'm not sure how much of that is a natural trait of antelope meat as opposed to it being a slider which is always inherently dry.\n\nBison: I'm always a big fan of bison meat, and this didn't disappoint. I buy bison steaks quite often at Whole Foods, and have also been known to make a great bison burger with some of the ground bison meat from Smith's. Unfortunately we're not treated with different toppings for the remainder of the meats I will mention, but as I've stated already they paired well so why mess with a good thing.\n\nJackelope: possibly one of my favorites of the bunch. Wasn't sure what to expect with this one, but it turned out to be a great mix of two different meats, a little sweet with just the right amount of gamey. This one definitely stood out for me.\n\nRabbit: could have been my least favorite of the group. It seemed very gamey, stiff and dry, which I've heard should not be the case with rabbit meat. The dryness I could tack on to the slider size always being impossible to cook (see my review of Slidin' Thru coming soon), but I can't explain the gamey taste. Neither of us were really a fan, I think it was the only one that had a bite or so leftover.\n\nWild boar: a favorite of both of us. Picture a sausage patty, but the tastiest, purest form of that. I may not have gotten my full half of this one because someone else also really liked it, but what I had I enjoyed quite a bit.\n\nOverall this meal was a lot of fun, the little signs on each patty are a great touch, and it's an easy way for the commoner to try something 'exotic' while still sticking with a familiar form. If you're feeling a little adventurous and want to try something different, definitely give them a visit. Their beer isn't so bad either."
        }, 
        {
            "index": 190, 
            "rating": 4, 
            "review": "I like this place alot. Mainly has to do with the beer, but it has its other benefits.\n\nFood is a good mix of pub / restaurant fare. Dining area is completely seperate from bar and lounge. I have brought my family with two young ones here quite a few times for dinner, as atmosphere provides enough distraction that my kids are not bothering others patrons.\n\nLounge area outside and upstairs are great and offer nice happy hour specials, even late. Would definitely recommend this place."
        }, 
        {
            "index": 191, 
            "rating": 5, 
            "review": "What a great surprise to discover this newly remodeled with an old school feel, restaurant! You can enjoy the sports bar upstairs with all the tv's and excitement, sit in the main restaurant with vaulted ceilings or relax on the quiet outside patio.  No matter which area you choose the food, drinks, beer and service are all excellent! Fun place to take a first date or your rowdy family. Hats off to Chef Michael, that ghost pepper sauce is killer!"
        }, 
        {
            "index": 192, 
            "rating": 5, 
            "review": "I love going to Chicago Brewing Company and have been a return customer there for more than 2 years now.  Although the parking lot looks crowded during peak sport seasons, if you're just popping in to eat in the dining room- it's not crowded at all!  (Everyone else goes upstairs to watch the game.)  I have not tried the adventurous side of their menu, but I can vouch for their philly, fries and chicken fingers.  Members of my family have ordered the spicy chicken sandwich with ghost pepper sauce, and they love it (at least, I'm assuming the tears rolling down their cheeks are tear of joy with each bite...)  Customer service is always on point here.  Oh and be sure to try their root beer!  Yum!"
        }, 
        {
            "index": 193, 
            "rating": 4, 
            "review": "Being from Chicago I have to say that If you can't eat the crust by itself, its not good pizza. This is one of the few places in Las Vegas that got it right. Make sure you order the Garlic Knots. I highly recommend them and The Cinnamon Roll knots are awesome."
        }, 
        {
            "index": 194, 
            "rating": 5, 
            "review": "My husband was in the mood for Chicago Pizza and we didn't want Rosati's, so we grabbed our restaurant.com certificate and jetted to the other side of town.  We didn't expect to get such good food here.  Everything was delicious.\n\nAs usual, I didn't go for the pizza.  I love pizza, it just does bad things to my blood sugar, and Chicago Pizza, although tasty, does extra bad things.  I enjoy eating a few bites here and there from my husband so I can get my fix.  In a place like this, I try to reserve my carbs for the beer.\n\nWe ordered the following:\nThe beer sampler - we wanted to try everything so we could decide what we wanted to order (I loved the Weizenheimer and Matt ordered the Black Star Stout)\nBrew Wings - Ordered hot, but really weren't hot at all.  They still were crunchy, huge, and just overall yummy.  Some of the best I've had in town.  Instead of celery and blue cheese dressing it had a celery salad which was really cool, crisp and refreshing and I loved it.  Very creative and original.\nBaby Brew Salad - I ordered this with a Balsamic Reduction Vinaigrette.  For a side salad this was huge, fresh and delicious.\nDeep Dish Meat Lovers Pizza - Matt substituted garlic for Canadian Bacon, not sure why he doesn't like Canadian Bacon since it is just essentially ham!  The whole time he was eating this all he could say was \"wow, this is so good.\"  He was very very happy with the pizza here and this might be his favorite.\n\nI'm not sure how often we'll go here since it is, as I said, not really near where we live.  But with our restaurant.com certificate it was only $20 bucks for all this food and beer which was a bargain.  I am tempted to try the ghost pepper wings on the menu but I am a little scared.  However, with the regular hot wings being so mild I am thinking that they will be mild as well.  I shall have to work myself up to it next time. \n\nOh by the way, the beer is wonderful!  Nice to find a place in town that has the beer towers again after The Pub at Monte Carlo stopped serving them."
        }, 
        {
            "index": 195, 
            "rating": 2, 
            "review": "I called in an order and it included a buffalo wrap and garlic knots. I asked to have the buffalo wrap mild but when I got home and had the first bite, my mouth was on fire! I think they accidentally put it as HOT instead of mild. What a terrible mistake. It was too spicy, I couldn't even eat more than two bites. I ended up throwing it away. There goes $10. \n\nI also ordered the garlic knots. Now those were pretty good. However, the menu on yelp said it would be $5 but when I got the bill, it was $8. I know $3 isn't much of a difference but the prices should be listed correctly! There goes $20 down the drain. I was not impressed. \n\nThe service wasn't good but it wasn't bad. Then again, what should I expect from a brewery/restaurant. I would like to come back to give this place another try but we'll see.. \n\nThis review was based on my \"to-go order experience.\""
        }, 
        {
            "index": 196, 
            "rating": 1, 
            "review": "This is the first time I've ever written a restaurant review. It's not anything I've felt compelled to do before, but after the experience I had at the Chicago Brewing Company I feel like it's my civic duty to warn others. We are new to the area, and after perusing menus online we chose the Chicago Brewing Company for our first outing because the menu we saw said they had wild game sliders. After we were seated we discovered they were no longer on the menu. We should have left then, but we'd already ordered a beer so we decided to stay. Instead I ordered the steak sandwich. My husband ordered the filet mignon sliders, and we got a couple of kids meals for our children. My husband and children's meals were bland, forgettable, and overpriced. How I wish I had anything that good to report about my steak sandwich. \n\nI love steak sandwiches. Anytime I see one on a menu I order it. This was the worst steak sandwich I've ever had. I had no idea they could even be bad until I had that one. I ordered my steak medium, and when it arrived it was so rare it was purple. I like rare steak, so I didn't send it back. The steak was much smaller than the roll it was served on, it had a pile approximately three inches thick of the white, flavorless part of a head of iceberg lettuce, and it was drowned in so much garlic aioli that it basically tasted like a garlic sandwich. You could barely taste the steak, which was too bad because maybe if we could have we would have realized it was rotten. The steak was covered with so much melted cheese that it appeared as though the Blob were attempting to digest it. At least the Blob could have digested it. My husband and I could not. My sandwich was so terrible that I gave it to my husband, who ate the steak only in an attempt to at least get our $14 worth out of the meal. We aren't generally complainers, and our waitress was nice, so we said nothing, tipped our waitress, left, and walked around the Village Square shopping center. I stayed longer, but my husband went home, where he proceeded to get violently ill. I hadn't eaten nearly as much of the sandwich as he had, so it took a little longer for my food poisoning to kick in. \n\nLater that night I called the restaurant to tell them so they wouldn't serve the steak to anyone else. The kitchen manager told me it takes six hours for food poisoning to kick in, which is a lie. He said the general manager would call back the next day. That was also a lie. I decided to look the Chicago Brewing Company up on Yelp, and that was when I noticed four other people complaining about being sickened by this restaurant. That makes me number five, and that's just five who bothered reporting it to Yelp. God knows how many people have actually gotten sick from this place. It's clear they must be keeping their food around long after it should have been tossed out. It's a tiny restaurant and it seems to mostly just be a place to eat while you are gambling, so their food turnover is probably not that high on certain items--one of which I'm going to assume is the steak. \n\nIt's not a coincidence that people are getting sick there. Save your money and go somewhere else. Anywhere else. Ordering the Doritos Tacos Locos at the Taco Bell next door is less likely to sicken you and ruin the rest of your weekend, and that's saying a lot."
        }, 
        {
            "index": 197, 
            "rating": 3, 
            "review": "We decided on this place since some of us wanted dinner while the rest just wanted a drink.  As a group of 7, we were seating right away as the place was pretty empty.  The waitress came by right away to take drink orders.  They had a blueberry vanilla ale on the menu, but when we ordered it, the waitress said they didn't have it, and then recommended some sort other beer with mango.  I ordered that just because it sounded interesting, and it was pleasantly surprising.  However, I do not recommend drinking this if you are going to be eating a full dinner.  The beer was full bodied and filling.  We also ordered a brewtus which was a 50 ounce glass filled with a beer of your choice for $15.  (You get to keep the glass.)  We chose the All Nighter which we all shared and enjoyed.  I think the best part about the brewtus was that refills were only $5!  Food-wise, everyone seemed satisfied with their food.  The artichoke dip and alfredo pizza were the two things that I found to be really good.  The service was really good here.  By the time we ordered, the place got busy but the waitress still made it a point to come by every few minutes to check on us.  I'd like to come back for their happy hour.  I glanced over their menu and they had some pretty good deals going on for their beer, well-drinks, wine, and munchies."
        }, 
        {
            "index": 198, 
            "rating": 4, 
            "review": "This is another spot in Vegas that my wife and I frequented often. During the week their happy hour is great, with a 22 oz. tall beer for $4. The staff has always been friendly, though there seemed to be a lot of turnover the last time we were there.\n\nWhile we always sat on their back patio, they do have a large inside, a smoking bar section, and an upstairs for private parties and events."
        }, 
        {
            "index": 199, 
            "rating": 3, 
            "review": "The happy hour appetizer menu is a joke, good in the way of drinks but a joke for food. On the menu is personal pan cheese pizza , garlic knots , and pretzel bites. The pizza was thin crust and $5 you are better off going to little Caesar's. It was OK but so small and thin the $5 just didn't seem well spent. The pretzel bites came with  weird tasting cheese; me and my friends couldn't figure out if it was just some weird pasteurized melted cheese or plain bad. We avoided dipping pretzels bites in it and opted for ranch/mustard instead. The garlic knots were much better and very big, they were actually the best thing on the menu. The sangria was also pretty good and I believe only $5-6 it came in a big glass as well with fresh fruit; delicious!!!! Will be back for the drink happy hour, it was worth it, but my advice is eat before you come otherwise prepare for dissapointment."
        }, 
        {
            "index": 200, 
            "rating": 4, 
            "review": "Every time I come to Vegas, I make it a point to grab lunch here! There pizza is top notch, the brews are cold and delicious and the service is usually awesome! The last couple of times I've gone, the bartender/server was a younger guy that was happy to help, knowledgeable and even cut my cigar for me when I left! I totally recommend grabbing a pie and brew here, and try the wings as well! Worth the trip, every time!"
        }, 
        {
            "index": 201, 
            "rating": 5, 
            "review": "Just moved back to Las Vegas from LA. So happy to be back at CBC as it has been one of our favorite local hangouts for years. The bartenders, servers, and hosts are great at their jobs. We've known bartenders Jesse, Alan, Michelle and Brady for years and they are like family. Great food, fun and people!"
        }, 
        {
            "index": 202, 
            "rating": 4, 
            "review": "Continue my night by las Vegas street and I found this cozy brewery sport bar nice service which provide me with some beer tastes so I can have the right choice to drink food was a little dry but good at the end I would come back probably."
        }, 
        {
            "index": 203, 
            "rating": 2, 
            "review": "Female bartender with large blonde hair (Shelly?), has been rather rude and giving poor service as of late. Makes it easier to pass it up as well because the beer selection has been slipping. With all the other new brewpubs popping up, I think they mainly rely on their gambling barflies rather than their product."
        }, 
        {
            "index": 204, 
            "rating": 5, 
            "review": "Such a great place to go and eat. If you want to have the best time, you have got to make sure to ask for Austin as your server. Such great service & very genuine! Out of all times I have been he has given the best service leaving me no choice but to leave this review!"
        }, 
        {
            "index": 205, 
            "rating": 4, 
            "review": "Okay place to grab a beer and watch the game. The food is average and prices are okay not to pricey but not cheap."
        }, 
        {
            "index": 206, 
            "rating": 5, 
            "review": "Great place with awesome cheap brews. It's a great place to just hang out and get a beer or eat some of their great food."
        }, 
        {
            "index": 207, 
            "rating": 4, 
            "review": "I finally decided to go after passing it for quite a while and am happy I did!  I arrived quite early for breakfast so I sat in the down stairs bar area.  I ordered a regular breakfast(eggs, bacon, potatos) and started some small talk with the bartender when she mentioned to me about their blueberry-vanilla beer.  WOW!   Love it!  So refreshing and fruity!  I plan on going back for more!  You will see more check-ins here by me!  Service is friendly and quick!"
        }, 
        {
            "index": 208, 
            "rating": 3, 
            "review": "Chicago Brewing Company deserves two separate reviews - 1 for the beer and 1 for the food.\n\nThe beer was surprisingly good.  When restaurants also have an extensive menu, I am usually a little apprehensive about the quality of the beer.  However, the IPA at Chicago Brewing Company was rather good.  I tried a sampler and the Belgian was a little above average, the IPA was very good, and the rest were as anticipated.  \n\nThe food was pub food catered to a Chicago audience.  We had a deep dish pizza which wasn't too bad, as well as a baked pasta, nachos, and wings.  The wings could have been spicier but tasted solid nonetheless. \n\nI heard they had some football specials so if you happen to swing by on a Sunday, try the IPA and maybe the wings or pizza."
        }, 
        {
            "index": 209, 
            "rating": 4, 
            "review": "I have yet to try their pizza.\n\nGreat buffalo chicken sliders though. They also run reasonably priced lunch specials which were a great alternative to having to pick between Jack In The Box or Taco Bell during the days I was at Euphoria. They have an awesome happy hour and a vast selection of beer. Oh, and did I mention that their garlic knots are to die for?\n\nOkay, I'll update this with a review of the pizza some other time. \n\nThe Final(ish) Verdict\n\nPros: \nGreat food\nGreat happy hour specials\nStrong drinks\nGreat service\nSteampunk-ish vibe and old-timey ambiance\n24 Hours\n\nCons:\nWhile the service is attentive, they can be slow to get your food to you at times.\n\nReturn Factor: 10/10. I still need to try their pizza."
        }, 
        {
            "index": 210, 
            "rating": 5, 
            "review": "The 5 stars are for the Brewery and upstairs lounge. \nI have only ever had a couple appetizers so I can't really rate the restaurant. \n\nThe IPA, Hefeweizen and Old Town Brown are soooooo good. Happy hour prices are very reasonable. Worth the drive to westside of town. They also have a location on Fremont St."
        }, 
        {
            "index": 211, 
            "rating": 5, 
            "review": "Josh S. told me about this local Vegas place that has magical blueberry vanilla wheat beer. It sounds grosse but is in fact beautifully brewed, very smooth and tasty! This brew is now one of my top favorite beers of all time. Truly stellar!\n\nThe food is also very well prepared. I only eat meat sparingly and could not pass up the Trio of Filet Mignon Sliders appetizer (three broilded tenderloin filets topped w/ sautéed mushrooms & onions). The light and fluffy bread melted in my mouth along with the perfectly cooked Filet Mignon meat.\n\nTo save room for the beer, I chomped on a light Asian Ahi Salad (rare seared Ahi Tuna, mixed greens, toasted cashews, daikon sprouts, fresh tomatoes, w/ a Wasabi PlumVinaigrette).The Ahi Tuna was perfect and the dressing was good enough to bath in! So yummy! \n\nSadly I only had enough room for the one beer but was eyeing the 50oz glass for my collection..next time. This place is a must for locals and visitors alike, regardless of its off-the-strip location. BTW, there is also a cool upstairs with games, additional bar, lounge, video poker, cigars/humidor and outdoor dining for cool nights."
        }, 
        {
            "index": 212, 
            "rating": 5, 
            "review": "So, this place is GOOD! The pizza was phenomenal! Lots and LOTS of cheese. And had a really good flavor. The cheese they use on the French onion soup was incredible. The garlic knots sans sesame seeds are yum! Too bad I really don't like beer. The friends I was with raved and raved  about this seasonal blueberry beer.  Service was exceptional. Thanks Alex."
        }, 
        {
            "index": 213, 
            "rating": 2, 
            "review": "I had been coming here since this place opened its doors....but do not come here anymore.\n\nThe quality of the beer has become a damn joke and management has completely lost it.\n\nIt is really sad to see one of the breweries we had here in Vegas that used to be so great....fall to be so low. And please understand...used to be great..REALLY GREAT and I used to be here 3-4 times a week.\n\nI had waited to do this review.....but it seems to just get worse. It's really sad"
        }, 
        {
            "index": 214, 
            "rating": 3, 
            "review": "Just had the Mac & cheese with pulled pork and all I can say is that it does not compared to the filet mignon mac & cheese they use to have and now I'm sad. 3 stars just for the excellent service."
        }, 
        {
            "index": 215, 
            "rating": 5, 
            "review": "I love this place! I come here on a regular basis and have never had a bad experience. Tabitha was our waitress and had been on multiple occasions. She is entirely awesome!"
        }, 
        {
            "index": 216, 
            "rating": 4, 
            "review": "Yay! I am so very happy that we loved this place. \n\nThere's a very relaxed environment, I love that you can look right into the kitchen all the while following your team on the flat screens. We ate in the main dining room, downstairs and didn't venture around - but it was a great experience. \n\nI had the Strawberry Harvest Wheat brew and it was delightful, not overpowering and quite refreshing. I was interested in the steak sandwich; however, the waiter talked me into the club sandwich. The portion was huge - which is good for taking home, but the club itself was so large that I couldn't actually take a bite. It was cut into quarters, and speared with a long toothpick - but there wasn't a good way to take a bite of it. I ended up with a handful of food that I just had to kind of gently shove into my mouth. I was NOT happy with it. My husbands hot pastrami sandwich was phenomenal! \n\nWe will absolutely be back to try this out again; although I will definitely not be getting the club sandwich. :)"
        }, 
        {
            "index": 217, 
            "rating": 4, 
            "review": "Chicagos isn't quite what it use to be but still a great place! \n\nFirst, they don't have the celery salad any more! It was so good! Second, the servers just aren't what they use to be. Yea, I don't regular this place like I use to but at once a week, at least, you'd think they'd start remembering their regulars, after all they tip better. There are very few servers that are still there and still don't recall us. But the service isn't the worst and most will check on you before HH is over, big bonus. \n\nThe HH is still the best at $6 a pitcher for craft local beer! The food portion is yet to catch up or rather has fell behind, it use to be way better. But alas it is still the best place to sit on the patio and have a beer. \n\nRecently, we were told the patio was closed due to damage to the patio wall. A couple times we checked in on the status of the patio being open, it's the best place to air and the perfect weather!, each time however getting various degrees of confused looks and responses. But yet there were people seen on the patio on a couple nights when I drove by. Seemed there was a major miscommunication on the situation? Weird, Chi-brew lost our business several times during that period. On the last try we called ahead, I didn't make the phone call but Traci T said they talked to her like she asked them if they served beer. 'Duh our patios open.  But I was excited! When we got there the wall was damaged but if I hadn't of know I wouldn't have know, ya know! ;)\n\nVisit Chi-brew, it's a great local place!"
        }, 
        {
            "index": 218, 
            "rating": 5, 
            "review": "I love this place as a bar, I've stopped going to the restaurant half of it years ago.  The last time I ate a couple slices of their small deep dish pizza, I fell into a food coma, and it ruined my Friday night.  I was so stuffed, that I couldn't move. I suppose I should blame myself, but I wouldn't have eaten so much if their pizza wasn't so damn delicious!\n\nWe come here pretty regularly during happy hour.  They have good deals on their house beer, and great deals on their appetizers ($3 garlic knots!)  They have kind of a weird system though, happy hour pricing doesn't apply if you're sitting at the actual bar. You can be IN the bar, but you have to sit at a table.  \nThere's an awesome deal for girls on Saturdays (I believe it's all day). All vodka based drinks are a dollar, and they pour them strong. Again, be careful where you're sitting.  This deal only applies to patrons sitting in the UPSTAIRS bar.  Don't be scared to order something more complex than a vodka-cran.  Things like melon balls, and electric lemonades are included too!"
        }, 
        {
            "index": 219, 
            "rating": 4, 
            "review": "Came for a private party. Who knew they had an upstairs?  Nice lil area with a full bar. They had an appetizer buffet set up for the party. I'm not big on fingers but theirs are so good! Might have to do my husbands party here."
        }, 
        {
            "index": 220, 
            "rating": 4, 
            "review": "Took a trip to my hometown of Las Vegas and made a special trip to CBC. I've always loved this place. The bartenders are hilarious and the beers delicious. Black star stout is really good. Reaaalllyyy good. I had the BBQ chicken pizza and it was nice. Like many others, I cannot stand behind the food here. But the beer and service are worth every penny. Special thanks to bartenders Seth and Adriana for keeping us entertained and our glasses full on this last trip."
        }, 
        {
            "index": 221, 
            "rating": 1, 
            "review": "YUCK, YUCK, and MORE YUCK, or is it YUM, YUM, YUM?\n\nIf you are a smoker, especially an excessive one...you just may like this place.  A little mini-casino, but mainly a bar with food.  Horrible ventilation, so you walk into a complete and utterly thick and smelly fog.\n\nFor the rest of us, the non-smokers -- no way no how."
        }, 
        {
            "index": 222, 
            "rating": 2, 
            "review": "Beer is fine. Food is fine if limited in selection.  Service is what kills it.\n\nThe chicken tenders are meh, cooked just fine but utterly flavourless although the bbq sauce is solid if a bit sweet for my tastes.  The garlic knots are good but the pizza dipping sauce tastes funny.\n\nService was sooooooo slow. Bar was moderately filled and dining room was empty and everything took an eternity.  Getting seated, drink order delivery, food order taking, food delivery, everything.  There were over 12 staff on the floor and only one seemed to do anything and then only half the time.  She was friendly enough just absent.\n\nNo reason to come back especially with better in the same shopping center."
        }, 
        {
            "index": 223, 
            "rating": 5, 
            "review": "We've been here a lot. Food is great and today the potato and bacon soup was ridiculously awesome. I wanted to take a \"before\" photo but ... Oh well. Gone! Yum."
        }, 
        {
            "index": 224, 
            "rating": 4, 
            "review": "What a nice surprise!  Their Cod Fish entree served with cole slaw is wonderful.  This is a great restaurant to visit over and over again."
        }, 
        {
            "index": 225, 
            "rating": 2, 
            "review": "Admittedly, 3pm on a Thursday afternoon may not be the ideal time to assess a brew house, but it's worth logging the experience nevertheless. While the atmosphere at the bar wasn't unfriendly, it wasn't friendly either. Nothing like, \"be with you in moment\" or \"what can I get you\", but rather a somewhat removed bartender going through the perfunctory motions of his job and getting to you when he was good and ready, although without malice or attitude. Beyond that, the place seemed generally cheerless with a scattered assortment of that discomforting and singularly Vegasian type of the damned you run into occasionally off the Strip, not quite consigned to the clear, uncontested merit of hell, but somehow more vague and less defined--purgatorial or limbo-esqu--half plowed, engaged in chain smoking and vapid, pointless, loud conversation, or even worse, simply voiding any meaningful existence, head down, playing countertop video poker machines. The beer was certainly decent and what food came out of the kitchen looked adequate (at best). As a friend noted hours later after we'd left and found ourselves five minutes into a visit to Big Dog's Brewery, \"I already like this place a hundred times better than the Chicago Brewing Company.\" Woof."
        }, 
        {
            "index": 226, 
            "rating": 4, 
            "review": "5/4/16 Service was decent, lots of choices of beers but I was set on trying the house drafts.  I ended up ordering the flight sampler of their 9 beers.  Nothing stood out as well as the Old Town Brown and the Hardway IPA which I'd rate both at a 4/5.\n\n Ordered garlic knots 3.5/5 the bread was fantastic the sauce 1/5 not so much.  Also had the chicken tenders the crispness of the breading was great. I think next time I would do the sauce on the side. Had the Hotiyaki, wasn't quite hot enough for my taste perhaps next I'll go hotter. \n\n Overall an average experience.  I read great things of their pizza so next time I'll pass on the knots and have pizza and tenders. I'll give then a chance for redemption.\n\n\nCame back 11/10/16: service was much better this time thanks to (Ronika) we ended up eating in the dining hall this time around since I had my son with. \n\nOrdered the Italian Beef with onion rings. I really liked that it is served dry and you can add the peppers and au jour as needed.  Great bread that held up and tasted great.  The onion rings were just OK. 4.25/5\n\nMy son had the Build your own burger-  so he opted for bacon and cheddar medium well..with fries.   He loved it.. I did try the fries they as well just OK. 4/5\n\nMoving my initial review of 3 stars to 4 stars."
        }, 
        {
            "index": 227, 
            "rating": 5, 
            "review": "ANOTHER great speed lunch in our lunch break!   Thank you guys AGAIN!  In and out in 40 mins with time to chill!  Fresh, Hot and killer lunch special!"
        }, 
        {
            "index": 228, 
            "rating": 5, 
            "review": "Had some time to kill, so I stopped in here to grab a bite to eat and watch the Cowboys vs Eagles Sunday night football game.  It has been over 5 yrs since I last visited this place and have heard a lot of good things about it, so I figured it was time.  I'm glad I did!\n\nThe waiter brought over the menu and as I turned through each page I got more and more excited......2 pages dedicated to Sliders, what?!!  I love Sliders!  Yes, it's true....two whole pages (see pics).  One page has exotic style sliders....ie Alligator, etc.  The other page has some unique ones.....I decided on getting a 6-pack ($15) which allows you to select 2 styles of Sliders.  I chose the Black and Blue (Black Angus w/Cajun Spices, Blue Cheese Crumbles, Caramelized Onions, & Chipotle Mayo)  and the Chicken Cordon Bleu (Grilled Chicken, Honey Baked Ham, Swiss Cheese & Honey Mustard Sauce).  However, I was extremely curious about the Ghost Sliders, which has Ghost Sauce, made from the world's hottest pepper....the Ghost Pepper.  Plus there's an entire 1/2 page on the menu dedicated to items prepared with Ghost Pepper!\n\nAs most of my friends know, I love spicy food.....but have never tried anything with Ghost Pepper before.  As a reference point, Habanero Peppers are 350,000 on the Scoville Scale, which measures spiceness.  Ghost Pepper registers 1,000,000+ on the Scoville Scale!\n\nI asked the waiter if I could have a side of the Ghost Sauce so I could try it out.  He said sure.....however, he didn't tell me I'd get charged an extra $1 for that....which kind of irks me.  Keep that in mind if you decide to order a side of it.\n\nTo wash it down, I had a Hardway IPA ($3)....that's right $3 for a 20 oz glass!\n\nAfter a few minutes the 6-pack of Sliders came out as well as the Ghost Sauce.  I wanted to try the Ghost Sauce before the food, so I took a toothpick and dipped the tip into the Sauce.....it burned the hell out of my tongue!  That is seriously H-O-T!  It's no joke!  But that's what I enjoy!\n\nSo....I took a Chicken Cordon Bleu Slider and dipped a little Ghost Sauce on it and took a bite.....yum!  It was great!  Perfect proportion of Ham & Chicken.....they complimented each other well.  The Bun was soft and fresh.....again, perfect.  Next I tried the Black and Bleu Slider.....it was just as good.  Although I could have had it without the Red Onion....I'm not a fan of grilled Red Onions...oh well, next time I get them without it.\n\nI'm glad I ordered the IPA because I needed it to put the 5 alarm fire out in my mouth.  I also ordered a glass of Blueberry Vanilla Wheat ($2) after I was done with the IPA....it was also very good and cheap!  Can't get over how cheap the Beer was!\n\nOverall, it was an awesome experience.  Good food, good Beer, and I lost my Ghost Pepper virginity!\n\nOther things worth mentioning.....there's a 7 lb Burger challenge, yes 7 LBS!  If you can eat it in less than 12 min and change, then you get it named after you.  Believe it or not, it's been done before.  No way I could do that!\n\nWill I return?  As the Macho Man Randy Savage would say......Oh Hell Ya!"
        }, 
        {
            "index": 229, 
            "rating": 5, 
            "review": "Great food and super friendly bartenders/servers.   Definitely will go back."
        }, 
        {
            "index": 230, 
            "rating": 4, 
            "review": "This is an awesome place to come and relax and have a couple of house microbrews. Had never eaten here before until last Thursday. The service was pretty good, attentive and fast. The food was pretty good as well. Had the veggie pizza and it was to die for. Typically don't take leftovers home, but did this time because the pizza was so good. \n\nNow I wont just look at this place as a great place to have a good beer on the weekend or after work. I will consider it for a good lunch or dinner spot as well. Kudos!"
        }, 
        {
            "index": 231, 
            "rating": 3, 
            "review": "I really want to like this place, having moved here from Chicago only a few months ago.  My first trip was my first night in town and we enjoyed the happy hour beer and food.\n\nUnfortunately, my second trip tonight was somewhat disappointing.  The host was awesome and had a great attitude and smile, however when we got to our table the service was lacking in many ways. \n\nThe tall guy (wont say his name out of respect) seemed like he was bored and freaked out by the 4 tables he had to wait on.  We returned our pizza twice to ask the to finish cooking it, I ask three times for ketchup for my fries, and he totally forgot our sweet potato fries and when I brought it to his attention he mumbled something and then walked off to the kitchen never to say another word about them.  Here is a clue \" I am sorry I forgot to put your order in\" would have been appropriate.\n\nSo...not sure what to make of this place, but I hope that if I decide to come again, the service and food steps up a notch or two\n\nGives Chicago a bad name....."
        }, 
        {
            "index": 232, 
            "rating": 3, 
            "review": "Specialty beer is definitely worth a try. Everything else is decent beer. Very good resemblance of Chicago style food like their pizza"
        }, 
        {
            "index": 233, 
            "rating": 5, 
            "review": "I live very close to here and I know it's always a great place to go for some awesome bar food. Their chicken finger appetizer is amazing! The chicken finger are very meaty & the flavor is out of this world. My fiance had the Chili Burger, and it was hands down the best burger he has ever had, although he had to eat it with a fork. Haha he didn't mind once he took a bite. I had the all American Sliders & they were very very good. The flavor was better then my father's! & that's saying something. The service was incredible & very fast. But to put icing on the cake, the Bay Breeze I got was the best in town. Perfect ratio. I have to say, I'm in love with this place & you can't beat the prices!"
        }, 
        {
            "index": 234, 
            "rating": 4, 
            "review": "I was in Sin City for an Allman Brothers show in Red Rocks Casino when I found this little gem.  Actually I always look for Brew pubs around any area I travel to and try to taste different beers.  I stopped in for lunch and some beers.  I sat at the bar positioning myself to see the Red Sox game.  There are plenty of big screens in this place and they have all the games.  The restaurant was divided between restaurant and bar, smoking was allowed in the bar but not in the restaurant.  This was a clean and cozy place which had an upstairs lounge,  The bar  had about 8-9 beers of their own beer on tap and I started off with the Ramblin Wreck amber ale.  This was a nice refreshing beer, ice cold and ran about 4.5% alcohol.  I then scoped the menu and quickly honed in the Filet Mignon Sliders, the thought of fillet sliders made me forget about the other things on the menu although I did see  Cheese Knots on the appetizer menu.......hmmm.  So, I ordered the sliders and my next beer reluctantly passing on the garlic-cheese knots(next time....).  Being a \"hop-head\", I ordered the Hard Play IPA.  Though not as strong as I thought, this beer had plenty of hops.\nBeing a Sunday afternoon, there were several locals playing video poker at the bar and some just getting plastered on Jaeger bombs at 1:30 in the afternoon.  After the barkeep carded and shooed away two under aged kids, he brought out my trio of goodness.  There sat in front of me three sliders made from fillet mignon loin, grilled onions and mushrooms served with au jus.  So I started to dig in, man what an experience and guess what I had three of these little morsels to satisfy me.  Too bad I was pressed for time or else I would have tried more of their beers.  This is a good place to hang out and the service was great.  I would definitely stagger back in here, even though it's about 11 miles from the stip.  In fact I might just drag the Buffet Boys to this place next month, when we take over Vegas.  Look for Buffet Boys invade Vegas.........................\nOh yeah, the concert that's another story.............."
        }, 
        {
            "index": 235, 
            "rating": 1, 
            "review": "I was here this weekend got pizza and some home brewed root beer. I have had severe stomach pains and sleepness nights and not to mention everything else that accompanies stomach pains. Its been 6 days now and I am still not recovered. Not sure if it was the root beer or the pizza, but man i am sure sorry i ever ordered that and ate here!\n\nUpdate! Took 8 days to totally heal no more rest room stops every 2hrs and no more stomach pains.  Worst 8 days of my life.  Thank God that's over.  Needless to say i will never come here again."
        }, 
        {
            "index": 236, 
            "rating": 1, 
            "review": "Since there have been several changes at Chicago Brewery, I felt it necessary to update my previous review.  It appears the restaurant may be under new management, as there is now an imposing man who \"helicopters\" the restaurant like a hawk, making diners uncomfortable.  The menu has been completely scrapped for items that we can find at any chain restaurant, meaning that our favorites are no longer available.  It's a shame that after 10 years of eating here, we'd actually walk out... but that's what it came down to last Saturday after witnessing the manager berate our waiter in full view over something that wasn't his fault.  Not worth going into detail, but our disappointment had absolutely nothing to do with any of the wait staff.  I hope the owner's recognize and resolve the issue."
        }, 
        {
            "index": 237, 
            "rating": 4, 
            "review": "I really enjoyed the house beers at this place. Nice environment, real chill.  I recommend it for a chill night with some friends."
        }, 
        {
            "index": 238, 
            "rating": 1, 
            "review": "This place was our happy hour hang out. We visited about once a week or two, but no more. We have two kids, so have to sit in the restaurant. Well, as of this week, they no longer offer happy hour in the restaurant. Only in the VERY smokey bar. I think the beer is \"OK\", but I see more and more people ordering buds, bud lights, etc. I know they do not care, but we will never go there again. Thanks for canceling happy hour!"
        }, 
        {
            "index": 239, 
            "rating": 1, 
            "review": "Worse service , after a long time client because someone disrespected me because I'm gay.., she she a Prost Nig ! \nShe on them , whatever are many places to spend my money , they can keep their girls asking for money there so trashy!"
        }, 
        {
            "index": 240, 
            "rating": 4, 
            "review": "I love this place! First of all, the bartender Jason is AMAZING! He's at the upstairs bar and really knows how to please his customers with the best mixed drinks this side of LA. The reason for only 4 stars has  to do with their selection of highly requested liquors. They really need to get on board with Crown Royal's Apple  and Deep Eddy's Vodka. The food is good too from what I've had but the atmosphere is worth it all. Throw caution to the wind and enjoy the several outdoor areas to enjoy the air or stay inside and enjoy the great ambience!"
        }, 
        {
            "index": 241, 
            "rating": 4, 
            "review": "try the beer...quad damn it...went home with a growler of it last night..."
        }, 
        {
            "index": 242, 
            "rating": 5, 
            "review": "Okay, I went here first on a Groupon so this may be a somewhat biased review. I went here again with a few friends after seeing a movie at Red Rock for full price. All I can say is wow, this is a pretty darn good microbrew. Now the beers are pretty good, but nothing to exceptional. The thing I was impressed with far more was the food. My groupon came with a burger, and all I can say was holy cow, the thing was both ridiculous and awesome. Was huge (about 7 or so inches in diameter, 3/4\" thick patty IIRC) , had barbecue sauce and onion rings on top. Was pretty darn good. \n\nNow I would agree with my friend David S.'s review, between that and their normal bar food if I were a nearby resident I would have a hard time visiting on a frequent basis because the food is all just too much. But for living on the other side of town, you can hardly ask for more!"
        }, 
        {
            "index": 243, 
            "rating": 2, 
            "review": "I think worse than getting mediocre food is getting mediocre food from a place that you've really enjoyed.  Thwarted expectations are disappointing.  I've eaten at the Chicago Brewing Co. outlet in the 4 Queens downtown.  This was my first visit to their full restaurant / brewery.  The beer, as always, was good, but the food was not.  I started with an enchilada soup that was okay.  Then I got a pizza.  There was something wrong with the crust.  First, it was under-done, but more, it was like a biscuit dough, not a bread/pizza dough.  A really strange consistency.  I've always enjoyed their pizzas downtown, this was not that.  Their topping was heavy on cheese, light on meats."
        }, 
        {
            "index": 244, 
            "rating": 3, 
            "review": "This is for the Irish nachos.. Gross!! Mixing cheese sauce with shredded cheese is disgusting!! Just use cheddar people! The beer selection was great and tasted really good. Next time we come back we will do without the nachos"
        }, 
        {
            "index": 245, 
            "rating": 4, 
            "review": "Me and my husband went one night, they had a great atmosphere. We had a choice to eat outside since it was so nice out. I myself tried their blueberry vanilla beer and I personally very much liked it."
        }, 
        {
            "index": 246, 
            "rating": 4, 
            "review": "The second floor is a great place to watch sports!"
        }, 
        {
            "index": 247, 
            "rating": 5, 
            "review": "I was so pleasantly surprised by this place! The brewmaster does excellent work! I tried 6 beers: the stout, hefe, IPA, blueberry wheat, triple, and quadruple. All of them were excellent! I like trying breweries and craft brews everywhere I visit, and I usually find that each brewery has a couple of really good beers and a few not so good. At  Chicago brewing company, I did not try a single mediocre beer! This may be the best brewery I've been to, as the beers are across the board good, especially the triple and quadruple, which I hope they make permanent items. I typically do not like beers with fruit, so I ordered just a sample of the blueberry wheat. It was good, and the blueberry taste was neither fake nor overpowering. The food was decent, which is more of a bonus for me with a brewery. I had the happy hour chicken tenders, which were quite good. I then ordered some sliders, but I was so full from chicken tenders and beers, that I couldn't do much damage there. The sweet potato fries are waffle fries, and decent. The sliders were good too. My only disappointment was with the staff. The service was excellent, but when you go to a beer place, you expect to be surrounded by beer fanatics. Apparently the servers have a mild interest in beer at best. I still highly recommend this place to any beer connoisseur! You will not be disappointed."
        }, 
        {
            "index": 248, 
            "rating": 5, 
            "review": "I have been a frequent guest to Chicago for a few years now and never seem to have even one complaint when popping in. The beer selection is great, food is always on point, and the customer service is always top notch. I found one of my now favorite Hefeweizens here through Mia. She recommended the Bavarian wheat Weizenheimer and I've been hooked ever since. I've returned numerous times specifically because of the experience Mia is responsible for. Always so polite, attentive, and informative.. Definitely a great place to stop in if you're in the area."
        }, 
        {
            "index": 249, 
            "rating": 3, 
            "review": "Great place for happy hour (minus the smoke). Can't beat $2 draft beers, I love the hefeweizen. If it wasn't for the smoke, I'd give it a higher rating. Maybe I'm just spoiled from all other places without smoking these days."
        }, 
        {
            "index": 250, 
            "rating": 5, 
            "review": "I just love this place.  The bartenders are a lot of fun and their summer seasonal beer rocks.  The spicy chicken tenders are a must and the all menu is very affordable."
        }, 
        {
            "index": 251, 
            "rating": 4, 
            "review": "Had a good night out at Chicago Brewing a couple of weeks ago.  Server was quite friendly and fast.\n\nPluses, service and the food, very good.  \n\nSuper pluses!!! Old Town Brown Ale!  Great tasting craft beer and great price $6 for 22 ounces.  \n\nMinus, only one.  You can sometime smell the smoke from the bar in the dining room.  \n\nOther than that, A OK"
        }, 
        {
            "index": 252, 
            "rating": 5, 
            "review": "Lived in Vegas for years and have never been here. Finally getting the chance thanks to Sin City Brew Tours. Enjoying a relaxing evening with friends and love the designated driver! The beers are good and the atmosphere is fun. Stop by with friends."
        }, 
        {
            "index": 253, 
            "rating": 4, 
            "review": "Live down the street from this place and have been wanting to try it for years now, especially being from Chicago. It's a lot smaller than I anticipated I guess I thought it was going to look more like yardhouse on the inside. Menu isn't too big. We started with the brew house fries and the 10in pizza from happy hour. The portions were so big I couldn't order an entree so I just got a side salad which was also large. My husband got the south side cheese steak. We also got the sampler of all nine special beers they had going on. And the large glass on the table you can buy for $10 and pay an extra $5 to have them fill it up! 50oz of IPA and we get to get the glass sounds like a deal to me! Service was very friendly. Will defiantly be back!!"
        }, 
        {
            "index": 254, 
            "rating": 3, 
            "review": "The beer is good enough to provide you with a set of goggles for the evening. The food is subpar and nothing to write home about. The atmosphere is cool. Bottom line, stick to bottoms up and you'll be fine."
        }, 
        {
            "index": 255, 
            "rating": 3, 
            "review": "Loved: The garlic chicken & spinach artichoke dip.\nHated: The chips that came with spinach artichoke dip were soggy and stale.\nThe service was lack luster."
        }, 
        {
            "index": 256, 
            "rating": 5, 
            "review": "Here in town visiting a relative in the hospital. First impression of this place gave it a, comfy, old times feel.\n\nOur hostess and server were both very friendly, the menu had a great selection, I had the Meatball Sliders. It was delicious! It didn't take very long for our food to come out and the waitress was very attentive. I would defiantly come back here!"
        }, 
        {
            "index": 257, 
            "rating": 4, 
            "review": "we moved to vegas a year ago and this our favorite deep dish pizza place.  The deep dish pizza is very good.  The beer is fair.  The serivice is good but it takes forever. We like to order out.  Everyone that visits loves the pizza"
        }, 
        {
            "index": 258, 
            "rating": 4, 
            "review": "I've only come to Chicago Brewing Company twice, and both times were because of their awesome happy hour.  Happy Hour goes from 5:00pm-7:00pm and 10:00pm-12:00am daily.  You can get a pitcher of beer for $6.00; you can get pints and so forth with happy hour prices, but $6.00 pitchers have won my heart.  My two favorite brews at the moment are the All Nighter and the Weisenheimer.  Also notable are their chicken tenders on the happy hour menu, which is $6.00 and includes around 8-10 pieces of chicken.  Sauce options are mild, medium, hot, BBQ and I think maybe one more option; chicken is served with ranch and a celery/coleslaw hybrid kind of salad that I'm not too crazy about.  I'd rather have plain celery sticks.\n\nI would say that if I'm ever in the area during happy hour, I would recommend going to this bar.  But that would be a lie, since this past Friday my friends and I were on Fremont Street and I STILL recommended this place for happy hour.  I'd like to try more food from the place before I give a full 5 stars, so stay tuned for an updated review in the future."
        }, 
        {
            "index": 259, 
            "rating": 4, 
            "review": "First time here. It's separated into a bar and restaurant area. No smoking in the restaurant area.\n\nNot many TVs in either area. Could be the only down side.  \n\nThe beers are great and cheap during happy hour. The salads are made to order and good sized.  \n\nNadine was a great waitress. No conplaints. Will definitely come back."
        }, 
        {
            "index": 260, 
            "rating": 4, 
            "review": "We like coming to Chicago Brewing. \n\nStaff: The staff is always great!very friendly and helpful.\n\nDrinks: Drinks during happy hour are dirt cheap! \n\nFood: Food here is good! I recommend the Pizza or Chicken Fingers. Food used to be cheap during happy hour, but not so much anymore. \n\nVenue/Atmosphere: Nice setup. There's multiple areas to sit, including an outside patio. \n\nWe have never had a bad experience here. \n\nOnly gave this review 4 stars because to food prices, during happy hour, went up. \n\nOverall, great place!"
        }, 
        {
            "index": 261, 
            "rating": 1, 
            "review": "I definitely won't be returning here. My wife and I are new to town and wanted to start checking out the \"local\" scene! We were recommended to this place, and let's just say we won't be returning. The service was painfully slow and they weren't even busy. We ended up deciding to just share an appetizer, so we got chicken wings. I enjoy sauce, my wife does not, so I asked to get the BBQ on the side. They wanted to charge extra to put it on the side, the same sauce they would have put ON it. We both got one drink, the one appetizer, and ended up spending almost $30 on just three items. We will be going else where from now on."
        }, 
        {
            "index": 262, 
            "rating": 5, 
            "review": "I had this place bookmarked after seeing several delicious looking pictures being posted on yelp. Hubby and I decided to come here for dinner and we left full and satisfied. The beer here is brewed on site and has won several awards at the Great American Beer Festival and The World Beer Cup. Did I try any beer? Nope! Another visit I will though ;)\n\nWe sat in a comfy booth in the dining area. Our server was very nice and checked on us often and went over any questions we had. The menu had so many good choices so hubby and I decided to pick out 2 different things to share. We ordered the \"Buffalo Chicken Wrap\" priced at $10 and the \"South Side Cheese Steak\" priced at $10 with a $3 up charge for the substitution of onion rings instead on fries.\n\nBuffalo Chicken Wrap - The chicken tenders are handmade and tossed in hot sauce then put into a tortilla with lettuce, tomato and chipotle ranch. I asked them to leave the lettuce out. The chicken was all white and cooked perfectly. The whole wrap would have been good to me if the hot sauce wasn't on it. It wasn't hot at all and tasted like straight up vinegar. The portion was great and the fries that came with it were delicious. I asked for a side of ranch to dip my fries in and the ranch was cold, thick and delicious. Hubby thought the wrap was OK, but this isn't something I personally would order again unless is was minus the funky vinegar flavor. \n\nSouth Side Cheese Steak - This has beef with peppers, mushrooms, and onions, with their our own signature beer cheese sauce. This sandwich was just delicious! The steak was tender and flavorful, the peppers and onions cooked just right and the beer cheese sauce makes this sandwich a match made cheese steak heaven! The onion rings were beer battered and yummy! I could easily just eat a plate of the onion rings!\n\nHappy Hour is daily from 4 - 7 pm. HH is only available in the beer garden, loft and lounge according to their menu.\n\nWhile there we noticed a promotion for \"Slot August Nights\" where you can stop in and enter to win a 1966 Ford Mustang! You can enter at their other locations Magoos, Loose Caboose, Golden West and of course here at Chicago Brewing Company. Just ask your server for details."
        }, 
        {
            "index": 263, 
            "rating": 3, 
            "review": "Food portions are huge so bring an appetite. The brewed beers a good as well and they run a good happy hour. Not quite true Chicago style but a good place to stop for a quick beer and snack before a movie at the thearter next door or a good place to catch a game."
        }, 
        {
            "index": 264, 
            "rating": 3, 
            "review": "A glance from outside reminded me of a speakeasy from the 1920s area in Chicago.  Not that I'm that old, but it looks like something from Boardwalk Empire.  \nAs I entered, the front waiting area was filled with a pungent aroma of cigar smoke mixed with hookah tobacco.  I immediately noticed the size of brewing vats, bigger than hip -hop, to the right as we were led to our table.  The smell of smoke dissipated as we neared our table until it was only the smell of pizza fresh from the oven.  \n\nThe waiter was pretty awesome, no complaints about the staff at all.   We ordered a 2 pitchers of the sweet nectar known as beer.  The Weizenheimer came in a pitcher that looked like sweet golden honey, but upon tasting it we realized something had gone horribly wrong with the beer.  The beer tasted like Juicy Fruit Bubblegum, bleeehhh!  We set this one aside and poured out attention into the Ramblin' Reck Amber Ale.  Mmmm, the amber ale was a tasty brew!  \n\nI ordered a BBQ burger which was surprisingly dry and the BBQ sauce burned my lips like hot lava from Mt. Vesuvius!   I waited for it to cool down slightly while focusing on my fries which weren't bad and went deliciously with the fine ketchup they had available.  \n\nI would visit this place again, but I would definitely avoid the wheat beer like the plague.  How this beer won awards in 2004 boggles my mind like an enigma wrapped in duct tape so much that you can't even tell what it is anymore.  3 stars for gross beer and dry burgers."
        }, 
        {
            "index": 265, 
            "rating": 5, 
            "review": "Great service! Tabbi was our server and she was very efficient with our order and our drinks. She stopped by our table at least three times to ask us if we needed anything. The food was great too! We came during happy hour so the drinks were cheap. Definitely returning."
        }, 
        {
            "index": 266, 
            "rating": 4, 
            "review": "I was pleasantly surprised with Chicago Brewing.  Not sure why, but for some reason I wasn't expecting much.  We sat in the bar area and ordered a sampler of all the beers, 9 total.  They were all actually pretty good!  I liked that they had all different types, everything from Wheat beers to IPA's.  Some were better than others but they were all good.  We each ordered a glass of our favorite and had a plate of garlic knots, which were also good.  The service was fast and friendly and I noticed they had an upstairs area along with the bar and main restaurant.  The food menu had lots of choices and they also have a full bar in case you don't like beer."
        }, 
        {
            "index": 267, 
            "rating": 5, 
            "review": "I love going to this place. Good microbrewery and great food. Yesterday, I had a chicken sandwich that blew my mind. It was gigantic and so good that it puts Chick-fil-A to shame. I washed it down with a hardway IPA. Can't go wrong here.\n\nI have had a waitress in the past who seemed to always had a chip on her shoulder. Not sure if she still works there or not. She was just unpleasant to have as a waitress but It was over a year or so ago I was last here. However, yesterday we had someone named Tara who was really sweet and nice. \n\nI know all the food is pretty fresh. If it's available the coco for coconuts porter is amazing.  Also I'd highly recommend the ribeye sandwich ( it's huge) , any of the burgers, chicken sandwich, and the New England clam chowder( I think it's a Friday night thing).  Also they make a ghost pepper hot sauce that's not on the menu if you like your wings scorching. \n\nAnyways for the price, you can't go wrong here honestly."
        }, 
        {
            "index": 268, 
            "rating": 4, 
            "review": "Fun place with good drinks and food.  Perfect for a group of friends to hit on the weekend and try some unique items.  We ordered the wild game sliders which included Alligator, Antelope, Bison, Jackelope, Rabbit & Wild Boar!  Now of course some were better than others but just to say you had them is a conversation starter.  Also they have a ghost pepper sauce that is not on the menu but if you like it spicy ask for a side of it.  They also have deep fried desserts if you're brave enough."
        }, 
        {
            "index": 269, 
            "rating": 3, 
            "review": "I read some great reviews several months back and but it on my backburner to try.  Looking in the most recent reviews today I should have checked out the place sooner.  Really, a borderline 3 for this place.\n\nWe got there on a Friday night and it was a bit packed.  Decor is nice, dark, lots of brick.  Liked seeing the huge vats for their in house microbrews, real plus.  But really folks, does it take you 10 minutes to acknowledge that we might need a place to sit?  Naughty, naughty you hostess you!  On a Friday night you know business will pick up so be on the ready!\n\nAfter finally getting seated we were greeted by our server.  Nice guy.  Told him we had never been there before so he showed us the menu and told us about their house microbrews and some of his favorites.  I told him I like dark beers like Guiness but I also don't mind a more medium brew like a Newcastle.  He told me I should have both!  His suggestion: 1/2 of their Old Town Brown and 1/2 of their Black Star Stout!  Also known in many places as a Black and Tan!  At $5 for a 22 oz. glass how could I go wrong?  Turned out to be a great choice, malty beer with chocolate notes, and a light bitter finish.  Fantastic!\n\nI get around to looking into the menu and behold what do I see?  Chicago's master brewer...is a Filipino!  Graduate from UNLV no less!  That's it...go Filipino go!  Nice job Mr. Pascual on making some killer beer!  Makin' our Asian community strong, one person at a time.  Glad he got a page for him on the menu.  \n\nOn to the dinner menu, lots of variety!  Definitely bar food in the works for sure.  Appetizers looked appealing, garlic knots, onion rings, chicken tenders, brew wings, calamari, mussels, and clams.  So much to choose from.  If I had been there in time for happy hour we would have sampled some of these.  Menu has a diverse selection, salads, burgers, sandwiches, wraps, entrees, and pizzas both Chicago deep dish and thin crust.  They even have a section devoted to their popular sliders.\n\nWe thought about getting a specialty Chicago deep dish pizza at first but it was a bit pricy at $14 for a 9\" (man did they look tiny sitting on the warming line) and $24 for a 14\".  You can also build your own deep dish pizza if you like.  Maybe next time!\n\nThe lady and I both ended up getting sandwiches from their menu.  She got the Hot Pastrami Sandwich ($10) with thin pastrami, coleslaw, Swiss cheese, and honey mustard on marble rye bread.  I got the Southside Cheesesteak ($10) with peppers, mushrooms, and onions on a French roll with their signature beer cheese sauce.  The lady had onion rings, and I had fries (asked for them to be well done).\n\nThe verdict?  Food was ah.  It was ok, but nothing to really write home about.  Nothing was really all that special.  Her pastrami sandwich was alright, but it wasn't exactly overflowing with meat, and the coleslaw was a bit bland.  The onion rings didn't seem super fresh, do I detect from a bag and not hand battered?  Oh goodness I hope not.  My cheesesteak was fine (I've had better), their signature beer cheese sauce had a hint of beer but mostly tasted like basic Cheez Whiz to me.  Does no one know how to toast the inside of bread before putting the meat on it?  That crunch makes a world of difference.  My fries on the other hand were very good.  Super crispy on the outside, light and fluffy on the inside.  \n\nAn ok experience overall.  Hostess could have been better, but our server was A-OK.  I must go back just to sample more of their beers!  The food though, might need some improvement.  Plus a star though for their Filipino master brewer!"
        }, 
        {
            "index": 270, 
            "rating": 2, 
            "review": "Oh Chicago, it pains to me to write this bad review. I was a frequent customer, my husband was a huge fan of this restaurant. But they had to change. They removed the happy hour on the dining room and they changed the menu. \n\nTonight me and my family went to eat dinner, I ordered a cream of mushroom soup which was way way way too salty and peppery. Our burgers was OK, but the most disappointing item was the chocolate cake. Oh the cake! Haha it costed us $7 for a small chocolate cake drown in chocolate syrup, not ganache with a pitiful scoop of ice cream. The ice cream was so small. I am getting my cake from cheesecake factory next time!!\n\nThe server didn't even fill our empty water, and the host didn't say anything when we are leaving, sorry chicago, we will never go back"
        }, 
        {
            "index": 271, 
            "rating": 4, 
            "review": "Great service and fabulous food, brews are just as they have always been tasty."
        }, 
        {
            "index": 272, 
            "rating": 4, 
            "review": "My wife and I recently visited this place after driving by it a couple of times while running errands. The huge Chicago sign outside of the attractive building is what drew our attention to it... then, of course, discovering that it was a nearby microbrew, well, how could we resist?\n\nI love microbrews... and I enjoy trying them out from the different regions of the country. When we first sat down, we were greeted by a very knowledgeable waitress who helped us through the beer menu. We started our evening with the nine-beer sampler for $9. This gave us a chance to warm up to all of the local offerings. After working our way through them all, my wife and I both chose our favorites.\n\nNext came the food. We ordered the spinach and artichoke appetizer. Sure, you've had this in other places, like your neighborhood chain restaurants, but this one takes the cake. It was a huge portion and the flavor was nothing short of spectacular. If you like spinach and artichoke, this appetizer must be on your list of things to get here.\n\nWe then looked over the good-sized menu. There was a decent amount of things to choose from, but given the name of the place, we were immediately drawn to the deep dish pizza. I mean, with a name like \"Chicago\" how can we go wrong with deep dish pizza?\n\nWe chose correctly!\n\nThe deep dish pizza was some of the best I have had, and unlike other places that specialize in this style of pizza, it arrived to the table a little faster than I expected, which gave it a little time to cool down, which was good, because it was piping hot when the waitress arrived with it.\n\nThe dough was perfect. The cheese was real and it was perfect. The sauce was homemade - and one of several you could choose from - and the pepperoni was spicy and plentiful. Definitely a good choice if you like deep dish.\n\nWe finished our food, drank our beers and the waitress cleaned out the pint glasses - which had the restaurant's logo on them - and we got to take them home with us.\n\nIf you're in this area of Las Vegas and you have a little time, I strongly recommend visiting this place... it'll fill you up and it won't set you back a whole lot of money either."
        }, 
        {
            "index": 273, 
            "rating": 5, 
            "review": "Great place to chill and relax after a long day. My man Brad always has my scotch poured and cigar box unlocked before I get up the stairs."
        }, 
        {
            "index": 274, 
            "rating": 5, 
            "review": "Such a great experience !! I do feel bad that I was the servers last customer. Johnny was great regardless , didn't rush us or anything . VERY KNOWLEDGABLE with  the drink choices and food . I was being a pain in the butt , and indecisive, but he helped me out . I tried the cheesesteak and my BF tried the burger , both delicious . Also the brews they had were very good . I will definitely come back again to check out their pizzas !"
        }, 
        {
            "index": 275, 
            "rating": 4, 
            "review": "I'm a regular at Chicago's - we usually dine here on Friday or Saturday nights on an almost weekly basis.  We like it because it's only about 10 min from our house and the food is consistent.\n\nWe order mostly the same things (not all at one time of course) .. LOL\nBrew BQ Burger, Sliders (Black and Bleu and Chicken Cordon Bleu), Deep Dish pizza, Steak Fries appetizer, Steamed Clams, French Onion Soup, Clam Chowder.  On occasion - I'll order the Philly cheesesteak and although it's not a replacement for a real cheesesteak - it is a pretty good sandwich.\n\nOne thing that I really like about this place is that the waitstaff doesn't turn over often - so if you are a regular like us, you know that you are going to get decent, cordial, consistent service.\n\nAlthough we aren't big drinkers - you can't beat their beer prices.  I'm a fan of the stout beer and for $4 - it's a really great deal.\n\nChicago's is not a trendy place nor is it a dive - but you'll get a consistent, reasonably priced meal every time you go."
        }, 
        {
            "index": 276, 
            "rating": 4, 
            "review": "It was a slow day, the waitress was good. The beer was actually really good, I'm not a huge IPA fan so I usually get the lightest IPA. The happy hour deals are great prices and the food is good and came out quick. I'd definitely go back to this place."
        }, 
        {
            "index": 277, 
            "rating": 5, 
            "review": "Great place to come for Happy Hour for their great chicken wings. Their pizza is great too. They have a wide variety of things to choose from on their menu, and offer a  variety of beers also, that they make there. Go and enjoy !"
        }, 
        {
            "index": 278, 
            "rating": 4, 
            "review": "Another excellent place to find craft beer in Vegas along with some pretty good food.  With the recent addition of their Hardway IPA, they have gave me a reason to visit more often.\n\nThis location offers a nice variety of seating, dining area, bar, upper level lounge.  Good deal on beers during happy hour, off the beaten path, in Summerlin."
        }, 
        {
            "index": 279, 
            "rating": 2, 
            "review": "In a word disappointing. First the good stuff: beer isn't bad and very inexpensive; the staff is very nice and extremely friendly; cool looking interior and the dining area looks clean and newer.  The rest is bad: food is awful, extremely salty and over cooked equivalent to cheap pub food just with a bigger price tag (I didn't have the pizza though, perhaps that is good); the bathrooms were filthy which always makes me question what the kitchen might look like.  Only recommend if you are hankering for cheap bar food and drinks but you would really prefer to pay more for it."
        }, 
        {
            "index": 280, 
            "rating": 5, 
            "review": "Had a meeting over drinks ... My favorite kind LOL\nWhile at the bar.. My girl decides to play Keno on the machine and hit it 6 times ! i couldnt believe it , she won $1000 ! Female bartender was great !!!"
        }, 
        {
            "index": 281, 
            "rating": 3, 
            "review": "After work one night my co-workers and I decided to stop by here for some draaaaaaaanks n' food. This was my first time here... We ordered some dranks and a BUNCH of food. No complaints, your average bar food and we are drinkin so it's allll good anyway! I never saw the bill, just threw down some money to pitch in but I think they have some good drink specials... \nWe were hangin' out upstairs which I guess closes earlier than the downstairs bar which I found a LITTLE annoying but I guess we could have just moved the party downstairs, however we just called it a night then anyway. I would definitely go back for some more draaaaaanks n' food for a fun low key night!"
        }, 
        {
            "index": 282, 
            "rating": 5, 
            "review": "Last night i ordered the windy city deep dish pizza and it's was delicious! My server bella was very professional and attentive towards myself & my guest....i would highly recommend everyone to go and experience the top notch service and the delicious food here!"
        }, 
        {
            "index": 283, 
            "rating": 4, 
            "review": "Oh Chicago Brewing Company, why did you kill your happy hour? CBC easily had the best happy hour in town but that recently changed when they got rid of their late night happy hour and shifted their regular happy hours to 3:00pm to 6:00pm. Aside from the terrible hour shift the happy hour still does provide some delicious beer on the cheap. Six Dollar pitchers by itself would be a pretty good deal but the quality of the beer brewed at Chicago brewery puts this happy hour over the top. Their Old Town Brown being my favorite, they offer a variety of beer to match just about any taste.\n\nOn the food end of things, I can't say I'm too experienced. I've usually stuck with the run of the mill bar food. The chicken fingers are easily one of my favorite in town. They're very lightly battered, none of this extremely crispy business you get from other places. They're decently sized and the Brew-BQ flavor is delicious, and a major plus is that they are discounted during happy hour along with the drinks. I've also had an above average hamburger there, nothing spectacular but it's definitely satisfying.\n\nOverall a great place to have some good bar food and good beer. My only complaint is that they need to bring back the late night happy hour and shift their current happy hour an hour back so that it ends at 7:00pm instead of 6:00pm. 6:00pm just seems too early for a happy hour but maybe I'm just spoiled because of the hours that the previous happy hour ran."
        }, 
        {
            "index": 284, 
            "rating": 3, 
            "review": "I've been here many times. Primarily because it's the closest bar to where I live.\n\nIf you're a member of the younger crowd 21-35 you'll probably love this place. If you're looking for a quite place to get away and have a drink this is not the place.\n\nFriday and Saturday nights, as well as many evenings, the place is so packed it's hard to find a spot at the bar.\n\nYou'll find a lot of kids yelling and screaming acting as if it's the first time they've ever had a drink.\n\nAs for there food I've tried most everything on the menu and every time it's been a disappointment.\n\nThe staff is usually very friendly and attentive.\n\nSo although I go here on a regular basis I wouldn't give it high marks. But like I said if you're younger and want to hang out with a louder crowd you'll probably enjoy this place."
        }, 
        {
            "index": 285, 
            "rating": 3, 
            "review": "I've been wanting to try this place out for a while now and my first visit was definitely a pleasant one. The man who greeted us at the door was very polite and showed us to our table. It was such a nice day out that we decided to take advantage of the outdoor seating area. It was really nice and had plenty of shade. We couldn't come here and not try a deep dish pizza. We ordered one with pepperoni and sausage and some steak house fries as an appetizer. Everything came out great and tasted as good as it looked. I'll be back again when the mood strikes for good pizza with a good beer."
        }, 
        {
            "index": 286, 
            "rating": 2, 
            "review": "A neighborhood brew-pub, I have driven by several times and finally decided to stop in after reading all the positive reviews.  This review is for the bar menu only, I didn't get a chance to review the beer/alcohol.  \n\nThe service was the stand out this time.  The waitress who initially helped me told me to what a few minutes to order, that way I would get happy hour prices.  I thought that was very nice of her.\n\nThe food unfortunately was a let down.  I ordered the BBQ chicken fingers, greek salad, and, of course, ice tea.  The chicen fingers were, meh, nothing special.  The BBQ didn't add anything to it.  If anything, it took away from the dish since it clashed with the breading on the chicken.  The celery salad was unique and tasty.  I wish they didn't take it away so soon.  The greek salad had a little too much dressing.\n\nI am sure if I had a chance to review the alcohol offerings along with the bar food I would have given this place more stars, especially during happy hour.  But if you are just going for happy hour food, there are better brew-pubs out there."
        }, 
        {
            "index": 287, 
            "rating": 1, 
            "review": "So, our first time to Chicago Brewery. As you walk into the place, you are overwhelmed with the cigar smell from their cigar lounge. We get seated in a booth and asked for what kind of drinks we would like. I ordered  a cup of coffee and my husband ordered an ice tea. When the drinks arrived, there was no sugar and no spoon to stir with. When we asked for sugar, they bring us sweetner. The waitress stated that they don't have sugar, but we have raw sugar. Really. Next we ordered the calamari, pretzel bites, and the molten chocolate a la mode. And of course, the calamari was like chewing on a rubber band. So as you can see, the service sucks, and the food is not that great. My opinion, if try all their beers, maybe you'll forget about the service and the quality of the food."
        }, 
        {
            "index": 288, 
            "rating": 3, 
            "review": "My memories of Chicago are probably like everyone else's...mooning an umpire at a White Sox game. Like most people I have interfered with a potential playoff home run baseball, rode the back of Bill Cartwright, never ate at anything Michael Jordan owned, threw up deep dish pizza in a drunken haze, and snagging some cheap chick from Tinley Park in the bathroom of Exedus II. (We all know they are the easiest chicks in the Metro area...gotta love the naïve suburbs.)  You know, the usual things any one does in Chicago.\n\nAll of those good memories came flooding back to me when I passed the Chicago Brewing Company. A wave of emotions hit me...I almost hit my hearse into a bus full of nuns...almost reliving another Chicago memory I have tried to hard to forget. The smell of burning Habit is really oft putting and not one you forget easily...but I digress...\nI sauntered into the bar a few months ago ready to smash any of those Chicago loving goons for just looking at me wrong, and what I found was a really nice place to eat, a great bar and some good food.\nFirst, the downstairs dining room.  Sometimes your old pal Rex has a hard time getting up and down stairs. That damn keyboard cleaner really throws off your balance when you huff two cans.  So, I decided to eat where it was most convenient.  The one legged hooker with dysentery appreciated it...all that shaking from the hoping up the stairs can produce some horrible results.   She got a chicken sandwich with hot sauce and I got a cobb salad, a corn cob screwed up my partial plate. Remember kids...always brush at least once a week, I wish my 6 foster mothers told me that instead of what a loser I was.  Anyway...the cob salad is gigantic. It is a great salad. Chicken, bacon, avocado, egg, you name it. All fresh, all well seasoned and all very good.  Jasmine, if that was her real name, told me the sandwich was very hot, I wouldn't touch anything she touched but next time I tried it and I thought it was excellent. Big piece of chicken fried and covered with hot sauce.  There could have been more sauce because the bun was a little dry.  I ate several times down there and all the food was good, the waitress service was great and I never had a time where I wanted to start slicing up the booth with my steak knife. A good sign. The food was always good, but nothing they did was ever great other than the salad...wondering about the pizza...keep reading...\n\nThe bar upstairs is where things get fun.  There are a few tv's, some high top tables and chairs and a great little lounge area.  Good times on the weekend if you like the yuppie crowd. Rex doesn't. Perfect for discussing what is easily the best part of this place...the beer. Ah, the beer. They brew their own beer and it is good.  Despite burning my tongue on a tailpipe...don't ask...I could taste all the hoppy goodness.  They have a pale ale and go always up to a nice dark beer. Fruit beers, the blueberry one I tried, was good but not great, other than that they were damn good brews.\n\nRex will end this on a bad note, just like his 4 marriages, 8 colleges, 19 stops in state run facilities and the one time he met Kyle Petty.  The deep dish pizza sucks! Not just by deep dish pizza standards...but by pizza standards.  The crust is buttery, but after that it falls apart. It is not filled enough with toppings and cheese. It is a chinsy deep dish pizza.  Most medium deep dishes are about 8lbs, sometimes more. This is like 4. They need to add more to it and make it a more substantial pie.  I was disgusted. I threw mine over the balcony and screamed down from the bar \"Al Capone should have killed all you sewer rats.\" Strangely they got upset by this. I am not sure I am allowed back.  I am not sure I care.\n\nRex Marvin leads. You follow."
        }, 
        {
            "index": 289, 
            "rating": 4, 
            "review": "Bar area tends to be smoky, but the patio is a great atmosphere and always good times."
        }, 
        {
            "index": 290, 
            "rating": 3, 
            "review": "This place would totally be 5 out of 5 hands-down, but I'm pretty bummed with it recently. We have been regulars since we moved to Vegas last year but in the last few months they have gotten new managers that have not only changed the menu but gotten rid of the happy hour in the dining area. Which is a bummer if you ask me because if you have littles or you simply hate being hot-boxed in cigarette smoke you obviously can't nor do you want to sit in the bar. They've also gotten rid of the sweet potato fries which is an absolute sin in my opinion. Haha I know that sounds a little dramatic but they were amazing!! I'm hoping this review secretly brings them back:)\nOther than that this place is pretty awesome! Service is great! Food is delish- not your typical bar food. I highly recommend the black and blue sliders. They're out of this world. And of course, the house brewed beers are awesome!! And super cheap. \nBring back my sweet potato fries and happy hour and we'll move back in:)"
        }, 
        {
            "index": 291, 
            "rating": 5, 
            "review": "This place is what makes me love living in Las Vegas. Chicago's has a large menu so take your time when choosing. \n\nThe buffalo wings are amazing with a slight vinegar twang and not too hot. The deep dish pizza is completely customizable, I recommend layering your pizza CHEESE FIRST, sauce, pepperoni, extra cheese, and extra sauce. Pot roast, when it is available, is probably the closest to homemade you can get. Lastly, I recommend the in-house brewed root beer: it has a sweet, vanilla, molasses taste. Simply awesomeness.\n\nChicago's is open 24/7 and the menu differs constantly so make sure you familiarize yourself. BUT the wings are available all the time, FTW.\n\nThe service is always friendly, knowledgeable about their brews, and (forgive me for saying) very easy on the eyes.\n\nThe beer review section: I suggest everyone to try the sampler then pick their favorite. The Old Town Ale and Hawaiian Honey are personal favorites. All the beers a distinctly different taste. I do usually prefer a dark ale (Guinness drinker) but Hawaiian Honey is the first light ale I've enjoyed in the at least 7 years.\n\nI will definitely suggest this to EVERYONE that visits Las Vegas. A little trip off of the strip will definitely do you good."
        }, 
        {
            "index": 292, 
            "rating": 3, 
            "review": "After driving by Chicago Brewing Company countless times, I finally decided to stop by for Ken M.'s UYE last week. In short, the company was great, as was the brown ale. I sampled the Oatmeal Raisin Cookie brew... meh... not my thing. I split the wild game sliders with Norm and Tony (6 for $30) and my favorites were the rabbit, wild boar and bison. Honestly, I can't even remember what the others (alligator, antelope, rabbit/antelope mix) tasted like. It was a week ago, afterall.  If you're a fan of sliders, check it out since they're some of the more unique ones you'll find in the area."
        }, 
        {
            "index": 293, 
            "rating": 5, 
            "review": "WOW!!! That was a amazing lunch\n\nI ordered CHICKEN CORDON BLEU (Grilled Chicken Breast, Grilled Honey Baked Ham, Swiss Cheese And Honey Mustard) and it was amazing for $10."
        }, 
        {
            "index": 294, 
            "rating": 5, 
            "review": "I thought I was coming back to update my review.. just to find out I hadnt reviewd this place, what?!\n\nIts a small spot but very comfy sofas and a few TVs to watch sports, excellent beer and even better chicken wings (they are enormous and delicious)\n\nMy own little secret corner @ the 4 queens....ah!"
        }, 
        {
            "index": 295, 
            "rating": 4, 
            "review": "Service: Pretty darn good.\nAtmosphere: I like it.\n\nFood: Overall, I like it. My four-stars is based on my overall opinion of the place. I have been here a bunch of times, but I haven't really checked in or reviewed it, so my notes here may make it look worse than my actual opinion. I will have to make more notes as I eat here again to round out my review, but for now, I am just reviewing tonight's meal.\n\nCheese steak: not so great. Not bad as a roast-beef sandwich, I guess, but not what I am looking for in a cheese steak. The meat is thinly sliced, but chewy. Shouldn't have mushrooms (in my opinion, but I wanted to try their version in the format it was offered). And the beer-cheese was okay, but not really what you want in a cheese-steak sandwich. Pass.\n\nBurger: hubby says good.\n\nOnion rings: at least they get the onions cooked all the way through, but the batter feels heavy with grease. Pass.\n\nMacaroni salad: Not the worst I've had. I little too sweet, and it does have that metallic tang that so many mac salads have, although it is faint. I don't know why that flavor is there, but it's not good. Pass."
        }, 
        {
            "index": 296, 
            "rating": 3, 
            "review": "I can say our server was great.   Very attentive.   And the food merits 3 stars at minimum.  We had the think Chicago style and it was very tasty.  What took away was the cleanliness of bathroom.   Before dinner washed hands and it was just gross.   1 hour later, as we were leaving, went in to see if someone had bothered to clean and the answer is no.   Made me a bit concerned about the overall cleanliness of the establishment."
        }, 
        {
            "index": 297, 
            "rating": 1, 
            "review": "Beer was good ....  that's about it.   \nWe went during happy hour , to try out their own beer brews and have a little food.  My wife and i were looking for new and were HOPING this place would be good.   We were unhappy. \n\nWe got the chips and salsa , it came with some sort of cheese sauce.  Kinda tasted like that stuff you get in a glass jar ( tostitos ? ) from the grocery store. \n\nI ordered a steak sandwich with onion rings.  I think i got 5 onion rings ... not worth the upcharge , the steak sandwich was good however , it was literally a whole steak thrown on a peice of bread .....  Anytime i have ever had a steak sandwhich before .. they usually slice it at least.   \n\nMy wife ordered a ruben ... the waitress brought out my sandwhich and basically told us my wife would have to wait for hers since another waitress took her food on accident . ...  dont they put tickets next to the food for this exact reason ?  It took nearly another 15 minutes. By the time she got her food , mine was almost cold as i didnt want to eat and make my wife sit there while i was eating. \n\nWe did get an apology out of the waitress , but thats it.   I dont think i expect free food or discounts for everything , but there are certain things that you would want to take care of your customers with , and this was it. \n\nIm sorry but first impression like this is hard to break .. will not be back."
        }, 
        {
            "index": 298, 
            "rating": 4, 
            "review": "Good beer, good price, nice atmosphere and also good appetizers. Good place to meet up for drinks, to start the night or to catch a game."
        }, 
        {
            "index": 299, 
            "rating": 3, 
            "review": "We came on the recommendation of Desert Companion's best-of eating issue, so I was expecting the good stuff.  What I got was a pizza and a tall Stout, which both turned out to be mediocre.  \n\nWhat I should have gotten, apparently, was their burger fare.  Between the game sliders (with sweet potato fries, yum!) and the HUGE barbeque burger, I felt like I'd made a mistake with my tiny, thin-crust mini-pizza.  The stout seemed weak-tasting, but I'm the kind of person who likes a dark beer that can hold a spoon in it.  The hef my friend ordered seemed like a far better, tastier option for Vegas' summer. \n\nThe loft area would be great if there were a couple tables instead of being purely for two people to eat / groups to drink in."
        }, 
        {
            "index": 300, 
            "rating": 4, 
            "review": "Interesting menu~ looking forward to exploring it further! \"Black and Bleu Sliders\" are a culinary head trip~  To start with, they are thicker than most, and mine were cooked to perfection! (Tasted like beef~ Seriously!) The carmelized onions were sweet, candy-sweet~ The chipotle-mayo was a sneaky character~ An intensifier~ And the acid from the Bleu crumbles balanced the bite to perfection!  Steak fries were crisp and airy, which was a pleasant surprise for a Vegas Pub~ They do this one right, and if you are a food-dude or dudette~ Do yourself a favor and give this one a try!  \nThe staff was busy and pleasant in the downstairs bar, and the basketball playoff game was drama, even if you're not a huge fan of the sport~\nA nice deviation from most Vegas pub food~"
        }, 
        {
            "index": 301, 
            "rating": 5, 
            "review": "This place a dear friend brought me to for the 1st time. It's a nice bar/restaurant. Good simple foods and good ambiance."
        }, 
        {
            "index": 302, 
            "rating": 4, 
            "review": "Great looking brewery from the outside and inside. Went for their graveyard happy hour and was extremely impressed with both the micro brews and the price points of $2.50 for a 22oz :0. Great service even though they were slammed. Awesome all the way around."
        }, 
        {
            "index": 303, 
            "rating": 3, 
            "review": "Been here 3 or 4 times now and at different times and days. I have always sat in the bar area at a table and I always have to wait or get up and get a server to wait on me. I find this to be very disappointing as I do not understand why when walking in past the hostess stand they can not ask dining in? \nAs for the food I have had the chicken strips, French fries, cobb salad and a few appetizers and I do enjoy the food. I usually get a beer and as much as I enjoy a cold mug of beer I do wish I could get a cold pint glass of beer. \nMy only complaint is the wait for service even with 3 bartenders on the other day I had to still go get a server to wait on my party. Not even one bartender acknowledged myself or my party. Guest service could be better."
        }, 
        {
            "index": 304, 
            "rating": 4, 
            "review": "The mango habanero wings are fuego  Great drinking snack. Not spicy like the name implies. I also had their guava beer and it was great! Not too sweet, and definitely for people that don't like strong beers."
        }, 
        {
            "index": 305, 
            "rating": 5, 
            "review": "Holy Cow!!!!! Have you tried the Pizzas???? If you havent, you're doing yourself a GREAT disservice! The pizzas and food in this establishment are amazing (the 4 Queens location too). The Service here is attentive, but the service at the other location inside the 4 Queens is the opposite. You need a neon sign around your neck saying \"Help me\" over there!"
        }, 
        {
            "index": 306, 
            "rating": 3, 
            "review": "We recently went for dinner with a medium-large party (10) and were seated quickly.  The service was spotty, but the food was good.\n\nI had the Chicago style pizza which I really enjoyed.  We also got the garlic knots, which is a very economical appetizer - 8 knots for $5 (?) - those were pretty good.\n\nMy son had the chicken strips and they were amazing - lightly beer battered.  \n\nI actually ate too much to fit in dessert, but it sounded amazing - one of those cookie-brownie \"pizza' things\" with ice cream."
        }, 
        {
            "index": 307, 
            "rating": 1, 
            "review": "Chicago Brewing Company does not honor their Happy Hour prices on Saturday as per their website.  The Blonde/Golden Ale metal winner is good as yellow toilet water.  The beer is underwhelming and over price."
        }, 
        {
            "index": 308, 
            "rating": 4, 
            "review": "Tasty food, been coming here on and off for years. Machines aren't bad, won some and loss some. Cocktails and beers for all"
        }, 
        {
            "index": 309, 
            "rating": 5, 
            "review": "Last night went to chicago bar and had such a good time, their house beer is really good and bartenders are really nice people, the lady downstairs such a sweetheart and the guy upstairs all kinds of funny! I highly recommend this place"
        }, 
        {
            "index": 310, 
            "rating": 4, 
            "review": "My family really likes this place. The outdoor seating is wonderful, especially with a young child. The happy hour specials are great, and can be utilized outside. I enjoy the food, the beers, and the pizza is a nice replacement for almost the real Chicago deal. The service is top notch.I am looking forward to the cooler weather, to enjoy lazy weekends on the patio, watching sports and enjoying the amazing food and service."
        }, 
        {
            "index": 311, 
            "rating": 4, 
            "review": "This place is cool, down stairs bar and restaurant, bar upstairs with a balcony, and plenty of beers and food to choose from. The staff are friendly and polite."
        }, 
        {
            "index": 312, 
            "rating": 4, 
            "review": "Been here a few times - always enjoyed myself. \n\nWent most recently with my husband and toddler to have lunch. It was a Monday a few months ago, the place was pretty empty as it was a little after what would have probably been the lunch rush time and it was on a weekday.  But that didn't stop the server from making it a wonderful visit. I wish I could remember her name to give her props, but needless to say, we were happily impressed with her service along with the food.\n\nServer was knowledgeable about majority of the items. There was a question I had she wasn't sure about, but she answered honestly that she wasn't, went to the kitchen to find the correct answer and returned promptly. I'd rather have a server treat me with honesty than lie to hide the fact that they didn't know the right answer. Also proved that she had good relation with the BOH team and encouraged our guest perception that the whole establishment was working well together.\n\nThe beer was as it should be - cold, delicious and served in clean glassware (seems simple, right? but we all know that's not the case).\n\nFood was perfectly done and served hot and fresh.\n\nMy toddler was - as always - a little pain, but our server coddled him flirting with her and paid extra attention. As a veterans of the food service industry, my husband and I were impressed at the attention given to us and the overall quality of the entire visit.\n\nHighly recommend to families and to anyone who wants a great dining experience.\n\nThanks, Chicago!"
        }, 
        {
            "index": 313, 
            "rating": 3, 
            "review": "I have to give this 3 stars because of the food & food alone. I've been here more than a handful of times & before, I always sat in the dining room. There, the service is excellent.\n\nBut the last couple of time I went, me & my guy sat in the bar. We went in the middle of the week & usually around 12 or 1 for lunch. I understand that the servers that wait in the bar area also have tables in the dining room area but they need to manage their tables better.\n\nOur server was nice enough, a bit awkward & standoffish. He took our drink order & my guy wanted to sample a couple of their house beers which the server brought quickly enough. Then he went into the dining room & didn't reappear for a while. My guy had decided which beer he wanted to order but our server was nowhere to be found. No biggie, we waited & another server ended up asking us if we needed something. After we placed our order & my guy got his beer, the wait wasn't long for our food to come out. And boy was it amazing!\n\nI've had their baked ziti with chicken (which I adore) & their pizza & both have been excellent but for lunch I love getting sandwiches from bars. So I ordered their hot pastrami sandwich (for the second time) & bf got their \"black & blue sliders\" & instead of regular fries, upgraded to their smokehouse fries. (Note: I may be wrong about the name of the fries. Basically it's steak fries with melted cheese, bacon, chives, creme fresh, & other stuff I think) \n\nThe pastrami sandwich is awesome! It's served on marble rye bread (my favorite rye) that is crispy & crunchy & not at all soggy, the pastrami is perfect, and it comes with melted Swiss cheese & cole slaw (on the sandwich). The combination of the hot pastrami & the cool crispy cole slaw is divine. It's exactly the way a sandwich should be made. My hats are off to the cooks. My side was their regular fries which are pretty lackluster & bland. But I never care about the fries. \n\nBf said the black & blue sliders were good (who can go wrong with steak & bleu cheese?) but that the \"smokehouse fries\" were not very good. I had a bite & they were alright but very sweet. \n\nThe problem was what happened after we got our food. The server asked us if we needed anything else & we said no....and then he didn't come to our table again until we made it obvious we needed him. He came in a couple of times but never came up to us. Once even when we were done with our food and clearly just sitting there. Finally he came in, took an order at the table next to us, went on our other side & asked if that table wanted more beer, and eventually landed at our table. We asked him for a box & the check & when he came back, I just handed him my debit card without even looking at the check. And I NEVER do that. But I was afraid we'd never see him again. He came back fairly quickly & gave me my receipt. While this was going on, another couple had come in & sat at a table & no one had come up to them at all in 5 minutes. No acknowledgement, no menus, nada. They got mad & left. I could see the woman telling the hostess & being pretty upset about it & frankly, I don't blame her. I would have done the same thing. Our server could at least acknowledged her. He saw that they had left & after the woman stopped talking to the hostess & walked out, that's when he walked out to the host stand to inquire about it. Nice. \n\nBottom line: if you want to eat in the bar area, prepare to wait. If it wasn't for their awesome food, I'd never go back again. But sometimes you have to put up with sub-par service if you want a great meal."
        }, 
        {
            "index": 314, 
            "rating": 3, 
            "review": "The beers are extremely well done. Would definitely return and sample more of the lineup. They could put a little more effort into the pizza, kind of a half-hearted attempt at Chicago-style. It wasn't bad and I would eat it again but it's not anything I'd get excited about and I can get excited about deep dish."
        }, 
        {
            "index": 315, 
            "rating": 5, 
            "review": "The service that we received today was absolutely extraordinary! Our waitress, Ronika, was fantastic! This was our first time here and we definitely will be returning here because of her excellent customer service! Thank you for making our first experience incredible."
        }, 
        {
            "index": 316, 
            "rating": 5, 
            "review": "I've visited Chicago Brewing Co. various times for business lunches, nighttime drinks at the bar area, and even for a group fantasy hockey draft event. The service in this place is superb. The food is quite good as well and I believe they offer daily lunch specials. So far I have had both the pozole soup/pizza combo and the fish and chips (each lunch special was $10). The soup was very good, pizza was cooked well, and the fish and chips were spot on but the portion size left a bit to be desired. The craft beers here are extraordinary. You'd be hard pressed to find one you didn't enjoy! From pale ales to IPAs to blonde ales, they typically have the perfect beverage for any pallet. Boasting upstairs and downstairs bar areas to enjoy these custom brews in addition to a cigar smoking area with cigars readily available for purchase, makes Chicago Brewing Company one of the coolest spots to hit for a night out away from the strip."
        }, 
        {
            "index": 317, 
            "rating": 4, 
            "review": "Honestly I am giving this a four star because the other night my family and I had so much fun here. Brad was our bartender, who we actually wanted because he helped us the day before! Brad is such a great guy he kept us laughing and was even being a little flirty while buying me 2 shots. Upstairs is awesome.\nHowever after 2AM they close upstairs so we left Brad and coutinued the fun downstairs with the bartender Bradie. He wasn't no fun at all and even told us \"to keep it down because we were not upstairs\". We all got pretty upset when he made this comment so we just left. He is pretty lame.\nI will definitely be back with my family and friends and hope to always have Brad as our bartender because he is pretty fun to be around!"
        }, 
        {
            "index": 318, 
            "rating": 3, 
            "review": "Great patio seating for afternoon dining- shaded with a barrier to muffle the traffic noise and block exhaust fumes, as well as lights for evening hours.\n\nService was dismal- saw signage advertising their lunch special and ordered it, was not told about it by our server. Other than being super cute and taking our order, then later bringing our check, didn't see much of our server as other staff brought out our food and we were not asked how we liked it until it was nearly gone. Initially intended to ask for ketchup but never saw anyone to ask. Seemed like we may have been a bit forgotten on the back patio.\n\nOrdered the lunch special of a ham and cheese melt with a cup of the soup of the day- cream of mushroom. Sandwich was a good value with tons of ham- a bit salty for my liking but like I said, good value. Soup was very tasty and smooth, with good flavor. Added a side of onion rings, which was about ten rings for $3- perfectly crisp in beer batter, did not fall apart while eating.\n\nMy guy had the 10 piece hot wings with a cup of chili- wings were not hot but had good flavor and were a large size, priced well at $10 for the order coming out to a dollar a wing. Would come back for these wings despite lack of heat, wish they offered more sauces. Chili was also good quality- meaty with a few kidney beans, topped with green onions and cheese. Beer used in cooking was clearly eviden in the flavor of the dish itself.\n\nMy office occasionally has happy hour meetups here, and after experiencing the food I'll have to attend next time. Highly recommend the soups to order, and patio seating for dining and enjoying the weather."
        }, 
        {
            "index": 319, 
            "rating": 5, 
            "review": "Still 5 stars for us! Here on St Patrick's day with our awesome server DAMIEN!! Thanks so much!"
        }, 
        {
            "index": 320, 
            "rating": 5, 
            "review": "This place is the schiznit! Good food. Good brew. Sports on the tube. No complaints......"
        }, 
        {
            "index": 321, 
            "rating": 5, 
            "review": "They have the best onion rings here! I always get their chicken tenders with a side of their ghost sauce! I'm never disappointed coming here."
        }, 
        {
            "index": 322, 
            "rating": 3, 
            "review": "I came here last Friday night while I was in Vegas to hang out with my brother and my best friend...we came at around 11:30 just for a few appetizers and beer. I was surprised it wasn't busier, but it was good - there were only a few other groups in the bar area. My brother and friend liked the beer selection, I didn't really pay attention as I'm not a huge beer drinker. Service was average at best - our server checked on us maybe once after he brought our food and just seemed kind of aloof. My friend ordered wings which were DELICIOUS, but I had the chili fries - they came with tons of cheese as well as this creamy beer cheese, which was all right but it was just way too much cheese. They should do one or the other. The chili on it was good but we couldn't eat very many of them. (They were cheap though - I $9 for a HUGE plate.)\n\nI did like the feel and atmosphere of the bar and I'm going to give it another shot when I'm back in Vegas and in more of a drinking mood. Maybe if I'm drunk next time I'll love the chili fries."
        }, 
        {
            "index": 323, 
            "rating": 5, 
            "review": "Great food and beer.. The staff is great! The upstairs bar is cigar friendly.. Bonus for me..\nCheck out the bars happy hour items.. Chicken tenders are incredible!!"
        }, 
        {
            "index": 324, 
            "rating": 2, 
            "review": "A group of us decided to patron this bar for happy hour after a friend's recommendation for after work drinks. We sat upstairs which is cozy and presents a dark, comfortable atmosphere where the bartender also serves the tables.\n\nAt first, the bartender was quite attentive until a group of friends arrived to visit him.  Suddenly it was as if we did not exist. The service became so poor I am tempted to never go back. \n\nIn my opinion, this organization gets zero stars for service. The two stars that I have presented are strictly because the happy hour food was decent. Not great, but decent for the price."
        }, 
        {
            "index": 325, 
            "rating": 5, 
            "review": "Nice neighborhood dive bar. Brad is a great bartender and the food is delicious. We like to hang out upstairs, though it's usually smoky. Chicago's 24/7 is perfect for after-work drinks! \n\nAs far as food goes, you can't go wrong with: Philly cheesesteak, spinach artichoke dip, buffalo wings, fries, garlic knots, sweet potato fries. I have yet to try more, but I'd be willing to bet money that everything is good."
        }, 
        {
            "index": 326, 
            "rating": 3, 
            "review": "So last night 13 Biking Las Vegas crew members assembled at the CBC for a birthday celebration.  Ample parking in a well lit lot.   There is a bar when you first enter so you get a whiff of cigarette smoke, but it's not too bad.  Just noticeable.  The Hostess was nice.  We were seated and as our group grew, they were very accommodating bringing an additional table and chairs without any indications of hardship.  It was like you were family.  Alex was our Rock Star Waitress.  Funny, outgoing, fun, gracious and kind.  Beers came out cold, Alex was seamlessly attentive.  Never made us feel like she was trying too hard; know what I mean?  Anyway, we never felt like we waited too long for anything and she and her team managed our big group with the smoothness of a well tuned and oiled machine.\n\nWe did not order appetizers and got right down to business.  There were a lot of salads consumed tonight.  Go figure, eating with a group of cyclists.  I had the Ahi Tuna Salad.  It was big and I was full when I finished.   It was comprised of about 6 ounces of seared Ahi on top of a bed of baby greens, daikon sprouts, crushed cashews, colorful yellow and red pear tomatoes.  It was supposed to have a wasabi plum dressing, but what I got was more teriyaki based.  It was okay.  A little salty.  They poured the dressing for me.  Gratefully it was not a heavy pour. \n\nNo one complained, plates were cleaned, and they brought out two desserts for the birthday boy...to share.  Deep Fried cheesecake and a chocolate lava cake.  They were both delicious. \n\nI wasn't blown away, but I'd come back to try some of the other items on the menu.  \n\nIt's clean and Alex was the Bomb."
        }, 
        {
            "index": 327, 
            "rating": 4, 
            "review": "Just like Ty Murray, I found this little \"Jewel\" on the Northwest side of Las Vegas, just East of Red Rock Casino. \n\nAnd started thinking when I walked in, \"You were meant for me...\" (yeah, lousy Jewel reference).\n\nThere's a dining room (remember, in Vegas you can still smoke in the bar areas), a bar and a secret loft cigar bar with a fireplace and an outside beer patio. Honestly, being a non-smoker, the air in the bar was fine.\n\nThis is an eatery that brews beer, and brew master David Pascual has won numerous awards (well, the beers have) . There's a great assortment, I tried the IPA and the creamy Black Star Stout. The IPA is on the lighter side, a tad hoppy, not too bitter and not over whelming. They offer short mugs, 22oz mugs, the 50oz Brewtus, Pitchers, Growlers and the Brewzooka's (oh my).\n\nYou're my boy Blue!\nWell, maybe not.\n\nI ordered the Black & Blue Sliders. A compact set of three each equipped with a black angus patty dusted with cajun spice, loaded with caramelized onions and a microcosm of blue cheese crumbles.\n\nThe caramelized onions were delicious, but extremely over powering. I looked, searched, opened and anticipated a burst of blue cheese, but sadly found just a smidgen, a dot, barely a hint of that penicillin-added mold culture we know as blue cheese.  \n\nJust rename the thing the Caramelized Onion Slider, don't tease us with Cajun Spices or Blue Cheese...or better yet, offer a side of Blue Cheese- and for goodness sake, spell it BLEU Cheese.\n\nFriendly service, the bar is loaded with video poker, so sitting at the rail is tough. The high back tables in the bar area are comfortable and it's not too loud, bright or over powering with smoke."
        }, 
        {
            "index": 328, 
            "rating": 3, 
            "review": "Cool spot. Hipster looking lol. More of a restaurant vibe than brewery. Their selection was decent. Light tasting ipa and the typical stout to pilsner list. Bar tender not as attentive but she was aight. 2 stories seems like it could be popping but it was kinda dead at 8pm sat"
        }, 
        {
            "index": 329, 
            "rating": 1, 
            "review": "I don't know how it is possible to mess up a burger and fries, but they did. The fries were hard as rocks and the burger was still significantly raw, despite being ordered medium-well. Service was so slow - despite how empty the place was - that our meal took over 3 hours to complete. I got super sick after I got home, too, and it was just a bad experience altogether. I will never return, and I beg anyone reading this to not go, either."
        }, 
        {
            "index": 330, 
            "rating": 3, 
            "review": "I have mixed emotions when it comes to giving this place my rating. When I first went there it was perfect and I had nothing negative to say at all. Then the last 2 times I was there the food was cold and their fries were old and stale, and there booze there is, in my opinion, kinda weird tasting."
        }, 
        {
            "index": 331, 
            "rating": 5, 
            "review": "I've been here many times but this time stands out.....\n\nRocco and Steve run a great establishment and the craft beers are second to none (try the \"All Nighter\"), the new menu items are killer (Filet Skewers) and I'd come back just to try them again.\n\nAsk for MJ, Jake, Brady, Erin, Alan, Brian or Jesse behind the bar, there's no better spot for \"industry\" when we all get off of work.\n\nCheers!"
        }, 
        {
            "index": 332, 
            "rating": 4, 
            "review": "Place has been here forever. I never bothered to try it until tonight. Dinning room was closed had to eat in smoke filled bar....... But wow was the food good. Fresh and tasty."
        }, 
        {
            "index": 333, 
            "rating": 5, 
            "review": "We took a friend out to eat here for his birthday dinner because we wanted something that was \"nice\" but also \"kid friendly\" since he wanted to spend some time with our 2-year-old. Clearly, he doesn't have kids or he wouldn't have said this.\n \nIt turns out, our server was awesome, the food and drinks came out fast. But hold the phone.. The cinnamon knots for dessert were out of this world!!! Made fresh and served hot, they melt in your mouth, not in your hands! I think I might even pop in some time just to order that and nothing else. \n\nWhile I am not, if you are a beer person, this is the place for you! The 2 men I was with thoroughly enjoyed \"beer hopping\" brews they would normally not have the opportunity to try elsewhere. And I happily sipped my glass of red wine, while my son happily enjoyed his milk."
        }, 
        {
            "index": 334, 
            "rating": 1, 
            "review": "Decided to try this place because of a recommendation. All I can say is \"mistake\" we went here with some friends and from the second we pulled into the parking lot I was already leary of it. The location looked a bit tired and run down but everyone was pretty hungry so we tried it. The inside of the restaurant was just as depressing it doesn't really feel like a restaurant inside I can't pinpoint what it felt like but the atmosphere was just not nice. The manager or the guy who was dressed like the manager seemed inattentive to the restaurant and was just walking around but not really doing anything.  Our waitress was great but that's about where the great stops for this place.  One of the people in our party got pretty sick the next day. We were all pretty thankful we didn't eat the same thing they had. Needless to say we will never go back to this place and I will never ignore my gut feeling."
        }, 
        {
            "index": 335, 
            "rating": 3, 
            "review": "We stopped in for a quick bite after seeing a movie nearby. Sat in the bar area, which surprisingly was not smoky (unlike many other bars in town). There were a few people playing slots, but it didn't seem like this place is driven by its gaming presence. \n\nIn the past, I have not been that impressed with the beers here. I'm not sure if they've changed their recipes or their brew master, or if my tastes have changed, but my husband and I both enjoyed our selections: the Ramblin' Reck (amber ale) for him, and the IPA for me.\n\nWe weren't that hungry, so we split two orders of sliders: meatballs and buffalo chicken. Both were fine but underseasoned. Each was served with a sizable side of fries, which neither of us finished.\n\nThe rest of the menu seemed like typical bar fare -- burgers, pizza, salads, sandwiches -- but I think I'll stick with the beer next time. See you for patio weather!"
        }, 
        {
            "index": 336, 
            "rating": 2, 
            "review": "Price for 1 cup of milk: $1\n\nPrice for ghost chili pepper wings: $15\n\nPrice of seeing a big guy being brought to his knees, getting into a fetal position on the floor, and crying like a baby after one bite of the ghost chili pepper wings and then writing about it on Yelp even though it didn't really happen so people will vote this review as funny.: Priceless!\n\nFor everything else you have Yelp.\n\n@ Chips + Salsa / Beer Cheese - The salsa was just okay. The beer cheese just really didn't work. It just drowned a good portion of the cheese, minus all the fat that goes along with the cheese. You might as well pour oil into some beer and dip it in that. Thats essentially what you're getting.\n\n@ Calamari - This was one of the saving grace of the night. Very delicious and crispy. The scores would be a lot different if this was the only dish I was rating, but it isn't.\n\n@ Filet Mignon Sliders - Absolutely disastrous. I asked for medium rare, one of the 3 sliders was overcooked. The taste department was so dry, flavorless, and uninspired. The onions and mushrooms did nothing for this dish. I had to add barbecue sauce to a filet to make it not suck! When you have to do that, that just tells you how bad this dish is. The bread looks like it just came from a 20-pack at Costco . Not even warmed up or anything special done to it. Slider Truck is where its at for sliders. \n\n@ Olive Deep Dish Pizza - This just wasn't that good. Deep dish is suppose to be packed full of flavors. This was like eating bread dipped in ketchup and olives, flavorless and boring. \n\n@ BBQ Chicken Pizza - Some redemption. This did carry some good flavors and was good. I've had better BBQ Chicken Pizza before, but this  at least saved this place from getting a 1 star. \n\n@ Ghost Chili Tenders - Ghost chills is the hottest peppers in the world, period. I didn't try it because I'm really sensitive to any kind of spicy food. Our group did try it and it wasn't that bad for many. The worst effect is some numbness that lasted 10 minutes. But with a little milk and time, everyone was okay. Not like the oh em gee I can't open my mouth or eyes.\n\nThe reason for coming to this place was solely for our group to try the ghost chili. The menu is dull and uninspiring, its your typical bar food, and not even that good. \n\nOur waitress was very friendly. She was really attentive and personal. Nothing more you can ask from a waitress. However, food did come out kind of slow taking around 35 minutes for our food to come out. \n\nThis place does take Restauraunt.com certificates, which could make a group meal cheaper. Double check to make sure the Happy Hour Deals aren't cheaper.\n\nI wouldn't come here for the food again. If someone wanted to try the ghost chili, this would be the place to go. A great staff can only make bad food go so far."
        }, 
        {
            "index": 337, 
            "rating": 5, 
            "review": "Their IPA is exquisite, and that's coming from someone who knows a good IPA. It's a combination of Sculpin and West Coast, refreshing, tasty and hoppy. Bar staff friendly and knowledgable. Only disappointment is that we were the only ones in the bar drinking beer!!!!!"
        }, 
        {
            "index": 338, 
            "rating": 4, 
            "review": "Excellent beer. And the deep dish Chicago pizza is great., robust sauce and big. My wife had the Caesar salad wrap and she says it was quite good ."
        }, 
        {
            "index": 339, 
            "rating": 5, 
            "review": "I've been coming here for years now and have developed many friendships over their delicious beer -best draft beer!\n\nOh and I do enjoy their clam chowder :)"
        }, 
        {
            "index": 340, 
            "rating": 4, 
            "review": "Deep dish pizza, garlic knots and draught root beer. So far I have ordered that meal twice and it keeps getting better. The pizza is awesome. It's cheesy, spicy and the crust is buttery and perfect. The garlic knots are out of this world. So much garlic! And the root beer is made in-house and has an awesome vanilla flavor. I don't know about anything else here, but I will be back for more pizza, root beer and knots."
        }, 
        {
            "index": 341, 
            "rating": 5, 
            "review": "If you enjoy drinking a nice beer as much as I do, then you have to come to Chicago. They brewed their own beer so you will always find something different. If you like girly/ sweet beers, then you must to try the strawberry wheat. Although this is a seasoning beer, they always have something fruity in their menu.  However, if you are embarrassed to drink a fruity beer then the hefeweisen is always a good option. The best part about Chicago is not their beer selection, but their PRICES!! If  You go during happy hour,( I believe is from 4pm to 7pm ) you can get a entire pitcher for only $5.00 bucks!! Really... you cannot bet that price. Their food is good, their ambiance is awesome and their staff is amazing.."
        }, 
        {
            "index": 342, 
            "rating": 5, 
            "review": "I will make this short and sweet. I posted pictures of the food. It is as good as it looks. The head cook came to our table and said hello. The place is very clean. You can see into the kitchen. I had pizza and salad. Its got TVs and beer! So you will love this spot if your a sports nut like my husband. It can be a romantic lil spot. Nice lil cuddle spots if you get a booth. Its a must return to for me and the husband. Its a lot of beer snobs at this location so if you want to sit around talking about how great the beer is others will join in and give their 2 cents :)"
        }, 
        {
            "index": 343, 
            "rating": 3, 
            "review": "Hate to say it but the beers here are mediocre.\nI have liked their Fremont St. location due to proximity to downtown activities and casinos, but find this place lacking and their beers tasting like average craft beer from the late 1990's to perhaps early 2000's. The brewery scene in Las Vegas has improved, but Chicago Brewing hasn't.\nNothing very interesting or crisp tasting, with the usual \"pale, amber, brown, stout\", and a weak IPA core lineup. Seasonals were a steam beer, blueberry vanilla ale, and golden ale with lime and none were really any good.\nService was decent, location easy to get to and a little dated on décor but passable. Food was just OK."
        }, 
        {
            "index": 344, 
            "rating": 1, 
            "review": "I've eaten at this restaurant many times because it's near my school. The place is usually quiet even when it's busy, and the food is typical bar food, maybe a step above on certain menu items. \n\nI'm giving this review because during the two years I've eaten here, the service has never been great. There is no shortage of staff walking around, but even when it's dead inside the service is incredibly slow and lacking. Tonight I stood by the entrance waiting for help for three minutes while the staff wandered about taking to each other, and when the hostess finally walked up to greet me, she wasn't pleasant. \n\nI ordered the meatball sliders, which are pretty tasty, and a side of fries. I'm pleased with the taste and presentation of the food and I'm sad to have to give this place a bad review because the hostesses & servers seem busy socializing when they should be working.\n\nAlso, was it so hard to offer or give me ketchup or napkins for my fries on a to-go order?"
        }, 
        {
            "index": 345, 
            "rating": 5, 
            "review": "Everything is good in this restaurant.  I love it so much, but their salads in particular are the best in all the valley.  I think its because they're plentiful and just plain delicious!  Beer and wine offerings are always very impressive.  This place is great for kids or even a casual date.  Or a girls date night.  Enjoy this locals spot in vegas."
        }, 
        {
            "index": 346, 
            "rating": 5, 
            "review": "This was my first time here. I arrived a little before my friend who is a regular here and I found a spot at the bar. I am the type who just wants a beer that the bartender recommends. Thankfully I lucked out and was greeted with a smile by Alan!! He was super friendly without even realizing I was meeting up with one of his regulars . That leads me to believe this is a place to come enjoy a beer with good company!! I decided to try their seasonal blueberry vanilla beer (yes! I know that sounds gross) it honestly was delicious and I enjoyed not just one but two of them! They have a variety of different options and the glasses come chilled!!!!!! Check it out if you're in the area and looking for a yummy beer with fun bartenders and interesting regulars .. I can't speak on the food or any of that just beer and crowd"
        }, 
        {
            "index": 347, 
            "rating": 2, 
            "review": "Pros:\n1. Friendly staff\n2. Clean place\nCons: \n1. Warm beer\n2. No vodka in my cranberry vodka\n3. Very bland garlic knots \n4. Super greasy, making bread soggy\n5. Horrible stomach ache"
        }, 
        {
            "index": 348, 
            "rating": 5, 
            "review": "I was meeting an old friend of mine in Summerlin and wanted a good pizza and some beer. Bartender recommended the Scotch Ale. That was one of the better beers I've ever had! Moved over to the restaurant side and had the meat lover's deep dish pizza. Very good pizza and had two more Scotch Ales with dinner. Was there 2.5 hours and waiter treated us great checking on us when drinks needed refilling. Overall great place and would recommend to everyone!"
        }, 
        {
            "index": 349, 
            "rating": 4, 
            "review": "Head upstairs for a quiet and frendly experience.  Brad does a great job of making new visitors feel welcome.  Cosy seating areas as well as small intimate bar area.\nGREAT chicken strips.  Try things out during happy hour with good in house beers."
        }, 
        {
            "index": 350, 
            "rating": 4, 
            "review": "Probably the best Chicago deep dish pizza in Las Vegas.  Definitely beats B.J's deep dish, maybe Amore's...  not sure I think I have to go back to make sure since it's been a while.  The crust is amazing and for sure the best crust I've ever had in my life!  Also had the garlic knots which were decent."
        }, 
        {
            "index": 351, 
            "rating": 1, 
            "review": "Absolutely terrible food. Got ahi tuna salad, tuna was nearly frozen cold, tasted way too much like fish. Clearly not remotely fresh. French fries were stale as hell and cold. Never ever eating there again"
        }, 
        {
            "index": 352, 
            "rating": 5, 
            "review": "Great place to eat/drink/watch sports. Happy hour from 3-6 is also worth taking advantage of.\nFavorite beer is the chocolate stout"
        }, 
        {
            "index": 353, 
            "rating": 4, 
            "review": "We love this place. We've been going for years because of the great food and awesome beer. Nice environment. If it's busy, it will take longer for service in the table area of the bar, but overall this is an excellent place."
        }, 
        {
            "index": 354, 
            "rating": 5, 
            "review": "The food is incredible, service is really good also. The waitress was very knowledable with the menu and was very polite. The deep dish pizza is definitely worth it, I have no problem going back there again for food. Anytime the food and service is top notch then it's a must to return."
        }, 
        {
            "index": 355, 
            "rating": 4, 
            "review": "Chicago Brewing Company is Legend-ary!\n\nThe fresh brews are all tasty. The Amber being superior. \n\nUpstairs is a nice cigar-friendly lounge complete with second bar, leather chairs, plenty of seating, and patios for fresh air. I've spent a lot of time at this bar and really enjoy the atmosphere."
        }, 
        {
            "index": 356, 
            "rating": 3, 
            "review": "I come often because it's a block away. If i have to walk, i will. Their house beer offerings have never really impressed me, but the food is really good. The king salmon dinner, the caprese salad, all amazing. \nJust recently I tried the blackberry wheat and Hopocalypse which were both incredible to me. The rest of the beer has been just ok. I know i'll be back again,lol\n\nPS: no more late night happy hour :("
        }, 
        {
            "index": 357, 
            "rating": 5, 
            "review": "So the bartender upstairs is amazing, Jason is great always social always on top of his game! Couldn't have anyone here better because he does offer the beer selection on top of the alcohol selection. Very friendly & knows his regulars"
        }, 
        {
            "index": 358, 
            "rating": 4, 
            "review": "The four stars are for the beer. Mr Cormier is a true craftsmen. The wife and I thought the food was unremarkable and somewhat bland. the service was fine."
        }, 
        {
            "index": 359, 
            "rating": 3, 
            "review": "This place offers a smoking and a non smoking side. The menu has a some Chicago favorites but not as many as you would think from the name. The beers are good and what you expect from brewery's today. Nothing I would go out of my way for, but good while you are there."
        }, 
        {
            "index": 360, 
            "rating": 2, 
            "review": "Had the nitro stout and it was exceptional. But now I feel sick from the gd smoke, even though we sat in the no smoking dining area. If you can't stand cig smoke, cross this place off your list."
        }, 
        {
            "index": 361, 
            "rating": 4, 
            "review": "This isnt my favorite restaurant by an means. I didn't have plans to go often in cravings for typical \"bar food\" , however I do like how they offer non smoking area. Tonight gave me another reason to come back more often, Rorke was one f the best servers I have had; constantly cleaned our area and kept our drinks full. So kind and patient highly recommend asking for him! Thanks man!!"
        }, 
        {
            "index": 362, 
            "rating": 4, 
            "review": "Tonight I am having the Buffalo Mozzerella Salad for appetizer and BBQ Chicken Pizza for my main entre.\n\nThe salad was not bad.  I could have used more mozzarella and tomato.  Balsamic vinagarett was a reduction, I think.  Whatever it was, it was very good.  I shared it with my dinner mate.\n\nThe BBQ Pizza is amazing.  I like my BBQ sause sweet and the sause fitsthw bill. Everything is fresh and made to order.  The only hint I ammnot understaning is why thy pit corn on it.  I ordered it without the corn as I could not imagine it with corn.  The deep dish crust is amazing.  It is doughy and chewy and tastes great just like I like it.\n\nIm conclusion, it was a great night with great food and great company.  You should have a good time.\n\nPs, they have beer to."
        }, 
        {
            "index": 363, 
            "rating": 1, 
            "review": "This was possibly one of the worst places I've eaten at based on the service and lackluster food. While you can see the wait staff walking around the restaurant constantly, don't expect them to check in too often. Repeatedly through out our meal, my boyfriend had to flag down people that were servicing other tables because our waitress was nonexistent. I wanted to split my meal with my boyfriend and no extra dish was given to do so. We ordered a pasta dish but, it was so bland we didn't finish it. At the end of the meal, due to our party size, we were charged an 18% gratuity. I can't justify 18% gratuity when I saw our waitress once to take our orders and a second time to disperse our meal. We also waited a tremendous amount of time for our meal (45 minutes). After all that waiting, our food was lukewarm/room temperature when it got to the table."
        }, 
        {
            "index": 364, 
            "rating": 1, 
            "review": "Not so Good, fries burnt other half not cooked.burger wasn't anything to talk about \nTuna salad was Nasty Tuna was spoiled but they made good on it. \nU be better getting McDonald's and little ceazers pizza"
        }, 
        {
            "index": 365, 
            "rating": 4, 
            "review": "To be honest, their house beer is \"eh\", but for the price it's really hard to go anywhere else. Especially during NFL season when you can get pitchers for $6!!! They have already helped provide a catalyst for my alcoholism. \n\nAlso, the bar food is amazing and kitchen is open 24 hours.\n\nIt definitely is a local bar and every time I go in I see the \"usual suspects\" hanging around there, kinda like the Cheers bar :)\n\nStop in and have a drink...or don't, more beer for me."
        }
    ]
}