{
    "category": "Las-Vegas", 
    "entity": "Pop's-Philly-Steaks", 
    "avg_rating_stars": 3.733031674208145, 
    "review_count": 442, 
    "reviews": [
        {
            "index": 1, 
            "rating": 5, 
            "review": "One of my favorite late night spots! Service is always quick & friendly, and the food is always tasty. Try the fried okra! Paired with a #2 (Philly with Cheese Whiz), you can't go wrong."
        }, 
        {
            "index": 2, 
            "rating": 3, 
            "review": "A bunch of us stopped by here for lunch on a work day and I wasn't disappointed.\n\nWe went on their website and printed a coupon and figured we'd try it out.\nNow I've been to all the top Philly joints in Philadelphia and I don't keep my expectations that high here in vegas - BUT I had high hopes for this place and it was just alright. \n\nI thought with the way everything was priced ( a tad high ) that the outcome would be great, but it really didn't wow me. I had fried okra as my side and it was pretty greasy - nothing spectacular.\n\nI wouldn't go out of my way to stop by here again, but it's worth giving a shot."
        }, 
        {
            "index": 3, 
            "rating": 4, 
            "review": "So they have the amaroso rolls shipped here from philly. Authentic? Ive never been to pat's or geno's so im not sure how itz suppose to taste. But this is one of the better ones in town. Definitely get points with having cheez whiz..mmmmm...the price was a lil high (9.50$) but was well worth it...they got a great thing going here"
        }, 
        {
            "index": 4, 
            "rating": 4, 
            "review": "If review was based on taste alone - 5 stars\n\nBut they lose a star for no indoor seating and for the staff being kind of blah. By kind of blah I mean they weren't necessarily bad but they weren't great either. I understand its a small place to not have indoor seating but if you are going to only have outdoor seating you need to have a drive-thru too in my opinion. I went on a pretty chilly day and had to stand outside to wait for my cheesesteak. Worth the wait for sure but they would probably do more business if you could sit or even order indoors. I don't know about you but I don't exactly enjoy standing outside when its 30 degrees in winter or 120 in summer. And when its windy and you are trying to eat outside everything is blowing all over the place. They aren't something you really want to eat in your car either (can be messy). \n\nThe Philly Steaks are by far the closest I have had to Philly out here. I'm from the Northeast and these are pretty close if not right on the money (its been a while since I've been to Philly). \n\nOverall - looking forward to my next visit but I will make sure its a nice day out."
        }, 
        {
            "index": 5, 
            "rating": 3, 
            "review": "I've been hearing for so long how great the cheesesteaks here are so I had to try it myself. I got the cheese whiz fries with a cheesesteak with onions,mushrooms, peppers and cheese whiz. The cheese whiz fries were so yummy the cheese steak eh it was ok. I was hoping to taste the best cheesesteak ever, but unfortunately it didn't happen tonight. The cheesesteak was good sized and it was filled up it just lacked flavor. The meat was bland and the hoagie was salty and stale. I'm not sure if it was fresh being as it took less than 5 mins for the guy to call my name. Anywho I'm saddened it wasn't an amazing cheese steak as I was really craving one, but hey at least I tried this place once."
        }, 
        {
            "index": 6, 
            "rating": 1, 
            "review": "Nothing impressed me and pricey. Had a hoagie that lacked flavor/seasoning/salt, for dessert, had the Oreo churro that was seriously obscenely coated with sugar that was about $4 for ONE piece."
        }, 
        {
            "index": 7, 
            "rating": 4, 
            "review": "We had the fried green beans and fried sweet potatoes- excellent! Also the cheesesteaks were really good. Will definitely come back."
        }, 
        {
            "index": 8, 
            "rating": 5, 
            "review": "Bomb!! When you think, \"cheese steak sandwich\", then you picture one from here. Classic taste that is hard to find for some reason. Big portions. Don't take it for granted because its in your backyard. If this place was not here, you would miss it forever."
        }, 
        {
            "index": 9, 
            "rating": 4, 
            "review": "I have never been to Gino's and Pat's Steak in Philly but a friend of mine originally from Philly recommended this place and said its the closest you'll ever experience to taste the like of Gino and Pat's.\n\nWe ordered the Philly Cheese steak and it was pretty good.  Meat was cooked just right that it wasn't chewy and first time ever trying Cheese Wiz on a Philly.  The cheese wiz was actually one hell of a good idea, tasted really good with the sandwich and different from what I expected if I would have just chosen the common cheeses such as provolone.\n\nThe only difference from what my friend told me that would have made this equal to Pat's or Ginos was the bun used.  The bun in Pops was not that great in my opinion as well.  I have never tasted Ginos nor Pats so I can only go by from what he says.\n\nI do recommend this place however. Still the best Philly u can get in Vegas from what others I have tried so far.  Next time I'm going to try their breakfast sandwich.\n\n.....I have never said Philly this much in my whole entire life."
        }, 
        {
            "index": 10, 
            "rating": 5, 
            "review": "Hands down the best Philly cheese steaks in Las Vegas! Where to start.... The bread is authentic philly cheese steak bread! the chew on the bread is perfect, and with all the meat, cheese and veggies it's able to hold all the yummie ingredients and not get soggy. The meat is tender and seasoned perfect, the green peppers, onions and mushrooms are sauteed to perfection and and so full of that steak flavor. The best way to get a philly is to get the WIZ! they put the perfect balance of meat, cheese and veggies, i really have no bad things to say about the place, i have been here many times and have never been disappointed in my selections, they are consistant in their food and the customer service is great."
        }, 
        {
            "index": 11, 
            "rating": 5, 
            "review": "Closest come too real Philly Steak in Vegas. No question what makes its true east coast style  is the CHEESE WHIZ and really good bread. Now no east coast guy so have no basis just local boy from the islands. I do know is lot of east coast peeps one was visiting from the islands. Always told me the key is cheese whiz if its  not very good then just not real deal philly. It been years since I came here just cause out of the way from my house. Years go by but somethings never change. Yay!!\n\nI had the works with mushrooms. onions, and without question get me some cheese whiz. The meat perfect thinly sliced, cooked perfect, moist, hot, and top it with saute mushrooms/onions. The icing on the cake or this case philly. Cheese whiz. Hot! Cheesy, and enough whiz that it never ending cheese whiz down till your last bite. Not only last bite but know good cheese whiz all over your hands. The bread has nice crust on the outside, moist, and fresh baked bread feel. Put it all together nothing better too soak up long night of drinking at 3am Vegas style. Reasonable price for late night or anytime grubbing. Philly true Philly no room for sides. They have lot of different sides too choose from and not only steak can choose too make Philly. Really is there any other way then steak?? Think not.\n\nThe atmosphere without doubt not only adds so much too Pops with no true seating just open patio area and ideal place too hang out talk stories with friends. It open late at night. It perfect spot after long night drinking, hang out open area one that no need worry about shout over people have conversation with friends, and bonus get best Philly desert every seen!!!!"
        }, 
        {
            "index": 12, 
            "rating": 5, 
            "review": "I thought that this place was going to be a very dull experience, just another sandwich place, but once I took my first bite I was hooked. I had the Philly with cheez whiz, mushrooms and onions. The roll was soft and fresh, the steak was sliced thin and very tender, the sauteed mushrooms and onions buried under all that cheese! It had all the flavors coming together in that first bite to make me raise an eyebrow. I would recommend this to everyone who loves a good Philly cheese steak."
        }, 
        {
            "index": 13, 
            "rating": 4, 
            "review": "Best cheese steaks in all of Vegas! if you're a big fan of philly's and want something as close to a real steak from Philly this is your place. There is no indoor seating but during the nicer times of year it is really nice to sit outside on the patio. I found this place on accident just after moving to Vegas 4 1/2 years ago and i've been hooked ever since. Love love love Pop's!!"
        }, 
        {
            "index": 14, 
            "rating": 4, 
            "review": "One day I decided to give this place another try after years of avoiding the place since it first opened up since my last visit here was unpleasant last I remembered. Looking for another place to hit up after work for some late night grubbin I was feeling for a cheesesteak sandwich. I ordered a Mushroom, pepper, and provalone cheesesteak. It was very delicious and the topping were piled high almost falling out of the hoagie roll. Open 24/7 it works with my work schedule very well. A little pricey compared to some places but it makes up for it in a packed sandwich."
        }, 
        {
            "index": 15, 
            "rating": 5, 
            "review": "Wow wow wow! This place is delicious , I've had several phillys before and I must say this one is by far my favorite in las vegas, can't believe it took me so long to try here! Will definitely start being a regular here. The bread A+ very soft and good and just yummm! I ordered the number 32 couldn't go wrong.  Definitely try it if you ever get the chance worth the try."
        }, 
        {
            "index": 16, 
            "rating": 3, 
            "review": "Sandwiches are good but the jalapeno poppers, i believe are frozen & the fried green beans are as well. Do not get those items off the menu."
        }, 
        {
            "index": 17, 
            "rating": 3, 
            "review": "It was just okay to me...the flavor was missing...they give you big portions but it was not memorable at all...doubt I will return"
        }, 
        {
            "index": 18, 
            "rating": 4, 
            "review": "In my opinion and my family's, this is the best place for cheese steak sandwiches!!! They have all kinds of other awesome things to try too! People are friendly and the outdoor seating seems relatively clean. Give it a try!"
        }, 
        {
            "index": 19, 
            "rating": 5, 
            "review": "If your hungry at 1, 2 or 3 in the morning and don't want to spend over $10 for your meal, well look no further. POPS is open 24 hours and the sandwiches and sides here are just so yummy!!!!\n\nThe sandwiches are made to order, and are great! I usually get the chili fries or deep fried okra as a side to go with my sandwich. \n\nIt's an outdoor walk-up orders type kind of place. Open outdoor seating. It's in a convenient location near Meadows Mall, right on Decatur. Easy to drive pass this place, but I'm sure you won't miss the huge POPS writing on the roof! \n\nParking lot is small, but there always a spot you can get since they are super fast with getting orders made. \n\nDon't worry for those who are not really into philly cheese steak sandwiches, they have salads and chicken and other options as well. So there's always something that everyone can order. \n\nThis is a place that i highly recommend!!! Well worth your $10-15!"
        }, 
        {
            "index": 20, 
            "rating": 4, 
            "review": "Got myself a number 2 with some cheese fries. The food was good. \n\nPro- plenty of meat, good food, lots of selection in menu, customer service was good, place looked clean. \n\nCon- and I believe everyone that has posted a review would agree, price just doesn't add up.  \n\n\nIt is \"expensive\" for this type of location, and food, but ultimately it's good so I couldn't really complain much. \n\nI would definitely recommend you give it a try."
        }, 
        {
            "index": 21, 
            "rating": 4, 
            "review": "The Philly's here are good, one of the better places in Vegas.  I usually get the Cheese Wizz Cheese steak with mushrooms and onions, along with a side of cheese fries.  They have a decent size menu with  cheese steaks, chicken philly's, hogies and more along that type of food.  The only set back is outdoor seating, not to nice mid summer and in the wind.  I suggest take out much better in front of a good sporting event."
        }, 
        {
            "index": 22, 
            "rating": 5, 
            "review": "Always love Pops! \nThe food is prepared right before you when you order it! So there's a wait but so worth it! The food is always good! Reasonably priced, it's noisy because it's outside on the corner or Decatur and Alta, so the traffic can be a bit much. But well worth it! Best chicken & steak sandwiches I've found so far!"
        }, 
        {
            "index": 23, 
            "rating": 5, 
            "review": "Simply the absolute closest to a Pat's or Geno's Philly Cheesesteak you'll get in Las Vegas. Came out fantastic, and the bossman even told me when were good times to come by when it wasn't too busy, which I suspect he is a lot. If you think his prices are too high, they're not. His Cheesesteaks are worth every dime, and he uses fresh steak cuts.\n\nI used to go to Philadelphia a lot, and I always grabbed one or two while there, I will go back again, and again!!!"
        }, 
        {
            "index": 24, 
            "rating": 2, 
            "review": "As a life long Philly resident and recent transplant to Vegas, I'm searching for a great cheesesteak. Pop's gets points for using Philly Amoroso's rolls and offering Cheez Whiz, but misses the mark with the meat.  The texture of the meat is totally off.  Paid about 8 dollars more than the same order in Philly.  Close, but doesn't quite make the mark."
        }, 
        {
            "index": 25, 
            "rating": 5, 
            "review": "This review has been a year coming. I'd never had a Philly in my life, so my boyfriend decided to introduce me with Pop's. I ate a full cheese steak, an entire order of fried mushrooms, and then half an order of their fried banana bites (oh man, how I dream of those golden mouthfuls of deliciousness). Everything was absolutely killer, so much so that despite being stuffed, I was tempted to go back for another sandwich, you know, \"for later.\" I was in love.\n\nOne housebound night several weeks later, I was hit with a cheese steak craving. I ordered in from the highest rated delivery place I could find and was promptly let down.  Don't get me wrong, it was okay, but nothing more. Since then I've tried half a dozen sandwiches from as many restaurants and as it turns out, I don't crave cheese steaks; I crave Pop's. They set the bar high and ruined me for other places.\n\nBeyond the food quality, the atmosphere is great. Open outdoor seating makes a great place to bring a casual date or good friends. It's fun and comfortable, with great service.\n\nThe only negative I can think of is that once a line forms, it doesn't let up. But I can't fault the place for doing good business. If anything, it's a testament to just how good Pop's is."
        }, 
        {
            "index": 26, 
            "rating": 5, 
            "review": "I always order a \"#32\" when I'm in their neighborhood, and I'm NEVER disappointed.\n\nIf they were located in South Philly, I can tell you that GENO'S would be worried!\n\nThe food is awesome, it's served up with a smile by friendly folks, and best of all, the place is open 24/7.\n\nIf you are addicted to Philly Steak Sandwiches (as I am), made by some folks who are actually FROM PHILLY, stop by and check them out.\n\nYou'll become addicted, too."
        }, 
        {
            "index": 27, 
            "rating": 4, 
            "review": "Best Philly Cheesesteaks in the Southwest!\n\nAtmosphere/cleanliness: Small and well-lit.   \n\nService: Good and quick service. \n\nFood: I was craving a Philly Cheesesteak and like a lighted mecca just off the 95 and Decatur, Pop's stands like lone gunfighter in the blistering sun.  Except this cowboy ain't packin' a Colt Six-Shooter, Pop's is packing meaty goodness wrapped in a tasty bread device.\n\nI highly recommend the Philly cheesesteak with Cheez-Whiz!  The grilled onions and cheesy, oozy goodness will put you in an immediate good mood and cure any hangover.  Order it with some zucchini sticks and you have a meal that will leave a lasting impression."
        }, 
        {
            "index": 28, 
            "rating": 4, 
            "review": "I was drunk when we got to this place, but I am telling you - the food tasted amazing at 2am in the morning."
        }, 
        {
            "index": 29, 
            "rating": 4, 
            "review": "Great food! Love sitting outside when the weather is nice, watching the cars go by while eating a yummy cheesesteak. It's quite a distance from where I live, but it's worth it!"
        }, 
        {
            "index": 30, 
            "rating": 4, 
            "review": "We swing by pop's every couple of weekends and it's always delicious.  \nThe sandwich is huge and always stuffed!!\n\nMy favorite is cheesesteak with extra wiz, mushrooms and onions.\nSimple and deilicious.  Their fried okra is also tasty!\n\nI would definitely recommend this place."
        }, 
        {
            "index": 31, 
            "rating": 5, 
            "review": "Finally, I've found a cheesesteak place in Vegas that gets it right. Wiz, Amoroso rolls, steak and onions. Classic.\n\nPop's even has the look and feel of an authentic Philly Cheesesteak place: order at the window, outdoor seating, food served in baskets. \n\nNo question about it, if you're looking for authentic Philly cheesteaks, this is the place. Anyone who doesn't like these sandwiches also wouldn't like Pat's or Geno's or Jim's from Philly."
        }, 
        {
            "index": 32, 
            "rating": 2, 
            "review": "After playing a late night bingo game at Arizona Charlie's across the way, cheesesteak sounded amazing. Yes it was good but for the price we paid about $20 something dollars for two cheesesteaks and some orders of fries. I wouldn't come back. Our cheesesteaks were rather small and are sides of fries were quite tiny as well. The quality might be there but for the price is rather go somewhere where I won't feel robbed."
        }, 
        {
            "index": 33, 
            "rating": 4, 
            "review": "I want to give it more but....\nOutdoor seating is just a killer cold without space heaters and the basic sandwiches are a little bland, they need to have condiments for guest to use."
        }, 
        {
            "index": 34, 
            "rating": 4, 
            "review": "OMG!\n\n24 hour casual drive in place. Outdoor seating only, gets a little windy there.\n\nPhilly cheese is their specialty and WOW are they good at it.\n\nGot the #32 with mushrooms & peppers with some provolone. The only thing you need to remember is to get plenty of napkins.\n\nThis is oozing, dripping goodness!"
        }, 
        {
            "index": 35, 
            "rating": 4, 
            "review": "Love this place! Came here one night and decided to try it because I always see lines of people. \nIt was pretty busy that night and I waited for a good 20-30 mins before they took my order. \n\nWe tried the peppers & mushroom cheesesteak and the cheese whiz cheesesteak. Also two orders of whiz fries. \n\nWe split the cheesesteaks in half so we can try both. I tried half of the peppers & mushroom and half of the cheese whiz. Peppers & mushrooms is really good, I recommend 8/10! Great amount of filling inside and bread was so good. All it needed was a bit of salt imo. The cheese whiz is really cheesy and good, but a bit too salty for me, 6/10. It can get messy because of the cheese. \nCheese whiz fries were bomb dot com!! 10/10\n\nAfter paying, if you like hot sauce, make sure to ask the cashier for hot sauce because that stuff is amazing. I have a feeling it could be a hot sauce from a bottled sauce we know, but cant pinpoint which one. Either way, taste great in the cheesesteak & with the fries! \n:-)"
        }, 
        {
            "index": 36, 
            "rating": 1, 
            "review": "Wow how dare this place have the nerve to call themselves a Philly cheese steak place!!!!! \n\nI WOULD NEVER EVER EVER EVER EVER GO BACK HERE!!!!!!!!!! \n\nYUCK \n\nThere \"Philly steaks\" are tasteless its like eating bread filled with wood horrible. I was so pissed off because by driving by it looks like a place that would have great food and its always busy, So i decided to try this place I felt ripped off it was way over priced for lousy food. \n\nPLEASE PLEASE PLEASE, do not eat here if you like good food especially if your use to traditional Philly steaks!"
        }, 
        {
            "index": 37, 
            "rating": 1, 
            "review": "If you think this is an authentic Philly Cheese Steak, you have clearly never been to the city of brotherly love. The one star is for the bun, it actually was pretty good. All down hill from there.The \"steak\" which seemed to be just as quality as a SteakUm you would get in the frozen section at the grocery store, was greasy and lacked any kind of seasoning! The only flavor was from the onions. Definately not returning, not worth another try...: ("
        }, 
        {
            "index": 38, 
            "rating": 4, 
            "review": "Came here on a recent trip to Las Vegas based on a recommendation. I thought it was a bit pricey especially since the fries are almost $4 for a small portion. \n\nThe cheesteak was pretty good. but I don't have much to compare it to being that I am an LA native, and I have never been to Philly :( \n\nMy bf did have to add a little salt to the steak meat, he said it needed more seasoning *shrugs*\n\nWould I return to Pops when I visit Vegas again? Yes, I would. I want to try the green bean fries."
        }, 
        {
            "index": 39, 
            "rating": 4, 
            "review": "Solid cheese steak. The prices were moderate; about $10 a sandwich. There were a variety of fried food options and many additions you could add to the sandwich (cheese whiz/mushrooms/peppers/etc). \n\nGood sandwich. Fries were pretty dry and plain but whatever, they were okay. Would go back again."
        }, 
        {
            "index": 40, 
            "rating": 2, 
            "review": "Decided to stop here for some late night eats after a night spent downtown. Had just a Philly Sandwich with the cheese wiz and a small soda...$12 seemed kind of steep. The Sandwich was so so, there was a generous portion of steak on the sandwich and the bread was not to bad. It definitely was not a straight out of Philly experience for me...not awful by any means but I don't think I would be pumped up to go back."
        }, 
        {
            "index": 41, 
            "rating": 4, 
            "review": "This is a really neat little spot for the locals here in Las Vegas.  I finally got around to trying it.  Wish I had tried sooner.   \nYou order at the window from the cook.  You can watch him make these wonderful Hoagies.   The wonderful onions, green peppers,  and mushrooms and your choice of cheese.    Their is seats outside to sit in to watch the traffic go by.   It is very colorful hand murals on the walls.  And the food is divine.  The meat is very very tender and the tastes is amazing.   I did not expect it to be so good.  \nNow I go about three times a month for lunch.  This is one of the best kept secrets in Las Vegas."
        }, 
        {
            "index": 42, 
            "rating": 3, 
            "review": "Food was good.  Fairly plentiful.  But the prices are just way too high for what you get.\nThe guy behind the counter was a jerk too.  I had never been there before and was trying to place an order for my disabled friend and myself.  It always takes just a little longer.  But the guy was impatient and rude.\nHad been driving by this place for ages and always wanted to stop.  Been there. Done that. Won't stop again.\nGuy behind the counter needs to chill out."
        }, 
        {
            "index": 43, 
            "rating": 5, 
            "review": "Pops. A Las Vegas classic. Open all the time. They have decent pub quality fried mushrooms. This is like an east coast cheese steak stand. Outdoor seating and no restrooms. Bring a jacket at night, you'll be dining on Decatur"
        }, 
        {
            "index": 44, 
            "rating": 5, 
            "review": "This place is great, very filling and tastes good.  I get the bellpepper Philly with onions and fries. Can't beat it. Btw you gotta get some BBQ for your fries. You keep making delicious sandwiches, and ill keep coming."
        }, 
        {
            "index": 45, 
            "rating": 1, 
            "review": "We've come here twice in the past 2 years we've been in vegas.  I have no idea why people can even rat this stuff considering it's run poorly.  Both times we went and ordered our food they screwed up our sandwiches. Mine was a philly with mushrooms and peppers. NO ONION.  I went up and told them there was a mistake so being that it was 11pm and pretty cold. My boyfriend was eating his food and I had to watch.  Okay well he tells me it was really flavorless.  How do you kill the flavor of the meat?   I had to completely agree when my order was ready 7 minutes later... I went for a bite and expected there to be gooey cheese on it and SOME seasoning. Nope.  It was so bland I couldn't eat the rest of it and decided the second try was the  LAST TRY.  I don't get it, we came at all the way out from our side of town to try it.  We even went as late like everybody's recommended. Still awful service. Not to mention the two guys working were miserable.\n\nI rather spend the money and go to Green Valley's Buffet and have them make me a Philly COOK TO ORDER.  At least there the meat was juicy, flavorful and I could SEE what the hell they're up to in the kitchen."
        }, 
        {
            "index": 46, 
            "rating": 5, 
            "review": "Open 24 hours so that's a plus! I ordered a mushroom cheese w/ onions and an order of fried mushrooms. ($14) The sandwich was really good! It sucked because the guy doesn't even ask if you want lettuce, tomato, or mayo like most places. The staff wasn't friendly either :(\n\nAll outside seating so if you're going in the summer, I would go at night."
        }, 
        {
            "index": 47, 
            "rating": 5, 
            "review": "Every time I come here I'm never disappointed. Great Philly cheesesteaks great bread great prices great sweet potato fries great fried zucchini great everything man this is just a great place"
        }, 
        {
            "index": 48, 
            "rating": 4, 
            "review": "Well this place was a surprise!  Driving around doing store checks all day, we bumped into this place right around lunch time.  I am highly knowledgeable in the cheesesteak genre and highly critical of places that don't get it right.\n\nPride of Philly (POPs) gets it right.  This has to be the best cheesesteak in Las Vegas (I may be wrong but I don't think so).  The bread, key ingredient in the cheesesteak genre, was excellent.  Had a side of greasy, hot and crispy fries. \n\nDon't like cheesesteak, they have pastrami, grinders, and fried string beans.\n\nBest thing about it was Steve, the cook, nice guy and not a racist like that Geno character in South Philadelphia."
        }, 
        {
            "index": 49, 
            "rating": 5, 
            "review": "GREAT FOOD, there Phillys are the best in town, local restaurant, not a chain one. Food is always hot, staff is super nice and its a great atmosphere to bring friends and visitors when in town. We visited here when we were here on a vacation and loved it, not that we are local we go here all the time."
        }, 
        {
            "index": 50, 
            "rating": 4, 
            "review": "My first time to Pops, and the I got the #32. The steak, peppers, onions, mushrooms and provolone cheese steak. Very good! The bread was very moist and soft. Tons of steak and fixings on the Philly, couldn't finish it all. I would have liked a little more seasoning, but will be back."
        }, 
        {
            "index": 51, 
            "rating": 4, 
            "review": "Whiz or Provolone? This is a great place to eat a Cheesesteak or any type of fried food for that matter, speaking of which, try the fried bananas (I don't remember what they're called). Food is definitely worth the drive."
        }, 
        {
            "index": 52, 
            "rating": 4, 
            "review": "We saw this place on pawn stars and thought to check in out. We're glad we did. Got the cheese steak with wiz. It was  one of the best cheese steaks I've had out side of philly."
        }, 
        {
            "index": 53, 
            "rating": 4, 
            "review": "This place is soooo good! If you're looking for a late night place to pick up something meaty - look no further.\n\nI loooove meat and this place packs it on. I can't say that it's the freshest food, but it's definitely greasy and delicious. This is not a place for people on a diet. Choose to come here if you're ready to get your grub on."
        }, 
        {
            "index": 54, 
            "rating": 1, 
            "review": "Is every one crazy this is the worst place to eat in las vegas its in a very low class area very dirty flys everywhere and the food is horrible taste like freezer burn and high priced i found a long disgusting hair in my sandwich the owner/manager dident even care to make me a new one please dont eat here you will get Sick I reported them to The BBB"
        }, 
        {
            "index": 55, 
            "rating": 5, 
            "review": "If it's good enough for Chumlee, it's good enough for me. Amazing cheesesteaks and super cool vibe. \n\nWe ordered a cheesesteak with provolone and onions and the jalapeño poppers. Couldn't gather up the courage to go full blown cheese wiz yet, but there's always next time. The cheesesteak was outstanding. Amazing flavor, packed with layers of meat. Provolone oozing off the sandwich. Give me anything with cheese that oozes and I'll dive in, face first. Jalapeño poppers were good too! Not super spicy, but hits the spot. \n\nThey make every sandwich to order, and take one order at a time at the window, so the wait can get long, but it is so worth it! \n\nLove the vibe of this place. All outdoor covered patio seating. Retro bar seats. And a pretty sick mural of Benjamin Franklin holding a perfect cheesesteak. If you are down with a dive, check this place out."
        }, 
        {
            "index": 56, 
            "rating": 5, 
            "review": "After driving by this place many times, finally decided to stop and give it a taste. Glad we stopped...the menu offers many sandwiches and sides...ordered sandwich  #32 (philly with green bell pepper and mushrooms with provolone cheese) and sides of fried green beans and banana foster...what a treat! Excellent! If you like Philly cheesesteaks, stop at Pops! They're open 24/7!"
        }, 
        {
            "index": 57, 
            "rating": 4, 
            "review": "You know that place where you get an itch to stop by at random times of the day. This is it.\nI am not addicted to it, but it does my body good.\nWell priced compared to some other Philly's in the area. Worth a drive by and pick up!"
        }, 
        {
            "index": 58, 
            "rating": 1, 
            "review": "Pop,\n\nYou probably need to get on the same page with the guy you had behind the grill on Friday afternoon (12/18) because my wife asked him if the meat was grilled to order and he said \"no\". I noticed him pulling our order out of a pot next to the grill, and reheated it on the grill. That my friend, isn't the \"real deal\"\nI stand by all of my reviews. In fact, I take reviews very seriously, and I have the experience needed to leave such reviews on this forum as a former chef and restaurant owner. When I say that your meat was tasteless and boiled I meant it. I think I have had enough cheesesteaks in my life to know what the \"real deal\" is, and yours unfortunately wasn't."
        }, 
        {
            "index": 59, 
            "rating": 5, 
            "review": "The hogie was awesome! Huge & great price! Def going back!"
        }, 
        {
            "index": 60, 
            "rating": 5, 
            "review": "I did not eat here-my fiance did. He loved it! He is a big cheesesteak fan and critic and it passed his test!"
        }, 
        {
            "index": 61, 
            "rating": 4, 
            "review": "My friend took me here in a recent trip to Las Vegas. BEST Philly cheesesteak I ever had. \n\nThe beef was juicy and the bread was toasted perfectly."
        }, 
        {
            "index": 62, 
            "rating": 5, 
            "review": "I'm no expert in Philly cheese steaks, but I do know what I like, and I liked this. The building's exterior has been catching my eye for a while now, so on a recent trip back from the west side, I popped by for a late lunch.\n\nThere wasn't much of a line, but soon enough one formed behind us. The ordering system confused the folks in front of me (despite the big sign that says \"ORDER HERE\" they were at the wrong window and looked upset when I pointed it out to them), but we got our orders in regardless.\n\nThe Cheez Whiz steak was awesome, and I also had half a #32. Both were delicious. Service was pretty prompt, and overall I liked the vibe. It's outdoor seating, nothing too fancy, but really good food."
        }, 
        {
            "index": 63, 
            "rating": 5, 
            "review": "If you have never been here you are missing out. Best cheese steak in town, whiz and provolone for me!! Best of all, it is 24 hours."
        }, 
        {
            "index": 64, 
            "rating": 5, 
            "review": "Pop's is the truth. Good cheese steaks with wiz. Not only that but a variety of other options as well. Don't be fooled by some of the other dumbass reviews. Of picky people. You can't ever please everyone."
        }, 
        {
            "index": 65, 
            "rating": 4, 
            "review": "Pop's Philly Steaks.  A real hole in the wall joint if there ever was one.  But man did it satisfy my craving for a good cheese steak sandwich on that Saturday night.\n\nGot a #2 Cheese Whiz steak sandwich and some onion rings.  Greasy?  Yes.  Pricey?  A bit.  Good?  No doubt.  It was pretty darn good.  The onion rings were good thick onion rings, and a fair price of 3.95 for what they gave you.  I got a free side of ranch with that, no complaints there.\n\nFood came out minutes after ordering, took it home and devoured it.  For 15 bucks overall, I got my money's worth and a full stomach.\n\nLimited parking as it sits on a corner, outdoor undercover seating only on tall diner stools and tables.  Reminds me of the old snack bar days at the baseball fields as a kid.  I'm not from Philadelphia so I can't compare it to other cheesesteaks, but I enjoyed clogging my arteries for one night."
        }, 
        {
            "index": 66, 
            "rating": 4, 
            "review": "I've been in Vegas for over 5 years now, and I've never tried Pop's before.  I've meant to, especially since it's open late (24 hours?) and I'm always up at weird hours.  But I just hadn't had the chance.  Last night, I wanted something quick and easy, so I headed over at 10ish.\n\nI got a #2 and a #4... a whiz steak and a provolone steak.  Both were delicious, with the whiz steak (obviously) being the better of the two.  But it still just can't hold a candle to the cheesesteaks in Philly.  I don't know what it is, but it's just not the same.  That being said, I'd assume Pop's is probably the best cheesesteak in Vegas, so I'll probably be back at some point."
        }, 
        {
            "index": 67, 
            "rating": 3, 
            "review": "Darn it, Wayne!  I wish i had read your review earlier.  I ordered the steak with whiz took a bite out of it and burnt my tongue ;( \n\nLuckily I had a coke on stand by because it saved the rest of the meal :P\n\nIt's an out door eatery here, and the drive-thru order window is no more.  They have ceiling fan around the patio so air circulation is good.  The heat from tailpipe and cars on Decatur wasn't an issue, but the crosswalk bleeping noise was.\n\nThe steak are cooked already and sitting in a pan full of juice and goodness.  Once I order my steak they scoop a large amount and reheat it on the grill.  The steak was in the bread before I even paid.  \nWow!  Came with a fork too.  \n\nSteak was good.. flavor was good, and the bread was really good!!  It was just enough, not too doughy.\n\nCost me about 10 bucks for a drink and steak with whiz. \n\nGoing to have to come back when I'm drunk to give it a real rating lol jk! :X"
        }, 
        {
            "index": 68, 
            "rating": 3, 
            "review": "Everyone has a different opinion about Pop's, after a three week craving for Philly cheesesteaks, I came here after work to give it a try. I can see why the reviews are so mixed. The flavors of the sandwich is delicious, but does it warrant the price? Yes and no. \n\nThe pros: The bread is soft and spongy with a toothy bite to it. The filling is cooked on a well seasoned griddle which picks up more flavor as the day goes on. The Cheese Whiz is plentiful. The fried zucchini were some of the best I have had. They are not freshly made, but the batter holds firm. \n\nThe cons: The meat and fixings was on the skimpy side. Some of the sides are worth the $3.95, but items such as the pretzel costing that much is ridiculous. Especially since they are so cheap to produce. \n\nOne item I am tempted to go back for is their breakfast philly. From 7am-10am, or something close to that, they run a special where it is only $5. That would be worth another visit."
        }, 
        {
            "index": 69, 
            "rating": 2, 
            "review": "I've been meaning to check this place out for a while now and I wish I had better news.\n\nPop's is pretty hard to miss. The giant triangular building has been serving up Philly's 24/7 for years now and has become a local favorite. Pop's exudes that hole in the wall atmosphere and really belongs on Diners Drive-Ins and Dives. Yes the Ben Franklin mural has seen better days but for me this mildly grimey look just adds to the experience. There is no in door seating just the outdoor patio so dress accordingly. They menu is pretty big, tons of philly variations along with plenty of deep friend snacks and TastyKakes (you get a free one on your birthday!)\n\nI am sure the guys here can produce a edible work of art with the cheez wiz but I was a little disappointed in what I got. My bacon philly and a bottle of water came out to twelve bucks; for the price I expected more. The philly was surprisingly dry and lacking flavor. Normally adding bacon to any dish is an improvement but here it just added a rubbery textured ingredient to otherwise soft sandwich. The hoagie looked great at first but became soggy and fell apart as it soaked up the grease. I've heard rumors that the place was sold a few years back had hasn't been the same since. \n\nI might have ordered the wrong thing or just been there on a off day so I am willing to give the place another shot. Perhaps until next time."
        }, 
        {
            "index": 70, 
            "rating": 3, 
            "review": "Meh... Came here cause the awesome reviews... I thought the mozzarella sticks were bomb diggity! The fries were good.. But the philly cheese steak was Meh! Not bad but not great! It's a good sandwich but would I go back not likely."
        }, 
        {
            "index": 71, 
            "rating": 1, 
            "review": "$14.00 for a cheesesteak and a soda. Gimme a break. The cheesesteak was a sloppy mess. Cheese wiz all over the place with oversized vegetables. Really? This is the first place I have been to in my whole life who has the ability to totally mess up a cheesesteak. If you've ever been to Philly and had a real cheesesteak from Geno's you would never ever try anything like this. You can go get a decent meal at olive garden for $14 bucks. And the sad part about it was it wasn't the price it was just a sloppy nasty cheesesteak with nothing going for it not the meat, not the vegetables and not the roll. Don't waste your time."
        }, 
        {
            "index": 72, 
            "rating": 1, 
            "review": "Burnt and greasy......best thing about this place now are the French Fries.  Sad it used to be really good, don't know if they changed owners or cooks or what but this is the second time in a row that the cheesesteak was burnt and super greasy. I took 2 bites and threw it away.\n\nWaste of money!"
        }, 
        {
            "index": 73, 
            "rating": 1, 
            "review": "I'm from West Philly, and currently live in Las Vegas. I tried Pop's cheese steaks. Let me tell you that it's not worth the trouble. I'd rather drive 7 hours back to Franks in San Marcos, CA for real cheese steaks. Pop's steaks were salty tasting with stale Amoroso's bread. And the service sucked. I exspecting rudeness when you ar in Philly, because that's how we can be. But I do not exspect it from a culture who is not from or even been to the East Coast. Do not go to Pop's cheese steak Resturant. It's a waste of time and money."
        }, 
        {
            "index": 74, 
            "rating": 5, 
            "review": "24 hour availability.. these guys always get me after a night out of drinking... 4th meal for the win. This place is absolutely amazing, all of the food is cooked to order and tastes 100 percent like it does in Philly. Love this place.  Btw... The ONION RINGS are to die for."
        }, 
        {
            "index": 75, 
            "rating": 3, 
            "review": "The Good:  A mom and pop's hole in the wall, called Pop's Philly Steaks.  They are open 24hrs, I don't know if I would hit this place up too late as it is in a bit of a sketchy area.  Good solid cheesesteaks.  Not quite as good as the ones I had in Philly.\n\nThe Bad:  Tiny lot and only a few outdoor tables.\n\nThe Ben:  If you are craving some cheesesteak wit whiz then it might be the fix you need."
        }, 
        {
            "index": 76, 
            "rating": 5, 
            "review": "Had pops yesterday for dinner it had been awhile since I had been there my husband an kids had never been. We ordered a number 32,6,3 along with chili cheese fries everything was delicious the bread was fresh nice size portions of meat on every sandwich the fries had the perfect about of chili an chesse sauce!!! Made fresh right as your ordering an doesn't take long to come out excellent service!"
        }, 
        {
            "index": 77, 
            "rating": 4, 
            "review": "This place is pretty good. I'm from San Diego and a local told me about this place so I decided to stop by and check it out and get away from the typical buffets. \n\nFor starters, the food is cooked in front of you and visible through the window. When you receive your food, it's warm and ready to be devoured. Another great aspect of this place is the amount of meat that you get for the price. The Philly steak's is between $6-10 and I believe is properly priced. Another positive aspect is that this place is 24hrs. After a long night at Vegas and there is a need for cheap grub, this is a good place to check out.\n\nNow for the things I didn't like about this place. For one thing, I enjoy my Philly steaks with a little kick of hot sauce. There is a small charge for hot sauce. Yeah I know $.50 is not expensive, but come on now, a charge for hot sauce. Secondly, side orders are extra. Who gets Philly steaks without fries or something? These negative is very minor, bit it did disturb me a little bit.\n\nOverall, I would rate this place a 3 1/2 star but because I don't have that option it gets 4 stars. This place is one little spot that needs to checked out of your tired of going to the typical Vegas buffet's and restaurants."
        }, 
        {
            "index": 78, 
            "rating": 5, 
            "review": "i love cheesesteak...and this is probably gonna be one of the more authentic places in vegas.   I've been to a few in cali...but even their attitude is east coast here (not that i've ever been to philly haha).\n\nI heard people ordering in philly on the food network....\"with or without\"  wasn't sure what it meant but i didnt wanna be foolish so i just said \"with\"  guess it means onions LOL.\n\nI ordered the whiz cheesesteak and some wings.  they use the amarosa rolls from philly...shipped here from philly...and that is part of what makes the cheesesteaks good.  the wings flavor was pretty good...the wings themselves could be a bit crispier...but hey its not a wings joint...so good effort on the wings.\n\nI hate the straws they use for their soda...thats my one beef.\n\ni just noticed the coupon for 2nd steak at ,99 doh!  need to check with yelp more often!\n\nseating is outdoor only...but has a neat back to the past feel....i wanna try their chili cheese pastrami next hahaha yummmmmm"
        }, 
        {
            "index": 79, 
            "rating": 2, 
            "review": "Definitely not a Tony Luke's but maybe a poor man's Pat's or Geno's (both of those are more so just landmarks now, the cheese steaks have gone down hill). At least they use cheese wiz... if they gave me a nasty attitude I'd feel right at home. More like a 2.5"
        }, 
        {
            "index": 80, 
            "rating": 5, 
            "review": "We are from Philly and man o man, Pop's is the best we can find here in Vegas!  Too bad for the one location, though - if we could eat them every night we would!  Don't forget the Italian water ice!"
        }, 
        {
            "index": 81, 
            "rating": 5, 
            "review": "they might as well call them Pops CheeseSteaks or Vegas CheeseSteaks because they do it right! I have been to Philly but you have been replaced!"
        }, 
        {
            "index": 82, 
            "rating": 1, 
            "review": "Being born and raised in South Philly,one block away from Pats and Genos and have sampled cheesesteaks from Jims on South Street,Tony Lukes, White House in AC and many Jersey mom and pop pizzerias both in north and south,and many roadside diners versions of our philly tradition, one thing has never happened.\nNEVER EVER have i thrown it out halfway through because it was so damn bad. I swear i couldnt choke that stringy clumpy meat and stale bread down. I ordered an Italian hoagie to go also, just took a look at it and I saw sliced pickle on it.Im keeping my expectations low. The words pickle and hoagie dont belong in the same paragraph.\nAn absolute waste of 25 bucks. Go to Cuginos on S Maryland pkwy by UNLV.Way WAY better and as good as anything back east."
        }, 
        {
            "index": 83, 
            "rating": 5, 
            "review": "Whenever I'm craving a really good philly cheesesteak sandwich, I come to this little place on the corner of Decatur and Alta. I love that it's open 24 hours, as my friends and I will often make a midnight run for grub after some bar hopping. The sandwiches are are made hot, fresh and large enough that I can usually only eat half before I'm stuffed. (The rest is just as good reheated in the microwave the next day too.) The sides are delicious too, especially the sweet potato fries."
        }, 
        {
            "index": 84, 
            "rating": 4, 
            "review": "I have eaten at all the legendary Philly cheese steak shop in Philadelphia... pats. Genoa. Jimmy on south street ...Tony lukes.... so I know a thing or two about a good cheesesteak. First of all you have to have good bread and pops gets there bread flown in from Philadelphia Amoroso bakery in Philly is the best bread around that area.. pops uses the best bread in town. The meat on a scale of 1 to 10 is a 6.\n.they don't use fresh rib eye meat. They give a generous portion. They could put more cheese on there steak sandwiches... All in all its a decent philly chesesteak.  The grill isn't to clean and I often worry about how long the meat is kept warm in that pan...they cook the meat in advance and it lays in a pan of hot water for who knows how long. The employees are friendly. One time they forgot to give me my receit and according to there sign that posted right by the window where u pay 4 your food if they don't give u your receit you get your food for free... What I told the person at the cast hurts if they forgot to give me my receipt at first he tried to give me the receipt but i said said no its too late so he had to give me a free sandwich he wasn't too happy....."
        }, 
        {
            "index": 85, 
            "rating": 4, 
            "review": "A review is overdue for sure I as I have been stopping by here a lot more often over the last few months. My sweet friend Sergio I noticed often has a very large appetite on the nights we hang out. Pop's is close to his house so it makes a stop very convenient late at night since they are always open.\n\nThe staff is friendly and they make good solid food so this review will be sweet and simple. I have had a variety of their cheesesteaks in the past and they have always been good with quality ingredients. I must say that I really enjoy their sweet potato fries that come with a yummy coconut dipping sauce. Their regular French fries are great as well and are fresh cut.\n\nService is great, food is great and they are open 24/7. My only tip to you is that this is not a place to come to if you are low on cash, you better save those coins for the dollar menu somewhere else if you are on a budget! lol\n\nTake out is your best option as it is a free standing store with a few patio chairs and tables to sit at outside. It is on a busy street so it may not be as comfortable relaxing to eat with cars whizzing by plus the crazy wind.\n\nCheck Pop's Philly Steaks out!"
        }, 
        {
            "index": 86, 
            "rating": 5, 
            "review": "So good. I had a 4 star review but the reason I docked a star was a little dramatic so let's fix that! It's so good if you're into good food! If you like horrible food, this isn't the place for you. Their fried mushrooms are really good, their cheese steaks are perfect! You get to choose from cheese whiz, american, or provolone. They have things like peppers, onions, mushrooms, chili, bacon, and more! It's 24 hours so that comes in handy. I don't like the location at all but it's worth it. You order through a little screen and get checked out a few steps away. The prices are a little higher than I would prefer, but you get what you pay for."
        }, 
        {
            "index": 87, 
            "rating": 5, 
            "review": "How could I have missed this place?\n\nFor $9-$10, you can get one utterly amazing cheesesteak.\n\nI've tried chill cheese, barbecue, pizza, even fish cheesesteaks.  And somehow each one is just as amazing (though the chili cheese one is my personal favorite).  Their menu is to the point, but they have a lot of options within the cheesesteak and fry families.  Even their chips are good.\n\nI see that they have Italian Ices as well, but I'm not even bothering with that until the weather warms up.\n\nI've driven by this place so many times.  For YEARS now.  How could I not have explored this amazing place before?  I LOVE cheesesteaks!  It boggles my mind, is what it does!  \n\nBut I'll put it this way: Now that I have found this place, I will make up for lost time.  I've already hit this place up several times in the last month.  Heck, I even hit it up on Christmas Day night after being over the whole turkey and ham thing.  24/7, they never close.  I could get a cheesesteak at 3:17 A.M. if I wanted to, and there's no force of man that could stop me.  Truly a marvel of modern invention, this place.\n\n.....\n\nAnd if you haven't gathered, I've quickly grown to love Pop's in the last month.  Wow.\n\nCheesesteak."
        }, 
        {
            "index": 88, 
            "rating": 2, 
            "review": "Standing in line as I write this.  It's 2:43 am and no one is really here.  The cook sucks because he takes an order, cooks it and waits til the order is done to take the next.  Been in line for 30 minutes at least.  The food the first time was okay, philly cheese with Swiss.  A little too greasy for me.  Getting the jalapeño poppers just because I have a craving and the pastrami and Swiss this time.  Don't expect it to meet my expectations but both Taco Bell and McDonald's were closed by 2:00am.  Not as good as advertised, plus this part of town is super trashy and ghetto!"
        }, 
        {
            "index": 89, 
            "rating": 4, 
            "review": "Pop's is the best Philly cheesesteak in Las Vegas and would give Geno's and Pat's a run for their money. The #2 with onions is my standard as that is the traditional Philly. Meat, whiz, onions. No peppers, no mushrooms. Anyone that tells you otherwise is incorrect. Pop's is the bizness!"
        }, 
        {
            "index": 90, 
            "rating": 5, 
            "review": "I'm originally from Philadelphia and it is hard to find a good Cheesesteak just about anywhere but pops has it. the rolls are from Amoroso which is key to a good Philly cheesesteak, the meat was grilled to perfection and the peppers I had on it were firm and not soggy. they also carry Frank's black cherry wishniak soda which is unlike anything like it that you may have had before. I would recommend this place to anyone looking for an authentic Philly cheese steak. the price was a little high but I will chalk that up to being as far away from Philadelphia is you possibly can without being on the West Coast and getting your ingredients from Philadelphia costs more. I will definitely be coming back here as I drive for Lyft and have to eat out quite often. I will also be telling my riders that this is an excellent place to eat"
        }, 
        {
            "index": 91, 
            "rating": 4, 
            "review": "Definitely worth the drive. A plus that it's always open which is a standard money maker in Vegas. \n\nI had the Philly cheesesteak. The meat was properly seasoned, not too salty not too bland. The bread was soft and fresh. The mayonnaise was just enough to really kick up the flavor and of course, the cheese was completely melted and mixed with the onions to perfection.\n\nBetween here and capriottis... I couldn't say who did it best."
        }, 
        {
            "index": 92, 
            "rating": 3, 
            "review": "I wanted like this place more than I did.  I got a cheese steak wit.  I got it with onions and peppers and had them throw in some peppercinis.  The meat lacked flavor and the so did the onions and peppers.  The only thing I could really taste was the cheez-wiz.  The sandwich is a good size and is filling.  The bread is good, pretty authentic."
        }, 
        {
            "index": 93, 
            "rating": 5, 
            "review": "Awesome philly steaks!!  Loved the fried green beans and their okra!!  Service was fast and the workers were cool!!  Will definitely recommend to friends who hasn't tried it!!  My sister and her family have come here plenty of times!!  She recommended the Cheez Wiz philly so I will definitely be trying that out next time!!  Keep up the good work!!"
        }, 
        {
            "index": 94, 
            "rating": 2, 
            "review": "Always wanted to stop here, finally did after 6 years, could have waited 6 more.  I was disappointed. Not as good as I was hoping for.  I think it was close to $12 for a pretty small Cheese Steak.  I will bedriving by next time."
        }, 
        {
            "index": 95, 
            "rating": 5, 
            "review": "Love this place! Pops has the best Phillies in Las Vegas! We have been coming here since we moved to the area and I pick food up when I'm on that side of town.\n\nI recommend the philly cheese steak. You can have it with provolone or Cheesewhiz. Take sandwich is quite large so you can save half of it, especially if you order side items. They have different fried side items like onion rings, fries, fried mushrooms, fried green beans and okra.\n\nIt's not too far from old town Vegas off of Decatur. Highly recommend this place to you carnivores!"
        }, 
        {
            "index": 96, 
            "rating": 4, 
            "review": "Having been to Sonny's in Philadelphia which was a mind blowing perfect 10, I must say, I was surprised Pops was as good as it was. The chili cheese fries were some of the best I've ever had. Just wondering how consistent this place is. Can't wait to return to find out."
        }, 
        {
            "index": 97, 
            "rating": 4, 
            "review": "After driving by for years we stopped by late one Friday night. I tried the number 32 I think, steak/cheese/peppers an onions. The last time I had a Cheesesteak like this was at Pats in Philadelphia. This was damn near exact what I remember. Very good. Wifey had the Pastrami. She reports that it was meh. Kinda plain. But it is a Cheesesteak joint. \nThe place it's self is all kinda nasty. It's perfect. \nWill definitely return."
        }, 
        {
            "index": 98, 
            "rating": 5, 
            "review": "Hands down, the best cheesesteaks in town PERIOID. You receive authentic cheesesteaks here the cook doesn't measure the meat down to a fraction of an ounce. This place is pricy but it's expected since all the ingredients arrive from back east daily  There is no indoor seating and the parking lot is small but you can usually get a space or park on the street.  Super easy to get to location off Decatur and 95.  Much better than Steak-out.."
        }, 
        {
            "index": 99, 
            "rating": 4, 
            "review": "All it was hyped as. Sandwich was tasty and the roll soft. I was very happy."
        }, 
        {
            "index": 100, 
            "rating": 4, 
            "review": "uuhhhh if you know me, i would NEVER purposely add cheese onto my food...except for pizza. so after everyone told me to get the plain steak, i thought that would be too boring and decided on....three cheeses & chili cheese steak. the wait was a while in the freezing cold but the heat from the grill kept me company. get equipped with a knife and fork because it gets soggy and messy within seconds (unlike capriotti's, which does not get as soggy as quick).  the meat is so delicious, juicy, tender. the chili was a hot, steamy addition. i wish i saw the other choices like mushroom or bell peppers b/c the cheese was just too much for me. chili cheese fries were alright as well. split one with a friend and it kept me full the whole night. overall, good meal!"
        }, 
        {
            "index": 101, 
            "rating": 4, 
            "review": "Pop's is the business. A little Philly Cheesesteak stand offering up vegetarian, chicken, and steak phillies. They are also serving up grinders, have a bunch of sides (fried mushrooms, cheese sticks, pinwheels, etc.). They also serve TastyKakes (and you get a free one on your birthday)! Best part of all this awesomeness is that is available to you, Las Vegas, 24/7!\n\nI've  been to Pop's several times. I've always ordered their cheesesteaks and you gotta get the Cheez Whiz. I NEVER eat cheez wiz ever (cheese from a can?! What?!) and it a MUST and Philly tradition to do so. I always order mine with peppers, onions, and mushrooms. I've seen people say that everything was pre-cooked. The veggies were, but the meat was laid on the grill fresh, we had to wait for our fries, too. So, that may have been the past, but it's not true now. This was also at 10 PM on a Sunday night. The roll was soft, the meat was juicy and tender, and the whiz, the whiz was the whiz. A great sandwich. It came out to $10.99 before tax, but I can only eat half a time. \n\nIf you have a late night craving or are needing something to soak up all the alcohol from your late night Vegas shenanigans, pop on over to Pop's!\n\nThey only offer outdoor seating and no public restrooms."
        }, 
        {
            "index": 102, 
            "rating": 4, 
            "review": "Loaded Philly steaks available 24/7!! What more could you ask for. The menu has expanded like crazy over the years and I think that's a pretty good thing also. You surely have to come with an appetite or prepare to have a Philly steak that is worth two meals. I've always had excellent service and great quality food. No complaints whatsoever from me outside of the parking. They can't help it that they are so popular and delicious though."
        }, 
        {
            "index": 103, 
            "rating": 4, 
            "review": "The only reason that they don't get 5 stars, is because I was expecting it to taste just like it does in Philly as they use the same bread, meat, and cheese. It didn't,  but it was still delicious and I will continue to eat here!"
        }, 
        {
            "index": 104, 
            "rating": 5, 
            "review": "The Best Philly Cheesesteak Sandwich I have ever had. The fried green beans were good too. The fries were a good compliment as well. I thank my friend for taking me and introducing me to this marvelous eatery."
        }, 
        {
            "index": 105, 
            "rating": 5, 
            "review": "The most legitimately Philidelphian Cheesesteak Joint in Las Vegas.\n\nThe way they select the meats for their sandwiches is superb. Fat and stringy beef, just like the ones in the East Coast when I was a child. When you chew your bites, the meat sort of falls apart and melts in your mouth. I have spent years trying to find the \"right cheesesteak\" in Nevada and California for ages. \n\nThe problem I noticed when it comes to ordering a cheesesteak in any place is not Philidelphia is that the establishment can't get the ingredients right. They usually love to bastardize the recipe with their \"lean, organic, and fat free\" ingredients that fuck up every aspect of the experience, the taste, texture, and even the look. I couldn't believe how many people can bungle a SIMPLE recipe of melt-in-your-mouth CHEESE... and steak. \n\nA proper cheesesteak is a sloppy and messy one. Sort of like a Sloppy Joe, but cheesy. Its where the wrapping paper still has bits of that \"cheese paper\" still encrusted and stuck to the sides after you are done and you feel like you want to lick it off your fingers and the trash. Cheesesteaks should have a pungent, cheesy, and greasy odor that alerts the entire block within the vicinity of your possession of a good cheesesteak. \n\nAnd many restaurants couldn't even get the basic concept of it right. I was about to give up in frustration until I looked online and found this place on Yelp. My first impression was, \"You guys are full of shit\", but I had extra money on me so I ordered a classic cheesesteak with fried okra. \n\nAfter the first bite, I went into a epileptic seizure where I relived my best moments as a 6 year old, experiencing authentic Philly Cheesesteak for the first time as a kid. From what I was told by the hospital staff, the cooks found me lying on the sidewalk with yellow cheesy saliva foaming on the edges of my mouth, and paramedics picked me up to drop me off at Sunrise Hospital. \n\nMy diabetic stroke was worth it!"
        }, 
        {
            "index": 106, 
            "rating": 5, 
            "review": "I give Pop's five stars, with great relief. I live near Pop's and pass it all the time, but had been reluctant to try them out. I am very picky about steak. In fact, I don't even like Geno's (sorry) and consider Jim's the only place for me whenever I'm in Philly.\n\nFor my first visit, I ordered the #32 mushroom & peppers with Provolone. What a hot, delicious mess! I'm glad I ordered it to go and ate it in my own kitchen. Seriously, the bread is a little too soft to support all the fillings. It was damn good otherwise, maybe needs a little mayo and/or ketchup for the \"salt\" factor. The meat seemed to be of good quality and I didn't end up gagging on any fat or gristle, thank god. \n\nI will definitely be back for more, especially since I don't have to worry about the place closing before I get there. Open 24 hours and not McDonald's is a win in my book."
        }, 
        {
            "index": 107, 
            "rating": 4, 
            "review": "Found this place about 4 years ago while running some errands. I remember it was across from a car dealership and their tables were outside close to the Street. Well, it might not be at an ideal intersection or neighborhood but I'm always down for a good Philly!\n\nI've gone here 4 times (could of been much more but its kinda far from me) and this is what I've tried:\n\nProvolone Cheese Steak, Mushroom Cheese Steak, Peppers with Mushroom Cheese Steak and Cheese Whiz Steak  = All Excellent!!\n\nFries: the fatter type when you can actually taste the potato! Must have with their cheese steaks!\n\n* Bread is made and flown from Philly, Sirloin Steak is cut, marinated, packaged and shipped from Philly, Wisconsin and New Jersy Cheeses but the Kraft Cheese Whiz is manufactured from Philly..... Did I mention that they get most of their stuff from Philly??!!!!! Can you say Authentic??!! Well, this place saves me from flying to Philadelphia to grab a cheesesteak because whatever their doing here, their doing it genuinely right!!\n\nIf you want a Real and Excellent Tasting Philly Sandwich that'll fill you up for a fair price then I suggest trying this place out!"
        }, 
        {
            "index": 108, 
            "rating": 2, 
            "review": "I really wanted to give this place a good review, but, alas, I can't. I have been there only twice, but I doubt my stomache will allow me to return.....The first time, I ordered the steak sub, got sick and thought it was just me...Went back last week to give it another shot, again, ordered the steak with mushrooms (which Pop's claim ALL their ingredients are fresh...nope! CANNED mushrooms..YUCK!) And now here I am 2 DAYS LATER still throwing up. Tried to email them, yet their email is INACTIVE! SUPER EXPENSIVE! The only thing I enjoyed was the smart mouth of the \"Grill Master\" Steve S. Will spend my money at Port of Subs before I return....."
        }, 
        {
            "index": 109, 
            "rating": 4, 
            "review": "Order a \"Whiz wit\" and call it a day. Awesome bread, perfectly cooked steak, delicious onions, and creamy melted cheese whiz. What more could you ask for in a cheese steak?\n\nIts kinda pricey, but well worth it."
        }, 
        {
            "index": 110, 
            "rating": 5, 
            "review": "This place is the coolest of the cool!!  If it has not been featured on Diners, Drive-Ins and Dives from Food Network - Guy Fieri...get your ass over here!!! \n\nOld Der Winerschnitzel building that has been here forever, nothing fancy for sure but boy oh boy if you are looking for a great cheese steak...hit this place up.  A must try are the chili cheese fries, good stuff!!  \n\nDon't be trying to diet when you go here and have a place close by to take a quick nap...large portions of delicious yumminess!!\n\nOrder at the window and seating outside only, no drive through or frills.  Truly a great 'dive'.\n\nPops is Tops in my book!!!"
        }, 
        {
            "index": 111, 
            "rating": 4, 
            "review": "Open 24-7, very friendly, generous amounts of meat and cheese on your sandwich!  How can you go wrong there?\n\nSign up with your email address and you can print a BOGO coupon, which they do accept, as I used it just the other day.  They didn't hassle me at all and actually thanked me for stopping by.\n\nBy the way, the rolls are amazing!  Super soft---a big sandwich.  Can't beat em."
        }, 
        {
            "index": 112, 
            "rating": 3, 
            "review": "Came here for some late night munchies. Had the cheese steak. Everything was already precooked, and the cook just took the meat out of the holding oil, placed it on the bun, toppings, then slapped it together and sent it out. LAME!! I know at 3 in the morning it can't be that busy where you can't make the ingredients to order.. Sigh..\n\nBTW: came in here pretty hammered after going to the bar with some of the fellas from work. Wish I could remember more, but I couldn't :)))"
        }, 
        {
            "index": 113, 
            "rating": 4, 
            "review": "Need a cheesesteak at 4 in the morning? This is the place for you. Another review brought to you by Groupon. \n\nI've been meaning to try this place for years. Having passed by it from time to time I always think to myself, why haven't I been there yet. Well, I have seen and I have conquered. All I can say is I can't believe it took me so long. \n\nThe atmosphere is pretty cool and they are QUICK with the orders. We waited no longer than five minutes for our entire order to be ready after paying. Even better, they cook it fresh.\n\nThis place offer a great dining experience. I had the cheesesteak with mushrooms and whiz, my fella tried the cheesesteak with bacon and swiss. These sandwiches are no joke. Large and in charge. I could barely finish half of a half after also ordering some battered mushrooms and cheez whiz fries. We could definitely have shared one sandwich between the two of us.\n\nI found the sides to be fantastic. I tend to judge a place by it's sides and this place did it for me. They were greasy and delicious, even after a long car ride home. \n\nI'll definitely be back to try some more of their heart attack inducing menu items."
        }, 
        {
            "index": 114, 
            "rating": 3, 
            "review": "Cheesesteak was good. They have mustard and ketchup available on request. My son got the BBQ grinder and he loved it. It wasn't dry and had really good flavor. The fries were expensive for the size you get. Overall, I would recommend and come back."
        }, 
        {
            "index": 115, 
            "rating": 5, 
            "review": "Love this place, it has great food,a great environment and the people working there are super friendly!"
        }, 
        {
            "index": 116, 
            "rating": 4, 
            "review": "I have never been to Philly but I can't imagine it's any better than this.  The #32 with wiz was the bomb.  My entire office hit them for lunch and got rave reviews all around.  I am craving another one just writing this review!!!"
        }, 
        {
            "index": 117, 
            "rating": 5, 
            "review": "Oh man! I wish they had this in Cali! Best Philly cheesesteaks I've ever had! Onion rings and fried mushrooms are on point!  Actually everything on their menu is delicious!  Great, especially after a night of clubbing on the strip!"
        }, 
        {
            "index": 118, 
            "rating": 4, 
            "review": "I absolutely love this place, one of the very few 24 hr spots with delicious food. Cheese whiz sauce on top of good steak! I love it and will continue to spend money here =)"
        }, 
        {
            "index": 119, 
            "rating": 4, 
            "review": "Ok.. so I'm not so sure about the cheese whiz... but I know I'm a huge fan of the Philly with the provolone cheese(it was not only a huge sandwich but it had tons of meat and cheese). YUM! Never been to Philly... but I'm assuming this place is the real deal.. everything is fresh and cooked right in front of you. It's got an old A&W(drive-up) feel and I love that! O and the fries... salty goodness!!"
        }, 
        {
            "index": 120, 
            "rating": 4, 
            "review": "This place has been around forever and rightfully so. Reasonably priced for a quick bite and way better than any fast food chain. Their Italian ices are amazeballs!"
        }, 
        {
            "index": 121, 
            "rating": 5, 
            "review": "Best philly cheese steaks in Vegas! They ship their rolls from Philadelphia and they offer cheese whiz. As an added bonus they have tasty cakes. It's almost as if you're in Philadelphia. I love this place."
        }, 
        {
            "index": 122, 
            "rating": 5, 
            "review": "Pops is the ONLY place in vegas where you can get a good philly, the way you want it.  The best in vegas hands down!!!! Its Craveable!! As for the other comment i never had my meat pre-cooked and ive lived in vegas my whole life and have been eating at pops since 2002 when it opened. Nonetheless they are the best!"
        }, 
        {
            "index": 123, 
            "rating": 4, 
            "review": "I might change this to a 5 after a few more visits. But sooo good. Love the Wiz! Philly style and 24 hours. Thankfully I don't live close. A little pricier than expected but, no actual complaints."
        }, 
        {
            "index": 124, 
            "rating": 5, 
            "review": "Pop's is fantastic! That sums up every experience I have here and what I have heard from everyone I know.  I LOVE this joint.  \n\nOk, you probably want more info on it, so here you go:\n\n1. These cheesesteaks are big and tasty.  They are stuffed full of meat and toppings on soft, flaky bread. I've tried a couple and have loved them all.  My faves are the 3 cheese steak and the Mushroom and cheese steak.  Delish!\n\n2. Choices on top of choices! Steak or chicken, then 3 types of cheese, add in all sorts of veggies, and you have a lot of variety. You never get tired of the menu. \n\n3. They have Tastykakes!\n\n4. Lots of tasty sides like Cheez Whiz fries, Fried green beans, chips, etc.  Gotta love the sides.\n\n5. The grill man.  I've been lots of times and it always seems the same guy is working. He is super friendly and knows how to cook.  He's just cool and deserves his own line. \n\nPop's has been on this corner for as long as I remember.  The food is consistently good, the staff is friendly, and you will always leave with a full belly.  What could be better than that?!?!"
        }, 
        {
            "index": 125, 
            "rating": 4, 
            "review": "Ok, so im from philly. So this review is for you transplants who may want to consider eating here. \n\nIf you grew up in or around philly (im from lower bucks), you know how a cheesesteaks supposed to be made. \nThe guys are supposed to take your order,  grill up the meat, grill the onions& peppers alongside the meat, add the cheese and hash it all together with a spatula. Then its supposed to be served on a foot long (aka 18\") hoagie roll. \n\nPops did it a bit differently. The meat & veggies were precooked and sitting to the side of the grill. The cook took a scoop of each and put them on the grill, stirred them up a bit, and added my cheese. Then he took a roll, opened it and put it on top, scooping it up so that the cheese was only on the bottom of the roll. \n\nThe taste was still pretty authentic, but i wish id gotten mine fresh. \n\nThe \"restaurant\" itself was similar in feel to an old-time drive in restaurant, except it did have a covered patio with 6 or 7 tables. Very dive-y. I liked it. \n\nIn conclusion, this was a perfect spot for a post-drive in movie date (10 minutes away on rancho), fun, and a decent cheesesteak, at least for vegas. \n\nIll be back for sure. A solid 4 stars."
        }, 
        {
            "index": 126, 
            "rating": 5, 
            "review": "Love this place.. I drive a distance just to come here...it is well worth it!! Great place !!"
        }, 
        {
            "index": 127, 
            "rating": 5, 
            "review": "This place is so F'ing good. Not just good F'ING GOOD. Philly cheese steaks never ever disappoint. Always hot and fresh ingredients. And the green bean fries WOW. KEEP UP THE OUTSTANDING WORK POPS !!!!"
        }, 
        {
            "index": 128, 
            "rating": 1, 
            "review": "If you're looking to spend a lot of money for mediocre food that compares to what you can expect from the fresh sandwich selection at a gas station, this is your place. I'm not opposed to paying a premium for premium food, but that's not what happens here. \n\nThe place looks pretty dirty, the people working there have zero personality, and the prices are absolutely outrageous. Do your self a favor and keep on driving the next time you're in the neighborhood and thank me later."
        }, 
        {
            "index": 129, 
            "rating": 5, 
            "review": "Best Philly steaks in Vegas and yummo fries! Grillman Steve was friendly and makes a mean sandwich!! Bread is so good to hold all of the great steak, peppers, cheese and onions. I was there for a quick lunch before I caught my plane out and he was fast and helped me as I was in a mad rush to my plane. The grill man was what added to the great experience. I stop at this place every time I'm in Vegas and usually get the # 32...then when I eat it on the plane everyone is asking where did you get that sandwich!! I will be back and I think others on the plane were jealous...love the fries my mouth is watering writing this...check it out if you love Philly steaks... meat is perfect!!! I will be back!! Go at lunch time during the weekdays that is the best service!!"
        }, 
        {
            "index": 130, 
            "rating": 5, 
            "review": "Everything was delicious! No complaints had the #9 will grilled onions and cheese fries... Could not finish but amazing."
        }, 
        {
            "index": 131, 
            "rating": 3, 
            "review": "Ive driven past Pop's Cheesteaks for years, finally decided to give it a shot after a late night out. I took the cashier's recommendation and ordered the #32 peppers, mushroom, and cheese. I really wanted to enjoy it, but it was decent to okay at best. As juicy as it was it just seemed to lack a unique flavor. The portion size was terrific though, some good marks for that. The whole time i was regretting not going for the cheez whiz steak. Maybe next time."
        }, 
        {
            "index": 132, 
            "rating": 5, 
            "review": "I WANT ONE IN LOS ANGELES.\nNOW.\nBEST PLACE EVER.\n\neasy going. great meat. fresh bread. juicy steaks. delicious. \n\noh my childhood was awesome. \ni miss home."
        }, 
        {
            "index": 133, 
            "rating": 4, 
            "review": "OK, so maybe not the best cheesesteak I've ever had, but mostly that was because of the bread, which is mediocre at best. The steak itself makes up for that and then some or I'd have given this a lower rating. I'd say it's not like a \"Philly\" cheesesteak and you can probably get a better cheesesteak within the New York - Philly corridor, and maybe slightly outside of that area... But honestly, out on this side of the country where you can't bake good bread, it's the best you'll find for a thousand miles. Great cheesesteak, interesting but fun atmosphere, worth the drive way off the strip."
        }, 
        {
            "index": 134, 
            "rating": 2, 
            "review": "Service was ok but the food was pretty good just wish there was better seating since it is hot. Would be better if this had an indoor sit down area than just some tables and chairs outside."
        }, 
        {
            "index": 135, 
            "rating": 5, 
            "review": "We ordered the barbecue pork,  swiss philly #35 &#30. The sweet potato fries and cheese sticks. These were some of the best eats I've had in Las Vegas. I would highly recommend eating here and it's worth the short drive."
        }, 
        {
            "index": 136, 
            "rating": 5, 
            "review": "I have always wanted to check this place, and I finally did today. \n\nI got the #2 without, a cheese steak with Whiz, it was amazing!!!\n\nThe meat was seasoned perfectly, the whiz was warm and cheesy, and the bread was amazing, I have read that they fly the bread in from Philly, and I must say it's well worth it.\n\nI have had Philly's at several places and the bread is what put pops over the top.\n\nI will be going back!!!"
        }, 
        {
            "index": 137, 
            "rating": 4, 
            "review": "I wuz hunger for sum Filly chezsteek. So I cam too Pup's Filly Sticks on dekatur. Urijinally I wans a chez bruger at In & Owet. But it no stop my hunger. I was dissapoint. \n\nI ordur da numbur 2. It had Cheez Wiss on it. It wuz berry god.  I no have the hunger no moar. Also it ownlee cost 9 dollurs. I will come bak some they. \n\nI giv dis playce fur stars."
        }, 
        {
            "index": 138, 
            "rating": 1, 
            "review": "Just moved to Vegas from the Bay Area.  I've decided to hit the neighborhood spots. To find Vega's hidden gems.  I saw some great reviews about Pop's Philly cheese steak.  I just knew it was going to be an great food experience.  Ordered the #9 and the chili cheese\n fries. As always when I have an negative review I never bash or criticize the food.  So since the mob was a great part of Vegas. I'm going to use an analogy from a great mobster movie. My experience turned out like Joe Pesci's experience did in the movie Goodfellas when they shot him in the head down in the basement. I just knew that Pop Philly cheesesteak was going to make me a made man. Instead I  got shot in the head and there was nothing I could do about it."
        }, 
        {
            "index": 139, 
            "rating": 4, 
            "review": "Heard a lot about this place. Old school eats. Tried the #6 steak provolone onions  and shrooms. Good steak very tender, provolone melted all throughout. Onions grilled and sweet. Maybe canned shrooms though ( slight draw back ) otherwise very tasty flavorful. Bread was soft and fresh. Will return , good locals joint. Eat well and often !!"
        }, 
        {
            "index": 140, 
            "rating": 4, 
            "review": "not sure if this place taste's better than any real philly cheese steak, i.e. Gino's or my other favorite philly steak place in austin, i.e. Texadelphia, but this place has some good philly cheese steaks. they  have different variations of the philly cheese steaks to the classic.  you can choose what cheese you would like (swiss, provolone, mozzarella, and cheeze whiz), what meat, and what other sides you would like  i.e. mushrooms and grilled onions.  the most important thing about this place is that THEY DO NOT SKIMP ON MEAT.  the sandwiches are about $7-8, but they're big and full of meat.  i usually get the classic, sometimes adding grilled mushrooms to it.  other times, i love getting the pepperoni pizza...grilled beef steak with onions, also fried with some pepperoni and some tomato sauce, and finally topped off with mozzarella cheese.  there is so much meat in that one and so damn saucy!!!!  i also recommend to order the sweet potato fries and the sweet tangy sauce to dip it in.  Another plus is this place is 24hrs.  what a great place to eat after a late night of drinking!!!"
        }, 
        {
            "index": 141, 
            "rating": 5, 
            "review": "My first time coming here was after a night of drinking with the girls.  The place is open 24 hrs! I ordered the #6 mushroom and cheese philly and let me tell you something i cant remember a single thing BUT that philly! great food & awesome costumer service."
        }, 
        {
            "index": 142, 
            "rating": 4, 
            "review": "I'm giving 4 stars, which is the max I feel I can fairly  award a 'simple' cheese steak stand.   \n\nLet's keep in mind though: NOTHING is simple and Pop's just makes it seems that way by being so on top of what they are doing, 24/7.  The business is incredibly well-run and well-established for good reason.  \n\nI personally enjoy the chicken cheese-steak woth cheez-wiz, but whatever you order, expect it to be on the level of Gino's or Pat's, in NYC a Carl's or Shorty's comparison is fair."
        }, 
        {
            "index": 143, 
            "rating": 4, 
            "review": "Being the carb fiend that I am, I'm very particular about bread. The bread at Pop's cannot be beat! They have a story about it on their website - but in summary they ship it in from Philly and it's freaking amazing. Perfect balance of softness and chewiness. \n\nThe steak itself was great. They use sirloin so there isn't any grizzley pieces. I topped mine with cheese whiz. Props on them layering steak, cheese, steak so the cheese gets evenly distributed! \n\nMenu was extensive. I wish I was drunk and not eating here on my lunch hour so I could have gotten a little more into some of the cool things (fried bananas foster? Cheese whiz wheels?). \n\nI mean I guess the atmosphere is \"authentic\", but dining literally 2 feet from Decatur isn't all that great . Maybe on the strip or on a cute neighborhood street it's fun to dine al fresco, but Decatur rather sucks. \n\nThe best cheesesteak I've had in Vegas and I've tried quite a few!"
        }, 
        {
            "index": 144, 
            "rating": 5, 
            "review": "One of my favorite in sight hidden gems. For years people drive by this place and shrug it off. Do yourself a favor and stop in and get a 32 with Cheese Wiz and a side of breaded mushrooms. You will hate yourself for eatting so bad, but it tastes so good."
        }, 
        {
            "index": 145, 
            "rating": 4, 
            "review": "Best cheesesteaks in the city, hands down. Would have been a perfect score, the prices are a tad high. Staff is super friendly!"
        }, 
        {
            "index": 146, 
            "rating": 2, 
            "review": "As someone who grew up in Philly....not impressed.  Pop's gets props for the Amoroso rolls, but the cheesesteak was completely flooded with cheese whiz and overall lacking in flavor.  I love the building though (it's an old converted Wienerschnitzel) and the neon and logo.  They do have Tastykakes and Frank's sodas (!), so if you are craving some Black Cherry Wishniak, Pop's is your go-to place.\n\nI'll try Pop's again maybe and get the provolone instead of the whiz, but my initial assessment is that there are better cheesesteaks in this town.  Most of the other reviews already have the alternatives covered."
        }, 
        {
            "index": 147, 
            "rating": 5, 
            "review": "Awesome cheesesteak! $15 feeds you for the day! Mushroom cheesesteak with Provolone is off the hook. Wasn't a fan of Fried Okra until I ate here. Really never disappoints. Tip the guys well. They Work Hard!"
        }, 
        {
            "index": 148, 
            "rating": 5, 
            "review": "I love this place me and my girlfriend and her brother ordered from here and the food was delicious I had the chicken wings which tasted soo good with ranch almost as good but better then any other place I ate chicken wings at. The chili cheese fries were the bomb and the cheeze wiz they used for the cheese made it that much better this is my favorite place and will be me and my girlfriends to go spot."
        }, 
        {
            "index": 149, 
            "rating": 4, 
            "review": "i came here a couple years ago with my dad and low and behold my grandmother moved down the street from them.  these cheesesteaks were just as awesome and pretty good.   i love the flavor and they cook them as you order them.  i would recommend them and will be going back when i go visit my grandmother.  just delicious!!!!"
        }, 
        {
            "index": 150, 
            "rating": 5, 
            "review": "I love Pops!\n\n I'm from the East Coast (Baltimore) and Pops has the best cheese steaks I've had on the West Coast. I always get the #32 with Swiss cheese and it's always on point.\n\nI also thank them for respecting that my husband & I are veterans by always giving me the Military discount.\n\nThe people leaving bad reviews are obviously not cheese steak connoisseurs.\n\nYou can't beat the price for all the meat you get and it's always hot, fresh and delicious."
        }, 
        {
            "index": 151, 
            "rating": 4, 
            "review": "Pop's puts out a good cheesesteak sandwich. The bread is good and holds up the fillings well. I am signed up on their email list so I get coupons from time to time. I had a coupon for free whiz fries and my wife likes to eat those as a meal so we headed out to Pop's for dinner. It was a nice evening and plenty of people were eating outside at the tables on their patio. There were about 5 people in line too but it moves pretty quick. I ordered a Whiz w/ onions and extra cheese. The sandwich with free whiz fries was almost ten bucks, not bad. My sandwich was  good but some of the meat was cooked a tad too long. The whiz fries were good as always. \n\nThere is no place to eat inside here... Just a walk up window and the tables and chairs on the patio and no drive thru. I kind of like it like that.\n\nOpen 24 hrs."
        }, 
        {
            "index": 152, 
            "rating": 4, 
            "review": "Great sandwich. Confusing menu for a girl from Minnesota that doesn't know the difference in a hoagie, grinder, sandwich, etc.  Whatever it was that I ordered was good.  The pigeons were nasty and fearless.\n\nVegetable lovers beware there is an extra charge of a dollar each for lettuce, tomatoes, etc.  Meat and bread and cheese come standard!"
        }, 
        {
            "index": 153, 
            "rating": 4, 
            "review": "I always see this place while driving over to my bf's house and I've always wanted to stop by and try it just because the big POP'S sign really stands out. \n\nI came here with my boyfriend a few nights ago to try it out. There was nobody there except for one worker who was cleaning up the eating area.\n\nWe walked over to the menu to figure out what we wanted. We decided to get the #32 (mushroom/bell peppers/steak/cheese) to share with a side of chili cheese fries. I liked that you could watch the person making your food for you, there was even a sign that invited you to do so. The guy made our order pretty quickly and we took a seat at one of the high tables. \n\nFirst we tried the chili cheese fries, which was delicious. I love cheese whiz! Then we both took half of the cheesesteak and began eating. I knew it was Bomb after the first bite. It tasted even better after I stuffed some chili cheese fries in it! Yes, I know that sounds unhealthy, but I don't care! lol.\n\nAll in all, this place was good. The worker could've been more engaging though. He didn't talk or smile at all, which made us not want to go back to the counter to order dessert. We just felt like we were bothering him or something, even thought there was no one else there.\n\nI'll definitely come back next time I'm in need of a late night bite!"
        }, 
        {
            "index": 154, 
            "rating": 4, 
            "review": "Crazy good cheesesteaks any time of the day or night! Really good onion rings too!"
        }, 
        {
            "index": 155, 
            "rating": 5, 
            "review": "Ok... Ive had enough. I will NOT go one more day with the reviews on here that aren't addressed. If you rate POPs below 4 stars; then you are a complainer. First of all; my favorite food on a piece of bread is The Cheesesteak. I have been to Philly on numerous occasions and have been to all the touristy spots Pats...Genos... Tony Lukes and out of those 3 Tony Lukes is by far the best. Pops is the best representation of Philly in Las Vegas. \nThe grillmaster makes all the difference. Steve is far and away the man on the grill. Yes, you have to speak up; the man is from Philly and he doesnt reward meekness or stupidity. I like that. Its not a 5 star restaurant. The sandwiches aren't cheap; this isn't a 99¢ special joint. If they are just recooking your meat then speak up. Ive only had fresh meat and chicken. He brings his Amorosos in from Philly... So for those of you that are from Philly and complain about the rolls: you know nothing. I will continue to seek out Cheesesteaks everywhere that I live and in Las Vegas, I found my spot once again. Its called Pops."
        }, 
        {
            "index": 156, 
            "rating": 3, 
            "review": "It's good and the sodium levels are not as high as other places. You can really taste the flavor of the beef but if it cools down then it'll start to taste kind of bland, it's better to eat it right away while it's hot. I love how it's 24/7 and the staffers are friendly. I usually get a #4, #6, #34 and I have yet to try # 32. If you want an awesomely tasting cheese steak but without the added sodium (salt) then I would highly recommend POP's.\n\nSometimes I get the Chilli Cheese fries with pastrami which is also good but can make you kinda heavy.\n\nSome say the cheese steak is bland but that's because there isn't as much salt like other places which can really alter the flavor/taste of the cheesesteak., so if your lookin out to have more foods with less salt then I recommend this place.\n\nI don't think the drive through actually works to get your order, I mean I went to POP's like 33 times and it doesn't look like they actually take orders in the drive through, if they did, i'd probably give POP's another star."
        }, 
        {
            "index": 157, 
            "rating": 3, 
            "review": "I had the loaded cheese fries. Good food, a medium-sized portion. The fact that it's open 24 hours was a huge benefit. This is a nice alternative to fast food if you've got a craving for good-for-the-soul food late at night. I only gave this place 3 stars because the food is a little over-priced when compared to similar places. Also, the customer service was sub-par. Lastly, the building wasn't as clean as it should have been."
        }, 
        {
            "index": 158, 
            "rating": 2, 
            "review": "The difference between Caprioti's is they use real beef...Pops, as good as i tastes is barley beef.  I saw an empty box of \"philly meat\" out back as i walked to my car and read the ingredient label..wow, please dont cheap out by using food starch added meat products and claim it's better than Caps...Shame on you."
        }, 
        {
            "index": 159, 
            "rating": 5, 
            "review": "Best cheesesteak I've ever had outside of philly. So many places all over the country make steak sandwiches and call them philly cheesesteaks and it's usually a disappointment. Not at pop's. Real philly cheesesteaks in vegas!"
        }, 
        {
            "index": 160, 
            "rating": 1, 
            "review": "Being from Philadelphia at one point I love this place but tonight 1 a.m. in the morning and in a vacation what a nightmare trying to deal with the fat guy and Chris trying to order a hoagie with oil and state it wasn't cooked 3 hours go out of a container and put on the grill again do yourselves a favor do not go there late at night they have no clue what you're doing and you're only there then work the late hours a complete sham"
        }, 
        {
            "index": 161, 
            "rating": 5, 
            "review": "The best philly sandwich this side of Philly and maybe better than philly. Off the beaten path but worth the drive. I live far south of the valley but anytime I'm out near it I go."
        }, 
        {
            "index": 162, 
            "rating": 4, 
            "review": "In Vegas for most of May working at the House of Blues.\nOne of my buddies was jonesing for a philly cheesesteak.\nAll ingredients are shipped from back east, the rolls are perfect!\nExcellent cheesesteaks, Steve was the grill master du jour, nice job!\nThey even have Tastee Cakes!"
        }, 
        {
            "index": 163, 
            "rating": 4, 
            "review": "3.5 stars to be exact.  I just went to Geno's and Pat's in Philly the 1st week of Sept.  While the steak is a lot more chopped up here I would say it was pretty comparable.  The bread is really what you come here for I think cuz I guess you could make a pretty fair attempt at making these at home.  Still good though."
        }, 
        {
            "index": 164, 
            "rating": 3, 
            "review": "If you want a philly style cheese steak for a reasonable price, Pop's is a good choice.  They even have Frank's sodas.  The cheesesteak comes in several varieties including wit whiz, american, provelone, and cheddar.  The steak is flavorful and grilled right before your eyes.  I would avoid the sides though, not only are they prepackaged items like zucchini sticks, mozzerella sticks, mushrooms, etc, but they are all fried in the same oil.  They did not look good.\nStill the sandwich is one of the better philly cheesesteaks in Las Vegas so give it a try."
        }, 
        {
            "index": 165, 
            "rating": 5, 
            "review": "I am fanatical about cheesesteaks. Some friends and I used to road trip from VA to 9th and Passyunk in Philly to put Pat's and Geno's head to head. (Pat's wins that battle, by the way.)\n\nAnyhow, POP's is even more fanatical about cheesesteak. Look at their website and the detailed manifesto explaining why they use Liberty Steaks, Amarosa Bakery rolls and other carefully sourced and authentic ingredients.\n\nIt shows in the finished product, a Pat's style sandwich with ribeye chopped on the grill. I order mine wit extra onions (caramelized to a beautiful brown) and Cheez Whiz. I recommend you do the same. Can't go wrong with the classics.\n\nThis is a true Philly style experience with a walk up counter, metal tables on a patio, and a mural of Ben Franklin on the wall, and it's open 24/7. It's a half hour drive for me but well worth it. Best cheesesteak in Vegas, easily."
        }, 
        {
            "index": 166, 
            "rating": 3, 
            "review": "I tried Pop's because I love me some good cheesesteak, and they offered a 2-for-1 coupon on their site, so I couldn't resist.\n\nThis place is tiny with minimal covered outdoor seating. There's a walk-up window where you order and pay for your food. The service is nothing special; not horrible but not the greatest, either. The guy that took our order was also the cook, and he makes the cheesesteaks right in front of you.\n\nBoth, my husband and I, decided on the #2 Cheese Whiz Steak  w/grilled onions (the onions don't automatically come with, so be sure to ask for them), and an order of fried okra and onion rings. \n\nCheesesteaks: The bread was nice and soft and held up well to the decent amount of filling. The meat, on the other hand, was kind of dry and lacking in flavor - it needed some seasoning. \n\nFried okra and onion rings: They were both perfectly fried and not too greasy, but they're the frozen stuff that you get at the store.\n\nAll in all, not a bad place, but I've had better."
        }, 
        {
            "index": 167, 
            "rating": 2, 
            "review": "Lets start from the beginning...its on a busy street corner. There isn't a drive thru like you would think. Small parking lot. It's noisy, kinda dirty, more expensive than I thought. So, just like the 2-star rating says, \"Meh, I've experienced better\".\n\nIf you want a big sandwich for $12 and it's late...Pop's might fit the bill. For the money I'd rather go to Roberto's."
        }, 
        {
            "index": 168, 
            "rating": 4, 
            "review": "I'd read about Pop's in LV Weekly awhile ago and when the Groupon for this place popped up, we seized the opportunity and ventured over to Decatur to check it out.  I was surprised to discover it was an outdoor establishment with no indoor seating, and wasn't sure what to expect since the place doesn't look like much at first glance. \n\nBut looks can be deceiving, and I was VERY impressed with the food -- everything is made to order, so even though we sat outside in the 60 degree evening to eat our phillies at one of the tables, the food was piping hot.  I liked that they had a few options for cheese since I'm not a cheese whiz fan, so I got provolone instead with peppers and onions and it was delish.  My boyfriend got the same and we shared the crunchy fried green beans with marinara sauce, which were very good.  Portions were pretty big so you definitely get a lot of food for your money.  I'd definitely go here again!"
        }, 
        {
            "index": 169, 
            "rating": 1, 
            "review": "first of all throwing down Steakems on a grill isn't a cheese steak.  charging 11.99 is bullshit too.  I have had  pats, genos,  world famous out of Burbank and a ton of cheese steaks in new England.  the cheese steak at domingos isn't as good as this place's cheesesteak.  but if you have had a domingo cheesesteak that isn't saying anything.  POPS YOU SUCK.\n\nreally how much less would you make on your 12 dollar shitty sammich if you used real shaved beef not frozen industrial steakem meat and the proper amount of cheese?  a dollar less maybe 50 cents? \n\nthere is no way I would ever eat here again, so I guess getting 17 bucks out of me for fries a sandwhich and a dr pepeer was a good idea. and I guess if you really want cheese on your CHEESE STEAK  you better get the double order which would be the regular amount of cheese ANYWHERE ELSE THAT CLAIMED TO MAKE CHEESE STEAKS IN THE WORLD, WHICH THESE ARE NOT.  there are shitty imitation made with some steakem type material.  oh I said that already.\n\nI can only imagine the lady who gave it 5 stars was paid for that review or is so used to having awful things in her mouth this seemed better than ...well you can fiqure out where I was going.\n\nthe fries were okay.  not worth an extra star though.\n\n\nSHITTY AWFUL Expensive and disappointing."
        }, 
        {
            "index": 170, 
            "rating": 4, 
            "review": "Awesome good food! They know how to make some excellent cheese steaks! Service was fast and prices were decent. MmMmm don't forget about the WHIZ WHEELS!"
        }, 
        {
            "index": 171, 
            "rating": 4, 
            "review": "Always loved this place , since before it was pop's.  Great Phillies but I prefer their bbq pork , and chicken. Just repeat several times what you want. They don't always hear substitutes, add ons.."
        }, 
        {
            "index": 172, 
            "rating": 5, 
            "review": "This is one of our favorite places. The grill dudes are always awesome, I can get my out of towner and the boyfriend can get his classic. Yummy. Also they have fried okra! FTW!  I recommend this place to everyone looking for a good philly."
        }, 
        {
            "index": 173, 
            "rating": 4, 
            "review": "This has been my go to cheesesteak place for many years. Being from the Philly area, this has been one of the best choices for cheesesteaks, no matter how far I have to drive to get it. They're much better if you can eat there, but tables are outside and weather doesn't always cooperate. Prices have gone up but its worth it. Go on your birthday for a free tastycake...yum! I like to order my cheesesteak with extra cheese. Staff is pleasant."
        }, 
        {
            "index": 174, 
            "rating": 4, 
            "review": "Well I went back there a few weeks ago and tried their breakfast Philly. It was awesome! \nI believe it is the cook who makes it wort overpaying for a philly. The cook- it was a young man who works am on the weekends mostly- that mead this experience worth its weight in gold."
        }, 
        {
            "index": 175, 
            "rating": 3, 
            "review": "I had high hopes for this place, because it looks like the perfect hole in the wall you've yet to discover. Cheesy side murals, dim lighting, hand painted signs, all the makings for a secret delicious spot. \nI ordered the chicken Philly with bell peppers, provolone, and mushroom. It was very hot and cheesy, which was a plus! But almost too hot....I had to pause in between bites or else risk third degree burns. Overall it was kind of tasteless. And dry. The fries were no good, we ate a couple and tossed the rest. That's pretty bad considering I love fries so much that my standards are pretty low. They tasted like fries you would get at the public pool snack stand when you were a kid. \nOverall I would say this is fine if you're hungry and in the area....but definitely would not make a special trip for it. Most likely I will not be back again."
        }, 
        {
            "index": 176, 
            "rating": 5, 
            "review": "Philly steaks only come 2nd to bbq in terms of my favorite food. With that being said, this is one of my top 5 favorite places to eat when I'm home. Genuine cheesesteaks, which you can get with Whiz, provolone or American (go for the Whiz). They also have an awesome BBQ pork grinder with a great sauce. And its 24 hours, which is a HUGE plus."
        }, 
        {
            "index": 177, 
            "rating": 4, 
            "review": "Upon recommendation from a very good buddy, I stopped by and got a Philly Steak with provolone / onions / peppers.  OMG, it was fantastic!  It brought back great memories of my trips to Philly.  There was plenty of meat, just the right mixture of other ingredients, and the roll was perfect.\n\nThere is no \"ambiance\" to this place ... which gives it it's own \"ambiance\" (if you get my drift).  I probably wouldn't frequent this place at night, but it's well worth a trip if you're in Vegas and have a car."
        }, 
        {
            "index": 178, 
            "rating": 3, 
            "review": "Had the Bell Pepper Philly with onions and provolone.  Wasn't bad at all for $10.80."
        }, 
        {
            "index": 179, 
            "rating": 5, 
            "review": "Benn coming here since the 90's & never have had a bad sub. For steaks, I order a #4, always great. For breakfast, you can't beat their bacon & egg hoagie. Sooooooooo good!!!"
        }, 
        {
            "index": 180, 
            "rating": 3, 
            "review": "I didn't know there was so many different  cheeses to put on my Philly cheese steaks, he asked me what kind of cheese I wanted I was lost I said \"Philly cheese\" lol but on the real I love this place.\n\n\n the corner location scares me with so much speeding traffic i always think about a car or truck crashing into people trying to enjoy this place be safe..."
        }, 
        {
            "index": 181, 
            "rating": 5, 
            "review": "I had the #34 chili cheese steak sandwich mmmmm most delicious wit sweet potato fries..I sure will b coming back when I stay out here in Vegas. .. going to try out the whole menu..lol"
        }, 
        {
            "index": 182, 
            "rating": 5, 
            "review": "I'm not big on philly cheesesteaks but we decided to go one day after we were done clubbing. One of my friends recommended POP'S since it was kinda close to us and its open 24 hrs. I  I ordered mine with provolone, green peppers, onions, and jalapenos...and a side of fries and ranch.  It was really good! I crave them all the time."
        }, 
        {
            "index": 183, 
            "rating": 3, 
            "review": "My boyfriend and I went out to grab a philly at 2am a few weeks ago, and it was pretty good. The sandwiches were a little expensive, at least in my opinion, but they were full of meat and toppings, so I can't complain too much. As for flavor, well, to be honest, I've had much better. These weren't  bad, just not that great. Plus, they have no restroom, which is really weird for a food place. It's also not the cleanest place around, but I suppose that's part of it's seedy tasty charm. :P\n We'll probably be back at some point, simply because it's open so late, unless we find something better."
        }, 
        {
            "index": 184, 
            "rating": 1, 
            "review": "The workers here are jerks, and I'm obviously not expecting high class service coming from a place like this, but dang, a customer is still a customer. Even after the guy taking my order made me repeat my plain Philly steak again, he still mixed up the orders and put the wrong cheese on and toppings. I said I wanted an original philly steak with everyhing, he said \"whats everything?\" umm, what normal philly steaks have? Sandwich was super soggy and not enjoyable."
        }, 
        {
            "index": 185, 
            "rating": 4, 
            "review": "I had one of my favorite sandwiches last night... Steak with swiss cheese and bacon.. Fries with cheez whiz ... just wanted I wanted..."
        }, 
        {
            "index": 186, 
            "rating": 4, 
            "review": "Good bread, good meat and they are willing to do the sauteed onions without peppers if you want.  The only downside is that there really is not much to look at other than traffic while you are eating your food."
        }, 
        {
            "index": 187, 
            "rating": 1, 
            "review": "I just want to say if you are mexican and you want a philly cheesesteak do not go to \"pops philly steak\" on Decatur and Oakey. I never had a problem with them until my fiance paid with her debit card while the old man that works there asked for her I.D. as she showed it to him to verify the name on the debit card he tells her \"man you people always have long names\". I asked him what the hell does that mean as he walked away acting like he couldn't hear me. Racism should not be tolerated at all. I will never go back to this place ever again..."
        }, 
        {
            "index": 188, 
            "rating": 5, 
            "review": "Great place! It's an order window but looks huge on the outside as I expected to sit in. You can sit out on the large patio which made it great to bring my little dog. I only eat seafood so wanted the fish philly but they were out. We arrived just short of midnight. Decided on the tuna but there was only enough for one of us so me and the wife had to share. Ok so with all these hiccups why the 5 stars? I explained that I wanted my tuna sub like the philly sandwiches. They had never done it before and was very confused. Then out of nowhere I got the \"what the heck\" and he went for it. He made it just for me and I couldn't have been happier. It came out amazing!!!! Get there earlier if you want the less popular foods (seafood)."
        }, 
        {
            "index": 189, 
            "rating": 5, 
            "review": "#32 Peppers & Mushroom Cheese Steak is grilled sliced beef with grilled peppers, onions, mushrooms, and your choice of cheese. This is the best cheesesteak I have ever had! I've had them in Philadelphia and, I have to say, POP'S is so much better. The meat is to die for! It is cooked to perfection - juicy and full of flavor. The vegetables are cooked with the meat so the uber beef flavor envelops the vegetables like a warm blanket. Just like Pat's, they served Cheez Whiz. If you're not a fan, try it on the side first. The provolone cheese melts to a gooey goodness and covers every bit. The Amoroso bread is wonderful. It has a sturdy crust on the outside, light and airy on the inside. It has a subtle french/sourdough taste to it which works great with the steak. Thumbs up, way up!"
        }, 
        {
            "index": 190, 
            "rating": 4, 
            "review": "Delicious Philly steaks. Made fresh. Best sauce for sweet potato fries."
        }, 
        {
            "index": 191, 
            "rating": 4, 
            "review": "Hands down the best Philly steaks we've had in Vegas so far. After a night of drinking they're even better. Definite comfort food to the max."
        }, 
        {
            "index": 192, 
            "rating": 5, 
            "review": "So so good! Great service, outdoor seating, fresh ingredients! The pride José has in Pop's is inspiring!"
        }, 
        {
            "index": 193, 
            "rating": 4, 
            "review": "I finally got a chance to try Pop's after living here for the past two years and I must say I was not disappointed. Tender meat, creamy cheese wiz, crisp veggies and fresh bread = yummy!"
        }, 
        {
            "index": 194, 
            "rating": 4, 
            "review": "This place is open 24 hours. The menu is pretty big so there are plenty of options. We got 2 cheesesteaks, one order of fries and two drinks. There bill came to $27... Which may seem a bit steep for a roadside stand. But the food was good. Although next time I think I'll skip the fries. They were nothing special."
        }, 
        {
            "index": 195, 
            "rating": 5, 
            "review": "24hrs... and great quality!!!!!!!!\nSince there is enough said about the cheesesteaks, thought I would add something different.\nPop's has the best breakfast sandwich!! Steak, Eggs, Cheese!! I love it and it has saved me from the hangover monster on more than a few mornings!\nAlso, the turkey sandwich is top flight! The bread is amazing, and makes sense that they bring it in from back East.\nI don't eat \"fast food\" and I consider Pop's to be anything but typical fast food, the higher quality is obvious, and I don't mind paying for it.\nHighly recommended!"
        }, 
        {
            "index": 196, 
            "rating": 5, 
            "review": "Okay, let me just preface something, I'm from the suburbs of Philly.  This place makes a good eff'n cheesesteak!  When we moved to Vegas, I knew there were gonna be some things I would not be able to get out here like Utz Potato Chips, Kunzler Ham, etc.  I thought for sure the cheesesteak would be one of them until we found Pop's.  Both Charles K.'s and Reggie M.'s testimonials are 100% true and to back it up http://www.popscheesesteaks.com/\n\nThe worst thing about this place, it's not open Sunday."
        }, 
        {
            "index": 197, 
            "rating": 5, 
            "review": "Still the best Philly Cheese Steak without having to purchase a plane ticket.\n\n18 years in this town and I have not found anyone more authentic then Pops for cheese steaks.  Yes there are many places that claim they have a philly, but no one really has a philly other the in philly, however pops comes the closest to what I remember after living in Philly for many years.\n\nIt is close enough to make you want to go back to philly.  This place is good, they have a variety of cheeses you can put on and are even creative with some toppings.  \n\nOpen 24/7 you cannot beat that.  One of the best an worth the drive to that side of town.  I will post a picture so you can drool...."
        }, 
        {
            "index": 198, 
            "rating": 4, 
            "review": "I really don't like cheese steaks in general, but this little hole in the wall (or A-frame off the strip) had unusually good food. I had a 1/2 steak CS with peppers, swiss cheese, onions and mushrooms. It was all very tasty, tasted pretty fresh and was made to order. The service was very friendly. Be sure to ask for the hot sauce!"
        }, 
        {
            "index": 199, 
            "rating": 5, 
            "review": "Definitely my favorite place to go for a cheese steak. Will drive the distance to go here! Be conscious that its is all outdoors so keep weather in mind, but absolutely worth it. Yeah, its pricey but the flavors are more than enough to satisfy that craving.They make the food right in front of you and they do it quickly. Their menu expands past  Philly cheese steaks and fries, I really love their Italian sub its phenomenal!!!!! And dont forget to order the sweet potato fries, they are served with an apple cinamon sauce that makes them over the top!"
        }, 
        {
            "index": 200, 
            "rating": 1, 
            "review": "Not good . Jalapeño poppers were not what I was expecting . Tasted like they didn't wash them right . Just not appetizing. Cheesesteak not as tasty as expecting either ."
        }, 
        {
            "index": 201, 
            "rating": 5, 
            "review": "The Menu is vast and clogged with cholestrol filling items. It was right up my alley. Love that its open 24 hrs. Wish the drive thru was open though."
        }, 
        {
            "index": 202, 
            "rating": 4, 
            "review": "I went on Saturday and got the Mushroom and cheese philly. It tasted great with melted provolone cheese melting through the meat. I am really happy it's opened 24 hours so if you are in the mood for something other than fast food late at night this is a place to stop by, it's located across from Arizona Charlie's on the West of Vegas."
        }, 
        {
            "index": 203, 
            "rating": 3, 
            "review": "I use to come here all the time when I lived in this area but haven't been back in awhile. Awesomely, they've expanded their menu and add fried zucchini, fried mushrooms, salad options, sweet potato fries and other cool side dishes they never had before! I'll have to try them with another visit soon.  \nThis time I got chicken, provolone, onions and mushrooms. Sad to say, it lacked any flavor at all. Apparently the original owners had sold it and that could explain the change in quality. But still, I have to go back and try the yummy looking options they've added.\nThey are also a walk up window and only have a few outdoor stools and tables to dine at, so be sure to be dressed accordingly with the weather if you decided to stay and eat there."
        }, 
        {
            "index": 204, 
            "rating": 2, 
            "review": "Okay, the friends ravvvved about this place... and um, it was not up to par. \n\nApparently, it was a no-no to go on a Thursday night. \n\nThe Best \"Grill Master\" works on Friday and Saturday Night...\n\nSo, if you go, go one one of those days... \n\nI must say though, the fried okra was awesome!"
        }, 
        {
            "index": 205, 
            "rating": 2, 
            "review": "As someone from the Philly area, driving by had me pretty excited. Pop's looks like Pat's! However, I got a cheesteak, with whiz, onions, and peppers- but they forgot the flavor.  Everything about it was bland.  I couldn't differentiate between the meat and the onions. It was weird. And the bread was awful- it was soft and did not taste like an Amoroso. Looks were most definitely deceiving. That said, the patio is great! And so were the sweet potato fries."
        }, 
        {
            "index": 206, 
            "rating": 1, 
            "review": "Pop's Philly Steaks They wont let me post on their wall any more. Great place if you want to be give a sandwich you didn't order (never ate before in your life) and then when you take it to the window to tell them they gave you the wrong order. they say \"NO thats what you ordered and walk away\" Gret place if your in the mood for food roulette."
        }, 
        {
            "index": 207, 
            "rating": 4, 
            "review": "There are only a few things that I absolutely crave & Pops is one of them. A #2 (philly with cheese wiz w/sweet peppers is my all-time go to! Everything you want when you think philly cheese steak."
        }, 
        {
            "index": 208, 
            "rating": 5, 
            "review": "Awesome food! Highly recommended I've had a few of there sandwiches and I can say I've never been disappointed always satisfied and there zucchini fries are bomb and the banana fosters bits are delicious."
        }, 
        {
            "index": 209, 
            "rating": 1, 
            "review": "this was the most bland, tasteless philly I have ever had.  Soggy, nasty bell peppers. maybe weekends are fine, but don't do it on a week night !"
        }, 
        {
            "index": 210, 
            "rating": 5, 
            "review": "I've been coming here for years and despite the amazing food and service, I haven't had a chance to write a review, so here's the amazingness in a nutshell: \n\nPop's may look like it's in the wrong area, but what it lacks in appearance, it more than makes up for with quality and service. The food is absolutely ADDICTING, service is quick and friendly, and they've never ever gotten my order incorrect! \n\nI recommend this place to people all the time and the verdict is always the same: a new favorite. \n\nOn another note, this place is probably the only decent 24 hour fast food joint in all of Vegas."
        }, 
        {
            "index": 211, 
            "rating": 2, 
            "review": "Some background: I have lived in and around Philly for 29 years, and just moved to Las Vegas in July. I used to live down Passyunk from Pat's and Geno's, and for the last 4 years I lived near the Dalessandro's (the real king of Philly steaks). Soooo I think I am fairly qualified to give this review.\n\nAfter finding out that Pop's was a short drive from my office, I decided to head down there to devour thousands of delicious calories in one sitting. I wish I saved those calories for something better. What a disappointment!! \n\nI asked for my go-to, a cheesesteak hoagie (typically it's steak, cheese, lettuce, tomato, onion). He told me mayo was included, and I told him no mayo please. After waiting 5 minutes for my steak, I get it in a paper bowl thing with a fork stuck on top. Never saw that before... Sat down, pulled apart my steak to put ketchup in there, and I realized the thing is slathered in mayo. NASTY. Brought my steak back to the counter, told the woman at the register about the mistake, and they made me another. I had to get this to go since I needed to be back at work. Back at my office, I take a bite of my steak and there is some kind of vinegar flavoring in the hoagie. I don't know if the onions were cooked in it or if the guy thought this would be good or if was just suffering from temporary insanity.... Ugh. I ate it, but only because I paid $14 with a drink and chips. \n\nFirst, the prices were a little much for what you're getting. My cheesesteak hoagie was $10. I used to pay $8 at Dalessandro's. It's $6.50 at Dalessandro's for a plain steak and it's $8 at Pop's. The quality was a 2 star compared to Dalessandro's 5 star, so confused on the mark up of price. Maybe because the rolls are shipped from Amaroso's? \n\nIf you've never had a Philly steak, I can see why you might like these. If you have experienced the best of the best, you will walk away disappointed. Between the price, flavor, and authenticity, I won't be returning."
        }, 
        {
            "index": 212, 
            "rating": 5, 
            "review": "I think this maybe one of the best Philly cheesesteaks  I've had! Loved the sweet potato fries. Haven't been here in years, how could I forget?! The sandwich will easily feed two - it's a little pricey, but it's worth it"
        }, 
        {
            "index": 213, 
            "rating": 1, 
            "review": "We waited in the \"Order Line\" for about 20 minutes (somewhat long line) just for Italian Ice, the man behind the grill told me to just go to the register so I proceeded over there and waited behind the couple who was orginally in front of me in the first place. I was fine with the waiting until the man at the register automatically started ringing up the woman behind me without even acknowledging me or asking for my order. Another five or so minutes passed then the woman next to me apologized for them taking her before me and even asked if I could just get an Italian Ice to which the guy at the grill gave an annoyed look and said the other guy would get it. I waited another 5 minutes of nothing with no line besides the woman who was orginally behind me before deciding to just leave. The man ran out the back door to say he'd take my order when we were already across the street getting into the car. Never have had their food but for that alone i will NEVER EVER be back nor recommend it to anyone. I wish I could give this 0 stars for that alone."
        }, 
        {
            "index": 214, 
            "rating": 5, 
            "review": "I love their sandwiches...really fresh and hot :)\nfor some reason..I always go there after work out..maybe I feel like it's healthy and low calories or something..\nI've never heard bad thing about this place and never complained of this sandwich place!\nI love their mushroom + jalapeno sandwich! they have some good sweet potato fries too!!\nreally fast but not so a instant food! have to try this place!!the best steak sandwich place ever!!"
        }, 
        {
            "index": 215, 
            "rating": 4, 
            "review": "Philly cheese steak sandwiches in Vegas baby! Located on the southeast corner of Decatur and Alta, you can do some serious people watching here. No indoor dining area and no drive through, but yet somehow this place it getting a four star rating from GA. \n\nI ordered the #3, Steak and American cheese. 'Merica! Topped with grilled onions for good measure. It got better with every bite. Juicier and juicier with melted cheese all the way to the end. The French fries were hot and crispy. Next time I'll try the Cheese Whiz fries like JR got. They looked they could have been named after some crazy 80's band. They looked \"Totally Cheezy Awesome.\" They have a sign that says they welcome you watching your food being prepared. So I did. It was kind of cool. They serve breakfast sandwiches too. Can't wait to try one."
        }, 
        {
            "index": 216, 
            "rating": 5, 
            "review": "To all the people leaving bad reviews saying these are not real cheese steaks they are crazy. The meat is cooked right in front of you so how can you say it's not? Every time I go they pull out a slab a raw meat off wax paper not out of a croc pot. The bread and most of the other ingredients are shipped from Pennsylvania.   Born and raised in Philly these are not 100% but your also not in Philly,  your in vegas that being said these are the best your gonna find in vegas."
        }, 
        {
            "index": 217, 
            "rating": 4, 
            "review": "Loved it! Some of the best philly steaks I've tried. Everything is made in front of you so its fresh..you have to eat outside which is a little inconvenient since its hot out but still great place!!"
        }, 
        {
            "index": 218, 
            "rating": 5, 
            "review": "Honestly, better then cheesesteaks in philly. And I am from the east coast and have been to Gino's and Pat's. The ONLY place to get a cheesesteak in Vegas is here and its open 24 hours too."
        }, 
        {
            "index": 219, 
            "rating": 5, 
            "review": "Well we got the # 4 Philly Cheese Steak with provolone, the #8 Philly Cheese Steak with Mushrooms and provolone, and an order of fries. The cheese steaks were fresh and delicious.  Good price and quick service."
        }, 
        {
            "index": 220, 
            "rating": 4, 
            "review": "I like the feel of this place and the sandwiches are big and stuffing. \n\nI've tried the Philly steak (w/ onions, peppers, whiz), BBQ pork hoagie, Italian sausage sub. Out of the apps I've gotten sweet potato fries,fried zucchini and the fried green beans. \n\nAll have been really good, but I love fried green beans so that hits this happy spot for me with sharing a Philly Whiz cheese steak.\nVery curious to try the bananas foster, fried okra and whiz wheels.\n\nOpen late so a plus for night owls like us. Since it's made piping hot to order, it's still nice and warm when we get home. You go to any other fast food and that crap is cold when we get home- another 10-15 minute drive on the FWY. MMM... night owls deserve something warm in the belly too."
        }, 
        {
            "index": 221, 
            "rating": 4, 
            "review": "awesome philly cheese steak, I am from the east coast mid Atlantic area and Pop's has it on lock down for cheese steaks. it's well worth the trip to try this place out. Also they have tasty cakes... Another mid Atlantic staple for a sweet. thanks Pop's for being out West"
        }, 
        {
            "index": 222, 
            "rating": 5, 
            "review": "The whiz!!!  lol the best late nite munchie food on the Westside!  Love it!"
        }, 
        {
            "index": 223, 
            "rating": 5, 
            "review": "always loved this spot even under different names - grillmen are friendly and steaks are tasty...\n\nthey go to the trouble of ordering amoroso bread in from philly giving the steaks that true philly feel.\n\nbig ups, mad love. this is my fav cheesesteak on this side of the country."
        }, 
        {
            "index": 224, 
            "rating": 5, 
            "review": "I am a Jersey girl so for me to say this is an actual Philly cheesesteak you must know it's true. They use the Amoroso rolls the real Philly steak meat and make it exactly like it tasted back home. I would go here every day if possible. Highly recommended"
        }, 
        {
            "index": 225, 
            "rating": 3, 
            "review": "I've been coming to Pop's since before it was Pop's. Haven't been here in a couple years now. Was a little disappointed steak was no longer fresh but Frozen, made for a dry sandwich. Fries are still great people there extra friendly business seems good the lunch line was four or five people. Still a good sandwich just not the great one I remember comma but what is as good as it used to be really? Also got a free Tasty Cake for my birthday today!!"
        }, 
        {
            "index": 226, 
            "rating": 4, 
            "review": "This is another hole-in-the-wall place that locals love to frequent. I'll have to say, their cheese steaks were pretty solid. We ordered cheese steaks with cheese whiz and onions. The sandwich was very tasty and had a good meat to cheese to bread ratio. Slightly greasy, but in a good way. You may think that prices are a bit high for a sandwich, but their portions are very generous. When I lived in Las Vegas, my only gripe with this place was that it was kind of out of the way if I was craving a good cheese steak."
        }, 
        {
            "index": 227, 
            "rating": 3, 
            "review": "I  had been wanting to try Pop's for the longest time.  And every time I drive by the colorful stand, I think to myself \"Why on God's green earth have I not been there yet?\".  Well, all this anticipation contributed to the big let down.  \n\nI love anything authentic.  And supposedly all of the ingredients (rolls, cheese, meat) are flown in directly from Philly itself. I ordered the provolone mushroom cheesesteak, and it was just OK.  Maybe I needed to order the cheese whiz to make it more authentic, but I just can't bring myself to eat something that artificially bright yellow. \n\nThe roll was definitely piled high with the tender meat.  I only ate half because it was so filling.  But it wasn't as seasoned or flavorful as I was expecting it to be.  The mushrooms added some flavor, but that was it.  Perhaps I am just not a phillycheesesteak type of girl. \n\nThere were 2 people ahead of me in line, so there was a bit of a wait. I am just grateful I went in the spring and not in the middle of summer.  I doubt i will have any cheesesteak cravings any time soon, but it is comforting to know that if I do have one, they are open 24 hours.\n\n*Yelp 100 Challenge: Review 26/100*"
        }, 
        {
            "index": 228, 
            "rating": 5, 
            "review": "Great quick stop for a Philly Cheese Steak, especially if you are up late or getting off work in the early hours of the morning (as my fellow gravies do). The fries are good, the Phillys are excellent, and the cook is always tip worthy.\n\nIf you are planning to eat \"in\" then wear a nice thick jacket in the winter as the seating is all patio."
        }, 
        {
            "index": 229, 
            "rating": 5, 
            "review": "I've been in Vegas for almost two years, and though I've driven by here a few times, I never stopped until tonight. Jet me tell you, I'm a bit disappointed in myself, because this place is delicious, and I just cheated myself out of two years of fantastic sandwiches!\nThe number 32 with onions and American cheese is savory and delicious, and I can't wait to visit again soon!"
        }, 
        {
            "index": 230, 
            "rating": 2, 
            "review": "I really hate to leave a bad review for this place. I've been going her for as long as I can remember. Since it changed from Philly Steakout to Pop's. I absolutely love their sandwiches and never really had bad service or a complaint for that matter.\n\nI was craving a Philly Cheese Steak last night, but couldn't get one until my check hit. So I really really really wanted a Philly Cheese Steak tonight. \n\nIt was a bit chilly out and there was a couple on the side, I was told they already ordered. So I placed my order a #32 and a #6 both with bacon. The previous two times prior they were pretty sparse with the meat and bacon compared to what I'm used to, I figured it was just the Grill Master. This time was no different, he put a lot of onions for one sandwich and barely any for the other, I didn't say anything because I don't like to complain. He made my sandwiches, then cut them wrapped them and put them aside. I figured he was waiting for the cashier to come ring me up, so I patiently waited. He began assisting the couple that had already ordered. (It appeared they were waiting for wings) I figured it would be just a minute or two and I would get my food, however that was not the case. I ended up waiting for over 7 minutes, the couples card declined 3 times. I decided I wasn't going to pay $25+ for two cold sandwiches that have been sitting there for about 10 minutes. \n\nMoney is tight so I haven't been able to indulge as much as I would like and I was really looking forward to a Hot Philly Cheese Steak sandwich. I think the employees really dropped the ball this time. If I'm paying around $12 a sandwich I want it hot. If you're helping someone else, that's fine I'll wait. I want my food hot off the grill.\n\nI want the old Grill Master back. The Philly was stuffed to the rim and there was bacon in every bite. I never once got cold food."
        }, 
        {
            "index": 231, 
            "rating": 1, 
            "review": "How do people think this is a real philly cheesesteak? The meat has NO FLAVOR, the mushrooms are clearly out of a can and taste gross and have no flavor at all. Its in a shady location but it does have a legacy behind it. Its cool that its open 24 hours but it tastes SO BAD so who cares?!. Tried the Italian ices and they tasted awful as well. Stay away from this place. Looks really dirty as well there are other places I would choose over this place for sure."
        }, 
        {
            "index": 232, 
            "rating": 5, 
            "review": "I came here at 3 in the morning after a long winning night in Vegas. And I wasn't done winning yet!\n\nThis is hands down the best cheesesteak I've had outside of Philly. The rolls were fresh, the steak was juicy and delicious and the cheese was near perfect. I paired this with cheese fries that disappeared in mere seconds. \n\nIt's a drive off the strip but I highly, highly recommend it to anyone craving a real cheesesteak in Vegas."
        }, 
        {
            "index": 233, 
            "rating": 2, 
            "review": "Went here in January. Wasn't anything special and they were out of pastrami so I didn't get a sandwich. My hubby ordered a cheese-steak. It didn't appeal to me enough to beg a bite from him and I was really hungry.. I ended up ordering by phone from the Blue Nile restaurant (yummy Ethiopian food - great choice). I did have a few fries though. They were alright. Only went once and was not really impressed enough to try it again. There are far too many culinary delights in Vegas to waste time on the mediocre. You are not going to miss out if you skip this place for another random sandwich shop."
        }, 
        {
            "index": 234, 
            "rating": 4, 
            "review": "Best cheesesteak I've had, very good and nicely proportioned.  \n\nIt's been here since forever, so you know it is good if they are still around.  I usually order the cheese wiz with onions, even though I don't like onions, they are very sweet and tender.\n\nThey also have some of the best chili cheese fries I have had.  Give em a try and see if you agree.\n\nOnly bad thing is the fact that it is 100% outside, so if the super hot, crazy cold, windy, rainy, etc weather that we always seem to have, it's not a very good place for lunch or dinner.  But when the weather permits, have a philly!"
        }, 
        {
            "index": 235, 
            "rating": 4, 
            "review": "I am not experienced as to what makes a good Philly cheesesteak.  About all the ones I have had are lacking flavor for me, so I have never been a fan.  But the ones here are pretty good.  \n\nI would go here more if it wasn't in an area I loathe driving to, but that is probably a good thing as these are very bad for me.  This is another area of Vegas where I'm afraid to get out of my car.  The huge iron fences on the windows when you order from here says it all - this neighborhood is crap.\n\nDon't kill me people but, I am not a fan of the cheese whiz on these sandwiches, as I think it completely ruins the flavor.  But I am a fan of provolone.\n\nOne thing I should mention is that they had soft pretzels on the menu when we were there last time.  My husband, who orders soft pretzels pretty much everywhere he goes wanted one, and was informed him they took these off the menu, because no one really orders pretzels at a cheesesteak place.  They went in back anyhow and dug one up for him and warmed it up with some of the cheese wiz on the side.  Very cool of them to do that."
        }, 
        {
            "index": 236, 
            "rating": 4, 
            "review": "The closest thing to a Philly cheesesteak available in Las Vegas! It's very hard to find authentic cheesesteaks here, this is the place to get them. They are delicious! They also carry Tastykake products which takes you back to Philly. And the cheese wiz fries, yum!!"
        }, 
        {
            "index": 237, 
            "rating": 5, 
            "review": "we have been coming here for at least 12 years or more, and the cheesesteaks are always awesome. We come all the way from Henderson ( at least a 25 minute drive one way  just to eat here). Oooey, Gooey yummy ! very casual and simple eating area but we come for the food ! I think they are the best philly steaks in Vegas ! Give me that #2 with extra \"Whiz\" !!!!!! and the cheese fries, oh man, don't get me started... lol this is like my guilty pleasure! Of course ya cant eat here everyday, that would be like a heart attack waiting to happen, but once or twice a month is just right!!!! Love this place and sure wish they had a location in Henderson ! will keep coming back"
        }, 
        {
            "index": 238, 
            "rating": 4, 
            "review": "The Three Cheese Chili is good and one of the most expensive sandwiches on the menu. $9.99. Other favorites like pastrami chili cheese fries and Hogies are good.\n\nPlan on working out extra hard for at least 3 days after POPs. Other than that, sit back, relax, and rub your belly. This site is not Fat Free, and neither is POPs. Enjoy!"
        }, 
        {
            "index": 239, 
            "rating": 2, 
            "review": "Ordered fried mushrooms and okra for myself and hot wings and fries for my husband. \n\n*- Okra was really good but the mushrooms was horrible! It tasted as if the mushrooms were over-due or something. I also couldn't help but notice that everything wasn't freshly prepared. Everything was frozen until ordered. \n\n-* husband likes the wings and fries. I didn't get a chance to try any because I was so disgusted with the mushrooms. Made me lose my appetite."
        }, 
        {
            "index": 240, 
            "rating": 4, 
            "review": "This is the closest thing to an authentic Philly cheese steak that I've tried.\n\nI ordered the Cheese Whiz ($6.99) with grilled onions.  Lots of meat flavor with the grilled onions.  I think getting cheese is a must for these Philly steaks because without it, it would be very dry.  A little pricey but it is a big serving and could be hard to finish by yourself.  Also ordered french fries ($2).  They were the thick ones and they were okay, not great."
        }, 
        {
            "index": 241, 
            "rating": 1, 
            "review": "I came here expecting a hot and delicious Philly steak and received a chewy cold bread and cheese disaster. \n\nCold cheese whiz. Nasty food and service.\n\nand very over-priced!!!"
        }, 
        {
            "index": 242, 
            "rating": 3, 
            "review": "Way over-rated.  My boyfriend and I got two sandwiches, one regular and one whiz.  The meat is too salty and doesn't taste like anything special.  I did enjoy the whiz which is the only sandwich I recommend."
        }, 
        {
            "index": 243, 
            "rating": 3, 
            "review": "Sandwiches were good fries are ok. The banana foster was really good the service was a little slow but not to bad they didn't ask if I wanted something to drink if you like eating outside in the hundred degree weather then it's worth going for a lunch but don't expect anything special"
        }, 
        {
            "index": 244, 
            "rating": 4, 
            "review": "Okay well it's a friendly environment , open 24 hours and it has a lot of flies flying around. I don't suggest wearing a muscle shirt because I'm wearing a muscle shirt and it got into my bra which was gross so I gave my order to my dad and went to hide out in the car ."
        }, 
        {
            "index": 245, 
            "rating": 5, 
            "review": "No lie I come from all the way from Carson, California just to eat at this place so it should say a lot already.. But if you happen to come visit Vegas it's a must try and if you are a resident there's no reason why you haven't came by. \nI got the philly steak drooling over here lol but the meat is to tender and the cheese is just melted so perfectly, good job big guy behind the grill :)"
        }, 
        {
            "index": 246, 
            "rating": 2, 
            "review": "Placed a order for wings french fries and fried green beans . Got on route to my destination while enjoying my fried green beans which were up to par , crispy as preferred . Get to the chicken which i had half hot n half regular both were nice n fresh but were a tad on the salty side . While trying to enjoy my wings i go in to enjoy my nice fresh potatoes when i find \nThem to b  non existent in my bag . Very disappointing especially when i was CHARGED for something i did not receive not to mention who i believe to be the owner comes to the car and tells me my order is ready"
        }, 
        {
            "index": 247, 
            "rating": 5, 
            "review": "I was actually really impressed with this place.  After going out you know you want something delicious and this is a great spot.  The food is amazing I usually get the Cheese Wiz because let's face it when getting a Philly the only cheese you should put on it is Cheese Wiz.  The Fried Okra was amazing!!!! I haven't had that good of Fried Okra since I lived in Texas."
        }, 
        {
            "index": 248, 
            "rating": 5, 
            "review": "This place is amazing. I just submitted a recommendation to Diners, Drive-Ins & Dives. The Philly cheese steaks are the best you'll ever get. I recently read their website and have a new appreciation for their craft. The Amoroso bread is made in Philly, flash frozen and shipped within hours to PoP's. It's unique in many ways including the water used has a mineral content not found in Vegas and its baked at a lower altitude. It's delicious! \nThey take a ton of pride in their work and truly are the Pride of Philly."
        }, 
        {
            "index": 249, 
            "rating": 3, 
            "review": "Uhm... maybe I am slightly judgmental because I have been to Philly. I remember going to Pop's a few years ago, and thinking it was amazing. That was pre-Philly and pre-Philly Steakout.\n\nThe Steak:\n\nPop's is okay. I ordered the traditional with the whiz and onion. It was fresh. The bread was soft, but it wasn't anything to write home about. You can honestly buy meat from the butcher near the Meadows mall, and recreate something just as tasty yourself.\n\nThe Italian \"ice\":\n\nA total miss. I adore real Italian ice, which was my main reason for stopping by. This tasted like a masked popsicle. Such a disappointment!\n\nI would go back if I was in the area, but I'm sticking to Straight from Philly Steakout."
        }, 
        {
            "index": 250, 
            "rating": 5, 
            "review": "This is a \"go-to-place\"! You will find just the right food for your hunger. Tastee and lots of it!"
        }, 
        {
            "index": 251, 
            "rating": 4, 
            "review": "It was late and my wife and I wanted cheesesteaks and since pop's was open we deicided to try this place out. It is small and all outdoor seating but since it was a nice night it was not an issue. The food we ordered was not bad considering it was pre-cooked and just waiting to be used. It was kinda a turn off but since it tasted awesome, we overlooked that part. The portion they gave us was HUGE we could of easily split one but since I can put food away I was not complaining. Also the fried banana foster was not good so stay away unless you just want to try it"
        }, 
        {
            "index": 252, 
            "rating": 4, 
            "review": "Las Vegas hidden gem! Pop's is a mom and pop sandwich shop that serves top notch Philly cheese steaks and a plethora of other delicious grilled and fried foods. I recommend the bbq pork sandwich and fried zucchini. I don't live on that side of town, but whenever I am in the neighborhood I try to stop there. They are open 24 hours so stop by any time."
        }, 
        {
            "index": 253, 
            "rating": 2, 
            "review": "I ordered a beef and cheese sandwich, which was forgettable. It was beefy, but flavorless. Considering that I have spent time in the East Coast, this in no way resembles hot sandwiches out there. I also found it to be on the expensive side. Their sides look interesting, but will sample them only if I'm in the area, which is right off the Meadows Mall and the 95."
        }, 
        {
            "index": 254, 
            "rating": 5, 
            "review": "This place is amazing - the food always very good and the staff is always friendly- Never would look for a cheese steak elsewhere."
        }, 
        {
            "index": 255, 
            "rating": 4, 
            "review": "Pops hits the spot when you are craving greasy food at midnight.  Chili cheese fries are yummy!  Hit up this spot if you are in vegas!  Will def come again.  :)"
        }, 
        {
            "index": 256, 
            "rating": 4, 
            "review": "This place is amazing. As a second generation of Native from Sin City we have been eating here since what seems like forever. \n\nTheir cheesteaks are awesome! Meat, peppers, cheese etc are all artery clogging awesomeness! Only thing keeping this OG eatery from getting 5 stars is it is missing that fresh bread you expect from cheeseteaks on the east coast.\n\nSeveral opther maddening options on the menu as well...the pastrami chilli cheese fries will just haunt you in your sleep....that good.\n\nLove this place and will keep going back til I die. Hope fully not from an artery clogged heart attack."
        }, 
        {
            "index": 257, 
            "rating": 4, 
            "review": "This is the closest thing I've found to my favorite steak n cheese shop back home in Boston. The rolls are soft, steak is on point and they'll load it up with mushrooms and provolone for ya. Delicious. \n\nTip: stay away from the sides. Everything is frozen, then dropped into a fryer. Not yummy."
        }, 
        {
            "index": 258, 
            "rating": 4, 
            "review": "The Cheesesteak is the best in Vegas.  Outdoor seating only.  Go when the weather is nice."
        }, 
        {
            "index": 259, 
            "rating": 2, 
            "review": "I've been wanting to try this place for some time.  I was hoping for a truly legendary cheese steak experience.  Unfortunately I was more than a bit disappointed with flavor.  There are many more places to get a great cheese steak in the valley, and unless I'm in the area, I don't see a need to come back here.\n\nI got the Bacon and Swiss Cheese steak.  Everything should be better with bacon, right?  Not in this case, the bacon didn't add much flavor, and the swiss was definitely a mistake.  A good cheese steak always comes with whiz.  Provolone is acceptable but if you really want the flavor, the whiz is where it's at.  The steak itself was sliced perfectly and was melt in your mouth, except it lacked a flavor.  The sandwiches were nice sized for what you pay, but overall for someone who is just a Philly Steak place, it was a bit of a letdown.  \n\nThey have a lot of sides, and I can't comment on their flavors.  If you find yourself in the northern part of the west side, this place will more than meet your need for cheese steak at all hours of the night.\n\nThey do have a nice seating area, and they have misters for the heat."
        }, 
        {
            "index": 260, 
            "rating": 4, 
            "review": "The best Philly I've ever had and I am not a huge red meat fan.  The sandwiches are huge my 2 teenage boys have a hard time finishing these so who cares if they're a bit pricey.\nDang now I'm craving one!"
        }, 
        {
            "index": 261, 
            "rating": 4, 
            "review": "Yum. I like mine wit onions and whiz. Better than Tat's in Seattle which is a huge compliment."
        }, 
        {
            "index": 262, 
            "rating": 4, 
            "review": "The only authentic philly cheesesteak place in Vegas, simply because they have CheezWiz. Although the taste is sketchy sometimes, it's worth going out of your way for... and since it's DEAD CENTER WEST it's not really close to anything.\n\nI think it's be awesome (and cheaper) for them to use nacho cheese instead of cheez wiz. It's probably taste better too since it has a kick.\n\nBig Sloppy sandwiches just like I like them!"
        }, 
        {
            "index": 263, 
            "rating": 5, 
            "review": "Great place.  Will definitely be going back. Wrote a blog about it.  Check it out below\n\nhttp://delectablehideaway.blogspot.com/2016/05/pops-philly-steaks.html?spref=tw&m=1"
        }, 
        {
            "index": 264, 
            "rating": 3, 
            "review": "Well, I tried.\n\nI've lived in the Philadelphia area my entire life. I've eaten cheesesteaks at several different places, so I like to think I know what I'm talking about. I was looking forward to trying Pops, as many people have said they're the most authentic in the city.\n\nWell, they tried too, but unfortunately, it wasn't the experience I'm used to from Philly. The meat wasn't browned enough. The roll was somehow too soft, which is weird because they use the same Amoroso rolls that are used in Philly. And then the whiz.... they poured it on top of the meat. Travesty, I tell you. In Philly, they mix it in with the meat so that you have an equal bite of cheese to meat. I honestly didn't think it'd make much of a difference, but i had a ton of cheese in the bites I took from the top of the sandwich, and no cheese on the bottom of the sandwich. \n\nThey did have tastykakes though. That made me pretty happy. I also like how they're open 24 hours a day. I'll have to try one of their breakfast hoagies (incorrectly named by Pops as \"Breakfast Phillys\".... honestly, if you go into a sandwich shop in philly and ask for anything called  \"philly\", they will not know what you're talking about).\n\nSo why the three star review if I was dissatisfied? Well, I hate giving low reviews to perfectly good businesses. I'm sure what I ate was a great sandwich. For people from Vegas who want a good cheesesteak, this is a great option. For people from Philly who've had the real deal however, you may be a little disappointed that it doesn't taste like it's from back home."
        }, 
        {
            "index": 265, 
            "rating": 5, 
            "review": "Thisi is the best cheesteak place EVER! We see him set up shop every year at san genero as well and with all that other food around still end up buying from him!!!! #1 They have cheese whiz which alotta places dont Yumm the steak is always tender perfectly cooked. I have had almost every combination of sandwhich possible. They are just number one for me and my fiance, he proposed  on our 2nd anniversary there we go every year  for our little memorable meal together!!!!! Sweet potato frys are delicious we always get a double order of the mushrooms and the zuchinni is good as well. Definately a place to go if you want a really good cheese steak!!!!   O yea they have tasty cakes!!!!!!!!yummmmm!"
        }, 
        {
            "index": 266, 
            "rating": 5, 
            "review": "Great cheesesteaks and cheez whiz fries! Busy but worth the wait! You can make sure they get your order right because they make it right in front of you too. It's open 24 hours, so very convenient for great food anytime. Cheese fries are awesome and certainly don't lack on cheese. The meat is not fatty at all, and seasoned perfectly. Mozzarella sticks are also awesome and they have homemade ranch!"
        }, 
        {
            "index": 267, 
            "rating": 5, 
            "review": "I grew up in L.A. County, so there is an overwhelming amount of hole-in-the-walls/ mom n pop shops. Thats where my heart is. In summerlin, I don't see many of those but when I tried his place, I felt at home. Your typical sub sandwich and fried sides is quality worth every penny and brings comfort, and the food too. It's a walk-up shop with outdoor stool seating. The folks that work here are chill. Customers are able to watch the cooks do their thing. Seriously, they're diligent in making every sub just right. I've been here a few times and haven't had any disappointments. Try this place at least once."
        }, 
        {
            "index": 268, 
            "rating": 4, 
            "review": "This place is a 30 minute drive for us but well worth it. I knew the minute we drove into the parking lot that we hit the jackpot for a genuine PHILLY Steak with whiz and grilled onions. Bun super soft with a great taste which makes a the sandwich taste even better. Ordered a side of onion rings which had a buttery taste, very crisp and served with ranch dressing...Yumo! \nI'm already planning our next visit which will probably be next week. I think I will try PHILLY with grilled mushrooms/onions. They also serve Hoagies if your into that type of sandwich."
        }, 
        {
            "index": 269, 
            "rating": 5, 
            "review": "Pops make a good philly cheesteak but it would be alot better if he did not talk as much.  Pops doesnt look that innocent.  He looks like he been in a prison cell before."
        }, 
        {
            "index": 270, 
            "rating": 4, 
            "review": "The steaks were hot fresh and juicy. Your choice of cheese onions peppers and hot sauce. Next time I am trying the pork grinder. Good eating!"
        }, 
        {
            "index": 271, 
            "rating": 2, 
            "review": "If you want a good (and I mean GREAT) cheesesteak in Vegas, pass up Pops and land yourself at one of the many Capriotti's. I've had a few Cap's sammies ($8 medium cheesesteaks with mushrooms and peppers) - amazing. Drove by Pop's mid-Saturday. Was starving so decided to try it out. $10 later, I was bummed. The shrooms were canned and tasted like it. Yuk. The meat was dry. I had the provelone on top, still not a moist sammy. Wished it had been a Capriotti's. One star for being 24-hrs."
        }, 
        {
            "index": 272, 
            "rating": 4, 
            "review": "I've been here once.  It's a very good sandwich, but a little too much meat.  The seating options there are very limited and can get very crowded at lunchtime.  I will return, but not during busy time of day."
        }, 
        {
            "index": 273, 
            "rating": 5, 
            "review": "This place is the real deal. Makes me want to move to Las Vegas. Nothing in Southern California comes close. If your visiting Las Vegas make the drive to this place it will safisfy your cravings for cheesesteaks."
        }, 
        {
            "index": 274, 
            "rating": 4, 
            "review": "Cheesesteaks are so fab here. Get the sweet potato fries with the sauce - oh!!!"
        }, 
        {
            "index": 275, 
            "rating": 4, 
            "review": "Pop's make Philly Steaks like they do in Philly with Cheese Whiz!  I had a specific craving last week for a good Philly Cheese Steak sandwich so I Yelped and gladly found this place.\n\nI like my Philly Steaks with provolone cheese and the works; mushrooms, onions, and peppers.  This place did not disappoint.  The steak in these sandwiches are thick, and pack ina lot of flavor.  I was actually able to finish the entire thing in one sitting.  I love the french fries too.  This place has one of the best Philly Steaks I have ever tried.  \n\nThe only downside was that it was scorching hot outside when we came here to eat and we were sweating while trying to enjoy our food.  They also serve Italian shaved ice here to cool you off but we didn't try it..  Good idea though.  The oustide atmoshere is pretty chill and a different way to enjoy the Vegas environment in the neighborhood in which the place resides. \n\nIf you want a good, authentic Philly Steak sandwich, come to Pop's!"
        }, 
        {
            "index": 276, 
            "rating": 1, 
            "review": "FOOD= :(\nSTAFF= Not friendly \nPRICE= For the crap you get too much\n\n\nThis is no big deal. Go to the grocery store buy all the stuff and make it at home. 10 X better plus the people who work their are rude."
        }, 
        {
            "index": 277, 
            "rating": 4, 
            "review": "Solid if you are in the mood for a pretty legit Philly Cheesesteak.  I would recommend splitting the sandwich and never tell your doctor about this great meal.  I had the philly with wiz, onions and peppers.  Friendly staff too."
        }, 
        {
            "index": 278, 
            "rating": 4, 
            "review": "I like Pop's for the middle of the night munchies.  \n\nSteak with mushrooms and provolone is my usual, with a side of fries.\n\nFor some reason It's always really, really windy whenever I eat at Pop's.  I need to create an excel spreadsheet to find the correlation between barometric pressure and cheesesteak cravings."
        }, 
        {
            "index": 279, 
            "rating": 5, 
            "review": "Came out here for the weekend with my boyfriend we were starving and came across pops Philly's!!! Great service & great FOOODDD!!!!! very reasonable price! Daniel helped us out thanks again for your service you were great! Fersure we will be back , Our New Favorite hot spot :)) !!!"
        }, 
        {
            "index": 280, 
            "rating": 3, 
            "review": "Once upon a time, this place was a Straight From Philly Steakout. (Then again, once upon a time it was a Weinerschnitzel & then it was a Weanie Bender, but that's beside the point. :-D ) When it turned into Pop's, I wanted it to be as good as Philly Steakout, which I miss terribly. They largely kept the same menu, after all. However it is not quite as good. \nDon't get me wrong, it's still pretty decent. I still come here from time to time. And of course, middle of the night dining options are always good. However, the phillys aren't quite as tasty as their predecessor's. It seems like maybe they really love oregano. A lot. Like, really a lot. That appears to be the main flavoring that they use to distinguish themselves from other philly joints. Chicken phillys are better, not so over seasoned. I really want to love the cheese fries, but at least when I go there in the evenings the old, old fries are just thrown back in the fryer for you. Now I know that some places double-fry their fries. However, if you double-fry really old fries, you just get nasty over cooked & over greased fries. It's a consistent thing here. Perhaps during the daytime I'd have better luck w/ the fries. \nAlso, I've witnessed several times where people will go from money handling to directly touching food. Not a cool thing. Soo, yeah. Not terrible, but just ok."
        }, 
        {
            "index": 281, 
            "rating": 4, 
            "review": "This place is downright delicious.\n\nI was craving cheese steaks as soon as I came back from philly and this place came recommended as one of the best in las vegas.  It's the only cheese steak establishment I've ever seen in sin city so I thought I'd give it a try and I'm sure glad I did.\n\nIt's just a really good cheese steak.  That's all there is to it.  The bread is soft but not too soft.  The steak is cooked just like it would be in Philly and the toppings are plentiful and tasty.  There's also many different variations to choose from like the cheese, peppers, onions, and what kind of sauces you want on it.  I always go steak 'wit' provolone, peppers and onions.  Writing this review right now makes me want one.  I guess I'll have to settle for Philly's Best tonight, but that's another review."
        }, 
        {
            "index": 282, 
            "rating": 2, 
            "review": "I think I could have had a better philly sandwich at Capriotti's, a place that isn't even known for their philly sandwiches. \n\nWhile I do like fast service, getting served already cooked meat, onions, and mushrooms swimming in meat juice and reheated on the grill isn't what I was hoping for. Three distinct flavors that should all be tasted in a good philly, and everything tasted like the meat juice. I asked for American cheese and I think I was given provolone, on account that it was especially stringy for whatever reason. There was so much bread in comparison to the meat, onion, and mushrooms that was in the sandwich. \n\nThe frier was broke or being cleaned, so I couldn't get any fries or other side items to go with my sandwich.\n\nI always hear positive praise for this place, but for all the years I have occasionally bought food here, I have yet to have a good meal here that would make me understand the hype."
        }, 
        {
            "index": 283, 
            "rating": 4, 
            "review": "Pretty far off the strip but definitely hits the spot after a night of drinking and clubbing.  They are also open 24 hours.  \n\nPlenty of cheese steaks on the menu, made a variety of ways.  We tried the cheese whiz steak, provolone, american, the hoagie, 3 cheese and chili, the chicken steak, and the bbq pork grinder.  \n\nI personally liked the bbq pork grinder the most.  The bbq sauce was addicting.  Then the 3 cheese and chili cheese steak since it had so much flavor.  About 10 dollars per cheese steak so not the cheapest you can find but definitely worth the trip out here and cost."
        }, 
        {
            "index": 284, 
            "rating": 2, 
            "review": "I would give this one star - except it's one of the few Philly Cheesesteak places in town.  Meat was dry and underseasoned.  Bread was decent.  Just no reason to ever go back.  \n\nDon't know why you'd serve a sandwich with meat as dry as this."
        }, 
        {
            "index": 285, 
            "rating": 5, 
            "review": "This is \"fast food \"  Los Angeles style. I say L.A. because you see places like this\nall over... but what sets this apart from most is the food. Nothing mediocre\nabout it. The sandwiches are huge (enough for 2) and very tasty. The Italian was\nexcellent and would have done A -1 Imports in Long Beach,Ca. Proud. You can\nget \"bananas foster\". Deep fried string beans. I got this stuff home and opened the\nbags -- my sweeties ' eyes damn near popped out - the food is great looking but\ntastes even better than it looks -- that sandwich made me cry, for God's sake. I\nhonestly wiped tears from my eyes."
        }, 
        {
            "index": 286, 
            "rating": 3, 
            "review": "I do love going to this place and the quality of ingredients are good and are from Philadelphia.  I was there one day when the UPS guy showed up with the boxes of rolls from Amaroso's Bakery in Philadelphia.  My complaints are no indoor seating, which is a problem during the miserable Las Vegas Summers.  From May to September, you basically have to get it to go.  And it's not as good unless it's hot and fresh.  The person taking the order doesn't always get it right. Double check your orders before you leave.  And it is very pricey.  You'll pay over $15 for a sandwich, fries, and a drink.  But I guess you pay extra for the Philly imported ingredients.  The taste is good though and it is the best cheesesteak I've had outside of Philly.  I do like the fact that they are 24/7/365!"
        }, 
        {
            "index": 287, 
            "rating": 4, 
            "review": "Pop's. Can't miss the lightup signs at this location. Well this place is crazy busy or dead. I recommend going there at graveyard shift since half price sandwiches. Anyways, the phillys are good with them being decent size with juicy flavor and lots of fillings. The best thing on the menu is the potato fries and the dipping sause for them. So flavorful and make you want to come back for more. They're kinda pricy for what they are (4+$ for fries) but they make the meal. It's worth your time for a quick philly grab. \n\nPS: no indoor seating, there's a roof cover but if it's cold, you'll freeze and if it's extremely hot, you'll roast."
        }, 
        {
            "index": 288, 
            "rating": 5, 
            "review": "I have driven by here so many times so when a technician of mine asked to meet there I was happy to do so.  The only down side is the price $30.00 for 2 and that is sandwich and drink for each plus a 1$ tip.\nThe food to me was great I have not had much experience with steak subs but it was very good I will go back again sometime"
        }, 
        {
            "index": 289, 
            "rating": 5, 
            "review": "This place is AMAZING. They're always open and just have great tasting food. Defiantly one of my favorite places in Vegas."
        }, 
        {
            "index": 290, 
            "rating": 3, 
            "review": "Cheese steaks in multiple varrieties.  Not bad food but I thought it was a little pricey...a little over $11 for one cheese steak and a soda."
        }, 
        {
            "index": 291, 
            "rating": 3, 
            "review": "Pros- amoroso bread, size and franks soda.\nCons-  meat can be too salty, sometimes skimpy on the cheese and last visit out of black cherry soda."
        }, 
        {
            "index": 292, 
            "rating": 3, 
            "review": "The food is ok. The service is EXTREMELY SLOW!! The owners really should rethink how patrons are served one order at a time is very time consuming. Also i dont think the cashier should be handling food and money with no gloves! the cook should also be wearing gloves. very unsanitary!!"
        }, 
        {
            "index": 293, 
            "rating": 2, 
            "review": "I really wanted to like this place. And I really wanted a pastrami sandwich.  God knows I was craving since lunchtime. So dinner time came and I decided to pick 2 up for the wife and me. Well, the pastrami sandwich was as dry as the vegas air. NO MUSTARD, NO PICKLES and just a hard bread that felt was a few weeks past its fresh date. On top of all that, they were cheap on the meat too, which often most pastrami places over stack or give a good sizeable amount.  40 dollars, 2 sandwiches and 2 fries later wife and I were left very disappointed,  will not come back and I will not recommend this place to anyone I know. Just trash. Pass. Pass pass."
        }, 
        {
            "index": 294, 
            "rating": 2, 
            "review": "Well ok food...poor pops they need to upgrade dinning area or at least clean it. I saw a yelp reviewer mention that they refried old fries when she ordered I thought that was probably not true. Well I watched them do the same thing with my order...omg I had a bad taste I. My mouth the rest of the evening. I ordered Philly steak sandwich wich was ok. I won't be back for a while. Also greasy sweaty guy sweating on top of the food he's making. Just gross."
        }, 
        {
            "index": 295, 
            "rating": 4, 
            "review": "Pastrami on a long roll, filled with Pastrami, grilled onions, pickles and mustard. Yes! Not the best but getting there."
        }, 
        {
            "index": 296, 
            "rating": 4, 
            "review": "I've never been to philly so I can't actually say I've had a real Philly cheesesteak however I will say this is the best philly I have tasted so far. And the cheese fries are good too."
        }, 
        {
            "index": 297, 
            "rating": 2, 
            "review": "Not that great. I've had cheesesteaks in Philly several times and this does not compare. Not to mention the steak was dry because it had been cooking and sitting there for who knows how long. It wasn't horrible by any means but I don't think this place was worth the hype. Maybe we just went on a bad day I don't know, I would try it one more time but as of right now I was not impressed. They do not offer any sort of kid friendly menu such as hotdogs or something like that that was a downside for us as well.\n\nUPDATE:  after reading a message from someone at this establishment who was unhappy with my review, I likely WON'T give it a second try. Seriously, for you to say your demographic isn't children which is why you don't serve any kid friendly food is ridiculous! You are not a bar or a club, if you were I'd totally understand and would not have even mentioned lack of kids menu. This is a freakin sub shop... and FYI there are tons of families in the area and having a few simple items on the menu MIGHT boost your business!  Funny I saw high chairs at your restaurant ... WHY? you don't serve kid friendly food! Oh well.  Lesson learned."
        }, 
        {
            "index": 298, 
            "rating": 4, 
            "review": "They ship their bread in from Philly. It's real deal Amoroso rolls. Oh yeah, It's 24 hrs too. That's always a bonus. \n\nIt's not a restaurant, so expect to take-out, or eat at a small picnic table (outdoors), There's no indoor seating. Minus one star for that.\n\nIt's an authentic cheese steak. You won't be dissapointed!!!"
        }, 
        {
            "index": 299, 
            "rating": 5, 
            "review": "Pop's has been there for some time and while it looks it, don't let it scare you. Locals know they make a great authentic Philly Cheese steak. Some may think $9.99 is pricey but it's not for the size, amount of fillings and the flavor. They make it right in front of you and they have an awesome menu of variations and sides. It's patio dining which works best for evening and overnight dining. They do not have a drive thru but service is very fast. This location is 24 hrs which is a blessing for late night runs; I'm glad I moved back to this side of town. With their Philly's and wings, they have seriously changed my Sunday morning Football plans... I can dine in at home!"
        }, 
        {
            "index": 300, 
            "rating": 3, 
            "review": "I just picked up a prov. cheese and a prov. mushroom cheese. eeeh I totally had better. I don't agree with the review on cap and pops. I still think Cap. has better meat ratio cause my bun had so much room for more meat to be filled. And they said it exploded. NOT even close. \n\nSo I came here with a groupon pretty stoked that i get to try it again. Haven't been here in years. Before it was good. But I'm gonna say. NAW I've had better. and that would be Giamela's in L.A. or in Philly. They know what's up. We also ordered the fried green beans (yum), friend cheese stick (good), and fried zucchini (not bad) I'm sure all of them are from a box right? who knows. \n\nThe workers please smile. I know you love your job. Cause you have a job. The area was clean and the parking is cool. It was not crowded. So it was not busy."
        }, 
        {
            "index": 301, 
            "rating": 1, 
            "review": "this place has good food but horrible service, they do not write down the order, they do no repeat your order to make sure it is correct.  they make you wait in the heat till they are done with what they are doing. there very expensive for being fast food - they charge you for everything, they have no \"meals\" but they make you purchase the fries when you didn't ask for it...not fair that is why the place is empty, people will try it once and never go back!!!"
        }, 
        {
            "index": 302, 
            "rating": 5, 
            "review": "Love this place!! Delicious food, quick and easy.  loved #9 and the onion rings were one of a kind!!"
        }, 
        {
            "index": 303, 
            "rating": 3, 
            "review": "*sigh*  I really wanted to love this, but it was just ok.  After reading all the positive yelps and testimonials on Pop's website, I was expecting a fun and delicious experience.  I imagined myself giving my order to a gruff but charming grill master, who would ask me 'wit' onions? in an authentic Philly accent.  What I really got was a grill master who was just gruff and apparently couldn't hear my order, because when I got my cheese steak home, there were no onions on it at all!   \n\nOk, the cheese steak itself:  the meat was not fatty or greasy, but slightly bland.  I enjoyed the cheese whiz and the bread was very good.  I think if they had included the onions, things would have been tastier.  Also, in the hours since eating the steak, I have been a bit 'indisposed', but this in and of itself has never been an index of whether I would return to a place if the food tastes good.  (masochist!)\n\nSo all in all, I think I would try it again probably.  But I'll also try their competition in town and yelp the results.  :)"
        }, 
        {
            "index": 304, 
            "rating": 4, 
            "review": "Go to Pops for the best Philly Cheese sandwich in Las Vegas. Pop's uses high quality beef and the freshest buns. A variety of toppings, onions, hot or sweet peppers and a selection of cheeses are available. \nOrdering and food pick up is done at the counter window. Only outdoor seating is available with a few tables under the covered patio."
        }, 
        {
            "index": 305, 
            "rating": 3, 
            "review": "Just OK.Use to be much better.Philly steak is unseasoned, however  I do like the pastrami fries. Over priced for not being one of the best tasting philly steak joints."
        }, 
        {
            "index": 306, 
            "rating": 4, 
            "review": "I love Pop's! The cheese whiz is what I order with extra whiz and provolone (yep it is cheeeeeeezzzy) and onion. I am never disappointed. \n\nI love that they have \"wise\" chips as well.\n\nMy husband can eat a whole sandwich and be satisfied I personally can only eat half then save the other half for later it is well worth the money. This last visit was nice because there was no line! Sometimes there is a line but it moves real quick. \n\nI recommend it to anybody that loves cheese steaks and all who think they don't.\nIt is on a old school original A-frame wiener schnitzel and if it is your first time you can drive through the middle of the \"A\" but don't think there is a drive-thru to order food it is simply a place to get you back on the road you must park in the lot and walk up to the window.\n\nThe \"Mozzarella Sticks\" and \"Cheese Whiz Fries\" are super yummy.\n\nYou can sign up for their e-club and get coupons and deals.\n\nI have seen that they now have a food truck as well at a couple food truck events so give it a try!"
        }, 
        {
            "index": 307, 
            "rating": 5, 
            "review": "I'mma give it a 5-star because the sandwich was pretty filling...the rest is subjective.  I prefer my philly steak sandwiches to have a garlic mayo, noticeable slices of onion and bell peppers and mushroom.\nI got a #4 which is the steak with provolone cheese.  size was good and steak portion was great, so was the steak flavor.  I didn't see too many noticeable onions though since it was pre-sautéed and mixed in.  just the sandwich was $10.80 after tax.  meh, I'd say it was worth it.  I am not a fan of cheez whiz, which there seemed to be a lot of varieties of items using it, but at least it is Kraft brand.\nOh well, take it as you will.  I would recommend this place though."
        }, 
        {
            "index": 308, 
            "rating": 4, 
            "review": "the best Philly Cheese steak in LAS VEGAS. .My husband and I have been acouple of times always great service and great food..  it is small and outside dinning only but  it adds to the   feeling of being in Philly @ Pats or Ginos   there a wide variety and low prices love it"
        }, 
        {
            "index": 309, 
            "rating": 3, 
            "review": "Solid 3 1/2 stars!\n\nI suppose Pop's is a bit of an institution here in LV, probably one of the oldest places here where you can get a Philly cheese steak.  Hard to believe that I work less than 5 minutes away from here!  I can now come here whenever I want for some steak!\n\nI probably would have given a 4 star if I had just stuck with their mantra...any of their famous steak sandwiches.  Possibly some fries.  We kinda did a detour by ordering things you wouldn't ordinarily get at a Philly cheese steak place so that took it down a notch.\n\nCame here on a late night (probably the best times for one of these) and wouldn't you know, Pop's was hoppin'.  Parking lot was full!  We had no problem waiting in line though, goes pretty quick.  Wifey and I ordered:\n\n*#4 - Provolone Cheese Steak ($9.99)\n*#35 - Pork Bar-B-Que ($9.99)\n*Fried Okra ($3.95)\n\nBut of course, best thing we had was the Provolone Cheese Steak!  Roll was light but still fresh tasting, there was a lot of meat & cheese in this sucker!  Oiliness galore!  Just like it probably should be.  Fat = FLAVOR!  Meat was seasoned well and was the focus of the sandwich.  Basically meat, cheese, bread.  Pretty damn delicious cheese steak.\n\nTook away a star though for the rest of our order.  The Pork Bar-B-Que sandwich they said is an award winner but I just didn't like it that much.  The pork was overly stringy, but the sauce?  It was wayyyyy too sweet!  Like almost sickly sweet!  I was looking for more tang or bite to the sauce.  But the sweet was just too overpowering.  Really not on my want list.\n\nThe fried okra was OK, it was just really fried okra.  A little bland but fried fresh, could have used a bit more seasoning.  Plus it didn't really go well with our sandwiches so it was kind of forgettable.\n\nPrices are fairly reasonable, but man paying nearly $10 for a sandwich gets to me for some reason - I guess it's because we have so much cheap food in town.  I mean come on, I can go downtown to get a prime rib dinner with sides, salad bar & dessert for the same price!  But thankfully Pop's cheese steak is tasty.\n\nI'll be a regular at Pop's especially during my lunch days at work.  But I'll just go for a steak sandwich from now on!\n\n#sweetmeat"
        }, 
        {
            "index": 310, 
            "rating": 3, 
            "review": "I'm not sure how many stars to give this place.  I enjoyed the employees they were very pleasant but the food was very average.  Not the worst cheesesteaks I've ever had but in the bottom 5.  Not enough cheese or flavor.  At $10 it's way too expensive for extremely average food."
        }, 
        {
            "index": 311, 
            "rating": 2, 
            "review": "Not a real Philly Cheesesteak!\nWent there with high expectations because any place that claims to have Philly Cheesesteak better know how to make a Philly Cheesesteak.  Not here.  Being a native Pennsylvanian and growing up on REAL Philly Cheesesteaks, this was a big disappointment.  Meat was not cooked to order on the grill, instead, probably cooked the night before( or worse) , put in a big pot and then simply re-heated on the grill when orders placed.  This process allows meat to sit in its own juice making the bread extra soggy.  So soggy that you can't pick up the sandwich with your hands.  He gives you a fork to eat it.  WHAT??  The meat had absolutely no flavor, very bland and chewy.  There is a reason that people stand in line in Philly to get a real sandwich and they don't mind the long wait because they know it will be the real deal.  Pulling meat out of a pot is not acceptable to call yourself a Philly Cheesesteak.  For all those leaving good reviews, well, I guess if you haven't had a real one, you just don't know any better."
        }, 
        {
            "index": 312, 
            "rating": 1, 
            "review": "this place has sandwiches that are overpriced and is drowned in cheese whiz. my husband I went here and we were so excited I cannot believe we paid $20 for two sandwiches we barely got any meat we really just got cheese whiz on bread. poor excuse for Philly cheese steak sandwich. we will never come here again if I could give it zero stars I would."
        }, 
        {
            "index": 313, 
            "rating": 3, 
            "review": "Came here around 5:45 and it was steadily busy. We ordered a #6 mushroom cheesesteak with cheese whiz and sweet potato fries. They were getting a bit busy and overwhelmed so customer service was okay. Food came out hot and fast! It was a fine experience, nothing crazy."
        }, 
        {
            "index": 314, 
            "rating": 3, 
            "review": "Was craving cheesesteaks ... Heard about pops ... Decided to try it out ... The line wasn't long kinda confusing were to order and watch people wanted to watch the cook and he couldn't take other people's orders ... Mind u he cooks and the lady serves u the food and drinks ..\n\nI've been to philly lots of times love their cheesesteaks ... Pops was salty as heck ..."
        }, 
        {
            "index": 315, 
            "rating": 4, 
            "review": "im born n raised in vegas, had a few different philly steak places out here and pops by far is tha best ive had. a lil pricy but when its prepared right, when the meat outweighs tha bun, tha flavors n juices of the marinated steak drench out from each bite, then tha price is worth it!!! 24 hrs, one of tha only spots in vegas that doesnt have a drive thru, its pretty classic. i always get tha chili cheese steak sandwich, hella good!!!"
        }, 
        {
            "index": 316, 
            "rating": 3, 
            "review": "Got the chili cheese fries which were pretty darn good. Boyfriend and I got the provolone and steak sandwiches. The meat had no flavor and pretty much sucked. I'm thinking it would have tasted better with the cheese wiz because the cheese had yummy flavor to it. Definitely was on the pricey side for a sandwich."
        }, 
        {
            "index": 317, 
            "rating": 4, 
            "review": "Not bad at all. I love the cheese steaks from my favorite place in Rhode Island, but I will settle for Pop's. They did a great job seasoning the meat. Some places forget to season the meat. It's so good. Perfect amount of meat and cheese. The bread...absolutely yummy. I'll be coming back when I get a craving."
        }, 
        {
            "index": 318, 
            "rating": 3, 
            "review": "Yum-skiddley-umptious!\n\nWe ordered to go because it was too hot to sit in their outdoor seating.  Ate in the car.  The philly cheese steaks were great, cooked fresh, bread and meat all very tastey.  But the sweet potatoe fries were soggy and mostly just batter (might be the way they wrapped a paper around it, and steam was trapped).\n\nGreat for the phillys, not so much on the fries, and a downer for me to not have indoor air conditioned seating (we are in the desert people)"
        }, 
        {
            "index": 319, 
            "rating": 4, 
            "review": "Excellent bread, excellent LEAN meat (I hate it when I get a disgusting piece of fat in there...none to be found at Pop's!), and the same traditional toppings as you'll find at Pat's or Geno's right in the city of brotherly love.\nI love that there is no indoor seating (it's in an old Wienerschnitzel building) because it adds to the character and uniqueness of the place, which I am always on the look out for.\nThe sides are not the best or the cheapest, but hey, you came here for the sandwich."
        }, 
        {
            "index": 320, 
            "rating": 5, 
            "review": "ooooh myy goodness..  This is THE BEST Steak and Cheese my husband and I have ever had.. Seriously.. it's an off the strip joint that has high top tables and stools reminiscent of the the 50's .. you can hear and feel the whipping air of cars and tour buses flying down the street.. walk up to the window, order from a board and watch your scrumptious creation being made before your eyes.  Talk about Mouthgasm at first and Last bite.. I said to Michael.. $9.95 for a Steak and Cheese?  I hope it's good.. I couldn't finish Half of mine.. the meat was piled High and so tender and well seasoned.. I had mine with the original cheez whiz!   Michael, who considers himself to be a Steak and cheese snob.. couldn't stop raving.. and believe me.. it's well worth the trip.. top it off with Fries that were nom nom nommy and Root beer.. well it was a couple of happy New Las Vegans  lololol   Vegans in name only ~!!!"
        }, 
        {
            "index": 321, 
            "rating": 3, 
            "review": "Forever curious about Pop's, the sun and moon aligned for me to give a shot during a recent lunch break.  Off course it was almost triple digits outside and the thought of eating in the swelter of the day was out of the question.  My order was pretty basic.  It consisted of steak, chez wiz, mushrooms and a pretty tasty bun.  It was a treat so I did not have to pay.  All in all, it was decent sandwich but nothing I would seek out during the dog days of August OR at 3:30AM on the corner of Decatur and Alta."
        }, 
        {
            "index": 322, 
            "rating": 4, 
            "review": "I've never been to Philly, but if their cheesesteaks are better than these... man, I need to book a flight. \n\nThe food is good here. The cheesesteaks are filling, have a ton of food, and are perfectly complemented by their fries. \n\nMy only issue with them as that I feel like I overpay a little there. I know it's good food, but it's a cheesesteak! I think I paid like $13 last time I was there for my food. It's obviously not a ton of money, but I don't feel the place/food matches the cost. \n\nStill, though, it's good food. And they prep it super quick."
        }, 
        {
            "index": 323, 
            "rating": 5, 
            "review": "Pop's is 'as good as it gets' when it comes to Philly cheesesteaks in Vegas. One of the main reasons I gave it 5 stars was because they use real whiz! It's underrated and great big portions for a reasonable price. The closest thing to a REAL Philly Cheesesteak that I've tasted in Vegas."
        }, 
        {
            "index": 324, 
            "rating": 3, 
            "review": "What the heck I thought food in Vegas was supposed to be dirt cheap. If you can get a steak and eggs meal for under $5 it puts Pop's $8-10 sandwichs into perspective. Sides are expensive too at $4 for an In-N-Out sized paper tray! =/\n\nThe did have variety on sides you can get cheez wheels, deep fried zucchini and deep fried okra. The side of sweet potato fries I ate wasn't bad at all, had good crunch (the number one thing I look for in a fry) and natural sweet potato flavor. The flavor was enhanced even further with this syrup dipping sauce that had a hint of cinnamon. =) \n\nI don't get how people can eat Cheez Whiz it's so processed it can't even be called cheese! I just didn't grow up with it, but apparently it's THE topping to get for Philly Cheesesteaks. You can even get a side of fries slathered with it here. \n\nThis location was most likely converted from a Wienerschnitzel since it had the signature triangle roofline and drive-thru. The covered seating provided sheltered for our group when we experienced a spontaneous downpour during lunch. I enjoyed the mural of Benjamin Franklin affably holding a Philly Cheesesteak, just drives the point home that what is in his hand is indeed a Philly Cheesesteak and if you don't order one here you are un-patriotic! =p"
        }, 
        {
            "index": 325, 
            "rating": 4, 
            "review": "Good food. Had the cheese steak with wiz and onions. A lot of food and close in taste to Philly with only the bun kind of throwing it off. Not a bad taste but you can tell bread not from east coast. Stop by it'll be worth it."
        }, 
        {
            "index": 326, 
            "rating": 4, 
            "review": "Ever had a random convo about food with a random person in a bar? Well, this is where my convo ended up. \n\nSitting at It's a Grind coffee shop on desert inn and durango at 3am, a couple stumbles in, orders, and bumps into me. As a rather \"fluffy\" guy, they asked if I knew anywhere for food and open late. I suggested Porchlight behind of the coffee shop, Girl 1 says I wants fried cheese, Girl 2 said steak and onions, I say \"cheesesteak perhaps?\" The couple then proceeds to say, \"Follow us!!\" I seriously got a little scared on the way there, kind of out of my comfort zone of West Vegas...but I'm here to say, TOTALLY WORTH IT!!!\n\nI ordered a regular cheesesteak with onions, half provolone, half cheese whiz, peppers, and onion rings as a side. SO GREAT, best cheesesteak i've ever had. Other notables are the fried zucchini, fried cheese, and hot wings. The menu is huge so take your time. I was rushed because the couple assumed I've been here before, put me in the front of the line.  Service was excellent, cook laughed at the randomness of our story.\n\nGet out there and try a TRUE philly. So great."
        }, 
        {
            "index": 327, 
            "rating": 5, 
            "review": "Delicious!  Best phillysteak EVER!  Good was easy to order and quick with great service as well. Will definitely be coming back!"
        }, 
        {
            "index": 328, 
            "rating": 5, 
            "review": "They're just the best. Try the Banana's Foster! The food is really greasy, but that's how you know it's good!"
        }, 
        {
            "index": 329, 
            "rating": 4, 
            "review": "Not usually my area of town but when I had a chance to visit I made this a must. Love the fact that this place is 24 hrs. Throwback to a better time when everything wasn't go go go. Got myself the traditional Philly while my son got one with bacon. Bacon? I mean I love bacon but not on a cheesesteak. He loved his and I was impressed with mine. Quick service and very accommodating. Will definitely make this a go to when I'm on this side of town again."
        }, 
        {
            "index": 330, 
            "rating": 5, 
            "review": "Loved the delicious food and the atmosphere. I'm told it's completely authentic but having never been to Philly I can't say for sure.\n\nEmployees are SUPER nice. They gave me some boiling water so I could heat up my sons bottle. Happy customers!"
        }, 
        {
            "index": 331, 
            "rating": 1, 
            "review": "I ate here before but will never eat here again. \n\nI should also note that my previous Yelp review of Pop's had been requested from Pop's! For a reward of  'FREE french fries' in which they did accept but that's just like cheating in my opinion. Where's the yelping officials on this one?\n\nAfter working on the pops cheese steak truck for one day I realized this is not a steak and cheese at all. It's frozen meat \"NOT FRESH\" and they precook lots of that frozen meat and let it sit in water until ready to reheat for you to eat.  sound good I think not. \n\nI won't get started on the sanitation of this place, pop's and pop's cheese steak truck must have it easy with the heatlh department because I don't even think he has soap on the truck for washing hands. \n\nIf I were you and looking for a steak and cheese I would look up other alternatives like some of these new food trucks around town like the \"Yellow Lunch Box Truck\" or \"Food Slingers\" in which they both serve fresh meat and it's even fresh rib eye. For a lower price as well. \n\nThe Vegas Villain"
        }, 
        {
            "index": 332, 
            "rating": 1, 
            "review": "This place is the worst the service is terrible they won't tell you what comes on the sandwhiches with out being rude and the food has no taste I just got a philly and took one tasteless bite and threw it away I would rather be hungry and waste 11.00 on anything else"
        }, 
        {
            "index": 333, 
            "rating": 1, 
            "review": "We used to come here a lot. I like their taco salad and their sandwiches. One day my girlfriend got brave and tried a Philly cheese steak. She doesn't typically like cheese steak sandwiches. Her mom also got a cheese steak, but I went for a BBQ pork sandwich. Later that night they both got up and went to different bathrooms and threw up. My girlfriend was up every hour throwing up. We can only assume it was food poisoning. It was the only thing they both had eaten that was the same. They were sick for three days with it. Never eating here again."
        }, 
        {
            "index": 334, 
            "rating": 4, 
            "review": "Great Philly's and sandwiches. Ever since it changed over names, possible ownership, it seems to take quite a while to get an order in and the sandwich out if there is at all a crowd, 5 - 6 in line, give yourself a good 30 minutes to order and get your food. Service always seems good."
        }, 
        {
            "index": 335, 
            "rating": 5, 
            "review": "I love love love Pop's. The best cheese steaks you can find in Las Vegas. I have never been disappointed eating  here. The cheese whiz is so amazing. I also love their chili. The helpings are so big. So much meat is on these phillys. Pop's YUM."
        }, 
        {
            "index": 336, 
            "rating": 4, 
            "review": "I've never had an original Philadelphia philly but I've loved all the prepared imitations I've had along the way. I was looking for a post-workout meal ( some Phillies can be quite nutritious depending on what you pile on) and this place came up on yelp. \n\nThe first thing I noticed was the large helping of steak Pop's puts on their sandwich (hello protein), I had to look more. Then I saw they serve sweet potato fries... Then I was sold. \n\nThe philly I ordered was a #32 which was a 9\" philly served with about 5 oz. o strip steak, onions, bell peppers, red peppers, your choice of cheese, and mushrooms (I didn't get the mushrooms)\n\nI also got an order of sweet potato fries with their cinnamon for sauce ( I didn't care for the sauce)\n\nWell I calculated the nutritional information for my meal and it was as follows:\nPhilly Cheesesteak Sandwich \nCal 414\n  Protein 30g\n  Carbs 36g\n   Fat 15g\n\nSweet Potato Fries (3 oz.) full portion is about (5 oz.)\nCal 150\n  Protein 2\n  Fat 10\n   Carb 24"
        }, 
        {
            "index": 337, 
            "rating": 4, 
            "review": "It's hard to find a great steak wit-whiz, but these guys deliver.  Quick, greasy, delicious.  The rolls are soft and remind of the bread you find at Jim's or Pat's in Philly.  The steak is tasty but not too salty.  The whiz is hot and plentiful.  The onions are caramelized and delicate.  Solid grillwork.  \n\nThe fries were OK.  Could be a little crunchier but they make great vehicles for more whiz!"
        }, 
        {
            "index": 338, 
            "rating": 5, 
            "review": "I've been coming here for about 7 years now and frankly not a lot has changed & that's exactly why I love this philly joint. I always get the #32 and as always leave home stuffed and happy. The customer service is phenomenal and I always receive a nice warm smile from the cook and cashier which is hard to come by these days. Love this place great Phillies and even better customer service!"
        }, 
        {
            "index": 339, 
            "rating": 5, 
            "review": "A friend in Vegas brought us here and ever since, we always come back for more when we come to Vegas.  My husband loves this place.  \n\nComing late at night is kinda scary but we always come no matter what.  So good and yummy... Can't say no to POP's!!"
        }, 
        {
            "index": 340, 
            "rating": 4, 
            "review": "Pop's Philly Steaks makes the best cheesesteak sandwich I have ever had. I love the meat. I love the cheese whiz. I love the bread. I love the grilled onions. SOOO YUMMY!!! If you are ever in town, you definitely have to stop by. I didn't give it 5 stars because it's outdoors so it's kind of inconvenient on a windy day and the sides are good, but not amazing. Despite those things, I'll be back to try other sandwiches anyways!!!"
        }, 
        {
            "index": 341, 
            "rating": 1, 
            "review": "Terrible service.  Staff was more worried about showing how much they didn't care than they were about taking an order. As we ordered the cook walked away, so of course he got the order wrong. Half of what we ordered wasn't given to us and then when we asked for our food we got an attitude. I decided to leave with nothing to eat. Heard for many years about how great the food here is. I wouldn't know and I never will. I recommend you stay far away. Staff doesn't give a sh!t"
        }, 
        {
            "index": 342, 
            "rating": 4, 
            "review": "When my family moved from Maine to Las Vegas we needed something filling and not out of a bag. We drove by and though what the heck let's try it. They are on the pricy side but it was well worth it. The sandwiches were flavorful and the staff were very friendly."
        }, 
        {
            "index": 343, 
            "rating": 1, 
            "review": "Ever been to Philly and gotten the real thing? Then don't come here. I don't go out of my way to leave bad reviews but I will literally never come back here, lol"
        }, 
        {
            "index": 344, 
            "rating": 4, 
            "review": "This place is freakin' great! I made mine a chicken philly and my hubby had a classic steak philly with provolone, bell pepper and mushrooms. The classic Philly is a 32 on the menu. The sandwiches were so good. Both the sandwiches were freshly prepared and tasted great because the chicken was thinly sliced. \n\nNext time I'm going to ask for extra cheese though. One slice isn't enough for all the delicious meat. Also the sandwich is amazing with onions, so be sure to request them with your sandwich!\n\nAlso I loved the fried okra! I would have never thought of dippin okra in ranch, but it was the perfect accompaniment.\n\nLastly, and most importantly, the grill master Steve was sooo nice and personable! \n\nThe only draw back and thus the 4/5 was the price. 11 dollars for a sandwich is pricey!\n\nThis place has great food and service; I NEED one in Los Angeles."
        }, 
        {
            "index": 345, 
            "rating": 5, 
            "review": "Pops is amazing!!!\nI've been going there since 2001 when they took the establishment over n began doing Phillies the way they should be done\nI'm n east coast native n maybe not n expert but i do know a good sandwich when i eat one\nThe manager Mike is a special kind of person he really goes out of his way to make the customers feel at home n taken care of\nU can even find him on the grill certain days \nPops is a must try!!!\nThere sandwiches are like potato chips u can't stop at one n u will surely be back for another as well as telling ur friends\nIf ur from the east coast n u haven't been able to get ur fix.......\nGREAT place"
        }, 
        {
            "index": 346, 
            "rating": 3, 
            "review": "This place has really awesome pastrami sandwiches and deep fried green beans +  they're open 24hrs! Nice late night meal :)"
        }, 
        {
            "index": 347, 
            "rating": 4, 
            "review": "First time here in almost 10 years. Sammiches are still huge and easily shared by two. Freshly cooked fries are good but most folks seem to go for the sweet potato variety. \n\nFall is the perfect time to drop by and sit outside. But grabbing to go is good as well. Be sure to grab extra napkins!"
        }, 
        {
            "index": 348, 
            "rating": 4, 
            "review": "First off its EXPENSIVE! \n\nThe man making the sandwiches gave me a funny look when I asked for JUST turkey cheese and bacon. I don't like condiments and I don't like vegetables. But he hooked me up on the #36. It was delicious, but was. It worth $12.00??? UM, NO!  Adding bacon costs $2.00. Ridiculous.\n\nThis place also advertises bananas foster. I was expecting some deep fried banana caramel goodness but...it tasted like deep fried cheesecake bites...in fact I know it was. Somebody has to fix that, either fix the menu or fix the product ordering.\n\nIt's open 24 hours but I assume if you go here at 3 AM you are drunk...and this is pretty pricey for \"drunk food\".  My life partner and I shelled out almost $32.00 for two hoagies, two drinks, fries and fried cheesecake AKA BANANA FOSTER bites.  We agreed if the hoagies were $7.99 instead of $9.99 (not including extras) the pricing would be spot on."
        }, 
        {
            "index": 349, 
            "rating": 4, 
            "review": "Being from Pennsylvania, I was a little skeptical at how it would be. I got the number 2. The cheez whiz. With onions and mushrooms. I like the way is set up. You order directly from the cook through a screen above the flat top grill. That way you can tell him exactly what you want. Meat was decent and veggies fresh. Friendly cashier and courteous. \n\nI liked it. I'm sure I will be back again to get my Philly on"
        }, 
        {
            "index": 350, 
            "rating": 5, 
            "review": "Soooooo excited!!! Went here for the first time yesterday and had a delicious cheez wiz steak just like back home!!!! Thank you Pops for having delicious steaks and the bread I'm used to toooo, I miss good bread and you have it all!! The cheese steaks and cheese fries are the bomb!!! My husband and I will be there all the time now!!!"
        }, 
        {
            "index": 351, 
            "rating": 1, 
            "review": "In the worst of times people often think of the best of times.  Rex is no exception.  Gather around kids and let Uncle Rex tell you a story...when Rex was a small child he spent many a month on the East Coast. It was a magical time.  My father, who beat young Rex mercilessly if Rex called him anything but \"The Future Husband of the Multi Talented Pia Zadora\", was originally from the Northeast.  My father was an odd man, a brutal man, a man with big dreams and small child like hands.  On my fifth birthday he brought Rex with him as he knocked over a 7-11.  As Rex helped him tie up the store clerk he let me pick any one thing Rex wanted in the store.  Young Rex wandered around the store, trying very hard to not step in the pools of blood, Rex saw the object he wanted...Rex turned and said \"Future Husband of the Multi Talented Pia Zadora can Rex have THAT?\"  He nodded.  Rex kicked the 87 year old man laying on some of it...and picked it up. It was a bag with a delicious cheesesteak in it.  Rex danced. Rex smiled. Rex took the wallet of a crying soccer dad.  Rex was happy.  Rex and Future Husband of the Multi Talented Pia Zadora drove down the street, the sound of sirens in the distance fading...the smell of the cheesesteak wafting into Rex's young nasal passages.  A great cheesesteak is a gift from above.  A wallet filled with 20 dollar bills and an unused condom...icing on the cake.  After we divided the ill gotten booty, Future Husband of the Multi Talented Pia Zadora always took 70% (until I turned 9...but that is another story)...Rex ate his cheesesteak.  Perfect bread. Juicy shredded meat. Perfectly cooked onions. The right amount of whiz. Juice ran down Rex's chin. Juice ran down Rex's hands. Rex shook in delight. That memory, and the 8 months Rex spent on the run after Future Husband of the Multi Talented Pia Zadora ratted him out...will always be with him.\n\nPops Philly Cheesesteak is not only an insult to that memory it is an insult to all things with meat, cheese, bread or even hot foods.  The front page of the their website has a picture of their pitiful attempt of a cheeesteak...one of one of their abominations has green pepper on it. GREEN PEPPER!!  Let me explain something to all of you who are not from Philly...IF there was a place in Philadelphia that put green bell peppers on their cheeseteak...THE CITIZENS WOULD BURN IT DOWN!!!  It is ABSOLUTLEY 100% NOT ALLOWED IN ANY PLACE IN PHILADELPHIA!! Even if asked they WILL NOT DO IT!  So, first and foremost this is NOT A PHILLY CHEESESTEAK PLACE!!! IT IS NOT! END OF STORY!\n\nApologies. Rex passed out and needed a shot of \"Happy Serum\" to get up right again...what is \"Happy Serum\" you ask...heathen...it is 1 part gasoline, 1 part peach schnapps, 1 part wiper fluid. \n\nAnyway, now that we have established this is not a Philly cheesesteak, let's talk about it from a cheesesteak on it's own merits.  First, the rolls are good, the sad part is you can tell the bread is shipped frozen or frozen after it gets to Pops.  Big mistake. It really messes with the bread. It isn't bad, but again it isn't East Coast good.  Cheese...never enough. Never. If you get provolone instead of whiz it is almost non-existent. Shame on you for skimping on the cheese.  The Whiz isn't bad sometimes but more often than not there isn't enough.  The meat isn't bad. It is done well, with one BIG problem...it is often dry. Not enough oil or cooked and then recooked, whatever the reason it is not great.  If you get to Pops on the right day and get lucky, and order correctly, it isn't bad...but the overall consistency is not there.\n\nLastly...the \"Philly\" part of the menu...the Tastycakes, the birch beer, the rest of it...all WAY TOO EXPENSIVE! At Glaziers Market you can get all the stuff for 1/5th of the price.  \n\nHere is my biggest problem...Pop's plays on East Coast memories and locals who don't know any better. That is the biggest crime. It isn't Philly. It isn't a great cheesesteak. It is over priced. It is inconsistent. It just isn't right. It just isn't good.  Most of you will never know better unless you go back east (and my next review for Pizza will tell you how to find GREAT east coast food), and they KNOW you don't know. Pop's has been a place I have tried off and on for almost 8 years.  Rex wants to love it. Rex needs to keep trying every 2 years or so...but much like when his father turned him into the cops at the tender age of 5...Rex is always hurt by Pops. Future Husband of the Multi Talented Pia Zadora and Pops...shame on you...you know better. Rex knows better. Rex deserves better. So does everyone else."
        }, 
        {
            "index": 352, 
            "rating": 4, 
            "review": "Great hot sandwiches the cook makes it right in front of you. Best hot sandwiches I've had in Las vegas so far!!"
        }, 
        {
            "index": 353, 
            "rating": 1, 
            "review": "Terrible customer service from the large man behind the counter! \nI drove in at around 9:30 to get one of the sandwiches, that they are currently promoting on a couple of large scale banners hanging out side of their establishment. I thought what a good deal for a sandwich only 6 bucks n i could get a nice breakfast snack, but all i ended up getting was an attitude from some guy who for some reason decided to fight with me. I went to inquire about said sanwich and was quickly cut off by him saying \"we dont have no 6 dollar phillies, not ever.\" (Noting that the sign  specifically reads breakfast phillies, steak, bacon, or ham phillies.) To wit I replied, \"no I'm talking about your sandwiches on the sign\" at which point the Genius behind the counter puts his brain in high gear and repeats \"We dont got any phillies for 6 bucks.\" its like no sh!t Sherlock! Thank you so much for explaining to me that you only have a slight grasp of this thing called communication, how enlightened I am now to the fact that you do not sell 6 buck phillies, and thank you ever so much for the attitude of treating me like I was a 5 year old instead of using commen sense and telling me about the sandwiches I was inquiring about. I left with nothing other then anger, fustration, and a bad taste in my mouth from your customer service skills. Perhaps look elsewheres for your morning meal or you may have to fight with him as well!\n\nupdate: tried them out again for the first time in a year and got a totally f#d up case of food poisoning ughhh they used to be so good..."
        }, 
        {
            "index": 354, 
            "rating": 3, 
            "review": "Not really a Philly steak sandwich fan ,but was intrigued by the building and the  reviews on yelp. We both had the Philly wit cheez whiz an mushrooms and onions. The meat is cooked and sitting in jus,  after u order cook puts meat on flat top w your toppings then put in bread they bring in from Philly . The meat is juicy and tasty, bread is soft and chewy. Liked the cheez whizz , onion and mushroom combination . The sandwich was extremely hot had to wait a couple mins to let it cool. We also ordered fries and fried okra. Fries and okra were made to order , the okra was the frozen stuff served with ranch, it was good not great same as the fries. I think I like capriottis cheese steaks a little better, but would come here because they serve fries :) and have more sides then just chips.   Our two phillys , fries and okra came out to $25, which is not cheap  , I'm glad I read the reviews on yelp , which said it was a little spendy, that's y we stopped by 7 eleven and bought a double big gulp for a couple bucks, saved a little there , I think I'll make it a quick tip . They also have hoagies  .  I will back to try the other menu items. I luv a sandwich shop that serves fries."
        }, 
        {
            "index": 355, 
            "rating": 4, 
            "review": "Okay, I thought Pop's was great! Heard of all the hype and it was worth it! I ordered a steak philly with onions and extra whiz. I thought it was great! Good service and quick delivery! My boyfriend thinks \"Those Guys Pies\" at the Lakes on Sahara are better! I believe they're both great! Take your pick!"
        }, 
        {
            "index": 356, 
            "rating": 2, 
            "review": "For me, the food has to be delicious. And I have to see value in purchasing a delicious meal. There's been a lot of hype recently over Pop's Philly Steaks--especially now that they have a food truck running (I see them parked in front of LVAC and downtown for Vegas StrEats.) \n\nA few of my friends went down to their free-standing restaurant to eat and said the food was awesome! They're 24-hrs which totally works with my hectic schedule. So I made it a point to stop by. \n\nI went around 10 or 11pm. No crowd, little wait, quick service. The food is cooked right there in front of us and they prepare everything \"to-go.\" I ordered a Philly with onions and provolone and a heaping portion of fried okra luxuriously served in a large paper bag. My meal cost approx $15 w/o a drink.\n\nI think Pop's is simply a hot sandwich. Not particularly flavorful or delicious. It's alright food, I would just rather spend my $15 elsewhere. I might give them another shot in the future. I've heard this place is hott on the cheese whiz. But overall it was a mediocre meal. Not bad food, just maybe not my kinda food. \n\nThe seating is entirely outdoors (not so great for the hot summer days or cold winter nights)--make sure you dress appropriately."
        }, 
        {
            "index": 357, 
            "rating": 5, 
            "review": "Closest thing to being in Philly :). Awesome food, great location open 24 hours.  Service is awesome , outdoor seating is perfect this time of year. This is a great place for great food fast."
        }, 
        {
            "index": 358, 
            "rating": 5, 
            "review": "I had heard nothing but good things about this place, I finally decided to go at about 1am on a Monday morning. This was the best cheesesteak I've ever had, do try the cheesesteak with provolone and cheese wiz, it was amazing!"
        }, 
        {
            "index": 359, 
            "rating": 5, 
            "review": "I loved Pop's.  \nMy roommate and I stopped there one night, and got 2 cheesesteaks to go.  He got the one with chili and cheese, I got the mushroom and provolone with onions.\n\nThe service was good.  The guys were nice enough for being in a hot kitchen in the middle of the summer.  They were attentive to us, and filled our order perfectly. \n\nIt took about 15 minutes or so to get home, and we were worried that the buns would be soggy.\n\nThey weren't.  The sandwiches were perfect, tasty and HUGE!  I was stuffed!\n\nThe onion rings were to die for, and I loved the Pennsylvania Dutch \"Birch Beer.\"  SO good.  \n\nI want to try the fried okra next.  Hopefully I can make it back soon."
        }, 
        {
            "index": 360, 
            "rating": 4, 
            "review": "This is the only place I've tried for a Philly since I been living on the West. I've been to Philly...numerous times, so I know what to expect and also how to order the sandwich properly. To me...the Philly was pretty good. Didn't go crazy..just with whiz, onions, green peppers and jalapeño. I devoured it. It's no Genos or Tony Luke...but it comes close enough. I will visit again, but only on a weekend day."
        }, 
        {
            "index": 361, 
            "rating": 4, 
            "review": "Overall a pretty good cheesetake sandwich.  Though Capriottis is still my favorite."
        }, 
        {
            "index": 362, 
            "rating": 3, 
            "review": "Ok I have heard many great things about pops and I'm sure it's just as great as the reviewers say!  I went to pops yesterday to get a Philly steak and I  observed that they have a wide variety menu. I was starting to order and notice that they use the same spatula and grill for the pork and the steak which was a complete TURN OFF!! I don't eat pork at all and I haven't in 7+ years other than that give it a try but if your like me you will pass"
        }, 
        {
            "index": 363, 
            "rating": 5, 
            "review": "First time trying and didn't disappoint. Although I paid 4.99 for double meat and mine looked about  the same as my wifes and she didn't get double meat but other than that it was pretty good. Free refill and the cheez wiz fries were good, good dipping for sandwich after all fries are gone lol"
        }, 
        {
            "index": 364, 
            "rating": 1, 
            "review": "I was surprised to see only one person at the window (normally there is a long line).  It was cold and windy, and I stood there and waited for about five minutes behind the one person.  It turns out that he was just visiting the girl behind the counter!  I finally stepped over to the other side and asked the guy who was standing inside if I could please order (I needed 9 sandwiches).  At that point he points to the sign and rudely states that I had been standing at the wrong window the entire time...neither of the two people working there bothered to tell me that!  I suppose I should've seen the sign but there's so much writing everywhere I missed it.  Non existent service!"
        }, 
        {
            "index": 365, 
            "rating": 2, 
            "review": "its a cheese steak. it tasted a little bland. i dont have that much of a craving for cheese steaks and when i do theres other places i can goto."
        }, 
        {
            "index": 366, 
            "rating": 4, 
            "review": "this place is a total hole in the wall. the parking lot is small and if you don't take it to go, you have to sit outside to eat. when you walk up to order, there's a guy that's making the cheese steaks as you order... we ordered a regular cheese steak with peppers, onions and mushrooms... when we got our food, we sat down and took my first bite.... YUM! it was pretty darn good....slightly bland but still definitely worth trying. next time i go to vegas, i'd go again.\n\nif you can't make it to their location, i noticed they do have a food truck too."
        }, 
        {
            "index": 367, 
            "rating": 3, 
            "review": "Well, this is an iconic Las Vegas eatery and as someone who appreciates anything left of Old Vegas I think it's important to preserve and advertise whoever is left.  Unfortunately, the last 2 times I've eaten here the food has been complete slop.  Granted, both times have been late night excursions, but being a 24 hour business that shouldn't make a difference.   Few weeks  back I grabbed an Italian sausage sandwich with peppers and it was an abomination.  The entire sandwich was drenched in something resembling marinara sauce but it had very little flavor and was so messy you couldn't even really call it a sandwich anymore.  Tonight, I got a philly (their claim to fame) and once again it was just complete slop.  The bread doesn't taste toasted, the meat has very little flavor, very few peppers and slimy canned mushrooms.  Worse, they just dump a ton of Cheez Whiz on it and expect that to make up for the utter lack of taste.  Pretty sure this will be my last time, but I will give them props for variety and business hours.  I hope they bring back some quality soon, because this stuff is like food you cobble together yourself out of the fridge when you come home from a night out drinking."
        }, 
        {
            "index": 368, 
            "rating": 2, 
            "review": "Maybe I was there at the wrong time. Maybe the cook had a bad night. Drove past this place so many times over the years and never stopped. The lack of flavor made me wish I had kept going. Had a #4 Philly w/ provolone and side of chili fries. It was all bland. Wish I could have had one of the great Philly's I read about in the other reviews but not so lucky."
        }, 
        {
            "index": 369, 
            "rating": 2, 
            "review": "So I was driving by and hungry and yelping ( yes I'm not supposed to yelp and drive). I see the four stars and 120 something reviews and pull in. I order a sandwich and fries for around $14.00 bucks.\n So I just ate my food... The following thoughts cross my mind...\n1) WAAAAAY OVERRATED \n2) WAAAAY OVERPRICED\n3) SUPER DUPER GREASY ( in a bad way)\n4) I CAN'T BELIEVE I JUST WASTED CALORIES ON THAT SH*T\n5) DAMN YOU MISLEADING FALSE 5 STAR YELPERS!!\n6) WHY DID I GO SOLEY ON AVERAGE TOTAL STARS? READ THE REVIEWS WOMAN!\n\nI tried this place and can absolutely positively say I won't be making an encore appearance- EVER!  I have had a better sandwich at Great Steak at the mall or maybe even Starbucks. Right now I am really regretful to have wasted a meal here wishing I would have gone to Subway or IN and OUT instead. Seriously, this place had a piece of dry whatever bread which a bunch of overly greasy crap in it. No special flavor, delightful texture, wonderful aroma, extra special something..NADA. The only reason this place is getting two stars is because the fries were decent and well done( which I like) but still average.  Also, although the cook was extremely friendly and helpful he handled the money and then went directly to cooking without washing his hands or wearing gloves. Can we say GROSS or FLU?\n\nHelp me help you. Don't let my review go in vain. I'm trying to do a public service here. PLEASE, PLEASE, PLEEEEASE don't fall for the hype and avoid this place. If for whatever reason you must visit go for some side orders and be on your way."
        }, 
        {
            "index": 370, 
            "rating": 4, 
            "review": "This place is a little pricey for my taste cause I like to go to cheap restaurants, but it is delicious. The first time I ate there I got a philly, sweet potato fries, a tasty cake, and a drink. I spent $20 just for myself. \nI've been inebriated almost every time I've been there, but definitely worth trying trying at least once."
        }, 
        {
            "index": 371, 
            "rating": 3, 
            "review": "Cheese whiz fries. Why? Who would even? Well, my significant other would, did, and enjoyed. I left that completely to him, though I did try a fry. I don't understand the allure of cheese whiz. \n\nI also don't eat beef, which may compromise the legitimacy of my review for some people, but I'm pleased with requesting a sandwich with chicken, onions, mushrooms, provolone, and hot peppers. The bread that night was different. Not as smooth, but instead had a slight grainy feel on the outside. It was still warm and soft, but I prefer their typical loaf, which doesn't leave as much of a crumby mess.\n\nEverything is made to order and hot. It's a good guilty meal. My only gripe is that I never want to eat there because the tables are dirty."
        }, 
        {
            "index": 372, 
            "rating": 4, 
            "review": "Not perfect, but the most authentic  Philly Steak in Las Vegas.  You got to order like you would in Philly.  Whiz and 'Wit:  With Cheez Whiz and Onions.  Hmm... So tasty.  Any \"authentic\"  Cheese steak place that doesn't offer Cheez Whiz, just isn't."
        }, 
        {
            "index": 373, 
            "rating": 3, 
            "review": "Pop's has been on my radar since childhood! I mean, I have memories of driving past this stand-alone establishment since I was maybe five or six years old. I was always curious about it, and 20 something years later I finally made the trip to explore my curiousity. \n\nLike I said, Pop's is a stand-alone restaurant, with only outdoor seating. It's an order at the window kind of place where you can take food to-go or eat at one of the tables in their outdoor patio area. We arrived around 8pm on a Sunday night and chose to eat outside while the food was fresh and hot.  One downfall of outdoor only seating is bugs, so next time we'll probably get it to-go.\n\nThese are the items we ordered:\n\n#32 Philly Cheesesteak with Peppers and Mushrooms - we chose provolone, but you can get cheese whiz, swiss, or american cheese too. I really enjoyed the roll. It was fresh and chewy, just the way I like it. The steak, mushrooms, and peppers were just okay. I like Capriottis cheesesteak a lot more. For $10.99 I was hoping for a loaded sandwich with lots of meat and cheese. Make sure you get lots of napkins, because it's greasy, naturally. 3/5\n\nFried Okra - probably would not order these again. They absorbed a lot ot the grease from cooking and left a gross film in mouth after eating them. However, they were crispy, so they get credit for that. These come with a side of ranch.  2/5\n\nSweet Potato Fries - nice and crispy and really delicious. These were served with a side of sugary dipping sauce that I didn't care for. 5/5\n\nFranks Ginger Ale - would have been refreshing if it was cold. Served in a can, it was lukewarm. I saw the employee take it out of a fridge too. I asked for a cup of ice and my problem was solved. 3/5\n\nI'll probably visit again after exploring more of the city's options in the cheesesteak category. They've been in that same location for more than 20 years, so it's probable that they have loyal customers. The folks working in the stand were nice and smiley and that'll win a return visit more often than not! Maybe I'll try a grinder next time!"
        }, 
        {
            "index": 374, 
            "rating": 4, 
            "review": "I like that this place is open 24 hours. I get a craving not in your normal business hours. Wide variety of items. You can't go wrong with anything you choose. \nLimited parking spaces, but the service is next to none. You're in and out in no time. The food is fast, but it doesn't taste like it. Reasonable prices and good quality food. The great thing is, the food keeps for leftovers too. \nWhen I'm in Vegas? This is one of the must have places to stop."
        }, 
        {
            "index": 375, 
            "rating": 5, 
            "review": "I vaguely remember a mound... oops... mounds of meat... steak meat... my memory isn't quite well... something about cheese... three of them... provo? American?  Cheese wizard? I can't quite recall... sloppyness... I remember sloppyness... damn speellcheck all to h3ll! Please quit reading this revue... I think I'm steak and cheese wasted!!\n\nOn a serious tip... those who complain about the price are the same that have no problem paying $4.00 for McD's featured slop sandwich."
        }, 
        {
            "index": 376, 
            "rating": 4, 
            "review": "an outdoor eatery-one of a kind. this place is great. fresh made philly cheesesteaks and pastrami grinders. fresh bread from philly. chili cheese fries. get whiz with your philly to make it authentic. this place is fast,friendly & super good food. plus it's cheap!!!! ok prices have went up recently"
        }, 
        {
            "index": 377, 
            "rating": 2, 
            "review": "So the cashier took my money but he had gloves on. Mm, doesn't that defeat the purpose of wearing gloves? Fortunately I didn't see him cooking my food, so I was okay. \n\nUgh, $10.80 for a Philly cheese steak with provolone, onions, and CANNED mushrooms!! You kidding me? Such a disappointment. \n\nAnd yeah, all the tables are really dirty, no way I was going to sit there and eat.\n\nSandwich was just alright."
        }, 
        {
            "index": 378, 
            "rating": 5, 
            "review": "I have been in Vegas for more than seven years and I just tried this place few weeks ago & Definielty knew what I missed out on. Best part about this spot is it's 24/7 & and there's no drive-through, you actually got a park your car and go up to the front and order from 13-15 different things off the menu. I tried the pops famous Philly cheesesteak with jalapeño, pepper jack cheese, grilled mushrooms & onions. The best Philly cheesesteak you could ever have in the Southwest. Very authentic, you can definitely taste the freshness. Prices are good. I think I spent around $12 after-tax buying a bottle water along with the cheesesteak. Must try place in Vegas. Definitely will fill you up."
        }, 
        {
            "index": 379, 
            "rating": 1, 
            "review": "order the pork grinder (my favorite) .. only to be bone chunks and fat..guess i'll have to find another favorite"
        }, 
        {
            "index": 380, 
            "rating": 4, 
            "review": "Been going to this place for years....... Hadn't been there in a long time and happened to be on Decatur today and we stopped by........ We should have just gotten one hoagie...... We split one and that was more than enough for both of us, ended up saving the other one for later..... Not a fan of fried Okra but we had some anyway, it was so so, I prefer the zucchini .. Don't understand the complaints about the prices, i think for what you get its fine.....We didn't bother eating outside since it's too damn hot this time of year, so we just brought everything home and it was pretty darn good.... We'll be back for more next time we're on that side of town........"
        }, 
        {
            "index": 381, 
            "rating": 4, 
            "review": "While there is no ambiance to speak of except eating outdoors in the heat, a mister is present, and the food is really tasty.  Changing it up a bit, instead of my usual Philly Cheesesteak Sandwich, this time I opted for a Hot Pastrami Sandwich instead, and was not disappointed.  While not heaping with meat, the roll was filled enough; smeared yellow mustard on the roll gave off just enough tang to the moist, lean pastrami embedded along with it; and the overall effect with a side of Fries was quite satisfying.  I will most certainly be back!"
        }, 
        {
            "index": 382, 
            "rating": 5, 
            "review": "We have been visiting POP's for years!  We are never disappointed by the food.  Awesome Philly Steak Sandwiches.  LOVE their onion rings. I love the quirkiness of eating outside.  Every time we have out of towners we take them here!"
        }, 
        {
            "index": 383, 
            "rating": 5, 
            "review": "Came here at 4 am after the club was amazing wish they had one in boston I want one right now"
        }, 
        {
            "index": 384, 
            "rating": 5, 
            "review": "If you have never had a Philly cheesesteak, and your trying one for the first time. Pops is the place to try them for the real authentic Philly cheesesteak taste, it doesn't get any better than this"
        }, 
        {
            "index": 385, 
            "rating": 3, 
            "review": "Stopped in for a bite. I've never been to Philly so I really have no clue what an authentic cheesesteak tastes like, I only know what I like. I was a big fan of Philly SteakOut at Trop/Ft Apache. I was terribly sad when it closed shop. \n\nAnyway, I ordered the cheesesteak with provolone and grilled onions. The bread was really good, the meat was pretty good, but overall it made me remember how much I miss that same sandwich from SteakOut. Since it is closed, Pop's will have to do. Don't get me wrong, it was the most tasty philly I've had in a long while. The cheese fries were real good. The husband is partial to the three cheese chili cheese."
        }, 
        {
            "index": 386, 
            "rating": 4, 
            "review": "Yummy food with a really good value. I have now been here twice in less then a month. First time was by stumbling onto it on accidents while trying to find another Philly cheese place I had a coupon for. They have a walk up window where you watch the grill master make your sandwiches.\n\nBoth times I got the mushroom, pepper and onion philly.Juicey, cheesy and big! Room mate got the pastrami both times as well. Another big juicy sandwich. I normally don't like pastrami minus a place in Cali name The Hat! Stole a bite to try it and may actually get it next time. We have had the fried green beans , yummy with a thick ranch sauce. The sweet potato fries with some sort of coconut dipping sauce. They should be considered a sin. So sweet and yummy. Whole reason I went back a second time was to have my friend try them with a to go order.\n\nAlso had the banana fosters bites. First one was yummy second one was ok, third one I only had the half of before I stopped eating it. Tasted like warm banana pudding with a soggy graham cracker crust and deep fried with a thin batter. Think they were store bought  rather then made on location. A good thing to try in a group but I won't be ordering them again for just me.  \n\nPrices are good for the amount of food you get. Main and pretty much only draw back I can think of is no indoor seating. Definitely going back more in the summer . Right on the street and fun to watch passing traffic but in the winter its a bit to cold. We wolfed down our food as quickly as we could the first time, and wised up the second time with a to go order. If you like Philly Cheese this is a great place to go  and well worth the drive even if it is across town!"
        }, 
        {
            "index": 387, 
            "rating": 5, 
            "review": "If you want a great steak and cheese visit Pops!\n\nOpen 24/7 and it's always very hot!\n\nDon't bite right into it or you'll burn your mouth, you've been warned."
        }, 
        {
            "index": 388, 
            "rating": 3, 
            "review": "I'm not known for being a cheese steak fan, but I do love cheese. Add in that this place is about a mile from home for me, and that it's 24 hours, and it's pretty much kismet that I would finally come here and actually really like it.\n\nFirst off, its a bit  pricier than expected: spent $25 on dinner for me and the BF.\nAs others have said though, the sandwiches are beyond huge enough to share.  We got the #32 peppers and onions cheesesteak with provolone ($11), added on sides of chili cheese fries ($4) and an order of wings (10 for $8), and a Franks black cherry soda ($2).  For the price, the sandwich and wings were good portions. I didn't think the same thing about the soda or fries though- but then again, I'm not a soda person in the first place, though I understand this brand is apparently something special.\n\nThe sandwich itself, in addition to being huge, was stuffed full of meat and veggies. The cheese was a little light for my liking, and it was slightly on the dry side toward the ends of the sandwich, but it was good. In the future, I'd probably stick to the mushroom one though.\nThe chili cheese fries were fairly standard and a smaller portion than I expected but we still devoured them in record time. The wings, though, were a surprise. I ordered the mild ones rather than hot, and still found these to be surprisingly spicy. I'd definitely hesitate before ordering their \"flamin'\" style, I can't imagine how much hotter they must get. Portion was good for the price, wings were an average size without being too small or overly fried or breaded. Huge portion of ranch for dipping. I liked how easily the meat came off the bone, too. A little less messy than usual. \n\nWe ate at the patio area, and it was noisy and difficult to carry on conversation, as others have said. However, it wasn't a total turn off and in fact kind of added to the experience. I'll have to come back and try the sweet potato fries...and the breakfast sandwiches... maybe I'll add the Whiz next time, too."
        }, 
        {
            "index": 389, 
            "rating": 5, 
            "review": "The ONLY place for REAL Philly cheese steaks in Vegas. I've been to Philly many times so I know the comparison. This place is open 24 hours. Fantastic hoagies and sides as well. Love this spot."
        }, 
        {
            "index": 390, 
            "rating": 5, 
            "review": "Love the sweet potato fries and the dipping sauce is amazing, wish they had A1sauce  for some of the steak sandwiches... but the food all in all is great and you get Alot for your  yummmmmmmy"
        }, 
        {
            "index": 391, 
            "rating": 1, 
            "review": "This place is not what it's cracked up to what it USED to be. The sandwiches (now) lack flavor and they charge an arm and a leg. I paid $18 for 2. The mushrooms are gross - straight from the can. I used to love this place, and would make my way to get there. Totally disappointed. Don't waste your time. One star because they're fast - go figure."
        }, 
        {
            "index": 392, 
            "rating": 5, 
            "review": "The guys are always really funny and friendly and they don't mind if you're picky, or confused on how to order. They always are super helpful and the food is delicious!!"
        }, 
        {
            "index": 393, 
            "rating": 3, 
            "review": "Feeling a little ripped off after looking at the pictures on Yelp before I ate here. $10 for a sandwich and there really wasn't much meat. The mushroom steak sandwich was ok. I didn't even notice the mushrooms, so I am wondering if they were even in there. The bread was a little stale and would have been much better if the sandwich had been wrapped and taken home.   My son had a chili cheese steak and it looked awesome. He loved it, so if I come back I'll give that a try. Overall I would say this place is a little over priced for what you get."
        }, 
        {
            "index": 394, 
            "rating": 4, 
            "review": "First time I stopped at Pop's, I was hooked on their sandwiches. Best place for a late night or early morning craving. Little pricey, but for the taste and variety, you can't beat this place!"
        }, 
        {
            "index": 395, 
            "rating": 4, 
            "review": "I've always been a fan of Pop's Philly sandwiches, even though they are a little expensive. And while the now-defunct Triple Play was better (and cheaper), this is the place to go if you're craving a cheesesteak.\n\nWe ordered one provolone and one Cheez Whiz, both with onions. At $10 a pop (plus an extra $5 for fries and tip), this was a pricey lunch! But we don't eat there often (and no one should probably be making a cheesesteak part of their daily diet), so the splurge was worth it. Plenty of meat, nice chewy bread, and a healthy (or not) helping of cheese on each. The fries were kind of mushy, but they served their purpose. Next time we'll try the fried okra. (They also have fried mushrooms, sweet potato fries, and a few other sides that didn't appeal to me.)\n\nIf you take a trip to the A-frame building, know your protocol before stepping up to the window: Order on the left, watch the guy make your food, then pay on the right. There's a small outdoor dining area if you want to breathe in the smells of fried onions and exhaust fumes from passing cars. Otherwise, do what we do: Take your cheesesteaks home, where you can enjoy them with a nice cold beverage of your choosing."
        }, 
        {
            "index": 396, 
            "rating": 1, 
            "review": "I love cheesesteaks and I really wanted to like this place. Cheesesteaks 24x7 on the West coast?!? What's not to like about that? Unfortunately, my dream was shattered. Pop's has all of the ingredients, but fails to deliver. I ordered my steak wiz wit -- frizzled beef, cheez whiz, and onions on an Amoroso roll. It's usually a recipe for success; not at Pop's. For starters, the cheez whiz was room temperature...yuck. The beef was bland and not well seasoned.  I ate half of my sandwich and simply could not find the wherewithal to finish it. To date, I have never failed to finish a cheesesteak. I guess there's a first time for everything. To add insult to injury, I had way too many impromptu visits to the porcelain thrown after my visit, I won't be back.\n\nIf you insist on eating here, get it to go. The outdoor covered seating was fly ridden. It's hard to eat your steak in one hand and swat fly's with the other."
        }, 
        {
            "index": 397, 
            "rating": 4, 
            "review": "This place is DANGEROUS.\n\nI ordered a Philly cheese steak with provolone and peppers thinking I'd be underwhelmed, but whoa, this was good. \n\nThe bread was soft enough to soak up the evil meat juices but strong enough to protect my fingers. The sandwich was about the size of my head, but I easily could have eaten the whole thing if no one was around to judge me. I can't wait to go back after a night of drinking at Frankie's or any of the other area bars."
        }, 
        {
            "index": 398, 
            "rating": 5, 
            "review": "My husband had gone to Pop's quite a few times when he was working near there and has always raved about Pop's. He kept telling me it's the best steak subs, sausage subs and meatball subs he's had since we lived in Pennsyvania.  He finally took me there just to prove to me that he wasn't just blowing smoke.  Well, let me tell you! He wasn't being totally honest with me. Pop's is even better than our old haunt in PA!  I had the Cheese steak with onions, peppers, provalone and marinara.  What a treat!  There was so much stuffed into this sandwich, I couldn't eat it all in one sitting!  The flavor was amazing. The grill master was on point.  He must have had 10 different sandwiches going on and never messed up one order!  Kudo's to you, Grill Meister!  They were all very friendly and never rushed us or got irritated when I decided to change what was on my Cheese steak (sorry guys).  I try to get by there at least once a month to have a different sandwich everytime I go (they've got so many). Oh, and did I tell you about the sides? What a selection!  Any way, you have got to check them out!  And don't forget to sign up for there special coupons to be sent to your email.  Yo won't regret going there for a great Philly Steak or whatever you are hankerin' for."
        }, 
        {
            "index": 399, 
            "rating": 3, 
            "review": "I have gone to this restaurant on several occasions over the years. They simply are not as good quality as they used to be.  The service is super slow and the sandwiches are too greasy, on the last couple times that I have gone there.  It's true that Pop's has some history here in Vegas, but I'm afraid that it's going to become a dinosaur if they're customer service and quality doesn't improve."
        }, 
        {
            "index": 400, 
            "rating": 4, 
            "review": "The best cheesesteaks outside of Philly......the meat, the rolls and the cheese are the best"
        }, 
        {
            "index": 401, 
            "rating": 5, 
            "review": "Straight up the best Philly steak sandwich in town, and for as long as I can remember.  Purists get Whiz, but there's no shame in getting provolone.  Food is cooked while you watch.  The bread is perfect, soft but never soggy.  Wouldn't change a thing about this place:"
        }, 
        {
            "index": 402, 
            "rating": 5, 
            "review": "Amazingly Delicious! \nThe breakfast special (m-f/6-10am) is a sweet deal! The Breakfast Sandwich (steak, egg, cheese, peppers, onions & mushrooms) with a drink only $6! Freshly made right in front of you while you order."
        }, 
        {
            "index": 403, 
            "rating": 5, 
            "review": "Probably my favorite drunk food of all time. I've lost count of all the 3 a.m. stops Papa D and I have made here to get our favorite #2 - a cheese steak w/ whiz, just like they do in Philly. \n\nWe even had our Christmas Eve dinner here two nights ago, much to our kids' delight.\n\nIt may not look like much, but they make some tasty cheese steaks!"
        }, 
        {
            "index": 404, 
            "rating": 2, 
            "review": "The chicken philly was over priced and under seasoned.  We paid $22 for 2 sandwiches and we were not impressed at all.  The Cheese Wiz was only on the top of the sandwich not on the bread.   The bread was dry and the chicken was bland.  It was a big let down."
        }, 
        {
            "index": 405, 
            "rating": 5, 
            "review": "This place has the most legit cheesesteak I have had in this time zone. Prices are a little on the high side, but still well worth it. I got mine with cheese wiz and onions with a side order of fried okra. The fried okra was fresh  and not soggy. I do wish the batter was homemade  and contained some spices but hey I'm from mississippi and gotta have a Lil creole when it comes to okra. The ranch dressing that came with the okra was AMAZING, in fact I would love that stuff on anything.  If your on this side of town go pick yourself up a cheesteak here. You won't regret it."
        }, 
        {
            "index": 406, 
            "rating": 1, 
            "review": "Got a cheesesteak, this was so gross, I had to throw half away.  They have gone way down hill.  The meat was so disgusting, it had no taste and tasted like dog meat.  $10 for a steak sandwich is alot, but if it's good, I wouldn't mind.  You couldn't give this to me for free.  The only good part of it was the roll, (Amoroso), you can't go wrong.  I'll be making my own steak sandwiches with Amoroso rolls from now on.\nBorn n Raised in Philly, I know my shit when it comes to steak sandwiches and this place should be closed down.  Will never go back."
        }, 
        {
            "index": 407, 
            "rating": 5, 
            "review": "My husband loves Philly Steak sandwiches and we are always looking for good places to eat. I read that Pop's had the best in Vegas so that was our next stop. We ordered ours Phillies with bell pepper and onion. My son ordered with Chili beans. Sounds weird but he love it! In fact, we all loved our Phillies. They had so many different kids of sides too. We'll definitely go back to try the other sandwiches. Oh almost forgot, they are open 24 hrs. Love that!!"
        }, 
        {
            "index": 408, 
            "rating": 4, 
            "review": "Been going for years, always a solid great taste, morning noon and night!!!  People are always friendly and food is great.  Wings used to be bigger, but hey they got to make a profit somewhere.  Great great quick place to eat!"
        }, 
        {
            "index": 409, 
            "rating": 2, 
            "review": "Maybe if I was really drunk this would be good. Sober one of the worst phillys I've ever had. To put it in perspective think your average cafeteria cheese steak. Bad quality meat. Average hoagie bun. Cheese wiz was good but who am I kidding cheese wiz is always good. Not impressed at all with this place and I will not be back. Even if I am faced I will walk past this place I am 90% sure... Haha"
        }, 
        {
            "index": 410, 
            "rating": 5, 
            "review": "With all due respect to the birthplace of the Philly, I find it hard to believe that anyone can top the sandwiches Pop's Philly Steaks has to offer! I've been enjoying Pop's since highschool and refuse to eat a philly anywhere else. They also have amazing Chili Cheese fries!"
        }, 
        {
            "index": 411, 
            "rating": 3, 
            "review": "In town for a capoeira event. After the festivities we went to this weird food court and we really packed the place but for some reason I got a flash of us waiting in line FOREVER.\n\nOur Mestre rented all of us out of towners a place nearby here and when running errands we spotted this place. It reminds me of a 50s carhop. They're menu is pretty big. I settled on the cheesesteak with cheez-whiz, mushrooms and onions and an order of fried okra.\n\nThe service was really quick and the sandwich was HUGE, and they were definitely generous with the fried okra. As soon as they placed it in my grubby little hands one half of the sandwich didn't even make it to my table. I'm prided on an Asian mouth and I was reading some reviews about it being too hot. Some may call it hot and mouth burning, I call it fresh.\n\nAnd after we all ate our sandwiches, we were the first ones back to the house to shower and even after that, people were still waiting for their food at the other food court!"
        }, 
        {
            "index": 412, 
            "rating": 3, 
            "review": "Tried #32 - Philly cheese steak with onions, peppers and mushrooms.\nIt was a bit bland... not enough salt or spice. And for more than $15 (w/soda and a side) I think it's a little too much...\nOne time is enough for this place - not going back."
        }, 
        {
            "index": 413, 
            "rating": 1, 
            "review": "Ate there around 10:30pm ish last night.  Around 1am ish, me and my little 6 yrs old boy has food poisoning from that place.  We're at the UMC urgent care right now.  Hope that help.  I've also filed a complaint with the Health department."
        }, 
        {
            "index": 414, 
            "rating": 4, 
            "review": "I've dined there a couple times over the past year that I've lived in the Las Vegas area.   As a vegetarian, I basically get a massive, molten glob of several cheeses, grilled onions, lettuce & then add some ketchup or BBQ sauce (*if* I can find it there).     The reaction I get from other customers is always interesting as I tell the cook I'm a vegetarian, HOWEVER it turns out that one of the cooks that's there often is actually a vegetarian too, and note to some of you tough-guys: just because some of us vegetarians care enough about other animals to not eat them, it does not imply we don't mind fighting & hurting some dumb human who decides he needs to offer his opinion on vegetarians if he overhears our order.\n\n\n  The bread is very fresh, and of course it & the rest of the gooey, heart-attack-calling mess tastes great.    I used to get a side of fries, but they weren't anything special, and even 200+lb glutton me doesn't need to fries if I'm planning on eating the whole sandwich then & there.\n\n  I can & will continue to try other cheesesteak joints.   I know this will disgust some of you carnivores, but some cheese-steak places actually have a fake meat item (called seitan) that they'll use to create a vegetarian cheesesteak that looks and YES, once you add the cheeses, onions, sauces, etc. TASTES very similar to a real cheesesteak, so I am still looking for places that do that (Pop's doesn't).     However, the product I eat at Pop's is great, and another wonderful thing about it is that it's open 24/7.\n\n It's shaded but otherwise outdoor seating, right along the race-track/circus show that is Decatur Blvd near Arizona Charlie's -- NOT a place to be for the faint of heart, so either get it to go & get the hell out of that area, or strap-up your gat & go sit there at 2AM & enjoy your food & the 'entertainment' the street & Pop's provide."
        }, 
        {
            "index": 415, 
            "rating": 4, 
            "review": "STILL da bomb! I brought my friends here last weekend while we were in Vegas, and they agree, fantastic cheese steaks!\n\nI got the one with bacon and mushrooms this time, DAMN it was good!\n\nThe guys here are great, terrific service!"
        }, 
        {
            "index": 416, 
            "rating": 4, 
            "review": "My friends seem to love this place.  They will drive the distance.\n\nWe ordered a couple things off the menu.  Provolone Cheese Steak was good.  It would've tasted a lot better if it had more flavor or some sort of sauce.  I split this meal with my friend.  It was pretty fulfilling if you ask me.  The Cheese Fries were alright.  The cheese tasted to artificial for me.  The cheese probably would've tasted better on nacho chips than on fries.  The Jalapeno Poppers were good.  Everything probably would've tasted much better had the weather been warmer and indoors.  This place has only outdoor seating.  It's been around.  The cool thing about this place is that they make sure they get your order right and give you your receipt.  If they don't, your food is free.  It's stated on the wall...\n\nI'd give this place 3.5 stars, but since my friends enjoy eating here I gave it a 4 instead."
        }, 
        {
            "index": 417, 
            "rating": 4, 
            "review": "So so good. Makes me think of Philly. True Philly Steak is with Wiz.  Yummy!!!!  They import the bread from the east coast which makes or breaks a good hoagie."
        }, 
        {
            "index": 418, 
            "rating": 3, 
            "review": "first time there. bread was very good as the onion rings. the meat in my steak sandwich is a different story. I really wanted to give this place more stars. from my understanding, a proper Philly cheese should be made with rib eye steak. don't know what they used but it was just ok. not great.  all the effort on everything else just to skimp on the quality of the meat."
        }, 
        {
            "index": 419, 
            "rating": 3, 
            "review": "I enjoy going to POP's from time to time in order to enjoy a nice cheesesteak. Unfortunately, their location isn't close to home or in a place I frequent very often. It is worth driving out of the way for, however, to satisfy my craving.\n\nI always order the #2 Cheese Whiz Steak with onions. The gorgeous pictures on their menu always tempt me to order something different, but the memory of that gooey delicious cheese on top of tender steak just trumps all other urges. When it comes to sides, I've had the fried zucchini and the whiz wheels. The zucchini was alright. Nothing to write home about really. I didn't care for the whiz wheels. When asked what they were, they described them to be \"like fries.\" They're nothing like fries. Rather, they remind me of Asian shrimp chips.\n\nThe service isn't amazing. Half the time, the person working behind the grill is very inattentive; doesn't really greet you and merely waits for you to order without saying anything. The patio eating area is a bit run down. The stools aren't the most comfortable to sit on either, but I guess it's part of POP's charm."
        }, 
        {
            "index": 420, 
            "rating": 4, 
            "review": "You're supposed to go for the whiz, but I was wooed by their patio. There is no interior dining here, and no, the patio is not fancy, but while I was chewing on my wonderfully soft hoagie stacked with meat and cheese, I couldn't help but admire this mildly grimey but charming outdoor eating arrangement. I felt like I was on an adventure in another country, anonymous, unable to speak the language, and unexpectedly eating a Philly cheese steak. It was wonderful. Sometimes a place just transports you, and for some reason Pop's was that place on that Saturday afternoon.\n\nI admired their plethora of fried offerings from okra to green beans to mushrooms and zucchini. Alas, the only thing I could sell my husband on were the sweet potato fries. I didn't want to consume an entire heap of fried okra alone, so we went with those. We shared a steak hoagie with American, not whiz, and onions and peppers. \n\nThe sandwich was solid. The star was definitely the roll. And, the sweet potato fries were as good as any I have sampled, especially because they were served so hot that I could feel my fingers melting beneath the wax paper. I was tempted to pour their magic coconut water sauce all over them, but I showed restraint. If you are braver, definitely pour away and let me know the results. \n\nI of course adore the building and the fact that they are open 24 hours. I am sure we will have a 3am cheese steak sometime in the near future, and when it gets cooler, I will definitely go back for the unexpectedly charming patio."
        }, 
        {
            "index": 421, 
            "rating": 3, 
            "review": "A solid sandwich experience. I love cheesesteaks, and you just can't get the real thing unless you go to a place that only makes cheesesteaks. This place looked kinda greasy and worn down, which actually made me want to try them out. Got mine \"whiz with\".....it was too cold to sit in the outdoor seating so I ate in the car....I almost made a mess, which is how these sandwiches should be.....it was very tasty, high meat to bread ratio. I'll be back if I'm ever craving a cheesesteak, probably wouldn't make it a destination on its own."
        }, 
        {
            "index": 422, 
            "rating": 4, 
            "review": "Oh yeah! This place is great! I have had the privilege to have authentic Philly cheese steaks right in Philadelphia. I have had Pats and Gino's and Tony Lukes right in Philadelphia. This place is very very close to what you would get at any of those two places in Philly. The cheese whiz and steak! I love it. You should try it! I wonder if they have broccoli rabe like Tony Luke's that was fantastic!"
        }, 
        {
            "index": 423, 
            "rating": 2, 
            "review": "I know I'm in the minority here, but I did not enjoy this cheesesteak at all.  I had a CrowdSavings or Groupon thingy for it and maybe it was the fact that I took it home with me and ate it, but the grease from the onions just made the sandwich a soggy mess.  The roll didn't even taste all the fresh at all.\n\nNow I get to go through the rest of the day feeling like I have a bowling ball in my stomach.  I guess that's what I get for not eating greasy food all that often...\n\nI'll pass, thank you.  Those who like it can keep on going, but I will go elsewhere."
        }, 
        {
            "index": 424, 
            "rating": 4, 
            "review": "One of the best places in Vegas to grab a bite to eat. They only place I go for a Philly Cheese steak in Vegas. Like the city itself this place is open 24/7. \n\nThe last time I was here grabbed a Philly with pepper and onions, provolone and cheese wiz. The was so good it was worth the extra weight and the guilty feeling about not being true to the good ole diet. On the few occasions I have been lucky enough to eat here they do not disappoint. The only thing that puts this as a 4 instread of a 5 is the location. Though I have never had any issues here, I also don't feel it is the safest part of town. Since I am usally in and out of here I will risk it. Like I said nothing has ever happened(knock on wood). \n\nIf you are craving great eats anytime of the day I would stop into POP's. The Philly Cheese Steaks are awesome."
        }, 
        {
            "index": 425, 
            "rating": 4, 
            "review": "I had the classic philly with pepper jack cheese. the meat was really tender and seasoned well, the only reason I'm not giving this meal give stars is bc the bell peppers were really hard, they should have been a little softer like the onions. I asked for no mushrooms but I noticed my boyfriend eating his so they much have been good.\n\nthey waaaay over charge for fries by the way."
        }, 
        {
            "index": 426, 
            "rating": 4, 
            "review": "Food was- ok\nService was- ok\nProbably be back if in the area and craving cheesesteaks"
        }, 
        {
            "index": 427, 
            "rating": 5, 
            "review": "Amazing philly cheese steaks. Great quality, people are nice, parking is easy, fun place to go to"
        }, 
        {
            "index": 428, 
            "rating": 3, 
            "review": "Tried this place a little bit ago. The guy was nice and was helpful in my decision, but unfortunately was not wowed. It was not bad, but not great for me to go out of my way for a second trip. But again I like super flavor and they are probably catering to masses. I can see this as a great place to hit up during a night out."
        }, 
        {
            "index": 429, 
            "rating": 1, 
            "review": "Not impressed by this place at all. I love a good Philly and especially from a hole in the wall kind of place. I was so disappointed by everything.  Not sure how they are still in business. But oh well...to each is own. Try it, but don't say I didn't warn you."
        }, 
        {
            "index": 430, 
            "rating": 5, 
            "review": "Las Vegas institution.   Still as excellent as ever was!   Healthy it's not.  But delicious it is!"
        }, 
        {
            "index": 431, 
            "rating": 4, 
            "review": "I'm not, normally, a fan of philly cheese steaks but, WOWWWWWWWWWWWW!!!! \n\nI am a believer =)\n\nI think I got a pepper, onion, and mushroom philly cheese steak. \nThe bag was greasy! The meat was flavorful. The shrooms, onions, and peppers reminded me of pizza.\n\nIT WAS DELISHHHHHHHHHHH.\n\nIt was open late which is a big plus. \n\nConsidering that it's open late, it's kinda scary!!!\n\nWe were the only ones there; and the workers work behind a bullet-proof window (OK, I WAS KIDDING BOUT THE BULLET-PROOF WINDOW!!!!!)\n\nAlas, the food is worth getting shot at for.....\nWELL, I, MAYBE, NOT SHOT AT...\nmaybe, a stab wound.........lol j/k\n\n\nMy review: MUST SAMPS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
        }, 
        {
            "index": 432, 
            "rating": 1, 
            "review": "This was the worst philly cheese steak I ever had as soon as I discovered a metal bag tie inside the meat half way through eating the sandwich luckily I could spit it out before I started chocking on it and would have had to go to the hospital. This is not what I expected for an 11.99 plus tax sandwich. See attached picture"
        }, 
        {
            "index": 433, 
            "rating": 2, 
            "review": "The place is advertised as a Philly cheesesteak and for me that means more than just some frozen steakumms! The steak was super dry and the onions and peppers were cut way too big and thick. Moral of the story is, for the people who have had good cheesesteaks or authentic ones from Geno's or Pat's in Philly, dont waste your time!"
        }, 
        {
            "index": 434, 
            "rating": 5, 
            "review": "I didn't have my first Philly cheesesteak sandwich until I was about 35 on a trip to Philly.  I fell in love.  Pops is the best in vegas for the authentic taste.  They even fly their bread in from Philly (something about the water in Philly makes it better).  It really is a true taste of Philly... you gotta try it."
        }, 
        {
            "index": 435, 
            "rating": 4, 
            "review": "BOY!!!! This place is off the chain. Open 24 hours? Man you can't beat that. I simply LOVE this place. Why the 4 stars you ask, well for one thing I really didn't like their pastrami fries and yes it was enough to bump it down one star. For one thing I strongly believe that if a business/restaurant deserves 5 stars, you better believe that everything they serve and their customer service is top notch. And I failed to believe everything on the menu was good, but you better believe that their philly cheese steaks are probably the best I've tried in LV and in the Bay Area.\n\nThe first time I was here I ordered the philly cheese steak with bacon and swiss #9. It was just as good as advertised and just as good as it looked while the cook was making it. I also ordered the cheese whiz fries and boy was that also yummy. I also ordered fried 'shrooms, and those little mouth watering bites were simply just awesome. It was the first time I tried anything mushroom fried in batter, and I was damn glad this place was my first. The second time I ate here I ordered the pizza philly cheese steak.....mmmmm, was that yummy it was like ordering on of my two favorite things and smashing it into one nice juicy hoagie. I also ordered cheese whiz fries again, but this time I had the master cook add some bacon in it, man was that good.\n\nIf I really had more time to spend in Las Vegas, I sure would come here a few more times and try more off the menu. I also love the fact that this place is open 24 hours. With me being on Vegas party time and coming home about 3 or 4 in the morning after the casino, this place just becomes a savior.\n\nThank goodness for Pops Philly Steaks open 24 hours and its yummy juicyness of flavorful cheeeeeeese steaks. Keep up the good work guys, when I'm back in town you better believe I'll be back for more! It's like philly cheese steaks from heaven. YUM!"
        }, 
        {
            "index": 436, 
            "rating": 2, 
            "review": "Meh... it certainly it not BOO's Philly Cheesesteaks in Los Angeles, but I guess if you want something this does fine... I'm picky about flavor and their cheesesteaks lacked flavor, it was it's just too salty. Star snatched. Salt doesn't equate flavor. The meat tasted like \"steakums\" not fresh to me. Fresh meat has a texture to it that is tender and you don't have the chomp down on a cheesesteak... it should practically melt in your mouth, regardless of the toppings selected. Star snatched. I ordered the mushroom steak and asked for bell peppers as well... get home they aren't even in the sandwich- and no they weren't busy enough to excuse it. Star snatched. On top of all of that...The provolone cheese wasn't even melted... everything was \"extra\" and I've never been anywhere that charges \"Per topping\" it's usually whatever steak-combination you choose and you can say if you do or do not want grilled onions and/or bell peppers... not that it is an extra charge unless you actually want EXTRA. no grilled onions just a sad excuse for a Philly cheesesteak IMHO, but alas this is Vegas. My search for a cheesesteak home out here continues. The plus I guess is is it's open 24/7... but the only people who would care about that is those who believe this food to be good. Soooo yeah- no. I'll leave it at 2 stars for decent service. I however, won't be back... I can't risk paying $20 again for over-salted food that will not be how I truly like it."
        }, 
        {
            "index": 437, 
            "rating": 5, 
            "review": "Best cheese steak in Las Vegas!! Always hot & made to order.  Whiz is a rare option in Las Vegas so, it was great to see it offered.  Peppers & onions are crisp yet tender as well as the fried okra."
        }, 
        {
            "index": 438, 
            "rating": 2, 
            "review": "Sadly....I must give them only 2 stars. :( after reading some of the reviews....I am guessing that they used to be better then they are now. \n\nI got the okra.... And it was really really slimy inside. Yes I know it's okra... But when they are fried well... The sliminess goes away and sadly this was not the case for them.  So sad as I love love me some fried okra. Flavor (2/5)\n\nI also got the fries and they were just fries. Not really crispy.... Kinda sad soggy fries. My bf liked the fact that they gave ranch with it.... But eh... Flavor (2/5)....I would've given it 1 star but since my bf loved the ranch I gave then another star for the ranch. :/\n\nFor the main course I got the #6... The Philly with mushrooms and cheese.... OK... The bread was freaking awesome! Perfect chew and softness... Just perfect. BUT the meat... Mushrooms and onions were really really under seasoned. It was very blah. I mean the Philly cheese steak at subway tasted better then this. :( very disappointing since this is what they are known for. (2/5)... And that is being generous. \n\nService was OK... Nothing mind blowing....(2/5)\n\nAmbiance was.... It's a mom and pop type store.... So it was kind of ghetto.... Without the cutesy stuff that u normally see in a mom and pop... And no bathroom at all either (1/5)\n\nWill I be returning.... Most likely no.... One it is too far and for the price there are other things that I would rather eat.  The prices for the sandwiches ranged from $10 and up and the Specialty sides were $4.... And as nothing that I had made me want to have another bite....I don't think I'll be returning. :("
        }, 
        {
            "index": 439, 
            "rating": 4, 
            "review": "Dang... what a great philly cheesesteak found in the middle of the desert in Las Vegas! It was tad expensive ($9.50?) but it was well worth it. It had a good amount of grilled bellpepper, mushroom, onion, and of course, cheesesteak... Delicious! I also had a chilly fries and it was ginormous... My friend and I barely finished our own chessesteak and chilly fries.\n\nThey were greasy, delicious, large portion and mouth-watering.. Too bad I don't go to Vegas too often.. When I visit Vegas again, I will make sure to come back to this place!"
        }, 
        {
            "index": 440, 
            "rating": 2, 
            "review": "Not a fan of the philly cheese steak here. I thought all sandwiches were made fresh to order but not Pops. They have many different sandwiches but I ordered a classic philly cheese steak, as I was leaving the front window I see the cook pull meat out of a pan that had been pre cooked already, right then and there I was disappointed. Sandwich was okay and a little greasey. I haven't been here in awhile and maybe they have changed their ways of cooking a fresh philly, at least I hope so."
        }, 
        {
            "index": 441, 
            "rating": 5, 
            "review": "real good!"
        }, 
        {
            "index": 442, 
            "rating": 5, 
            "review": "When I initially went I was not impressed, in fact I was very disappointed! But I decided to give them a second chance and now I see why they have great reviews!!! I will continue to go there and enjoy the great sandwiches and chili cheese fries..."
        }
    ]
}