{
    "category": "Las-Vegas", 
    "entity": "Blondies-Sports-Bar-&-Grill", 
    "avg_rating_stars": 2.720554272517321, 
    "review_count": 433, 
    "reviews": [
        {
            "index": 1, 
            "rating": 3, 
            "review": "I had the nacho burger here and it was good. I was hoping for a bit more flavor though. It basically has all the nacho condiments stacked within including some bacon. A bit too much going on in the burger. I chose it though hoping for more flavor. My wife had the sliders and enjoyed them. They were good. It's a sport bar and it is great in that. Plenty of tvs for all kinds of events and they'll change it to your preference. Our server was friendly and we didn't wait too long either. I could've have ate twice as good at burgr, the ramsey place in the same bldg for about the same price. Just saying. We chose it because we were going to the zombie burlesque show after right next door. Would probably come back to watch a game."
        }, 
        {
            "index": 2, 
            "rating": 4, 
            "review": "Great place to go and watch the football. Staff are nice and it's cool vibe, would definately visit again"
        }, 
        {
            "index": 3, 
            "rating": 2, 
            "review": "$5 pitcher of beer was awesome but only if you have a college id, lol. They have beer pong tables and waitresses (not blondes) dressed in cheerleader outfits, quite interesting...\n\nThe food was not great through. I had the Philly cheese steak (which had one of the Blondie's specialties icon next to it) and the bread to steak and cheese sucked. There was a lot more bread then steak, wth? It was quite expensive, for simple American food. Also for water you got to get the bottled water, lol unbelievable. There's a lot of TV's for the sport lovers out there but I won't be coming back anytime soon."
        }, 
        {
            "index": 4, 
            "rating": 5, 
            "review": "Awesome drink special ! \nI really enjoyed their shot special! ONLY $4! Where on the strip can you find a shot that price !\nBrandon, the bartender was super cool and helpful . \nLove  LOVE blonde's atmosphere! \nWho can say no to beer pong ! \n\nThank you again Brandon . We will be back to see you!"
        }, 
        {
            "index": 5, 
            "rating": 3, 
            "review": "Pros: \n-Location (for me anyway, staying at Planet Hollywood)\n-The waitresses' cheerleader uniforms (it's a sports bar called Blondies, I'm allowed to be a chauvinist pig!)\n-Some tables had personal beer taps, unfortunately I didn't get to take advantage of this.\n-Menu selection was pretty good, a little something for everyone\n-They burnt our first pizza a little (definitely still edible) but still gave us a 2nd pizza for free.\n\nCons:\n-The burnt our pizza, but made up for it.\n-I got a wrap that was pretty good, but I've had better.\n-Value was just meh, probably decent for Vegas though.\n\nWith all the places to go in Vegas, Blondies is likely not a priority destination.  But it was good for a weekday lunch and some beers."
        }, 
        {
            "index": 6, 
            "rating": 3, 
            "review": "While the pizza is excellent  (supreme & chicken parmesan) the service is lousy. Cute servicers don't matter to straight women! My server watched me as I cleaned my own FILTHY table that we sat at. Argued that we didn't order a 2nd pizza & it took longer to get our plates than our 1st pizza. Don't ask for extras because you won't get them & good luck finding your server after she takes your order  (food runner brings your food) food runner had to get us our plates that we should have had before our pizza arrived."
        }, 
        {
            "index": 7, 
            "rating": 1, 
            "review": "Went with a couple of friends through my own recommendation. Had never been before but walked by and thought it seemed like a fun place. Simply put, I was wrong. We were seated quick enough and the atmosphere was nice. TV's everywhere, games, good drink specials. All of that was killed by the absolute horrible service. Our waitress took our orders and then came around twice before handing us our checks (our total bill came out to close to $100).   My beer sat empty , as well as two other drinks, for about 10 minutes before she noticed. The hardly ever smiled and didn't seem friendly at all. Then after she gave our checks and put our card she completely spaced out and came back with two copies because she split outlet our one order in two. Seriously? Anyways, it was disastrous by that alone. Food was mediocre to good. I suppose it could've been an isolated incident but since it did happen to me then it gets one star. Excel always."
        }, 
        {
            "index": 8, 
            "rating": 1, 
            "review": "What a joke! Got seated right away, given menus and then...nothing! All the waitresses seemed to be preoccupied at the front with so.ething because no one came to ask what we wanted to drink or anything. Me and my wife walked right out, nobody even noticed, bologna!"
        }, 
        {
            "index": 9, 
            "rating": 1, 
            "review": "This is the worst restaurant I've ever been to.  Sodas are 4.00 each for a soda are you kidding me.  The food and service are horrible."
        }, 
        {
            "index": 10, 
            "rating": 3, 
            "review": "This spot has pretty good Jack In The Box food.\n\nBut beer makes it better."
        }, 
        {
            "index": 11, 
            "rating": 4, 
            "review": "After reading the reviews for this place, I was a bit apprehensive, but we were short on time as we were departing Planet Hollywood and Blondies was staring right at us. I suppose it was simply good timing for us because the place was virtually empty and we received prompt, friendly service. \n\nWe started with the Garlic Bread Balls which were incredibly. Nice crunchy exterior, strong garlic flavor (which I enjoyed) and a soft interior. We polished them off in roughly five minutes. \n\nWe decided on a large Pepperoni Pizza and we had to have them take it back initially because we forgot to ask for it well-done. Usually, I get a sense of frustration from the server and / or chef when I have to send food back but the waitress was kind about it and understood and the chef (who brought us our pizza the first time) brought it back out with a smile. \n\nThe pizza tasted great. Perfect amount of sauce and the cheese used had a perfect sense of saltiness and it stuck to the pizza perfectly. The pepperoni tasted fresh and it was simply put, a good pizza. \n\nThe staff was polite, prompt and our waitress kept our drinks filled. The only thing that keeps this from being a five-star review is that it's a little pricey for what you get, but I was happy to spend a little extra for an experience like this. It appears my trip to Blondies was a bit more pleasurable than some of the previous visitors who have given their reviews."
        }, 
        {
            "index": 12, 
            "rating": 4, 
            "review": "I think the most I've ever eaten here are the fries, because I've only, really, been here for after dinner drinks. My brother recommended the place a while back when I was in Vegas visiting and since then, I've always made a trip back to Blondie's.  \n\nI was in Vegas last month to celebrate a friends birthday and we came here looking to drink and play some beer pong at about 1 in the morning. \n\nWhen you walk in, you can tell that Blondie's is a sports bar.  College, NBA and NFL sports Team Banners hanging from the ceiling and walls. Waitresses dressed like cheerleaders and (noticeably) no male waiters, only bartenders. \n\nWe ended up getting a 64oz container of beer for only $35, which was perfect for beer pong, so we grabbed our cups, split up into teams (boys vs girls) and proceeded to attempt to destroy the boys. We failed, they beat us by two cups ... twice!\n\nWe stayed until 3 in the morning, a little drunk and very happy.  Good times all around!"
        }, 
        {
            "index": 13, 
            "rating": 2, 
            "review": "Beer pong is decent, you have to wait for the whole tournament to end before starting a game, even if not competing.. Blah. Also, we paid for $20 entry fee for unlimited draft beer, and then they only give you like 3 choices of beer, which were the cheapest beer. I ended up paying more because I bought additional beer. The beer pong was the only thing that got them the 2 stars, service sucks and deal was misleading."
        }, 
        {
            "index": 14, 
            "rating": 4, 
            "review": "Great hot wings and fries ! 1 dozen = $13/ fries were about $4. We also split a club Sandwich which was plenty. Everything is served in big portions. Very tasty and strong house margaritas $5 each (on the rocks).  \nVery happy with this find. There was no way we would have known about it without the signs we saw throughout Planet Hollywood shopping area so thanks for that! Service was excellent!"
        }, 
        {
            "index": 15, 
            "rating": 2, 
            "review": "This place could do so much better in their food.  The food is what really brings this place down.  They shouldn't be so cheap with their servings and learn how to cook better.  We couldn't see the mushrooms in the burger.  They were non-existent!  And I had more lettuce in my BLT than anything else.  I little bit more than 1 piece of bacon in my sandwich, please.\nThe only good thing I can say about this place is that there are a lot of televisions.  And when we asked if we could have a tv on a certain game, they obliged.  The servers were friendly, but I swear they had to have been tweaking on something.  I'm afraid to find out since some of them were so jumpy.  I really thought their boobs might fall out of their outfits.  Another good thing about this place is the deal for beer.  The server did point out it's cheaper to get 5 beers for $25 instead of getting single beers.  She knew we were there to watch football.  Good job, Tweaker!!!  \nSeriously, they need to get their food better, because it would be too easy to just drink when the food sucks.  And who needs more drunks in Vegas?"
        }, 
        {
            "index": 16, 
            "rating": 1, 
            "review": "We were starving after we arrived in Vegas! Too bad we decided to eat here for our first venture. It was convenient but that's not saying a lot. So were lots of things.\n\nWhat's not good here:\n\nExpensive food that was just ok.\n\nMy meal didn't come out with the other three. I had to flag down a different server and ask about my meal. I guess our server was \"done\" with us.\n\nYou can't get a glass of ice water here. Well, you can but you have to pay for it. A bottle of water only, for several dollars! No tap water served here. No glass, no ice. Weird. Well, it's the \"water is a top commodity\" thing......\n\nOk, time to pay. Our hotel had given us coupons. We each had $10 off. We didn't want to do anything strange. We were just two couples who wanted to split the bill. Don't try this here. \n\nOur server would not, could not, did not split our bill. It had already been rung up she said and no way to change that now. So, we could only apply one coupon and she wasn't happy about that even as the bill had been rung up. She saw the coupons when we sat down but said nothing and did not take them. Had she perhaps not been in such a hurry to get back to her friends, maybe she could've paid more attention to our order. Then she went into her diatribe about us not having told her we were using coupons from the get-go, blah, bah, blah. Ok, whatever! We did, but whatever!\n\nIf this place wasn't so pricey for the rotten food (and no drinking water), we would not have wanted or cared about getting any $ off at all!\n\nShe said we could take it off her tip.\n\nWe did."
        }, 
        {
            "index": 17, 
            "rating": 2, 
            "review": "We decided to go and try out their unlimited pasta. We were seated right away but no one came to take our order. I had to ask one of the waitresses if she could send our waitress to our table. After that she came moments later. The pasta is $9.99 and you have the option to add meatballs or chicken for $2.99. My friend got the chicken and I got the meatballs and we both ordered the alfredo. The bowl was a good decent size and mines had two large meatballs. My friend finished his first and wanted his second bowl; but then he was told if he wanted more chicken he had to pay another $2.99. We were shocked, and so he ate his pasta without chicken. We then asked for boxes and they said they don't give boxes when the unlimited pasta is ordered. I asked to speak to the manager and he really didn't want to give us boxes. I told him you guys are only going to throw it away so what's the big deal of letting me take the food that I paid for home. One of his responses was we should already know they don't allow boxes with the unlimited pasta and he even compared it to running a red light! He said everyone knows not to run a red light. I told him that's against the law and its written in the handbook. Nowhere does it say you cannot take the pasta home. So to end it he says I'll bring one box and runs off; he didn't even give me a chance to respond to him. So, I had to stuff both of our food into one box. Even though the pasta was good I'm never going back because of that experience and on top of that their food is overpriced. We should've just went to Bubba Gump."
        }, 
        {
            "index": 18, 
            "rating": 3, 
            "review": "First time at Blondies, service is my only real complaint, it wasn't terrible but wasn't great. Everything just took a little longer than it should have to get to the table, although when the food did show up I was pleasantly surprised with how good it was. I got the buffalo chicken wrap and it was way better than I expected, would recommend! We got the chips and salsa as an appetizer, they were ok, typical store bought chips and mediocre salsa. Decent but not with the unnecessarily high price."
        }, 
        {
            "index": 19, 
            "rating": 2, 
            "review": "Good deal for the Breakfast special. $2.99 and that includes eggs, choice of sausage or bacon. The only disappointment I had was when the girl took a picture of us and came back trying to sell it. I told her NO & she kept bothering us. I lost my appetite!!!"
        }, 
        {
            "index": 20, 
            "rating": 1, 
            "review": "Was seated by a very confused hostess and sat for 30 minutes with no staff contact. Shortly after, the very rude and obviously inexperienced hostess treated like it was our fault, saying \"I told you guys that it would be a minute and you've totally overwhelmed the server. I should have had you wait\". Then she told us that we'd have to sit at the bar because the server \"is really overwhelmed, stressed, and won't take us\".....that was it, we left. How the hell is a party of 3 that has yet to even speak to a server overwhelming?"
        }, 
        {
            "index": 21, 
            "rating": 4, 
            "review": "Such a welcoming staff! Went the night before my Birthday and the waitresses gave a to-go coke saying \"Happy Birthday\". She was very on top of our group and kept coming back to make sure we were enjoying our time. Even gave us some great Vegas tips for our week stay. \n\nWe went during the lunch happy hour and got the Fettuccini pasta bowl for $3.99. For the price there are no complaints!! However, I would not have paid $9.99 for a single serving of the pasta. The pasta sauce itself was very heavy. This is definitely the place to end your night and not start it. You will be leaving in a food coma!"
        }, 
        {
            "index": 22, 
            "rating": 3, 
            "review": "You have many eating choices while walking around the Miracle Mile. This is not a bad place to pick.  It's your typical bar food with a bunch of TV sets.  Nothing great, nothing bad."
        }, 
        {
            "index": 23, 
            "rating": 3, 
            "review": "We stopped here because we had a cool voucher deal. If you want to watch a game this place has flat screens everywhere! So that's the awesome part. Waitress cheerleaders are cool, but the food is so so. Although the seating set up can be kind of squishy so make sure wherever you are sitting you're not in an area where you'll feel like a freeway lane. You want to come here more for some drinks and finger foods because you're pretty much watching the game!"
        }, 
        {
            "index": 24, 
            "rating": 1, 
            "review": "Don't waste your time, or money here.\n\nI bought a groupon (thank goodness I didn't pay full price) to try this \"world's best sports bar\" out. FALSE ADVERTISEMENT! We both ordered a turkey club ($15.99, extra $2 for avocado), onion rings ($8.99), and curly fries ($6.99). The sandwich was okay, but the price includes ONLY the sandwich. Onion rings, I ate one (saturated in oil, the onion was mushy), and the waitress didn't offer to comp it or anything. Curly fries, no seasoning. \n\nOur waitress came 3 times. Once to take drink order, then to give us drinks and take food order, last time was to give us our check.\n\nNever, ever visiting this place again."
        }, 
        {
            "index": 25, 
            "rating": 1, 
            "review": "On a visit to Las Vegas, with my Husband, he was craving a Good Hamburger, and he liked that Blondie's had alot of TV'S to watch Sports, so we decided to eat there!  WRONG CHOICE !!!  my husband had Sliders, that tasted good, but was way OVER priced,  and if he would of wanted french fries, they would of been, $6.00, I wasn't that hungry, which was a good thing, because all I ordered were the chips and salsa, and they were $5.95, I had a Margarita that was served in a plastic cup for $8.00, and the coke's are $3.95, oh! they only serve bottle water, and charge you $1.00, they say it is for charity?  We would never go back to this Restaurant !  Oh! they have Happy Hour!  which is $20.00, all you can drink, Domestic Beer and Well Drinks, which is really not a very good idea, when someone is young, and dumb !!!  I would say the only good thing about this Restaurant are all the TV's if you are a Sports Fan !"
        }, 
        {
            "index": 26, 
            "rating": 2, 
            "review": "My sister and I were on our way out of Vegas and wanted to grab something to eat. We had been at the Miracle Mile Shops the day before and remembered there were many places to eat. We actually stopped at Ketchup first, but the employees had horrible attitudes and the menu was extremely limited. So off to find another place since we knew there were plenty of food places. And we ended up at Blondie's.\n\nWe walked in an the first issue was seating. There were plenty of seats in this bar, a frat boy's dream. We didn't sit outside since it's in front of one of the 2 theatres here and therefore quite loud. We went inside, but a man (we later found out was a friend of our waitress) leaning WAY back in his chair.  Then we moved all the way to the back room where the tables are made specifically to play beer pong. There was a group having fun and playing all the way in the back. That wasn't an issue until the table next to us decided (after we sat down) to move to the table behind us and start playing. So we moved again. \n\nFinally at a suitable table, our bubbly waitress came by and took our drink orders (don't order the iced tea, it's grossly overpriced). I ordered cheese sticks and onion rings and my sister ordered a steak quesadilla. They were both good, basic sports bar food. Nothing more, nothing less. \n\nIt is a sports bar through and through, so remember that. Including the bathroom. Ugh (I only washed my hands). \n\nP.S. The Italian place next door looks lovely. I wish we had tried it."
        }, 
        {
            "index": 27, 
            "rating": 1, 
            "review": "Horrible, just say no.\n\nWe were going to Planet Hollywood for a show and I had just looked at groupon and saw Blondies.  So I thought the groupon would make it a decent price for a tourist trap and it was bar food, so we could find something there.  I looked online at menu and prices.  When we got there every item was $2 more than online.\n\nUpon walking in, she went to sit us out on the walkway, but we asked for inside to watch the game.  Then she took us to the back where many tables of rowdy and obnoxious people were playing beer pong beside our table.  We asked to go back out front, but in the meantime, the odd waitress \"yelled\" and I do mean yelled snidely at the beer pong people that their food was \"taking up her table\"....well, they were doing what they were paying a hefty price for... ordering bad bar food at hefty prices as well as wasting and drinking a lot of beer.  However obnoxious, they were the demographic.  That being said, I am not.  So unless you are currently going to \"keggers\" you need to find another dinner spot.  The food was horribly cheap and generic boxed food.  Three waitresses were having a disagreement behind the bar.  Two business suit pervs were feeling up the waitresses.    And while, the waitress who yelled at the other customers continued to not ever smile, she was actually working hard and efficiently, just minus any smile or happiness.  She did keep us refilled and said thank you when we left.  \n\nPretty much, this place was a complete cluster f.  (and for me to use that term is the only way to describe it).  The vulgarity is the only way to describe the place."
        }, 
        {
            "index": 28, 
            "rating": 5, 
            "review": "Great weekday drink and breakfast specials: $3 breakfast, $2 bud lights, and $4 fireball shots. Good place to drink and watch sports."
        }, 
        {
            "index": 29, 
            "rating": 5, 
            "review": "This was my first visit to Blondies. What a great spot to grab a drink and something to eat. My server Fernanda was the best! Extremely attentive, great service and always had a smile on her face. I'll definitely be back again! She pointed out the drink and food specials for the time of day I was there. Made suggestions and asked if I had any questions. Some of the best service I've had in Las Vegas. Check this place out if you are in town!"
        }, 
        {
            "index": 30, 
            "rating": 3, 
            "review": "My friends and I wanted to grab a cocktail, some lunch and watch the game and happened upon Blondies inside the Miricle Mile Shops at PH. Pretty much your typical sports bar, vast menu, a well stocked bar and waitresses in skimpy cheerleading outfits. A couple us were in the mood for breakfast and a couple of us were in the mood for lunch and the Blondies menu had something for everyone. I opted for a big breakfast sandwich that sounded absolutely delicious on the menu but when it arrived it left a lot to be desired, only at about half of it, not so good. The biggest suprise was one of my buddies ordred a pizza, now being from Chicago I never expect much in the way of pizza when traveling outside Chicago but this pizza was actually outstanding, perfect neopolitan(NY) style crust and generous toppings  and portion. \n\nAll in all Blondies suited it's purpose, feed a group of us that all had a taste for something different, get some booze in our systems and watch the game. Good serve and ok food."
        }, 
        {
            "index": 31, 
            "rating": 3, 
            "review": "I ate at Blondies the other night and enjoyed my meal. I had the grilled salmon and it was delicious, cooked just the way I like it. The white rice wasn't great and a bit hard, but I find many restaurants can't get white rice right. The sweet potato fries were good despite some powdered sugar on them (the waitress warned me that they come with powdered sugar). The service was just OK, and that's why I gave it one less star. The server never checked back with us, and it was really loud, but, hey, it's a sports bar. However, I would go back just for the salmon and perhaps the chicken caesar salad wrap, which my friend had. My friend said it was good, and it looked good."
        }, 
        {
            "index": 32, 
            "rating": 1, 
            "review": "Couldn't even tell you how the food was cuz no one ever came to our table after seating our group of 12 on Saturday around noon. Staff walked by a couple times ignoring us, and no one came to even acknowledge us. 15 minutes later we just got up and left. I guess they rely on their numerous TV's to keep their guests distracted to cover up their poor service. Too bad we weren't there to watch a game, right Blondies? Shame on this joint."
        }, 
        {
            "index": 33, 
            "rating": 1, 
            "review": "AVOID THIS \"RESTAURANT.\"  Just avoid it.\n\nThe service here is obscenely bad.  Possibly the worst I've ever encountered.  Had Nicole (or Nichole?) yesterday - she has star tattoos all over her arms and reddish hair.  We waited an HOUR for her to come by the table for refills while we waited for our food, and when we asked her \"Miss?  Can we get refills?\", she replied \"Give me a second.\"  My more astute friend said to us at the table,\"We've given her *3600* seconds!  Did she really just tell me to 'give her a second?'\"  We actually thought that she may have been high or tweaked out, because her behavior was also quite erratic.  Sadly, I left a 10% tip, which I NEVER, EVER do, but the service was just that bad.\n\nThe food tasted okay, but it took us 2 hours to get three items, and the place was about 40% occupied.  \n\nThis place is AWFUL."
        }, 
        {
            "index": 34, 
            "rating": 1, 
            "review": "This place is a joke. We did not even eat there bc the hostess said and I quote' umm Hi yah we don't have any tables and like I don't know when another one will be open' really?!?!? So we walked away naturally and around the corner there were three four seat tables open. SMH  She is lucky we are locals and we might try again another day..."
        }, 
        {
            "index": 35, 
            "rating": 2, 
            "review": "I don't really remember how we ended up here, but something about this place seemed to suck the energy right out of me! This place being a sports bar, maybe it was due to the fact that there was no good sports playing that day? The Buffalo Wings were actually quite good, the Cobb Salad was not bad, but the waitresses were useless, only performing the minimal amount of work their jobs required and lacked any sincerity or personality! Water is not free, you are forced to buy a bottle of their Blondies branded water. The washroom was disgusting! For a place that wasn't busy, more time should be spent cleaning the washrooms. This place was a BIG disappointment! \n\nTip for the waitresses: If you're muffin topping, don't work somewhere where you have to wear a tight cheerleader outfit!"
        }, 
        {
            "index": 36, 
            "rating": 4, 
            "review": "I only tried two appetizers when I was there but I liked them and the atmosphere. This is a sports bar, so it's loud and they have TVs everywhere. My brother wanted to watch a game, so I stopped in to say hello. I had some garlic balls and fried Mac & Cheese.....both yummy!! I def want to go back and try more. \n\nThey have beer pong tables set up and have tournaments certain nights of the week. Seems like a fun place!"
        }, 
        {
            "index": 37, 
            "rating": 1, 
            "review": "Terrible service and overpriced meals. \n'nough said."
        }, 
        {
            "index": 38, 
            "rating": 1, 
            "review": "Where do I even start? This place sucks ass! We sat down at the table and one of us ordered the Philly Cheesesteak.  The waitress says, \"If you want onions or mushrooms, it's an extra .35 each\"  WTF!!!!! A Philly cheesesteak sandwich is supposed to come with onions and mushrooms!   We ordered a large pizza, okay? Not some greesy dough covered in slimy, greasy cheese.  HORRIBLE! \nThen here's the kicker.  The waitress comes out with four glasses and four BOTTLED WATERS!  \"Hold up,\" I say, \"I didn't order bottled water...regular water is fine.\"  She says, \"Water is a dollar a bottle...it all goes to charity.\"  WTF????  \"Well, you really should have told us that when we asked for water,\" I replied.  The waitress just looked at me and said, \"Do you want the waters or not?!\"  \nOh HELL to the F*** no, you didn't, Bimbo. \nThe next time she came out to our table and asked if there was anything else she could get for us, I just said, \"Just more napkins...UNLESS...you charge for those too!\"\nAbsolutely, hands down, the WORST restaurant in the Miracle Mile!"
        }, 
        {
            "index": 39, 
            "rating": 3, 
            "review": "Great place to go to watch games while having some greasy bar food and a bucket of beer. Service is good too, the girls are spunky and efficient. you can make reservations a day in advance to reserve your seat for popular game days."
        }, 
        {
            "index": 40, 
            "rating": 3, 
            "review": "Located in Miracle Mile Shops at the Planet Hollywood. They do have outdoor seating, but it's in a mall so you'll be people watching. Lots of tvs, audio is on the bigger game that night. Some of the seating have beer taps which is awesome. Wings were great. I haven't tried the other food, it's quite expensive.\n\nIf you just wanna watch a game and drink, just go to a sports book with personal tvs and you'll save more money that way unless you're under 21."
        }, 
        {
            "index": 41, 
            "rating": 3, 
            "review": "Pretty cool spot with beer pong on Wednesdays. Expect slow service though especially for the all you can drink for $20. Even if the bar is slow"
        }, 
        {
            "index": 42, 
            "rating": 4, 
            "review": "Ok here we go cool place.  We sat at the bar and \nAnna was was nice good service she came to us right  away I was kinda picky and she had all the time for us \nFood was good but the chicken wings  one of the \nSMALL ONES ..I ever got ....\ncan but full of flavor ...\nGood place for tourists. .. or locals using Groupon LOL\n Just sit at the bar for a faster service ... \nGood luck ..."
        }, 
        {
            "index": 43, 
            "rating": 1, 
            "review": "Went to dinner here May 18th before seeing Lionel Richie for my brother in laws birthday.  There were 5 of us total at the table.  Our waitress was less than attentive, but paid attention when we ordered and even read it back to confirm.  When the food showed up 2 of 5 meals were wrong but our waitress as mia to complain.  When she did show up she didn't seem to care things were wrong.   My sister had to go to the bar to get water that she'd asked for twice already.  When we asked about a discount for the wrong meals a whopping $4.50 was deducted REALLY???  When the bill came they tack on a 4% fee for using a credit card.  Unbelievable to say the least.  We will never go back to Blondies and I'd suggest others avoid it and get a better and cheaper meal somewhere else."
        }, 
        {
            "index": 44, 
            "rating": 2, 
            "review": "Meh. It's bad food and crap beer. But it's probably the best spot to grab a drink inside the Miracle Mile shops at Planet Hollywood. Service is ok. If you're into drinking a whole bunch of crap beer, they do have unlimited drink wristband specials a couple of times a day. And they do often have $5 shots. So on the upside, while still overpriced, it's not as overpriced as some other places. But this is definitely not the kind of place you seek out. You just pop in for a beer when you're right near it."
        }, 
        {
            "index": 45, 
            "rating": 4, 
            "review": "I love the hot wings. They service a very generous amount of celery and carrots along with it with the wings. I usually have to ask for extras at other hot wing joint. I was a very satisfied customer."
        }, 
        {
            "index": 46, 
            "rating": 2, 
            "review": "Too expensive.  So-so service.  The garlic fries were ok.  Their Happy Hour only includes Bud and Coors, which you wouldn't know from their signs.  They no longer have the individual speakers so you can hear the audio from whichever game you choose."
        }, 
        {
            "index": 47, 
            "rating": 1, 
            "review": "Fraud! Don't go here. Went here because of signs saying there's an Oktoberfest with $5 foods and $2 beers and $5 beer mug for participating. It's not even a mug it's like a mini wine glass. Not even close to what all the signs say. The waitresses don't even know what it's all about. And the food isn't what they say. \n\nIt's sad you're spending all this money and you can't get what you want from what they offer on the sign. \n\nWon't come here again! Waste of money and time. Left hungry and thirsty. I felt bad for the kids too."
        }, 
        {
            "index": 48, 
            "rating": 4, 
            "review": "One of my favorite breakfast spots in addition to being a sports bar.  Opens at 7 am, and the breakfast is great and cheap!  The food is great and coffee is good too!"
        }, 
        {
            "index": 49, 
            "rating": 5, 
            "review": "Went here a few weeks ago on a Sunday morning and had a blast with some girlfriends! Shout out to the best waitress Cristen!! She was so attentive and funny! The wings that she suggested were definitely on point. We will be back again for sure thanks to the great food and service!!!"
        }, 
        {
            "index": 50, 
            "rating": 5, 
            "review": "My favorite sports bar on the strip. Love the staff! Everyone is friendly and attentive!"
        }, 
        {
            "index": 51, 
            "rating": 2, 
            "review": "Nachos were horrible.  Bar was fun with lots of half naked women.  Beer pong was great.  Don't eat here, just have some beers.  Average at best if you want to watch the game.  Big screens not HD."
        }, 
        {
            "index": 52, 
            "rating": 3, 
            "review": "Went here yesterday and i must say it definitely is a cool sports bar but the food is over priced . Total rip off."
        }, 
        {
            "index": 53, 
            "rating": 3, 
            "review": "I'm glad I read Jeannie L's review because it put me in perspective. I've always written reviews based on \"what it is\". I was ready to give this place a \"1\" due to the fact that this place is rated as \"One of the Top 5 Sports Bars on the Strip\" and it shouldn't be. Based on that, I'd give it a \"1\". Based on what you should expect from a Sports Bar, it ends up being a \"3\". Average food, a $20 all you can drink Happy Hour (3 PM - 6 PM) for well drinks and house beers, enough TV's, indifferent service (it feels like they are doing you a favor serving you). You can find hotties anywhere in Las Vegas so what makes their servers different? Found their prices to be higher than your average Las Vegas Bar. I won't be back."
        }, 
        {
            "index": 54, 
            "rating": 2, 
            "review": "Food was ok but the service was slow. Some servers ran around with their heads cut off while others just stood around."
        }, 
        {
            "index": 55, 
            "rating": 1, 
            "review": "If I were the owners of this establishment I would be so embarrassed! The servers are more concerned about their outfits than serving food! The waitress was cranky and showed no interest in serving us. She expected us to order the moment we sat down and then once we ordered she was never seen again!  We had to pay at the bar because she literally vanished! We spent most of our meal with angry guests on front of us complaining about how the restaurant overcharged their cards, and the waitress pretended she didn't know how to fix it. The food was greasy and not worth the price paid. And to add insult to injury both people in my party had an allergic reaction to the food! \nThere are too many other options to settle for bad food and crappy service! I really wish I knew how to contact the owners because we spoke to the manager and he did nothing! Never again!"
        }, 
        {
            "index": 56, 
            "rating": 5, 
            "review": "Food and beer are great, really friendly staff.  Danielle was a diamond! Really funny bar, would highly recommend for you're trip to Vegas!"
        }, 
        {
            "index": 57, 
            "rating": 4, 
            "review": "This place is great for guys. Tones of TV's with multiple sports on. They have beer pong tables and sell a beer pong pack with cups and balls for $5. \n\nHappy hour was between 3pm-6pm. Really cheap beer. \n\nThe waitresses were friendly, helpful and very talkative. The barman was also a really nice guy. \n\nGreat for groups."
        }, 
        {
            "index": 58, 
            "rating": 2, 
            "review": "Update:  The money was remedied, so I gave it an extra star for that and just having a great time with my friends.  \n\nWent out to party in Vegas last week for Pre New Year's Eve celebration at Blondies. Somebody had to screw something up. The i***t bartender charged us for another party's bill of $138.00 ON TOP of our own overpriced bill!!!   And it is not like we signed for that bill either.  We didn't notice this until 2 days after when we checked our account. Husband did call the manager said to get back to them as they are sure that bill should be refunded back to our account (of course that bill will first be deducted from our account, good thing we are not poor people).  I guess they have a tendency to do this to their clients...so people beware of this carelessness."
        }, 
        {
            "index": 59, 
            "rating": 4, 
            "review": "We watched the Kentucky - Louisville Final Four Game.\nGreat Service, Great Drinks, Good Food.\n\nReally enjoyed being here for the game. Sat with other fans - from Ohio State and Kansas.....\n\nI will come back here....enjoyed."
        }, 
        {
            "index": 60, 
            "rating": 1, 
            "review": "To be honest, it is Vegas after all, so i can't say I was expecting much. That said the bar is nice. Nice large TVs and a cool atmosphere, but the staff ruins the whole experience. We came here to watch the Charger game and they weren't even showing it. Still we pressed on and walked up to the Hostess booth. We were flat out ignored for 3 plays before I got annoyed and tried to grab the attention of the Hostess, who had been standing there the whole time with her finger in the air telling us to wait. I was told to \"Hold on.\" And so I did, much to my dismay. When she finally looked up she said nothing, just stared. We asked for a table and asked how long the wait was. Honestly the place was packed and so I expected to wait, but the girl said \"I don't know there's a list.\" We had to ask to be put on it and she said \"What's your number?\" and then turned around and walked off. I wasn't even sure she had actually written it down. We went in to try and grab a beer at the bar, but the bartenders were rude and didn't care. One of the hostesses ran into me and then rolled her eyes and walked away. Mind blown.... \n\nWe found ourselves wandering into a seedy looking little bar across the way called The Stripper Bar. I thought we were about to go in for round two, but the service was amazing, the food was good, they were playing our game, they had better deals on drinks and our waitress did a pretty good dance on the pole at half time. I don't care if there is a 50 foot stripper right outside of the place. And aside from that, Blondies' TVs are so freaking huge we were able to watch their screens from our seats in the bar, we just turned around. I'll pick this place over Blondies any day."
        }, 
        {
            "index": 61, 
            "rating": 4, 
            "review": "Why do people get so offended by this place? Did you not go to college? This is essentially a college bar on the strip. Who goes to a college bar to be blown away by the food? \nIf you go here do the following\n\nGo during happy hour, its all you can drink\n\nGo on college night, its all you can drink.\n\nGo to play beer pong\n\nGo to drink on the CHEAP on the strip\n\nGo to watch some sports\n\nOutside that DONT GO, it is not a place for date night or to have a 5 star meal. I mean this reminds me exactly of where I drank in college."
        }, 
        {
            "index": 62, 
            "rating": 4, 
            "review": "we came here only for wings! late! saturday night around 1am. no wait. no one was even there. i ordered the wings and wanted them mild. there were basically naked with a little sauce. but were actually good, we were too tried to order or ask for anything else. lol."
        }, 
        {
            "index": 63, 
            "rating": 5, 
            "review": "Amazing sports bar! This is what it is all about. Great waitresses cold beer and so many TVs you WILL find the game that you want.\n\nThis is a sports bar, so come here to relaxed and have a great time. If you want some great deals on beer then this is your place.\n\nGreat to come and relax and chill out!"
        }, 
        {
            "index": 64, 
            "rating": 3, 
            "review": "Got their appetizer platter for 20 bucks. It included jalapeño poppers, wings, chicken strips and macaroni and cheese balls. Wasn't the most amazing food but it definitely got its job done and filled us up. My boyfriend got a jack and coke for 10 BUCKS! Clubs charge this much, not sports bar! Not bad but nothing special."
        }, 
        {
            "index": 65, 
            "rating": 1, 
            "review": "Returned back to Blondies after not so good past experience. Due to bad review regarding one of their crappy cracked out severs we were asked to come back on owner vonns behalf for complimentary drinks. I decided to take my brothers into blondies for some drinks and appetizers. This time I chose to sit at the bar/ table  with 5 of my buddies. We ordered tap beers and some appetizers. Chicken wings, potato skins, nachos and some fried pickles. Bartender was excessively slow for how dead the restaurant was for a Friday. Food was just blah , bland bar food which was  under cooked and overly fried which hid the frozen flavor I assume. Waited around for this Vonn guy who claimed to be the owner but no one was able to get ahold of him. \n\nAll the of the staff were sitting in the back booth on their phones, and eating. I asked multiple times for side of napkins and ranches ( almost walked into the kitchen myself). Place is trash needless to say, restrooms were gross, next time use Mother Nature it will be a lot cleaner. \n\nI just can't get with this place and I'm not sure why the health department continues to allow this place to run. Chicken bones on the tables and floors. Staff was less than helpful everyone was \"busy\" like my last experience. Trash was scattered all around the restaurant while everyone just walked over it. I wanted to throw up my blondies me\n\nThey need a HUGE makeover!!"
        }, 
        {
            "index": 66, 
            "rating": 3, 
            "review": "More like 3.5/5\n\n$13 for cheese steak sandwich, no fries? Thats strange\n\nService was alright, nothing spectacular\n\nI do like the all you can eat Pasta for 9.99\n\nI'd eat here again"
        }, 
        {
            "index": 67, 
            "rating": 1, 
            "review": "Stopped in because we needed a small snack and wanted to watch the World Series.  If you are only going to drink and watch sports, this is a great spot, but if you want to eat you will be disappointed.  The food was subpar and generic at best.  Wings were small and tasted nothing but red hot sauce. He potato skins had no flavor at all.  I didn't expect a high end meal, but did think there would be some standards inside the PH."
        }, 
        {
            "index": 68, 
            "rating": 1, 
            "review": "4 stars for their all- you- can- drink beer pong deal from 3-6pm for $20 per person.  \n\n1 star for shorting me change on my bill!!  i ordered chips and salsa and the total was $6.34 (or something like that).  I gave her $10 and the waitress gave me back $3 and said, sorry we're out of change.  I couldn't believe it!!  So I said, \"because you guys don't have any change, you're charging me more for my food and shorting me my change??\"  She said, \"uh..yeah...i guess!\"  I said, \"I would think you would give me back $4 versus $3.  This is crazy!!\"  Poor waitress..not very bright, of course, didn't even get it so I let it go. \n\nI know it's only $0.64, but that's not the point.  That's absurd that they would even do something like that!!  I'm still in shock!"
        }, 
        {
            "index": 69, 
            "rating": 1, 
            "review": "Ate at Blondies on Friday of our Vegas trip. The server was nice, but wasn't very attentive. As others have noted, there is no free tap water, but they did give the first round of bottled waters free. They gave 3 bottles for 5 people. Food was mediocre bar food at best, not worth anything near the price we paid for it!\n\nThey had everything but pepper  on the table, wanted to ask for pepper but our waitress was in the kitchen talking. I was surprised when we got the check and a 20% gratuity was included. We left what we thought was fair considering the service we received  (15%) and the waitress followed us outside to let us know we had short changed her. When informed of that we didn't think she deserved that amount she told us \"It is called a tip, and it is mandatory!\" We ended up just walking away.\n\nMy least favorite part was about 2 hours later when the stomach problems started for 4 out of 5 of us. All 4 of us ate the hot wings (which were probably the best part of the meal) and ended up with stomach issues for the rest of the trip!\n\nI don't think I'll ever eat here again!"
        }, 
        {
            "index": 70, 
            "rating": 2, 
            "review": "I have to say that for the semi-bad rating i'm giving this place, I have been here twice.  I don't know why, it just seemed to be the right place at the right time.  There really isn't anything special about this place, it seems like your run of the mill sports bar.  The food was mediocre and the service was even worse.  And when I asked for water (everybody needs water in vegas; dehydration from the heat and excessive drinking) they only offered bottle water that was a $1.  I mean c'mon really?  Charging me for water?  So i opted for the cocktail instead (which also sucked, stick with beer)."
        }, 
        {
            "index": 71, 
            "rating": 2, 
            "review": "Food was very mediocre, and even for Vegas the price:quality ratio was offensive. The service was also very poor, leaving several from our normally carefree group a bit irritated. We showed up as a party of 8 split in half for ease of seating while it was busy but not packed - many tables were empty, no line, between lunch and game time. I had a $15 pulled pork sandwich, fries were a few bucks extra. The bun was stale and the pulled pork was the mass produced overly tangy bbq goop you get in a tub at the grocery store. I ordered a can of Guinness which overflowed the glass after a proper pour, so either their pints run small or the glass was dirty. The service was laughably bad, missed and forgotten drink orders throughout, and we waited far too long for the check."
        }, 
        {
            "index": 72, 
            "rating": 1, 
            "review": "Dirty, smelly, and stale. Waitress was nice an accommodating but even she couldn't overcome the high prices and generic atmosphere. If you want a college town bar environment, then Blondies is for you. If not then stay away."
        }, 
        {
            "index": 73, 
            "rating": 2, 
            "review": "Went at lunchtime on a Thursday.  The service was okay.  They make you pay for bottled water instead of a glass of water.  Food was just okay.\n\nThe bathroom was disgusting.  I can't believe this place gets away with this, being in a mall with upper class stores!  The paint on the flooring in front of the toilet was all worn away and greyish looking.  There was graffiti on the sanitary recepticle and no bag inside it.  Everything was dirty and worn out looking.  Yuck!\n\nI definitely wouldn't recommend to anyone and would not return.  There are much better places to try in Las Vegas!"
        }, 
        {
            "index": 74, 
            "rating": 1, 
            "review": "Was promptly seated by host only to be ignored by any waitress for 10 minutes. I called over the host and said we haven't been serviced. She grabbed a waitress walking by and said something to which that waitress said she'd be right over. She never came. 15 minutes after arriving and being ignored we left. So sad. We had heard so many good things about this place. It was a Monday about 1:15 p.m. and the place was hardly busy. Too many great options in Miracle Mile to put up with incompetent wait staff and absentee management."
        }, 
        {
            "index": 75, 
            "rating": 3, 
            "review": "$10 for a mug of beer, with the amount equivalent to 1 1/2 bottles. Not worth it. I chose a Cherry Bomb...thing, next where I was able to keep the glass, so that made me feel less cheated.\n\nThe idea of this place is great, and I wish we had Blondie's over in Miami, because those tables were wonderfully huge. But it's obvious you're paying extra money for where you're at, and there weren't even any drink specials. We were there from around 4:30 until 6:30 or 7ish, when you'd figure there would be a happy hour."
        }, 
        {
            "index": 76, 
            "rating": 3, 
            "review": "I think a lot of people are going to Blondie's for the wrong reasons. The thing is you gotta walk into this place knowing what you're getting yourself into. Blondie's is basically a Hooters that hosts beer pong games. Forget about the food, forget about anything else but beer and you'll be okay. Am I saying it makes up for their poor service and prick bartenders? Nope. But I'm just making a point.\n\nI went here last night, pretty damn late with a group of guys (a majority of whom were Marines). We went to play beer pong pretty much and that is what we did. The beer pong tables were pretty packed and everyone around us was having a good time. It was pretty loud and fun and all the people around us were nice (tossing back balls, joking, just having a good time). It was 4th of July weekend so we were all doing what Americans do... drinking beer and yelling about how much we love America.\n\nWould I go out of my way to eat here? No. Would I go back if I weren't with a bunch of Marines playing beer pong? No. But it's a fun time for what it is."
        }, 
        {
            "index": 77, 
            "rating": 1, 
            "review": "Meh. Greasy food served at Vegas prices. Four of us went there on Tuesday, the place was NOT busy; a dozen or so patrons in the place- plenty of seats @ the bar. The waitress (pleasant and friendly) took an inordinate amount of time to wait on us, process our order and actually get us our food & drinks ( cold curly fries are NOT tasty). Overall, we were underwhelmed. Skip it. The waitstaff wasn't taxed by a bunch of full tables, the bartender was just hanging out and the two cooks/managers/delivery guys that dropped off our food appeared unhurried and laid back......so the problem might be managements approach to motivating the staff to move faster - and prepare BETTER FOOD !! I give this place 1 Lemmon, 1 pear and an orange."
        }, 
        {
            "index": 78, 
            "rating": 1, 
            "review": "The worst service in all of Las Vegas. We waited 45 minutes for our food. It was lunch and it was not busy at all. When we asked to speak to the manager, she totally avoided us. So we gave her 5 minutes to come to our table. So when she did not come, we told the waiter we were leaving. All 15 of us stood up and left. We just paid for our drinks. I would not go to this place if I were you. There are far better serviced places @ the Miracle Mile shops @ Planet Hollywood. Look up Hash-Hash a go go. Far better place."
        }, 
        {
            "index": 79, 
            "rating": 5, 
            "review": "This place I happening!!  Good drinks, food and a place to watch sports n UFC"
        }, 
        {
            "index": 80, 
            "rating": 1, 
            "review": "What a scam....\"resort charge\" when you pay by credit card. Not that anyone tells you before you order either. \nThey simply add 4% to your bill as a resort fee.  \n\nWhat a ridiculous fee for a crappy restaurant.\n\nNever again"
        }, 
        {
            "index": 81, 
            "rating": 1, 
            "review": "Dirty restrooms, cold, old, frozen food, terrible service, no visible manager to talk about an issue, bartender handle complains. Expensive food 25 dlls for a very small dozen of wings witch it has more bone that meat 35 dlls for a fatty tasteless burn ribeye, 25 dlls for a burn break a part hamburger with hard as a rock hamburger bun plus a 8 dlls side of 8 pieces steak fries don't even mention a overcooked salmon and chicken breast"
        }, 
        {
            "index": 82, 
            "rating": 3, 
            "review": "OH. The food is just....horrible. \n\nAnd that's all I can really say about this place. \n\nIf you get a salad, you will regret it. If you get the pizza, it will make Pizza Hut taste like gourmet pizza heaven. The only semi-decent food are the chicken wings (get them mild or spicy). Plus, the food is super expensive for what you get. I'm talking about $4 for soft drinks, $6 bucks for a basket of fries, $15 for sandwich wraps. I usually have no qualms about paying for food, but when it sucks, it just makes me frustrated.  \n\nSO. I'd give this place only 1 star for the food, but I give it an extra star because it's a fun place to watch sports games. Lots of televisions, loud and fun crowd! And I gave it another star because our waitress was super friendly and nice. We were pretty needy (more BBQ sauce please! refill on lemonade please! can we have more salad dressing?) but she was great. I don't remember her name...I just remember she was a blonde girl."
        }, 
        {
            "index": 83, 
            "rating": 3, 
            "review": "Went here late at night for some food. There is not too much to say about this place. It was pretty empty for a Sunday night, probably because it is nestled deep in the Miracle Mile Shops at Planet Hollywood that are mostly closed that late. We ordered Mozzarella sticks and each got a wrap and a drink. The Mozz sticks were good, and the wraps were fine, but both were pretty expensive. The bill was almost $70 which I felt was a bit excessive for the amount of food we got. The wraps did not even come with fries. I'm sure this place is more fun with more people, when it's more of a bar than a late night restaurant. This is just my experience.\n\nThe waitresses wear Cheerleader uniforms, and were pretty attentive, though the bartender was slow with our drinks."
        }, 
        {
            "index": 84, 
            "rating": 1, 
            "review": "maybe a 1.5 stars for me, maybe.\n\nso my friends and i stroll in here while our trek through miracle mile shops at planet hollywood. the only reason why i walked in here was for the beer pong. another beer pong joint on the strip besides oshea's?! awesome! of course i compare the two: oshea's wins hands down. cheaper and better service.\n\nso my friends and i get a table here, get our beer and set up. round one, i lost, that's cool, there really are no losers in this game anyways (that's what i tell myself when i'm stuck with more beer than i can handle). then again, i already had a 1/2 yard of some sort of vegas juice in my system, so i wasn't feeling like chugging more down. a friend gets more beer and we are setting up for a next game. next thing we know, we are all being told to finish up our games b.c they are setting up for a ufc fight. they start taking down tables and take cups to re-fill our pitchers. excuse me, wtf?!?! why would your guys at the bar sell us beer for beer pong if they know you're gonna set up for a fight in a bit. that's some shady ass shit!!! so i ask where can we sit to finish our beer. \"go talk to the hostess honey, all these tables are reserved.\"\n\n\"honey?! who you callin' honey?!?!\" then i start on some rant, yellin' and throwing punches in the air, one of them actually punching one of the bartenders out! as the rest of my fellow beer pong patrons cheer me on and join in on the ass kicking fun!!\n\nyeah, that never really happened, but all i gotta say is that you got a place with bartenders sportin' mohawks, seriously, every single one of them had one! i dunno if it's a requirement, but that should've given me the clue to stay away. douchebags might as well have been wearing ed hardy shirts.\n\nwe ended up getting a seat b.c we just sat down at a table and a waitress came by with a menu. the food was your typical bar food. but i was inebriated so my mini corn dogs and fries with honey mustard sauce was poifect fro my drunchies.\n\nthe only reason for 1.5 stars is the beer pong, i will always have a place in my heart for beer pong."
        }, 
        {
            "index": 85, 
            "rating": 1, 
            "review": "We wanted to watch some football and tried to give this place the benefit of the doubt but sadly all is true, everything about this place SUCKED!!! If you're staying @ PH towers or shopping @ the mall save yourself and your wallet! Avoid this place! You would probably get better service and a free cup of water @ McDonald's lol!"
        }, 
        {
            "index": 86, 
            "rating": 1, 
            "review": "This place was complete crap we got a crappy waitress with an attitude never check once to see if we wanted something more to drink didn't bring no napkins are forks and slammed the glass of water on the table and has the audacity to ask why I didn't leave her a tip dumb blondes I'll never eat here again!!!"
        }, 
        {
            "index": 87, 
            "rating": 2, 
            "review": "TV's are plentiful, to say the least. They have approximately 2 gazillion of them.\nThey crank up some sweet tunes during commercial breaks, which is a fantastic idea and really increases the enjoyment of the sporting events.\nThe food is mediocre at best.\nThe service is horrendous. Your waitress will sometimes disappear for 20-30 minutes. \nThe prices are high, given the low quality and bad service.\nI almost dropped them to ONE STAR, since they have a BYU flag. BYU sucks and their fans (by and large) don't drink... or tip."
        }, 
        {
            "index": 88, 
            "rating": 1, 
            "review": "If I could give this place a negative review is I would do so. Worst service ever girls like you and outfits but food wasn't good drinks were way too expensive. Skipping find another place."
        }, 
        {
            "index": 89, 
            "rating": 2, 
            "review": "Staff was friendly and great service but that was about the only plus. \nFor the of their frozen burger patty I could have walked down the way and ate at a gourmet burger spot for about $2 dollar more and Im sure it would have had twice the flavor. Over priced beer, over priced food. With all the options in Vegas spend your money else where. There was nothing that made this place stand out as a cut above the rest."
        }, 
        {
            "index": 90, 
            "rating": 1, 
            "review": "I wish I could give this place a big fat ZERO star! This place SUCKS! Food was terrible, service was terrible and the manager asked me \"so...what do you want from me?\" After I complained about the service...or lack thereof. Party of 8 and they came to our table once. BOOO!!! Close this terrible place down! Wish I would've read the reviews before coming here."
        }, 
        {
            "index": 91, 
            "rating": 2, 
            "review": "We came here for a Monday brunch.  Nothing special.  Although the place was not crowded at 11:30 am, it took us 1/2 hour for us to get our order.  No points there, food was average.  Although we did notice 4 people playing beer pong at the backside of the restaurant.  Our waitress was friendly but seemed elsewhere."
        }, 
        {
            "index": 92, 
            "rating": 2, 
            "review": "A poor excuse for a sports bar. Granted, we ate here purely to be able to dine \"al fresco\" (or as much as it can be while in a casino), but the beer selection is abysmal and my meal wasn't really even up to bar food standards. The tomato soup tastes like it came from a can and my spinach salad had unidentifiable ingredients. Plus, it was all over priced.\n\nAlso, FYI to the waitresses, when a customer order san appetizer, it should come out BEFORE the rest of the meal."
        }, 
        {
            "index": 93, 
            "rating": 4, 
            "review": "Blondies has a great \"sports bar\" ambiance and a laid-back \"be yourself\" vibe.  I love the pizza and the cute young girls in cheerleader outfits.  I'm not even into sports yet visit Blondies about every 2 months.  The beer specials are good.  My only complaint would be the small and inadequate bathrooms - but, who spends much time in there, right?"
        }, 
        {
            "index": 94, 
            "rating": 4, 
            "review": "I came here on St. Patty's Day in 2008 and it was so much fun!!!\n\nWe paid $30 (or was it $25) for all you can drink... and boy did we have our fill of green beer!!!! \n\nThey have beer pong tables... which was A LOT of fun... it's a very casual and kick-back atmosphere and the people there are really down to earth and cool.\n\nIt seemed like everyone there was there to have fun.. no drama, no frills.. just plain old fun!!!"
        }, 
        {
            "index": 95, 
            "rating": 2, 
            "review": "Went here to watch some football games and have a few drinks. We were staying in Planet Hollywood so it was convenient and good for a group of people. We got in and got a table right away. The tables are pretty cool because they have taps right in the middle and you can poor your own beer and pay by how much you drink. That would have been awesome for our rather large group except the selection is limited on what beers you can choose and our waitress kept encouraging us to get buckets of beer because she didn't want to deal with the hassle of turning on the taps. We ended up getting buckets of beer because she kept pushing us to even though we really wanted draft beers. It became evident later that she was just lazy and didn't want to come back and serve us. I think she checked on us one time in the several hours we were there. We had to go to the bar to order more beers because she decided to sit in a booth in the back and fold silverware. I know the forks won't roll up in the napkins themselves but come on check on your tables. We had to hand deliver our credit cards to her because the bar couldn't check us out. Overpriced beers even for Vegas and the service is terrible. Go elsewhere."
        }, 
        {
            "index": 96, 
            "rating": 1, 
            "review": "We were in a rush to grab dinner before a show and stopped in at Blondie's because there was no wait and it fit our budget. They were out of most of their beers (probably thanks to it being New Year's week). Out of our group of six, none of us were overly impressed with the food. My turkey wrap was okay at best and the pizza was disgusting.\n\nService was slow and almost dismissive, despite the fact that they weren't overly busy.\n\nThere was a very loud group taking up the entire back half of the restaurant. I of all people totally understand others wanting to have a good time, but the guys who came over and insisted on \"starting up a conversation\" with our group of girls (a.k.a. making a poor attempt to hit on us) disturbed the end of a below average meal and also got in the way of us trying to pay our checks. I would have had a more pleasant experience eating fast food. Perhaps if we wanted to just stop in for cheap light beer and beer pong (ugh) we would have enjoyed ourselves more."
        }, 
        {
            "index": 97, 
            "rating": 1, 
            "review": "went to blondies with a group of 9 people. we were seated immediately which was impressive. the only plus of the evening. we were told by the waitress it was impossible to all have separate bills. a little annoying...then when the food arrived it was horrible. 2 entrees were sent back. it was not offered as would be typical to order something else. waitresses simply said you didnt like it? nope. and she just took it. then delivered a pizza that was ordered. the two girls splitting it started eating and realized it wasn't what they ordered. when we called the waitress back over and explained the situation her response was that she noticed it was the wrong pizza and asked the cook but he said it was the pizza for our table. she said she double checked her order to make sure she put it in right and she did. ....so she brought the wrong pizza to the table ANYWAY and never said anything.......hoping we wouldn't notice???? What?  she then offered to bring it back and just throw the toppings that were supposed to be on it on there.  we said no bc its supposed to be cooked on. didnt even offer to get a new pizza. at that point another person at the table asked for a side of ranch and were advised it would be extra!!! we asked to speak to a manager. who happily skipped to out table. seemed somewhat childish, flippant and unprofessional for someone in his position addressing a customer complaint. each person who talked to him he litterally hopped to. he then offered to remove only half of the cost of the pizza bc half was eaten before we noticed it was the wrong one. to add to it the waitress said she couldn't bring 6waters with the food bc it was too much to carry. and then asked asked we wanted a box to take the rest of that pizza home...........horrible service. overpriced food and drink (oh btw. they brought the wrong drinks too), unprofessional and d effinately dont knkw thier own menus. one of our top worst experiences."
        }, 
        {
            "index": 98, 
            "rating": 4, 
            "review": "I've been here twice now. Nice sports bar to grab beers, bar food and watch some games. Several TV's and fun atmosphere.  Didn't partake but they had some beer pong tables and other games to add to the mix. Not a great selection of on tap beers for a place like this but I was able to find a couple I liked. Probably come back for a game and beer."
        }, 
        {
            "index": 99, 
            "rating": 1, 
            "review": "Don't order the all you can eat pasta. The marinara sauce was watery and had no flavor. Service was okay. If you do like pasta and watery sauce, order one order not the all you can eat. The garlic bread was tasty but that was it. There were six of us and we all ordered the all you an eat. The people who ordered the chicken Alfredo pasta said the chicken had no flavor and was rubbery."
        }, 
        {
            "index": 100, 
            "rating": 1, 
            "review": "I work in the mall; but came here after a 9 hour shift. I was here for a dodgers game (3-4hours). I had my waiter come with a bill every 30 minutes. It was horrible I could have just watched the game from home. These people wanted m gone ASAP. I spent about $100at the sports bar me and my wife and felt like they  antes me out. Not a he beat it peace to watch a game. Stay home watch the game there or go to Ketchup Bar. No rush to leave. Bet racist too. People in front of me where white and never were hurried to leave and I was shown the bill 3 times in les then 4 hours."
        }, 
        {
            "index": 101, 
            "rating": 3, 
            "review": "This review only focuses on breakfast.  This place is located in the Miracle Mile shops near one of the \"squares\" with entertainment and other eateries.  There were at least 4 other restaurants advertising cheap breakfasts.  This place had a sign for $2.99 eggs, meat and potatoes.  When we sat down I immediately noticed that toast was extra and guess what?  It was $2.99 too!  They also charge $2,00 for coffee so they actually are more expensive than the other places.\n\nOn the positive side, the food was good and the service quick.  As a plus, it's a sports bar so all of the tv's had ESPN on which I watched while I ate.\n\nMy wife and I split an order of toast to get a sense of satisfaction."
        }, 
        {
            "index": 102, 
            "rating": 1, 
            "review": "Worst service, we get there and ask for seating outside but she said we can't put 5 people in front. (Tons of empty tables). Then we ask for the wooden booth towards front and there are drinks on it and we would have waited but she led us back upfront and said she can put a 5 th chair at a 4 top, I asked if she can put two tables together she said no, here's your 5 th chair, and she walked away. \nTerrible so-called fettuccine Alfredo. Our server Jessica seemed to be annoyed at the fact that my family sat in her section. She rushed to hear our drink order then she came back and I had to rattle everyone's order off as if I was an auctioneer because she had no patience. So when she cut me off as I was trying to ask her a question I stopped and asked if she was in a rush because I felt rushed. We had just walked 4 miles to get to the place because my 8 year old daughter wanted pasta with butter. So we trekked to find it. When we did find it we were relieved,and didn't know what we were in for. We are on a family vacation or I would have spent 1.29 to boil my own spaghetti to feed three kids at home instead of wasting $58. My veggie burger was ok except for the ton of seasoning salt that she probably told the cook to pour on it because I asked her if she was in a rush. Good thing I caught it before I ate it and I had to wipe it off with my napkin. I should have asked for a manager but I decided to be quiet and not get my girls upset because they were starving. Again , waste of money and never been treated so horribly before at a sports bar! Oh and drinks were filled right before she gave us the check I had to drink from my kids drink. The one star was for the sweet potato fries. \nDeeply regret going there. Actually am upset my kids were present to see it. I have terrible heartburn also."
        }, 
        {
            "index": 103, 
            "rating": 2, 
            "review": "I had buffalo wings and a side cesear salad.  The food was fine.  Nothing special.  Not too overpriced considering it is located on the strip.\n\nI was told that they do not serve tap water (only bottled) so I was forced into purchasing a soda.\n\nThe service was horrible.  There were about 30 people dining and only one waitress.  The other waitresses were on break or hadn't started their shift.  I could see them sitting around texting on their phones while I got bad service.\n\nThey turned on the audio to some basketball game.  It was way too loud.  I had to scream to my friend sitting accross the table.\n\nThe food is 3 stars.  The service is 1 star.  Averages to 2 stars."
        }, 
        {
            "index": 104, 
            "rating": 5, 
            "review": "Good spot for starting the day early with a boozy brunch. Our bartender was Belle and she was awesome."
        }, 
        {
            "index": 105, 
            "rating": 1, 
            "review": "Daniel (manager) wouldn't stand behind his \"product / advertisement\" as he denied us the bucket of \"domestic beer\" for $25 (Miller Lite / Coors Light), outstanding service provided by our server (Kimberly). Wings were good, drinks not so much."
        }, 
        {
            "index": 106, 
            "rating": 3, 
            "review": "Shopping our way around the Miracle Mile shops this was a likely pit stop to \"refuel\" since it's the halfway point for the mall.  Seating is available inside or on the \"mall patio\".  Bartenders were very friendly and service was prompt.  Prices weren't too bad and they have more than enough tv's to cover every game you might want to watch.  I'd stop here again for a drink and maybe an appetizer next time thru."
        }, 
        {
            "index": 107, 
            "rating": 5, 
            "review": "Came here for a drink the other night and had a great experience. Great sports bar located in the Planet Hollywood hotel. The bartender that night, Belle, was amazing. She was very attentive and the drinks were made really well. Great place to watch pretty much any game going on while having a good drink and great service. Stop by if you're in town!"
        }, 
        {
            "index": 108, 
            "rating": 2, 
            "review": "EHHH...\n\nMy friends came to Vegas and wanted to try this place out because they had coupons for it. I expected it to be blah, since I checked the reviews of the place before hand. I ordered their chicken sandwich, which was grilled (and BURNT AND REALLY TOUGH/HARD ON THE ENDS OF THE BREASTS!) Oh my gosh! It made me full though, since I didn't eat anything that morning and afternoon. The only thing I ate good here was the curly fries (and the honey mustard...and definitely the dill pickle....and my unsweetened ice tea)\n\nOh btw.......you have to buy a small water bottle here...which is a $1...and they give you a cup with ice....\n\nThere is a happy hour from 4-6pm...$10 all you can drink Bud, I believe....They also have this HUGE pitcher of beer which is great for a group of friends...(forgot the price, but it's very affordable!) You can also play beer pong here too!\n\nThe waitresses were dressed in skimpy cheerleading outfits, which many were not very tasteful in. Don't eat outside unless you want to hear a load of noise during your meals, since it's right across from that performing arts stage with acrobats! It's a bit quieter inside, even if the sports games are on. It could get very LOUD though when there's a big game!"
        }, 
        {
            "index": 109, 
            "rating": 5, 
            "review": "This place is amazing!! Wonderful atmosphere, amazing drink specials and some great food! I will recommend this place to many friends! I will be sure to go back when i want to meet some cool people or just have a few beers and watch the games!!"
        }, 
        {
            "index": 110, 
            "rating": 2, 
            "review": "Having been given a $25 coupon to the Miracle Mile Mall restaurant (located within Planet Hollywood's shopping center), my husband and I went here looking for a filling yet fun dinner. The wait staff lives up to the Blondie's logo - female only waitresses sporting XXS cheerleader outfits, snug enough to showcase their tan stomachs and a hint of their bottoms. Forcing the feminist in me to get over the use of costuming and gendered employee selections (this is Vegas, after all), we made friends with our waitress, a Brazilian woman, and ordered water and sweet potato fries for starters, only to find out that the restaurant does not supply water but does sell bottles for $1 each. Typical Vegas nickel-and-dime tactic. The sweet potato fries were served with powered sugar on top and a side of honey - absolutely and unexpectedly delicious (the unexpected part based on the college-sport theme of the restaurant the constant advertisements for $10 all you can drink buckets of Miller). My husband ordered a Philly Chicken Cheese sandwhich, which was tasty yet quite processed and dry. My spinach, raspberry, and blue cheese salad was abundant in size and delicious, with plenty left over. Our choice of dessert was fulfilling: a rich brownie with ice cream and walnuts. \nHoping for a pleasant reprise, we returned to Blondie's the next week to redeem another restaurants.com coupon. To our dismay we saw a sign on the hostess station posting that the restaurant no longer accepts restaurant.com coupons, and when asked why, the manager gave us no reason. They offered us a 25% discount in trade, which would not even be worth it considering they charge just for water. \nGo to Blondie's if: You are dying to see your college team flag sported somewhere in Vegas; if you want some good sweet potato fries - only; if you want some cheap happy-hour beer deals; if you are more interested in foreign 20-something waitresses in skin tight, butt-cheek-revealing cheerleader uniforms. \nDon't go to Blondie's if: You want a good deal; if patriarchal marketing tactics offend you (though this IS Vegas...); you have kids with you; you want superb food at a superb price. And finally - don't go if you have a restaurant.com coupon! Jamnit!"
        }, 
        {
            "index": 111, 
            "rating": 5, 
            "review": "It was good. Breakfast special was all week ... Heck yea? So we had the specials Bloody Mary and bud light and $3.99 and the omelet. Someone  asked to take our photo we never got it... Though . Kinda upsetting"
        }, 
        {
            "index": 112, 
            "rating": 4, 
            "review": "Going to Vegas tonight and was thinking about this bar.  I came here a few years ago for a Paquiao fight.  I remember the $60? entrance fee which included unlimited bud/bud light.  We had some chicken wings and the one that was the best I had in a while was the habanero flavor.  It was pretty spicy for someone like me that like spicy and it had a great crunch.  But yeah I thought those were some of the best wings I've had.\n\nI forgot the name of this bar in the beginning so decided to find it on yelp and to see such low reviews.  I was thinking to stopby for those spicy wings again."
        }, 
        {
            "index": 113, 
            "rating": 5, 
            "review": "If you want sports, this is THE place!!! Whether it's football, baseball, soccer, UFC...they have it all on BIG screens. Great food and drinks!! Great staff!!!"
        }, 
        {
            "index": 114, 
            "rating": 2, 
            "review": "Sadly, ESPN zone doesn't exist anymore (I LOVE ESPN Zone very, very much) at the New York New York, so we went here. \n\nIt did fine, but it buried deep in Planet Hollywood, and not close to the outside. People watching was on the low and the waitress wasn't too alert to us. I had wings and a Coors, he had a chicken sandwich and long islands. Remember, it was barely noon. I'd probably find a place that was closer to the outside. I wanted sunshine and warmth."
        }, 
        {
            "index": 115, 
            "rating": 1, 
            "review": "There is a eaten chicken wing at the table I was seated at. Um? I assume the staff didnt care about the cleaning of this table before seating us. With that being said, have a nice day lol. Never coming here again. Adios."
        }, 
        {
            "index": 116, 
            "rating": 5, 
            "review": "I went here like a year ago. Service was great. personally i love being around good looking blondes so that was a plus. I had the Fried Ravioli.. They were Perfectly fried and Im going back this month can't wait to go and try some other things on there menu..."
        }, 
        {
            "index": 117, 
            "rating": 2, 
            "review": "Meh.  It was ok.  Burger doesn't come with fries and was $15!  Salad was big.  Pizza took a while but they explained it would take longer because they made it on-site.  Good to know that - I'd hate to have them get it from another place.  The employees didn't really seem too interested in their job.  I know they see lot of tourists but it says a lot about the business when they are talking to you and looking somewhere else.    The guy in the back I had to ask for a bag for my leftovers was very nice.  He's probably the only reason it got 2 stars."
        }, 
        {
            "index": 118, 
            "rating": 1, 
            "review": "I was there Saturday May 26th and got what i think was E coli virus from a salad. I would be careful when ordering, staff was nice."
        }, 
        {
            "index": 119, 
            "rating": 1, 
            "review": "Waitress Heidi super nice. However, the food was just soooo BAD everything.  The ice tea was like water....spoiled milk, buffalo chicken wrap was almost like a dog food!!! Don't know why this restaurant still in business. First ever review so unhappy! Have to be drunk to eat there never again!!!"
        }, 
        {
            "index": 120, 
            "rating": 2, 
            "review": "We were in need of some mid morning beers while walking through the miracle mile shops and stopped in at Blondies - the place was pretty empty so we snagged a table outside for some ample people watching. They have $20 all you can drink beer but we just settled for pitchers. Their beer selection was pretty disappointing for a sports place but luckily they had preseason NFL games to keep us occupied. Inside of the restaurant reminds you of a dirty 'ol college bar so I'd recommend sitting outside, unless you like the whole frat house beer stains everywhere thing."
        }, 
        {
            "index": 121, 
            "rating": 3, 
            "review": "We went by during lunch because we saw a sign for wings. Neither of us ended up getting wings. I got the big bowl of pasta for $3.75 and my husband had a grilled cheese. The spaghetti was pretty decent actually and came with two huge pieces of garlic bread. Grilled cheese left a little to be desired. Service was great though!"
        }, 
        {
            "index": 122, 
            "rating": 1, 
            "review": "Decent sports bar, but overpriced, 4 beers and nachos $90."
        }, 
        {
            "index": 123, 
            "rating": 1, 
            "review": "Bad bar food, poor service and defiantly only for people who want to play beer games. I would have been ok with the \"bar\" atmosphere (since it is a Sports BAR) if the food wasn't gross and service wasn't bad. I wont ever go back."
        }, 
        {
            "index": 124, 
            "rating": 1, 
            "review": "Terrible experience.  First of all there was only one blonde waitress in the whole place, they are out of Bud and Bud Light, slow service and our waitress was not the friendliest.  I ordered the nachos and it had a nice amount of chips but only enough toppings for a quarter of the chips.  My wife asked for a lemons for her water and the waitress brought out one lemon slice.  I ordered a beer and the waitress brought the wrong one out so I had to wait for the correct one to be brought out, after waiting 10 minutes for the first one.  NOT HAPPY."
        }, 
        {
            "index": 125, 
            "rating": 1, 
            "review": "Worse service ever! My wife and I stop by for dinner after a long drive up to LV. Since we were staying at HP we decided to eat close. We sat down at 6:50pm, the waitress never came by till I flagged her down. At around 7:40, I asked her about our food, she leaves then come back and tells us that she forgot to enter my wife's meal and says it will be right up. Tic Toc, Tic Toc, at 8:28 the food comes. The food was nice and hot, not bad, but not worth the wait. When the bill comes she leave it on the table and walks away, not a word! I open it and she over charged us for a extra drink, chips and salsa which we never had or ordered. \n\nThe staff is a bunch of young kids, they were more busy texting than helping out the paying customer!\n\nStay far away!!!"
        }, 
        {
            "index": 126, 
            "rating": 4, 
            "review": "Good service and fun atmosphere. Katherine was friendly and attentive (+1 for her). We both had salads which were huge, oriental for me and Caesar for her."
        }, 
        {
            "index": 127, 
            "rating": 3, 
            "review": "If you're a sports fan, then this is the place to go. They serve typical bar food that isn't the greatest. \nThe grilled cheese with bacon wasn't anything spectacular. It was pretty bland.. Who thought  you could go wrong with a grilled cheese? \nThe waitress was very nice and the atmosphere was good"
        }, 
        {
            "index": 128, 
            "rating": 2, 
            "review": "Not the highlight of my Vegas trip.. The waitresses are dressed in high school cheerleader outfits but their attitudes were shitty.. Like they were pissed that they had to dress in stupid uniforms and serve us.. hello, you applied for the job, no one put a gun to your head. The prices are expensive for normal, boring American fare, the waitresses are not sexy, pretty or charming and the food was just OK.. I like sport bars so it is hard for me to give only 2 stars, but in this case I will."
        }, 
        {
            "index": 129, 
            "rating": 5, 
            "review": "5 stars only cause my server Marissa was outstanding, she really knew her menu & had plenty of  recommendations of what drink to get from the bar :) I will defiantly be coming back because of her & the potato fries !"
        }, 
        {
            "index": 130, 
            "rating": 5, 
            "review": "I was pleasantly surprised last night at Blondies. I was strolling through Planet Hollywood shops & playing a little at the Casino. Wanted to have a quick bite, nothing to big & decided to stop by. It was during the week so the crowd was light. I really liked the sports bar. There was flat screens everywhere of course. The appetizers were awesome full of flavor, I ordered a chicken Cobb salad & that was delicious. They give you your monies worth. The waitress was attentive, although they did seem short of staff (but that could of been because it was a weekday). I also had a great Frozen Strawberry Margarita or 2 haha! I usually don't like margaritas but the waitress recommended it & I was impressed. You can actually taste the liquor. It didn't take like a Slurpee from 7Eleven w/cheap liquor. The bill was decent, nevertheless the waitress got a nice tip &  I will definitely be going back when I'm at Planet Hollywood."
        }, 
        {
            "index": 131, 
            "rating": 2, 
            "review": "We stopped in here to get a burger but never ate. The hostess was not there to seat us and waited awhile to be seated and after being seated we sat there for almost ten minutes before someone finally came to wait on us. After the 10 minutes of waiting we realized the menu sucked as well. So we just opted for the bucket of beers. And guess what it says 5 for 25 and then we were told that was the wrong price too and it cost more and they are aluminum bottles fyi. I can't say much about this place. Also another FYI make note that they have a hidden charge for using your card and not cash. It is on an itsy bitsy little sign on the front of the hostess table."
        }, 
        {
            "index": 132, 
            "rating": 5, 
            "review": "This is the place I go to for beer pong! Thursday night tournaments is where it's at! Whether it's a weekend or week night this place has a crowd. It's a great place to pre-game. The staff is great & so much fun! They have improved the look of the place, by adding a ton of tvs. The food is always good, try the chicken strips, & the bar is always full! Beer pong is $5 for setup & the cost of the pitcher. They have about 8-10 beer pong tables depending on the night. It's only a handful places left in Vegas that offer beer pong nightly. I highly recommned Blondie's as your official pre-game place! If you're looking to watch a game/s & NOT be at a sports book, this is one of the top 3 places on the strip you'll want to consider."
        }, 
        {
            "index": 133, 
            "rating": 5, 
            "review": "My family was welcomed by a server named Ashely who took care of us. From entering and leaving our lunch was great & we were well taken care of,  Because of Ashelys service, we will be back the next time we visit vegas. Thank you Ashley !!"
        }, 
        {
            "index": 134, 
            "rating": 2, 
            "review": "If our service had been better I would have given a 3 star review, but that was by far one of the worst parts of the meal!\n\nDrinks are overpriced and WAY under-poured! $9 for a glass of Chardonnay in a sports bar is a freaking ripoff!! \n\nEveryone at our table is in the food service industry, and it's why we went there as we had credit to use. \n\nThe food is your typical Sysco spread of wraps, sandwiches, and msg coated curly fries! The only stand out was the Cobb salad but at almost $15 it was a ripoff also! \n\nWe will not be back, and I honestly would suggest to not dine here unless you are in it for their all you can drink program! Such a let down!"
        }, 
        {
            "index": 135, 
            "rating": 5, 
            "review": "Great service! Great food! I think you should check it out!!"
        }, 
        {
            "index": 136, 
            "rating": 2, 
            "review": "This was not a pleasant experience.  I went in one afternoon during the NHL Finals and set at the bar.  The bar was completely full, yet there was only one bartender.  He was nice, but obviously not super attentive.  I didn't even attempt to order food because I was afraid I'd end up wasting my whole day there.  And it seemed to me the place wasn't very clean.\n\nGiven the theme, I was expecting a more upbeat atmosphere.  If I give them another shot, I'll be particular about when I go.  Overall, I'd recommend walking a little further down to Twin Peaks... it's all-around better."
        }, 
        {
            "index": 137, 
            "rating": 1, 
            "review": "If you want overpriced garbage go here I paid $45 for a pizza and 12 wings I guess they expect you to win the money in the casino so you have some to throw away at this dump"
        }, 
        {
            "index": 138, 
            "rating": 1, 
            "review": "Went to Blondies on 12-28 to watch the Lions/Packers while visiting Vegas. Bad decision. Food is way over priced, service is bad and the beer prices are $$$! The Lions/Packers game was the featured game yet at the start, they had music blaring so loud and no game sound. They tuned in the game on several Tvs but they were not synced. Several of our food orders were cold. A much better option is the Mexican Cantina across the mall!"
        }, 
        {
            "index": 139, 
            "rating": 5, 
            "review": "We arrived today and decided to stop in for the all you can drink for $20 happy hour. I'm not sure why some people have reviewed poorly but my guess is they didn't get our AMAZING server Taylor!  Not only was she super attentive but she was so personable and pleasant. I would recommend this to anyone!! Our drinks were super strong and we left a great experience overall. Drinks and hot wings...you can't go wrong!"
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "Blondie's is such a fun place to kick it! Pizza is AMAZING! Nick and Niall are hilarious and so fun!"
        }, 
        {
            "index": 141, 
            "rating": 2, 
            "review": "Good place to watch the game but nothing else. Lots of TVs around. The food is whatever's. It is bar food. The garlic fries were super greasy. The chili cheese fries tasted good. And they use cheese whiz. The Philly cheese steak lacked flavor. Burgers/sandwiches are about $16 each and don't even come with fries. It's super expensive here."
        }, 
        {
            "index": 142, 
            "rating": 1, 
            "review": "This was a waste......... over priced!!!! my burger was burnt the service was worse don't go here no manager around no one checking to see if everything is ok. NEVER AGAIN!!!"
        }, 
        {
            "index": 143, 
            "rating": 5, 
            "review": "Being from Chicago this bar reminds me of two from home.  They are a bar.  They have TVs.  They get you drunk.  I have now been here 3 times and will keep coming on every trip.  First trip we were all 21 and they had a $10 bud light and beer pong wristband.  We got drunk.  Second trip i'm 26 with all of my cousins and aunts and uncles they have a $20 wristband we all get wasted.  We sat at a table the waitress never came so we ordered from the bar and got wasted.  We had a great time and the next morning we had to piece together the night.  3rd trip out there during football sat at the bar and had a bartender / barback named g being really cool with us.  He even gave me a jameson bottle opener from a promo they had.  We are planning a trip for the end of September and plan on going there at least once.   EVERYONE LISTEN HERE IF YOU TIP WELL THEY WILL TAKE CARE OF YOU.  YOU WILL NEVER HAVE TO WAIT."
        }, 
        {
            "index": 144, 
            "rating": 5, 
            "review": "Came here for the UFC Fight on Saturday night.  Bought tickets for a table for 6 knowing only two were going to come for sure.  $40 to get in and ALL you can drink draft beer is SWEET!  Actually worked out cool finding 4 random people to watch the fight with.  Definitely will be going there for the next UFC Fight, $40 will get you 5 bud light bottles elsewhere.  The staff was cool with how busy it was and I had some Jalapeno poppers that were great!  A fun spot inside Planet Hollywood in the Miracle Miles shops.  Check it out, fun place and good food!"
        }, 
        {
            "index": 145, 
            "rating": 4, 
            "review": "2 1/2 stars?? \n\nEveryone musta missed the 20$ open bar happy hour. the wings aren't bad either. of course the bartender lags upon flashing your wristband. get everyone to kick in some cash and throw the bartender a decent tip, like anywhere in vegas,  they'll definitely keep the rounds coming. they also have beer pong tables, if you're into that kinda thing.\n\ndefinitely a good place to kick off friday night in sin city."
        }, 
        {
            "index": 146, 
            "rating": 1, 
            "review": "We tried Blondies for the first time and the food was terrible. Spinach artichoke dip and burgers were very greasy.  The server was very friendly but we will not return."
        }, 
        {
            "index": 147, 
            "rating": 5, 
            "review": "Loved this cute little sports bar inside Planet Hollywood! Brandon was our bartender, he was super fun, quick with our drink orders and very attentive!!! Food was surprisingly awesome here too! Highly recommend this bar!"
        }, 
        {
            "index": 148, 
            "rating": 5, 
            "review": "Fabulous weekday breakfast special. Way better than the Salsa place across from it. Will eat here everyday when I go back. Kudos and don't change your prices."
        }, 
        {
            "index": 149, 
            "rating": 2, 
            "review": "So, my husband and I were hungry and just wanted something close by where we were staying, so we decided to try Blondies. \n\nWe ordered the regular size pepperoni pizza. I asked for a water and they waitress stated they only have bottled water!  I will never pay more than $1 for bottled water, so I ordered a soda. \n\nThe pizza was good. Our waitress sucked. My husband never got a refill on his drink and the cup sat there empty.\n\nWhen the receipt came I was so angry to see a soda cost $4!!! Really?! So $30 was the total for a pizza for two and two sodas! \n\nI would never come back here."
        }, 
        {
            "index": 150, 
            "rating": 4, 
            "review": "Went here for breakfast based on an article about cheap Vegas breakfasts.\n\nOMG!!! Was so good, went back the next day.\n\nBreakfast burrito was excellent...and so big I couldn't finish.  My only complaint was no decaf coffee. Oerwise, I highly recommend."
        }, 
        {
            "index": 151, 
            "rating": 2, 
            "review": "We didn't eat food at Blondies because it's a rather sub-par version of a sports bar.  We sat on the patio which looks out to the mall.  We met a group of friends there as they were finishing up their mediocre bar food.  We sat at a tall patio table but were never acknowledged by the waitress.  Instead, she walked passed us many times but never made eye contact.\nI went up to the bar to order a beer and to grab waters for our table.  The bartender was friendly but he informed me that there is a minimum if you want to pay with a credit card.  Luckily I had cash to pay for my beer.\nI'm giving two stars instead of one, simply because the bartender was nice.\nOverall, a crappy experience.  I wouldn't go back."
        }, 
        {
            "index": 152, 
            "rating": 5, 
            "review": "We LOVE this place!! My boyfriend & I originally went in April of 2012 because I found a deal on Living Social for Blondies. We were so impressed with it that we bought another Living Social deal and brought our friends on Sunday March 24th.\n\nIt was packed due to a pub crawl, and I wasn't expecting to get very good service simply due to the massive amount of people. I was so wrong - Silvia was our server & I can honestly say she's one of the best servers I've ever had, anywhere. We all LOVED her!! I can't recommend this place enough & if you choose to go, ask for Silvia!!"
        }, 
        {
            "index": 153, 
            "rating": 3, 
            "review": "the food was just average, i'm gonna play beer pong next time, our server was hot"
        }, 
        {
            "index": 154, 
            "rating": 2, 
            "review": "Decent food, but slow service during happy hour! Our server told us \"we could go to the bar and get our own drinks\"."
        }, 
        {
            "index": 155, 
            "rating": 4, 
            "review": "We had a large group attend the Super Bowl at Blondies. We had a great time. The draft beer selection was lacking but the bottle service was awesome. The bar drinks were even better, big pours with more on the way! The food was good. The service depended on who your server was, ours was great. \n\nAs far as a place to go to watch a UFC event or big game? You can't beat it. Dozens of big HD TVs every where. We will be back neck year for sure. \n\nIf I had one complaint it would be the restroom. There are not enough men's facilities and they need a cleaning during big events."
        }, 
        {
            "index": 156, 
            "rating": 4, 
            "review": "The food and drinks were fine, pizza was really good. Our server seemed a little flighty. I ask to see the drink menu because I wanted a mixed drink. She handed me the list then walked away. She may have been giving me time to look it over but a little communication that she would be right back would have been nice. Tons of TV but audio for only one game."
        }, 
        {
            "index": 157, 
            "rating": 3, 
            "review": "My choice for the grilled chicken was ok, but very small portion. my friends were suffering from their food choices. I didn't like their food, also it's overpriced."
        }, 
        {
            "index": 158, 
            "rating": 5, 
            "review": "Great place to catch the games! Ashley P took great care of us both times we were in! Definitely coming back!"
        }, 
        {
            "index": 159, 
            "rating": 1, 
            "review": "Worst place ever! Came in on Friday night. Hostess nowhere to be found. The bartender was touching and grabbing on the other bartender the entire time there. 5 people working and one actually working. The wings were horrible. Just bad. No flavor. The silverware was wrapped but was crusty and not cleaned. I will never ever go back."
        }, 
        {
            "index": 160, 
            "rating": 5, 
            "review": "19.99 All You Can Drink AYCD! Came here this past weekend got to watch the USMNT vs Jamaica game and it was great. Happy hour was perfect had a ton of beers and a ton of well drinks, the waitress we had was pretty on point brought me drinks before I could even ask for any. \n\nThe only problem was we sat on the outside and the TV wall had the lines through it so I couldn't get a cohesive picture, other than that it was a blast."
        }, 
        {
            "index": 161, 
            "rating": 5, 
            "review": "Great place to watch sports on the strip and the food is not your regular bar food. Fernanda was my server and was very attentive."
        }, 
        {
            "index": 162, 
            "rating": 2, 
            "review": "We went here for the Cotto vs. Martinez fight, got here an hour early and the place was packed. The man at the front entrance stated the fight was going to be displayed on the outside entrance of the bar, we waited on the outside for awhile, we were lucky enough to grab two seats, the two male bartenders were un-attentive, couldn't get a drink.\n\nThe black male at the front entrance later made an announcement the fight was going to be displayed on the inside of the bar, and since the demand to watch the fight was so high they were going to start charging everyone there to watch the fight, complete bullshit, they advertised online that the fight was free, we called in to double-check the fight was free, when we got there we informed the man at the front entrance we were there to watch the fight, he let us in then 30 minutes later tried to charge us? After we argued he said we were fine, that we were grandfathered in since we were there before they decided to start charging people.\n\nNow we were upset because we wasted 30 minutes outside of the bar to find a seat, when we could have been inside waiting for a seat. When we called earlier they said they didn't take reservations, when we proceeded to the inside of the bar there were 3 tables reserved, no one sitting at them to watch the fight.\n\nOnce again we were lucky enough to find seats on the inside at a table of 4 with only 2 guys sitting there, they were nice enough to let us share the table.\n\nOur waitress is the only reason there is 2 stars, I'm not sure of her name, but she was very nice, very understanding, and decently attentive for how packed the place was.\n\nThe food, we got a Chicken Caesar Wrap and a side of fries, the wrap was full of lettuce and very little chicken, I got 2 quarter sized pieces on my half, we assumed the chicken would be grilled as most are and instead it was deep fried. The fries were very soggy and greasy, they weren't bad though. The price on the menu for the wrap was $13 and some change, we got billed $16 alone for it and some change plus tax. Menu error? Waitress error? 2 Touch Pos system error? Who knows.\n\nNow right before the main fight starts, a waitress comes to our table and places a reserve sign on our table without saying a thing and walks away. We yelled to get her attention, she came back and said our table will be reserved for the fight, we said we were watching the fight, she told us we would have to pay for the table PLUS have to pay to watch the fight. COMPLETE BULLSHIT, I don't know who manages this place but you don't advertise a free fight on the internet, you don't tell people over the phone the fight at your bar is free and that you aren't taking reservations and then decide to change your mind, to charge people for the fight, to charge people for tables, and start taking reservations because the demand is high  to watch the fight, unbelievable. \n\nAfter arguing with the lady and telling her who we talked to and what they said, she went to confirm with him, came back and said we were fine. Not one person in this bar knew what the hell was going on, completely disorganized and chaotic. \n\nWhile watching the fight a man that was very intoxicated fell and hit his head on my barstool, he could have injured himself very badly, I'm not sure who his waitress was, but it was her job to cut him off long before he got to that point, after he fell and hit his head, he couldn't stand up on his own a friend had to help him, even after that, he still didn't get cutoff. If this place continues this type of service they will lose their liquor license.\n\nThe only reason I would come back here is because our waitress was so nice, other then that management needs to get their sh*t together, that's not how you run a sports bar."
        }, 
        {
            "index": 163, 
            "rating": 2, 
            "review": "The worst place we ate at for breakfast. Coffee was terrible, toast was hard and the bacon was terrible. The service was also pretty slow. Keep walking and try the la salsa Cantina for breakfast."
        }, 
        {
            "index": 164, 
            "rating": 3, 
            "review": "Summary: This is a great place if you want to watch a game/sports and drink loads of cheap beer while eating some (to my surprise) pretty good bar food. Since I don't drink - sadly the cheap / all you can drink beer was a waste on me. I'd bring a crew here for sure.\n\nI went to Blondies to view the UFC fights (Go John Jones!) - cover was a bit overpriced $40! BUT I forgive that for the cheap beer - again, wasted on me - but I can see how paying $40 cover + $20 = damn good night for some folks. \n\nAtmosphere: What you'd expect from a sports bar - loads of TVs, etc. If you have a big group you can \"buy\" a big booth with primo viewing to the screens, if youre a small group or solo - there's plenty of seating available.  The people in this place range wildly - you are in Vegas. I found mostly friendly sports-watching-having-a-good-time people. \n\nFood: HEARTY portions, and surprisingly pretty good. I had a BLT and shared some onion rings, both of which were not greasy and overdone - but tasted fresh. Even the toasted bread on my sandwich was fresh. \n\nService: Decent. I was happy that the girls in cheerleader uniforms weren't so boob-a-licious that it was annoying. They were cute and friendly, and bless them for having to run around with pitchers of beer serving half distracted sports watchers. They were fast, I didn't wait forever, and there was enough of them that i never had to flag one down.\n\nOverall - better than Buffalo Wild Wings for a little in-hotel Vegas sports action."
        }, 
        {
            "index": 165, 
            "rating": 3, 
            "review": "Cheap $3.99 breakfast mon-fri if your on a budget or don't want to spend much. It's inside the mall by the box office."
        }, 
        {
            "index": 166, 
            "rating": 2, 
            "review": "Hmm, well it's relatively affordable as far as Vegas goes. And they have a lot of TV's. There was room to sit here as opposed to PH's sports-book bar that was packed to the brim. The 'famous' chicken wings were anything but. I feel bad for the midget chickens that these came from. The chili fries were okay. I'd go back in a pinch, but it wouldn't be my first choice."
        }, 
        {
            "index": 167, 
            "rating": 3, 
            "review": "You could do worse than this place to chug cheap brews, play beer pong, do jagermeister shots and watch a game.  The atmosphere is almost like a supped up Brother Jimmy's NYC. \n\nHappy hour for $20 from 3-6pm includes all you can drink well drinks and beer which is a very reasonable way to kick off an evening or destroy the rest of your day.  I guess that depends on you.  I haven't tried the food but it looks like I shouldn't based on a lot of the reviews.  \n\nI'm just as bad at beer pong now as I was in my late teens (if not worse) but it's still fun."
        }, 
        {
            "index": 168, 
            "rating": 2, 
            "review": "I am not liking this place but to watch the game here would be cool as they have tons of TV's everywhere...and super loud! I barely could hear the group that went with me here! \n\nThis was located in the Miracle miles shops. It's a sport bar kind of place. The ladies here wear cheerleader type outfits that show a lot of cleavage and I am sure the men that go here love that. Service was pretty good thou. ;p\n\nThe bench seats were pretty cool but the food is only ok. We ordered their traditional wings. It was deep fried but they over soaked it with the sauce that made the chicken soggy. We ordered their nachos with all the fixings but it cost over $21! Was not worth it as it was flavorless or nothing special about it. We ordered the $3.99 all you can eat pasta. There is a choice of fettuccine Alfredo or spaghetti. It came with garlic bread but it was kinda soggy thou. I think the past was pretty good for the price due to size.\n\nBathrooms were kinda nasty. They need to really clean it. Sorry but I won't be coming back!"
        }, 
        {
            "index": 169, 
            "rating": 4, 
            "review": "I'm not sure I understand all the hate for this place.  It has everything you'd want from a sports bar.  There are tons of TVs with easy viewing from every angle.  The TVs are crisp and clear and sound is good too.  Service has been stellar and superfast.  Beer is cold and reasonably priced.   If you go in expecting food better than bar food, you'll be disappointed.  But it isn't that bad for bar food.  Overall a big thumbs up for Blondies."
        }, 
        {
            "index": 170, 
            "rating": 1, 
            "review": "The food was bad and over priced.  The waitress was slow and not helpful.  She couldn't even think of anything to suggest we get when asked.  Also, she served me a beer that was only 3/4 full and charged me $5 bucks for those 6ozs of bud light.  \nThe bartender single handily ruined the night for the group with rude comments and D bag behavior.  At one point he called out some people in our group over the PA system to stop cheering about the beer pong tournament because they were annoying. This caused a few of them to be insulted.  They were not out of control or anything... just gave a woot to our friends who were playing.  \nBut hey no worries, Mr. Bartender,  I'll never suggest to any of my out of town guests, who are looking for some fun, to spend any of their money at Blondies."
        }, 
        {
            "index": 171, 
            "rating": 1, 
            "review": "Came here to watch a UFC fight and had several problems:\n\n1) Bait & Switch: Advertised price was $40 cover charge to get all you can drink beer. Upon arriving found out that all you can drink special didn't start until after preliminary fights were over 2 hours later.\n\n2) Packed: Are there fire laws in Vegas? They packed so many people into that small space. Everyone was standing shoulder to shoulder.\n\n3) All you can drink = 2 beers: There were so many people that once the \"all you can drink\" special started it was almost impossible to get a beer. There was no way to get to the bar and the waitresses serving beer were mobbed by the people around the bar so people in the back could not get a drink. By the end of the night we were only able to get 2 beers each out of the \"all you can drink\" special. \n\n4) No security: As the evening progressed a group of fans became more and more rowdy. There was no security presence. At the end of the fight they began jumping on chairs, shoving and falling on other guests. Nothing was done to stop them or protect the other guests. \n\nThis place may be nice at other times, but I do not recommend coming here to see an event."
        }, 
        {
            "index": 172, 
            "rating": 1, 
            "review": "Dont waste your time or money.  Poor service, food quality horrible..but gave it a star for very cold beer and clear flat screens."
        }, 
        {
            "index": 173, 
            "rating": 4, 
            "review": "Came here while strolling thru the Miracle Mile Shops. I was pretty hungry and didn't want to wait or blow a wad of money, so burgers came up. This place looked fun with the sports bar theme and TVs playing video clips. The outside (in the mall) seating was high bar tables and regular tables in the middle. \n\nOur server Belle, came over quickly and got us waters. She was great. She offered us some suggestions and was always available when we had a question. I went with the burger as I was craving one. I was really expecting overpriced mediocre bar food, but was surprised by the burger I got. It was really good! Just a cheese burger with bacon, pepper jack cheese, and jalapenos - well done. It was served on a buttery brioche bun with all the usual veggies. It was greasy but that's what I wanted - wasn't looking for health food here. The burger was flavorful and a good sized patty. I did finish. Paired it with a Shocktop brew and was sittin pretty. \n\nSaw another table serve up a huge pitcher of beer with a spout on it. Next time..next time... haha. Food was good, filling and didn't break the bank. I have plenty of other places to do that in Vegas. Vibe was fun with the cheerleader waitresses and music playing. Definitely worh a look for your sports bar / burger spot in the mall."
        }, 
        {
            "index": 174, 
            "rating": 4, 
            "review": "I do not understand why the rating on this bar is so poor!  The service was amazing when I was there never going long without being checked on.  Our food was very tasty as well!  There was a very good selection of beer on tap to keep you from getting thirsty too.  I recommend the \"shock top\" beer as it is one of the more tasty American beers that I have ever tasted.  When I can find it back home I pick it up too.  \nEven during US college football playoffs of some kind I was able to watch the Outdoor Classic hockey game with a bunch of other hockey fans around one of their many big screens.  I highly recommend this sports bar!  The waitress's outfits don't hurt the eyes either!\n\nYou are even able to watch the fountain show across the way as well from the seats on the outside of the bar proper and that is quite interesting as well."
        }, 
        {
            "index": 175, 
            "rating": 4, 
            "review": "We wanted to catch a quick bite before the 8:30pm variety show in the miracle mile shops. Such a nice surprise in an overpriced shopping mall!\n\nFood: We sat at the bar. I ordered a side salad, potato skins and hubby ordered 1 dozen of barbecue wings. He said the wings are good. My potato skins are the best I have ever had! because they are super crunchy outside and soft inside, topped with crispy bacon and scallions. They taste like deep-fried baked potato. The best part is that the sour cream came on the side, so the crispy potato skin did not get soggy. Also they put the salad dressing on the side without me asking, so you can decide how much you want. \n\nAtmosphere: Tons of different large TVs with more channels than I can watch. I am not a sports fan but I was thoroughly entertained. \n\nService: The bartender did warn us that the potato skins would take 15 minutes to make, because they are made to order. He is exactly right with the waiting time! Attentive"
        }, 
        {
            "index": 176, 
            "rating": 5, 
            "review": "If you're in Las Vegas, you HAVE to stop by Blondies.  The place is always packed with a fun group of people.  Everyone gets really into the games, which are playing all over because they have tv screens everywhere.  \n\nIf you stop by, CHECK IN!  You get a free drink if you check in on Yelp.  They also have a ton of really great mixed drinks.\n\nEven if you aren't a sports fan, you'll like this place.  Their menu has a lot of variety, so it's easy to find something you'll like.  (I hard a hard time picking my meal because there were so many great looking options.   Also, (especially for downtown Las Vegas), they have really reasonable prices.  \n\nOverall, the food is great, the drinks are even better, the atmosphere is fun, and the location (on the Strip) is perfect."
        }, 
        {
            "index": 177, 
            "rating": 1, 
            "review": "Quick summary: poor and disrespectful bar management. Everything else (food) etc cannot comment on, but having a manager disrespect our whole group was enough to think this place is not worth it. Please read to avoid a similar horrible experience. \n\nHad a beyond horrible experience here. Came to watch an NCAA game this past Saturday with a group of 5. We got there and the service was horrible. We basically served ourselves by going to the bar to get drinks. The waitress didn't start paying attention to us until she realized we were ordering a lot of drinks and would have a big bill. \nHere comes the fun part! Someone on my team got hurt and was on the floor. The opposing team's fans at the bar yelled stay down to a kid! So of course I said that's rude and they proceeded to start a chant calling me an \"ahole\". Fine I let that one go. Towards the end of the game when the other team clearly was about to win the same fans started the \"ahole\" chant again for no reason. So I asked the manager if he was going to let that happen at his bar and he said \"this is a sports game, get over it.\" I said ok I understand that but are you still going to accept this kind of behavior and bad environment at your bar? And he said yes. So I left the bar. My friends went to go talk to him and he said rudely \"you don't talk, I'm talking.\" Who says that as a manager? His demeanor in handling this situation was rude and demeaning.  I get that it's a sports game, but he should not one that kind of environment at his bar or treated customers that way. I don't know what his problem is but I did complain to upper management and I hope they will handle the situation accordingly. \nUpper management was very gracious when I told them my situation and I appreciated that. As for bar management HORRIBLE! I don't know how he got this gig as a manager.  As an FYI it was an older man that was the manager on duty for this instance. He could care less about customers and only cared about himself.  No respect for other human beings what so ever. \nSo if you want to watch sports somewhere where they actually care and respect you as a customer, do not go here. I'm sorry to say this after speaking to upper management but other customers deserve to know what a bad environment this is."
        }, 
        {
            "index": 178, 
            "rating": 1, 
            "review": "I don't mind paying high prices in Vegas for good food, but this is a let down.  Terrible bar food, using no fresh ingredients.  After trying 3 different items there (Ruben, sliders, and cheese steak) it's time to throw in the towel.  I won't go back.  Service was average, but not what you expect in Las Vegas, a city that operates on service.\n\nIf this place depended on repeat business they wouldn't make it long."
        }, 
        {
            "index": 179, 
            "rating": 3, 
            "review": "Sat at the bar to watch the game. Wings were good. The margarita machine was terrible. Thought it tasted like a dirty machine. Tried the rocks version, worse. Stick to draft of mixed drinks and you will be fine."
        }, 
        {
            "index": 180, 
            "rating": 2, 
            "review": "We came here during a football game.  They had great music going during the commercials and a great vibe going on.  \n\nWhen we walked up, we told the girl we needed a table for two.  She said, sorry, we don't have any tables.  Okay, then can we get on a list?  She says, \"I guess so!  With the game on, I just don't know if anyone is going to leave soon.\"  (She didn't really seem to want us there).  Another girl walks up and says, \"oh, there is a table right here.\"  Another girl says, \"No, that's for another party.\"  So we give them our name and walk towards the bar.  Before we make it to the bar, a waitress comes back and says that we can have that table because the other party doesn't want it.  Geesh people, make up your mind!\n\nWe ordered two frozen drinks that were a special.  Something black cherry.  They came from a machine on the wall.  They were SUPER frozen.  After letting it thaw out, we finally gave it a taste and YUCK!!!  It tasted like cough syrup.  I guess maybe we should have sent it back but they were only $3, so we sucked it up and each drank about 1/2 of our little glass in the hour that we were there.\n\nI ordered the roast beef sandwich and fries.  My friend got the grilled chicken wrap.  They were both okay.  Nothing special.  The fries were just average.  The waitress we got was actually really nice, so we can't knock her.  She initially charged us $5 each for our drinks but then changed it when asked."
        }, 
        {
            "index": 181, 
            "rating": 2, 
            "review": "After catching a show at the nearby V Theater, wandered over to Blondies when it was still located in the Aladdin Resort & Casino name.  It was probably a Tuesday, and that meant all you can drink beer and well drinks for $10.  \n\nWalking into the back, tables of beer pong were in full action and it reminded me of fraternities gone wild.  There were even girls making out for the mere sake of making out in Vegas and having guys gawk at you.  (It wasn't even that late yet and the girls were far from drunk!)  \n\nBartenders were less than friendly, probably because they aren't making any tips during all you can drink beer nights.  And with that crappy attitude, what's the point?  \n\nIt's a bit of pain, they won't even let you in to eat or watch the games on the television without paying the $10 up front.  So, that part sucks alone.  They make you wear one of those bracelets anyway saying that you paid for all you can drink, so why not let other people in to eat?  \n\nI personally wouldn't bother returning. I'm not interested in revisiting college frat life.  But if that' what you're looking for or am missing, swing on by!  You'll fit right in with your Greek letters.\n\nThey apparently have a happy hour here too."
        }, 
        {
            "index": 182, 
            "rating": 3, 
            "review": "Went on a Sunday.. Only to watch football.. The service started off pretty Rocky, but got a bit better with time and with more alcohol. The food was ok, then again, I was loaded. The waitresses are barely outta diapers and run around lost half the time. Nothing to brag about."
        }, 
        {
            "index": 183, 
            "rating": 2, 
            "review": "Only reason I'm even giving it 2 stars is because the food was decent.. Service not so much. And when you go to pay they tell you it's a \"minimum\" 25 dollars if your using multiple credit cards when that little fact is clearly not stated ANYWHERE. She tried to say it charges the house if it's under 25 dollars. Either management is completely stupid or the owners a penny pincher, either way I've never had that happen before and def won't be back again."
        }, 
        {
            "index": 184, 
            "rating": 2, 
            "review": "Two stars is being generous. Slow service, average food at best, and high prices.\n\nOrdered fish and chips and the fish was cooked using grease that had not been changed in several days. \n\nBeer menu is severely limited with only one or two decent beers not made by Budweiser. Ordered Alaskan Amber. Over 10 minutes later, the waitress reappeared to inform me that they were in fact out of Alaskan Amber, which they only have in bottles in the first place.\n\nToo many other good options at Planet Hollywood. Scratch this option."
        }, 
        {
            "index": 185, 
            "rating": 1, 
            "review": "This place should be called beer pong bar because that's all there is.  Well, plus some to small 40 inch tvs so far away they can't easily be seen. Wont go back."
        }, 
        {
            "index": 186, 
            "rating": 3, 
            "review": "A bustling sports bar with every fried food under the sun, and every game imaginable playing.  Tons of beer and liquor. I wouldn't eat here if I wasn't with 7 other mid-30s guys wanting to drink and watch games.  But that was my crowd, and Blondie's served a good purpose.   Doubtful I will ever visit here again..."
        }, 
        {
            "index": 187, 
            "rating": 1, 
            "review": "Nice bar in Planet Hollywood but drink prices are thru the roof. Drink card on table does not post prices. For example 12 ounce bottle Bud Light was $6.00. One of their signature drinks posted on the card was $15.00 and only about 6 ounces in a very small martini glass."
        }, 
        {
            "index": 188, 
            "rating": 1, 
            "review": "Absolutely terrible. I came here to watch a game, and legitimately they have a million TVs which is nice. I ordered nachos which were 30 dollars after I added chicken, guac, sour cream, and Jalapeños, all things that should automatically come with nachos. The nachos were a pile of broken store bought chips covered in that terrible liquid cheese you pump onto chips at a movie theater. The chicken was some weird unseasoned ground flavorless stuff. The guac was also store bought, and the jalapeños came on the side instead of being in the nachos.\nThen since it's in the middle of the building there isn't much reception so I try to log onto the WiFi. It says you can do it if you check in on facebook or if you have a password. I asked for the password and they said they wouldn't give it to me, that I had to check in on facebook. I'll be damned if I'm going to advertise for them after such terrible food. I guess the 30 bucks I paid for nachos wasn't enough for a WiFi password. F this place."
        }, 
        {
            "index": 189, 
            "rating": 2, 
            "review": "Went here for Sunday football.\n\nWe had to put 200$ down the reserve a table. No big deal because with 8 of us we spent that much and they took it off the bill. Only thing was that it made it challenging to pay the bill because everyone neede cash.\n\nAt first things weren't going well because we had to wait 20 mins for the party before us to leave. (Their game went into ot) then it took 20 for our waitress to come by. But from there we were good.\n\nFood was ok.\n\nPrices were ok.\n\nOur waitress was great. (Kristen of rhs fame)\n\nProbably would go back but was ok."
        }, 
        {
            "index": 190, 
            "rating": 3, 
            "review": "Great for all-around sports fanatics and even for the not-so-big sports people.\nWhether if you're a die hard fan or just a simple casual fan who's supporting your friends/family/significant others team, this restaurant have great atmosphere. \n\nOne of the few drawbacks with Blondies is if you have your heart set to watch the game here, you would need to make reservations pretty far in advance. You can do that by either calling the restaurant or make a reservation through their website. With walk-ins, it's pretty much the luck of the draw. If there's an open seat available at the bar, you better take it. First seat you see, you better sit your a$$ down because we walked around the restaurant hoping to see an open table somewhere and by the time we wanted to go back to the bar area, those seats were taken. All within 30 seconds.\n\nThe food was good. Typical bar food. We ordered a buffalo chicken wrap, patty melt and we shared this BIG OL BASKET of garlic fries. Such a huge portions of fries....I'm kinda fried-out for the month. (And for those who know me, I LOVEEEEE MY FRENCH FRIES.) But ugh...no more. =/\n\nOverall, pretty decent place to watch your Sunday football games.\nBoyfriend can grab a seat at the bar, get a drink while the girlfriend goes shopping for a bit and then join the boyfriend later. =) Perfect Sunday, right folks?"
        }, 
        {
            "index": 191, 
            "rating": 4, 
            "review": "A great place for good grille food.  Sit on the patio to peoplewatch.  The service is good.  We had a group of 10 and the staff was very accommodating."
        }, 
        {
            "index": 192, 
            "rating": 3, 
            "review": "Been here twice for two different occasions. Very laidback. Convenient location inside of PH. Quick drinks, nothing fancy. Fun place to go with a group of people to play beer pong and flip cup. The entire back of the bar is set up just for that. But be careful, it can get pretty rowdy during peak times and beer pong gets pretty competitive."
        }, 
        {
            "index": 193, 
            "rating": 2, 
            "review": "I ended up eating here due to not having enough time to eat anywhere else.  This place is in the Miracle Mile near Planet Hollywood.  It is literally across the walkway from the The V theater.\n\nThe 25 ounce beer was great!  The Chicken Strips were almost inedible due to the batter on the chicken being too hard/crunchy.\n\nI would say pass on this place."
        }, 
        {
            "index": 194, 
            "rating": 4, 
            "review": "Pretty cool place! They have countless tvs with all kinds of sporting events on them, and they have a system where you can listen to your game over your smart phone. This way there isn't fighting over who's game should be heard. Downfalls... the people don't know what channel the games are on. Tried watching an LA Kings game there and was told repeatedly that it wasn't available. Luckily my brother know the owner and regulated... Well wouldn't ya know? They were able to find the game... what a shocker... the all you can drink happy hour is pretty cool too. Get it with the Groupon and save yourself $10. The bad part is that it's all Bud products or well drinks made with ass-flavored liquor. What do you expect for $10? \nFood is meh. \nVibe is cool.\nChicks in cheerleader outfits... effing awesome!\n\nLETS GO KINGS!!!!"
        }, 
        {
            "index": 195, 
            "rating": 3, 
            "review": "I went here for lunch on Saturday. The boyfriend and I ordered a burger, cheesesteak sandwich, curly fries and a pitcher of beer. My cheesesteak was very very good. I devoured the whole thing within minutes. Had a bite of the boyfriends burger and that was not very good, he regreted not ordering the cheesesteak. Fries were good, nothing special. The beer, well I have no complaints about that. The place is a little pricey for what it is but hey it's Vegas, everything is pricey."
        }, 
        {
            "index": 196, 
            "rating": 1, 
            "review": "Arrived at this establishment looking for a place to get some wings and watch a Blackhawks game. I got both of those items but it was a pretty painful road to get there. Had to wait about 3 minutes for the hostess to come out front and get us to a table. The floors here are bare concrete and the chairs have metal legs so anytime you move one it sounds like very loud nails on a chalkboard, starting off on the right foot. Get inside and the place is basically empty and the hockey game is on a big screen right in front of us which is nice. The waitress comes around maybe five minutes after we sit down. We order water and guess what they only serve bottled water! Can't imagine how much bottle waste they must have to deal with on a day to day basis but I'm sure they love that extra $1+ they get to charge everyone. And its not like were talking Perrier here you are just getting a generic plastic bottle with their \"brand\" on it. We ordered some wings they didn't come out  for a decent amount of time. When they did come out they were pretty far past  \"Meh\" on the universal-wing-scale.  Wait staff didn't come by the rest of the meal to offer us more bottles of water. Had to flag them down to get the bill and get out of there. Basically, if this place is this slow and painful on a slow Sunday I can't imagine what it is like when it is busy. Also, any place that charges you to buy bottled water rather than serve you tap better be amazing and serving you water synthesized from hydrogen gas and oxygen in their custom reaction chamber."
        }, 
        {
            "index": 197, 
            "rating": 5, 
            "review": "Amber...best customer service ever.  I never wrote a review before until now.  She knew what she was talking about.  Kept honest and had nothing but positive things to say about this place and was genuine.  I've been to vegas multiple times, this is the first time I've eaten here and it was well worth it"
        }, 
        {
            "index": 198, 
            "rating": 1, 
            "review": "If I could give zero stars I would. Hands down bar none the worst service I have EVER had. Went there in a Sunday (11-10-2013)night....while it appeared there were plenty of servers there, you sure wouldn't know it by the lack of assistance we received. We were seated by a hostess immediately, yet out waitress didn't show up for 20 minutes despite our attempt the flag one down. Food orders were COMPLETELY messed up and NEVER were gotten right.  Drinks were not refilled (we were there for an hour half) When we attempted to discuss these issues with the hostess and waitress they simply wanted to spar with us. HORRIBLE place to go. Steer clear of this place."
        }, 
        {
            "index": 199, 
            "rating": 1, 
            "review": "We walked in for the $3 breakfast special. We got seated and then I think they forgot about us. They finally came and took our order. When we got the food, it was cold. We then had to wait another 5 minutes just to get forks which were never given to us. We had to ask the hostess to bring them to us because the server never brought them out. \n\nWhen we finished, the server came to our table and asked if we needed anything else. When we said that we were fine and that we needed the check, she got an attitude problem and just walked away. We got the check 5 minutes later we paid and left. \n\nI work in the service industry myself so I know that we make more from tips than from our regular wage. I usually go out of my way to do things for guests because I know that I am there for them and they want to have a good experience. This was the first time that I leave a restaurant without leaving a tip. I usually over tip but with the service that poor and with the attitude that she had, she didn't deserve it."
        }, 
        {
            "index": 200, 
            "rating": 5, 
            "review": "First time here and had Mallory wait on us. She was AMAZING!! Five stars to her... Very refreshing to get an honest upfront server. More  establishments should have servers like Mallory. Hats off to her!!!!!"
        }, 
        {
            "index": 201, 
            "rating": 4, 
            "review": "So I came here the first time I ever came to Vegas and I must admit I rather enjoyed it ALOT ! My husband became a fan he loved the Buffalo wings and so did I, beer was pretty cheap too, the food was pretty good but the service was terrible it takes like 10 to 15 mins just for them to get your drink order and food order and maybe just maybe if your lucky you'll get your order in 30 mins or less. So food was great service not so great that's my review ENJOY !"
        }, 
        {
            "index": 202, 
            "rating": 3, 
            "review": "Blondies has an odd picturesque view is inside of the Miracle Mile Mall. \nThere's a fountain is in the courtyard area next to Blondies seating. It does all sorts of cool  lighted water effects, color changing fog, bursts of light as the water dances along with the music.  It is pretty fun to watch and attracts all sorts of weirdos (great people watching!) \n\nTypically I find shots of Patron to be very expensive. I was tickled to find $5 shots to be a permanent fixture on their menu. I had several of those smooth evening starters. \n\nBeer is Las Vegas is an absolute joke. No matter where you go it seems you find the generic Bud Lite, Heineken, Corona, etc etc etc crap. It is rare you find  quality craft beer. At Blondies I was able to get Dog Fish Head 60 Minute IPA in 32 ounce mugs for $11..... \n\nI returned two days in a row. The Patron and Beer lured me back.\n\nThe Food here is  2.5 stars and the Alcohol / atmosphere is 4 stars .... Overall this place gets a 3.5 and I would return without hesitation."
        }, 
        {
            "index": 203, 
            "rating": 1, 
            "review": "Service sucks. Wings are just ok. I don't recommend this place. We waited too long for drinks and when we got our order of wings they didn't give us the extra dip we ordered. When she brought the dip it was friggin tartar sauce and not ranch or blue cheese!! We left."
        }, 
        {
            "index": 204, 
            "rating": 1, 
            "review": "here for a bachelor party for the weekend, reserved 2 tables....they gave away 1 of our tables and then expected us to pay the 400 dollar reservation fee for the other table when they sat someone else at our table .... totally disrespectful to all of us in the party. Cannot believe the way the server and manager treated us after spending this much money in their establishment. DO NOT GO HERE!"
        }, 
        {
            "index": 205, 
            "rating": 3, 
            "review": "Yeah, yeah.  The food ain't so hot.  But the beer is good and there are plenty of TVs.  The service is pretty and pretty good.  What are you doing a half-mile deep in a mall in Vegas looking for haute cuisine? They have beer, sports and A/C. Park your a** on a stool and wait out the rest of your party as they ooh and aah over baubles and get lost in the mall 'cuz it is shaped like a figure 8.  Cute trick to get more time to drink -- when the wife returns ask her if she saw (insert name of store)  and convince her that she missed part of the mall.\n\nJust for fun, find a picture of their logo and check if you see the same \"optical illusion\" that my friends and I did."
        }, 
        {
            "index": 206, 
            "rating": 2, 
            "review": "So here visiting Vegas for the 2nd time with a group of friends. We attended a show at the theatre the previous day and happened to catch this place out of the corner of our eye and had to try it. We all had great food, I personally ordered the sweet habanero wings which were the perfect mix of sweet and spicy. We all had ordered some other things including wings and the garlic fries, as well as chili cheese fries which were all great. However, the problem lies on the service. Our servers name was Jessica. She arrived at the table shortly after we were sat and we waited roughly 10 minutes just for our waters while she was busy talking and charging her phone. After our food order was put in (which was before our drinks had even arrived) we did not see her again for another 15-20mins. I had to get my water refilled at the bar because she was no where to be found, which was odd because there were only a few other tables sat and multiple servers around. Once she finally came back we asked for our checks, which she printed then stood talking to a non ordering table for an extended period of time when we were waiting to leave. Overall, the food was delicious, but the service is exactly what will never bring us back."
        }, 
        {
            "index": 207, 
            "rating": 3, 
            "review": "I had a Groupon for Blondies that was going to expire the next day.  That figures the way I let Groupons go.  We came here Saturday to use it before we lost its value.\n\nWe were seated at a low table in the patio area.  We were brought menus immediately and our drink order was taken.  In a short time, our server--I believe Markiya was her name--came to take our order.\n\nMy wife ordered a Philly cheesesteak and I ordered the Reuben.  We were told that a basket of fries was better than two separate orders.  We got the garlic fries.\n\nBoth sandwiches were very large and very good.  The garlic fries were very good!   \n\nService was good.  My iced tea was refilled a couple of times and I didn't need to   ask.  I normally would give a four star rating but the noise level was awful.  It was the first day of the college football season and there were some loud viewers in the main restaurant.  Also, being located where it is along the Miravle Mile Shops walkway makes for more noise.  A plus though is the oppoprtunity to watch tourists.  That's always a lot of fun.  Prices here are also high.  I can get as good in my neighborhood for less money and less driving.\n\nStill, it was a good meal and I'm glad I tried Blondies after walking by all these years."
        }, 
        {
            "index": 208, 
            "rating": 3, 
            "review": "Blondie's = underrated! Just a typical sports bar with lots of TVs and greasy bar food, BUT there are beer pong tables in the back. The bar supplies cups, balls, pitchers, etc which were relatively cheap. Since O'Shea's is gone (RIP), this will probably become our day time hang out when pool party season is over."
        }, 
        {
            "index": 209, 
            "rating": 1, 
            "review": "Servers were not at all personable.  Food was OK.  Overpriced!  The server, Maddison, claimed she told us about the added costs NOT on the menu.  After leaving 15% for her average service, she actually followed us out of the place for an additional tip amount!  NEVER had this happen before, EVER!  STRONGLY recommend avoiding this place unless you enjoy paying hidden costs."
        }, 
        {
            "index": 210, 
            "rating": 3, 
            "review": "This is a great college bar. If you're looking to play beer pong, flip cup, etc with friends and get tanked, this is the place you want to be. We have been here before for lunch and the food and service were lacking, so I would only go here to drink"
        }, 
        {
            "index": 211, 
            "rating": 3, 
            "review": "Really cool place. Good looking waitresses, beer pong tournaments too"
        }, 
        {
            "index": 212, 
            "rating": 3, 
            "review": "$10 for a simple sandwich? That's what you get in Las Vegas. I had Philly cheese steak and Reuben sandwich. Both are just OK.\nIt's in front of V-theater of Miracle Mile shop connected to planet Hollywood. \nBTW, why is it called blondies? There is no single blond waitress in it. All hooters girls have big breasts, and people know what type of waitress they will get if they go to hooters. But if you go to blondies bar, you will get a black hair waitress."
        }, 
        {
            "index": 213, 
            "rating": 2, 
            "review": "Over priced drinks (unless you enjoy the cheap stuff). Under par food that my kids couldn't even eat.  This all resulted in an expensive dinner that couldn't even be eaten.  I guess this place would be fine if you wanted to watch a game with just drinking beer, but plan on spending more than necessary."
        }, 
        {
            "index": 214, 
            "rating": 2, 
            "review": "I was on mission to find a place on the Strip that makes a decent cheesesteak.  So after doing some research I came across Blondies menu, and I was glad to see that they serve cheesesteaks with Amoroso rolls from Philly.  That was all I needed to know.  I came here late at night long after the Miracle Mile shops were closed, so I felt kinda awkward walking thru an empty mall trying to get to this place.  When I got there the place was pretty dead and the waitresses seemed very tired.  The only real noise was coming from the drunk folks playing beer pong, that was pretty entertaining to watch.  Anyways, I ordered a mushroom cheesesteak whiz witout (http://bit.ly/1LCXyXz), and after I took my first bite, I was in cheesesteak bliss.  Sure it might have been because it was 1:30am and I was having hunger pangs, but I didn't care, I was enjoying it.  So why only 2 stars??  Good cheesesteak, but that's pretty much where it ends.  Place was dead, atmosphere was cold, waitresss weren't very motivated.  I'd only suggest stopping by here if you're really hungry and need a quick lunch or late night snack."
        }, 
        {
            "index": 215, 
            "rating": 3, 
            "review": "Good drinks one day. Great drinks another. Watered down drinks the 3rd day. That's why it got 3 stars. Wish I could have given it more. If go back though."
        }, 
        {
            "index": 216, 
            "rating": 4, 
            "review": "I went to Blondies for the first time for a Packers game. I looked up the ratings and noticed that it didn't have the best, but was only looking for a cold beer and a game that wasn't available on my TV.\n\nI was blown away by the service and food, not to mention the TVs with every game showing. \n\nI had a sweet blonde girl, Maria that recommended the ceasar salad. Cold beer, wings and the salad was awesome and so was the service..Maybe in the past, the service was poor but, I'm happy to say that I didn't experience anything like that. I will definitely be going there again for my football and their professional service, sports atmosphere and all the smiles in on the girls.. \n\nThanks ladies!\n\nSincerely,\n\nStacey  (New Customer and won't be the last)"
        }, 
        {
            "index": 217, 
            "rating": 5, 
            "review": "So my friend and I went here to grab lunch. I had never heard of this place before. I ordered a sub and it came with seasoned fries, and a drink.\n\nThe food was filling and service was great. It is a bit of a loud place, but isn't any sports bar?!\n\nWe played beer pong after lunch, as they have long tables set up for it in the back.\n\nIt cost $21 for the first game of beer pong, and $14 every game after. They give you a pitcher of your choice beer, plastic cups, and ping ping balls.\n\nI would recommend this place to anyone looking for a fun, up beat sports bar, with the ability to play beer pong."
        }, 
        {
            "index": 218, 
            "rating": 5, 
            "review": "First time ever visiting.  The beers were nice and cold and the food was tasty and hot. Coming from someone who is indecisive and will stare at a menu for hours, our server Jesse recommended the chicken cheesesteak which I ordered and demolished.  I had no complaints!  Left with a full tummy.  Next time I visit the Vegas area I'll be coming back for round two."
        }, 
        {
            "index": 219, 
            "rating": 2, 
            "review": "$2.99 breakfast was not bad, but just for weekdays. Be aware that orange juice is $5 for a small plastic cup whereas mimosa is only $3. I couldn't find any beverage prices on the breakfast menu. It's clearer on the $4.29 breakfast next door where Bloody Mary or coffee is only $.99."
        }, 
        {
            "index": 220, 
            "rating": 5, 
            "review": "Great staff and extra large HD TVs to watch all the games with friends!!"
        }, 
        {
            "index": 221, 
            "rating": 2, 
            "review": "Went here for college football on Saturday morning. Friendly staff and was seated promptly. Food is very mediocre. Did not expect Ruth Chris quality, but for the prices, it is on par with a  Furr's or a Denny's. Much better options are all around so do not come here hungry. People were there mainly to drink anyway, so I doubt they care too much about food quality."
        }, 
        {
            "index": 222, 
            "rating": 4, 
            "review": "APPARENTLY violated terms by using video and certain phrases and by giving 5 stars. Here is the rewrite."
        }, 
        {
            "index": 223, 
            "rating": 1, 
            "review": "The wife and I totally enjoyed the beer buckets even though they were advertised for $25.00 & we were charged $30.00 plus tax. My concern is nearly twenty-seven dollars for Nachos. They were tasty but we probably should have been advised about the cost. The review we read was from $3.00 didn't expect twenty-three more! Did enjoy the game though."
        }, 
        {
            "index": 224, 
            "rating": 5, 
            "review": "Great place! Love the atmosphere, great vibes.....bartender Brandon is amazing! Definitely going back for sure!"
        }, 
        {
            "index": 225, 
            "rating": 1, 
            "review": "Quit deleting my damn review.\n\nFYI this is not based on an \"Employment Issue.\" I was obviously NEVER employed here. I'm not blonde and I'm a fatass.\n\nHowever, besides the fact that the service sucks and the portions & prices blow, I still think employees deserve respect.\n\nI watched a male manager here berate one of the waitresses and tell her she wouldn't have a job anymore if she didn't wear more makeup, as she was in one of their skimpy little blue cheerleader outfits.\n\nAnd yes, I can base my opinion/review on the ENVIRONMENT as I see fit.\n\nYou shouldn't air your bullshit in front of customers. We will never be back.\nStick that in your juice box and suck it."
        }, 
        {
            "index": 226, 
            "rating": 4, 
            "review": "I ordered a Rachel, which was very generous with the turkey! Super good, especially if you like sauce. I also got sweet potato fries... They powdered the top with powder sugar and serve it with honey."
        }, 
        {
            "index": 227, 
            "rating": 1, 
            "review": "Terrible service. don't expect them to even try if you have a special food request; I have a dairy allergy and the waitress told me it was hard to communicate with the kitchen and that I pretty much couldn't have anything.  I asked if the wings and chicken were prepared in butter and she told me \"they weren't sure\". Went to PF Changs where they knew how the food was cooked."
        }, 
        {
            "index": 228, 
            "rating": 1, 
            "review": "We went in for breakfast and it was worst experience at a restaurant that I've had in at least 5 years.\n\nService- Slow and nobody was in there and they had enough waitress on staff. Our waitress had an annoying high pitched voice. I would suggest she gets out of the restaurant industry and join the circus.\n\nCoffee- Terrible. When it was suggested that the coffee wasnt good the waitress said the coffee is terrible here but she was glad to get a fresh pot of crap coffee going for us....yum. She should have just served up scolding coffee and dump it on my crotch and have the bar tender throw the cream in my face.\n\nMeanwhile it is taking forever just to get water to us.\n\nFood- the food finally comes out except for my friends who had to sit and watch us eat half our meals before he got his. BTW he got the same thing as everyone else. nothing special.\n\nMy meal was Chicken fried steak and eggs. Kinda hard to screw that up. First off they successfully failed. The piece of meat was thin and small to begin with (thats fine) but they over fried the steak. And they served it already cut down the middle (as if they were checking if it was done). The gravy came on the side and looked soupy. Almost Man sauce like. \n\nI almost felt like  the restaurant cook wanted me to get on my knees and dump hot gravy on my face.\n\nMeanwhile we are in a sports bar right? Well my friend was looking at one direction of the bar that was just showing rap videos (he said he wished he was Tupac'd) and I was facing the projection tv that was completely angled wrong. I felt like I was Biggie Small'd."
        }, 
        {
            "index": 229, 
            "rating": 2, 
            "review": "This is a place you would want to avoid at all costs!! The service is very lacking, the bathroom is not a place you want to use. The food is mediocre. I should have gone next door to Lombardi's! \n     I blamed this place on the management. They should retrained the staff and clean the bathroom and have better food!! There were 4 of us dining here, we couldn't wait to get the hell out of this restaurant!"
        }, 
        {
            "index": 230, 
            "rating": 4, 
            "review": "Stop by for dinner they had an all you can eat pasta special. We ordered the spaghetti with marinara sauce and the fettuccini Alfredo. We were surprised at how large a bowl of pasta they made for $9.99 per person. The spaghetti was prepared perfectly and not soggy or overcooked pasta. The marinara sauce was tasty and not watery. The sauce stayed on the spaghetti and made the pasta have taste. The fettuccini Alfredo was very good and full of flavor. The Alfredo sauce was not excessively greasy because of the over use of butter or oil. We even had enough to have left overs to take back to the condo. \nThe place is a clean sports bar type of environment and decore.  Lot of different screens with all types of sports programs on. They had a full bar. They even had some tables that you can pour your own beer at you own table. If you like beer boy you can have a great time here."
        }, 
        {
            "index": 231, 
            "rating": 4, 
            "review": "Great food - cheap beer - amazing waitresses - and huge tv's!  This is a great place to watch the game, with lots of cheap beer, and great food. We got the groupon that included a pitcher of beer with burgers and an appy for two for $25 - and it was really good. There is a patio so you can people watch in the miracle mile mall area.. and we all know how fun that is!!"
        }, 
        {
            "index": 232, 
            "rating": 1, 
            "review": "What surprises me is with all of the bars and places to eat and drink around Vegas, literally 100's within a mile radius of this joint you think they would try harder.  I was unfortunate enough to stop by with my son that just turned 21 on this day and we sat at the bar.  A young lady (bartender not cheerleader waitress) asked what were we drinking, I ordered a shock top and son ordered a beer as well.  She asked if we were eating and we said no and she got a grouch look on her face and turned away.  She plopped our beers down and that was it.  She later gave us our check but during our drink we decided that we wanted to grab some food.  We asked the lady for a menu and she gave us one.  We waited 20 minutes, while the whole time we see her talking with her friends, drinking starbucks and doing nothing.  She eventually came and said oh what did you want to eat.  I was furious, I said we waited 20 minutes and that was crazy, asked to speak with a manager, she said she was the manager.  I find that hard to believe.  She said, \"well you originally said you didn't want to eat\"  I said, \"well I thought I made it clear 20 minutes ago when I asked for menus and said we decided we wanted to eat\"\n\nShe then proceeded to tell us that a girl was on break and she was swamped.  See above on my comment on what she was doing the whole time.  I said was it because the way I was dressed.  Sleeveless shirt, basketball shorts and sunglasses, she got defensive and said no.  Well trust me, I had money to spend and lots of it, but I refuse to go anywhere and beg for service.  The kicker was I paid 20 dollars for two beers!\n\nI strongly suggest to avoid this place and try the gazillion other establisments in Las VEgas."
        }, 
        {
            "index": 233, 
            "rating": 3, 
            "review": "Bachelor Party, Pre party location for 10 guys.  UFC fights, all you can drink beer ($80 per person), bar food.  Its a 3 star all the way around.  Food was good (bar food) service however was slow.  Yes, place was packed due to the fights, but the fights didn't just happen.  They were planned, so should have planned more staff.  Service was my biggest complaint.  GREAT AMOUNT OF TVS.  Perfect sports bar, just needed a little more service from the staff"
        }, 
        {
            "index": 234, 
            "rating": 2, 
            "review": "this is one of those places you eat at cuz you're walking around and suddenly hunger creeps in... and walking anywhere else is really too far.  \n\nthe cheerleader-esque waitresses usually hover over their podium outside gossiping... and once in awhile one of them will look up and seat you.  \n\nand if you want to order water... its bottled only (for like $1 i believe... which is cheap for bottled water here... but expensive cuz you just wanted friggen FREE water right?)  \n\ndont order soup (fuck you diet)... it's definitely from a progresso can... you get like half a can of soup for like $5-6.  \n\ntiny and dry chicken wings...\n\nphilly cheese steak sandwich is good... except for the bread, which is COLD?!\n\n$10 all you can drink during happy hour... that's pretty sweet though."
        }, 
        {
            "index": 235, 
            "rating": 2, 
            "review": "Eh....\n\nWent to Blondie's for the National Championship game with a group.  I was not impressed. the place wasn't crowed like you might think. I'm sure that was due to the high cover charge for the game though.\n\nThe bar food was just that, bar food. The problem is that it wasn't very good. the wings were sub par - very bland and rather small, cheese sticks were nasty, and the meatballs were a gelatinous mass. Yuck!!!\n\nThe service was OK, but nothing special. You would have thought that at an event like that they could keep up, but they couldn't. Our waitress only had a couple of other tables and no one was drinking heavily, and folks were still running out. \n\nThis place definitely had a dive feeling to me, but without the charm a good dive should have."
        }, 
        {
            "index": 236, 
            "rating": 2, 
            "review": "Another one bites the dust. \n\nI fell victim to its convenient location to the V Theater.  We were seeing a show and decided to grab a bite to eat.  We were greeted and seated immediately.  That was the end of the good.  \n\nService was just ok. I don't think we received a refill on either of our drinks.  A different guy brought our food to the table so the waitress didn't do much. \n\nIt's funny how on their menu it's labeled in a special box ' Famous Cobb Salad'.  I love Cobb salads so I wanted to try it.  What was famous about their salad? I couldn't figure it out.  Just about every other Cobb salad I've eaten, the toppings are diced.  Not this one they served.  It looked like a disaster.  The tomatoes were sliced.  The bacon wasn't in diced pieces.  It just wasn't good and wouldn't order again.  \n\nWith a premium location, I'd hope something improves here."
        }, 
        {
            "index": 237, 
            "rating": 5, 
            "review": "Blondies is hands down the most fun and best sportsbar in Vegas!!! I am here for every big fight or sporting event and it is always a wild time.  You pay upfront at the door for all you can drink.  If you want a table, call ahead and get one booked.  Make sure to do so way in advance because the place fills up fast! The service is great, environment is always fun, food is delicious, and they make some of the best drinks in Vegas."
        }, 
        {
            "index": 238, 
            "rating": 1, 
            "review": "Ok the only reason they get one star is because I had to give them one to write a review!  This is the worst place for drinks I have ever been to! Do not get all you can drink deal unless you like cheap beer! They say well drinks are included but they taste like absolute crap! Well water that had fermented would be better then the drink. I actually tried to return it and was told I would have to pay 10 for it, when it was u drinkable! The place had only about 10 people in it but the waitstaff is so slow you would think the ace was packed! Horrible derive and drinks. You are better off going and playing the slots and getting free drinks!"
        }, 
        {
            "index": 239, 
            "rating": 1, 
            "review": "Gotta agree with the others on here in that the service sucks! Although they did provide water with our food. Good thing cause I needed it to choke down the gross turkey, bacon and avocado wrap I ordered. The free appetizers they had out were even worse and they didn't even bother to put plates out so people were just eating with their hands. This seems to be a bar that thinks it's cool but it's not."
        }, 
        {
            "index": 240, 
            "rating": 2, 
            "review": "Eww! This place feels gross to me. The staff is friendly but the table was sticky and the drink (yes drink not drinks because I wasn't wasting calories on a crappy cocktail) was weak. Blah all cocktail juice, no alcohol. I won't be returning."
        }, 
        {
            "index": 241, 
            "rating": 1, 
            "review": "No. Just no. \n\nWe were informed to come here after TAP at MGM said they were one of the few places showing the McGregor/Diaz and Holm/Tate fight.\n\nGot there and there was a bit of a line that moved quickly. The bouncer told us it would be $60 a person cover but \"all you can drink\" once you're inside. Two of my friends immediately left because they didn't want to pay that much for cover. My other friend and I wanted to check other places first (Twin peaks & Cabo Wabo). Other places were at least $75 with nothing included so Blondies seemed like a better deal. \n\nWe came back, paid the $60 and were shocked when we got inside. (you can't see the inside of the bar on fight night as there as black curtains draped everywhere). It was PACKED. When I say packed I mean they should have a maximum capacity limit which they clearly ignored. Every table was taken, and they had chairs set up in every other open floor area which were also all taken. People were literally eating pizza off of the floor due to lack of seating and tables. \n\nThey also didn't tell us that \"all you can drink\" meant ONLY bud light. My friend doesn't even drink beer (gluten intolerance) so it was a total rip off for her. Bud light is not my drink of choice, I would have rather had a cheap well vodka with soda. This was so deceiving and should have been told to us at the door upon taking our money. \n\nIt was just pure chaos. We paid $60 to stand and be pushed by rushed waitresses telling us \"excuse me\" and \"please move\" for FOUR HOURS!!! \n\nI would NEVER come back here. Staff is dishonest and only wants your money. I've never been more uncomfortable in a bar in my life. Never again. STAY AWAY!"
        }, 
        {
            "index": 242, 
            "rating": 5, 
            "review": "In Vegas on a layover and decided to stop in. My server was Alyssa. A cute little brunette. She did such a great job selling me on the nachos which were phenomenal and the melon martini which was just perfect! Alyssa gave us amazing service. Will deff tell all my flight attendant friends to come visit when in town and request Alyssa!"
        }, 
        {
            "index": 243, 
            "rating": 4, 
            "review": "What's better than a red beer and people watching?\nI think locals appreciate this more, because I was entertained four a couple hours watching everyone roaming by.\n\nGood bar food and a few great bartenders."
        }, 
        {
            "index": 244, 
            "rating": 3, 
            "review": "We have been once in the evening for drinks. Lots of college kids playing Beer Pong...not an issue; they were having a great time. When yesterday for lunch. The service was good; server was very attentive but not bothersome. I had the Cobb Salad, it was HUGE and really good. I would recommend it but definitely for sharing. My husband had the Philly Cheesesteak; this was also large. He said it was good but he wasn't blown away. None of the sandwiches some with fries, they are $4 extra. The menu was very basic; nothing to make them stand out. But I would return for lunch as it was a quick in and out with pretty good food."
        }, 
        {
            "index": 245, 
            "rating": 4, 
            "review": "I came here last year 2011 around April during a softball tourney with some co-workers. I was sold on this place because it was EMPTY. It allowed a gang of us to play beer pong in peace, and get drinks and food without an issue.\n\nI will admit getting the waitresses attention was sometimes difficult, even with there being less than 15 people in the entire place. This may have been due to the fact I was not sober.\n\nWe did order the big tall beer thingy. From what I recall it was a decent deal split among friends. But who's looking at deals when you're with a gang of cool buds, eating bar food, and playing some beer pong?!\n\nI'd recommend dropping in with a group if its not too crowded, as there is plenty of seating/TV's. I can only imagine it gets packed here during March Madness or regular football season.\n\nSide note: waitresses are indeed dressed to only what Vegas can offer.\n\nOverall I was pleased with the place and will drop by to see if it was the same as it was a year ago. March madness, here we go!"
        }, 
        {
            "index": 246, 
            "rating": 4, 
            "review": "I was skeptical when I saw their sign that advertised breakfast for $2.99 on weekdays, but I gave it a try. The breakfast came with 2 eggs, sausage, bacon, and hash browns! The wait was 1/3 of Dennys on the strip and this was a much nicer atmosphere! Definitely try it if you're in town on a weekday!"
        }, 
        {
            "index": 247, 
            "rating": 1, 
            "review": "Just got back from spending the weekend in Vegas. We wanted to watch the Mayweather fight somewhere, and so I did a little research before we hit the road. Called Blondies and was told that they would have the fight, and that the cover charge would be $40 a person, which would include all the beer you can drink. SCORE!! So on the way over to Blondies, I call to make sure there's still space available, and am told there is, but the cover is now $60.....hmmmm. Okay. Still not terrible since it includes drinks. Well, then we get to the front to pay our entrance, and are now told it's $80!!!!!!!!!!!! I explained that I had just called minutes ago, and was given the $60 price. They didn't give a crap. Bottom line (it's Vegas after all) is to make money. The guys working the front were fairly rude, which makes it even worse when handing your money over to them. \nWell we decided that since we were already there, we'd suck it up....and pay. I didn't want to use all my cash so I proceeded to pay with my debit card. Oh darn, they only take cash!!! So one of the rude guys tells the little waitress to show me where the ATM is located in the restaurant. She takes me right to it, and then I turn around and she's gone???!!! So I get my money, go back to the rude goons at the front and stand there FOREVER while they just ignore me. Then it hit me, Hey, I'm in this joint. You want to be rude jerks?? Okay, cool. Me, and my money (safely back in my pocket) are winning this round. I found my boyfriend inside and drank PLENTY OF FREE BEER, and watched the fight. For nada, zip, zilch!! Ha Blondies, suck it. I win. \n\nThe money I didn't spend here, I spent the next day at the Pub at Monte Carlo. Way better place to watch sports, and have all inclusive food/drinks. No surprises on the price. When I called I was told $40 all you can drink....when we got there,$40 all you can drink!! This is on Sunday's btw. So you can post up and watch football and have a GREAT time. So save yourself the bs that is Blondies. Go elsewhere. Where they're honest about prices, and don't act like idiots when you get there."
        }, 
        {
            "index": 248, 
            "rating": 2, 
            "review": "We were looking for a good place to do happy hour where the boys could watch some sports. Lured by the $20 all you could drink 3pm-6pm, Blondie's seemed like the best choice closest to our evening shows. Well, started off rocky when it took nearly a half an hour for a waitress to come to our table. When she got there, we promptly told her we were looking for the $20 deal. Well, you go to the bar for that and when you need a refill you go back to the bar, she took care of food orders. Ok so we ordered some food and went and got our first rounds of drinks. Bartender was a little sarcastic but hey so am I. Second round of drinks? Not so quick and more attitude from the bartender. 3rd round? We had to wait in line at the bar and bartender was, dare I say it, a little ruder still. By the time we felt as though we had gotten our money's worth, we had worked pretty hard for our beers. In addition, our waitress came to our table and asked if she could give us our bill as her shift was over. We were all done eating so no problem. Well we sat there another hour and a half and our waitress was still helping other tables, giving us the impression she didnt have to leave but just didnt want to tend to our table any more. All in all, pretty lackluster experience at Blondies. \n\nAs for the sports on the tvs for the boys? Well there was for the first hour until the infomercials came on and no one bothered to change the channels."
        }, 
        {
            "index": 249, 
            "rating": 3, 
            "review": "I ordered a patty melt and side salad.  The meal was pretty good for a sports bar. Definitely would visit again."
        }, 
        {
            "index": 250, 
            "rating": 1, 
            "review": "64$ for wings/salsa/sliders/2 beers.. And on the chips n salsa, they put the salsa on the chips in the basket. It was weird..the staff was nice however."
        }, 
        {
            "index": 251, 
            "rating": 1, 
            "review": "The bartender we had tonight was very rude right from the beginning.  All he cared about was groping the waitresses."
        }, 
        {
            "index": 252, 
            "rating": 4, 
            "review": "Cool place, within the Miracle Mile Shops, to grab a drink (or food). Lots of decorations to help the wondering eye, many tv screens-showing all types of sporting events/news, and a killer bar. \nWe had some cold ones, as we pondered what to do the rest of the day, in Vegas. A staff member came around to snap a \"voluntary\" postcard photo of you. The postcard is cute, but if you love who you're with and the photo is adorbs, you'll likely shell out $20, like we did, for the larger, Vegas-themed backdrop with it. It resembles what you'd find at an amusement park. The staff was nice, but a tad slow behind the bar. Aka busy."
        }, 
        {
            "index": 253, 
            "rating": 5, 
            "review": "Such a great sports bar in the Miracle Mile shops. My waitress Fernanda was really funny and sweet and kept the drinks coming :-)\nI will be back soon!"
        }, 
        {
            "index": 254, 
            "rating": 1, 
            "review": "THERE ARE BETTER SPORTS BARS!\nAVOID \nI went to see the Canelo vs Cotto fight\nthey charged people a ridiculous amount of money. \nThe owner or manager was rude to people and just took money out of their hand as they were paying without being inviting or thanking people or making eye contact with guests!!!!\nDuring the fight the sound was lacking and would completely go away. \nThe first time we were like okay whatever they will fix it.\nWrong! ... it kept going away and just ruined the fight. \nThe manager should of at least showed up and could of explained what was going on but he would go away and his workers had to pretend like they were trying to \"fix\" the sound\nAlso one of the servers could not simply walk to the trashcan to throw away a cup full of ice, she rudely threw it instead and it landed on a women next to me!!!. \nThey need to work on their customer service and try to be more friendly!."
        }, 
        {
            "index": 255, 
            "rating": 2, 
            "review": "Not good I do not recommend.  My family went here for breakfast because my dad thought it \"looked good\".  It wasn't.  I even got pancakes because I thought how could they mess those up?  The pancakes tasted gross like the dirty grill.  No one liked their food except my dad who wanted a \"big ole burger\"."
        }, 
        {
            "index": 256, 
            "rating": 1, 
            "review": "Saw a breakfast plate deal advertised on 4 tv screens in front of restaurant for $2.99.  We, family of 4, got seated 11:05am & attempted to order the advertised $2.99 shown on screens.  Waitress tells us that breakfast is over at 11am.  We called her attention to the large 4 tv screens & that it did not mention any expiration times.  She tells us we had to order from the lunch menu.  We told her this was deceptive advertising.  We also asked why they still advertised the $2.99 breakfast deal after 11am (their breakfast cut off).  She told us it is posted until noon each day even when no one can order that special after 11am.  Then she wanted to know what we would like to order from their lunch menu, where the prices were much high.  Deceptive advertising to get customers in!  Bait & switch method used on customers!  Would not recommend!"
        }, 
        {
            "index": 257, 
            "rating": 1, 
            "review": "Do not expect good service. We finally left cause no waitress came to our table and none of the other waitresses cared when we asked."
        }, 
        {
            "index": 258, 
            "rating": 1, 
            "review": "Horrible service. We called ahead to see if they were going to be playing a game we wanted to see, and they confirmed yes. Then we got there, and wouldn't agree to put it on. Not nice people. Then we waited at the table, and we got our water,and she never returned. We left. Not worth it!!!"
        }, 
        {
            "index": 259, 
            "rating": 5, 
            "review": "This has been the best service I've had, since I arrived in Vegas. Our server Ariel was on point. She was very attentive and went the extra mile for our table. You can't beat their prices for breakfast. I personally ordered two breakfast plates and still paid under $10."
        }, 
        {
            "index": 260, 
            "rating": 5, 
            "review": "Blondie's in Planet Hollywood is a very upbeat fun place!! I bartend there from 1-8 am on Fridays and Saturdays and even between those hours there is never a dull moment! With all you can drink specials from 3-6pm and beer pong you will never be bored at this place no matter what time it is! Come check it out for yourself!!!"
        }, 
        {
            "index": 261, 
            "rating": 1, 
            "review": "Places that will not give me a glass of water when I am eating there are so lame.  If I am a paying customer you shouldn't require me to order a bottle of water as well.  Food was okay.. I frequent Vegas about 5-7 times a year, and sometimes stay at the PH.  But won't ever be eating here again on principle.  Provide your paying customers with water people, really."
        }, 
        {
            "index": 262, 
            "rating": 5, 
            "review": "Service was great! 5 stars go to Hannah, she was so sweet and helpful. Our group was being kind of annoying and she didn't mind at all."
        }, 
        {
            "index": 263, 
            "rating": 4, 
            "review": "I was staying at the Elara hotel and it was conveniently connected to the miracle mile. Blondes offered a $2.99 breakfast special. I was impressed with the efficiency of the service.  Not bad."
        }, 
        {
            "index": 264, 
            "rating": 2, 
            "review": "The food would have tasted better if the service was better. Our server was uber busy and never even helped us out. She took care of everyone else around us though. Lame. The only thing that was cool was the girl who took our order and got our drinks. Wait a sec, was SHE our server? \n\nWho knows.\n\nIt was the middle of the afternoon and the basketball game was about to begin. There was going to be a cover charge to enter Blondies after 3p. Luckily we got there earlier because I would have been very disappointed if we had to pay a cover. Sure, us girls were not in the mood to watch sports but still. \n\nNext time I'll pass. I bet the stripper bar across the hall had better service. ;)"
        }, 
        {
            "index": 265, 
            "rating": 4, 
            "review": "Great sports bar. They have a all you can drink for $20... Well drinks and domestic beer until 6:00 pm. Lani was our waitress and she was AWESOME! Great customer service! We had steak and eggs for breakfast and it was tasty.. $5 Bloody Marys until 11:00am. .. Great place to come and kick back and have some drinks. The overall customer service here was GREAT and I would highly recommend this sports bar!"
        }, 
        {
            "index": 266, 
            "rating": 1, 
            "review": "Overpriced mediocre food. DO NOT go here. The service was awful! We had to ask our waitress three times for napkins and silverware! Super slow service and to top it off the waitress charged us for an item we didn't even order. Never coming to this place again!!"
        }, 
        {
            "index": 267, 
            "rating": 3, 
            "review": "Big game on the hundreds of TVs they had there. Great for the sports fanatics or those of us that like to watch the sports fanatics. Wait staff are friendly, knowledgeable but too few for the crowd that was there Friday night. Food was good, drinks were good too. Would recommend this place if you were staying at the Elara Hilton of close by. A good place to relax for a little while until moving on to the next thing on your list."
        }, 
        {
            "index": 268, 
            "rating": 1, 
            "review": "I went to Blondies one night with some friends. There was a beer pong tournament going on. All of the people playing were overly competitive including members of the staff/owners of the bar who were drinking. One of the owners was instigating fights between patrons of the bar. I also heard one of the managers use several racist terms while breaking up a fight that broke out over a game of beer pong. Out of all the bars I've been to in Las Vegas, Blondies is HANDS DOWN THE WORST!!"
        }, 
        {
            "index": 269, 
            "rating": 4, 
            "review": "Not a bad place to grab a quick drink and some food.\n\nWe were brought in by the host and hostess as they told us the deal was $10 Draughts!  We bit, and came in because we also wanted food.  There were a lot of beer pong matches going on as it was a Thursday night and that seems to be the theme.  We ordered some food, and I ordered the \"Build your own Burger\" and it was pretty damn good.  You get your choice of THREE toppings as well as cheese - I opted for Avocado, Blue Cheese and Bacon -  and skipped the extra cheese.\n\nIt was interesting though when our bill came because they waitress told us the beer we were drinking was \"not included\"... even though we told her we had the bands, and wanted to \"try\" the best beer AND the host and hostess specifically told us come in for $10 DRAUGHT beers, and the menu said $10 DRAUGHT beers - so maybe there was small print with that but if we have bands, and we are drinking anything BUT what is included, you would think they would question it.\n\nAnyways - They were nice enough to drop those off our bill becuase it was clearly a misunderstanding by all parties.  Because of that, they get an extra star!  The downfall of this place is the noise-  It's filled with screaming college kids playing beer pong on Thursdays, Im sure other days may be a bit more relaxed as it wouldnt have the wristbands, so when I am in town again, I will be stopping in again."
        }, 
        {
            "index": 270, 
            "rating": 1, 
            "review": "Horrible establishment! My brother and I flew to Vegas for the Mayweather / Pacquiao fight and this joke of a place one supposed to be one of few places approved to show the fight. We prepaid $300 each and when we arrived, the hostess stated, \"just a heads up, we're having negotiation problems with the MGM and may not be able to get the fight.\"\n\nOur waitress finally broke the news that they hadn't met their number and the fight was a no - go.  They refunded our money, but there was no place for us to go to watch it.  Blondies management knew they didn't have the fight, but was willing to gamble with its patrons.\n\nDo not spend your time and money at this joint...totally jacked up my fight weekend.  This place is a joke!"
        }, 
        {
            "index": 271, 
            "rating": 3, 
            "review": "We used a Groupon, and felt like it was a great deal.\n\nGreat Rockin Nachos, Melted cheese, PLUS nacho cheese. filled with beans/jalepenos/and all the toppings. Not sure if I would pay 12$ for them regularly but with the Groupon it was a good deal! \n\nI had a build your own burger with bleu cheese and bacon. YUM. HUGE. altho no fries, you have to pay 3$ to add fries to a meal. It was okay for use though because we had a LOT of food. My husband ordered the philly cheese steak sandwich, and he thought it was decent. He thought he probably would try something else next time.\n\nService was great, altho we were there at a low low time, as they weren't very busy. Lotsa TV's lotsa cute girls....\n\nI'm unsure about my overall feeling. It might be SUPER fun on a big sports night!"
        }, 
        {
            "index": 272, 
            "rating": 2, 
            "review": "We were not impressed after coming to Blondies. We were so hungry, and wanted something that would cost under $20 a person, so we came to blondies. \nWhen we arrived we were promptly seated, and given menus. We weren't ready the first time the waitress came around, so she left, and we waited for a good 15 minutes for her to come back. Finally she came and we ordered. My mom and were feeling the same thing, grilled cheese and tomato soup. So we ordered, and we waited. We waited at least another 25 minutes, but mind you, when you are super hungry it feels longer. \nDuring the wait, I needed to use the restroom. Somehow I didn't see the restroom sign, so I went and asked the hostess. She was startled when I approached her because she was in her phone. After seeming annoyed, she showed me where it was. \nThe first thing I noticed about the bathroom was that it was very dirty. I actually waited for a different stall, because the only other one available had urine on the toilet. When I went into the other stall, it was of mediocre cleanliness. It wasn't as awful as the last one, but it still smelled awful and there was toilet paper everywhere. I felt dirty after leaving that restroom. \nAfter leaving the restroom, I go back to our table where our food has finally come. The grilled cheese was luke warm, and I'm not even exaggerating! There was a single slice of cheese, and it was only half melted. My mom brought this to the waitress' attention, and even she agreed this was unacceptable (Especially after waiting SO long..) She took it back, and brought us menus to order something else. \nAgain, after this she was gone for another 15+ minutes!!!!! When she finally came to take our order, we just ordered two apps to share. We ordered tacos and chicken strips, and at $12 or $13 for chicken strips, they didn't even come with fries!! OH well, its vegas right? So we ordered and continued to wait. Again, after ordering the second time it was at the VERY least another 25 more minutes until we got our food. I asked for some extra ranch, and that alone took 10 more minutes. Mind you, I didn't mention that they were so slow when we were there so I am not sure what was going on. \nThe ONLY good thing about this experience was the food. The chicken strips were hot, and so tasty and the tacos had just the right amount of spice to them. My mom said the tacos were luke warm, but I thought they were fine. I mean the meat inside was hot, can't expect the lettuce and other fixings to be hot. \nI wish I would have remembered our waitress' name, because even though the service was slow, she was super nice and very apologetic toward us, and even took $7 off of our bill so that was a plus. \nAfter all was said and done, we were there for the better part of two hours. It was kind of ridiculous, but we left full finally. I'm just glad we didn't have plans or anything after cause we surely would have missed them\n\nAlso, for what its worth, not that I care, but none of the waitresses on staff were blonde when I was there, not one!"
        }, 
        {
            "index": 273, 
            "rating": 5, 
            "review": "I've been here before but this time I felt the need to write a review seeing as there are so many negative reviews. My experience was great. Aside from the food being fast and delicious, the price was reasonable for a meal and drink on the strip. The best part however was the service. We were welcomed warmly by the host Joanna and as soon as we were sat, we were quickly greeted by our server Savannah. The service was excellent and was made even better by her warm cheerful attitude. Although it seemed a bit busy and she was running around a lot, she answered any questions we had and gave her suggestions and gave thorough service. Great place to grab a bite and a drink and watch the games. Highly recommended"
        }, 
        {
            "index": 274, 
            "rating": 4, 
            "review": "Not sure why this place has low ratings, maybe it's because they have a cover charge for sport games? Anyways, we walked into this place this weekend while looking for a place to eat. The servers were friendly and the food was great. I got hot wings with a basket of curly fries. We also got shots on the house...well for 8 cents haha"
        }, 
        {
            "index": 275, 
            "rating": 3, 
            "review": "$100 a head to watch the Mayweather vs. Mosley fight here with an open bar.  Located in The Miracle Mile Shops.\n\nFight was wack.  Spent about 2.5 hours here from 7PM-9:30PM when the fight ended.  Ended up paying an additional $70 for a couple servings of french fries and hot wings to go along with all the beer and alki.  The server chick we had was pretty attendant to us considering how packed this place was for the fight.  We paid $100 a head and got seats and our own server while a lot of other people paid $60 and I believe they had to go up to the bar to get their open bar drinks.  I really thought we'd all get a lot more drunk since we all threw down $100 each, but I'd say on average out of our group of 11 dudes, we probably only put down about 3 beers and a shot each.  I got a 3 beers, a shot, and 2 jack and cokes.  Could've done more, but the stomach wasn't liking me that night.  Not sure if it was the food or the previous 2 nights of drinking in Vegas.\n\nPlace is alright overall, nothing special.  Just another sports bar & grill with a bunch of TVs and server ladies dressed up like cheerleaders."
        }, 
        {
            "index": 276, 
            "rating": 1, 
            "review": "Owners are a joke. Especially the one with the gambling and drinking problem that tries his best to have sex with the staff....fail."
        }, 
        {
            "index": 277, 
            "rating": 5, 
            "review": "God!!! This place was amazing. We had the groupon, which was amazing. But even without the groupon it was worth the price. I loved the food, some of the employees were nice. \n\nWould def go back again, considerin I went twice. LOL"
        }, 
        {
            "index": 278, 
            "rating": 2, 
            "review": "Waitresses/ hostess were very polite. However, Extremely slow service despite the place being empty. Took about 10-15 mins to get water and quite a while to get our meal. My BF ordered the patty melt which he said was very good and I ordered the spinach artichoke dip. I wouldn't recommend - it tasted like frozen creamed spinach."
        }, 
        {
            "index": 279, 
            "rating": 3, 
            "review": "First time eating here, we ordered the garlic bread balls ($7.99- it was good),spinach artichoke dip ($14.99- NO!!! it taste like the one you buy at the grocery frozen section)and rib eye steak ($26.99- Like it!! was juicy and tender)."
        }, 
        {
            "index": 280, 
            "rating": 1, 
            "review": "Waited 40 mins when there was only 5 people in the restaurant. First my fries came out then 10 mins later my burger then another 5 mins my soup. So basically my fries were cold so I couldn't enjoy them with my burger. Their waitresses are definitely blondes\nNow I know why they called this place Blondies!"
        }, 
        {
            "index": 281, 
            "rating": 3, 
            "review": "We were visiting Vegas for the weekend and picked up a couple of groupons before we went so a groupon brought us into Blondies. \n\nWe started with the nachos, they were huge and very good. We probably could have just gone with the nachos for lunch the serving was that big. \n\nWe each had a burger, bacon and avocado on mine and bacon and bleu cheese for my bf. The burgers were very tasty and cooked to perfection. Add a pitcher of shock top and we were quite happy. \n\nThe server was nice, attentive enough but not always bothering us. Would go back next time in town."
        }, 
        {
            "index": 282, 
            "rating": 2, 
            "review": "Unfortunately, I will never go back to eat here again.  The food is good, but the SERVICE and management is horrible.  I was in a party of 3 (2 adults & a teen) in the middle of the afternoon and had a bill of $75+ dollars.  20% of that was gratuity.  The server never came back to our table once!  Once we received our food, we never got refills of drink nor did we get the condiments that we asked for.  \n\nSo in my opinion these servers add the gratuity at their discretion because they know that their service was poor.  Gratuity is not a guarantee, it is not for them to decide.  \n\nNever again!"
        }, 
        {
            "index": 283, 
            "rating": 5, 
            "review": "We had a blast here for breakfast. It's not a fancy place but during the week it's cheap breakfast and $3 mimosas! The food is good and a fun place to sit under the sky like roof. The staff was very friendly! Was the only meal in Vegas that didn't break the bank, we would have went here every morning if it were a week day!"
        }, 
        {
            "index": 284, 
            "rating": 2, 
            "review": "There wasn't anything spectacular about this place at all. They had a sign  up on the wall Maxim Magazine voted them one of the best bars in the country a few years back.  Maybe it was super cool a few years ago, but as for now, I beg to differ.  The hostess asked if we would be eating, and we told her yes.  She then told us to grab a seat anywhere we'd like.  We sit, and another woman rushes over and tells us nobody is serving that section.  Strange, since the place isn't huge. But anyway.. we sit elsewhere and she comes over and asks if we would be eating.  Yes. Then she made some rude, unnecessary comment about the hostess forgetting to give us menus.  We ordered our drinks and decided to go with the appetizer sampler.  It was about $22 and came with a few different appetizers.  Honestly, all were bad.  I understand that most bar food is fried food.. but c'mon.  This stuff was literally drenched.   You could taste the oil which was so unappetizing.  My weird husband must have been starving because he said it was alright.  I deemed everything inedible and let him have the rest.  For a drink, I opted for the amaretto sour.  The sweetest, weakest $8 amaretto sour in the world.  It strangely tasted like cherry kool-aid.  What's up with that!? I never really read Maxim Magazine before, but after this.. I don't think they can be trusted."
        }, 
        {
            "index": 285, 
            "rating": 5, 
            "review": "I was walking inside the miracle mile shops  and came across this huge sports bar. Walls covered with sports memorabilia and huge TVs and projectors. I decided to sit at the bar where an awesome bartender by the name of Bell greeted me with a welcoming smile and had a very genuine vibe about herself. She sold me on doing the $20 All you can drink domestic drafts and wells happy hour. Let's say I definitely took advantage of bottomless drinks and had myself a great time."
        }, 
        {
            "index": 286, 
            "rating": 1, 
            "review": "Horrible place. Service was below poor and the food was horrible. Never ever going here"
        }, 
        {
            "index": 287, 
            "rating": 1, 
            "review": "Dear PH: How in the world is this establishment  still open?\nI made the mistake of not checking Yelp first and sat down here with friends from Berlin that want to try everything American, after ordering a Rib Eye Steak the disappointment set in. . . Previously frozen , water tasting, fibrous shoe sole, hunk of dead animal, for 28 dollars! Steamed broccoli was mushy and cold, really? How do they screw up steamed broccoli?  The bake potato was decent. \n\nService? \n\nThe waitress got our order wrong at first, them blamed it on me because it would come out of her paycheck. Then returned to apologize for her tone but still blamed me ! Haha! \n\nWell, I will never ever recommend this place to anyone. KCM needs to be removed from this business and the staff needs a wake up call."
        }, 
        {
            "index": 288, 
            "rating": 1, 
            "review": "Disgusting food, overpriced menu, and lame service. Run, don't walk, away from here. We went around 10:30pm and ordered chips and salsa, small order of boneless wings, and 2 sodas. $37 later - gross wings, stale chips, and chunky brown salsa. Don't even bother, seriously."
        }, 
        {
            "index": 289, 
            "rating": 4, 
            "review": "Great location to watch sports.  They do take reservations the day before but don't let that keep you away because you'll still probably get a seat.  Good burger and fries and of course bucket of cheap beers"
        }, 
        {
            "index": 290, 
            "rating": 1, 
            "review": "There's Low Standards and No Standards! They WIN NO STANDARDS! \n\nDon't be deceived this establishments looks fun and exciting, however the services is TERRIBLE! If you enjoy being treated like the dirt at the bottom of your shoe, this is the place for you.  However, if you like to receive great customer service and a delightful meal for a reasonable price this is NOT the place for you.  I went to \"BLONDIES\" after a late night wedding in Vegas and it was to die for or from in the literal.  \n1) It took forever to get service and food (people that were seated after us were eating before us) 2) One of the individuals in my groups order was not correct 3) The one thing I order a baked potato was cold and old 3) The manager could careless and he let us know it from the response he gave my friend.  \n\nWhen it was all said and done, I tried to give them the benefit of the doubt! So, I took matters into my own hands and said to myself maybe a different approached and a different manager would bring so much need light to the situation.  Nope, I will say at least the other manager attempted to listen, until the rude and disrespectful manger decided to interject with his ignorance (adding fuel to the fire).  As a result, of being completely disrespected and devalued as a customer, I decide to attempt to contact the owner (no success, however not surprised), and finally I decided to write something to caution other travelers not to waste your money at a place like this, when there are other great and fabulous venues in Vegas worth the money.  I refuse to spend my hard earned money at place that could careless how customers are treated.  The staff is a reflection of the management and the management is a reflection of the ownership.  There end is the problem no accountability and employees are allowed to treat customers less than civilized.  They are one of the only establishments open late on Miracle Mile and thus they could careless, plus they aren't about building customer loyalty. \n\nGood Luck if you dare to Dine there!"
        }, 
        {
            "index": 291, 
            "rating": 2, 
            "review": "When visiting Blondies always ask for a table near a waitress!  We had high hopes for this bar but the service and quality of food was disappointing.  If the staff didn't spend so much time gossipping behind the bar then imagine how much more food and beer they could sell...I do miss their fish and chips though (as often as I can)"
        }, 
        {
            "index": 292, 
            "rating": 5, 
            "review": "My wife and I went in to have some wings and fries. Let me say our waitress Taylor was absolutely amazing. The food was fast, drinks faster and service was top notch. If you have had a few to drink and want some great food come into Blondies and enjoy a good meal.\nTheir are tv's in every corner, so you won't miss a second of the action. There are 4 beer pong tables that you can enjoy and possibly get over your buzz. \nThe best thing is that the food was fast and the service (waitress) was outstanding. \nSo cone by here at the end of the night and enjoy some good food. We will be back mainly because of Taylor."
        }, 
        {
            "index": 293, 
            "rating": 3, 
            "review": "Stopped in Blondie's for lunch the other day while playing tourist on the Strip over the weekend. The place looks pretty cool and there are lots of big TVs everywhere to watch your favorite sporting event. The hosts and waitresses were all dressed in their cute little cheerleaders outfits.\n\nI grabbed a sandwich and fries to eat and it was quite delicious. For being in a tourist section, all in all it wasn't a bad place to try out.  Though as a local, I wouldn't find myself making a special trip there just to eat or drink or to watch a sporting event.\n\nBut if in the area, I would go there again."
        }, 
        {
            "index": 294, 
            "rating": 1, 
            "review": "This place is awful. Chips and salsa: chips were stale. Waitress: slow, totally oblivious to her customers and cared more about gossiping with her fellow waitresses. Music: crappy club music no one in their right mind wants to hear the day after in Vegas. \n\nI highly suggest going to Lombardi's restaurant next door."
        }, 
        {
            "index": 295, 
            "rating": 1, 
            "review": "This place had some of the most impersonal service i have ever had.  Standoff-ish waitresses who took forever to recognize i wanted a food menu in addition to a beer.  I worked as a waiter thru school and have never seen such disregard for personal attention.  No conversation, no up sales, & dropped off my change without a receipt after dropping off the bill without a word. The wings and beer, along with the Cowboys/Saints game were great.  I will never come here again. Unless its the only place to see the game in Las Vegas."
        }, 
        {
            "index": 296, 
            "rating": 1, 
            "review": "Recently went to this place.  And need I just say ill stick with Applebee's next time. Food wasn't great for the price.  Service was HORRIBLE.   Waitress was chatting it up w her fellow friends and not friendly. Deffinately won't be going back!!"
        }, 
        {
            "index": 297, 
            "rating": 5, 
            "review": "Good:\n1: Immediate seating.\n2: Bathroom inside restaurant\n3: Nice waitress.\n4: Good food.\n5: Vegas Bite Card discount.\n\nBad:\n1: Cold in December!"
        }, 
        {
            "index": 298, 
            "rating": 3, 
            "review": "If I could, I would give this place an in between 2-3. The food wasn't awful but it wasn't great. My husband and I sat out on the \"patio\" area at a high top table. The service honestly wasn't bad and our experience was brief. I was actually really excited about this place. I liked the idea of a girly sports bar as a girly sports fan and I dug the waitress and hostess cheerleader uniforms as a former cheerleader. It was cute and seems like a great place to catch a game and a beer. It's a little small but they have a ton of TVs (as one would expect in a sports bar!) I ordered a grilled cheese with tomato for $10 and it didn't come with fries. What kind of restaurant serves sandwiches without fries? For $10!!!!! My cheese wasn't melted all the way so the sandwich was doomed from the second I laid eyes on it! My husband got a turkey club. It was nothing special but again, no fries came with it and it was around $13.\n\nWhile they weren't the worst sandwiches we have ever had, we feel as though the place is a complete rip off. Though, most places in Vegas are the same way. We were just extremely disappointed."
        }, 
        {
            "index": 299, 
            "rating": 3, 
            "review": "Wings und fries sind sehr lecker. Das frühstück ist horror......hab es 3 mal zurück gehen lassen. Das gute an der bar ist, das sie championsleauge zeigen mit deutscher beteiligung"
        }, 
        {
            "index": 300, 
            "rating": 5, 
            "review": "Had a great experience with a pretty blonde server named Ariel! Came in to eat and order a medium rare steak. It was cooked perfect!! I had a baked potato and broccoli as a side! So good! My server was super attentive and kept my cold beers coming!!! I will definitely keep coming back!! Also, the staff had great team work and everyone was attending to their customers!!!"
        }, 
        {
            "index": 301, 
            "rating": 3, 
            "review": "We hit Blondie's for lunch on Saturday.  It's really a sports bar... they have a ton of TVs and some tables that can be used for beer pong and they have tables with taps in the middle and it's very loud in there.\n\nWe were seated at one of the tables with a tap, but chose not have beer on that occasion so missed that opportunity.  Our server was friendly and attentive to us.  We used an Entertainment coupon which allows for one free entree when a second is purchased.  The husband had the club sandwich and I built my own burger with cheese, mushrooms and a friend egg.  We both really enjoyed our food.  I liked that they didn't overcook the egg!\n\nIt looks like they have some great specials.  We noticed there is a happy hour special for all you can drink beer for $20 for a three hour period... wow, you could go crazy with that.\n\nYou have to understand though, that this place is very loud and while in the Miracle Mile shops, feels kind of ratty.  But, hey, it's a sports bar.\n\nI'd eat there again."
        }, 
        {
            "index": 302, 
            "rating": 5, 
            "review": "So this bar is the meeting place of The Show from San Diego State University if they are in Las Vegas. \n\nThey have lots of beer pong tables, decent looking waitresses in cheerleader outfits, and ice cold Fireball shots. \n\nLots of TVs and big tables to handle our big groups for watching any sporting event."
        }, 
        {
            "index": 303, 
            "rating": 5, 
            "review": "Used to come here back in the day when we lived in Vegas, so we thought we would check it out while on vacation a few weeks back. To my surprise, Blondies was still kickin! We had a great time and our bartender, Brandon, was on point slangin those drinks. After we ate all of the delicious cheese sticks and drank the vodka dry, we bought a couple t-shirts and left there about 5 in the morning, haha! Good times!!"
        }, 
        {
            "index": 304, 
            "rating": 3, 
            "review": "A seedy bar in the Miracle Mile. Very college bar like. They have beer pong tournaments every Wednesday and Thursday, and the winner(s) get a $500 bar tab. If you want a good game of pong while staring at the giant plastic stripper outside of the stripper bar, then head here. Definitely not the place to go for a classy drink with your date."
        }, 
        {
            "index": 305, 
            "rating": 4, 
            "review": "fandamntastic ... \n\nall tired from walking, head ready to explode ... walked into tacky sports bar\n\nwaitress said ... wait ... in a minit it's $10 for two hours of drinking\n\nwe did ... my gf ... my friend ... my friends gf ... and I\n\nfood common, drinks (on special) common ... waitresses hot! (gf kept wacking my arm) ... service great!!!\n\nno question ... on my list to return ... had sports ... had waitresses ... had beer pong (jesuschristie!) ... had way fun (gf fine now ... had good time)"
        }, 
        {
            "index": 306, 
            "rating": 5, 
            "review": "I came in to have a beer and watch the game with some friends. I wasn't really expecting much but I ended up having a fantastic time . My server Ashley honestly made the whole experience . She was so friendly and kept the drinks coming ! We didn't even have to ask her for refills on our waters, which is an A++ in my book! I will defiantly be coming back and sending friends. If you decide to go in and have a drink make sure you ask for Ashley! You won't be disappointed!"
        }, 
        {
            "index": 307, 
            "rating": 3, 
            "review": "The burger was pretty much the only thing that was good here. Beer selection was pretty limited and service was mediocre at best. It's a bummer that the buffalo wild wings isn't open yet."
        }, 
        {
            "index": 308, 
            "rating": 3, 
            "review": "may I give the fried garlic dough balls one million stars? don't hesitate, don't bother to read the description, just Trust Me and order them. you will thank me later. perhaps not so much those around you later because did I mention the garlic? there's like a whole field of them in there.\n\nlots of TVs, everywhere, perfect for sports-watching. service, albeit a bit distracted, is super sweet. beer is only $6, which is a screaming deal for vegas. the food is your typical over-priced bar fare, and really if you're eating anything other than the fried dough balls, well, don't say I didn't tell you so."
        }, 
        {
            "index": 309, 
            "rating": 2, 
            "review": "As L and I wandered around the Miracle Mile looking for something good to eat we decided to stop by Blondie's and figure out where we were in relation to the front of the hotel.  We were actually attempting to get to the Hawaiian Tropic restaurant.  The girl in front literally looked at me and was like, \"Um, you're in the Miracle Mile... in the Planet Hollywood.\"  HELLO, DUH!   I said nothing.  So, tired of wandering and having food smells lure us in, we decided to eat at Blondies.\n\nThe waitress seemed fine until she started talking.  L was feeling like a beer but the selection sucked- at a sports bar- wtf.  When she asked the waitress if there were cocktails or a wine list she told us that there was ONLY wine and that it was limited to the house red or white.  Too bad there was a full bar inside that I only noticed after ordering!!!!!!!!!!   Strike ONE.\n\nStrike two- she neglected to ask me what kind of cheese I wanted on my chicken sandwich so I got NONE!  I was so disappointed as I am a total cheese freak.  After bringing these matters to her attention she said she would have the manager give us a discount.\n\nStrike three?  The discount was maybe 2% (like a dollar and some change) of the entire bill.  I guess the gesture was nice and all but if it was such a silly amount it was pretty much pointless.\n\nThey put powdered sugar on their sweet potato fries which sounds ok in theory but doesn't work when they're a side to a burger.  It's also quite pricey for average food and terrible service.  Yeah... no."
        }, 
        {
            "index": 310, 
            "rating": 4, 
            "review": "Not quite sure why this place gets poor reviews. Other than its proximity (it's basically in a mall within Planet Hollywood), the bar itself is awesome. \n\nThere's plenty of TVs with sports, cute waitresses who are quick to take your order, beer pong tables and relatively cheap beer prices. We had a group of about 20 in Vegas for March Madness and we were all thoroughly impressed (this was our second year in a row coming here).\n\nThe only downside (outside of proximity) is seats are limited and it's a bit of a shark feeding frenzy when it comes to finding a table.\n\nThe wings were awesome.\n\nIt's a young crowd here, so if you're over 40 or so you might get annoyed by the volume and drunkeness of its patrons."
        }, 
        {
            "index": 311, 
            "rating": 1, 
            "review": "Came here starving,got sat down quick,but no one came to take our drinks or food order down.No waitress in sight.very disappointed. Its beyond loud in there also.Screw you blondies and your horrible waitresses. Took our money elsewhere"
        }, 
        {
            "index": 312, 
            "rating": 4, 
            "review": "The hostess was hot, and the food was good. The service was great and the prices were reasonable."
        }, 
        {
            "index": 313, 
            "rating": 1, 
            "review": "If you want to go to a Sports Bar and be ignored and treated poorly then this is the bar for you.\nWent there to watch the second game of the world series. We were seated right away.  We go the happy hour special.  All you can drink from 3-6pm for $20.Waitress brought us over our first 12oz draft in a plastic cup and left.  15 minutes later she came back and threw 2 wrist bands on the table and said that we needed to wear them for happy hour.  This was the last we saw of her.  The place was not busy at all. We saw her and 4 other waitresses stand up at the frt of the bar  I had to go to the bartender and get more beers.  The bartender was going to charge me for the beers because she said I should have ordered them thru our waitress.  I told her I would have but she never came back to the table.  We got one more beer and left this place.    DO NOT GO HERE!  There are MANY other sports bars in Vegas.  Go there!"
        }, 
        {
            "index": 314, 
            "rating": 1, 
            "review": "SO AWFUL. My pasta had a nicw big clump  of hair in it. Did it get to tell my server?! No! She never came back! She charged us for chicken and when i finally saw her and told her none of is got chicken....she argued with me! I know what i ordered. The bar is a sports bar so it is LOUD. These waitrreses are so rude. Dont eat  here"
        }, 
        {
            "index": 315, 
            "rating": 5, 
            "review": "REFRESHING\n\nMy husband was automatically attracted to this particular sports bar in the Miracle Mile shops, 1. For the huge flat screens all over 2. To the cute cheer leaders serving the tables. \n\nWe sat on the \"patio\" and watched multiple waitress walk by and not address our table. As we looked over the menu one of the waitress walked by and asked if we've been taken care of yet. My husband and son quickly said no. Talia quickly apologized for not having a waitress over at the table , and took our drink order. My son (whom is mentally disabled) started asking questions regarding the menu. Talia was very patient and answered all of Roberts questions.  (thank you for that)\n\nWe decided on a cheese steak, salmon entree and a rib eye entree. \nDrinks were refilled multiple times, my husband enjoyed several draft buds and the food was exquisite for a \"sports bar\"\n\nThe atmosphere was great! Food was a bit over priced but welcome to Vegas \n\nThank you Talia and Blondies team. See you for football season"
        }, 
        {
            "index": 316, 
            "rating": 2, 
            "review": "Came here to kill some time one morning and made the mistake of ordering breakfast here.  $2 bloody marys...$3 mimosas...cheap breakfast specials.  It wasn't even worth the couple of bucks- the food was pretty cheap and tasteless and my bloody mary couldn't even pass for tomato juice.  \n\nThis place would be better for drinks and bar food but for games there is a $50 minimum.\n\nThe service was pretty good however but again...food not really anything special nor is it even worth the cheapness."
        }, 
        {
            "index": 317, 
            "rating": 3, 
            "review": "Located in the Planet Hollywood miracle mile mall we checked and couldn't find many better options as far as sports bars to watch the ncaa final four games.  The place had all you can drink beer happy hour and with games on that basically everyone in the bar was interested in, it made for a festive atmosphere.\n\nIt seemed hard to flag down a waitress, when i finally did i ordered some nachos that were pretty good.\n\nWould probably go back here if i wanted to watch a sporting event that happened to fall in to their happy hour(s)."
        }, 
        {
            "index": 318, 
            "rating": 1, 
            "review": "So my friends and I went to blondies to have a good time when one of their coworkers thought it would be ok to take a a live video with flash WITHOUT us being in the club yet. She thought it was funny to disrespect us and mock us when we weren't even in there territory. I am shocked and so disrespected. Never go in there because there workers think it is appropriate to take videos of people while they are trying to have a good time."
        }, 
        {
            "index": 319, 
            "rating": 4, 
            "review": "Great place to play beer pong. They have tournaments that are only $20 which includes drinking! Also you can show your college ID to get discounts. \n\nThe food is ok. We got the sampler plate. Good while your drink but not high quality or anything. We usually just go for a fun place to play beer pong on the strip!"
        }, 
        {
            "index": 320, 
            "rating": 3, 
            "review": "No beer can chicken anymore.  Used Entertainment coupon.  Sports bar, watched red wings game."
        }, 
        {
            "index": 321, 
            "rating": 5, 
            "review": "Best sports grill I've been to in Vegas! We were seated right away and we had a cute little server named Marissa. We just came for wings, but our server sold us on some nice cold beers:) She was very attentive, friendly, and made our overall experience great. Great customer service & the food was amazing. We will definitely be back again!"
        }, 
        {
            "index": 322, 
            "rating": 5, 
            "review": "Definitely our favorite sports bar on the strip. Every thing I have tried on the menu has been awesome, I love their Cobb salad...it's huge! You'll never miss a game since there is a 360° view of tvs around you. The staff is always friendly - especially our favorite waitress Amy!"
        }, 
        {
            "index": 323, 
            "rating": 3, 
            "review": "The food is great for the portion size. and price to as well."
        }, 
        {
            "index": 324, 
            "rating": 2, 
            "review": "+ Food was delicious\n- 15 minutes for a waitress to get our drink order, service wasn't very good.  Restaurant was not crowded at the time.  Simply a restaurant with a gimmick like hooters"
        }, 
        {
            "index": 325, 
            "rating": 4, 
            "review": "This place is inside the shopping area in Planet Hollywood. Ended up here after walking around and looking for something to do!\n\nThey have a bunch of beer pong tables in the back. You can purchase one of their \"beer pong\" packages which consists of 22 cups and 2 balls for $5, and a pitcher of your favorite beer for anywhere between 15 and 25 bucks.\n\nIt's pretty fun for a change of pace from the clubs if you're chilling with a couple of friends :)"
        }, 
        {
            "index": 326, 
            "rating": 1, 
            "review": "regarding fight at blondies,first of all they lied 2 us since we were in line getn ready 2 go inside we were told it would be 60 dollars then it went up to 80 while we were in line it went up to 100dollars we wanted 2 see fight so we paid it we were six of us it was.we were told that it would be all u can drink on some beers after a hr they didint have the beer we were drinking once fight got started the waitresses were taking a long time coming 2 help us when fight got started me and two friends went in to girls restroom and there was guys going in there we were getn harrased in there and there was no security in sight one of the guys that we were with went to tell the manager and he was to busy collecting money from people getn in it is not a safe place to go if ur a girl we contacted the owner when we got back to town and he gave us a big story that there was no complains at all on that day A BIG LIE we will noy go back 2 that place ,and if there was any girls on that day that know what i am talking about you should call that place and complain"
        }, 
        {
            "index": 327, 
            "rating": 3, 
            "review": "If you just want to beer pong,this is the spot.other than that,its cool.This place waaaaay in the back of miracle mile at planet hollywood.almost got lost but finally found it.the best part all you can drink from 3-6 i believe for 20$ which is cool as well"
        }, 
        {
            "index": 328, 
            "rating": 4, 
            "review": "This bar is a nice place to gather and watch a few games.  Me and my travel amigos met here for the Night Crawl group.  The bartenders and the waitress was awesome and the drinks were on point. We even found out that the manager was from Texas.  That made the fun even more better.  When I go back to Vegas I will definitely be going back here."
        }, 
        {
            "index": 329, 
            "rating": 4, 
            "review": "Their pizza is delish!!!! Curly fries are hot & fresh. Bartenders are pretty fast too. I liked this place - I started a bar crawl here & it was chill."
        }, 
        {
            "index": 330, 
            "rating": 5, 
            "review": "My new and very improved review!\n\nWe were in for the week and stayed at Planet again.  We gave Blondies a second chance to dazzle us.  I am so glad we did!  I'm not sure if the management had changed since last year, or if we were just lucky, but everything was great!\n\nOur server, Gabby, was so sweet and attentive.  We weren't through with our drinks (soda) and she was at our table with refills.  Always smiling, too!  We ordered various appetizers-potato skins, onion rings, wings and nachos.  Everything came out in a timely fashion and was piping hot and delicious!  Gabby came back to our table to check on us many times while we were enjoying the food.\n\nNo complaints from us, in fact, we went back a second time during our stay, and Gabby was our server again....Yay!  She was just as great as the first time.  Thank\nyou for a very nice experience!    In my world...good service equals good tips!"
        }, 
        {
            "index": 331, 
            "rating": 1, 
            "review": "Happy hour sucked. $8 rail drinks. We went to watch a specific game they were rude about changing the channel.  No one seemed to know what the heck was going on. Terrible place. Never again!"
        }, 
        {
            "index": 332, 
            "rating": 4, 
            "review": "I don't get the reviews here; I didn't see anything that reflects all the bad reviews. Basically, it's a Hooters with girls in cheerleader outfits instead of the skimpy Hooters outfits. \n\nIt's a sports bar with sports bar kinda foods. How can the expectations be that high? I don't get it. Huge TVs everywhere, bar, wings, finger foods. \n\nCame here twice in a weekend. Both times, there was no issue with customer service. Both girls were super friendly and helpful. There wasn't a lag in service at all.\n\nI really enjoyed the sliders here. No high expectations or anything. Wings weren't bad. Sample platter was all fried, what do you expect? They include FRIED mac and cheese balls. Delish! \n\nAlso, if you're a Total Rewards member, you get 20% off! Awesome!"
        }, 
        {
            "index": 333, 
            "rating": 1, 
            "review": "The absolute worst service I've ever had in Vegas. We were unfortunate to happen to walk by hungry. HUGE mistake.  Food was nothing spectacular...never got checked on by our waitress until we asked for the check. Just a waste of time and most upsetting to me.....a waste of calories. There are so many other places we could have and should have gone to for a quality meal....like GR's Burgr! At least that place in Planet Hollywood is definitely worth the wait."
        }, 
        {
            "index": 334, 
            "rating": 1, 
            "review": "Horrible experience #1 stuff  chewing gum that's the last thing a personstry who works instthe service industry wants to see that ? #2  ,food was cold stuff replaced the food wich is good manager never came to the table to say sorry or follow up ? Tables around were dirty for a long time before the busser realized tables need to be cleaned I  guess on the side corner station where all the gossip and drama goes on and Facebook is more important.....\n\nTo all the servers and busser at this place You guys  enberassed  the service industry ."
        }, 
        {
            "index": 335, 
            "rating": 1, 
            "review": "WORST SERVICE EVER!!!! Like other yelpers nothing but excuses!!!! Took half hour for drinks messed up on our order then proceeded to argue with us about it! I am a server and they should know better!!!!!!! I highly reccomend avoiding this place do not waste your time!"
        }, 
        {
            "index": 336, 
            "rating": 1, 
            "review": "If you're shopping at Planet Hollywood shops on the Strip, don't bother stopping in here. Plenty of TVs but you can't hear anything except the beer pong game going on in the back. Service was terrible too."
        }, 
        {
            "index": 337, 
            "rating": 2, 
            "review": "Fun place to watch the game but food isn't so impressive and it is somewhat pricey. I am rating this on food only. Husband ordered a regular hamburger ($13) which does not include fries and I ordered a cheesesteak ($16) no fries either. Fries purchased separate.  Food was just ok tasting. It wasn't bad but nothing to write home about. I would say they do need to improve presentation (refer to pic). So many other options to choose from so if you are there to eat maybe try somewhere else."
        }, 
        {
            "index": 338, 
            "rating": 5, 
            "review": "The best damn wings ever!!! Went here twice over a week while visiting Vegas. One of the waitresses Veronica even remembered the mrs and myself! Great food and great service!"
        }, 
        {
            "index": 339, 
            "rating": 1, 
            "review": "Absolutely horrible service.. didn't even bother to stay. We walked up to the door and had to ask the hostess to be seated. He response was \"I have no tables,\" so I asked, if they had any open seats at the bar and she said \"nope!\" Then turned around and walked away. Won't ever be back.. if that is the service from the first person you see when you walk in, I can only imagine what the service is like inside."
        }, 
        {
            "index": 340, 
            "rating": 4, 
            "review": "In the bowels of the Miracle Mile Shops in Planet Hollywood casino, so not easy to find unless you're shopping there. I liked it, good sports bar, many TVs, waitress was very friendly and food wasn't terrible."
        }, 
        {
            "index": 341, 
            "rating": 1, 
            "review": "Basic menu. Wings are below average. There are many other bar and grills you can go to in Vegas. I'd pass on this place."
        }, 
        {
            "index": 342, 
            "rating": 2, 
            "review": "Blondies is a tough sell on me.  I like playing beer pong, and the crowd Blondies attracts is young and fun; mostly.  However, the beer is cheap and tastes cheap, the food is lower quality than most of the local bars, and the service is below par.  IMHO, there are plenty of better places to go on your night out, however, you should still visit Blondies and experience it first hand."
        }, 
        {
            "index": 343, 
            "rating": 1, 
            "review": "Thank God it was a free meal because I did a survey next door. But I will never come back here the service was so horrible and the waitress was not attentive and it wasn't even busy. I didn't get a refill for my drink and the cup was empty for 20 mins. She got my order wrong. And that's just the top layer. We had to ask for everything twice. Not only that I waited for the bill for 30 mins after getting tired of waiting I asked for it again and she said she gave it to us. If she did I would have paid it and get the heck out.\nThat was just the service the food wasn't great either. Garlic fries were dry its just curly fries with whatever crap on it they call garlic. The pizza blah I've had better at pizza hut. The wings were decent but I can get better ones from the freezer at the grocery store."
        }, 
        {
            "index": 344, 
            "rating": 3, 
            "review": "You get what you pay for and although the pricing is high for where we come from, it's inline with Vegas strip costs. I had a caesar salad, and sandwich with a blondie beer(Great brew). It was accurate and on time. No arguments here. A good stop to fill the appetite and grab a drink."
        }, 
        {
            "index": 345, 
            "rating": 4, 
            "review": "Located in the Miracle Mile Shops inside Planet Hollywood Hotel Casino on the Famous Las Vegas Strip.  A fun little sports bar that is a little \"Hooters-esqu\" Just so you know what you are getting into. The food is good as is the service. They have great breakfast specials, worth checking out. they have a pretty good happy hour as well. I will say the prices are not bad for the strip, so stop in have a beer or three and take a load off. Do a little people watching while young are there, what can it hurt? Live It Up You Are In Las Vegas For Cryin' Out Loud!"
        }, 
        {
            "index": 346, 
            "rating": 1, 
            "review": "This is the worst service in Vegas. Sat waited 10 min asked again for service. Ordered wings  got that wrong wings arrived no silver ware . waited another 15 min for bill.  Seems to be no manager in charger."
        }, 
        {
            "index": 347, 
            "rating": 2, 
            "review": "We came here for the happy hour drink special and ended up grabbing a bite to eat as well. I would come back for the beer but not the food."
        }, 
        {
            "index": 348, 
            "rating": 1, 
            "review": "Think they can't ruin a burger?! Think again.  Plus they have the audacity to charge an automatic 11% for TIP!!!!  Service SUCKED, beer SUCKED, burgers SUCKED - need I say more - don't waste your time - grab anything elsewhere - anywhere!"
        }, 
        {
            "index": 349, 
            "rating": 4, 
            "review": "Just stopped for a drink waiting for the mall to open.  $1.99 Bloody Mary and free Wi-Fi...don't mind if I do."
        }, 
        {
            "index": 350, 
            "rating": 1, 
            "review": "DON'T GO! I called this place to ask a question about Groupon. \"Jen\",  the girl who answered the phone could not answer my question because she had no clue what Groupon was. Ok, that's fine... I asked to be transferred to a manager and she said there was no manager there. I asked to be transferred to ANYONE else in that establishment...she said there was no one there, she would have to take a message and have someone call me tomorrow. WOW, I must have spoken to Blondie aka \"Jen\"  herself because apparently this chick runs the show all by her lonesome. WTF. But really tomorrow? I call back... same take a msg BS and she hangs up. I call back again she says, \" I'm f*cking busy and can't deal with this sh*t\", and hangs up. ( No shit you're busy Blondie I mean \"Jen\" -you run this joint alone)  I call back she picks up and hangs up . At this point I am livid, en route to Blondie's and instead of tasting the food there I am about to smack the taste out of Jen's mouth. I call back the manager finally answers, talks to me and apologizes. ( I guess Jen is not the one woman show). At this point I am standing in front of Blondie's listening to her on the other end of my cell phone. The damage done is beyond reparable and for whatever reason I still walk in order a soda. I sat there for 5 angry minutes decide I couldn't stay there so I throw some money on the table and skidaddle.   I CAN 100% GUARANTEE I WILL NOT BE BACK NOR WILL I RECOMMEND THIS PLACE TO ANY OUT OF TOWNERS.  THIS PLACE REALLY NEEDS TO  RE-EVALUATE WHO THEY HIRE AND HOW THEY TRAIN THEIR STAFF AND SERVERS TO TREAT THEIR CURRENT GUESTS AND FUTURE GUESTS VIA PHONE."
        }, 
        {
            "index": 351, 
            "rating": 5, 
            "review": "Watched the UFC fight there a few days ago, great bartender, fun atmosphere, good food & reasonable prices. We will definitely go back."
        }, 
        {
            "index": 352, 
            "rating": 5, 
            "review": "I don't know about all the negative reviews, all I've had are positive experiences here and I've been a customer a number of times.  Maybe people are used to getting their drinks for free in the casino, but as far as I'm concerned, the all-you-can-drink happy hour is the way to go.  Great place to watch a game, especially a fight, but get there early for a title bout.  Very good bar food (don't expect anything healthy... you're in Vegas), excellent service.  Love this place."
        }, 
        {
            "index": 353, 
            "rating": 1, 
            "review": "We ate here and had a few drinks. The waitress was great. But here is the issue: watch the check. The first meal they charged us 2.00 for each vegetable added to the pizza when the menu said 50 cents. They did correct it but blamed the computer. This morning they charged me an extra 1.00 on an egg I had added. Again they tried to pass the buck by the floor manager. I just want people to watch as this must happen all the time.\n\nAfter this response from the manager I had to respond:\n\nComment from Von M. of Blondies Sports Bar & Grill \nBusiness Customer Service\n12/10/2016  Menu never said .50cent per topping and the toppings for the big 16inch pizza are always 2.00$ also an extra side is $1 that is correct ... eggs arnt free sorry . Takecare \n\nVon M\n\nWow! I'm appalled at your response. I don't appreciate you insinuating we lied on our review. As we went to the hostess stand each time and reread the menu to check pricing. For your information we ordered a SMALL pepperoni pizza and added 3 vegetable toppings as the menu said each was 50 cents per topping. The Pizza was not a 16\" like you referred to. When we got the bill we were charged $2.00 per topping. We checked the menu again and it stated 50 cents per topping. The waitress also checked and told us we were correct.  The next morning we had breakfast and ordered one egg with our meal (I know they are not free) and again was charged $1.00 more than what was stated on the menu. Again my husband went to the hostess stand and checked the menu and sure enough we were charged an extra $1.00 more than what was stated on the menu. We had the same waitress in both situations which it appeared she was somewhat embarrassed knowing that this was second time around for us.\n\nI suggest that you get your menu to correlate with your computer and maybe that would solve a lot of your problems. Judging by the other yelp reviews you have commented on, you have done a good job showing your rudeness. My suggestion to you is that if you can't take the heat of \"yelp reviews\" you need to get out of the kitchen. In other words get another job.  It might save you the trouble showing how you react to dissatisfied customers."
        }, 
        {
            "index": 354, 
            "rating": 1, 
            "review": "Came here only to find out that my two favorite bartenders were gone. And since the current bartenders are catty bitchy females who obviously didn't want my money (as shown by their eye rolling) I happily took my money and my tendency to tip 50% elsewhere. The food here sucks, anyway."
        }, 
        {
            "index": 355, 
            "rating": 4, 
            "review": "Went here with a few friends and the management turned what could have been a bad experience into a good one. We (party of seven) were seated promptly, but there was a disconnect between hostess and waitstaff, so we didn't get a server right away. We decided to leave, and on the way out, one of my friends mentioned why we were leaving. The manager found us about to be seated at another restaurant and asked us to come back. He more than made it up to us. The food was good and the servers were lovely."
        }, 
        {
            "index": 356, 
            "rating": 3, 
            "review": "Everything on the menu is pretty much fried or really unhealthy in some other way. Large portions- get the Groupon if it's still available\nGood service and ok food (definitely a brick in your tummy tho)\nAdorable hostess and I felt really bad for her cause there's a lot of creepy, disgusting, skeezy guys that come here and she clearly gets sexually harassed by most of them. All the girls that work here have to wear cheerleader outfits and I hope they get better tips for it because they really have to deal with a lot.\nGreat morning specials\nAwesome place to watch the game because there's a million TVs"
        }, 
        {
            "index": 357, 
            "rating": 5, 
            "review": "The trip to Blondies made my trip to Vegas even better. My friends and I went to Blondies during there 7 yr anniversary, they has a 20$ all you can drink beer, which was awesome because we played an enormous rounds of beer pong. But when you first step into the bar the first thing you'll notice is the vast number of big screens they have. Second is the two bars they have in stock. Third the 8 beer pong tables they have ready for people to play. And to save the best for last the beautiful hostesses in their cheerleader uniforms. \n\nThis is a great place to watch sporting event, have a great time with friends, meet new people, and play beer pong. They have great hospitality, great vibes, great music mix, and a good price for a pitcher of beer for pong. \n\nSo I would like to thank Blondies for the great times they have given me and my friends when we were there. Special thanks to my bartender katie. She will always and will be my number one bartender for life. Much love and much respect to that girl."
        }, 
        {
            "index": 358, 
            "rating": 4, 
            "review": "If I could only describe this place in one word, I would have to say:\n\nCRACKIN'!!!!\n\nbut let me elaborate...\n\nA handful of girlfriends and I decided to hit up Vegas. It was our first day there and we were starvin Marvins. We randomly picked Blondie's because nothing else sounded good. So what we order? CHICKEN STRIPS. And man, I tell ya.. these chicken strips were the best I ever had. WE ever had.\n\nWe come here the NEXT day, to get MORE chicken strips for lunch. And all of a sudden we hear loud music and people dancing on the bars. We didnt know Blondie's was poppin on a Tuesday afternoon!\n\nI swear we ate chicken strips all 5 days in Vegas and we were fine with that!"
        }, 
        {
            "index": 359, 
            "rating": 5, 
            "review": "Good food, great service! Alyssa was our server and she was so fun and tentative! I had the tacos (yum!) and my husband had the build your own burger. We were both delightfully surprised at the quality! I highly recommend stopping in. And if you're lucky, you'll get Alyssa too!"
        }, 
        {
            "index": 360, 
            "rating": 5, 
            "review": "Great place to watch games outside of the sports book. They have a great happy hour.  20$ aycd!!! Belle was awesome! One of the better bartenders that I've ever had. Beer pong tables/ giant  TV screens and a great staff."
        }, 
        {
            "index": 361, 
            "rating": 4, 
            "review": "A must on our trips to Vegas. It isn't the best place, but for good service, a sports bar, it meets its mark. Easily the best Buffalo Chicken Wrap I have ever had. First time was a couple of years ago, and we still talk about it. Was there again last week, and it is still just as good. If all you do is stop for a wrap, I'd say don't miss out!"
        }, 
        {
            "index": 362, 
            "rating": 4, 
            "review": "It was my second appearance at Blondies for dinner, and this time to start I opted for a bowl of Spicy Chili, which was excellent in flavor, and true to its name but not overly spicy--yet could have been heated hotter.  Then I followed up with an excellent Build Your Own Burger.  Mine was a half-pound medium-rare burger festooned with lettuce, tomato, pickles, American Cheese, mushrooms, bacon, and fresh avocado slices, which was indeed a mouthful.  And Diane and I split a generous order of very fine and flexible elongated French Fries.  My party was seated in the patio area along the Miracle Mile directly facing a lively, overactive water fountain and the V Theater.  The mood was festive.  Service by cheerleader-clad waitresses was friendly, swift, and accurate.  And only some paper scraps on the floor detracted from the sports bar ambiance.\n\nBut, as many have said, food is king.  And, here the food is very good indeed!"
        }, 
        {
            "index": 363, 
            "rating": 2, 
            "review": "2nd time wasn't as great.  greasy as hell."
        }, 
        {
            "index": 364, 
            "rating": 1, 
            "review": "I guess they don't need customers!  We tried to eat there on 6/19/14 around 10:30 am, I asked the hostess if we could get breakfast and lunch at this time to accommodate our small party of 4 and with attitude I was told \"the kitchen staff prefers to only make breakfast that early, and that as the hostess SHE can decide if they can make it, but it's really an inconvenience.\"  This girl had no manners and was no help at all."
        }, 
        {
            "index": 365, 
            "rating": 1, 
            "review": "I had absolutely the worst experience I have ever had at a bar on the strip at blondies today. 11/4/14. The bar was busy and the restaurant was too and there was only one bartender. Being in a hurry to get the Britney Spears concert it made it impossible to get a drink before. Completely unacceptable for Vegas standards."
        }, 
        {
            "index": 366, 
            "rating": 3, 
            "review": "My husband and I liked this place. We would definitely return. Fast and friendly service. Some of the patrons were a little loud but it is a sports bar. It's a nice spot to bring a large group of people who like to watch games on TV. Food was really good and well prepared. Nicely located inside the Miracle Mile shops."
        }, 
        {
            "index": 367, 
            "rating": 5, 
            "review": "Stubbled upon this place with my girlfriend around 3am after the club and got some wings our bartender Brandon was so much fun! We our coming back next time we're in Vegas highly recommend this place!!"
        }, 
        {
            "index": 368, 
            "rating": 5, 
            "review": "The bartender Brandon made our night!! Not only was his service stellar, but the recommendation on the fish tacos just made the night. I expected this to be a dive, the food and service changed everything. Awsome place for being hidden. I'm telling all my friends to go get the tacos and to roll on in when Brandon is there!!!!!!!!!"
        }, 
        {
            "index": 369, 
            "rating": 1, 
            "review": "Worst place in Vegas \n\nAt first glance this place is enticing, luring unsuspecting visitors to the sports bar setting. Don't be fooled: this place is awful. Starting with the service and ending with the bill, Blondies is a waste of everything: time, calories, and money. I only ate there with my family and friends because the line at the renowned Spice Market Buffet was over an hour and a half long. The wait staff is pathetic, everything on the menu is overpriced, and the food was not even mediocre. You will end up paying $23 per person for a soggy burger, limp fries, and a flat drink. If you can't make it to the buffet, eat somewhere else in the Miracle Mile."
        }, 
        {
            "index": 370, 
            "rating": 2, 
            "review": "Loud. Below average wait staff. Food OK. Poor beer selection unless you like bud light, etc. There are better places. In the same mall, see PBR Rock Bar."
        }, 
        {
            "index": 371, 
            "rating": 3, 
            "review": "Get the 'big breakfast burrito'! \n\nNice place in the mall and its a reasonably priced reliable place for breakfast. The only thing they're missing is espresso coffee."
        }, 
        {
            "index": 372, 
            "rating": 3, 
            "review": "July 13, 2016 Had one good night and one not so good. Back to Vegas twice a month. Will give it a go and see if we can break the tie. Sports. Great Location."
        }, 
        {
            "index": 373, 
            "rating": 1, 
            "review": "This had to have been the worst service I have ever received. After 30 minutes of waiting we had to ask the front staff to send our waitress to us. Once someone finally came she took our drink order which we didn't see for another 30 minutes. Finally we ordered our food and they brought us the wrong order. After taking it back to the kitchen and waiting 15 more minutes we were brought the wrong food AGAIN. Did I mention if we wanted more drinks we had to walk up to the bar because we never did see our \"real\" waitress, since the only one we saw kept giving us excuses about how she was so busy (this place wasn't full AT all). After asking for the manager we kept getting a waitress telling us she was the best we were going to get. The manager finally came and again, excuses. I will never dine here again."
        }, 
        {
            "index": 374, 
            "rating": 1, 
            "review": "Initial Greeting: Not bad, however the Host did not know where the State of Montana was? That should have been a sign.\n\nDrink's: Yikes, over 10 minutes for any kind of greeting by our server, and another 10 minutes to get our 3 bottles of beer.\n\nFood: I've had better, but it was not horrid. We waited another 20 minutes to order our food, but it came out in probably 8 minutes (Which makes we wonder when it was actually cooked/prepared). We had no forks/napkins, and would not get acknoledged until our meal was about done. \n\nPayment: I complained (we were at an hour 30 minutes now). They gave a small comp (which is better than nothing) and even was greeted by the manager (who never actually said he was a manager). After that, I just walked to the bar to pay, because, well.. I was tired of waiting.\n\nOverall: Poor service. Medicore food. I would not ever eat here again. They need more staff, and possibly get rid of them beer pong tables. I hate people reaching for a ball under my chair when I'm eating."
        }, 
        {
            "index": 375, 
            "rating": 1, 
            "review": "I'm sharing my personal experience because I appreciate reviews, good or bad.\nI ordered a side Caesar Salad and a Baked Potato. The salad was very tasty,  the baked potato was undercooked and unedible. The people working were kind; however, the service was VERY slow. Even though they only had like 5 tables with customers, it took about 10 minutes before they took our drinks order and 10 more minutes to bring it to us. Personally I wouldn't go back there."
        }, 
        {
            "index": 376, 
            "rating": 3, 
            "review": "Another one that took a dive. We ate at Bondies many years ago. I can't remember how far back. The food was exceptional. Granted it's bar food, but I like bar food and the atmosphere is nice. We had tickets to a show at the V Theater and a Groupon came up for Blondies. So it was perfect. Eat, then walk a few steps to our show. We were seated immediately. Our waitress gave pretty piss poor service. We are not extravagant people. I don't need you to kiss my ass because you're serving me food. I just ask that you refill my water, and get me my food when it's ready. This waitress was bottom of the barrel. It took her forever to get our order...after walking past us telling us she'd be right with us. She then explained how it's been soooooooo busy and short staffed. I'm human, I get it. No worries. However, she was off doing god knows what and I see a guy in a t-shirt (a bartender, a dishwasher) I don't know who he is. But he kept running all her food. Um, ok. She's just walking around like she's got nothing better to do. Also, I'm pretty liberal. I don't care if you have tats over your damn eye lashes BUT sometimes what you wear does not go well with your \"art.\" She was covered in really bad faded tats wearing a cheerleading costume. The hostess was gabbing with two friends who came in for applications. She would gab with them. seat someone then back to dishing about how great the job is. UGH. Unprofessional. But the food was good, when we finally got it. Nice girl, but slow service. Overall, with a groupon or a comp or desperation would bring me back. But hopefully none of that is likely. \n\nI have never had their alcohol I can't speak to that or happy hour specials."
        }, 
        {
            "index": 377, 
            "rating": 5, 
            "review": "Fernanda was my server and she was great. She seemed to have a busy section and she handled it very well. She was attentive to her tables and she was very nice. We watched the football game and we had the nachos to share and a couple of pitchers of beer that she suggested. Great fun!!"
        }, 
        {
            "index": 378, 
            "rating": 2, 
            "review": "[late post] day 7 of my 10..\nbrought cousins & one's bff to check out the Miracle Mile Shops @Planet Hollywood for their first time...they wanted to try to catch the 2nd half of the nba finals, game 2, esp since our home team was playing (go, warriors)...came across this lively sports bar w/ tvs everywhere...so, gave it a try...\n\nwe got sat at a raised booth with a stripper pole...diff & neat...likey...but wooden seat was hard...\n\nFOOD  |  see my pix of...\n- Rockin' Nachos: loaded w/ black beans, tomatoes & cheese topped w/ jalapeños served w/ sour cream & salsa, 16.99  |  add steak, 3 ...\"steak\" my a$$!...jus some bits...uhhh, almost 20 bones for freakin' nuthin-special-nachos?!...what kind of krack r they smokin'??...\n- Pitcher of Rockin Rock  |  14.\n- Shots of Fireball  |  4 ...good deal\n\nSERVICE  |  our waitress (kayla) came by to check on reorders, but didn't bus our table...smh, 1 of my pet peeves...\n\nDEALS  |  1) damnit, if i read a lil on yelp, woulda seen that they have groupon!...$50 worth @ $32 (36% off)...good on f&b...must have 2+ persons... this deal woulda been perfect for us given our check total...\n2) bogo entrée in the Miracle Mile coupon book, which u could get at one of the info booths...supposed to show an aaa card or w/ another redemption coupon...\n\nCONCLUSION  |  convenient locay, fun atmosphere, large screens, some drink deals, avg food at high prices..."
        }, 
        {
            "index": 379, 
            "rating": 3, 
            "review": "Purchased a goupon which enabled us to overindulge.  My BF and I ordered a pizza, wings.  The wings were ok....nothing special btut the pizza was excellent.  The drinks are a little expensive but our waitress was super nice and informative.  She upsold us on drinks , its a good thing we had a groupon!  It was pretty dead when we went to we were served right away and rec'd our food right away...seems like it would be a fun place with the beer pong set up and all....if there were other peole then just us."
        }, 
        {
            "index": 380, 
            "rating": 1, 
            "review": "Can I give it a zero PLEASE OH PLEASE YELP?!\n\nWORST CUSTOMER SERVICE EVER!\n\nI asked the hostess about happy hour, she rolled her eyes at me and gave me the most attitude ever .. I was shocked! But I still wanted those damn garlic fries so I still let her snooty ass walk me to a table .. she tried walking me to some bfe table and so I told her I was going to sit at the bar for quicker service.  She stared at me like I was ridiculous, whatever. \n\nBartenders were clueless with their drinks .. wanted to get drunk after a weeks hard work but no where in PH gave me the chance. :(\n\nIf you're in PH just get some Earl's and gtfo :) Cosmo across the way has much better customer service AND drinkks!"
        }, 
        {
            "index": 381, 
            "rating": 1, 
            "review": "Just ate a very greasy breakfast there. Neither the hostess nor the waitress had the energy to crack a smile once. Overall, a bad experience."
        }, 
        {
            "index": 382, 
            "rating": 4, 
            "review": "Great food. Love the tuna sandwich. Cute waitresses, lots of tv's. I eat here everytime I go to Vegas. Perfect sandwich, burger, fries place. Love the atmosphere and there are huge portions for the price."
        }, 
        {
            "index": 383, 
            "rating": 1, 
            "review": "If it was possible to take away stars from other reviews, I would! Seated right away. 10 minutes later, no one had even said so much as hello. I flag down hostess and let her know we haven't seen a waitress. 5 mi urea later, waitress comes by and says \"I'll be with you in a minute\". A couple minutes later she finally comes. Order a couple beers and some food. Can't order a glass of water (they only serve bottle) really??!!\n\nFood was average and service remained horrible. No silverware delivered with food. Asked repeatedly for silverware and napkins. \n\nIf you are a local, there is ZERO reason to ever come here. If you are a tourist, do yourself a favor and catch a cab to nearest PT's pub. You will more than save the cab ride in booze costs and get great service.\n\nPlaces like Blondies make me feel ashamed after I leave. Like I really should have known better!"
        }, 
        {
            "index": 384, 
            "rating": 1, 
            "review": "Worst service I have yet to receive. My husband and I came in and order food and less than 30mins mins later they brought us the check. We has to spend more more $100 to not be brought the check every 29 mins. Worst service I have received yet. At planet Hollywood I would much rather go to a different sports bar. They were not busy at all just wanted to get rid of customers because of closing time. Do not come here."
        }, 
        {
            "index": 385, 
            "rating": 1, 
            "review": "What a disappointment!\n\nI was here a couple of years ago and ordered the beer can chicken.  It was moist and delicious.\n\nI returned last weekend with friends and suggested the expensive beer can chicken ($17), remembering how good it was the last time.  Boy, has the quality declined!  Before, they used to fit an entire beer can into the chicken, but now, then chickens are so small, they have to use one of those Texas longneck style aluminum beer cans cuz the normal style could not fit in this stingy, malnourished bird.\n\nOur table ordered two of these lame entrees, and both were undersized, dried out and tasteless.  Nothing like I remember it.  Water was free, but tasted like crap (unfiltered Vegas water, I presume).  My friend ordered a margarita on the rocks and had to send it back because it tasted disgusting and was the worst she ever had.  Veggies were overcooked.\n\nAn expensive meal for crap food.  NOT impressed!  Never going back there again."
        }, 
        {
            "index": 386, 
            "rating": 2, 
            "review": "I was hoping for a good (drunk) time but nothing. I like many others got the Groupon deal of an open bar for $10 from the regularly priced $20. Even if you don't have a Groupon, Blondies advertises the best happy your in Vegas: All you can drink (beer or well drinks) from 3-6pm or 10pm-1am, excluding game days. Blondies is located inside the always busy Miracle Mile in Planet Hollywood. It's a great place to catch a game compared to other pricier places on the Vegas strip.\n\nMe and my lady friend went in on Friday, January 17 and we're expecting a wait but it was pretty dead for 10pm on a Friday night. Blondies has some serious square footage and there's a plethora of sports memorabilia and flat-screens littered throughout the bar and grill. We were told to seat ourselves wherever we wanted and we headed towards the back bar. However, we quickly made our way back to the front bar after the bar tender informed us she was closing up.\n\nAfter seating ourselves, a server was quick to tend to us and we let him know we had the open bar deal. He went on to put a bracelet on us and began serving us well drinks. Simple vodka and juice drinks. The first drink was nothing to brag about. I felt like I was drinking expired cranberry juice while my girlfriend drank orange juice. I knew then and there we were not going to get drunk. Five drinks (each) later we were exploding from a big dinner and tons of cranberry and orange juice. Not even a buzz. We decided to call it quits and take our loss. \n\nI think my biggest gripe is the inconsistency in drinks. The bartenders were great guys but one was making us real drinks while the other was serving us juice. Regardless I was nice enough to tip every time. The TV at our bar was playing an old UFC fight and my lady was forced to watch some guy get his head and nose bashed in while we drank our watered down drinks. We could have asked to change the channel, but didn't feel like bothering our bartenders. I'm sure this isn't a bad place by any means but I'll have to dispute their claim as the best happy hour in Vegas. \n\nAmbiance/Decor: 3/5\nFood (Drinks): 1/5\nService: 3/5\nPrice: $$\nOverall: 2/5\n\nPros:\n+ Full bar\n+ Open 24 hours\n+ Drink specials\n+ Lunch/dinner menu\n+ Cute hostess' and bartenders\n\nCons:\n- Open bar drinks vary in strength"
        }, 
        {
            "index": 387, 
            "rating": 2, 
            "review": "This place is over priced!\n\nFood was ok. I mean this place is cool if you wanna watch the game, drink a few beers and eat greasy bar food. There's like a billion TVs here which is cool! \n\nOther than that, I probably won't be coming back when I visit Vegas. I like GOOD food! But it was fun here :)"
        }, 
        {
            "index": 388, 
            "rating": 5, 
            "review": "After days of paying stupid prices for breakfasts, w found this place on our last day here. The $2.99 breakfast special was a godsend. Wonderful find. A must do for the next visit to Sin City."
        }, 
        {
            "index": 389, 
            "rating": 3, 
            "review": "Sensory overload!  Nothing like your eyeballs being pulled in every direction to watch wall to wall flat screens as you try to recover from the night before.  I should reiterate that, every inch of the place is practically covered in flat screens.\n\nThat's really the reason you will ever step foot in here.  The perfect spot to watch every single football game being broadcasted.\n\nIt's a pretty average sports bar.  Decent beer & food menu.  Maybe it was the booze still talking but an order of loco moco seemed like the best option at 10 am from the breakfast menu.  Honestly, it wasn't half bad and was better than I expected.\n\nTip - If you've got a group, do make reservations for a table during the football games, as this place will fill up during game time."
        }, 
        {
            "index": 390, 
            "rating": 5, 
            "review": "My boyfriend and I came here for the UFC fight. We paid the $60 per person for a table and then had all you can drink Bud Light. We pretty much had a personal tv right about our table. Service was great, we had Taylor. It was definitely well worth the money. We ordered potato skins which were yummy and then shared chicken strips and a basket of curly fries which was huge!"
        }, 
        {
            "index": 391, 
            "rating": 3, 
            "review": "1) they do not serve tap water.  I had to pay for a bottle of water!  I tend to drink a lot of water and can easily go through 2 or 3 of those bottles of water in a meal so rationing out my one bottle of water to last through the meal was not the easiest task.  Especially since I was already a little dehydrated and tend to rely on restaurant tap water for hydration when I'm in vegas anyway...\n\n2) The food is kinda bland.  You must pay extra for a lot of condiments/extras that typically come with your meal.  However, I do tend to like food a little on the plain side so I really enjoyed my sandwich.  The turkey in it was really fresh, as was the lettuce and tomato in it.  Not having any mustard/mayo/etc. added to it was a little odd to me though.  It felt like something was missing the entire time I was eating.\n\n3) Loved the steak fries here..\n\n4) a little overpriced, but that is to be expected in this type of vegas dining."
        }, 
        {
            "index": 392, 
            "rating": 4, 
            "review": "Went here as part of club crawl, and its here when I got pretty lit. Cool sports bar."
        }, 
        {
            "index": 393, 
            "rating": 2, 
            "review": "Great place to watch a game if you're only requirement is a tv, otherwise, the poor service, weak beer selection, and basic fare make this a place to steer clear from. I wasn't expecting much, just a beer and a place to watch the game, but the service was so deplorable here that I waited almost 10 minutes to even pay my bill at the bar for 1 beer, the bartender was too busy talking to a coworker. I'm nice and efficient as a patron and I appreciate when I get the same service. Unfortunately this place provides none of that. You're better off going somewhere else."
        }, 
        {
            "index": 394, 
            "rating": 4, 
            "review": "Great place to watch games. Great pupus selections. Great service"
        }, 
        {
            "index": 395, 
            "rating": 5, 
            "review": "They're simply amazing especially how Brianna is now manager i love her work as a bartender"
        }, 
        {
            "index": 396, 
            "rating": 3, 
            "review": "This is for Dirty Blondies...Nice place just NO one in there...Very dead"
        }, 
        {
            "index": 397, 
            "rating": 1, 
            "review": "Bad service!!!!! Expensive, low quality food!!!! I came in with my wife for teacher appreciation and told the server about the promo they had and the server said \" everything on the menu.\" Bill came and said it excludes pizzas. You just said \"everything!!!!\" It wasn't only just that.... I watched 4 servers stand around talk about shoes visiting with each other when it was a busy crowded place!!! Are you there to make money or just stand around??? Take your business to hooters, twin peaks, Buffalo Wild Wings, even Denny's! They lack service and quality! Come here if your desperate!"
        }, 
        {
            "index": 398, 
            "rating": 4, 
            "review": "My review is based strictly on their mozzarella sticks.\n\nThey are amazing!\n\nOther than that, all I can say is that they apparently have a really good happy hour and it is located in the shops at Planet Hollywood. For a quick  bite and a drink though, I would definitely recommend it."
        }, 
        {
            "index": 399, 
            "rating": 3, 
            "review": "Stopped here for breakfast after a long night, $3.99 breakfast? Sure! \n\nI had two eggs over medium, hash browns and bacon with a side of wheat toast.  We were the first ones in the restaurant and seated immediately, drinks and order taken.  We were kind of in a hurry because of an early flight and our food was prepared fast and accurate.  \n\nGreat stop - recommend if your in the Miracle Mile shops."
        }, 
        {
            "index": 400, 
            "rating": 3, 
            "review": "It's cool for the location and the vibe is fun. Lots of beer pong and just beer! The customer service is very average nothing to brag about. We didn't eat so not sure about the food."
        }, 
        {
            "index": 401, 
            "rating": 1, 
            "review": "We went here yesterday to get some lunch. We were seated promptly as it wasn't real busy. After about 20 minutes of no one coming over to even get our drink orders, we got up and left. There were 3 employees standing at the hostess podium when we left! WTH?"
        }, 
        {
            "index": 402, 
            "rating": 3, 
            "review": "This place is ok.\n\nWhile touring Planet Hollywood an overwhelming sensation for a nice refreshing lemon drop came upon me so, not really knowing where to satisfy my craving, we just happened to walk by this place and decided to check them out.\n\nThe place (Interior wise) is nothing really special, just your typical sports bar.\n\nOur bartender was extremely nice and went well out of his way to make some decent lemon drops, especially considering the fact that its a sports bar where lemon drops are not usually a specialty of there's.\n\nOverall, the drinks were ok, the bartender was extremely friendly and the place supposedly gets pretty packed when the games are playing which is when they have some special prices on beers and so forth, but in all honesty, it definitely is not  a place I would look forward to stopping in again."
        }, 
        {
            "index": 403, 
            "rating": 5, 
            "review": "After 10pm this place rock's.\n\nThere service is great; there food is delicious and you can't go wrong with 10$ all you can drink beer.\n\nGreat place to meet new friends and kick there ass at some beer pong.\nDiffenetly a place to go on tuesday-thursday nights."
        }, 
        {
            "index": 404, 
            "rating": 3, 
            "review": "I was very impressed with this place. My girlfriend and I went this past Saturday (6/23/12) for lunch. I got the buffalo chicken wrap...which was great. She got the chicken wings...she compared them to BJ's chicken wings. Overall I say this place is good for a quick bite. \nBut let me forwarn you, they charge for water...not bottled water TAP WATER. Well, they charged me anyways."
        }, 
        {
            "index": 405, 
            "rating": 4, 
            "review": "Great sports bar!  The food is your typical bar food, but its really good and the prices aren't bad at all.  Wonderful spot to watch the game, tons of tv screens.  The frozen drinks are huge, strong and reasonably priced.  Blondie's is located in the Miracle Shops at Planet Hollywood....be sure to check it out when you're in Vegas :-)"
        }, 
        {
            "index": 406, 
            "rating": 3, 
            "review": "Pro's: Beer pong tournaments! Good happy hour drink special. Cute outfits for the cute waitresses. Nice people watching seats. \n\nCon: generic hot wings, Pizza tasted like Domino's"
        }, 
        {
            "index": 407, 
            "rating": 1, 
            "review": "This place used to be a fun place to go to back in 2010 for birthdays, or a good place to watch some Sunday Night FB. \n\nUnsure of what happened six years later...\n\nI guess what had a red flag was when the hostess sat us literally next to the tv, and asked to be moved she walked away with no customer service. Second, was when a friend of mine asked where the bathroom was, the hostesses conversation was more important ( & I understand when deep convos are made you want to get your point in but the restaurant was slow enough for them to stop what they were doing). Lastly, they kept messing up on our order. If you're going to hire new bartenders the best thing you can do is cater to the patrons needs instead of making your own creation esp when the drinks you are making are bartender themselves. \n\nOur serve was really chill which is why I gave a star but if she wasn't our server we would've walked out. \n\nIf I knew this was going to be a horrible experience, I would convinced my friends to eat at Cabo for a better dining."
        }, 
        {
            "index": 408, 
            "rating": 2, 
            "review": "So sad the food is not the same as it used to be. I came back here several times for the awesome greek salad now it sucks. And the garlic fries are horrible too. Basically it's just now overpriced bar food."
        }, 
        {
            "index": 409, 
            "rating": 1, 
            "review": "You have to be kidding me, a \"RESORT FEE\" at a restaurant??? Seriously? The food is garbage, the service is maybe a tad better than the food. But, even if the food was awesome, a resort fee is a spit in the face of your customers, it is so insulting that I can't go back. \n\nNever ever will I step foot in here and I have actually been in here when in town on business at least 5 times with co-workers in the last 2 years. I am so insulted by the \"RESORT FEE\" that I will tell anyone that I talk to about it as a \"can you believe this business practice?\""
        }, 
        {
            "index": 410, 
            "rating": 2, 
            "review": "Gave em 2 stars due to the attitude the blonde female bartender gave me. We were a party of six that went to Blondies after the J-Lo concert. We were told to sit where we wanted. We were sitting for 15 min and nobody came to our table. So, I went to the bar to order our drinks and food. I placed our order with the bartender. She said that the waitress will take our order at our table. I asked if I could order the drinks because no one has come to our table. The bartender rolled her eyes and said \"I guess\". I placed our drink order. I asked for 3 margaritas, 2 bud lights & 1 Miller lite. She gave me 3 bud lights. I told her that I asked 1 Miller lite & 2 bud lights. She rolled her eyes at me and  said \"no you didn't\"! I said yes I did,because I don't drink bud light. I drink Miller lite. With her attitude she refused to change 1 of the bud lights for a Miller Lite. I asked to speak the manager. I explained to him what had happened. He said \"no problem\"' and gave me a Miller lite. We also ordered food from the waitress. The wings and burgers were pretty good. We all have bad days. It wasn't necessary to give a customer attitude over a beer."
        }, 
        {
            "index": 411, 
            "rating": 5, 
            "review": "I got a livingsocial for Blondie.  I was skeptical about it at first because of the not so great review, but hey 20 bucks for 40, not bad.  Anyway,  i had a pretty good experience with both the food and customer service.  Our waiter was great, but the host wasn't so much.  The host did not smile or greet, seem like she didn't want to be there, not so cheerleader like.   Our waiter was great.  I got the ribeye with sweet potato fries.  I was glad they put the powder sugar on the fries, it made taste much much better.  The steak was really good, nicely cooked and juicy.  Overall it was a good experience for me."
        }, 
        {
            "index": 412, 
            "rating": 5, 
            "review": "We had a very goog experience , first I value customers service  it is very important , thank-you Alex!\nWe sat at the bar and get happy hour special $20 all you can drink from 10pm to 1am.\nbeer & well drinks , you can go walk around and came back for another drink during the happy hour.\nif you check in with yelp get a appetizers free.\nOur bar tender Alex made us feel welcome very attentive \ngood job girl."
        }, 
        {
            "index": 413, 
            "rating": 2, 
            "review": "I hate to say it, but this time really sucked. Our waitress was very friendly, but she was so stretched that we barely seen her and had to wait 5 mins to ask for mayo and wait ten minutes after we were done eating to ask for a box. Managements fault...not hers. Probably maxing out tables per server to increase bottom line and food cost bonus.\n\nAtmosphere was 4 stars. A lot of action and a fun place. Patrons were upbeat. \n\nMixed reviews on the food. Built my own burger and the burger patty was flavorless and bland. Curly fries were great. Cobb Salad was large and fresh, and I thought was quite tasty...but girlfriend didn't care for it.\n\nEven with a groupon, there are better options than eating here."
        }, 
        {
            "index": 414, 
            "rating": 4, 
            "review": "The eggs Benedict sliders keeps me coming back! well that and the beautiful ladies... but seriously these sliders are a must try! the patio area you have a nice view of the surrounding area. I have tried a few different things on the menu and most of it is mediocre but i would defiantly give this place a try if you are considering it. every time i have been here they have been super friendly to my 2 year old so thats a huge plus. the servers are very polite and well trained and big shout out to the kitchen for plate presentation."
        }, 
        {
            "index": 415, 
            "rating": 1, 
            "review": "Wow, worst customer service ever. We went there a while back. We chose to eat there cuz my bro in law had bets on the basketball games, so we figured we would go watch the games and drink some beers. -First problem is he asked for a glass of water to go along with his pint, the waitress said they only sell water for $1. Can you say, Illegal? -Second, all of the tv's were on sports center while the games were on. We asked our server to change a tv that only our table could see to the game. She responded with \"all of the tv's  have been requested to be on a certain channel by other guests.\" The place was practically empty. -Third, we ordered a $7 chips n salsa started and received half a basket of chips and prepackaged salsa. I asked for a refill of chips and she said she would ask about refills, and never came back. \n-Four. They had a special for a gallon (ish) personal table beer dispenser. I asked for that with the \"blondies\"  brand beer and was told they only fill it with buttwiper products, even though it says nowhere on the menu that it was restricted to that brand.\n-Five. the food sucked. I didn't expect much from a sports pub inside the miracle mile.. but this was really bad.\n-Six and final. I asked to speak to a manager and I addressed all my concerns list with him. As for the water, he told me it cost money to wash the glass so they can't give free water. I just spent well over $100. I think that can cover the rinsing of a glass. \nAs per the TV situation. He told me that it is first come first serve, but he would be happy to put a game on for me. (we're done eating now and don't care)\nAs per the chips. He said he will get us more chips. Again, we're done eating and don't care.)\nAs for the beer special, He told me that the menu should say its restricted, but won't do anything about it. I told him it was false advertisement and he compared his restaurant to a STRIP CLUB in saying that just because they say you're buying a lap dance doesn't mean you're not going to get a BJ+. \nHe blamed all of our problems on the waitress and told us not to tip her if we weren't happy with her service. I responded with fact that it was his fault because he is in charge and even if I didn't tip her, the company would still tax her for it. \nOverall, I will never go back to this dump."
        }, 
        {
            "index": 416, 
            "rating": 4, 
            "review": "Blondie's target patron is the sports fanatic that is willing to belly up to the bar for an extended time to watch their multiple screens, drink, play beer pong on non sporting event days, and have a good time. Thank you Blondie's, I'll gladly accept the invitation. They are a sports bar and they make no bones about it. I would not recommend this place if you're expecting a quiet, peaceful meal with gourmet food. Blondie's hits the sweet spot for NFL Sundays and March Madness.\n\nWe clocked in just before noon on the first Thursday of March Madness and clocked out around 9 PM. Definitely reserve a table online for busy days like this. We didn't reserve a table and started out at the standing room by the back bar. By around 3 or 4 we had four seats across on the back bar with Daniel taking care of us. The minimum spending amount per customer that day was $45, which we had no problem meeting.\n\nWe had an unobstructed view of about ten screens all day with just a wave of the hand to Daniel for another round of drinks any time. The specials that day were a bucket of 5 beers for $25 and $6 shooters of Jameson, fireballs, or Patron. We had 7 buckets of beer, multiple rounds of shots, and plenty of action on the games. We did order a large pizza, a chicken quesadilla, and curly fries at some point, but honestly, I don't recall how any of it tasted at all.\n\nThe only snags we ran into all day was the restroom situation and the distance of the sports book. The restroom had one stall and one urinal only. With hundreds in the bar drinking, it often created a line out the door. Also, the sports book is about a ten minute walk to the front of Planet Hollywood. With long lines in the book, this leads to about a half hour trip to the sports book if needed. So place your bets early or have a mobile sports app.\n\nYes, we were gouged on beer prices (we basically paid $175 for a case and a half of bud light), but I had a great time with my buddies and our neighbors and we were paying for the entertainment value. We had better views of the games compared to a sports book. And we had plenty of action all day and won a little scratch. It was a memorable experience and I would do it again in a second."
        }, 
        {
            "index": 417, 
            "rating": 4, 
            "review": "This place is pretty good. The mozarella sticks were awesome. The wings were ok. I ordered the turkey wrap. It was more like a burrito!! It was good. I didnt really need to order a side of fries but i thought the wrap would be smaller. It was a good experience except for the tv kept getting jacked. They do not check to see if anyone is watching a game before changing the channel. It happened to us 3 times."
        }, 
        {
            "index": 418, 
            "rating": 4, 
            "review": "I'm not sure why all the bad reviews.  I had a pleasant experience.  I would agree they are a little pricey, but what isn't on the strip?  We had chili cheese fries, minus the cheese whiz it comes with and asked for grated cheese.  They were awesome!  And we also got the appetizer sampler with onion rings, 2 chicken strips, 4 jalapeño poppers and 6 hot wings.  More than enough for 2 people.  And our waitress Ingrid was cute and bubbly and checked in on us multiple times.  I'll be here again next time.  Especially for the chili cheese fries and jalapeño poppers :-)"
        }, 
        {
            "index": 419, 
            "rating": 2, 
            "review": "The only reason why I came over here was to watch the Patriots game against the NY Giants. As District One wasn't showing the game, me and my party opted to go to this place just to grab a drink or two and watch the game. The place was packed with tourists having a good time watching their own team win or lose. While this restaurant is perfectly located at the heart of the Miracle Mile Shops, I'm definitely not a fan of this bar. Err... Restaurant? Whatever it is. \n\nThe server I got was friendly as she consistently checked on me and my party whether we needed anything else such as water, condiments, and food. Besides the service, I'm a fan that I was able to watch the game here as it was really hard to find a bar that actually played it since they needed a sports package. I have to hand it to them, this is definitely a sports joint. \n\nAs for the bar... Don't get me wrong. I don't want to blame my bad drink to the bartender as it's probably his job to fill as little alcohol as possible in my drink and over charge me for a small glass, but hey, it's the Strip so I can't really have high expectations for this place. Usually, when I order a margarita, I would immediately get some kinda of a buzz since I'm very light weight. This had literally no effect on me. I feel really bad for anyone who gets a drink in this place thinking that they're going to get a buzz. \n\nI also order sweet potato fries to much on something while I watched the game, and man... I don't even want to start telling you how disappointing it is. I know for a fact that they were frozen. But as in cheap frozen sweet potato fries. I've had a frozen fries from my local market than the garbage that I was served. This seriously explains as to why I captioned \"meh\" on my photo of the sweet potato fries. \n\nAll the while... I got four drinks and an appetizer for about $55. I guess you can say it's not so bad... But the drinks were bad, and the food was bad. I'm on a quest to find a good bar here in Vegas, and this is definitely not one of them."
        }, 
        {
            "index": 420, 
            "rating": 1, 
            "review": "Really awful experience from the start to the end of my meal. It was as if the bar was purposely trying to turn away service. The food is overpriced and they charge for a side of fries. They have no refills with $4 sodas and you have to pay for water!! (it's actually illegal to charge for water) The tragedy is this place has a lot of potential. Being in a prime location and with good service it could be a  great place. It's clear that ownership and management has no idea what they're doing. In a tough economy you should be doing everything to better serve your customers."
        }, 
        {
            "index": 421, 
            "rating": 5, 
            "review": "My first night in Vegas ever!!!  Got drunk at Blondies!  It was a fabulous experience.  Didn't eat anything, just drank a lot and can't count the amounts of chilled stoli shots we did.  Woke up with my to-go cup on my night stand in my room at Bally's.  The bartender knew our local bartender from Sleepy Hollow NY, hooked us up, and made us feel right at home!"
        }, 
        {
            "index": 422, 
            "rating": 4, 
            "review": "Fun sports bar. We sat at a table on their 'patio', which was still inside of the Planet Hollywood hotel. Great area to sit and people watch while eating."
        }, 
        {
            "index": 423, 
            "rating": 5, 
            "review": "We went in the morning Sunday 8/10 and it was really great! My husband and I shared a delicious burrito and loved the great enviornment and vibe. Our server Ingrid was the sweetest and was very attentive. Thank you Blondies for providing such a great place to chill and great people. :D"
        }, 
        {
            "index": 424, 
            "rating": 5, 
            "review": "This was our second visit and I love this place. Yes, I am a sports bar junkie but this bar/restaurant is way above the average sports hangout. The food and drinks are a bit pricey but that's no surprise. It's the best place in Begas by far to recoup after a long night of drinking when you're in the mood for \"food\" you would never normally want!\n\nThe staff are super friendly-even with my left of center sense of humor. This is a must for us every time we're in town."
        }, 
        {
            "index": 425, 
            "rating": 2, 
            "review": "Food wasn't that bad, I got the philly cheese steak burger with curly fries. Little messy but it was ok, service was ok, it wasn't too packed. Pretty pricey for what I got."
        }, 
        {
            "index": 426, 
            "rating": 3, 
            "review": "We went here for the 15 dollar all you can drink but it was miller lite.  We drank our normal bud light and jager bomb.  Had a steak and salad, not the best but with the pre dinner shots it was just fine.  Our server was cute and blond.  We sat outside or 'outside the bar, but in the mall'. The people watching was great. I would go back to this place as a starter bar.  Booze in the middle of a mall ....perfect."
        }, 
        {
            "index": 427, 
            "rating": 1, 
            "review": "0 stars would be Blondies.  This place is horrible.  The waitress was a bitch and even when we complained to the manager about her, the manager simply brought us over free shots to try to appease us. (For those of you who don't already know-- \"free shots\" in Vegas means they don't even have alcohol in them.) We finally walked out after our appetizer when we found out they won't even serve you iced water.  They try to make you pay for bottled water telling you it's for a \"non profit or a charity.\"  I'm pretty sure it should be illegal for bars not to serve water when they are located in the middle of the Mohave desert."
        }, 
        {
            "index": 428, 
            "rating": 1, 
            "review": "Do you enjoy being served excuses instead of food and drink? How about iced tea that looks like it was made with powdered milk? Are you a fan of waiting 45 minutes for a round of drinks in barely crowded sports bars? \n\nIf you answered yes to any of the above, you should go to Blondies and get the hell away from me. \n\nOur party of seven had an hour plus to kill before flying the F out of Sin City and (poorly) decided on Blondies for some much needed snacks and okay, fine, a drink/pitcher. Stop judging. \n\nWe sat down and after 15 minutes or so, not one server had come by. How do you miss a group of 7 when your restaurant is the exact opposite of busy? Were we wearing One Rings? I walked up to the group (yes, GROUP) of servers and one of them explained, \"Sorry, we're slammed.\" Girl, do you need a dictionary? Slammed is not the word you need - there are maybe 25 people in this piece. \n\nI'm going to cut this short because I'm getting all insanity wolf thinking about this place, but avoid Blondies at all costs unless you feel like you need to punish yourself for your poor life decisions during your trip. It's the kind of place where you wouldn't be that surprised if you bit into a deep fried rat. And if you look at all the other reviews that are over one star, assume it's because these people were blackout drunk because there is no way in actual hell this place is \"CRACKIN'\" or \"pretty fun.\" It is \"fucking terrible\" and \"should not exist.\""
        }, 
        {
            "index": 429, 
            "rating": 2, 
            "review": "I came ,I ate at 1/2 price,still felt a little reamed ..Their  grill has uneven heat 1/2 of my rib-eye was overcooked 1/2 too rare.$10 bucks for a watered down Manhattan? I shall not return ,even at 1/2 price :( That The \"help\" was very cute and seemed genuinely concerned .Does not make up for the total fail out of the kitchen."
        }, 
        {
            "index": 430, 
            "rating": 2, 
            "review": "Located inside the mall area of Planet Hollywood. \n\nDecided to give this place a try since it was right across the theater we were watching our show. \nTons of TV so you can watch all the sports you want.\n\nPint of blue moon-$10.00, that is a bit much\nGarlic steak fries- good amount of garlic and Parmesan \n12 wings, med.- nice crunch to it, ranch was a bit watered down \nGarlic balls-it was good, not bad. \n\nI would give any place a try at least once but I won't come here again."
        }, 
        {
            "index": 431, 
            "rating": 1, 
            "review": "Quite possibly the worst service I've ever experienced.\n\nDon't get me wrong, I know this place is tailored toward guys looking for chicks with hot bodies, a cold beer and some sports, but this place is in the middle of the touristy Miracle Mile mall, and should SOMEWHAT cater to everyone. However, it certainly does not.\n\nI went here the first time about two years ago, and the service was ok. Some scummy guys sent over some shots, and the server did a pretty good job at making a joke out of the situation, and was pretty prompt with us.\n\nHowever, the second time we went, our group was sitting at the table for about 25 minutes before a server even approached us. In fact, we had to go get someone to get us a server. When she finally showed up, it was quite awkward, as she didn't apologize, and then, of course, charged us for water. Unbelievable.\n\nThe food was not good. We had to track her down, again, to get our check. Never have I not left a tip. But this time, I was fed up. It should not take 25 min to get a table, and another 25 min after you're done eating to get your bill.  If I'm paying \"Vegas prices,\" I want better service than this.\n\nPretty much the only thing this place is good for, is getting a free shot after the American Storm Male Revue show.\n\nDefinitely not worth it."
        }, 
        {
            "index": 432, 
            "rating": 5, 
            "review": "Got there at 1:30am to keep the party going. Brandon was bartending that night and was very attentive and fun. Great service! Thanks for the fun night, Blondie's!"
        }, 
        {
            "index": 433, 
            "rating": 5, 
            "review": "Great place to hang out at the bar. Fun bar staff! Too bad they have a longhorns flag hanging up. ;-)"
        }
    ]
}