{
    "category": "Las-Vegas", 
    "entity": "TC's-Rib-Crib", 
    "avg_rating_stars": 3.522277227722772, 
    "review_count": 404, 
    "reviews": [
        {
            "index": 1, 
            "rating": 1, 
            "review": "So I went to TC's on the reviews of my fellow Yelpers and because it's about 2 blocks from where I live. I walk in and it was your atypical mom-n-pop rib shop which I get very excited about. We got the menus and they have a lot of items but they're pricey. I'm thinking they better be good for this price. When the baby back  ribs came they basically tasted the same as Chilis (which I like but expected something different). They had a lot of fat on them and seemed to be a big part of the ribs. The fried okra was the best part of the meal, very big and well made.  Another thing that bugged me were the drinks. I ordered water and it came in this little rinky dinky small cup, maybe 8 oz. My friend orders a soda and they bring her a big 16 oz cup that just towers over mine. So at this point I was feeling it to be an average 3-star place. Decent but nothing unique but before we were to leave my friend reminded of the big reason I wanted to come...bread pudding! Quickly I ordered it up. I was excited, I love bread pudding and take respect at how hard it can be to make it let alone to make it right. Not many places have this delicacy so I jump at the chance to get some when the opportunity arises. Then it comes...the disappointment that made this a 1-star restaurant. First off let me say this bread pudding is not cheap. $6. I'm willing to pay that though for some good bread pudding. This was not it. As the waitress is handing me my dessert I'm asking how they make it. With raisins? Bourbon? What's their unique, creative touch on it? 'Krispy Kreme', she says. Say wha??? 'Its really just a 'Krispy Kreme donut that we heat up', she continues. I don't know if I've ever felt so betrayed from a restaurant. I just paid 6 freakin dollars for a donut???  \nAll in this place, less the okra, was am utter disappointment.  And if you decide on dessert, ask how it's made. Shame on you TC's."
        }, 
        {
            "index": 2, 
            "rating": 4, 
            "review": "Food was great however the service was horrible. Took a good 10-15 mins for somebody to come take our drink order. Once we did get our food nobody bothered to come see if we needed a refill. Next time I'll just order for take out."
        }, 
        {
            "index": 3, 
            "rating": 4, 
            "review": "Pretty good barbeque for take out. I would only use it with a coupon offer though. Which they have a lot of! The greens are excellent."
        }, 
        {
            "index": 4, 
            "rating": 4, 
            "review": "Daaaaaaaaaaang. Those ribs though. \n\nGot the three meat combo with two sides for a whopping $10 to share. Waaaaaaaaah???? Thanks to the yelp $10 for $20 deal I gots my belly full for a good Denny's price dealio with some real legit food. \n\nPulled pork was soft and juicy. Brisket was good...not the best. Beef ribs were soooooooo yummy, fatty, and falling off the bone. It was sheer beauty. \n\nMac and cheese side was meh for me. The baked beans were good, but I ain't no baked beans connoisseur. \n\nOne sucky thing is you can only use one yelp coupon per table. I don't get it...so if we were sitting separately we could have used two coupons we had specifically bought prior to entering. \n\nWhatever, it's a common rule so I shouldn't complain but my eyes were bigger than my stomach in the beginning so I was dead set on using two coupons to get $40 worth of food. This gigantic plate was enough to feed two. Oh and it came with corn bread, soooooooon! I've had better, so didn't finish mine. \n\nI'll be back for a full plate of beef ribs only with some fried sides next time!!!"
        }, 
        {
            "index": 5, 
            "rating": 5, 
            "review": "I grabbed the Yelp deal as many others did! My brothers and I ordered the Chicken and Waffles with Muddy Water! Totally delicious! Service was awesome and the wait for food wasn't extremely long, either. A very pretty lady(assuming is the owner or some sort) came to our table and asked if we enjoyed our meal and gave us a free banana pudding! So nice! It's less than 5 mins away from my house so I will most definitely be back again! Especially to try their weekly specials!"
        }, 
        {
            "index": 6, 
            "rating": 2, 
            "review": "I hate to give 2 star reviews, but there were too many things wrong with the food.  I'll start with the good.  The mac and cheese was excellent!  The Greens were also good.  The rib tips were hit and miss.  Most of them were pretty fatty and dry, some were good, but those were the minority.  The brisket was hit and miss too, but mostly miss.  The first few pieces were good, the middle was a mixed bag of okay and dry, the bottom had a chunk of brisket that was hard and in a huge clump, not appetizing and disgusting.  Even the good parts, wasn't that good.\n\nThe service was fine and the inside wasn't bad for a casual place.\n\nThe cornbread was dry, like dry dry.  The honey they had was not pure honey, it was a honey mix of corn syrup and honey.\n\nI wanted to like this place and to give it a shot and half way through the meal I was at 3 stars, but it got down to 2 stars by the end of the meal.\n\nI won't be going back.  You can give them a try and judge for yourself like I did, but there are much better bbq options in Las Vegas."
        }, 
        {
            "index": 7, 
            "rating": 3, 
            "review": "Typical Barbecue place, nothing special... sides are not appealing in my opinion. Long wait."
        }, 
        {
            "index": 8, 
            "rating": 1, 
            "review": "Made the mistake of purchasing too many yelp deals.\n\nWhen some place claims to be a BBQ restaurant, smokiness and BBQ is the first thing you should smell. That was the first red flag. Secondly, we ordered barbecue wings and were served regular wings with barbecue sauce on it. Third most terrible thing was the catfish. The fish fillets were identical in shape and size, I could immediately tell it was from the freezer! The blan fish lacked simple seasons like salt and pepper, to say the least.\n\nThis is not soul nor quality food.\n\nThere's a reason for the Yelp deal here."
        }, 
        {
            "index": 9, 
            "rating": 5, 
            "review": "This is my new fav place for BBQ!! \n\nI was in the mood for bbq ribs and we were about to head out to the new place in Downtown Summerlin, however the reviews were not too great and overpriced. Then we found this place and decided to give it a shot. Best decision ever!! I'm picky with my BBQ and this place hit the spot! The staff was friendly and very welcoming- food was awesome and you could tell everything is made from scratch! Will definitely be back!! Highly recommended!"
        }, 
        {
            "index": 10, 
            "rating": 3, 
            "review": "I was feeling the mood too try something new in my area of town. I know this place has won best of las vegas review journal awards although that was few years back. Since then the competition comes too barbeque has stepped up with new places on top of the established ones. So some ways going in it was going too be tough too stand out. I always always give any place benefit of open mind and like try new places get my own take on it. Really TC's Rib Crib never had any WOW factor too the food I tasted. It was average barbeque at best with average sides. Really even though this location is on my side of town would much rather drive farther too get more authentic barbeque on.\n\nI ended up ordering the pulled pork (I always fail too get it sandwich style or forget) with choice of two sides and comes with cornbread. I settled on fried okra and mac/cheese for my sides. The amount of pulled pork they give you actually decent size for the price you pay. I wished it covered in more sauce. They ask you when food comes out if want more barbeque sauce. I did. The tables can dine inside none of them automatically have barbeque sauce as set condiments. I found odd considering it is barbeque joint? I not much fan of the barbeque sauce felt like it lacked depth, rather bland, and nice if had few options too choose from. The sides I did enjoy the fried okra!!!! Really just diced okra battered and fried. It nice golden brown, crispy on the outside, and nice hot and moist on the inside. The mac and cheese wished could have been more creamy and cheesy. It was ok. The cornbread was pretty good. Maybe I needed too the order the ribs but suppose save that for another visit...Maybe.\n\nThe service was good. They asked if wanted too dine in or take out. The gentlemen asked if wanted more barbeque sauce. Attentive. They have really cheap lunch special and great groupon deal going right now. It small place so can fill up fast if it gets busy. I went during weekday for dinner so only one in the restaurant."
        }, 
        {
            "index": 11, 
            "rating": 4, 
            "review": "Before the move to this location, my last visit was rather disappointing, so when my husband wanted to go here for dinner tonight, I was a little hesitant.  \n\nThe place was near empty, it's a lot bigger dinner room and the service was good.  I go a two meat combo, sausage and brisket with two sides.  I loved the sausage, but the brisket I didn't care for.  I think it's more like roast beef, cut into thin strips, there is no smoke line, and it reminds me a lot of my mothers Sunday roast beef.  \n\nMy husband got a slab of ribs and they were very good, so if I come back, I will skip the brisket."
        }, 
        {
            "index": 12, 
            "rating": 3, 
            "review": "Nice homey place in a strip mall near the Lakes. I had the 2 meat special (ribs and pulled pork) with greens and the mac n cheese. The food was good and filling. The mac n cheese was a little oily (I guess the cheese was separating). A decent place worth trying again."
        }, 
        {
            "index": 13, 
            "rating": 4, 
            "review": "I tried out TC's because Buzz BBQ near my house closed.  It was worth the drive.  The chicken was near perfect and the mac and cheese is as great as others say.  Cole slaw was not my favorite but if you really cole slaw you will probably like theirs.  I will definitely try it again."
        }, 
        {
            "index": 14, 
            "rating": 4, 
            "review": "The food was good. It was a little pricey though. The employees were very friendly and the the place was nice and clean. It was a little cold inside though."
        }, 
        {
            "index": 15, 
            "rating": 1, 
            "review": "Very disappointed, place didn't smell right when we came in, maybe dirty mop water, also the paper and plastic ware was a set back, ordered the chicken and waffles,  chicken very good, waffles was so so, brought a friend with me and had to apologies to her for bringing her. Won't be back."
        }, 
        {
            "index": 16, 
            "rating": 4, 
            "review": "Decent prices , very friendly staff , but most importantly great food. The yelp deal also a steal."
        }, 
        {
            "index": 17, 
            "rating": 4, 
            "review": "I love it here! Right down the street from my house and it's culture rich. I can dig it. The sweet tea was amazing. I had rib tips and chicken which were both good. I admit the tips were a little dry. But overall still good the ribs however I was definitely impressed with we got half and half rack of ribs and it was super good. Definitely on my bucket list to come back :-)"
        }, 
        {
            "index": 18, 
            "rating": 4, 
            "review": "I reserved a table for 20 people for a birthday dinner and TC's Rib Crib set it up on time and were great meeting the demands of our larger group. It's a lovely mom n pop business. The food was delicious including the BBQ chicken! I would recommend the family platter for a group of 4!! You get 4 meats, 3 sides, fries and cornbread. Plenty!!!\n\nCONS:\n-I would only return using the $10 for $20 YELP deal\n-they were out of rib tips AND brisket!\n-plastic utensils. I would have expected at least real serrated knives for cutting the meat"
        }, 
        {
            "index": 19, 
            "rating": 2, 
            "review": "Eh....i wasn't impressed. I got the beef ribs they just didn't stand up to a lot of other bbq places in town. They gave us plastic utensils, not something i would expect when digging into meat. We all bought a Groupon, but didn't realize it was only good for 1 table/party, it was $7.50 for $12."
        }, 
        {
            "index": 20, 
            "rating": 5, 
            "review": "This has been the best bbq I've come across in Vegas! Everything I've ordered from the pulled pork to the ribs and tips have been amazing. All the sides are exactly as you'd remember your favorite Mac n cheese dish or your greens. Yams are perfectly sweet not too much liquid- no mallows. Sweet tea is always spot on sweetness."
        }, 
        {
            "index": 21, 
            "rating": 4, 
            "review": "And to think someone asked me to reconsider my trip to TC's and head over to Famous Dave's.  What a sucker.\n\nTC's southern BBQ delivered especially at such an affordable price.  The offered  $10 for $20 deal was worth up, but keep in mind.. Their prices are super reasonable, so dessert would be in order to make this deal worth the while.\n\nMy beau and I ordered the Ribs, chicken wings, sweet potato fries and red beans and rice with cornbread on the side.  The Ribs fell off the bone as they should.  Delicious!  Ribs are typically the deciding factor for me when it comes to a BBQ joint winning.  They delivered!  Chicken wings were spicy and overcooked (per my request) perfectly.  Red Beans and Rice and Sweet Potato Fries weren't as tasty as anticipated, but I'm a picky southerner, so TC's probably didn't stand a chance before I even walked through the door in that arena.  The rice was a little under-cooked and tasted as if it came from a box.  The sweet potato fries were missing the whole sweet factor.  Just not great, albeit I gladly wolfed them down!\n\nThis place is very casual, small and made me feel like I was in DC/NOLA all over again.  I was there to get my greasy needs met, and they accomplished that and then some.  Also, the servings are decent, so I had some wings to go for a late night feast.  The service was nice as well.  However, I noticed they only had one server doing all the seating and serving, and even though it was quick for my visit, I would recommend a little patience.. she only has two hands, people.\n\nOh, and they had kool-aid!  Kool-aid!  I used to involuntarily drink that sugary mess in college due to lack of funds, so it was fun to drink some a few years later!  Maybe a wee bit too sugary to my liking.  I bet the kiddies would beg to differ."
        }, 
        {
            "index": 22, 
            "rating": 1, 
            "review": "Don't waste your money! $18.00 for pulled pork, mac n cheese, green beans, soda, and a 1.00 tip. Totally not worth it. first off the pulled pork was was like a gravy, the mac n cheese was okay but not great, and the green beans we're frozen. I will NOT go back."
        }, 
        {
            "index": 23, 
            "rating": 4, 
            "review": "After coming here twice I have found my new favorite rib crib. The place is small but the portions are huge. I got the 3 meat combo with all ribs (beef, baby back & spare) with coleslaw and potato salad as my sides. The beef ribs had good flavor but not a lot of meat. The baby back were fall of the bone delicious. The spare ribs were excellent as well. The coleslaw was buttermilk based and no vinegar it was the perfect compliment to the ribs. When I tried the potato salad I got a chunk of egg and potato it was perfect. I will definitely be back."
        }, 
        {
            "index": 24, 
            "rating": 5, 
            "review": "5/5 for BBQ. This Texas style bbq the way I remember it. \n\nBrisket comes shaved, not chopped, with a healthy dose of sweet and lightly spicy bbq sauce. I also loved the rib tips, as well as the pulled chicken, and everything we had was excellent. I'll  be back for sure."
        }, 
        {
            "index": 25, 
            "rating": 3, 
            "review": "So happy that I found this place!!! Got home late and definitely didn't feel like cooking and I just couldn't force myself to get up and go anywhere. Ordered delivery 20 min before they closed!!! Ordered the half chicken and the three meat combo (brisket, pulled pork rib tips) with Mac and cheese and green beans. Fed 2 people with left overs. Rib tips were fatty. I thought they were gross. Wasn't a fan of the pork or brisket. The chicken and sides were AMAZING!!  4 stars because I wasn't forced to order Chinese or Thai (which is one step up from cracking a can of soup and eating it cold) but if it wasn't for the delivery factor I would have given 2. Oh and I selected the \"make it all white meat\" option and was charged $2 extra on the chicken... But they delivered dark and white. I also tried to order the chicken without the all white meat option and I wasn't able to. Over all it's an amazing alternative to Chinese or Thai."
        }, 
        {
            "index": 26, 
            "rating": 5, 
            "review": "Always wanted to try this spot. Finally decided to after my daughters soccer game. Staff was fast and friendly. Got a two meat combo of baby back and brisket with corn bread and collard greens. The meat was delicious and tender. Pleasantly surprised. Great job guys. Oh wait. The collard greens were inedible. Tasted like someone dropped a bag of salt in my cup. It was overlooked since the ribs were so tasty."
        }, 
        {
            "index": 27, 
            "rating": 5, 
            "review": "After a disappointing pulled pork sandwich at another barbecue place -  Sassy Sal's in the Northwest- I was still craving the real thing so my girlfriend recommended we go to TC's which has been a favorite of hers for a while. \n\nWe had a certificate from Restaurant.com which obliged us to eat there and while we were originally hoping for take-out, I'm glad we stayed.  First impression - I really liked the decor which had great, vibrant color along with tasteful framed photographs on the wall which made you feel right at home.  This is exactly what I want from a barbecue joint -clean, tasteful, casual, and homey.\n\nService was prompt, friendly and attentive throughout.  The food was the real deal - plenty of  great tasting pulled pork with just a bit of sauce on the bun and great coleslaw to go on top.  My girlfriend got a two meat combo with beef ribs, hot links, and two sides which she said was also good.  The peach cobbler was great - and I don't even like peaches!  I can't wait to try the glazed donut bread pudding.\n\nI'm kicking myself that I've lived down the street from TC's for two years and this was only my first time there.  They've got a ton of lunch specials for only $4.99 and daily specials. 'll definitely be back soon."
        }, 
        {
            "index": 28, 
            "rating": 4, 
            "review": "I really enjoy eating here! The food is great the restaurant is home-y and the staff is pretty nice. Love the mac and cheese and the banana pudding!"
        }, 
        {
            "index": 29, 
            "rating": 2, 
            "review": "We had gotten a groupon for this place so we decided to go check it out and see if we could maaaybe find   some good bbq.   We think of bbq as smoked meats... there weren't any smoke rings we could find on any of this meat...We each ordered the three meat combo, it came with two sides., and cornbread.   I chose the chicken breast, beef brisket and rib tips with cole slaw and onion rings.  My chicken tasted like it had been baked, slathered with sauce then left in the fridge for the last couple of days.  It was definately reheated and not fresh. The rib tips were char burned, not smoked.  My brisket was actually pretty tasty, but still not smoked.  There was nothing special about the coleslaw or the onion rings....My husband got the  rib tips, pulled chicken and pulled pork with potato salad and sweet potato fries.  The rib tips were all char burned, his  pulled chicken was dry and bland.   His pulled pork was pretty much the same.  Their potato salad was awfull, it had no good flavors, but lots of mushy potatoes and not enough sauce.  His sweet potato fries had good flavor but were way undercooked and soggy.  Their cornbread was too dry so we didn't eat it.  All in all this was very disappointing.  We had two waitresses, one was very good at her job, but the other gal litterally dropped stuff onto our table.  I dont think we'll be back."
        }, 
        {
            "index": 30, 
            "rating": 4, 
            "review": "The better bbq in Vegas. Now I've been to Famous Dave's (which sucks) and Buzz BBQ (it's ok) and TC's is one of the better joints. I ordered the family meal deal which you get your choice of 4 different meats, 3 sides, 1 fried side, and corn bread or white bread. My choices were:\n1.) Brisket - covered in bbq sauce that wasn't too tart or too sweet\n2.) Rib tips - tender and covered with the same sauce\n3.) Pork links - sliced in half with nice char marks. A bit salty though.\n4.) Baby back ribs - so tender you don't need a knife.\n5.) Baked beans - I am not normally a fan of beans but I enjoy this. It's a great compliment to the greens\n6. Greens - very salty but good when combined with the beans\n7.) Mac n cheese - could be cheesier but i like how the flavors are a bit mellow since you have the strong flavors from the bbq\n8.) Fried okra - love these little bits of goodness\nFinally, 9.) Corn bread - it should really be called mini corn muffins. My only complaint with these is that it's way too small. I love me some corn muffins.\n\nThe staff is very friendly and very professional. The food is pretty on point with good flavors and tenderness. Overall, this is my go to place for bbq in Vegas. Now all I got to do is go there for their fish fry"
        }, 
        {
            "index": 31, 
            "rating": 5, 
            "review": "We used a yelp deal $10 for $20. Its really a steal of a deal. The people who work here are all quite friendly. The Food is great. I mean, it really is delicious. Im a person that has high expectations and TC's meets it. This was our second visit and we enjoyed it. Its kept clean and there is ample space. I had the pulled chicken sandwich. First time having that and i enjoyed in thoroughly. Sweet tea, oh YUMMY!"
        }, 
        {
            "index": 32, 
            "rating": 3, 
            "review": "Food is just alright spare ribs with the best thing the baby back ribs taste like that was burnt the rib tips was horrible mac and cheese bad green beans good cornbread didn't even taste like cornbread I bought a voucher from Yelp and I couldn't use it I don't think I'll be getting food from them again"
        }, 
        {
            "index": 33, 
            "rating": 4, 
            "review": "Whenever I don't have time to smoke ribs, TC's is right down the street to get my fix.\n\nSo far, I've been getting full racks of beef and spare ribs. Both racks are delicious, but there is something special about beef ribs. I had cow rib meat all in the nooks and crannies of my teeth. I love that feeling! It's so soothing! You know you've been eating ribs when you smile and you got all this shit stuck in your grill. EYE LIKA!!!\nBoth full racks were big orders, but It seemed like you got a lot more with the full rack of pork spare ribs. The price isn't bad at all for a full rack. Solid ready-to-go bbq, although I wish they would drenched their ribs in bbq sauce. Make sure to ask for extra sauce. \n\nThe Ribs will get you there if you're too lazy to make them yourself...\n\nThere still is a lot on the menu that needs to be sampled. Will update..."
        }, 
        {
            "index": 34, 
            "rating": 1, 
            "review": "I ordered 2 full slabs of spareribs dinners and a rib tip dinner. I asked for extra bbq sauce and all of the dinners came with barely any sauce. I only got 7 ribs on each of the FULL slab dinners for 23.99 each! That is a rip off and I know a full slab has more than 7 ribs! I'll stick with Lucille's from now on. At least I get what I pay for!"
        }, 
        {
            "index": 35, 
            "rating": 4, 
            "review": "I've been going to TCs since they opened and I tasted their pulled pork for the first time like 6 years ago or whenever it was. They have some good bbq and sides and pretty decent prices.  \n\nThe pulled pork is the main event here for me, although I confess during the whole span I've never tried the ribs. I was just never a huge fan of ribs in general. The brisket is well cooked and the links are nice and spicy. They have rib tips which I've had and they are very good and at 8.99 for a plate of them with 2 sides and cornbread, it's honestly almost too much to finish. They also have chicken and waffles, and their waffles are seriously good eats.  The sides are plentiful and they have different ones each day. I always get the fried cabbage when it's on the menu because its delicious, and the macNcheese is not bad either. The deserts are all homemade and the ones that I've tried are good. They had this oreo pie that is to die for, but the last few times I've visited it's not been there =(  Also theres kool aid on the drink menu, its like 1.50 or so for a giant cup with refills. Purple please. Oh yes.  \n\nI've never had a problem with the service, though my visits are like 70% takeout, 30% dine in probably. The girls that work there are nice and the chef has come out to greet once or twice. It's very friendly and  inviting atmosphere in the dining room, so I would recommend at least one visit to see if you enjoy it as much as I do."
        }, 
        {
            "index": 36, 
            "rating": 4, 
            "review": "Southern-style side dishes are my ultimate comfort foods. TC's offers a nice assortment of them, and features daily specials. I ordered the mac and cheese, fried okra, and sweet potato tots. The mac wasn't creamy, but it sure was cheesy! The okra was also good. I really liked the slightly sweet and flavorful barbecue sauce that they brought out to the table. The Arnold Palmer (iced tea and lemonade) tasted just right.\n\nTC's has an unbelievable deal for lunch specials on Tuesday, when 2 people can eat for $4.99. They have different specials each day of the week, but this one really stood out.\n\nI was checking out the display case full of desserts up front by the cashier, contemplating a slice of coconut cake for later, when something else caught my eye. Glazed donut bread pudding? Are you kidding me? I should have listened to the cook, who told me to get two orders. He knew what he was talking about. There were bits of peach, plump raisins, and walnuts under the donuts, and the whole thing was topped with cream cheese frosting. It's crazy. I bet it goes well with a cup of coffee.\n\nAnd tomorrow, I will go to the gym."
        }, 
        {
            "index": 37, 
            "rating": 5, 
            "review": "Wow this place is really good. Very clise to perfect and to top it off everyone there is so nice. Can't wait to come back and eat more of their ribs and mac n cheese. A must go I give it two thumbs up."
        }, 
        {
            "index": 38, 
            "rating": 2, 
            "review": "I was looking forward to eating here. Wow ordered a side of O rings and Jalapeno poppers received 5 - O rings and 5 - poppers  $ 3.85 each , that feels pricey \n Half slab of baby back , it was a little cold,\nCold slaw was soggy over all spent $65.00 plus felt very let down\n Only good thing the waiter was VERY Professional."
        }, 
        {
            "index": 39, 
            "rating": 5, 
            "review": "Awesome! Gabby rocks!\nStaff friendly and the food is down he cooking at its yummiest! \nCan't wait to try more!!!"
        }, 
        {
            "index": 40, 
            "rating": 4, 
            "review": "The menu surprised me.  Much more of a soul food spot than a rib crib.  Had the world famous baby back ribs, collard greens (you have to ask for them, not on the menu), macaroni and cheese, and the baked beans.  All AMAZING!  Corn bread....not so much! Sweet tea was exactly what you think of when you picture sweet tea in your head.  Ordered the food and it was at the table within 8 minutes, hella quick! Super fresh.  Thanks TC, your rib crib made a great day that much more awesomer.  If you are reading this just go ahead and check them out"
        }, 
        {
            "index": 41, 
            "rating": 4, 
            "review": "Spare ribs were as close to perfect as I have ever had. Meaty, fall-of-the-bone, beautifully smoked with just the right amount if fat. UmChicken also terrific. Some of the younger servers a little clueless, but oh a more experienced young lady straightened everything out. But who care? Oh  those ribs!"
        }, 
        {
            "index": 42, 
            "rating": 2, 
            "review": "So... pretty gross... I got the rib tips special with two sides and cornbread for 11.99... They were mostly bone and fat... It was sad how much of my plate was left it looked as though they hadnt even been eaten. The sides i got were baked beans and candied yams. The beans were basically buschs canned beans. Nothing homemade about them. The yams were so saturated in the thick sweet honeylike paste that they were too sweet to even eat. They were also super overcooked so that made them really mushy. Overall... They get two stars for the bbq sauce and the pepsi. :/ wont be coming back."
        }, 
        {
            "index": 43, 
            "rating": 4, 
            "review": "Where do I begin thank you New Orlean flavors brought right here to Vegas. \nThe ribs were a bit fatty, but the sauce was delicious. The BBQ chicken , cole slaw, cornbread were ALL good. To top it off the better than sex pie and buttermilk pie hit the spot without making you feel too guilty.\n\nThe one thing that needs work is the mac n' cheese! Definitely, don't appreciate the cheese combination.\n\nThe lunch specials are pretty good under ten bucks."
        }, 
        {
            "index": 44, 
            "rating": 4, 
            "review": "Be there three times in the past year one time I dine in super great service very attentive to my family second time I order to go like today the food is great a lot if meat on the full slab ...lol tasty .... but on to go orders sometime you get the whatever actitud. .... lol\nI still a good deal ... on the Groupon  app\nI travel from 215 n eastern. .. I love those ribs ...."
        }, 
        {
            "index": 45, 
            "rating": 5, 
            "review": "The real deal in BBQ & soul food. Great ribs and brisket. Sides fantastic. Candied yams are spectacular and potato salad is the best. Can't go wrong."
        }, 
        {
            "index": 46, 
            "rating": 5, 
            "review": "Visiting from California and was told about TC's Rib Crib, was told we must try their  BBQ and fried fish. Let me just say everything we tried was delicious, even the corn bread! The service was excellent and the atmosphere was very friendly. We will definitely visit TCS Rib Crib again!"
        }, 
        {
            "index": 47, 
            "rating": 3, 
            "review": "TC's specializes in down home cooking and Southern hospitality, and it definitely feels that way when you walk in.  The restaurant is comfortably decorated; I like the red tone to it.  And the menu is a simple size while still offering sufficient options.\n\nThe date and I each got our own 2 meat combo with 2 sides and cornbread.  I ordered the baby back ribs, beef brisket, mac and cheese, and Big Sam's baked beans.  Unfortunately, our meals came out sans cornbread, but we asked for it mid-meal and a piping hot paper tray of two pieces of cornbread (they were really muffins) came out.  No butter, not that I needed the calories, but it would've been a nice addition.  And they were just okay.\n\nThe baby back rib meat peeled off the bone easily with my fork.  The first bite made me nervous - it was dry.  I kept digging and the meat in the middle was moist.  I don't know what happened, but the moist rib meat was good.  The ribs tasted more steamed than BBQ'd though.  I was really craving a smokier flavor.\n\nThe beef brisket was good; it was tender and juicy.  It paired very well with their homemade BBQ sauce.\n\nThe mac and cheese and beans came out in styrofoam containers.  That made me nervous thinking that they store their premade sides in the containers and warm them up to order.  But, it did come in handy for taking the sides home since there were plenty of leftovers.  The cheese on the mac and cheese was clumpy and not melted into the normal smooth sauce I was expecting.  It was an odd consistency, but it tasted okay.  The beans were also okay.  Both benefited from a healthy shake of salt and pepper.\n\nMy favorite meat was actually the pork links that my date ordered.   They were perfectly salty and had a wonderful smokey char.  They were also beautifully grilled with lovely black grill marks.  I could've eaten just those and been happy all day.\n\nIn conclusion, it was okay, but unfortunately not the best BBQ in the valley.  Aside from the smokey flavor missing in some meats, we were also wondering where the BBQ smell was.  The restaurant and parking lot were both missing the potent and mouthwatering fragrance commonly associated with BBQ places.  This left us both to wondering where and how the meats were being prepared."
        }, 
        {
            "index": 48, 
            "rating": 4, 
            "review": "So after spending some time in Texas I got so unbelievably spoiled for amazing Bar B Q. Sadly I haven't found anything that has come close, until now.\n\nTC's had great Spare Ribs and Mac & Cheese. Their beef brisket was good but, didnt blow me away. The place is a simply family owned style place that is unassuming and informal. I will definately come back here and be hungrier next time as the portions are big!"
        }, 
        {
            "index": 49, 
            "rating": 5, 
            "review": "I was referred to TC's Rib Crib by a friend while I was on vacation in Vegas... loved every single minute in there!! I had the pulled chicken with greens and candied yams...amazing!! And for dessert, I had the best ever--Glazed doughnut bread pudding.. it was soooo good!! Everytime I'm in Vegas from here on out, I will definitely be stopping by TC's!!"
        }, 
        {
            "index": 50, 
            "rating": 5, 
            "review": "Best I have had in Las Vegas.  I live about 1 mile away from tcs and have thought about going for a while.  Tonight I took the dive and was very glad I did.  Service was good and very knowledgeable people working there.  I will be back to try other things.  All I can speak on is the ribs right now but thAt will change."
        }, 
        {
            "index": 51, 
            "rating": 1, 
            "review": "The food was ok. My son ordered the child sliders. He was suppose to get 2, they only gave him one, saying they combined the meat to make one big one. This thing was so small it looked like a slider baby! My wife ordered a coffee, which was almost $3.00. When she was half way done, the waiter asked if she would like a refill. So I'm thinking good service.....When I got the bill, he charged us for 2 coffees. When I asked about it, I was told it was policy to charge for refills!! Ya right! I didn't pay it. I will never go there again. Stay away unless you want to be overcharged."
        }, 
        {
            "index": 52, 
            "rating": 5, 
            "review": "TC's baby back ribs are the best ribs period.\n\nTheir barbeque sauses are good to average but their ribs are all perfect.\n\nLimited side dishes end up being mediocre supporting cast members to the stars.  The pulled pork, the brisket, the did I say ribs are the ultimate meat fest."
        }, 
        {
            "index": 53, 
            "rating": 1, 
            "review": "HORRIBLE COSTUMER SERVICE. The owners niece did not want to except our groupon because she said the family owned business is losing money. She did not care about losing customers that were using YeLP or Groupons. She is very rude and is a LIAR. After we ordered we were very misled after until we got the bill.The staff here is unbelievable, not in a good way. Spread the word."
        }, 
        {
            "index": 54, 
            "rating": 2, 
            "review": "Eh, they market themselves as \"soul food bbq\", and I have to disagree. The food wasn't nasty, but it was not great. It was just OK. I won't be going back here, and I won't be suggesting it to friends."
        }, 
        {
            "index": 55, 
            "rating": 3, 
            "review": "It's good, but not great. I was expecting more of a barbecue flavor right out of the grill, but it was more like oven cooked rib with a lot of barbecue sauce. The flavor is savoring and mouth watering. But it's not for me, because I'm expecting more of a smoked flavor It's a personal preference I guess. I gave it a three stars, because I feel it was over priced, even with the yelp coupon I still payed $17.00 plus the $10.00 I paid yelp. Its still worth trying if you have not tried it for yourself. Like I said its a personal preference. I might or might not come back it depends on my cravings."
        }, 
        {
            "index": 56, 
            "rating": 5, 
            "review": "They have Lousiana style bbq. I moved from mid-west where is famous for bbq, and I'd missed it. When I tried rib tip, I was soo happy with the taste. Also, mac n cheese was good."
        }, 
        {
            "index": 57, 
            "rating": 2, 
            "review": "We ordered delivery from here which is $9! The driver made us go outside and wait for him. The bbq baby back ribs were decent, the macaroni and cheese was disgusting the pasta was cooked too long and It was sticky and dry-ish? The green beans were ridiculously salty and the onion rings left a puddle of oil in its box. The hot links were pretty good though. Also for the price of everything they could of gave more food. Oh yeah and they forgot to give us our baked beans side."
        }, 
        {
            "index": 58, 
            "rating": 4, 
            "review": "Some of the best BBQ in town for a great price. Service is always great and it is true southern comfort food. I like to take out the 2 meat deal with spare ribs, pulled pork or a 1/4 chicken, Mac & cheese and greens. The corn bread muffins and BBQ sauce are both amazing and the meal is more than enough for two to share."
        }, 
        {
            "index": 59, 
            "rating": 2, 
            "review": "Me and my son both bought the 10-for-20 deal. We presented our deals to the nice young lady #1 that seated us and all seemed ok. After ordering and eating our food, a 2nd lady #2... that took our orders, said we could not both use the deal. \n\n Now, I tried to explain that the deal says \"one per person\" and not \"one per table\" or any other variance. They brought the owner to my table and he explained that he would not take both deals in a single sitting and suggest we come back another day to use the other offer.\n\nI explained that we could have sat at separate tables and it wouldn't have made a bit of difference. I argued my point but, to no avail.  \n\nAnyways, came back the next day just to burn off the other offer and to be done with it...will not be coming back.  \n\nP.S....the food was just ok. Not bad if you have the deal but, I wouldn't pay full price!"
        }, 
        {
            "index": 60, 
            "rating": 4, 
            "review": "Sooooo good!! Meat tender, sauce is great, greens is great (and I only eat my momma greens). The fruit punch is so good too! AWESOME  place, I GO ABOUT twice a month now!"
        }, 
        {
            "index": 61, 
            "rating": 5, 
            "review": "Had the three meat combo bbq chicken, pulled pork and brisket. Sides were Mac n cheese and onion rings. \nFood was delicious, chicken was juicy and fresh and the brisket was so tender! Onion rings were fantastic and the mac n cheese was piping hot!\nServer was attentive and on point also."
        }, 
        {
            "index": 62, 
            "rating": 5, 
            "review": "Amazing Food! The best in BBQ in Vegas.  Quite a wonderful surprise.  We bought the Groupon with a desire for BBQ. We were totally surprised by the best kept secret in Vegas.  Good sized portions that are reasonably priced.  You only have to eat here once to be hooked.  The ribs fell off the bone, the chicken was tender and flavorful and the Mac and Cheese, was hands down , the best we've ever had the pleasure of being served. The phrase, \"This would be my last meal\", was used more than once.  Everything they put in front of use we ate. We are very hard to please. :-) oh and.. Kyle was super helpful ..  TC's is a must visit!!"
        }, 
        {
            "index": 63, 
            "rating": 4, 
            "review": "Good stuff!"
        }, 
        {
            "index": 64, 
            "rating": 1, 
            "review": "Okay, normally I wouldn't review a place after eating there only once but I can safely say I won't be returning.  Got carry out the other day: pulled chicken sandwich, brisket sandwich, fries and onion rings.  All of the meat was really poor quality (mmm....boiled gristle!) and the sides were terrible too.  The sauce wasn't anything to write home about.   If their ribs are outstanding, I'd never know, but if they're willing to call the stuff I ordered barbecue, then they are really missing the point.\n\nMaybe I'm a barbecue snob, but it's really got to be smoked to be called barbecue, doesn't it?  I think the closest that the meat I was served got to being smoked was second-hand from the guy lighting his Marlboro out in front when I pulled out.\n\nI'm absolutely perplexed why my experience differed so completely from those who reviewed this place positively, but I won't be returning to give it a second chance."
        }, 
        {
            "index": 65, 
            "rating": 1, 
            "review": "Its amazing how fast a place can go from 5 stars to 1 by providing poor customer service. I went in the very next day for a business lunch and was treated very poorly by the staff and took 45 minutes for two meals while we were one of only three tables. I asked to speak to the manager  (the owners wife) and she was too busy to chat it up with paying customers. I interrupted her \"meeting\" to ask her to pass my contact info to TC so I could discuss the poor service with him. It was very obvious to me that the employees were not happy when TC was gone. A completely different restaurant on this visit. I would not suggest visiting this establishment until they decide that consistent quality and service are vital. I waited a couple weeks for the phone call that never came!"
        }, 
        {
            "index": 66, 
            "rating": 5, 
            "review": "very good ribs plus the banana pudding for desert"
        }, 
        {
            "index": 67, 
            "rating": 1, 
            "review": "I really wanted to love this place because who doesn't love ribs? Unfortunately the customer service was dismal. I was picking up and order for home and there  was one woman who had long braids who was so rude and dismissive towards me. Excuse me for bothering your day lady. Because of this one woman it has left a bad taste in my mouth for this establishment I will not be returning."
        }, 
        {
            "index": 68, 
            "rating": 5, 
            "review": "I love TC's Rib Crib! \n\nI work in the area, and often frequent TC's for lunch. They have fantastic daily and lunch specials! \n\nI have now tried everything on the menu. I'd highly recommend the Rib Tips, Pulled Pork, and the quarter chicken. The Mac and Cheese is a very delicious side.\n\nEvery time I go to TCs I'm reminded of being in New Orleans. The service is very good, and their prices are awesome. \n\nI would highly recommend TC's BBQ over any restaurant on the Vegas Strip"
        }, 
        {
            "index": 69, 
            "rating": 2, 
            "review": "Went back the next day it wasn't worth the wait..Rib tips were just fat..couldn't chew it away..most of it ended up in my napkin.  It was seasoned pretty well and sides were decent"
        }, 
        {
            "index": 70, 
            "rating": 2, 
            "review": "TC's what happened?  Have been several of times.  Food is good but the service is the worst!!! My husband and son each ordered two meats with sides. I ordered a salad with shredded pork on top.  They received their meal and were half way done and I still did not receive my SALAD!  The waitress never came over to say anything or check on us.  I had to yell across the  restaurant to inquire about my salad.  When I asked she said \"oh, he's making it now!\"....very rude, I might add.  I told her that she can  just cancel my salad as my family was almost done with theirs.  I nibbled on my husbands greens and rib tips.  When the waitress finally brought over the check there were never any apologies on my salad, REALLY!!  I will never go there again!  You are suppose to offer a Groupon to get customers to keep coming, not scare them away...but maybe that is why we were treated like second class citizens!  Hopefully, their good food will keep them in business and the service will not run people away."
        }, 
        {
            "index": 71, 
            "rating": 1, 
            "review": "We went there for my Birthday.  Biggest mistake ever, totally disappointed.  I am from Seattle and our Barbecue quality is not the greatest.  I have also been to Kansas, Alabama, Texas, and Georgia where I have had fantastic Barbecue.\nWho slices beef brisket thin like deli meat unless it has been put in the refriderator and cooled.  It was rubbery and tasteless. The sides were ok.  I went there do to a video showcasing thier food.  What a lie. I will not be back."
        }, 
        {
            "index": 72, 
            "rating": 2, 
            "review": "Ate there today. Had beef hot links, baby back ribs, mac n cheese, collard greens and cornbread. I was highly disappointed. The links were over cooked to the point that they were mushy. The ribs were also over cooked. Mac n cheese wasn't very flavorful. Greens and cornbread  were the only two things I enjoyed."
        }, 
        {
            "index": 73, 
            "rating": 4, 
            "review": "Yassssss.....My hubby and I were so happy to find a good rib place in our neighborhood. Sometimes you just need to have some comfort food and this is our new place. They have so much more than ribs. The cheeseburgers are fresh and meaty and the dessert selection is to die for! Hello glazed doughnut bread pudding! I highly recommend this place if you're int e mood for some true down-home cooking."
        }, 
        {
            "index": 74, 
            "rating": 5, 
            "review": "I have never tasted anything so awesome! I like to try something new from T.C.'s everytime i go there, just i can't believe how something so amazing can be in vegas and not have that much popularity or hype! the BBQ sauce is amazing! the mac & cheese is freaking delicious along with the sweet potato fries!"
        }, 
        {
            "index": 75, 
            "rating": 5, 
            "review": "It's difficult to please 10 people for a staff meeting, TC's was able to accomplish this and satisfy everyone's wallet! Awesome food and customer service! We will definitely be ordering from here again!"
        }, 
        {
            "index": 76, 
            "rating": 3, 
            "review": "New to vegas....wanted some BBQ ribs...i searched and searched....seems like bbq is something hard to come by out here in the dessert.    Finally I found some good reviews for TC Ribs.   So I drove out there for a to go order.\n\nTook my order of full slab baby back ribs and mac and cheese and baked beans.   The sides were good, the baby back ribs were a bit disappointing for my taste.  There was a lot of fat on the ribs and they really didnt melt off the bones."
        }, 
        {
            "index": 77, 
            "rating": 1, 
            "review": "This place is below average. For spending $80 on food I could go to Lucille's which has better food. \nColeslaw was bland\ntheir brisket is not traditional brisket\nRibs were eh\nCornbread was gross\nBBQ sauce was alright\nTheir Mac and cheese was good! I am definitely not going back...again not worth the money I spent..."
        }, 
        {
            "index": 78, 
            "rating": 5, 
            "review": "This is southern barbeque at its best. Hurricane Katrina made the owner move to Las Vegas and that was good luck for Vegas.\n\nI had the barbeque ribs and my husband had the pulled pork. We split an order of fried chicken wings. All were terrific. The corn bread is the best I've ever had. Cole slaw was excellent. The only thing not outstanding were the french fries; there was nothing wrong with them, but they were just O.K. Crinkle cut fries would be perfect.\n\nWe were there on a Friday night and the place was almost empty. What is wrong with the people of Vegas? Why is this place not crazy busy?! \n\nI am looking forward to my next trip to Las Vegas so I can eat at TC's Rib Crib again!"
        }, 
        {
            "index": 79, 
            "rating": 5, 
            "review": "Everything was good. Good food, good customer service, reasonable prices. The owner was out and about greeting folks. And was more then happy to fulfill my request for a sunrise (Kool Aid with lemonade). The ribs, Mac and cheese, greens, and candy yams were delicious. Although we are from California. We will return when we are in town. Thank you."
        }, 
        {
            "index": 80, 
            "rating": 2, 
            "review": "Decided to check this place out since we were in the area and there was a yelp deal. \n\nThe food was decent, nothing too special but it took forever for the server to bring our food and it wasn't hot when it arrived. After waiting forever we didnt' want to send it back to be reheated. The restaurant wasn't that busy either so the delay and luke warm food was a disappointment."
        }, 
        {
            "index": 81, 
            "rating": 2, 
            "review": "I believe in 2nd chances! Ordered the Barbecued Chicken for take-out. It was so dry I fed it to my dogs and ate the 3 day old Albertson's Barbecued Chicken in my fridge. You know it tasted fresher and better! Corn Muffins were good though."
        }, 
        {
            "index": 82, 
            "rating": 2, 
            "review": "I went there for catfish on a Friday. The website says one price then when you \npurchase your order, the price is different.  I was told they could not change the\nprices on their website.  I would call this \"False Advertising\"."
        }, 
        {
            "index": 83, 
            "rating": 5, 
            "review": "Love this place. Always come in here dying for their mac n cheese! There's this one guy at the place who shows exceeded customer service. He always checks up on us, is very nice, and serves the food with a smile! \nI personally love the beef brisket; it goes well with their BBQ sauce. My favorite, however, is the mac and cheese. Sometimes it comes out cold, but oddly, I like the mac and cheese cold because the cheesy taste pops more. I love this place I'll come back many times!"
        }, 
        {
            "index": 84, 
            "rating": 2, 
            "review": "I read many of the reviews and with so many positives decided to try this resturant. We must have hit them on a bad day. We ordered a rack of baby back's and three sides. The sides were ok but the ribs were unacceptable. They were totally dried out and very tasteless and would have appeared to be hold overs. We ate a few and threw the majority in the trash. Being from the mid-west I know what good BBQ should taste like. Famous Dave's are far superior. Too bad there is not a Dickies locally. \n\nAgain we may have caught them on a bad day but with the cost, delivery and tip I won't take another chance."
        }, 
        {
            "index": 85, 
            "rating": 5, 
            "review": "Great place.  Our favorite rib house. The ribs were meaty and tasty. \nService was friendly and efficient. \nLike the new location and that its locally owned."
        }, 
        {
            "index": 86, 
            "rating": 2, 
            "review": "Ordered through Eat24. Wanted some ribs and we didn't feel like driving anywhere for it. Overall, not impressed.\n\nThe delivery time was good. Took a little over 30 minutes.\n\nWe ordered a full rack of beef ribs and a half chicken. The ribs had barely any meat on them at all. There were only a couple out of the whole rack that had a decent amount of meat. I feel like a paid almost $25 for a pile of bones with BBQ sauce on them.\nThe chicken failed as well. The meat was extremely dry and had tiny bones stuck in the meat.\nOn a positive note, the macaroni and fries were pretty good.\n\nI won't order from here again. Next time, I'll just get off my ass and drive somewhere better."
        }, 
        {
            "index": 87, 
            "rating": 4, 
            "review": "There weren't too many people in here when I came to eat. I was looking for something good and looked on yelp for a place that was offering a deal. TC's ribs was it.\n\nI had the chicken and waffles, which was okay but nothing special. The service was good, and the atmosphere was good as well.\n\nThe only issue I really had was that I could not claim my deal because there was a glitch in the yelp app that wasn't allowing me to upload my credit card and pay for the deal. The restaurant wouldn't let me get the deal if it wasn't through yelp, which kind of sucked. It's not their fault though so I'm not blaming them or taking any points away for that.\n\nI still say for chicken and waffles to go to skinny fats or hash house."
        }, 
        {
            "index": 88, 
            "rating": 2, 
            "review": "Had a hankering for some rib tips and decided to give TCs a try. I had some ribs tips, greens, and okra. The rib tips were just ok. Some of the pieces were nothing but fat. The okra was pretty good and I've had better greens. Not sure if I came on a bad day but I'd be willing to give them another shot."
        }, 
        {
            "index": 89, 
            "rating": 5, 
            "review": "Awesome food and service. Had the beef ribs and they were great. Highly recommend this place if your in the mood for great barbecue and over the top service."
        }, 
        {
            "index": 90, 
            "rating": 2, 
            "review": "All the best intentions...\n\nThe brisket was loaded with gristle and slathered with barbecue sauce.  I may try the pulled pork next time - if there is a next time - since it's close to my office.  Nice 'soul food' kind of atmosphere."
        }, 
        {
            "index": 91, 
            "rating": 2, 
            "review": "We went with the Groupon deal. Everything was \"okay\"... (Atmosphere, food, service). Don't believe we'll ever go back."
        }, 
        {
            "index": 92, 
            "rating": 1, 
            "review": "Read about this place in a travel magazine and decided to take my employee to lunch here on his first day of work. My employee loves barbecue and had not been here. Since it's in a strip center, we knew what to expect as far as surroundings, but the ribs were dry and the sides were awful. The service was very good and they were very friendly. I recommend the iced tea."
        }, 
        {
            "index": 93, 
            "rating": 1, 
            "review": "Worst BBQ in Las Vegas I went ONLY because the 10 for 20.00 deal and wanted to call American Express and dispute the charge for this burnt excuse for meat!! I ordered the 3 meat special ribs brisket and rib tips which can break a tooth they are do burnt!! Do NOT waste your time go to the frozen section at smiths for better taste/quality"
        }, 
        {
            "index": 94, 
            "rating": 4, 
            "review": "Good stuff. Def worth trying out."
        }, 
        {
            "index": 95, 
            "rating": 1, 
            "review": "I recently purchased a yelp deal for this place. My family and I used it for the fourth of July for bbq and had to return (to not waste the money spent) while we were still in Vegas to use the rest of the deal $$.\n\nFirst, what kind of bbq restaurant doesn't smell like bbq when you come in?\nThis should have been a red flag and indication to run, but we still ordered and sure enough, the 'bbq\" just was cooked meat (tried rib tips[extremly old and dry], whole chicken, chicken wings, and pulled chicken [found bones]) with bbq sauce on it.\nThe side dishes were terrible and lacked flavor. This place tried to have soul food, but it was greatly apparent that they really don't know how to cook, let alone make soul food.\n\nUpon the return visit, we tried catfish and it was so terrible that I couldn't even finish one whole piece. The \"catfish fillets\" were obviously pre-battered and precooked (where the person in the back just dumped them in the oil) because there was a lack of seasoning, the pieces were cookie-cutter shape, and they were so dark from re-frying them.\n\nThe crazy thing is that some dude said that everything was fine.\n\nIf you want edible food- STAY AWAY!!"
        }, 
        {
            "index": 96, 
            "rating": 4, 
            "review": "First time here and things were great. We got the spare ribs with green beans, onion rings, and fried pickles. Servings were good sized, not too excessive but enough we all got our fill. The only thing that wasn't a winner for me was the cornbread.  But the staff was nice and the take out was well packed and we got everything we ordered. We'll be back for sure."
        }, 
        {
            "index": 97, 
            "rating": 2, 
            "review": "Tonight we decided to order takeout from TC Ribs. The reviews on Yelp seemed promising and the pictures on Instagram looked great; however, we were not very satisfied with this purchase.  The meats were actually good.  I had pulled pork and brisket, very juicy and tender.  My boyfriend had ribs and chicken, which he also thought were flavorful and juicy.  The sides were very subpar.  The macaroni and cheese was dry and pretty bland.  We also did not care for the potato salad.  The greatest disappointment was that we ordered a side of catfish and were charged $12.99 for two very small fish fillets (basically the size of a chicken finger each).  This was only for the fish fillets, did not include any sides at all. TC ribs should be embarrassed to charge their customers this.  Additionally, the online menu stated the cost for my two meat combo was $15.99, yet I was charged $17.99 instead.  The cornbread was decent, but we were told in placing the order we would receive 3 pieces and there were only 2 packaged when we arrived home.  Finally, we were greatly disappointed in the desserts.  My chocolate cake had that refridgerator taste when something has been in refrigerater too long.  Also, my boyfriend is from Louisianna and Peach Cobbler is his absolute favorite desert, yet he only ate about 1/4 of it.. He is not one to complain, but this man never has any food leftover on his plate.  Thank God we were able to use the $10 for $20 Yelp deal, otherwise our bill was almost $70 for a very subpar meal.  Needless to say we will definitely not be dining here again."
        }, 
        {
            "index": 98, 
            "rating": 5, 
            "review": "I am not from Vegas, but we come to visit often to visit family and we always have a meal here. I look forward to it every time! The ribs are fall off the bone tasty. I like their wedge style french fries, and the coleslaw is delish. Baked beans are great and the pulled pork is really good. But those ribs... baby backs, I just can't get away from them."
        }, 
        {
            "index": 99, 
            "rating": 4, 
            "review": "very tasty meats. we tried the family combo and got everything but the chicken and beef ribs. can't say i was disappointed by any of the meats but the brisket was definitely the winner. only caveat is: don't order the collared greens unless you regularly eat handfuls of salt with your meals."
        }, 
        {
            "index": 100, 
            "rating": 4, 
            "review": "I love coming here to get the baby back ribs, pulled pork, collard greens, potato salad, corn bread, and fried okra.  The meat falls off the bone and is just easy to devour.  I had their chicken too and found the dark meat more desirable than the white meat.  To appreciate the white meat, I needed to dip in to the barbecue sauce, which by the way has a zing to it.  \n\nThe pulled pork sandwiches are also to die for.  I'm not normally a fan of pork, but I'll eat it here over other places that serve it."
        }, 
        {
            "index": 101, 
            "rating": 3, 
            "review": "Bought the 10$ for 20$ Yelp Special today as my boyfriend and I have been wanting to try TC's since we moved to the area. So, we went and tried it today.\n\nWe both got the meat and 2 sides + cornbread meal. He got the pulled pork, sweet potato fries, and mac. I got brisket, mac, and baked beans.\n\nOur waitress was very nice and helpful. Our food looked awesome when it came out and we couldn't wait to dig in. The brisket was okay, I think I would have liked it better if I had ordered the sandwich. My boyfriend loved the pulled pork, and I have to say I did too, I kept eating from his plate! The mac was funky. We both didn't like the texture of the sauce, I prefer my mac and cheese to be creamy and this was kind of gritty. Sweet potato fries were good, and so were the baked beans. \n\nI didn't get to try any dessert, I was too full :( Overall this place is okay. Nice, chill atmosphere. I'm definitely going back for that pulled pork in the future, and I have to try their ribs to make my complete decision."
        }, 
        {
            "index": 102, 
            "rating": 4, 
            "review": "Really, really excellent!\nThe only reasons I'm giving 4 stars instead of five is because the BBQ sauce on the brisket was a little too much and a little too sweet (it was served that way).\nOther than that the ribs were amazing, the mac and cheese was wonderful, the beans were really good and they had a $1.00 peach cobbler that was incredible!!\nI went in a little hesitant because of some of the negative reviews, but we had a really grand experience!!\nI WOULD recommend it, and I WILL return!!"
        }, 
        {
            "index": 103, 
            "rating": 3, 
            "review": "3rd stop on the BBQ tour.  Not sure why i haven't seen  this place  before considering i've eaten at the sushi place in the same strip center 2 times.\n\nvery simple looking place but comfortable.  Appears to be a family run place - i like that.  ordered the spare ribs w/ cole slaw - $7.\n\nI give TC the cole slaw edge - but just a slim edge.  \n\nThe ribs - my guess, they boil first then grill them - the ribs were soggy.  They get props for the bbq sauce - nice bite, flavor.  but the ribs bothered me.\n\nstill i gotta hit this place again for the family mac and cheese and potato salad I also need to try the  pulled pork."
        }, 
        {
            "index": 104, 
            "rating": 4, 
            "review": "really good food. we haven't dined inside yet, but they're really quick with \"to go\" orders. Calling ahead helps too."
        }, 
        {
            "index": 105, 
            "rating": 3, 
            "review": "This was the second time I've been to TC's. \n\nThe first time I had the 3 meat combo (Brisket, Rib Tips and Baby Backs, none of these were enjoyable, sorry) with 2 sides (mac n' cheese which was very dry and Cole Slaw very enjoyable). The cornbread was good.  \n\nI saw the Yelp gift certificate ($20 for $10) and decided to give it another try. \n\nThis time I had the Beef Ribs (very tasty but a lot of FAT and small amount of meat) and the Spare Ribs (this by far has been the best of the meats so far. I went ala carte as I wanted to try the Peach Cobbler.  I'm so glad I saved room this cobbler was delish.  I would say a lot of time was put into making it.  Great flavor! I asked them to bring it to me cold not heated and that they did.  With the scoop of vanilla ice cream, I was in heaven!\n\nI believe this is a family owned and run business, started by father and now run by the son. The server I had on my second visit, James, was one of the friendliest and personable I have ever had for a small place. His smile and his truly caring attitude was ever present.  He wanted me to have a good meal!\n\nAll-in-all, I've rated TC's with three stars mostly based on the service, though I did like the cobbler  :) .   As for rating TC's for their Ribs, well that would be a thumbs down at this point.  Will I go back, yes I'll give them one more try if only for the service, but I'd hope that the ribs will be better the next time.."
        }, 
        {
            "index": 106, 
            "rating": 2, 
            "review": "Really wanted this place to be a winner. \nWe tried this place twice before- this is our 3rd time. Never wrote reviews b/c we hoped we were just experiencing one of their \"off days\". \nReason for my rating : Too inconsistent and doesn't taste like \"Soul\" food. \n\nWe ordered a Full Slab of ribs twice - received 7- 8 ribs both times. For those that know about ribs, know how many is a slab... Not sure what they're doing but either way I should AT LEAST get 10 ribs... Don't just completely insult my intelligence!\n\nThe ribs are either tender and meaty on some days or fatty and chewy on others. I don't like the inconsistency. \n\nUm next, the corn bread- it cries for milk and sugar -tastes like airy cornmeal and water...\n\nPotato salad- The first time was pretty good- which is why we ordered it for the 2nd time but it was too chunky. Then ordered again for a 3rd time just to make sure the 2nd time wasn't a mistake and it again was too chunky. I'm talking too chunky like I had to chop 1 piece of a potato into 3 smaller pieces. \nWhich one is it, chunky or nah?\n\nThe Mac and cheese tasted like like a doctored up box of Velvetta Mac and cheese. \n\nAgain this food is classified under \"Soul Food\".\n\nMaybe sell grilled steaks and burgers and become an all American restaurant b/c your sides aren't good. You can't call it Soul Food just because you sell Mac and cheese, collards greens and corn bread. Soul Food is apart of culture just like Mediterranean or Asian cuisine.  Soul Food might be the wrong category for this one or at least my soul thinks so"
        }, 
        {
            "index": 107, 
            "rating": 2, 
            "review": "Used the Yelp deal and I'm glad we didn't pay full price. Service is bad and they weren't busy! Don't have to return"
        }, 
        {
            "index": 108, 
            "rating": 4, 
            "review": "pulled pork was pretty good...the same for the onion rings and okra but they tasted like they were from frozen...they were still good so what ever...the people working there seemed like they wanted to be outgoing and friendly but Im sick right now and I was in one of my anti-social moods so as they were being very friendly I probably came off to be a b*tch! (sorry for that)...price wise they are a little pricey and I agree with others that for the price vs. quality you could go somewhere else but the are so close to my house I dont mind paying. I could say they are a-ok but I will return again so I guess that makes me a fan!"
        }, 
        {
            "index": 109, 
            "rating": 4, 
            "review": "Love the BBQ here. Really great tender juicy meat. The service is great. Real \"Home\" feeling when I eat here. Just great service. So polite. But the food speaks for itself. Cant find too many places in town to really have great BBQ. They have daily deserts made that are to die for. Try the \"Better Than Sex\" cake. Trust me. LoL. It jut might be. Jkjk. But yeah... Anytime your in town. Its worth the 10 minute trip from the strip to here."
        }, 
        {
            "index": 110, 
            "rating": 2, 
            "review": "Not sure why Las Vegas struggles to have good BBQ. This place is highly overrated. The ribs are par-boiled and the food is mediocre."
        }, 
        {
            "index": 111, 
            "rating": 4, 
            "review": "Love Love LOVE the sweet potato fries. Thank goodness for TC or I'd be more depressed in Vegas! The ribs are good. Not the best I've tasted, but it's good. Not recommend the Beef ribs though. The fibers of the meat is to tough for me and the size just too big. The portion is big for one, maybe barely enough for 2 if you don't order side dishes. I have yet to try the baby back ribs. I always order the sauce on the side, just so the flavor of the meat won't get masked by the sauce. The ribs are good for the leanness and not too fatty. Very tricky because it can be tough when the you're grilling meat with less fat! For the price it's a good neighborhood eatery that I would go to."
        }, 
        {
            "index": 112, 
            "rating": 4, 
            "review": "The staff was friendly, the food was great and the place was clean. We came late on a Saturday night and there were only a few people and were afraid we might get something warmed over but the dinner was hot and fresh!\nWe read about this when visiting Vegas and I guess the best I can say is we will make it a point to eat here te next time we are in town!"
        }, 
        {
            "index": 113, 
            "rating": 4, 
            "review": "The place is a little small but the decor and furnishing have a welcoming feeling...of a family owned business that is actually relaxing.  Casual place, but nice! The food comes in good amount packed with flavor to savor as the aroma engulfs your smell senses. Prices are reasonable and portions are generous as far as meats go.  They could give a little more when it comes to sides though.   The servers at the time were very friendly, polite and helpful.  Food is generally of the South type flavor, but there is something everyone will love.  Especially the BBQ!  I haven't had a chance to try much of their other stuff...but I definitely will come back!"
        }, 
        {
            "index": 114, 
            "rating": 1, 
            "review": "If you like brisket to taste like good ole refrigeration happy eating!  Otherwise run and dont look back?"
        }, 
        {
            "index": 115, 
            "rating": 5, 
            "review": "Let me start out by saying that the staff is the best. They were nice and pleasant. I needed to have my lunch ready at open and they were happy to accommodate that. \n\nI ordered the Jr brisket Sammie lunch with fries. The fries are well seasoned and super yummy! I got my brisket sliced and it's super tender and full of flavor. \n\nI couldn't come here without trying the Mac and cheese. I'm a huge Mac and cheese snob, my grandma made the best, and this stuff is (sorry grandma) even better! Creamy and cheesy but not swimming in sauce. \n\nDo yourself a favor and come try them!\n\nSide Note: I wish yelp's ordering app Eat24 had an option to add a side of cornbread it looks so good but wasn't on there to order!"
        }, 
        {
            "index": 116, 
            "rating": 4, 
            "review": "My parents and I dined here on Thanksgiving eve, we were totally impressed with the quality and taste of the food.\nThe staff was very nice and checked on us to make sure we were satisfied with our dinner.\nThe baby back ribs were very tender and moist, the mac and cheese was GREAT, as were the sweet potato fries that my mom had.\nI just wish they had coke products...\nNot a fancy place but who wants to eat MESSY ribs in a fancy place!!!!\nWhen I'm back in town I will for sure go back!\nTRY IT,  YOU WILL LIKE IT!!!!!!!!"
        }, 
        {
            "index": 117, 
            "rating": 5, 
            "review": "BEST FOOD EVER!  This is our second time here and we love almost everything on the menu! Brisket is fabulous, beef brisket is on point, BBQ Chicken is Out of this World GOOD! My son loves the pulled pork and says it's unbelievable! \n\nThe sides are great too. I love the okra, greens & candied yams. My husband loves the potato salad and the beans! My son gets Mac & Cheese and fries...YUM!\n\nThis is everything you come to expect for a home cooked meal that touches your SOUL!\n\nWe will be back again & again!  I can't believe we just found this place after living in Vegas for 9 years already, so mad at that!!"
        }, 
        {
            "index": 118, 
            "rating": 4, 
            "review": "This was an interesting experience. I wasn't sure what to expect when I walked in. There are photos everywhere and a cluttered entrance. We sat down and took forever to get drinks. Waitress took our order and then another waitress came by as our waitress must have been new and didn't know what we wanted. I was thinking it was going to all come out wrong. The food came and WHOA! The best brisket I have found in Vegas! The sweet potatoes were perfect, the ribs fell right off the bone in tenderness. Mac and cheese was boring and dry, hoping grandmas Mac will improve. The manager came by and suggested dessert, which we took home after being so full. It hit the spot later that night! Food is absolutely worth the strange atmosphere and ambiance. The team was hospitable and fun, just keep training your newbie so next time will be a little more seamless."
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "Every time I stop at TC's I am reminded how great and friendly their staff is.  Even if I didn't love the beef ribs, I'd go back time and again.  Do yourself a favor and stop for lunch (or dinner) and be reminded what a great family dining establishment is all about!"
        }, 
        {
            "index": 120, 
            "rating": 1, 
            "review": "Never got a chance to try the food , we waited 45 minutes and it still never came. Waitress never came to our table to refill drinks or say the food will be out soon. We got up and left they didnt say they were sorry and even had to pay for my soda. Its ok though the prices were very high too high to have to eat off of paper plates & plastic forks. Will never go back."
        }, 
        {
            "index": 121, 
            "rating": 5, 
            "review": "If you are a fan of pulled pork or mac n cheese that probably has 10,000 calories in it then this is the spot for you.....and me! OMG, I found this place years ago and have actually celebrated a birthday or two, here. It's absolutely charming in every way. TC's is a hole in the wall decorated like your grandma's house with family pictures, place mats and friendly faces. If you are lucky you just might get to meet TC while you are here! I always get the pulled pork because it never let's me down. It's tender, juicy and shredded to the perfect consistency. You are responsible for putting the amount of BBQ sauce you like on your meat. I also always get the mac n cheese that is to die for. Don't leave out the fried okra, ribs, grilled chicken salad, sweet potato fries, etc. You can wash it all down with sweet tea or Kool Aide. Dessert is not to be missed. At the top of that list is the banana pudding and glazed donut bread pudding. Yes, that just happened! Every single person I have brought to TC's has been back and brought their friends, too! They get the five stars because they are reasonably priced, delicious food, and most excellent service. I love this place!!!!!"
        }, 
        {
            "index": 122, 
            "rating": 5, 
            "review": "My guilty pleasure. I call up this joint when I'm in some dire need of comfort food and it always hits the spot. I believe the mixed reviews have alot to do with the inconsistency in freshness that I've sometimes experienced here myself. I think the time of day and week you happen to order or dine in has alot to do with it here, as it can be hit or miss in that department. I have ordered when the food was hot off the grill and the meat was melting off the bones. I've also ordered when the ribs were not just made and the sides definitely appeared to be reheated. There is a huge difference but chalked it up to coming during a rather vacant time of day. This is a small family business and I think if you are smart about when you order or arrive during a fairly busy time, you will get your food alot fresher. I order around dinner time closer to weekends when there's a line out the door and I'm never disappointed. I recommend the spare ribs, mac n cheese and potato salad is good. I wasn't too impressed with the cakes I've tried but I'll try the pudding next."
        }, 
        {
            "index": 123, 
            "rating": 2, 
            "review": "You know, it was terrible? Ok, yeah, it was not what I was hoping for. I don't think I would go back. I bought the Groupon, so I was kind of on the hook for $20. Unfortunately, I should have read the YELP reviews before I went. the meat was smothered in sauce and very greasy. Not the best at all. There are plenty of other options in Vegas for BBQ. Try them."
        }, 
        {
            "index": 124, 
            "rating": 2, 
            "review": "I'm a big fan of good ribs and this place fell short of good ribs. The price wasn't bad because of the $10 for $20 coupon I bought on Yelp but they quality just wasn't there. The ribs weren't tender and a little cold I used extra bbq sauce cause the taste of the ribs wasn't very good. I do want to say the service was good though."
        }, 
        {
            "index": 125, 
            "rating": 2, 
            "review": "Here are some suggestions for this establishment. (T.C. S Rib Crib\nThe first is to replace the front door mat. It's to shreds and 10 bucks would replace it creating a far better first impression. When I saw this I was reluctant to walk in.\nClean the windows and door daily. Dirty door dirty food?\nHave staff wear clean uniforms. Residue on aprons is not appetizing.\nFood is mediocre, but who can get past the above mentioned items?\nGet it together T.C.s!"
        }, 
        {
            "index": 126, 
            "rating": 4, 
            "review": "Really simple and good eating.\n\nJust grab a slab or half if you're not that hungry and grind away.  The ribs are excellent.  Very moist, super tender and while the sauce may be a personal thing, to me, its incredible.  Sticky, sweet, sour.  (No, I'm not trying to cause a food war.)\n\nPrices are really good.  A full rack for less than $20.  For just two bucks more, you can add two sides and cornbread to your ribs.\n\nOther items are also good but really, why would you not want the ribs.\n\nOh yeah, Friday is catfish fry day.  Give the fish a try (as a side to your ribs)!"
        }, 
        {
            "index": 127, 
            "rating": 4, 
            "review": "Great to dine in with the family, or get take out when the kids can't handle a sit down meal! ;) I love the friendly, cozy atmosphere and the staff is so genuinely nice! We've been here several times and are never disappointed!"
        }, 
        {
            "index": 128, 
            "rating": 2, 
            "review": "This was our first experience withTC and it'll be our last. We had carry out and tried a number of items. The barbecue sauce was highly rated- tangy, sweet and flavorful. The ribs  and chicken wings were cooked nicely. The cole slaw was good as well.  No complaints there. The problems were with the following:\n\nCornbread: very odd, off-tasting, bland, giving the experience of eating a gummy lump of flavorless dough. I wanted to like it but there wasn't anything to go on. \n\nCatfish: fried nicely, but tasted like thawed out store fish. Overloaded with salt.\n\nMacaroni and cheese: bland, flavorless. We guessed all the salt was used on the fish. \n\nFrench fries- tasted like the frozen potatoes we imagine they started as. Easily became cardboard-like. No flavor. \n\nPeach cobbler: by far the most disappointing. The only sweetness came from the peaches. The dough was just gloppy and flavorless. Where was the sugar? The vanilla? \n\nOur meal felt like a series of memory lapses where seasonings were forgotten. This sounds like a one-star review but I added a star because we enjoyed the BBQ ribs and chicken. When you spend money you want EVERYthing to taste good!"
        }, 
        {
            "index": 129, 
            "rating": 4, 
            "review": "The pulled pork and bbq chicken was yummy. The sweet potato pie was a disappointment, tasted more like a lemon bar"
        }, 
        {
            "index": 130, 
            "rating": 5, 
            "review": "The best BBQ in Las Vegas!  I can see why this place is so popular.  My 1/2 BBQ chicken with mashed potatoes, mac & cheese and corn bread was outstanding!   The bbq sauce is sooo good, too!  My waitress,  Reshea, was so nice and provided excellent customer service. Everyone there was really cool and was such just a really nice dining experience. I highly recommend this place to anyone that loves really great BBQ. 5 Stars!"
        }, 
        {
            "index": 131, 
            "rating": 1, 
            "review": "It's not the food. It's the attitude of the staff. Small businesses depend on neighborhood clienteles. Tc ribs do not act like a small business that appreciates their customers. It's a shame that I won't ever come back because they have lost my loyalty due to poor customer service."
        }, 
        {
            "index": 132, 
            "rating": 4, 
            "review": "**Summary**\n       - Ribs - The spare ribs were probably one of the best ribs I've ever had. The meat inside was just so tender. The bbq sauce was just perfect with fire-kissed crust.\n       - Homemade - Almost all of their non-fried sides are homemade. It gives the food a more family feeling.\n       - Location - They used to be over on Dessert Inn but moved to a roomier location. They also changed their phone number and didn't update yelp until recently.\n       - Price - The prices are a bit steep if you're eating for one. I usually share a three meat combo, so it ends up being about $9 a person. Trust me when I say, it's a lot of food.\n       - Consistency - It seems people either really like or really hate the place. Even something like the meatiness of the ribs is up for debate. I don't know if it's a consistency problem.\n**Ordered**\n       - $17.99 Three Meat Combo with 2 sides and cornbread muffins.\n          - 1/4 Rack (3 bones) Baby Back Ribs (Pork) - Fire-smoked and crispy on the outside with their homemade bbq sauce. Meaty and juicy on the inside. It's a step above your overcooked Tony Roma's or Famous Dave's ribs.\n          - 1/4 Rack (3 bones) Spare Ribs (Pork) - I'd prefer the spare ribs over the baby back because they had more meat and were thicker. This meant there was a lot more fall off the bone meat between the smoked crispy crust and the bone.\n          - Beef Brisket - The bbq sauce, though the same as the ribs, just seemed too sweet. The brisket was not thick sliced like I was use to. It was thinly sliced like bulgogi. I probably wouldn't get this again.\n          - Candied Yams - Homemade and caramelized to perfection.\n          - Wedge Cut Fries - Crispy on the outside, cooked just right on the inside.\n          - Cornbread muffins - Also homemade, they were sweet and delicious. For an extra dose of diabetes, you can add honey on top.\n**Recommendations**\n       - I'd recommend this place if you're looking for some calorific soul food. I'd choose your meats/sides wisely however. Reading the other reviews and my own experience, the items are either really good or really bad."
        }, 
        {
            "index": 133, 
            "rating": 5, 
            "review": "Always feels like I am away from Vegas!! The staff is always friendly, personable, and super nice. There was a large group here before my husband and I came in but they still made us feel like we were the only ones there with their attentiveness!! I love coming here, the food and staff always makes me feel welcomed!! Thank you TC's Ribs!!! I will be a returning customer!!"
        }, 
        {
            "index": 134, 
            "rating": 4, 
            "review": "Food was really good. They accepted the YELP discount without question. I will definately go back."
        }, 
        {
            "index": 135, 
            "rating": 5, 
            "review": "Amazing baby back ribs...the sauce is just the right amount of sweet and spicy. Make sure to get the mac n cheese, it's the best I've ever had at a restaurant!"
        }, 
        {
            "index": 136, 
            "rating": 4, 
            "review": "LOVE AT FIRST BITE... or so I thought.\n\nA friend of mine keeps raving about how great this place is and how he would only get his BBQ fix in Vegas, and me being on my mission to find a BBQ joint I love, HAD to try this place.\n\nIt wasn't hard to find, which was good. It is a small place, with about 5 tables along one side and a larger table right in front and 2 tables outside. The service was great. The girls there was very nice and made sure we were taken care of.\n\nThe sides all seemed so good I wanted to try everything! But I didn't want to go overboard. Just figured if I liked it, I can always come back and try more. So me and my bf ordered a full slab of ribs (baby back) in the combo with mac n cheese and fried okra as our sides. They had waffled sweet potato fries that day and best believe I got that too!! (pictures posted). I was ready to wait the 20+ minute for the food as the sign said, but the food came out surprisingly quick! Though, not all at once.\n\nSo... the mac and cheese was great! Tasted very homemade and slightly gritty like they used ricotta cheese in it. Not as rich and creamy as I am used to, but the bf loved it. I really liked the fried okra, though the bf didn't care for that. But you can't go wrong with sweet potato fries, especially waffled! Yum! Very crisp but not greasy.\n\nThe cornbread was a bit disappointing. It came out a bit after the other stuff so I figured it was just being baked or something, but it didn't seem that way. It was somewhat dry and bland. Sadly, I really like the cornbread from Famous Daves! And the ribs, it was good flavor. And not overly saucy. But a bit dry. The first bite of the ribs were great..! But maybe they cooled quickly and became really dry that I didn't want to have more (like I usualy do).\n\nOverall, the sides were great but the ribs were not the best, though not bad. I wanted to try the dessert, but didn't yet. Service was great. The place was clean. Gotta try the pulled pork and desserts next time! I will be back!"
        }, 
        {
            "index": 137, 
            "rating": 5, 
            "review": "Me & the wifey went to the place 2 times the 4th of July weekend I can say the staff and owner are on point and very professional I recommend this place to all who love good food. Thanks Sam & Staff!!!!!"
        }, 
        {
            "index": 138, 
            "rating": 5, 
            "review": "First time trying their bbq. I got the baby back ribs and Mac and cheese for my side and I was delicious!!"
        }, 
        {
            "index": 139, 
            "rating": 5, 
            "review": "TC's came highly recommended as the BEST VEGAS BBQ. That's a tough one to live up to, especially having eaten great BBQ in Bham, AL. In spite of the challenge,  it turned out to be TERRIFIC! Friendly folks, good  service and terrific food, especially the baby backs anf the BETTER THAN SEX cake. Try this place when you want BBQ in Vegas. You won't be disappointed!"
        }, 
        {
            "index": 140, 
            "rating": 4, 
            "review": "Tried this place for takeout once and deemed it was not half bad. Dined in the restaurant tonight and this is my take:\n\nThe restaurant atmosphere was simple, clean, and very relaxed. Almost like an order-at-the-counter-then-seat-yourself kind of place. There was indeed table service albeit not the friendliest, but also not bad. BF and I decided to share the full rack of baby backs plus two sides: beans and potato salad. Everything came out in speedy time (there were maybe 3 other tables of people) and was warm, but let me tell you, this is not a place that concerns themselves with presentation. Everything was served in single use paper or plastic containers - the sides even had lids on them! Not a big deal but almost made me wonder, \"What did we get ourselves into?\". Aesthetics aside everything was good. I thought the potato salad was a nice consistency and balanced, very complimentary to the BBQ. The beans were basic and enjoyable. The ribs came out barely wet but extra sauce was offered immediately. Once sauced up to my liking we dug in and were very pleased. Great taste, extremely meaty, and very tender. My only complaint is that there are little bits of bone and gristle to be picked out but that's sort of expected in place like this. The cornbread that came with the meal left much to be desired which is kind of surprising for a rib place. Overall, for the price we paid we were well-fed and our rib craving was satisfied. We even took about half the rack home. Would definitely return and recommend this place to friends. \n\nTIP: we used the Yelp $10 for $20 so we only ended up paying $6 (plus tip). There were tons of specials listed, too, like 2 for 1 Tuesday lunches so that makes this place even more of a bargain."
        }, 
        {
            "index": 141, 
            "rating": 5, 
            "review": "I'd just like to say that I've had bbq in Tennesse, Texas, South Carolina, Alabama and even NYC but I have NEVER had BBQ this tasty and tender\nEVER!!!! \n\nI'm from the Tri-State, where there are some of the best spots to eat are in the world. I travel alot as well and I haven't been this impressed in a long time with BBQ. I'm a foodie and I was blown away with the food period!\n\nWe were on our annual Vegas trip and I went to look for the spot because of the reviews and I was tired of the same ole same ole on the strip.\n\nTC's is Vegas's diamond in the ruff!!! The mac and cheese is so delicious I had to order another to go. They give you enough food that you can eat for days.  The chef came out to great us because I raved so much. The service is excellent too.\n\nPLEASE, PLEASE, PLEASE go and check this spot out. It's affordable and I PROMISE you won't be disappointed. I can't wait to go back!!"
        }, 
        {
            "index": 142, 
            "rating": 5, 
            "review": "This is some good bbq!!! The meat just falls off the bones on the spare ribs. The Mac n' cheese is sooo delicious, when you pull your fork out you have a string on cheddar hanging down.  Nice home cooked food. Pulled pork so good!!! If I had to not pick I'd say they need to get with a local baker for the bread. The bun for the pulled pork was blah. A nice big fluffy roll would have taken it over the top. Loved the hot links and bbq sauce.  Sharon is a sweet heart! This is a family owned mom and pop hidden gem! Great place to stop in for lunch while your dog gets washed next door."
        }, 
        {
            "index": 143, 
            "rating": 1, 
            "review": "Threw away my leftovers.  Sauce was just weird tasting.  Ribs were very tough.  Even the lady behind the counter was extremely rude.  Disappointing in every way."
        }, 
        {
            "index": 144, 
            "rating": 5, 
            "review": "Excellent service, excellent food. Loved the baby back ribs and pulled pork. Highly recommend!"
        }, 
        {
            "index": 145, 
            "rating": 3, 
            "review": "The place is nice and the people are friendly but I don't like my food to be warmed up from the can. So no to baked beans at this place."
        }, 
        {
            "index": 146, 
            "rating": 5, 
            "review": "My friend and I stumbled on this place while we were looking for a Chinese buffet . We gave up and just wanted to eat so we came here. I wasn't in the mood for BBQ so I was just going to get a cheeseburger and fries. Then my friend noticed a sign behind me saying they have Chicken and Waffles on Wednesdays. We were there on a Saturday so we didn't know if they would serve it . We asked and we received! \n\nThis is the first time I've ever had Chicken and Waffles ...I didn't know what all the hype was about until that moment. The Waffle was crispy on the outside and fluffy on the inside . These were not Eggos for sure .....these were fresh! The chicken was perfect with it especially dipping it in the maple syrup. This could easily become and addiction! \n\nIf you do come here please keep in mind they make everything fresh so it may take up to 20 min for your order but it's well worth it! The price was also reasonable the bill for two people came out to around $21.00."
        }, 
        {
            "index": 147, 
            "rating": 2, 
            "review": "When you walk in the doors, it has the \"this doesn't feel like Vegas\" thing going for it. Simple decor, hand written deals on whiteboards, photos on the wall and what seems to be a family running the place. I personally love spots like that and I wanted to love TC's but it just didn't happen. \n\nI ordered a 2 meat combo with links and brisket then chose fried okra and greens for my sides. Being completely honest, this is the worst brisket I've ever had. I really don't even think they should call it brisket, it's that bad. The only thing I can compare it to is that boxed Philly cheese steak meat that comes frozen in super thin sheets. Only it's been freezer burned and overcooked to the point of leather-like texture. The link wasn't nearly as bad but definitely nothing special. As far as the sides go, the cornbread was bland and dry and the greens were straight bitter with absolutely no flavor. About the only thing worth noting on the plate was the okra...not too heavy on the breading and fried just right but still lacking flavor. My wife had a pulled pork sandwich...other than being way better then the other two meats on my plate, it still was just a basic sandwich and nowhere near worth the $9 price tag. Their sauce is ok but more sweet then anything and they don't even keep bottles of sauce on the table for you. Who does that?!\n\nI'm really only giving this place two stars because their banana pudding was decent. Other than that, this was just a bad stop for me all around. The service was terrible, the food was even worse and it's highly overpriced. We used the Yelp $10 for $20 deal but still ended up paying $21 out of pocket. Do I even need to say I won't be coming back anytime soon?"
        }, 
        {
            "index": 148, 
            "rating": 4, 
            "review": "Like many other places, this place was great before it got \"noticed\".  The  original recipes are phenominal, however, they have slacked slighty on their attention to detail in response to the higher demand.  I still like to go here, every now and then, even though it will never be as good as it was in the past, it is still far better than most places out here.  AND definitely better than anywhere in the SW.  I like their potato salad, chicken, fried okra, any of the sweets, and sweet potato fries.  Give it a try sometime...you won't be disappointed."
        }, 
        {
            "index": 149, 
            "rating": 5, 
            "review": "This place has amazing food!!! They also cater all sorts of events and will customize the menu per your request and desires. It's truly a one stop shop. Do yourself a favor and allow them to cater your next event, you won't be sorry!!!!! Thanks guys for always going above and beyond and doing a wonderful job for me!!!!"
        }, 
        {
            "index": 150, 
            "rating": 2, 
            "review": "after hearing 3 people talk about this place, i had to check it out.  i was disappointed.  this was even after a major workout.  I'm always hungry after a workout.  anything will taste good.  i dunno living in Austin for just 4 years made me a snob.  i dunno, but this was disappointed.  it's a pricey place.  i had a two meat combo (rib tips and 2 sausages) + corn bread + 2  sides.  the sausage was good, firm, sweet, tangy, and had that classic crunch when you bite into it.  the rib tips were just thick pieces of brisket.  it was dry, hard, and no fat to make it seem more moist other than the sauce.  it wasn't like the rib tips at Famous Daves.  also the sauce had no spicy kick at all.  for the sides i had fried okra, which was dry and just weirdly off.  maybe it had too much batter.  the macaroni cheese was ok, not spectacular, but i think kraft cheese and macaroni is way better.  the good thing here is that they have big cups of ooh so sweet tea.  I'm so sad about the bbq, i need to go back to famous daves to make up for it...maybe this weekend."
        }, 
        {
            "index": 151, 
            "rating": 5, 
            "review": "I don't know if maybe I came on a good night or what. But u have to completely disagree with the previous bad reviews. I'm very picking with BBQ and southern sides. TC's gets my approval everything was great. Not one thing I could complain about and that's saying something with BBQ. I had rib tips, brisket, pork links for meats and every single one was perfect. For sides had fried okra and mac n cheese. Even the sides were spot on. Me and the fams will be regulars here for a long time."
        }, 
        {
            "index": 152, 
            "rating": 4, 
            "review": "I went there on a recommendation from a felllow BBQ junkie.\n\nI have to say, it was pretty damn good! Probably some of the best I had.\n\nThe service was good too.\n\nThis place is a hole in the wall, its no fuss and thats all I can say. They are what they are, in the best way possible.\n\nI had the sampler platter and everything was great, including the collard greens, which is a test of any bbq joint.\n\nTheir corn bread was disapointing, they were corn muffins.\n\nThe hot links are F'n amazing!!!\n\nThe prices are great too, you won't go broke eating here..."
        }, 
        {
            "index": 153, 
            "rating": 4, 
            "review": "The GF and I stopped by this place about a week ago for some good ol' Que. This place is fairly small and most of the employees seemed to be family.\n\nI was fairly hungry and figured \"I'm at the rib crib, I should order the ribs.\" (usually not what I order at BBQ). I ordered the full rack baby backs with 2 sides for......$18.... I think. My sides were the sweet potato fries and mac and cheese.  The GF ordered \"Lots O' Meat Deal\". She ordered the pulled pork and 2 orders of brisket (the girl loves her some brisket) with sweet potato fries and fried okra. I think it was about $15. \n \nSo our food came out in a timely manner and we started gobbling it up. My ribs were very tender. The first bone I picked up slid out of the meat. They weren't soggy but not dry either. I can't tell you how much I LOVED THE BBQ SAUCE. The ribs seemed to be boiled then grilled... not the way I usually enjoy them (smoked.......mmmm....) but none the less very tasty. The sweet potato fries were crispy not mushy like most, very good, and the mac and cheese wasn't the creamy version but more of a casserole type...not the best but pretty good. Oh ya and the cornbread was not very good... I don't think I even ate it all...that's very unusual. I'm a cornbread junkie.\n\nThe GF's plate was filled with SO MUCH MEAT!!!!!!!! AHA.... I just wanted to shove my face into the plate and inhale....what a great death that would be..... anyways......2 huge portions of brisket and a huge helping of pulled pork. I have to say everything on her plate was defiantly worth eating again. Brisket was nicely sliced and the pork was extremely soft and tender. As far as I could tell none of their meat is smoked but as I said before it was still very good. Her fried okra was also good and I'm not a huge okra fan.\n\nDidn't try any of the desserts (had to save room for AYCE sushi 4 hours later) but they all looked fabulous. \n\nI would officially give this place 3.5 stars but I'm gonna round up not down for the yelp score. Service was great and everyone was extremely friendly. \n\nTHE BBQ SAUCE AT THIS JOINT IS ON POINT!!!!\n\nCheck 'em out... I recommend the \"Lots O' Meat Meal Deal\".... it's a lot of food for a real good price and you can sample three things they offer at the same time."
        }, 
        {
            "index": 154, 
            "rating": 4, 
            "review": "The food will not diappoint you...EVER!  I usually stop in for lunch.  It's cheap & oh so good! The chopped brisket sammy or the 1/4 chicken is always good.  The candied yams & turkey greens will make you think you're down south intead of in Las Vegas.  The staff is super friendly.  Don't forget to save room for  the desserts!"
        }, 
        {
            "index": 155, 
            "rating": 5, 
            "review": "Love the southern cooking! Everything I have tried here is amazing. I'm partial to baby back ribs and wedge fries, my husband adores the pulled chicken and Mac and cheese. We have every birthday here, it is a great place in a nice location run by good people! Never disappointed!"
        }, 
        {
            "index": 156, 
            "rating": 2, 
            "review": "1 year ago we moved to Summerlin and since then I have driven past TC's Rib Crib and seen it on my check in list on Yelp and other sites.  At first I thought it was someone's house but then I saw it was a real shop and my hopes rose as I love BBQ and hole in the wall places are usually the best.     Well finally my family and I gave it a try.  First   The menu was promising and I am kicking myself for not trying the Catfish Fry-Day special. Instead we went for the three meat combo and our daughter tried the two rib kids meal.   The baked beans and cornbread  were excellent and the potato salad not bad.  The barbecue sauce had a lot of flavor and spice.  However, there was way too much sauce on the food even for us BBQ lovers.  The spare ribs were tough and chewy instead of tender.  The pulled pork might as well been a bowl of sauce as the meat's only flavor came from the mass of sauce.  The brisket was unique, almost a greek gyro cut (very thin and bendable like ribbon) but was also chewy and overcooked.  The atmosphere was nice but the staff mostly seemed overworked resulting in a long time between drink refills.  The YELP coupon definitely made this a value buy and the $4.99 lunch specials and kids prices make it a bargain for the value conscious but if you are looking for the perfect BBQ, you will be disappointed.  It appears from the mixed reviews that this place may be hit or miss depending on the chef or how busy they are but It won't be in my main rotation.  I will however give it another shot one day just to see if I caught a bad day."
        }, 
        {
            "index": 157, 
            "rating": 5, 
            "review": "There are a few places in Las Vegas, and elsewhere, that once it crosses your mind it's all over. You must have it. Nothing will stop you. TC's Rib Crib is one of those places. A quaint BBQ joint, you can eat there or grab some take out, but given the treat-you-like-family service I recommend staying for a bit. I once ate there solo and a table of elderly customers nearby was laughing so hard it was contagious and I started laughing with them. That's the kind of behavior this food incites. Laughing with complete strangers.\n\nIt sounds cliché but you can't go wrong on the menu. A combo plate for your first time visit is probably best, from there you can come back weekly, daily, hourly for what you deem your favorite. I am loyal to the pulled pork (sometimes chicken) plate with sweet potato fries and coleslaw. I'm starving just writing this. It's 10:30am. The gargantuan drinks will ensure you are far from parched, and though I'm not wild about sweet tea others have reported to me it's just like what you get in the south. \n\nThe desserts are also great, provided you can even shove anything else into your stomach due to the hearty portions. Sweet potato pie, pecan pie...all fabulous and available to purchase in full pie form for holidays or special occasions. \n\n Make it a point to stop by TC's Rib Crib. It will absolutely scratch your BBQ itch."
        }, 
        {
            "index": 158, 
            "rating": 3, 
            "review": "Brought 6 other family with me to try those place for the first time. So two family platters ($49/ea) it was. I was actually surprised how small or turned to be. You get a choice of 4 meats: pulled pork, pulled chicken, 1/2 chicken, 1/2 rack ribs, or brisket. So I ordered full rack, beef brisket, and pulled pork each. The full rack looked like a half and the bottom side was burnt black :( I liked the brisket but boyfriend thought pulled pork was lacking flavor. Cornbread was dry for me.\n\nEach platter included 4 sides. Had regular fries, sweet potato fries, and onion rings. Each has maybe 5-7 pieces. Coleslaw, Mac n cheese, and potato salad were good. I don't even really like potato salad so that means something. However, this place is known for ribs.... Not sides. I had high expectations for this place and I was rather disappointed esp since I was so happy to bring 6 others (parents, aunts, and uncles). $110 for the platters plus 4 sodas. More expensive for what it was worth. We didn't even get real plates. (Disposables and to go side containers)\n\nAlthough I was not satisfied with the food, service was friendly and prompt."
        }, 
        {
            "index": 159, 
            "rating": 1, 
            "review": "Walked in it was very promising very clean the staff is very friendly. That's where the pleasant experience ended rack of beef ribs is all bones and burnt, dry cornbread, bitter greens. The burnt ends were all fat."
        }, 
        {
            "index": 160, 
            "rating": 1, 
            "review": "Just paid $23.94 for a half slab of beef Bbq ribs, and a slice of sweet potatoe pie. My question is ''where is the beef!!!!?? All Grissel and fat no meat, I. Couldn't even make a sandwich with a dinner roll. Dessert was average"
        }, 
        {
            "index": 161, 
            "rating": 3, 
            "review": "tC's recently introduced a weekend breakfast menu so we decided to stop by on our way to Red Rock Canyon.  My wife ordered the New Orleans French toast with fresh strawberries while I selected the bayou buttery buttermilk waffles with strawberries and whipped cream.  Both dishes tasted good, sounded better, but not worth a long drive"
        }, 
        {
            "index": 162, 
            "rating": 2, 
            "review": "We were disappointed in TC's. I had bought a Groupon for a To Go order, we were finished running errands and decided to use the Groupon and check out this place.\nSo we can say customer service was great but the food was below average. We got a 2 meat combo to share with Baby Back Ribs and 1/4 Dark Meat Chicken with sides of Mac and Cheese, Potato Salad, and Corn Bread. I had them throw in a slice of Coconut Cake, all of their deserts were sitting there staring at me, I couldn't resist.\nPortion size was fine but I could've made better food on our backyard grill and stove. BBQ sauce was on the vinegary side but had an almost bad meat taste to it. Chicken was just ok, nothing special, cooked to stay moist but flavor overall was lacking. Ribs were over charred and dry. Mac and cheese was mushy and bland, not enough cheese flavor. Corn bread was dry and tasteless. Potato salad was about the best thing we got and that's not saying much. The Coconut Cake tasted like it was cooked with suntan lotion, tasted artificial, I couldn't get past the first bite. \nSo in short, sadly, we won't be back."
        }, 
        {
            "index": 163, 
            "rating": 4, 
            "review": "Great experience thanks to a Yelp! deal and some good tips.\nThe food is pretty darn good. Of course, get the ribs... don't stray.\n\nGreat service and reasonable prices, considering the quality :)"
        }, 
        {
            "index": 164, 
            "rating": 5, 
            "review": "I love this place. Need a location in Henderson"
        }, 
        {
            "index": 165, 
            "rating": 4, 
            "review": "I got a Groupon recently for TC's Rib Crib. I had been to there old location, but this was my first venture to this location. I went with my spouse and we both got the lunch specials. I got the pulled pork sammie with the greens. My wife got the chopped brisket sammie and fried tea. She also got a sweet tea. We split an order of banana pudding. The food was quite good and the price was right. We'll be back."
        }, 
        {
            "index": 166, 
            "rating": 3, 
            "review": "Family owned business stays busy with a personal touch that makes you a repeat customer.\n\nWalking into T.C.'s Rib Crib, you're thinking it's a fast food joint.  But when they find out you're here for dining in, they'll have you take a seat for a full service experience.\n\nWe wanted a taste of it all, so the BF and I ordered up one of their \"Lots O' Meat Meal Deals\" for any combination of three meats, cornbread and two sides for $14.99.  Of the meats, we chose the Beef Tips, Links (2), and 1/4 Baby Back Rib Slab.  You can also choose Pulled Pork, Beef Brisket, Beef Ribs, Spare Ribs, or 1/4 Chicken.  Or sides, we chose the Grandma Georgia's Macaroni and Cheese and the Fried Okra.  Other sides include Aunt Ada's Potato Salad, Big Sam's Baked Beans, Cousin Joe's Greens, Uncle Earl's Coleslaw, Sweet Potato French Fries, Fried Jalapenos, and few other staples.\n\nThis meal was plenty for the two of us!  The Beef Tips were more like chunks of meat, not as tender as I would have hoped.  The Links were pretty grub though, a  nice crunch and texture and pretty tasty.  The Baby Back Ribs were okay.  The first rib I got has little meat on it, the second rib had more though.  We got a generous portion of fried okra, more than what they give you at M & M Soul Food Cafe.  It's breaded up and could use a bit more zing though.  The Macaroni and Cheese is a bit different with a grainy texture.  It's tasty, but  I guess it all depends if you like your mac and cheese creamy or not.  \n\nThey also serve up some Sweet Tea for $1.49 or $2.49.  Don't be a fool and get the small cup, go for the super large one instead!  Yum yum!  \n\nThey have a bucket load of desserts to choose from the Friday early evening we showed up!  Banana pudding, Coconut Cake, Snickers Cake, Homemade Louisiana Pralines, Glazed Donut Bread Pudding, etc.  It's definitely worth taking a look at their dessert display!\n\nWe also ordered a Full Slab of Baby Back Ribs with 2 Sides and Cornbread for $18.99 to go.\n\nThey have a Kids' Menu for $3.49 for those ten and under.  Kids eat free on Mondays with the purchase of an adult meal too!  They also serve up Burgers and Sammies, Chicken, and Catfish (on Fridays only)!\n\nFood is a solid three star, but the service is a four.  The wait didn't take 20 minutes like it was posted it can, so that's a good thing.  They come by and check up on you, get refill on your drinks if that's what you got, etc.  You can tell they have a lot of return customers here.  My big concern is seeing a bunch of older people with obvious health problems chowing down on not so health conscious food choices!\n\n(Of course you can find our hearty meal pics in the business profile!)"
        }, 
        {
            "index": 167, 
            "rating": 2, 
            "review": "TC's Rib Crib\n 3655 South Durango, Suite 18\nLas Vegas, NV 89147\n \nThis place was voted Best of Vegas 2007, Best Pulled Pork 2007...I say Hog Wash!!\n \nThis place earns 2 stars at best.  Too much sauce, very sweet sauce (which I usually like) but when you can't tell what is under the sauce, eeww...the ribs were tough and had no flavor.  Service left a lot to be desired! Price, pretty good.  Yelp had a special ($10 for $20) so the cost of dinner, cash out of pocket was $10 which included a tip.\n \nHard to find good BBQ in Vegas, but I'm on the hunt now.\n \nFamous Dave's (another local BBQ favorite here in Vegas) get a much higher rating.\n \n\nLocation: 4 stars (Great views)\n Atmosphere: 2 1/2 stars (very casual, but cool old pics on the wall)\n Food: 2 stars\n Service: 2 1/2\n Price: 4 Stars"
        }, 
        {
            "index": 168, 
            "rating": 5, 
            "review": "So so delish! Great atmosphere and great service, the folks here are awesome... been twice and will keep going back, new favorite BBQ fo sho!!"
        }, 
        {
            "index": 169, 
            "rating": 3, 
            "review": "Food was overall ok. I bought the Yelp deal. I was really looking forward to eat the Mac and Cheese but it was pastey and dry texture to it. The ribs were fall off tender but cold served . But the best things we had was the beef brisket and the yams!!!! My son ate all of our corn bread muffins. Sadly the staff didn't do a good job, they decided to socialize instead of doing their jobs. Service was very slow."
        }, 
        {
            "index": 170, 
            "rating": 5, 
            "review": "Best BBQ place I've seen in Vegas and it won't cost you an arm/leg, which is typical of BBQ restaurants.\nMade me feel like I was back in the midwest again, love it."
        }, 
        {
            "index": 171, 
            "rating": 3, 
            "review": "Came here with my wife and the in-laws. It is a family run place and very comfortable and cozy inside.  Loved that they serve cool-aid.  They had only 2 flavors. \n\nWe ordered the spare ribs and baby back ribs.  Both were very tender and had good flavor.  Their BBQ sauce is awesome.  Great flavor and a nice bite to it.\n\nWe also ordered the rib tips and brisket.  Some of the tips were burnt, but the ones that weren't were really good (the waitress did give us a discount).  The brisket was okay, a little tough.  \n\nVery disappointed with the sides.  We ordered coke slaw, potato salad, Mac and cheese, baked beans, and candied yams. The candied yams were delicious.  Good sweet yam flavor.  The Mac and cheese looked like the sauce curdled and had no flavor, very dry.  Potato salad, baked beans, and coke slaw were nothing special, very plain.  I expect the sides at a BBQ joint to be very good.  \n\nOverall, the meat was good and the sides were just okay.  Probably won't come back because there is so many other BBQ places in town to try."
        }, 
        {
            "index": 172, 
            "rating": 2, 
            "review": "How do I sum this up?  Overpriced and not good.\n\nAs I was forcing the food down my throat, the thought occurred to me that this was probably the worst barbecue I've ever tasted.  Why, you ask?  The food is very \"wet\" (meaning it's drenched in BBQ sauce), which is normally okay, except for the fact that their sauce is HORRIBLE.  Take this from a guy who's experienced a lot of barbecue in his time...it's NOT good.  It ruined the pulled pork and beef brisket for me by completely overpowering it; however, the baby back ribs were \"okay\" (read: not fall-off-the-bone).  By the way, the brisket is sliced into very thin strips, which doesn't even make it taste like brisket.  What a waste of 20 bucks...\n\nBut, as a saving grace, the cornbread (which I normally don't like) was probably the best I ever tasted.  Too bad it was the size of a mini-cupcake.\n\nYuck.  Pass."
        }, 
        {
            "index": 173, 
            "rating": 5, 
            "review": "Went in on Sunday. Best the crowd and enjoyed another great meal. They just do it right here. Top 5 BBQ I have ever eaten.  Service, portion, price and quality. Top marks !"
        }, 
        {
            "index": 174, 
            "rating": 5, 
            "review": "I absolutely love TC's and I've been eating here or a few years now. Yes, the service is NO good but the waiters and waitresses are clearly nieces, nephews, etc. of the two owners, and it's no reason to denote any stars considering such small businesses need support from friends, family, and their customers. The meats are always delicious, the mac and cheese is phenomenal, and don't forget to ask about their daily dessert for only a dollar (I'm a fan of the banana pudding). I also like the fried okra. The quarter chicken lunch special with all white meat is only $5.99 and PLENTY of food. Regular lunch specials (entree and side) are $4.99 before 3pm any day and on Tuesdays lunch specials are 2 for 1. Can't beat feeding two people for five bucks anywhere, especially with food like this. If youre feeling adventurous, I also recommend the chicken and waffles. The owners (husband and wife) are wonderful, and if they are there during your visit, don't miss out on a conversation with them. \n\nOverall, this place is small, family run, and delicious. Like I said, there are sometimes hiccups with the wait staff, but you'd be happy you came and would be doing everyone a favor by avoiding Famous Dave's."
        }, 
        {
            "index": 175, 
            "rating": 3, 
            "review": "Man, got the yelp deal and fed me and my gal for the entire meal!  Poor cows!  Got the meat samplers and it was good portions.  We had enough for lunch sandwiches the next day.  The meat was grilled perfectly, tasty, meat came off the bones and had a little grill mark to add that grill flavor.  So why the 3 stars?   The problem is the barbeque sauce.     The barbeque sauce ... tasted like watered down ketchup, and not much of a secret tangy barbeque sauce passed down through generations of southern family home grandma cookin'.\n\nComon guys, get with it!  Improve the barbeque formula!  I'd probably give you a much higher rating.  Service was good."
        }, 
        {
            "index": 176, 
            "rating": 5, 
            "review": "I found this restaurant because of a friend's pictures on Twitter. Went for myself and was happy to find real barbecue in Las Vegas by a mom & pop establishment.  It's not a fancy place; a proper bbq place shouldn't be.  If they're serving your food on fine china they're doing it wrong.\n\nI recommend their Spare ribs, mac n cheese (from scratch) and sweet potato fries. The ribs are well smoked and not over sauced. They fall off the bone and the portions on generous for the price. Pulled pork is also good and the brisket is ok, I'm not a brisket fan to begin with though. If you have a craving for sweet tea this is also the place to go.  It reminds me of the south and its made fresh there daily.\n\nOne day I'll go and not over indulge because the desserts look tasty and they often have them on special."
        }, 
        {
            "index": 177, 
            "rating": 1, 
            "review": "chicken is as dry as can be, they got my order incorrect and REFUSED to fix it or refund my hard earned money. I would HIGHLY recommend NOT eating here. It's the taco bell of southern food and hospitality."
        }, 
        {
            "index": 178, 
            "rating": 2, 
            "review": "Customer service needs to be cleaned up and expediter replaced. I was cautiously optimistic and gently dropped. Sides were good."
        }, 
        {
            "index": 179, 
            "rating": 5, 
            "review": "Best BBQ around!!! They were out of brisket when we went but the spare ribs were a perfect substitute! Make sure to have the bread pudding it's to die for!! Sweet tea is a must also."
        }, 
        {
            "index": 180, 
            "rating": 5, 
            "review": "Great food. Great staff. Baby back ribs are outstanding. Much better then going to the standard chain restaurants. Must try."
        }, 
        {
            "index": 181, 
            "rating": 4, 
            "review": "food was very good and they gave us a lot of food for 2 people dessert was off the hook.... service very nice"
        }, 
        {
            "index": 182, 
            "rating": 4, 
            "review": "As far as southern style BBQ goes, it was 3-3.5 stars.\n\nBefore I get into the review, you know those Yelp deals? They really shouldn't put the % savings because you never really save that much. You always spend more than what the voucher is worth. If you save a dollar, the ad should say you save a dollar, not 50%. It's really misleading. \n\nAnyway, we got the $20 for $10 deal, and ended up spending an extra $27 plus tip. 50% my a$$. We got two combo plates: Full rack of spare ribs plus two sides ($25) and 3-meat plate plus two sides ($20). \n\nThe full rack was 8 or 9 good sized bones. The BBQ was fair meaning not the most tender, flavorful ever but not dry or rubbery either. The sides weren't very good though. The onion rings looked and tasted soggy with oil. The mac n cheese was just so-so. The corn bread was dry and saw-dusty. \n\nThe 3-meat combo consisted of pulled pork, beef rib tips, and brisket. The brisket was a pile of confetti but still tasted okay. The tips and pork weren't bad either. And, the portions were large but not impressive. \n\nThe coleslaw was decent but the foam cup it came in was filled less than full. Why does every place skimp on the slaw? It's just cabbage and watered down mayo!  The sweet potato fries were meh but at least somewhat less oil sogged than the rings. \n\nWe got a squeeze bottle of their house BBQ sauce with our order but resisted the urge to spurge on the loaded bottle because that stuff is loaded with sugar. There were also 4 different brands of hot sauce on the table as well as the usual round of salt, pepper, more sugar and honey. The hot sauces, frankly, all tasted almost identical to me but they added some interest. \n\nAlso interesting were the many black and white photos from Afro-American history displayed on all the walls. The overall deco was quaint and simple with a mild touch of southern charm. The staff was very friendly except for the lady at the front who seemed a bit gruff when we first walked in but eventually got around to smiling later on. \n\nOverall, we had a pleasant experience and the food gets a solid 3 and 3.5 for the BBQ portion. It would've a sure 4 if the sides were better, but the friendly service made up for it."
        }, 
        {
            "index": 183, 
            "rating": 1, 
            "review": "I've been 4 times previous and had a decent experience. My food is always good, but last Thursday the day Prince passed away was the experience I've ever had at any restaurant. The service was HORRIBLE. I walked into the restaurant around 8pm and the waitress asked me was my order for take out or dine in,  I told her Dine in.  She handed me a menu and just looked at me. \"I said OK do I seat myself or do I wait for you to get me a table?\". She told me to seat anywhere.  She comes and takes my order 5 minutes later, and after taking my order she walks to another table and begins talking and hanging out for almost 10 minutes before she puts my order in to the kitchen. I waited almost 25 minutes to get my food. All I ordered was sausage.  When I  the world of cooking has it ever taken anyone 25 minutes to cook 2 sausage links? Mind you that their were only myself and one other customer in the entire establishment. So they definitely wasn't busy. I almost walked out. A guy brought me my food and apologized to me for the wait and told me that the employees were playing around in the back kitchen area. He was a really cool guy. He put on the Warriors game for me and tried to have small talk. While I was eating, my waitress never came and checked on me not once nor refill my water. But she did find the time to come out to talk to one of her friends or daughter.  It was hard to say what the relationship was based on how she was talking heads to her. Her conversation was about going outside to fight. I know she was joking about it though. Anyways, when I was done she never even brought me my receipt.  I had to walk up to the counter to pay my bill and the waitress was ringing me up and she didn't know where my bill was. Smh. ...... Are you kidding me.  She was about to ring me up on someone else's bill. This is what happens when you don't pay attention to your job. When she found my bill, I paid it and I refused to leave a tip. TIP for what? She didn't work for it. This is a family owned business and now i see why its hard to hire family members because they feel like they dont have to work hard or think they'll get a pass because they work for family. Overall, I was disappointed for many reasons.  I really like the food but the bad service makes me not want to come back."
        }, 
        {
            "index": 184, 
            "rating": 5, 
            "review": "I had the BEST mac n' cheese at T.C.'s. I never like to say I had the \"best\" anything, but I honestly think this is the best I have ever had and the best I will ever come across. A few days ago, I went to one of Wolfgang Puck's branches and ordered a side of mac n' cheese, hoping that I would taste something comparable...not even close. The mac and cheese at T.C.'s had a very nice creamy base--not too artery-clooging heavy, but just the right amount of goodness. It also had little pieces of cheese (dried parmesian?) sprinkled throughout, which is why I loved it soooo much. Cheesy tastiness on top of more cheesy tastiness!\n\nI also ordered the pulled pork sandwich, which also did not let me down at all. Very tender and great barbeque sauce."
        }, 
        {
            "index": 185, 
            "rating": 5, 
            "review": "Experience:  I came with a group of folks to try this place out. There were about 10 of us.  \n\nService:  the waitress was pretty friendly, but the star was the one of the owners.  Sharon was a true sweet person that you could tell loved what she does. She made me want to pull up a chair and drink a beer with her. \n\nFood: I'm not sure why so many people said negative things about their food. Maybe I caught them on a good day, maybe they caught them on a bad day, but I really enjoyed the food. \nI ordered the two meat plate with pulled pork and sausage links. My two sides were mac and cheese and potato salad. I liked everything on my plate.  I even tried some ribs off my friends plate and enjoyed those too!!!  \n\nFacility: this place is on the smaller side, but we were able to fit our group in good. \n\nOverall review:  Since I haven't tried too many BBQ places, I have to claim this as my favorite BBQ in Vegas.  Even if I find another place, this will still be one of my fav spots!"
        }, 
        {
            "index": 186, 
            "rating": 4, 
            "review": "Oh my oh my this is delicious. I had a groupon and it was for dine in only but they honored it for take out. SCORE. I had the pulled pork with Cole slaw and potato salad. The pork was tender and they gave enough to fill the styrofoam box. The Cole slaw could of used more sauce cause I like it creamy. The potato salad tasted just like grandma used to make.\n\nMy brother had rib tips and I would call it rib chunks they were huge. And baked beans and Cole slaw as sides. I could smell the BBQ sauce in his beans. And be sure to check out the daily board for special sides. The desserts. I got peach cobbler oh its light and airy and yummly."
        }, 
        {
            "index": 187, 
            "rating": 3, 
            "review": "Overall, TC's was okay. I used the Yelp voucher, which made it okay, as the meal would not have been worth it without the voucher. My wife and I split the three-meat combo and a sandwich. It was good quality -- not the best BBQ I've ever had at a restaurant, but still good -- but definitely less food than I expected for the price. We were told that the three-meat combo alone was enough for two people, but it isn't. They were also out of brisket and rib tips by the time I arrived (6:30 PM), which meant I couldn't even get what I wanted. So...decent food, not worth the price.\n\nThe staff was friendly enough. The only point of contention arose when the Yelp voucher was presented, the terms of which did not specify one voucher per party (I was with a party of 13). The staff was nice enough to allow us to use one voucher per table (we had five tables) anyway."
        }, 
        {
            "index": 188, 
            "rating": 2, 
            "review": "The food was taste good but portions were small and a bit $$.. i m sure there are better deals during lunch, but we stopped in for dinner .. The portion felt like appetizers/snacks.. Even with a restaurant.com coupon we still spend $18 inc tip? It became busy right when we came thru the door, so maybe i should of put more thought in my order, as i wanted to get it in before the big rush/ crowd. The corn bread was nothing to rave about, a handful of sweet potato fries, 1/2 slab baby back- look like a 1/3 slab and a cup of fried okra..And peach cobbler to go .That is all we got, maybe should of gotten full slab no sides.. oh well,  sorry not returning..The staff was pretty good consider they got bombarded with the soccer team and families.."
        }, 
        {
            "index": 189, 
            "rating": 5, 
            "review": "First time here. Got the 3 meat 2 side deal just to try a little of everything. Awesome !!!!. Place is very clean. Service is great. Everyone's nice. Food is out of this world. Can't pick a favorite.  I loved it all"
        }, 
        {
            "index": 190, 
            "rating": 3, 
            "review": "Wanted to love this place!! Annnnnd, didn't. The food was just \"ok\". The people that worked there were nice. Service was super slow even though we were the only ones there at the time. I think the long wait hyped us up even more...thinking it would be delicious. Nope. Just...\"eh\"."
        }, 
        {
            "index": 191, 
            "rating": 5, 
            "review": "Excellent !!! The food  and the service!  We live in Henderson and have been looking for a Great BBQ place and this is it !  Get the fried ribs and potato salad !! The pulled pork is delicious."
        }, 
        {
            "index": 192, 
            "rating": 3, 
            "review": "Gave them another chance since my last review a couple years prior. Yes, we still noticed the lack of BBQ smells in the air outside and especially inside the restaurant.\nLike I said before- don't miss out on their $10 for $20 Yelp deal, or $12 for $20 Groupon deal (why wouldn't you use Yelp!). It makes this place worth it!\nThis time we tried a three meat combo- \nBeef ribs were pretty fatty and meat was a little tough for my preference. My boyfriend, thought it was \"aight.\"\nPulled pork was very tender as pulled pork should be. A little salty, but missing something. Their BBQ sauce did the trick. Very large portion! \nBrisket flavor was the best of all three meats we had. Large portion of this too. \nMac and Cheese was on the blander side on its own- I added pulled pork, some hot sauce & BBQ sauce to it and had myself a delicious pulled pork Mac and cheese.\nCorn bread was not the business. Dry & flavorless. Maybe it needed butter. Was just there for substance than anything. \nWe also had the banana pudding for dinner. Maybe the best thing we had at TC's! I wish I wasn't so full so I could have enjoyed this more. I think I will be stopping by here for banana pudding when my sweet tooth kicks in :-). \nGood service as well- all of the girls who helped wait on us were sweet. \n\nTL;DR- $10 for $20 on Yelp. Get it. Brisket is where it's at. Get banana bread pudding for dessert. Large portions and affordable price."
        }, 
        {
            "index": 193, 
            "rating": 1, 
            "review": "Dear TC's if you are going to advertise an all day CATFISH fry! Then please give me fricken CATFISH unless you just don't know your fish! I drove 15 minutes on an extreme hunger mission to get CATFISH.. Drove back home in the middle of traffic reached to take a bite of my CATFISH but it was SWAI and I HATE SWAI! I am completely disappointed just because you batter it in cornmeal doesn't make it CATFISH!!! Oh and that's legit how many fries I received as well! I am so disappointed should have just went to the soulfood cafe in the first place. Smh \nI called the store and the girl that answered the phone said to me \"I'm sure we get calls like this all the time, so I don't know what to tell you\" so I ask to speak to the manager. I was on hold for literally 5 minutes so then Sharon the manager is arguing with me on how this is catfish and I say well ma'am when is the last time you ate this! And she says oh I don't eat fish. So I said well I'm not trying to argue but you need to know that this is SWAI and not catfish. She says so what do you want a refund! I said yes I would like that. Then she hangs up on me. I call back the girl is laughing and I tell her what happen she hands the phone back to Sharon and I said well ma'am you just hung up on me and she says oh I thought you were done and coming in to get the refund I said no cant you reverse my card she acted clueless I told her I ordered online she says oh you have to get a refund through them. So if I don't get a refund I will be calling the daytime manager."
        }, 
        {
            "index": 194, 
            "rating": 5, 
            "review": "I like going here for lunch and sometimes take my family.  I like the pulled pork, rib tips, and pulled chicken.  The ribs and brisket are decent. \n\nThe sides are tasty...I like the beans, potato salad, mac and cheese, sweet potato fries, and onion rings.  And how can you beat the $1 deserts? You get about a cup of decadence.\n\nI also appreciate that they have Kool-Aid; I have to limit my caffeine intake and this gives me an option besides water or sprite."
        }, 
        {
            "index": 195, 
            "rating": 3, 
            "review": "We were driving around thinking of something to eat and saw TCs was open and we had a restaurant.com certificate. They moved from the last time I visited and are now by Zaytoon market.\n\nWe grabbed a combo to share: \n\nSpare ribs and baby back ribs were two of our choices. I ended up enjoying the spare ribs more as they were much juicier while still having a smoke flavor. It wasn't the best I've had, but they were solid enough. I wanted to try their beef ribs but they were out. \n\nWe got beef sausage as our 3rd meat. This was hot link style and this I enjoyed better than the ribs actually. \n\nSides we got mac n cheese which was just okay, collard greens was a bit too salty, fried jalapeno slices were spicy, crispy and good. They also brought us cornbread with our combo which was good but could have used some butter. I probably should have asked for some\n\nThe lady working the counter was pretty nice and came to check on us a few times for drink refills. \n\nOverall decent, but not my favorite BBQ joint around. I would get the sausage link again though, perhaps as a sandwich.\n\n(Yelp 100 Challenge 8/100)"
        }, 
        {
            "index": 196, 
            "rating": 4, 
            "review": "First time trying this place.\n\nI made an order at 9:40 thinking that they closed at 11 but i made a mistake and they closed at 10. But they still delivered my order and it was just really really good. I was really impressed that they still delivered my order even after they closed. And the food was really really good! Everything tasted great. Next time i have to actually go inside the restaurant and eat."
        }, 
        {
            "index": 197, 
            "rating": 5, 
            "review": "The Ribs are amazing. This is one of my favorite rib places. I've eaten in, gotten orders to go & catering. All were excellent."
        }, 
        {
            "index": 198, 
            "rating": 5, 
            "review": "Very good BBQ, good sides and a very spirited staff. Highly recommend this spot for a little snack!!!!"
        }, 
        {
            "index": 199, 
            "rating": 4, 
            "review": "Good southern bbq. Service is a little slow, but that's southern style :)\nThey also have sweet tea for all the southerners missing home. Great baked mac n cheese."
        }, 
        {
            "index": 200, 
            "rating": 5, 
            "review": "Buffets are played out in Vegas. I never get my money's worth at them anyway since I don't eat very much. \nSon and I chose this place hoping that the food was as good as the Yelp deal....It was!\nSweet group of ladies that work here. They've got that good ol southern hospitality. \nWe walked into the place about 30min before closing. I was expecting to be rushed with ordering by an annoyed waitress because it was close to closing time, but instead was greeted with a welcoming smile. Even tho they weren't rushing us I didn't want to be that be that one that kept them after hours so we quickly placed our order-full slab of ribs, greens, and Mac n Cheese. My son asked if they had spicy BBQ sauce and our sweet, young waitress with that lovely southern accent said \"no but we have Louisiana hot sauce you can add to it, would you like me to mix it in for you?\" My son, \"oh yeah, smart! thanks I can do that :D\" The greens had a lil kick to them, the macncheese was very cheezy the ribs were just a lil dry but the BBQ sauce alone was so good! \nWe were glad we decided to share our meal because it was more than enough for us and all very good. \nWe were wrapping up and still I was expecting them to rush us out, but instead of bringing the check they brought over the dessert menu. We declined since I knew it was about closing time. \nSon and I left with smiles on our face as they thanked us for coming \"thank you ma'am, now you two have a wonderful evening\" \nIm all about customer service so it's an easy 5 for me. I'd come back for that and to try some cake next time. :)"
        }, 
        {
            "index": 201, 
            "rating": 4, 
            "review": "From now until forever every time I go to Vegas I shall visit TC's Rib Crib. So it is written, so it shall be done. \n\nI studied abroad in the South, I have family in the Carolina's, they don't have anything on TC's RIb Crib. Order the half rack of beef ribs, the mac and cheese is so good, the greens are like my grandma's. But they are just so good at dessert. There peach cobbler was literally like sweet heaven in my mouth. Great place for a group, great place for a date but you will get dirty!"
        }, 
        {
            "index": 202, 
            "rating": 4, 
            "review": "I ordered a meal with 1/2 rack of baby back ribs, coleslaw and fried jalapeños. It was all very enjoyable, the ribs were cooked just right and tasted great with their tangy bbq sauce.  Prices were higher than the website menu, so not as great of a value as what I expected."
        }, 
        {
            "index": 203, 
            "rating": 5, 
            "review": "The BBQ sauce at this place is delicious, has a little kick and is a little sweet it is perfect. The pulled chicken is my favorite and they have had candied yams the last few times i had been there which were also amazing. If you are in a hurry call in your order before you get there, takes about 10-15 minutes to get your food."
        }, 
        {
            "index": 204, 
            "rating": 5, 
            "review": "Food Is amazing and the girls are hottt definatly going to come back when I'm in Vegas hell I might stop by before I leave to head back home. Reminds me of Atlanta I miss the good down there. The brisket was sliced super thin and tender the pulled chucked honestly not w huge fan of it but it would be good in between some bread."
        }, 
        {
            "index": 205, 
            "rating": 4, 
            "review": "Excellent ribs and mac 'n cheese.  Alot of food for the price."
        }, 
        {
            "index": 206, 
            "rating": 3, 
            "review": "Ambience: it's a cozy, friendly, family place. We were there on a warm evening 97°, and I was concerned that the air conditioning would be enough to keep us comfortable. When I entered the place it felt a bit warm, but as my group entered into the restaurant it was cooler, and very comfortable inside. I have posted some photos of the interior. I never understand why people who review restaurants don't post photos of what the place looks like inside. Comfortable enough tables and chairs. A divider between tables, giving you a little privacy.\nWe were seated immediately, and waited upon in a courteous and prompt manner. Two different people came to our table a few times to ask if everything was all right.\nWe ordered three different dishes and they were all very good. I had the barbecue chicken and it was excellent. My grandson tore into the baby back ribs, he really loved them! My daughter said the pulled pork sandwich was very good also. \nWe ordered two desserts to go, the red velvet cake, and the lemon cake. My only question was why did the waitress give us the dessert menu and tell us to pick something out. And then when we did, she told us what we chose was sold out and there are only two items left! Which were the two we ended up ordering. I think that's a mistake and lazy service. But I can let it go this one time just hope they don't do it again. \nI don't like eating with plasticware, especially at these prices, but my grandson said, hey grandma, it's a rib place! So it was OK for the nine-year-old.\nFood was served on a regular oval plate, but the sides were served in Styrofoam cups which I thought was weird.\nIf you don't mind a mix of plastic and Styrofoam and real tableware then I guess you're OK with that part. For me the taste of the chicken made up for it, but it was hard to cut with a plastic knife and fork. Even though it was very tender."
        }, 
        {
            "index": 207, 
            "rating": 5, 
            "review": "My name is Ellen and I ate three times at TC's Rib Crib in one week. There's the truth.\nFirst, my friend Larry, who has been urging us to eat here, took me to lunch for the Tuesday specials. We each got a 5.99 sandwich, or \"Sammie, in TC's lingo. The pulled pork and the beef brisket sammies were very good! Baked beans and cole slaw were absolutely the right companion sides. I brought a thinly sliced beef brisket with two sides home for my husband, who had stars in his eyes and exclaimed his happiness with the food.\nOf course I had to bring my husband back and we had a fine meal: my catfish was succulent and big enough for two meals, so I took that, the very flavorful and tender greens, and my cole slaw.\nMy husband ordered the ribs: which he stated, between bites and smiles, were about the best ribs he ever had! \nA couple of days after that my friend who travels a lot was in town for a quick visit.\nFour of us came back to TC's. I opted for the brisket sammie, potato salad and greens. We definitely all enjoyed the service, the food, and the warmest of all welcomes.\nSince moving to Las Vegas in 2015, we had not found a similar barbecue place with good southern comfort foods since Roger's Rib Shack in Northridge, CA.\nNow we are all set! The people here are fabulous and go out of heir way to help with questions.\nYes I wear their red bracelet which says: \"I love TC's\""
        }, 
        {
            "index": 208, 
            "rating": 3, 
            "review": "The brisket was horrible but the sausage and ribs were pretty good. I am not sure what they use for brisket, maybe select meat? I've never had it so stringy and tough before."
        }, 
        {
            "index": 209, 
            "rating": 5, 
            "review": "if you want some excellent Southern cooked BBQ, give TC's Rib Crib a try.  You get a lot of food for a reasonable price.  Before you go to one of the chain type bbq restaurants, give TC's Rib Crib a try!!!!"
        }, 
        {
            "index": 210, 
            "rating": 1, 
            "review": "I am always looking for great barbecue, which is why I was excited when a friend told me about T. C.'s Rib Crib.  The name alone sounded authentic enough.  She said she loves this place because their ribs are oh so fall-off-the-bone good.  I couldn't wait to try it!  A small place, located in a strip mall on the corner of DI and Durango, I thought I was in for some good barbecue, and quite possibly some great ribs!  Upon entering, I noticed a smell...not the smell of sticky/smoky barbecue, but the generic smell of all-purpose cleaner.  No biggie, I thought, at least the place was clean!  I order from the photocopied pink paper menu and was excited to see that they serve Kool-Aid as one of their beverages.  \"Now THAT's authentic!\" I thought.  I was even more excited.  I ordered the full rack of baby backs, an order of brisket, the pulled pork, fried okra, the beans, greens, and donut bread pudding. Hey, I was hungry, and I was planning on taking most of it home!\n\nWhat a disappointment.  The ribs were NOT barbecued.  It had no smoke flavor and no smoke ring.  Ditto on the brisket.  Ditto on the pulled pork.  Yes, all the meat was tender, but tasted like boiled meat slathered in sauce.  The beans were...well, beans.  The greens were almost too salty to eat.  The donut bread pudding was crusty and stale around the edges and tasted like it was a couple days old.  The best thing I had there was the fried okra and the Kool-Aid.\n\nThe employees are cheerfully nice, restrooms were immaculate, and the food was edible but not enjoyable.  I will never willingly go back.  If I am forced, I will just get the fried okra and Kool-Aid.  But don't let my strong opinion stop you from trying it out yourself.  You just might like it there, as my friend does.  But, before you consider going to T. C.'s Rib Crib, I would recommend you consider the following:\n\n-Do you love the flavor and tenderness of meats that have been slowly smoked for hours at low temperatures?  If so, don't go to T. C.'s Rib Crib!\n\n-Do you like your \"barbecue\" to taste like it was made by boiling and/or pressure cooking the meat until tender, slathering barbeque sauce over it, and slapping it on the grill a few times to caramelize the sauce?  If so, by all means go to T. C.'s Rib Crib and have a blast!"
        }, 
        {
            "index": 211, 
            "rating": 2, 
            "review": "Words cannot describe how unsatisfied I was eating here, I had problems with mostly everything I sampled.  The meat, the sides, everything.  I had to throw away a good portion of the meal because I just didn't like it.\n\nI really can't go into detail every single thing that was wrong, none of it was just cooked well.  And I agree with many that it is overpriced considering the quality of the food.  This includes - pulled pork, spare ribs, beans, and the BBQ sauce in general was just all wrong.\n\nOne exception was the beef ribs, and if someone hog tied me and forced me to eat here again this is the only thing I would order.  It's the reason why I'm giving two stars instead of one."
        }, 
        {
            "index": 212, 
            "rating": 2, 
            "review": "The sauce tasted like it came out of a can. The ribs aren't smocked, they are oven cooked and very, very, mediocre. The staff was very friendly, but the food just tasted bland. I love BBQ, but not T.C.'s version."
        }, 
        {
            "index": 213, 
            "rating": 5, 
            "review": "Spare ribs are truly succulent! A full rack is the bomb and would order again and again!"
        }, 
        {
            "index": 214, 
            "rating": 2, 
            "review": "Great deals. Food didn't taste fresh. Kids eat free on Monday. Cheap lunch specials. Didnt like the fact we had to use plastic utensils. Customer service could have been better. Overall its just didnt taste like fresh off the grill BBQ..it wasnt even no  smoke in air or a smell of authentic BBQ."
        }, 
        {
            "index": 215, 
            "rating": 4, 
            "review": "Been to their old location several times for chicken and ribs, mac and cheese, greens, and a peach cobbler for dessert. Never been disappointed. \n\nThe old location was very uilitarian and got business taken care of. They now moved to a new and nicer location with a larger dining room down the street. Went there for the 2-for-1 $4.99 Tuesday lunch special (dine-in only). Since I was alone, I still wanted to take advantage of the deal and ordered the rib tips with fries and chicken leg with mac and cheese. The rib tips were so-so and the fries ordered extra-crispy was done to my preference. The chicken leg was tender and juicy while my favorite side dish, mac and cheese, was done to prefection. The mac was made witha white cheese sauce with the cheddar cheese sprinkled on top and baked to a cripsy golden brown. I am in Mac Heaven here! For $4.99 with leftovers, I can have home cookin' for less than what I would pay at McDs. Will be back for more mac and cheese."
        }, 
        {
            "index": 216, 
            "rating": 5, 
            "review": "I have no complaints - I got the full rack of baby back ribs to share with the hubby and they were amazing.  Tender and juicy.  Loved every bite!  Will be back for sure.  Staff was nice, friendly and amazing!"
        }, 
        {
            "index": 217, 
            "rating": 5, 
            "review": "We came here after getting a deal on Groupon. I was intrigued because I am a Louisiana native & saw that the owner is from Louisiana. We LOVE our BBQ in Louisiana. Because we wanted to try several things, we just ordered the family special to get four meats & three sides with the intention of taking home the leftovers for another meal. We choose brisket, chicken, ribs & rib tips. For sides we chose potato salad, baked beans, & fried okra. You already get French fries with the family deal. The cook came out & asked what kind of ribs we wanted & we ordered baby backs. We were there early & the potato salad wasn't ready yet, so we changed to Mac & cheese. I was also delighted to find sweet tea on the menu. We had almost a whole table of food when our order came. The rib tips were the best I have EVER had! They were meaty & a little crunchy around the edges. The ribs were superb! The chicken was smoky good. Our only complaint was that the brisket was a little chewy for our taste. All of the sides were excellent....the fried okra was to die for. The Mac & cheese was world class! Oh yeah, the potato salad was made while we were eating & the cook sent out a small container to our table. It was exactly to my taste & I am kind if picky about potato salad. I found out the owner is from Baton Rouge & I just happened to be wearing my LSU Tigers sweatshirt. :) The service was good with tea glasses being refilled. We will definitely be back! We have finally found *real* Southern BBQ in Vegas!!!"
        }, 
        {
            "index": 218, 
            "rating": 5, 
            "review": "No complaints here.  Huge plates of good food and you're not waiting all day for it.  Family establishment with their history on the walls.  I refuse to go to Famous Dave's after finding this place.  I recommend a try.  Plus they deliver,  you can't lose."
        }, 
        {
            "index": 219, 
            "rating": 2, 
            "review": "Not the best BBQ/Soul Food in town but it wasn't inedible. I was a bit disappointed with the Brisket but the sweet tea was fabulous! \n\nI personally think they are a bit overpriced for the quality and quantity of food you get and I wish I would've seen the yelp deal BEFORE we ate there!"
        }, 
        {
            "index": 220, 
            "rating": 3, 
            "review": "Kimberly the waitress was nice and helpful when ordering as for the differences in ribs.  As for the ribs I ordered spare ribs and the baby back ribs both were good. For the sides I got fries, onion rings, potato salad, and coleslaw nothing great.  Definitely would go back again"
        }, 
        {
            "index": 221, 
            "rating": 5, 
            "review": "Love, LOVE this place. Came for the first time and I was struck by how family oriented it was and how delicious the food was. The beef ribs were tender, the brisket had an amazing smokey flavor, and he banana pudding reminded me of he Deep South."
        }, 
        {
            "index": 222, 
            "rating": 5, 
            "review": "We visit numerous times and I finally decided to write my review.  Atmosphere is like a small family restaurant,  low-key and relaxed.  As a family of 3 we usually do a 3 combo meal (2 orders of spare ribs and 1 order beef brisket and the 2 sides baked beans and potato salad). Never fails that the spare ribs are always soft and easily fall off the bone.  The meat is so tender and flavorful perfect for me.  My husband and son love sauce and will usually add more barbecue or hot sauce for themselves. The beef brisket is always tender and never chewy where you can't get it down. This usually fills us up,  if we have a bigger appetite we might order more beef brisket or the barbecue chicken.  Sometimes they have special sides like the dirty rice which my family love. We usually visit on Sundays for some barbecue and Ricky is always there to help take care of us."
        }, 
        {
            "index": 223, 
            "rating": 1, 
            "review": "My husband wasted money yesterday on our dinner from here.  The macaroni and cheese was tasteless my grandson wouldn't eat it. The ribs were dry out an the cornbread muffins taste like jiffy.  You really need to go back to the drawing board Barq from the South is so different. Will not recommend. OVER PRICED!!"
        }, 
        {
            "index": 224, 
            "rating": 4, 
            "review": "Cheap and tasty. Greens were kinda too salty for my taste and the sweet tea was way too sweet ask. Kinda had a kick out of the Koolaid flavors: red and blue??? I'm not sure what flavors that they are but the surely know the colors they are serving!"
        }, 
        {
            "index": 225, 
            "rating": 4, 
            "review": "My wife found this restaurant when it was on DI & Durango, and we've loved it since then. We like he new location now, cos it's nicer and cleaner. We have tried every single item from their menu, but babyback rib, sausage and chicken are always our favorite, and have to try their sweet tea, it's just so good.."
        }, 
        {
            "index": 226, 
            "rating": 3, 
            "review": "Eh ... Food was mediocre. All 4 meats in our family pack had a BBQ sauce all over them that none of us cared for. There was no choice of sauce so maybe they should put it on the side. Corn bread was refrigerator cold but then so were the fries. We ordered sweet potato fries but they must have been running low cuz we got half regular fries. Mac and cheese was ok and baked beans just taste canned. If the meal was $20 less I'd say it was ok quality for the price. But for what they charge the food is disappointing."
        }, 
        {
            "index": 227, 
            "rating": 4, 
            "review": "Delicious baby back ribs. Beef brisket was ok. Pulled pork mmm. Half chicken good too. Everything was delicious. Mac and cheese is actually homemade not some boxed crap, must try. Definitely plan on returning. Ordered to go so next time probably eat there."
        }, 
        {
            "index": 228, 
            "rating": 5, 
            "review": "It's like heaven on a bone the Ribs are to die for searched all over Las Vegas for the best ribs since our first visit to TC'S we have stopped searching"
        }, 
        {
            "index": 229, 
            "rating": 2, 
            "review": "The beef brisket was a skirt steak, they used turkey bacon for the turkey in the greens.....it could've been better. The potato salad was good"
        }, 
        {
            "index": 230, 
            "rating": 5, 
            "review": "My wife and kids accompanied me to TC's rib crib for a family outing there and it was the first time any of us have ever eaten there. We were going because a co-worker of my wife suggested it. Please BEWARE though that the address on some of these sites is WRONG and if you go to the OLD location there's nothing there! It took us 15 mins and we had to find that out the hard way.\n\nWe ordered the following:\nMac-n-cheese: GREAT! Their own recipe and it was awesome! It's really hard to find homemade macaroni and they BY FAR have THE BEST! And this is coming from people who have had mac a hundred different ways!\n\nMild Links: I can't remember which MEAT it was, but different meats have different heat factors, chicken being the most mild, so it had to have been pork or beef. Anyway, they were GREAT also as compared to other links from other places. VERY FILLING too!\n\nBeef Brisket: Not the best. The BEST I've had would be at Famous Dave's BBQ. But this place would be 2nd best and I've had it at several places. Very tasty and filling.\n\nBaked Beans: Good, but nothing to write home about.\n\nCornbread: Good, but nothing to write home about. Rather small compared to what other places give you. This was a small sweet muffin style\n\nMini-Burgers: My daughter had this, it looked filling but she still said she was hungry afterwards. Keep in mind she's a very hungry girl.\n\nDonut Style Bread Pudding: The most disappointing of all because it can't REALLY be considered bread pudding. I love bread pudding so I know what GOOD bread pudding is. Famous Dave's has the #1 BEST, Green Valley Ranch Buffet has the 2nd best. This place literally gives you a itty bitty little plastic thing with some weird bread stuff covered in that thick nasty white goo you see on top of honey buns from 7-11. And that's EXACTLY what it tasted like, a 7-11 Honey Bun. What was more disturbing was it was prepackaged and the waitress asked me if I wanted it heated up, meaning it was put in a microwave. NOT GOOD. They should SERIOUSLY not even offer bread pudding if it isn't home made. What a shame.\n\nSweet Tea: Good, one of few places that have it and it was LIPTON sweet tea. Just like I grew up on and make at home. But I would expect an AUTHENTIC soul food restaurant to have something more special. The amount (as far as cup size) was so much that I never needed a refill so that was good too.\n\nOne weird thing to complain about... While my KIDS were there, 2 white bikers came in and sat down to eat and they were cussing really loud the entire time. Usually I wouldn't mind because they are adults and they can do what they want. I even cuss in front of my kids at home and they know THEY aren't allowed to do the same. But the fact that those guys would cuss loudly in a restaurant with kids seemed rude, obnoxious, and ill-mannered. Not the restaurants fault but I didn't see any of the employee's responding to the situation. If I were the owner or manager I would have NICELY reminded them that \"This is a business and a family establishment\" and asked them to please stopp cursing because of the kids."
        }, 
        {
            "index": 231, 
            "rating": 5, 
            "review": "BEST SOUL FOOD!!! This place is amazing! I'm from South Carolina so of course I love bbq and they have the best in Vegas! There's also a groupon 12 dollars worth 24 dollars! The food is amazing I try something new every time and I have never been disappointed. My favorite thing to get there is the muddy water which is sweet tea and lemonade it is to die for here! I also love the Mac and cheese and the bbq pulled pork sandwich! I would recommend to anyone!!"
        }, 
        {
            "index": 232, 
            "rating": 3, 
            "review": "I have eaten at Tc's many times and that alone speaks for itself. I have loved the family atmosphere, the service is great and the food was top knotch, until recently. They say good things don't last and this is where I hope Tc's does not go down that road. I have eaten here since it first opened and wow the pulled pork to the ocra to the mac n' cheese and corn bread, it all was delish. But, the last two visits made me feel like they changed ownership even though they did not. The prices increased -alot, the food was room temp, the service in a fog, and I even had a stint of the big 'D' a few hours later as did the rest of my family. So Tc... Look deep down inside and find the excitement and flare, and love that you used to put in your food and bring it back because this place is on a colission coarse that I can not bear to watch because I have love in my heart from those first few Nawlins' goodness dining experiences."
        }, 
        {
            "index": 233, 
            "rating": 5, 
            "review": "Yum yum yum.  For the price and the quality of food this place is one of my top places to eat when I get a cheat day..."
        }, 
        {
            "index": 234, 
            "rating": 1, 
            "review": "Will not be returning.  My company orders from here twice a week. When we tried to use a Groupon deal, we were turned away, with attitude.  Customer service was horrible,  once the lady got off her phone to see why I was there. Will be Rolling to another place for my bbq."
        }, 
        {
            "index": 235, 
            "rating": 4, 
            "review": "YOU AIN'T GOT SOUL IF YOU DON'T LIKE TC's!  This place is the real deal Soul kitchen.  I had a little of everything, and took to go what I couldn't finish -- and oh baby, that ain't no problem!\n\nI had the baby back ribs, beans, collard greens, mac & cheese (unreal!), and sweet potato pie.  Each was so very good, and at a very fair price.  Excellent service by super nice and friendly gals (special shout out to NicNic and Ducky!).\n\nIt's a casual place in a mini-mall, but with cute and authentic southern decor.  For a west-coast guy, I no longer felt like I was in Vegas, or back in LA where I live -- this transported me...and I loved it.\n\nOh yes, I'll be back, and I'm bringing ziplocs."
        }, 
        {
            "index": 236, 
            "rating": 5, 
            "review": "DELICIOUS. Get the spare ribs, and the chicken wings. Oh and the shinto special is a ton of food. Everything you order will fall off the bone, so good. Also ask for Sam and tell them Jason Lee sent you."
        }, 
        {
            "index": 237, 
            "rating": 3, 
            "review": "Second visit here.   Had the beef ribs both times.    Tender, good barbque sauce (but not enough of it - when I was done eating the waitress said that she shoulda/coulda brought extra sauce).   First time I really enjoyed myself.  Second time I felt gyped - a whole rack of ribs and hardly any meat on them.   The waitress tried to warn me.  She said that sometimes the supplier brought ribs without too much meat and this was one of those days, but I figured how little meat can there be on 8 ribs?  The answer was - about 4 ribs worth of meat on 8 ribs - half of each bone had no meat at all.    And what's with the plastic forks and knives?  The waitresses are very nice and helpful but it didn't make up for the small portions."
        }, 
        {
            "index": 238, 
            "rating": 2, 
            "review": "The infamous TC's rib crib! Not quite, but it's here and there's a deal so let's do it!\n\nSeeing this deal on yelp spend $10 for $20 you think \"hey! What's to lose?\" The answer is flavor and quality. First impressions walking in to a empty restaurant and scoring this deal you automatically think \"what did I get myself into..\" How fresh can they actually keep their food with no customers helping to cycle it out of storage? The ribs were overcooked and tough like rubber, the pulled pork bland and mushy, the links were beyond charred to the point of it crumbling in my mouth leaving a horrible ashy taste. Now to the sides greens are saturated in salt, okra taste pre made well in advance and the Mac n cheese just didn't excite me.\n\nThis place isn't all bad though, our server was a younger guy, very cool to talk to and always was helpful and courteous. I'm not that disappointed since I used this deal, but I highly doubt we will be back. Sad but looks like this place is on their last leg, maybe time for a new venture?"
        }, 
        {
            "index": 239, 
            "rating": 1, 
            "review": "We went to this place today order food to go we order the family platter feast came with 4 meats and 4 sides I order a slab of beef ribs and catfish dinner OMG!! What in the world is this it the worst BBQ we ever had and my boys eat anything. The pork ribs was boiled then grill mark with a George Forman grill  with poor quality spare ribs that was all fat wow .and the chicken was not fresh smell and taste spoiled you can tell they made it days ago and put it in the microwave to reheat it on top of that they put my thin slice so call beef brisket next to my spoiled chicken and the liquid from the chicken spreadedover to the thin slice roast beef (brisket) and made that taste spoil nasty I had to throw both of them away. If I didn't live so far from this place I would have drove back and got my money back plus my five dollar tip I gave. The beef ribs was so rubbery it snap back like a rubber band when i bit into it.very very disappointed.and there goes the sides wow the bake beans only thing was decent you could tell they made it from pork n beans and some molasses and BBQ sauce to give it a nicer taste.the greens oh!!! No\" I'm from the south and I never taste greens so sweet it had a hint of sugar in it wow who does that,and the mac n cheese so over cook and glumpy .the yams was over cook and so sweet u could barely eat it but my 8yr son ate it and i swear within 3mins after he ate it he shot to the bathroom to relieve what ran through him. Corn bread was bland and dry potato salad way to much miracle whip in it and the potatoes was slightly hard ,cold slaw was ok and the two dessert we got was the lemon cake and the Carmel cake I told my wife it was room temperature stuck in a see through glass case with no temperature gauge on it when she put it in the bag the frosting was all over the paper plate.so ppl who coming far away to eat at this place please take time to review other comments to see if it worth it trust me you won't be happy if you eat here beware what you eat real talk a good BBQ place has a smoker or a grill in the back this one doesn't u do the math. I highly recommend this place for ppl who don't like good quality,and good tasting food. Mark my words."
        }, 
        {
            "index": 240, 
            "rating": 4, 
            "review": "I enjoyed the BBQ here. A little charred on the edges but it was just the way I like it. \n\nLots of youngsters working the store. I don't think I saw anyone older than 25 working but that is not to say that the service wasn't good. It really says a lot to the kid's credit. The owner must feel very confident to leave them all in charge. \n\nEverything I had was very good. Not the best I've ever had but I'm married to a man who looks at ribs and cooking them like science. Like I said. I enjoyed everything about my meal and I will be back when I'm in the mood for some Que."
        }, 
        {
            "index": 241, 
            "rating": 2, 
            "review": "My friend and I came in here tonight (me for the first time, she had been there before). The first time she went she said the food was great, ribs were cooked perfectly and the sides were delicious. Tonight, she ordered the ribs, Mac n cheese, sweet potato fries and the peach cobbler. It was $30 and some change. I ordered just a \"better than sex\" cake because I had eaten previously. We got home and I found my cake absolutely delicious. It was perfectly sweet, the whipped cream frosting was great combined with the pecans on top of the pineapple upside down cake. They used chunks of pineapple, not rings, which I liked a lot. The reason why this is 2 stars is because of her food (I would have given it a 5). The ribs were burnt and didn't have much meat, her Mac n cheese was bland and her peach cobbler wasn't very tasty, I didn't taste any of it, this is her review of her food. The sweet potato fries were good.  I don't know if she'll return but I'll hands down come back for the cake or to try the other ones they have."
        }, 
        {
            "index": 242, 
            "rating": 5, 
            "review": "Some of the best ribs in town. Better than Lucille's and Famous Dave's. Get the spare ribs and ask for extra BBQ sauce."
        }, 
        {
            "index": 243, 
            "rating": 1, 
            "review": "Contrary to the stock photo they use for their groupon, nothing here looked appetizing, and nothing here tasted appetizing.\n\nI wish I had a crystal ball to know for certain, but the ribs and brisket I got looked to be recently heated up and/or packaged at some point. The brisket had a oozing puddle of that red-orange grease you may see when you reheat fatty or greasy pieces of meat, like next day breakfast sausage and/or bacon. \n\nThe ribs were so dark and over charred. As stated earlier they too looked like a old batch from the previous day. They weren't tender by a long shot.\n\nThe only comment of flavor I can give towards them was that neither had flavor and both had to be drowned in BBQ sauce. The overly sweet sauce that could have easily been out the bottle with a couple extra seasonings mixed in. \n\nThe mac and cheese and cole-slaw I got as my sides were so generic and unremarkable. It was recommended by my server  to get their peach cobbler to round out my groupon. Straight out the can peaches with too much cinnamon. At least I could tell the crust used was home made. Dry, non flaky or buttery crust, but homemade.\n\nThis place gets the prize for my worst groupon purchase to date. I wouldn't recommended or come back to this place, even with another groupon."
        }, 
        {
            "index": 244, 
            "rating": 5, 
            "review": "Amazing Brisket and Bread pudding. Service was fantastic although I had a little hard time finding the place as it is in a strip mall. Great find in a rather bleak area in the way of decent home-owned establishments."
        }, 
        {
            "index": 245, 
            "rating": 3, 
            "review": "I usually get the pulled pork sammie. Lunch specials under 5 bucks and on Tuesdays buy one guy one free.  Best bang for your buck. Banana bread pudding is good."
        }, 
        {
            "index": 246, 
            "rating": 4, 
            "review": "Found this place on Yelp, figured we would try today after Church. Had the Pulled Pork, rib tips, potato salad and greens. Plus sweet tea, others had the pulled pork Sammie's. We loves this place, better than Famous Dave & Dickies!"
        }, 
        {
            "index": 247, 
            "rating": 5, 
            "review": "I've been coming here for 10+ years.  Cozy clean atmosphere and the service is excellent.  Breakfast is just on the weekends but its worth the wait.  The 3 meat omlete is priceless, comes with real grits and a biscuit.  You have to drink the muddy water and dessert after breakfast is a \"better than sex cake\". BON APPETITE!!!!   Have never had a bad meal and the service has been above superb every visit."
        }, 
        {
            "index": 248, 
            "rating": 4, 
            "review": "Very good BBQ chicken, OUT OF THIS WORLD mac and cheese."
        }, 
        {
            "index": 249, 
            "rating": 3, 
            "review": "One thing that does really irritate me about TC's is that it's phone is busy so often.  They don't seem to have a system to take multiple calls at once.  I even had the phone company ring me when the line was open and still waiting after one hour.  Weird."
        }, 
        {
            "index": 250, 
            "rating": 5, 
            "review": "I don't think I have been to a better restaurant in the area -- the staff was SO helpful, generous and gracious; a business strength paralleled ONLY by how PHENOMENAL the down-home cookin' was, in perfect accordance with their purported style of cuisine.  I feel very lucky we found this Yelp deal and will absolutely return!!"
        }, 
        {
            "index": 251, 
            "rating": 1, 
            "review": "Food was terrible and very overpriced. I should have known to leave when i walked in and I could not smell a hint of barbecue smoke. WILL NEVER RETURN!"
        }, 
        {
            "index": 252, 
            "rating": 5, 
            "review": "I've eaten ribs all across 'America and TC's are among the finest I've ever had.  The owner Joe is a transplanted Louisiana guy and his glaze is spectacularly good.  I had the spare ribs and the beef ribs and they were both succulent and the portions were gigantic.  The sides, mac and cheese and collard greens were amazing.  Even the corn muffin was splendid.  TC's is head and shoulders over any rib joint in the Las Vegas area.  I only wish I could entice Joe to move his operation to New York!"
        }, 
        {
            "index": 253, 
            "rating": 1, 
            "review": "Items Ordered:\nSliced Brisket, Pulled Pork, Spare Ribs, Cornbread\nMac n' Cheese\nSweet Potato Fries\nBiscuit\n\"New Orleans\" French Toast with Sliced Bananas\nBanana Pudding\nRed Velvet Cake\nPraline\n\nLocated near Norm's Eggs Café in a strip mall off South Durango and featuring \"World Famous\" ribs with awards in 2007 and 2010 for the city's best barbeque it was with tempered expectations that I entered TC's Rib Crib and although I will say the Motown soundtrack and service were quite pleasant as I watched the Buckeyes obliterate Kent State, little else of my experience was even remotely good - a small, buttery biscuit and a jumbo praline the lone exception.  Obviously the sort of place willing to cut corners as condiments include Aunt Jemima and 'honey' cut with glucose syrup and starch it was in a wide selection of meats, sides, and sweets that I invested and although costs were quite low for most items, so too was the quality - the ribs clearly parboiled without a note of smoke while thinly sliced brisket and pulled pork were nearly indistinguishable beneath artificially saccharine sauce.  Mostly ignoring bland elbow noodles from which I consumed only a few bites and fries that arrived almost at meal's end as well as the $4.50 French Toast was flat and flavorless even with the $1.50 banana and whipped cream upgrade...the latter not supplied as they were apparently 'out'...and moving on to dessert, suffice it to say that the boxed vanilla pudding with only a hint of banana beneath 'nilla wafers is not worth $5.99 and although the frosting on a tiny sliver of red velvet cake was tangy and smooth the cake was so dry it literally crumbled to fork pressure - the majority of it joining nearly half the rest of my order in a waste basket when servers were otherwise occupied so as not to offend.\n\nLiterally the only patron present just past noon on a Saturday it is shocking to me that a business like TC's can sustain and as much as I try to support locals I cannot fathom a reason to return, particularly given a pricepoint higher than Rollin' Smoke despite quality on par with Famous Dave's."
        }, 
        {
            "index": 254, 
            "rating": 1, 
            "review": "Went today to order wings and fries for 8.99 (12 wings and about 10 little fries) \nover cooked dried out nasty food....the fries weren't even a handful. I tried to chat up a confo and be cool.but that lady at the counter has NO Customer Service Skills at all. The cooks suck. and I just took my money back,and never ever will be back. At first I thought okay word of mouth is everything,but after paying,and receiving my food with a no smile attitude woman forget it!!!!\nI hope you go down!!!!"
        }, 
        {
            "index": 255, 
            "rating": 5, 
            "review": "we LOVE this restuarant. it is easy to place a to-go order , amazing staff who are always eager to make sure order is correct and the quality is superb every time. they have specials and run ads regularly. the most recent one i saw was on the back of my Albertson's receipt. how cool is that?? it was for a buy one , get one free deal on a BBQ sandwich. what really touched my heart is : they never , ever gave me attitude when i present them with a coupon. many vendors will either give me a nasty look , or, worse terrible attitude as they ring up the coupon . some will even give me a sad story about how business is slow, blah, blah.. really?? but, not TC's. once, around the holidays, i had the priviledge of meeting one of the owners . he was actually filling all the holiday orders himself and talking to customers. please go and visit this local eatery. they have amazing food, great portions, laid back atmosphere, and of course unheard of prices!! truly southern hospitality right here in Vegas!!!"
        }, 
        {
            "index": 256, 
            "rating": 1, 
            "review": "Probably one of the nastiest places I've ever eaten food from. The table was sticky when we sat down just to be followed by gross salt and pepper shakers and sticky walls and chairs. It seems as if cleaning the restaurant is not apart of their daily routine. The place was cluttered and had a bunch of unnecessary things everywhere. The food came all packaged as if it was sitting there all day. The Mac and cheese wasn't warmed up or anything. Luckily we used a coupon, because I would feel robbed if not. I wouldn't recommend this place at all unless you're comfortable eating off someone else's sticky mess."
        }, 
        {
            "index": 257, 
            "rating": 4, 
            "review": "First I would like to say that I love the food. It reminds me of the food I was eating when I was growing up in Tennessee. Second... I ordered a meal to be delivered and it arrive before the estimated time I was quoted and that was awesome but the driver forgot my dessert. I call up to TC's and the woman who answered the phone let me know that a 3rd party service handles the deliveries. I told her I lived nearby and I could come pick up the dessert. She apologized and said no I will bring it to you and she did.  Excellent customer service every time and she went out of her way to  take care of me and my family! Way to go!!!\nBy the way the Bread Pudding's are the bomb!!!"
        }, 
        {
            "index": 258, 
            "rating": 2, 
            "review": "The food was good but overpriced for what you get. The service was not good either. We sat at a dirty table. When the waitress came to take our order we asked if she could clean the table. She looked confused and told us she taught it was our mess. I showed her the last party's check was still there and she still looked dazed. Not sure what was wrong with the waitress. Maybe it was supposed to be part of the theme."
        }, 
        {
            "index": 259, 
            "rating": 5, 
            "review": "We have eaten at TCs several times, at least once each time we visit Vegas.  The ribs are tender and flavorful and the greens are the best I've had anywhere!"
        }, 
        {
            "index": 260, 
            "rating": 1, 
            "review": "It's been a long time since I gave a negative review, but this place was terrible and has been getting worse over the years. The ribs and brisket were incredibly dry, seemed like it had sat around for a few days, very salty, and quite inedible. Love to support small biz, but Seemed to be It's clear restaurant doesn't really care about quality or taste, worse than grocery store bbq. Yuk."
        }, 
        {
            "index": 261, 
            "rating": 4, 
            "review": "We had the beef ribs and 2 meat combo platter. Really Friendly fast service and food was great. Will def go again and try the catfish!"
        }, 
        {
            "index": 262, 
            "rating": 5, 
            "review": "Great food! Great service! Great place!!! Huge ribs, generous portions, mouth watering sauce. Best bbq joint in town!"
        }, 
        {
            "index": 263, 
            "rating": 1, 
            "review": "Had all you can eat \"baby back ribs\" and was very disappointed in the ribs and them being very over-priced.  I have never had such lousy ribs in my life, no meat on the bone, and what little meat that was there was burnt to a crisp and dried out.  These \"baby back ribs\" did not even look like a normal rib would look.  I have dines at the \nRib Crib before and it seems like the quality of their food has really gone downhill.  I will never go there again and do not recommend this place to anyone."
        }, 
        {
            "index": 264, 
            "rating": 4, 
            "review": "Not big on BBQ at all but my beau is. He was craving rib tips and asked me to help find a spot. Of course, Yelp is my go to for finding new hidden gems. I must say for me to not be a big fan of BBQ I was highly impressed! They had a Yelp deal that I couldn't say no to. The portions are extremely plentiful! We also enjoyed the Mac n cheese it's a must try. They had their banana pudding on sale and that was the only disappointment. The wafers tasted soggy and it had to be consumed by end of day so that explains the $1 pudding. Other than that this place is great!"
        }, 
        {
            "index": 265, 
            "rating": 4, 
            "review": "This place has great food! We've tried the pulled pork and beef brisket sandwich with sweet potato fried and wedge fries and lemon cake for dessert. They play R&B music and there are plenty of soul food choices to choose from. The service however was slow, but overall, the place had a friendly atmosphere."
        }, 
        {
            "index": 266, 
            "rating": 4, 
            "review": "Definitely the best place for Baby Back Ribs that I've found in Las Vegas (and I am super picky about my ribs)! I've taken my sister and brother there (both live in California, and they agree that the food is absolutely delicious! The sweet potato fries and fried okra are pretty tasty too. My husband likes the pulled pork sandwich and the banana pudding. The food definitely deserves 5 stars, but I'm docking 1 star because I've noticed that if you bring in a Groupon, you don't get the best cut of ribs. You will get the undesirable, charred end-pieces. So if you want fall-off-the-bone tender, juicy ribs, be prepared to pay full price (which I don't mind doing). I just wish there was a closer location to my home...lol..."
        }, 
        {
            "index": 267, 
            "rating": 1, 
            "review": "Really crappy food !!!!The mac & cheese was completely dried out just a big lump of crap,the coleslaw was like kitty liter and the links were no more than hot dogs I mean a hot dog would taste better,they were split down the middle,whta a sorry way to serve links the sauce that was on them must have come from. an auto body shop oh yea the peach cobbler was probably left over K- rations from the ww1 and also everything was cold and stale"
        }, 
        {
            "index": 268, 
            "rating": 4, 
            "review": "If you like old school neighborhood barbecue joints, this is the place for you. They have weekly specials that are actually worth the money. My husband and I have never waited long, if at all for a table and our service has always been exemplary. This may seem petty but, the only reason I didn't give a 5 star review is because of the dollar store honey. It wasn't real honey and I'm a bit of a princess when it comes to honey on my cornbread."
        }, 
        {
            "index": 269, 
            "rating": 4, 
            "review": "Food was definitely tasty. I tried the baby back ribs, links, pulled pork, and brisket. Sides tried- yams, greens, green beans, and mac and cheese (I wanted to try a lot of it!) I'll say I definitely enjoyed the brisket and the links. The ribs my friend thought was good but I thought they were just okay. Enjoyed all of the sides and their cornbread. The BTS cake was moist but I was expecting more of a sock it to me cake so I didn't care for it. Overall the food was pretty good and I definitely would go back to try it again to hopefully try out breakfast and get the peach cobbler to try!"
        }, 
        {
            "index": 270, 
            "rating": 4, 
            "review": "I'm a fan of TC's Rib Crib. If you are looking for good home cooked comfort food, this is the place for you. They are in their new location now which is bigger and better. The food is always good. \n\nI also love this place because it is a small business and the people who own it are some of the nicest people I know. They are really commited to the community and doing their part. You have to love that."
        }, 
        {
            "index": 271, 
            "rating": 3, 
            "review": "Stayed in Las Vegas for the weekend and decided to order delivery to our hotel.  You have to order through Road Runner, a 3rd party delivery service.  \n\n[Even though we called T.C.'s and they ok'd our $10 for $20 certificate for delivery, Road Runner said there was no way they could accept it unless T.C.'s had the coupon physically there...wha???  At least the gal who answered the phones at T.C.'s was very cordial and patient with us]\n\nBack to the food. \n\nWe ordered pulled pork with 2 sides and cornbread.  The pulled pork was disappointing.  Not good quality meat.  Flavors not amusing.  The cornbread, though it was a single corn muffin, was good, moist, and fluffy.  \n\nThe 2 sides were greens and sweet potato fries.  The greens were the best thing in the entire order.  Not soggy, flavorful, cooked with bacon and spiced.  The sweet potato fries actually were soggy, limp, and therefore unappetizing.  \n\nWe also ordered a meatless platter which includes your choice of 3 sides.  We doubled up on the greens, luckily.  We ordered baked beans, which were yummy, and mac n' cheese which was alright except for the piece of paper I bit in to....wow.  \n\nFor dessert we had the peach cobbler, which was so bad, we decided as soon as we return home, to make one ourselves as a redemption.  It was made with canned peaches, and the cobbler part was a cinnamon and flour mass that was undercooked.  Made my tummy hurt. \n\nThe amount of food could've fed 3 people comfortably.  Well, splitting one corn muffin might have been uncomfortable.  If I were to eat from there again, I'd want to go in person to see how clean the restaurant is.  I understand accidents happen, but they left a paper trail!"
        }, 
        {
            "index": 272, 
            "rating": 3, 
            "review": "I order the ribs with 2 sides just like my wife she got potato salad and fries and i picked mac and cheese and coleslaw, none of the sides were memorable and my wife mentioned me that her fries tasted like fish something she really dislikes because it means they are probably frying everything on the same oil without changing it. The ribs were a little bit dry so in general it was just ok"
        }, 
        {
            "index": 273, 
            "rating": 1, 
            "review": "This place is not customer oriented.  The short heavy lady in the front is rude and have a poor customer service attitude.  I highly don't recommend this place."
        }, 
        {
            "index": 274, 
            "rating": 5, 
            "review": "We love this place. The food is very good and the staff is friendly. We've had the ribs, pulled pork, beef ribs, sausage and various sides. It's all good. Be sure to try the banana pudding!"
        }, 
        {
            "index": 275, 
            "rating": 4, 
            "review": "Go for lunch and do takeout. We went for dinner with a group of 9 and it was really cramped. The food was all awesome except for the beef tips (bleh!) which they took back and gave us more pulled pork-yum!  We actually found this place from a LV area magazine that did an article on delicious, reasonable food. It ended up being about $10 per person, not even close to the $5 deal that the magazine said could be had. We didn't even have soda or tea, but don't skip dessert here- the red velvet cake and buttermilk pie are to die for!"
        }, 
        {
            "index": 276, 
            "rating": 3, 
            "review": "Food was good. The cook brought us out the food after waiting for about 30 min for 2 meals. He refilled our drinks also because after the waitress( younger African American woman) took our order she Never once came back to inquire about drinks or food.  And we were the only couple of people there. Not sure if it was because i told her we were using a Groupon or not. But when i asked questions about how something on menu tasted, she replied \"like its supposed to taste\". \nOverall staff needs to be trained if you want customers to come back."
        }, 
        {
            "index": 277, 
            "rating": 3, 
            "review": "So after going to  Famous Dave's and eating their atrocious BBQ, I thought I'd try to find another spot, local or chain, that had better things to offer.  Most of the reviews were decent on TC's so I figured it was close enough to work to go check it out.\n\nI took some co-workers to go with.\n\nI had the 3 meat platter with chicken (dark meat), pulled pork and baby back ribs.  Side of slaw and mac and cheese.\n\nPulled pork was great, so was the chicken. \n\nRibs were greatly lacking, and since their name is \"Rib Crib\", I expected better.  They were a bit tough to start with and didn't just tear apart with ease like you'd expect.  The flavor was great until I had some charred meat from the underside of the ribs where they obviously reheated on a grill.  All I could taste was burnt charcoal.\n\nMac and cheese had decent flavor and it was nice to have it super cheesy but it was incredibly greasy, so that's the drawback of that side.\n\nSlaw was typical slaw, nothing to write home about.\n\nTwo people at the table had pulled pork sandwiches and they loved those.  Another person had rib tips and actually really enjoyed those but he said they weren't the best he's had by far.  The last person at the table also had the 3 meat combo and had rib tips, baby backs and brisket.\n\nHe said he wasn't a fan of the brisket, the rib tips decent, but the most awful part of his meal were the baby backs.  They ended up being tougher than mine, harder to eat and very dry.  Also had the nasty blacked char on one side.\n\nHe did in fact love his sides, dirty rice and baked beans.\n\nOtherwise the service was great, super friendly and very attentive.  Refills on drinks overflowed and it definitely made up for the quality of SOME of the food.  I'd definitely go back but not for ribs, and that's the most disappointing part.\n\nI bought the Yelp deal, the 10 for 20 dollar deal.  If it's available, get it yourself and then try the 3 meat combo yourself.  Definitely the way to go if you want to sample all the choices since it's roughly 17.99 on it's own.  So you end up saving money!"
        }, 
        {
            "index": 278, 
            "rating": 3, 
            "review": "\"TC says, the best way to a person's heart, is through the ribs.\"\n\nI LOVE that quote and love that it's written on the bottom of your receipt. I wouldn't know whether or not the ribs would take my heart, but I do know that the pulled pork sammie was pretty delish. \n\nI originally went because of The Desert Companion's \"DEALicious meals\" article. In it it said there was a $4.99 lunch special: a Jr. Sammie and a side, can't beat that! SO off I went, walking distance from my work, and FINALLY decided to try this \"World Famous\" BBQ.\n\nWhen I walked into this establishment on a lovely Saturday afternoon I realized, UGH! Lunch specials are only for Monday-Friday. Oh well, I'm already here and the tiny little restaurant is very homey, sporting pictures of, what I hope is, TC's family. This sort of establishment always makes me want to come back to support, especially with the really friendly staff they have on hand.\n\nI ordered, as I mentioned before, the Pulled Pork Sammie with ....deep fried jalapenos! Whoo-wee. I don't even like jalapenos, but I just HAD to try these.\n\nMy fellow diner ordered the brisket sammie and the sweet potato fries that everyone raves about.\n\nWe had them both \"home style,\" which meant it had some really good slaw on top.\nThe verdict:\nMy sammie: s'mazin'. I really enjoyed the sandwich and wouldn't mind coming back for the lunch meal and ordering the Jr. as this sammie is pretty filling.\n\nThe OTHER sammie: Not nearly as good as mine, it was a little tougher and less flavorful. \n\nI wouldn't have the sammies without the slaw, I believe it cost an extra 50 cents, but it's worth it.\n\nThe jalapenos: These little babies were pretty darn good. I wouldn't order them again though, jalapenos just aren't my thing.\n\nSweet potato fries: Ok, what's up with these? Everyone LOVES them....I think they tasted like straight oil and were a little under cooked, and old. Poo.\n\nOver all, it was A-OK. I would totally return for the lunch menu...but that's probably it...Oh and to try the ribs....with a name like The Rib Crib...you just gotta try them...."
        }, 
        {
            "index": 279, 
            "rating": 1, 
            "review": "Went there last night theyve really gone down hill spent over 70 bucks for 3 dinners not worth it at all! I got the 2 meat plate all spare ribs they were burnt and old tasting i asked for extra side of mac & cheese didnt get it... This use to be a really good place I never had a complaint but they have really really gone down hill I wont be going there anymore and whats really sad is I took a first timer there with me with a lot of hype for the place not only was I disappointed but embarrassed to..."
        }, 
        {
            "index": 280, 
            "rating": 4, 
            "review": "This was my first visit for dinner on a Monday night using a restaurant.com coupon.\nThey were located on S Durango/Spring Mountain Rd in Las Vegas.  They were hidden in a strip mall.\n\nWe sat in a booth and shared the Full Slab of Baby Back Ribs with a side of Sweet Potato Tater Tots and Cole Slaw.  There were 10 tender ribs with plenty of sauce on them.  The Sweet Potato Tater Tots were hot and crispy.  The Cole Slaw was slightly sweet but a little watery.  Everything was very good and I would order them again.\n\nService was friendly and attentive.  We will be back."
        }, 
        {
            "index": 281, 
            "rating": 1, 
            "review": "We found out about this place when Groupon offered a $14 credit for $7.  We like BBQ and the place is pretty close to home.  Well the service was slow slow slow, the order was wrong on the first few attempts by the two young servers who apparently were not communicating with each other, and when we finally got all the overpriced food we ordered, it was mediocre to bad.\n\nThe final insult was when the 16-year-old girl running the place ripped us off.  She refused to accept the full amount of our $14 Groupon, claiming that because we had ordered one of the \"daily specials\", that she could only give us a $10 credit instead of the full $14 face amount.  Apparently she was well-trained at a young age to steal form the customers, because when I objected and tried to explain to her that she was violating the Groupon policy by not honoring the full amount of the Groupon,  she claimed that's how she did it for \"all Groupon customers\".  I guess I was the first one to speak up.\n\nI asked to talk to the owner, but the girl said that she could not reach him.  So we took back the $4 tip we were going to leave and broke even, but left with a bad taste in our mouths, both literally and figuratively!\n\nOur suggestion:  DO NOT EVEN THINK ABOUT EATING AT THIS AWFUL PLACE!!!  Head to Famous Dave's BBQ instead-- cheaper, with much better food, service, and atmosphere!"
        }, 
        {
            "index": 282, 
            "rating": 5, 
            "review": "Outstanding BBQ. Ribs, pulled pork, pulled chicken sausage, brisket - greens, candied yams - unbelievably good. Banana pudding for dessert - great. Out server Ricky did an outstanding job as well. Even the Kool aid was great!"
        }, 
        {
            "index": 283, 
            "rating": 4, 
            "review": "Just went to TC rib crib for the first time, and didn't think about getting the voucher, oh well!!! I thought the price was reasonable, we ordered the family platter, and you get so much  food for 45 could easily feed 4-5 people maybe even six. The sweet ice tea is really sweet, and you can tell its homemade, so it tasted that much better to me. My husband liked his brisket thinly sliced so it's a matter of preference, their brisket is sliced thin.  The service staff was friendly and perfect. I probably won't come in the restaurant to eat again, but I will definitely order for pick up because all that food you really need to lay down or kick back on a couch. We tried the pork links, baby back ribs, pulled pork and BBQ brisket with sides of fried okra, macaroni and cheese, SAMs baked beans and collard greens and the meal also came with 4 corn breads which were soft and\nMoist... I saw a review that said they were\nDry and I didn't think the corn muffins were dry at all, it could of been just one of\nThose off  days but I felt all food was homemade.... We have a lot of left overs, and I will be getting this again and when I have family or friends over this would be great dish to bring home for some grub.. Especially for Those who like eating BBQ and BBQ sauce on there food."
        }, 
        {
            "index": 284, 
            "rating": 2, 
            "review": "Food was good, but man server #1 was an 20 something stuck up snot. There was only one couple in the place except me. She brought food, dropped and ran.  No butter for the cornbread and no BBQ sauce for the 1/2 rack i just ordered. Never came back to check on me. \nServer #2 with the tats and nose piercing saved this from being a one star review. She saw I was being ignored and went out of her way to be helpful even though I wasn't her customer. She was happy, and friendly.  Had I gotten that server at the start, this would get at least 4 stars.\nTreat me right server #1. At least act like you want  your job"
        }, 
        {
            "index": 285, 
            "rating": 5, 
            "review": "My first time here I was undecided and was scared that my food would be nasty, but the gentleman at the counter reassured me that I would most definitely enjoy my food he even gave me a free sample. My order consisted of fried catfish, greens, yams, and banana pudding and I enjoyed every bit of it !! As soon as I was done eating I called the place to say thank you and to let them know they definitely won my business. I'll be getting some more after school today !"
        }, 
        {
            "index": 286, 
            "rating": 5, 
            "review": "How I miss TC Rib Crib! Love the man n cheese and greens. We have yet to find any place in Northern California that is even close to this place. Next time we are in Vegas we will be stopping by."
        }, 
        {
            "index": 287, 
            "rating": 5, 
            "review": "You know food is good, when you're crazy stuffed, and can't stop eating...I'M GONNA EXPLODE!!!!!"
        }, 
        {
            "index": 288, 
            "rating": 5, 
            "review": "Wow\nSo so good\nReal bbq food and large portions \nFriendly staff\nWe had beef ribs, pulled pork,brisket,rib tips,Mac and cheese, beans,Sweet potatoes,corn bread,potato salad, and drink called mud slide it's ice tea and lemonade \nAll good\nPersonally liked the beef ribs and brisket the best.\nGo there..."
        }, 
        {
            "index": 289, 
            "rating": 1, 
            "review": "Can't believe they don't even acknowledge that we are good customers that order from them at least once a week. Will not be returning to this joint anymore. Rolling smoke will be our spot from now on. Even \nIf it's a longer drive."
        }, 
        {
            "index": 290, 
            "rating": 5, 
            "review": "The beef ribs are the best - tender juicy And meaty. We also tried the pork ribs and the BBQ chicken.  The pork ribs are also to die for and the chicken was good. I highly recommend the fried okra and the banana pudding. We loved the food so much we went back the next day. The restaurant is clean and well kept. The service was a bit slow and scattered but the food was worth it.\n\n5 stars without any reservations."
        }, 
        {
            "index": 291, 
            "rating": 1, 
            "review": "Came here after purchasing a Groupon. Place was almost empty on a Saturday night and was excited to try the food after seeing the menu. Unfortunately I didnt want to have all night for one of the two teenage girls to ever come take our order. After being ignored for 15+ minutes with not even drinks ordered we left and again were ignored by the two workers talking to each other at the counter and looking at one of their phones.  So I wish I could rate the food but at the rate service was progressing I didn't have five hours to wait around."
        }, 
        {
            "index": 292, 
            "rating": 3, 
            "review": "This is my favorite rib spot in Vegas but I have to rate it 3 stars because it's not consistently good. I'll have to say that every time I sit down in house and eat the food is good. But I have ordered to go about 10 times and 7 of the ten the rib tips have been hard not sure why but this is definitely a concern. I usually order the baked beans potato salad and greens as sides which I like all except the greens which I don't care for the seasoning."
        }, 
        {
            "index": 293, 
            "rating": 5, 
            "review": "Love this place. I've been here many times and the food is always good. Great baby back ribs, greens are bomb and mac n cheese is insane."
        }, 
        {
            "index": 294, 
            "rating": 3, 
            "review": "Portions are a bit small.\nBrisket sandwich was good , as were the fries.\nMacaroni was terrible and rather flavorless.\nSweet tea was extremely sweet and dessert was rather meh.\nNot my fave."
        }, 
        {
            "index": 295, 
            "rating": 3, 
            "review": "IT's is good soul food. Greens and potato salad is great. I had the fried catfish. Honestly it was not cooked too well. Batter was good, too crispy, and the inside was complete mush. The fried ribs were excellent. Oh I always get the grape Kool Aid."
        }, 
        {
            "index": 296, 
            "rating": 5, 
            "review": "OMG!!! delectible!!! bbq just melt in ur mouth! to die 4!!!  banana puddin like my nana used to make!!!"
        }, 
        {
            "index": 297, 
            "rating": 4, 
            "review": "I went to the rib crib based on reviews my brother-in-law acquired in the bay area.  I must go at the right time because I have not been disappointed.  I loved the ribs, the sauce and the pulled pork was to die for.  Every time I have gone it's been very crowded.  The place is not much to look at but I found it very delicious and the help is very pleasant.  I would recommend this place to anyone who really enjoys ribs. I've been repeatedly disappointed at Famous Daves Barbeque, but I love the Rib Crib. Thumbs up from me."
        }, 
        {
            "index": 298, 
            "rating": 4, 
            "review": "Excellent ribs! GREAT greens!! We ordered the baby back ribs and they were fall-off-the-bone delicious, with just the right amount of sauce! I really enjoyed the sauce, as it was not overly sweet. It had a nice balance of flavors.\n\nThe mac and cheese was pretty good...very creamy.\n\n\nI am not a big fan of cornbread, so it's not really fair of me to comment on it, but my husband enjoyed it!\n\nI absolutely loved the greens! They had so much flavor, and just the right combination of spice and vinegar! Best greens I have had out at a restaurant, so far!\n\nThe service was great! We were checked on quite frequently, and everyone was smiley, pleasant  and helpful. Granted, we were the only customers in there (it was about 8:00 on a Sunday night), but we still appreciate the attentiveness. \n\nThe decor is country casual, with lots of black and white family photos on the walls and cute sayings and plaques. It has a warm family-owned and family-friendly vibe to it, and there is a tic-tac-toe game on each table.\n\nWe'll definitely be back!"
        }, 
        {
            "index": 299, 
            "rating": 5, 
            "review": "Being from the south, it's been hard to find southern soul food or bbq and thus family owned joint hits the mark on all points.\n\nHubs and I both had the half rack of baby back ribs and two sides. I had Mac n cheese and greens. Hubs had potato salad and baked beans. All stellar and like eating at grandmas house. \n\nAll this AND proper sweet tea. \n\nWe'll be back."
        }, 
        {
            "index": 300, 
            "rating": 4, 
            "review": "I Ordered Baby Back Ribs , Greens && Baked Beans Sooooo Bomb But The Mac && Cheese Taste Like it's From KFC"
        }, 
        {
            "index": 301, 
            "rating": 2, 
            "review": "I'm kinda disappointed by this place.  After reading alot of good reviews i gave it a try.   First of all the place was totally empty, except for some people picking up an order.  It took the girls about 15min to take our drink order, I don't know why!!!!!  I went with my two small children, ordered the lunch special BOGO free on Tuesdays.  I ordered the riblets with coleslaw and the half chicken with mac and cheese. I thought it was gonna be enough for the 3 of us.  When the food came out i thought it was a joke or something.  I was like, where is the rest of our food!!!??   The servings are ridiculous!!!!!!!!!!!   I had to order an extra lunch special.   My 2 year old ate the super tiny quarter leg almost whole.   And my riblets were just so tiny  there was hardly any meat on them.  On top of that the food came out cold... What a BIG letdown!!   I will never go back.  I really don't understand all the hype about this place.  Maybe we went on the wrong day and time.   If you want good BBQ try H&H BBQ in NLV.   Also let me add that the Kool- aid has sooo much sugar its almost undrinkable..."
        }, 
        {
            "index": 302, 
            "rating": 1, 
            "review": "First off, I have eaten Texas-Oklahoma \"Real Deal\" barbecue for 30+ years.\n\nBarbecue to different people across the USA undoubtably means different expectations.\n\nI like meats fresh off the smoker grill, meats with a smoke ring and ribs with meat that melts in your mouth,standing alone on the house seasonings. \nThis means an ON-SITE smoker/pit grill.\n\nIf barbecue is served heavily sauced, something is being hidden. Usually dry overcooked or re-heated leftovers.\n\nReviews show heavily sauced product here.\nWe never got to the point of seeing their product.\n\nWe went with another couple Thursday late morning, we all had their coupon special purchased in advance.\n\nWe were seated by a nice teen-age girl, who took our drink order and gave us napkins and flimsy plastic-ware forks and knives.\n\nI asked her if they cooked on site, she said \"yes sir\".\n \nI smelled ZERO barbecue smoke in the immediate outside or interior area, it is in a small location in a strip center.\n\nStrip centers, to my knowledge,for the most part, do not allow pit barbecue cooking for obvious reasons, fire risk, especially here in Vegas with summer tinder dry conditions.\n\nWe made our decisions and asked about our coupons, the owner appeared and said we could not use the discount coupons....we purchased these coupons she generated and could not use them.\n\nAfter quizzing her as to why, since she authorized them, she had no real answer.\n\n \nShe said we could not, and proceeded to rudely call us cheap for trying to use them.\n\nAt this point we simply got up and left.\n\n\nTC'S might have been a good barbecue place at their former location, where they received some  local popularity.\n\nI sense now, it is under new misguided management trying to live off past goodwill and is in a downward spiral...."
        }, 
        {
            "index": 303, 
            "rating": 5, 
            "review": "this place is awesome. i have been craving BBQ for a while since I moved from Colorado. This place hit the spot and hit the nail on the head. I know where to go now for BBQ. The staff is amazing as well, and if you dont know what to order ask the staff. My wife and i were able to share a meat order of 1/4 ribs, and pulled pork. I thought it would be small, so i ordered a beef brisket sandwich. we couldnt finish it. we ended up taking the rest home with us."
        }, 
        {
            "index": 304, 
            "rating": 5, 
            "review": "GREAT FOOD!! Second day on a row!  The catfish is crazy! Everything I've tried is delish!!! Customer service is a pleasure! I recommend."
        }, 
        {
            "index": 305, 
            "rating": 5, 
            "review": "Stopped in for lunch with my bestie, I had the catfish with a side of fried okra. Teri had BBQ chicken with fried green tomatoes and the mac and cheese. Both meals were fabulous. We highly recommend this establishment for some good old southern soul food. The owners not so hard to look at either,  thanks Sharon for the good time."
        }, 
        {
            "index": 306, 
            "rating": 5, 
            "review": "TC's Rib Crib is awesome!  The meats are delicious and the sides are great.  I love the cole slaw and greens for sides and the brisket and pulled pork were off the hook!"
        }, 
        {
            "index": 307, 
            "rating": 3, 
            "review": "TC's gets major points for their friendly and welcoming staff. Simple things like saying hi to customers when they walk in or refilling water glasses seem to be things of the past in many Las Vegas restaurants. But the folks here will treat you like an old friend stopping by. My lunch order was served up quickly. It probably only took 10 minutes or less to come out. I went with the pulled pork sammie. A little pricey at $8 but the size was decent, as was the flavor. But the texture was bordering on mushy. I prefer the fuller, meatier quality of the pulled pork at Buzz BBQ. The bun was nicely toasted giving the sandwich an extra crunch and the fries weren't bad.\n\nI do like the fact that they have lunch specials and daily dessert specials. The interior is nothing special, just a few tables and a small cashier counter and food display that leads to the kitchen. It's nothing fancy, just some decent down home cooking."
        }, 
        {
            "index": 308, 
            "rating": 5, 
            "review": "Used a Yelp deal and had a great meal. Much better than the chain BBQ's around like Famous Dave's. It actually feels like non-chain authentic BBQ. They also have some table games to play and pass the time, not that it takes long for the food to come out at all. \n\nThe Mac and Cheese was like the one I make, rich and with egg, good, but I like to try something different. The potato salad was good as well, nothing to complain about but otherwise nothing particularly unique. \n\nWhat I was most pleased with was the wedge cut potatoes. Perfectly crispy and soft with a great batter. Next was the pulled pork, and then the beef ribs. Both were smoky and flavorful and soft. The spare ribs, on the other hand, were a bit hard and with less smoky flavor in the meat. Meat was plentiful, though, and the cornbread was good, not too sweet. \n\nNext time I will save room for dessert and try some other items."
        }, 
        {
            "index": 309, 
            "rating": 4, 
            "review": "My sons and i love the place. something about the flavor of the ribs and chicken. been going there for years. look out for groupons & yelp special deals."
        }, 
        {
            "index": 310, 
            "rating": 3, 
            "review": "Wasn't the best quality BBQ I've had. I will say the delivery was on point and on time. The ribs didn't have as much meat as I expected with some fatty parts. I asked for extra extra BBQ sauce, and they gave me two 1.5 oz sides... which is expected I suppose. It was average I would say. I only ate half my mac & cheese because the bread crumb taste was a little overwhelming making the texture clumpy. Ribs are one of my favorite foods, and so I would definitely recommend a different selection if you are really craving them."
        }, 
        {
            "index": 311, 
            "rating": 5, 
            "review": "My wife literally applauded after eating the mac and cheese.\n\nAmazing ribs (spare/beef/baby back), chicken and links.  For sides, we typically do a double of the mac & cheese.  Giant cups of Muddy Waters (Sweet Tea + Lemonade) to wash it down.  Followed by a nap.\n\nI really have no clue what else to say about this place. I LOVE IT."
        }, 
        {
            "index": 312, 
            "rating": 5, 
            "review": "We used a Groupon and ordered the 1/4 rack of beef ribs and a pulled pork sammie with potato salad. I have to say this was one of the best meals we have ever had!  Great service, great BBQ sauce - we'll be back!"
        }, 
        {
            "index": 313, 
            "rating": 4, 
            "review": "Awesome Bar-B-Que!  I had the 3 Meat Combo + Catfish....  You won't be dissapointed.  Great service and food,,,  Will go again,,, soon!"
        }, 
        {
            "index": 314, 
            "rating": 4, 
            "review": "Meat was tasty  n tender. But the Mac n cheese had like a burnt taste to it.. Didn't like it at all.. And I Loooove Good Macaroni and Cheese.. Kool Aid was good.. Waitress tentive and friendly"
        }, 
        {
            "index": 315, 
            "rating": 5, 
            "review": "Owner was super welcoming and hospitable.  Even hooked us up with some fried ribs so we can try them.  Awesome BBQ food! Will definitely be the spot for us to return to next time we are in town! Must get their BBQ spare ribs!"
        }, 
        {
            "index": 316, 
            "rating": 2, 
            "review": "Ordered delivery from here and was super excited to try some delicious BBQ. But I was a little let down. The pulled pork sammie (which, from the picture on the menu was supposed to have coleslaw, but didn't) was decent but definitely nothing to write home about. Not a lot of sauce but still very soggy. My boyfriend said his chicken and waffles were ok but the peach cobbler was another let down. I think more of the sauce ended up in the delivery bag than in the to-go container."
        }, 
        {
            "index": 317, 
            "rating": 3, 
            "review": "They don't remove the membrane from the ribs and they are very tough. Very strange ribs I wonder if they boil them which is. A huge no no. Sauce and char were on point. Rib Tips good sauce was ok. Macaroni and cheese fantastic a little heavy on the pepper and too thick, missing creamy quality. Cornbread ok I like mine sweet. Coleslaw perfection, it's funny how so many mess up coleslaw\nAnd it was pleasant to finally eat good coleslaw in Las Vegas."
        }, 
        {
            "index": 318, 
            "rating": 2, 
            "review": "Really wanted to show love to a local joint but this ain't it. Brisket was unrecognizable and swimming in sauce, no smoke ring on the ribs (bad quality too), sides were just okay. Way too over priced for the quality and taste."
        }, 
        {
            "index": 319, 
            "rating": 3, 
            "review": "We visit Vegas at least once a year and decided to see how their ribs stack up to what we get back home.\n\nThis place was okay but not  really great.\n\nThe ribs were very overdone and bland. They needed a good rub to make them tastier, not just slather them in sauce.  The brisket was - how can I say it - just kind of weird.  We are used to slow smoked brisket and this looked and tasted like a rump roast that was cooked like a rump roast and sliced thin and had sauce dumped on it.  DH liked the potato salad. I swear the sweet potato fries (which are a staple in our house) were the frozen ones we buy at the grocers so, yep, they did taste just like home-made :)  The sauce is nothing spectacular - we are used to restaurants that have their own signature sauce but I didn't think there was anything spectacular about their sauce either.  We didn't try the pulled pork while we were there.\n\nThe portions are huge - I will give them that. \n\nMaybe it was an off-day for the kitchen - but I don't think I could give it more than 3 stars."
        }, 
        {
            "index": 320, 
            "rating": 3, 
            "review": "I'd have rather give 2 1/2 stars. That being said the food was OK. The problem with most BBQ joints in Vegas is that none of them do enough business to ensure high quality. I got the three meat with 1/4 rack baby backs, 1/4 chicken, and thenpork links with mac and cheese and coleslaw.  The ribs did fall off the bone but felt like they had been microwaved to heat them up. The chicken was dry and overcooked. You know how when chicken sits too long it gets a little translucent?  The pot sausage was VERY salty, but it was tasty. The mac and cheese was good once I put salt on it. Maybe they can take the pork links and mix them into the mac and cheese?  The coleslaw wasn't that good. Not much flavor and it looks like it may have started to freeze. The top layer of the cabbage was translucent as well. Not to mention it took nearly 25 min to get my food once it was ordered and I wasn't the only one that was waiting. There was a party of 10 that seemed to be getting a lot of attention from the staff at the detriment of everyone else. I wish these guys luck, but the most consistent places in town to get ribs are Lucilles, Roma's, and Applebees, in that order."
        }, 
        {
            "index": 321, 
            "rating": 1, 
            "review": "2 previous times, we've enjoyed our meals here.  However today, after waiting 15 minutes, someone comes to take our order.  When we start to order, she tells us 4 different meats they are out of (3 are what we wanted to order).\nWhen we decide we will just leave, the waitress got an attitude with us!"
        }, 
        {
            "index": 322, 
            "rating": 5, 
            "review": "I've been to TC's twice now and I love it!! It's my favorite rib house anywhere (yes more than Phil's BBQ in San Diego!) The service is always great, and the food is mind blowing! The muddy water is really good, but we usually end up drowning ourselves in the best kool-aid ever known to man. What I love most about this place is that its not selective. What I mean is that its not \"oh the ribs are great, but this/that isn't. EVERYTHING at TC's is delicious! From the mac & cheese to the ribs/sauce...I couldn't drool more. Make sure to use the Yelp deal!"
        }, 
        {
            "index": 323, 
            "rating": 4, 
            "review": "We were delighted with T.C's Rib Crib.  The meat was good, very tasty, I had the beef tips.  The fried okra and sweet potato french fries were delicious.  My husband had the brisket sandwich and was very pleased.   Next trip, I'm trying the ribs.  Everything tasted fresh and homemade.  The portions are also generous.\n The restaurant is clean and everyone was very friendly. It's nice to walk into a restaurant and feel comfortable and welcome for a change. It's a refreshing change from the chains and franchises, it's a family business, so it's a labor of love. (The reason that you don't have the pleasure of a smoky BBQ aroma is that they have to smoke their meats off site, since there is no room at their location for a smoker.) My husband and I are from Kansas City and we know we are BBQ snobs.  We had just about given up hope of ever finding really good BBQ here in Vegas until this evening.  We love everything about T.C's and definitely will be going back."
        }, 
        {
            "index": 324, 
            "rating": 4, 
            "review": "Loved it! Homey atmosphere and home cooked food. The mac and cheese wasn't made from slimy cheese-food-product, it had the texture of CHEESE. The greens were cooked and seasoned perfectly. The pulled pork was amazingly moist. The sauce was spot on! Not to sweet, not too hot. The ribs were like home made. I notice that ribs in chain restaurants have a weird texture... chemical brining? I read someone else's review complaining about the texture of the ribs and that they were charred. I disagree. I think they are plenty tender and meaty and yes, charred in a few places...they WERE near fire. (sarcasm) The fried okra was good, fries (sweet and regular) were good. The waitresses were fun and friendly. If you are a chain restaurant lover, maybe this isn't the place for you."
        }, 
        {
            "index": 325, 
            "rating": 1, 
            "review": "Way overpriced and not very good quality. Improve the quality and lower the price and i'll be back.....the food is tasty tho so at least i'll give them that. I've had everything from here and i can honestly say it doesn't compare to a real bbq place. This is oven cooked stuff."
        }, 
        {
            "index": 326, 
            "rating": 3, 
            "review": "YUMMY YUMMY place I tried because of the most favorite deal \"GROUPON\"! ha\nThe deal was for 2 sandwiches, 2 sides and dessert to share! I had the sweet tea also (that's the only way to do SOUTHERN) and it was lovely! The pulled pork was very tasty, although not quite what I expected from a \"family\" restaurant. I thought they would have homemade  sauce and this tasted more like something off the grocery store shelf. The sweet potatoe fries were good and the apple cobbler for desser was AMAZING! I will go back just to try the GLAZED DONUT BREAD PUDDING, since that wasn't a choice with the Groupon. And maybe the sauce will have improved!"
        }, 
        {
            "index": 327, 
            "rating": 2, 
            "review": "Purchased a gift certificate for Tc Rib Crib off Restaurants.com to try this place out. Arriving at the location i was surprised at what little it really was inside upon entering as it was really like an indoor picnic very no frills and humble about the decor. We sat and ordered a 2 meat combo links/ pulled pork with 2 sides mac & cheese/ greens and cornbread for $15. And then the Rib tips and 2 sides mac & cheese/ potato salad and corn bread for $10. I was not impressed to say the least as the links were very mushy and not a solid put together product, the rib tips were sparse on the meat side and the sides... lordy the mac & cheese was dry and almost chalky with my only taking 1 bite of potato salad as it had too much built up condensation in the container from being stored in the fridge for too long. The best part of the meal was the pulled pork, where if you want to try this place i recommend doing the pulled items turkey, pork, chicken and bread to make a sandwich. The BBQ sauce like others mentioned is a brown sugar based sauce which i dont mind but if you dont like sweet sauce then this might not be for you. All in all it was a meal yes and the portions were decent but the quality of taste and product i just wasnt feeling at all. For the money i think i would have rather gone elsewhere to dine. BBQ is so touchy with alot of people and im not spoiled but i do have some expectations when i go for a meal in this arena."
        }, 
        {
            "index": 328, 
            "rating": 5, 
            "review": "Came for a family reunion and the whole family was blown away. We sample everything from the fried okra fried catfish fried ribs to the barbque wings. The staff are very attentive and courteous. I do believe this will become apart of our annual reunion."
        }, 
        {
            "index": 329, 
            "rating": 5, 
            "review": "You think when you walk in and see the small and pedestrian surroundings that you can't expect much. But...when you take the first bite of a rib, or the first forkful of the out of this world mac n cheese, you realize that all the money and love goes into the food! And the service is fast and friendly so the fact that they use plastic utensils and to go containers for the sides is barely noticeable. \nAlthough the menu is a little limited in choice, the price is better than most other bbq joints I have visited.\nI highly recommend this place and will be bringing my friends here."
        }, 
        {
            "index": 330, 
            "rating": 1, 
            "review": "The owners customer service is what really lost our business.  We had called and were looking for catering for our church volunteer luncheon.  The owner put on a very nice attitude, but kept making excuses saying he would call me back.  The first time I talked to him he said he would call me once he was home, and I did not hear back until the next day.  Then the day before the event was to happen he called and stated he was driving that he would pull over and call me back in about ten minutes.  The event has come and gone and still never received a call back.  We were regular customers, loved the food and even referred many.  Customer service is huge in my book - your customers are what keeps the business running.  Sadly we will not be returning due to this fact and will no longer refer our friends and family.  Especially coming from the owner, this was very disappointing, if they didn't want to help with our event, I would have been fine with them coming out and saying it, instead of dodging us."
        }, 
        {
            "index": 331, 
            "rating": 5, 
            "review": "AMAZING.  Real Southern cooking.  I know because I used to live in the South, and I used to eat at the famed Leatha's BBQ in MS all the time.\n\nThis is genuine, home-made stuff, not some dry, commercialized crap from major chains.  Their recipe has been handed down for generations, so you know this is legit.  Juicy ribs that easily fall off the bone, and BBQ sauce to die for are just a couple of things that define TC's.\n\nThe sides tend to get overlooked, as they are just as good as the ribs.  The fried okra is the best.  And though I absolutely hate coleslaw, I can say with a straight face that I really like TC's.  I don't know what it is, but it is good.\n\nI really do believe this is the best home-made BBQ place in town, so try it for yourself!"
        }, 
        {
            "index": 332, 
            "rating": 5, 
            "review": "I am not sure about yelpers now after reading some of reviews for this place. First off someone said the mac and cheese was bland.  It's the best mac and cheese in town and the recipe has been handed down for generations. I am not usually a rib guy but the baby back ribs here are incredible sauced to perfection for my taste.I am not exactly sure but I think this place is staffed with family and close friends and have always been helpful and friendly. So for the yelpers who think this place is bad you must not have tried Tony Roma'a or famous Dave's  (talk about poor service and microwaved ribs yuck) you don't know a great place when you eat at one. And this place is great."
        }, 
        {
            "index": 333, 
            "rating": 5, 
            "review": "I grabbed the Yelp deal like many others here, and I had a fine time here.  The barbecue was well sauced and the sides were very tasty.  \n\nService was excellent as well, and it was very easy to find parking since it is in a large strip mall.   \n\nOverall I would recommend people give this place a try if you are looking for a good deal on home cooked barbecue.  For the price, they are an excellent deal and they are very friendly as well."
        }, 
        {
            "index": 334, 
            "rating": 4, 
            "review": "I call this place my kitchen. I love there catfish and TURKEY GREENS!!!! I can't say enough about there Turkey Greens. I was left to fend for myself for a week and I believe I came to eat there about 3 times and had the best food each time. The people are nice and the peach cobbler hits the spot. They have a small one that is perfect. \nNow let's talk about fall off the bone ribs. Pork ribs from the grill. So freaking good."
        }, 
        {
            "index": 335, 
            "rating": 1, 
            "review": "I happened to see a Yelp deal one day for this place & I happened to be in the neighborhood & was feeling BBQ. I had heard about TC's back before it had moved & had always wanted to try it & did my due diligence on Yelp. Let's just say I'm glad I didn't pay full price. \n\nThe service was ok & the food wasn't any better. I had a combo plate. I chose ribs as one of the meat choices & needless to say, they appeared to have just been warmed up in the microwave or an oven. They definitely lacked that fresh out of the smoker or off the grill feel. I really have no idea which method they use. I also ordered sweet potato fries & the mac & cheese. The mac was super bland & I barely touched it. \n\nI'm quite certain I won't be coming back. Rib crib is definitely a good name, because this BBQ isn't quite ready to walk."
        }, 
        {
            "index": 336, 
            "rating": 5, 
            "review": "Winding down from a very busy weekend in Las Vegas and tired of buffets. We yelped Ribs and this mom and pop showed up. It was just what we were looking for. Bountiful home cooked ribs!\n\nWe were a party of 9, mostly hungry cheerleaders. We ordered the Family meal of Rib Tips, Baby back ribs and BBQ chicken with all the sides! It was tender and delicious! We also ordered a side of Beef ribs, they were the best I've ever had! Tender and not too fatty!\n\nWe'll be back next time were in vegas! A party of 6 cheerleaders, a 13 year old boy and two adults ate for under $90! Wow, good food, excellent friendly service, I'll be back.\n\nTry the Arnold Palmer and the Dirty Water (like an Arnold Palmer, but sweetened)"
        }, 
        {
            "index": 337, 
            "rating": 1, 
            "review": "Small hole-in-the-wall spot. NOT very many customers so NO real wait.\n\nJust tables & chairs w/Pie Counter(no seating) \n\nI ORDERED 2 MEAT-2 SIDE COMBO\n\n1/4 SLAB BABY BACK RIBS * BBQ BEEF BRISKET\n2 SIDES-BAKED MAC & CHEESE & COLE SLAW\nCORN BREAD & SWEET TEA\n\n\nNOT GOOD. The Ribs were skimpy. The Brisket was horrible.(any self-loving BBQ cook knows the brisket was NOT right and shouldn't have even served it to anyone.- More like grissle & unedible meat)\n\n. The BBQ sauce was sugary sweet. NOT my style. The cornbread was right out of a JIFFY box and made bad & NO butter to speak of. The Coleslaw was SOUR & the Mac & cheese was OVERCOOKED & NOT cheesy or BAKED!\n\n It felt like you were at a BAD FAMILY PICNIC!! Plastic plates and styrofoam containers & ALL.\n\n\nPS THOSE PICS LOOK NOTHING LIKE THE FOOD I ATE!"
        }, 
        {
            "index": 338, 
            "rating": 5, 
            "review": "I found this place when I used to work down the street from them, and they were a go-to lunch spot for me and my coworkers back in the day. I have long since left that job, moved to a different part of town, and generally changed my diet to favor putting less sugar and refined things into my body. Then one day I got a job right down the street from their new location.\n\nIf they didn't use so much sugar, and they used grass-fed beef and pastured pork, they'd be a shoe-in for best bbq in town. But that isn't their fault, sugar is a part of bbq no matter where you go.\n\nThe pulled pork here is awesome. The brisket here is awesome. The ribs here are awesome. The sausages here are awesome. The rib tips are good but they used to be better, at some point they switched to doing them like everybody else with the tip of that cartilage still in them but they used to be just the meat. I miss the old way but the new way is still delicious. \n\nWhen I feel like I don't mind the sugar that day, and I'm in the mood for bbq, I'll take this place over Lucille's every single time."
        }, 
        {
            "index": 339, 
            "rating": 3, 
            "review": "After being told that there is no good BBQ in Las Vegas, I've been wanting any local (non-chain) place to prove them wrong.\n\nAlong comes TC's.  Their regular menu and breakfast menu elicits BBQ legitimacy, with Chicken, Ribs (spare ribs, baby backs & beef ribs), rib tips, and pull pork (any of these meats available in their omelets).\n\nThis being my first dining experience at TC's, I had to go with the three meat combo with 2 sides and cornbread in order to get a good feel of their BBQ.  My choices: Rib Tips, Baby Back Ribs, & Pulled Pork; Mac 'n' cheese & Fried Cabbage.\n\nTo my understanding, this is a family owned and run business and it showed from the extremely friendly and personable service to some of the family members playing a board game in the dining room because it was slow.\n\nThe rib tips were excellent as was the fried cabbage.  The pull pork was serviceable after adding a little more BBQ sauce.  The ribs however were dry and extremely charred.  TC's BBQ sauce is extremely sweet and lacking any kind of spice, but because that's not my cup of tea doesn't mean you won't like it.  The mac 'n' cheese was gritty and somewhat less than warm and the cornbread could definitely be categorized as stale.\n\nAll-in-all, I've rated TC's with three stars based on the service, \"BBQ restaurant\" feel, and my craving to have more rib tips and fried cabbage.  As for rating a \"Rib Crib\" for their Ribs, well that would be thumbs down."
        }, 
        {
            "index": 340, 
            "rating": 3, 
            "review": "NOT CLOSED. Farewell my favorite mac n Cheese and farewell the best BBQ chicken breasts in town. My friend and I walked up for lunch and the place was gutted clean about a week ago. The baby back ribs are too fatty also."
        }, 
        {
            "index": 341, 
            "rating": 5, 
            "review": "Awesome place! I was craving ribs today, and it was just my luck that TC's popped up on yelp. With the yelp $10 for $20 deal, I ordered the full rack meal deal, where you get to choose the type of ribs, 2 sides, and a cornbread. Sooo, I got a full rack of baby back ribs, a generous cup of cole slaw, a generous cup of greens, and a cornbread all for $12!! I've never had such good ribs for such a great deal, unless it was home made. I will definitely come back."
        }, 
        {
            "index": 342, 
            "rating": 5, 
            "review": "Great dinner! Authentic comfort food and the price is right."
        }, 
        {
            "index": 343, 
            "rating": 3, 
            "review": "Home cooked BBQ...\n\nMaybe I shouldn't be writing this tonight because I'm in not the best of moods & sick but some of my taste buds still work. We had some serious highs here & some serious lows.\n\nThis is a little place and feels very cozy which I always appreciate. The art & signs on the walls are a great touch. The staff is very nice & and the prices are ok. The meat was great, nice pulled pork and chicken which come in the house BBQ sauce which is sweet with a little kick (this I enjoyed). The baby back ribs were very moist but they were really fatty and I am not a big fan of my meat surrounded by fat. This may sound bad but it's true. The sides we chose were onion rings (fantastic), Mac & cheese (bland :( ), sweet potato fries (awesome) and baked beans (bland). I'm always looking for some bacon, onions or sausage bits in baked beans. The sweet teas were the serious low tonight because it was like drinking straight sugar. We had to ask for some non sweet teas to find our balance. \n\nThe highest point tonight was the incredible lemon cake. Very homemade and moist, sweet, tart with perfect frosting. The last bite was very memorable so I'm thrilled about that! \n\nOverall it was good and as mentioned we love home cooked meals and this felt like one. I'm sick today so my taste buds are off but I can still taste bold flavors. \n\nI forgot to mention the cornbread. It was dry :( \n\nSome tweaks and this place can have it all."
        }, 
        {
            "index": 344, 
            "rating": 5, 
            "review": "Bought a Groupon and decided to try this place out.  Paid $6 for $12 worth of food.    Greeted at the door and taken to the seating area immediately.  Couldn't use the groupon on the lunch specials (they're considered their happy hour deals) and we couldn't use the groupon and get our kids meal free when it was their Monday special.  Oh well.  We sat and ordered.  We bought the pulled pork plate with Mac and cheese, baked beans and two corn muffins.  The daughter got the small fry kids meal with 3 wings and Mac and cheese.  Service was great.  Food took about a good 10-15 minutes.  It was worth the wait!  The pulled pork was moist and delicious.  Their BBQ sauce was really nice.  A little spicy but totally awesome!  Mac and Cheese me!!!  I could totally come back here just for their Mac and Cheese.  The baked beans according to my husband are just like homemade baked beans.  And he's really picky about his baked beans.  As for the kids meal, the daughter loved the wings.  I expected them to be BBQ wings, but instead were the deep fried breaded variety.  They were delicious and my daughter loved them.\n\nWe will be returning to the crib! :)"
        }, 
        {
            "index": 345, 
            "rating": 3, 
            "review": "Overall it was ok.\nI ordered the 3 meat- 2 sides combo. 1/4 order of spareribs, pulled pork, and hot links. Sides was baked beans and mac. & cheese, with the corn bread and kool-aide. Plus sharing   \nTaste wise it was pretty good, not too bad. The meat was tender, good  seasoning, the ribs and pulled pork was ok, but hot links were so-so. The sides was over cooked a bit, with the corn bread cold, bland,  and served without butter. \nDidn't have a spicy BBQ sauce option, but they did have plenty of hot sauce on the table. \nOverall, a cozy family BBQ joint."
        }, 
        {
            "index": 346, 
            "rating": 5, 
            "review": "Are you in the mood for BBQ? Well, I hope so. You did open this review after all. \nSo, do you want BBQ with flavor? TCs has it. Do you want food with character? TCs has it. Do you want to keep your shirt clean? Well.....you probably don't want BBQ then. \nTCs boasts an array or beef, chicken and pork done in the Louisiana style, and a lot of southern staples as sides. They even have decent greens, which is so hard to find in Vegas.\nAside from the food itself, the sweet tea will give you diabetes on the spot, which means its accurate to real southern sweet tea for those native west coasters who don't know. The staff is friendly. The atmosphere really strongly evokes the southern style of community and connection. \nWhy are you still reading this? Go get some."
        }, 
        {
            "index": 347, 
            "rating": 1, 
            "review": "Heard of this place through Groupon- they also have Yelp deals and other discount offers available, if you're thinking of going. But I'd like to dissuade you from doing so.\n\nFor starters, service from the owner is dismal-stopped by last week to use my deal and he was arguing with another Groupon customer, loudly and unprofessionally. I wouldn't have gone back without my discount.\n\nThe meat here is of such low quality, it's embarrassing. The pulled pork was so shredded that it nearly looked ground and the only flavor came from the sauce. Ribs were mediocre, and for a place named after their ribs this is unacceptable- low quality, not particularly meaty or flavorful, and a bit too charred.\n\nThe brisket though. As a Texas girl, I know brisket about as well as I know my own grandmother. And I don't know what the hell they're serving here. Meat is not fresh and is cut so thinly that it appears to be prepackaged. Little to no flavor, this is not brisket. I was so, so disappointed.\n\nWe left more than half of our food on our plates, paid, and left. Owner was half asleep in a booth at the back of the dining room and did not address us at all, despite being the only customers and clearly having an issue with their product.\n\nDon't go here- they don't care about their customers or their product. There's a reason they have a million discount deals up and NO customers. Barbecue sauce was tasty, but there's nothing here to put it on worth eating."
        }, 
        {
            "index": 348, 
            "rating": 5, 
            "review": "Being a North Carolina Boy and the Son-in-law of a man who competes in Barbecue contests......the food was excellent! Both the Baby back and spare ribs were cooked just right. Tender and Juicy! Their home made BBQ sauce is outstanding! (They sell it by the bottle) I read some of the reviews and recognize that everyone has an opinion and thus people have very different expectations of what \"Real BBQ\" is & isn't and no opinion is right or wrong. It's is just their opinion. \n\nSo what is this place! This is Juicy, Tender BBQ with a homemade Sauce to die for. This is NORTH CAROLINA GOOD! This is not \"Dry Rub\", \"No Sauce\", Vinegar based BBQ. IF YOU COME TO THIS RESTAURANT AND THATS \"YOUR\" definition of what real BBQ is...then this will never be that and thus never meet your expectations. We had chicken ribs, sausage, okra, beans, Mac N Cheese, fried pickles, sweet potato fries, muddy water (Sweet Tea & Lemonade) vs. An Arnold Palmer (Unsweetened Tea and Lemonade). And it was amazing! So, If you like saucy sweet BBQ, tender ribs and all the trappings......This is your new spot in Vegas!"
        }, 
        {
            "index": 349, 
            "rating": 1, 
            "review": "These people have absolutely HORRiBLE customer service! !!!  We went there to order food and my husband only had $100. The lady told him that it was not REAL, which it was, but I understand , a lot of place don't like to break 100 bills, so we went to the gas station in the same complex and got change came right back and the lady told him his $20 bill was NOT REAL either!!! And then asked if she could KEEP it!! Very rude and obviously they don't want any business since they are doing that to people..I will never go there EVER again.... This was our first time even going there and to get treated like that was unbelievable and messed up!!!"
        }, 
        {
            "index": 350, 
            "rating": 5, 
            "review": "Fantastic southern-style BBQ - the absolute best in Vegas. The pulled pork sammie is basically perfection. The balance between the tang and slight sweetness of the BBQ sauce with the creamy cold slaw is what kept my husband coming back (every week).  The baby back ribs are super tender, the sauce is excellent, and they're served at just the right temperature (ie, you can eat immediately).  And their \"Fry\" day is the best fish fry I've ever eaten.\n\nThe atmosphere is casual, comfortable, and very laid back.  Which is good since you're about to get BBQ all over your face and hands.  The staff is friendly without being cheesy and very knowledgeable about the menu.  Dinner for 2 typically cost us about $30: we'd get a pulled pork sammie meal, a good eatin' meal (or catfish), and 2 sweet teas.  Well worth the price!"
        }, 
        {
            "index": 351, 
            "rating": 4, 
            "review": "I came in  at the time of day that was too late for lunch too early for early bird dinner.  The woman behind the cash register was very patient and helped me pick out to go orders that would give the best sample of their barbe que  rib selections.  She even gave me a sample of something I was not ordering, the pulled pork Sammie ....yum!\nWhen I was in the car going home the smell of the ribs  was so overwhelming I had to pull over into a parking lot and tear one off the rack!  Being from Texas I am critical about the meat being smoky with flavor and the sauce is for dipping.  It was Texas perfect!  Most important was the staff..they were Texas friendly..though I was the only one from the lone star state.  Welcome. Home"
        }, 
        {
            "index": 352, 
            "rating": 1, 
            "review": "Poor service, brisket tasted and had texture of a top round roast that was overly grilled, and the prices on their online menu where inaccurate. Placed an order for everyone that was visiting hubby in hospital, collected $ based off of those prices, and didn't have enough cause they upped the price when I got there. Will never return with their ghetto service, cheap meats, and manipulative advertising."
        }, 
        {
            "index": 353, 
            "rating": 4, 
            "review": "I was able to get a Groupon Now for free and tried this place.  I ordered the three meat special with ribs, brisket, and chicken with mac and cheese and greens on the side.  The meats were nice and tender.  Their BBQ sauce is good but the one we had was a little on the sweet side.  The greens were amazing but the mac and cheese is just ok."
        }, 
        {
            "index": 354, 
            "rating": 3, 
            "review": "Went here during a friend's bachelor party. By far the best ribs I've had, and I've tasted a lot of ribs in my time. The portions are ginormous and the meat is very well flavored. The sides are good and the people are very friendly. Can't wait to go back to Vegas, just so I can hit up TCs again!\n\nEdit: Our last visit there, the BBQ was sub par. Dry, flavorless, disappointing."
        }, 
        {
            "index": 355, 
            "rating": 4, 
            "review": "My husband and I snatched up a Yelp deal and headed in for dinner. \n\nWe walked in at a weird moment where people were leaving with and other waiting on take-out orders while yet others were getting seated. We weren't yet aware that dine-in folks were seated so we stood for a bit until we caught on. \n\nThe room smelled great. The walls were decorated with photos, articles, and art pieces that made the space comfortable and reflected the family ownership. The rest of the space is straightforward with seats, which I appreciate in a BBQ place. I don't know why, but overly decorated BBQ places are weird to me. Sidenote: the UCLA sticker in the window was not lost on us recent transplants from Los Angeles and Bruin alumni. \n\nAnyway, our server welcomed us and got our drinks. I don't know what it is with this city but, as usual, the refillable fountain drinks were Pepsi. However, it was nice to know that Coke products were available in cans (just not refillable). Being a human camel, I went with the refillable stuff. \n\nWhen we ordered, our server asked if we'd been in before and we said no. She very genuinely and excitedly welcome us and expressed her happiness about our first visit. That didn't go unnoticed. It was really sweet. \n\nIt being Friday and me loving fish, I already knew I was ordering the daily special of fried catfish. I went with the 3 piece meal with two sides - fried okra and mac and cheese - with cornbread. \n\nLet me just say that the catfish was so on point that my husband and I ate the entire portion despite my promises to myself to save half for later. The fish was perfectly fried and seasoned; crisp and clean and in no way greasy or fishy. As I mentioned, we recently moved from LA. Our old apartment out there was close to many soul food options and this catfish was on par with many of our favorites. My heart was happy from this dish. \n\nThe fried okra was also well cooked. I think it missed a sauce but the hot sauce at the table worked well. \n\nThe mac and cheese was cheesy and thick though a tab bit on the colder side. Still, despite the temperature, it was a solid accompaniment to the entire shared meal. \n\nhttp://www.yelp.com/user_local_photos?select=rVzUDPH_6vUEQOFuNBIovQ&userid=5DFshFQlbQiQTvtzH7qwlA\n\nMy husband, and rib lover and pork enthusiast, went with the three-meat plate and upgraded to all the ribs available: 1/4 slab pork spare ribs, 1/4 rack pork baby back ribs, and 1/4 rack beef ribs. He selected greens and fries for his sides. \n\nhttp://www.yelp.com/user_local_photos?select=ZNYVsrPOUg0n91NhzKZv5w&userid=5DFshFQlbQiQTvtzH7qwlA\n\nhttp://www.yelp.com/user_local_photos?select=znzhMgybO7TFHvg0VV4agQ&userid=5DFshFQlbQiQTvtzH7qwlA\n\nWe're both from pork loving cultures and the ribs did not disappoint. They all had a lovely smokiness and tenderness. I usually favor pork ribs but, in this instance, I felt the beef ribs were the most outstanding. My husband  favored the baby back ribs. \n\nBeing greedy, we tacked on an order of brisket . Also, Friday nights are usually cheat and date nights. Just saying. Don't judge. I'm capable of eating even more. \n\nhttp://www.yelp.com/user_local_photos?select=gms7IFEgYRSA-HioCsyGmg&userid=5DFshFQlbQiQTvtzH7qwlA\n\nI was surprised at the thin slices of the brisket but I rather enjoyed it. It reminds me of Korean BBQ brisket, but with soul. It was fantastic stuffed into the accompanying cornbread. \n\nI felt the service was very attentive. We were checked in on just enough to feel catered to without feeling suffocated and I had no trouble getting refills. We had a few hiccups on the food (had to ask for the cornbread and brisket after everything else came out)  but that didn't really bother us. Actually, it made us laugh about how overzealous our order was. However, I will say I was disappointed we weren't offered dessert. I forgot what was on the menu but I probably would have gladly ordered something. \n\nThe tab came out to $48 for 2 drinks, 3-meat all rib plate, catfish, 4 sides, and brisket a la carte. With the Yelp deal, that dropped down to $27. Tip and the original $10 to buy the deal brought the total back to $47, which I think was absolutely fair even without the deal. \n\nThat all being said, I think 3.5-3.75 stars is on point and we look forward to returning soon. If I recall correctly, my husband plans on a full rack next time (I assume baby backs). If, for some reason I find myself off from work on a weekday, I will beeline here to check out the $4.99 lunch deals!"
        }, 
        {
            "index": 356, 
            "rating": 2, 
            "review": "The brisket was a bit too apple cidery vinegary and sliced super-thin, which isn't the flavor nor texture I typically expect from brisket.  The baby-baby ribs were TOUGH, which is DEFINITELY not what I expect from baby back ribs!\n  The sides were the best things there: dirty rice had a nice rue to it, black-eyed peas were spot-on, mac and cheese was wonderfully cheesy, the baked beans were the perfect balance of smoke and sweet.  The corn bread, however, disappointed and seemed like it was made straight from a powder you'd buy at a store.  Overall, though, the portions are well-proportioned, so you get a good bang for your buck, especially if you use the Yelp discount special.\n  Another small thing that happened that kinda put me off a little was how they served the food: the waitress brought it out, one dish at a time, with significant time differences between the plates.  So two people in our party got their food...followed by another person getting their food....and then another.....and then the final person got theirs even later than the others.  A little protocol training on consistent table service would go a LONG way, when it comes to lunch service.\n  So, overall, not impressed with the service nor the food, and not anticipating a return trip."
        }, 
        {
            "index": 357, 
            "rating": 5, 
            "review": "Hidden gem! Don't go to Lucile's or chilled or Ribs n Burgers! This place is just like moms cooking and all made from scratch! Ribs fall off the bone and so juicy and tasty!!! chicken fingers are great too and you can tell they make that fresh too. No frozen chicken here. Very friendly staff also"
        }, 
        {
            "index": 358, 
            "rating": 5, 
            "review": "Great baby back ribs. Lots of moist tender meat. Chicken and waffles are good.  Baked beans and the potato salad are good. Nice and polite employees. They need to update their menu on their website, prices have gone up. $3-4 on some items. Nice and clean restaurant. I'll go there again."
        }, 
        {
            "index": 359, 
            "rating": 5, 
            "review": "Great service waitress was friendly. Cooks, Great food. $$$$love it .. don't care to much for the paper plates. Please change!!"
        }, 
        {
            "index": 360, 
            "rating": 4, 
            "review": "Had my first visit to TC's for lunch, and I'm a fan. When combined with a Yelp Deal, this restaurant is a great value.\n\nWent here with some coworkers. One had been here prior, but it was the first visit for the rest of us. The chicken and waffles was the special for the day, which meant I got an extra waffle with my meal. The chicken wings had a crispy skin and the meat was very juicy. The waffles were okay. Nothing out of the ordinary. I also added the dessert for $1, which was peach cobbler that day.\n\nDefinitely a place I would return to. Our server mentioned that I have to try the ribs next time. Considering the name of the restaurant, I might have to take him up on that recommendation."
        }, 
        {
            "index": 361, 
            "rating": 4, 
            "review": "Service was very friendly and attentive to your needs. The baby back ribs were delicious."
        }, 
        {
            "index": 362, 
            "rating": 4, 
            "review": "I had a wonderful experience eating here with my little girl and buddy. I love a place where they treat you like family...well at least like family that likes you ;-) I bought a Groupon because I always wanted to try this place. It was for two sandwiches, two sides and a dessert to share. First off they payed full attention to my little toddler making sure she was happy coloring and enjoying some of their wonderful tea while we waited for our food. This always makes me happy when I have help to keep my a.d.d. toddler happy :-) What also delights me is when the waitress and host is young, friendly, polite and just over all a good person. You get that sense right away with these people. Very attentive to us and not on their phones checking facebook ;-) \n\nThe food was yummy!! We got the pulled pork sammie (flipping awesome!) Beef Brisket sammie (another winner) Some smack yo mama its that good Mac and cheese, delish sweet potato fries and for the little girl a wonderful chicken leg, baked beans and we all had the cherry cobbler to share. By the end of the meal I could barely move...yet I still had a bunch to bring home :-) I was in a euphoric  yet almost comatose state as I walked out of there.\n\nBottom line is they made me a fan :-) I was won over right away with their kindness and the food sealed the deal ;-)"
        }, 
        {
            "index": 363, 
            "rating": 2, 
            "review": "I had the chicken and waffles and my wife had the rib tip special. Food was cooked well...just needs a little bit more seasoning! I probably wouldn't go back."
        }, 
        {
            "index": 364, 
            "rating": 4, 
            "review": "I've brought several friends here.  Great BBCUE!!  Their rib meat falls off the bone and they have great tasting sides as well.  Casual atmosphere so you can wipe the barbecue from your fingers right on your shirt and fit right in.  Set off the street behind Brewski's on durango...\n\nWorth the stop for sure.  Bring the family!"
        }, 
        {
            "index": 365, 
            "rating": 4, 
            "review": "This place has been here for about 4 years, and I just discovered it a few hours ago. Fail on my behalf. \n\nMe and my mom ordered the 3 meat treat. We got beef tips, hot links, 1/4 slab spare ribs with sweet potato fries and collard greens as the sides. \n\nThe hot links could have been a bit more tender, but were delicious on the other hand. Beef tips tasted good, even though they were essentially small steak pieces. LOVED the ribs, they were tender and practically fell off the bone. The collard greens were quite tasty and the sweet potato fries had a perfect ratio of sweetness and typical french fry flavor. \n\nThe atmosphere is pretty interesting. It's slightly hole in the wall-ish but clean. I loved the pictures on the wall, it gave the place a VERY homey feel, the service is pretty homey as well. Another nice thing to note are the names of many of the dishes, which are supposedly named after members of TC's family. \n\nAs for the glazed donut bread pudding, tasty, but WAY TOO SWEET. Don't think I will ever order that again, unless I'm begging for the diabeetus."
        }, 
        {
            "index": 366, 
            "rating": 5, 
            "review": "The BBQ here is good. I have had just about every types they offer. The ribs are extremely good. My son loves their pulled pork. The Banana Pudding is great as well. One of the best parts about this place is the service. Everyone is extremely nice and treats you like you are family. We have truly enjoyed our visits so far and will be back!"
        }, 
        {
            "index": 367, 
            "rating": 4, 
            "review": "One guaranteed way to make me smile: feed me delicious fried okra. This is exactly what T.C.'s Rib Crib did, and for this alone, me and T.C. are pals. I am pretty sure this friendship is going to last.\n\nThis is a casual, small spot where the food comes on styrofoam. There aren't table cloths, but you can dine in. \n\nIn addition to drool-worthy, fresh fried okra, I had sweet potato fries and a quarter chicken. The fries were not as impressive as the okra, but my husband inhaled them in less than a minute. As for the chicken, I could literally pick it up, and the bones would fall out, which means that this was one tender piece of chicken. Tender and flavorful- what more could you want from a chicken? Well, it could have been a bit juicier, and I did miss not having a spicy BBQ sauce. However, the standard sauce had a savory sweetness and was nothing to complain about!\n\nThe service was super sweet too.\n\nThe prices may be a tad more than you anticipate, but you're paying extra for the soul. I will be back, and I may even show up just for an okra snack. (It's the equivalent of a Scooby Snack for me...)"
        }, 
        {
            "index": 368, 
            "rating": 5, 
            "review": "Wow!!! What an awesome place. Service and food are incredible!! \nBest BBQ chicken and ribs I've had!! Sides were great too. Can't wait to go back to Vegas!!"
        }, 
        {
            "index": 369, 
            "rating": 4, 
            "review": "Love it here.\n\nI'm far from being a BBQ expert, but the two times I came here, I have not been disappointed. Their sweet tea is off the chain. Their sides are deeelish. I enjoyed the collard greens, mac-and-cheese, and don't forget the fried okras. Yes. Superb indeed.\n\nI suggest coming here with a good appetite and a few friends lusting for some hunks. Hunks of meat. Baby back ribs, dried up, BBQ sauce on the side. The meat is succulent enough and flavored to a satisfying point of delight. Tender and falls right off the bone. Same goes for their BBQ chicken. Golly, that is one BIG CHICKEN, I kid you not. I don't know what they have in the back of the kitchen, but half a chicken was gigantic. Where the other half escaped and whether it was found, I'll never know. Pulled pork as a little on the salty side, but who doesn't mind compensating salty with some cornbread? \n\nI will come again."
        }, 
        {
            "index": 370, 
            "rating": 4, 
            "review": "We were hankering for some good BBQ and stumbled upon a place called T.C.'s Rib Crib. Again, we used our entertainment book coupon to save $15 so why not splurge and order more than we should. We get to the place and its on the smaller side. There's about 12 tables and thats about it. I heard if you order to go, its gonna be like a fast food place experience... But if you dine in, they promptly seat you, bring you table settings, and give you the full service you would expect from a nicer restaurant. We get there around 5pm on a Saturday and almost all the tables were full. I take that as a good sign. We get the menus and start looking over the choices. Meats meats meats was the name of the game. I ordered the Lot's O' Meat Meal ($18.00) which comes with 3 meats, 2 sides, and a corn bread. The meats to choose from were: beef tips, pulled pork, beef brisket, links (2), 1/4 rib slab, 1/4 chicken. The sides to choose from were: Grandma Georgia's Macaroni and Cheese, Aunt Ada's Potato Salad, Big Sam's Baked Beans, Cousin Joe's Greens, Uncle Earl's Coleslaw, Regular Fries, Onion Rings, Fried Jalapenos, Wedge Cut Fries, Fried Okra, Sweet Potato French Fries. Wowzers, thats alot!\n\nSo for my meats I get the beef brisket, hot links, and 1/4 rib slab. The rib slab was a choice of baby back, beef, or spare ribs. I got the baby back ribs. My sides were Grandma Georgia's Mac and Cheese and Onion Rings. My friend ordered the full rack of baby back ribs ($18.00) which also came with 2 sides and a corn bread. Her sides were Sweet Potato French Fries, YUM!, and Wedge Cut Fries.\n\nMan was the food tasty. The meats were tender and super flavorful and the sides were huge. The best part is that I ordered a small fountain drink (sm $1.49 lg $2.49) since it was all you can drink and the waitress brings me a large 32 oz drink. I was like \"I ordered the small\" and she replied \"That is the small.\" Wow. I guess the large is a 44+ oz size then.\n\nThe $15 coupon definitely paid off and the food was really really good. I would definitely go back to this place. This was way better than Memphis Championship BBQ."
        }, 
        {
            "index": 371, 
            "rating": 5, 
            "review": "The food was amazing and the service superb...thanks cuzin Sharon! When you come to Vegas make sure you come here for a great meal"
        }, 
        {
            "index": 372, 
            "rating": 1, 
            "review": "Doesn't matter how good your food is, which their's is mediocre, with bad customer service.. girl at front who gave the \"cute\" black man his food first even tho I ordered first..you're place of business gets a 1. Never again!  People got places to be!"
        }, 
        {
            "index": 373, 
            "rating": 1, 
            "review": "Worst service ever!!! Food was good. BUT their service was not good at all. It's a small place with about 6 waitresses and still can't provide good service. Not organized at all! We waited Forever for our food!!!!  They got our order wrong, forgot to bring out part of our order. Corn bread was bland. Then they bring out the check without asking if we wanted a dessert (which we did) I told her we wanted bread pudding, she said ok and walked away. We waited for about 15mins only to find out they forgot about our dessert!! We had to get up and ask for our check again. Left very upset and they didn't even apologize. No one cares there. NEVER coming back."
        }, 
        {
            "index": 374, 
            "rating": 5, 
            "review": "I'm from the south so occasionally I get BBQ and sweet tea cravings. haha I haven't tried everything on the menu. I usually get the 2 or 3 meat combo and share with a friend. I always get the greens! I love the bb ribs, pork links and sweet tea. I'm not a fan of the chicken or potato salad but I think that's just a matter of taste. I love that they put a little BBQ sauce on the meat and give you a bottle of sauce on the side. The meat tastes smokey like its been on the grill. It's definitely a mom and pop type place which I think is part of the charm! I also love the koolaide and fried okra...did I mention the sweet tea?"
        }, 
        {
            "index": 375, 
            "rating": 4, 
            "review": "Just order the family meal through eat24 app and had it delivered. The delivery was pretty fast and the food is amazing, my only complaint is that I ordered potato salad and instead I received cole slaw. The ribs are just right, not too much sauce,the brisket is pretty bomb as well. Overall I am very satisfied would have given 5 stars but again I didn't receive the potato salad. \n\nI will definitely be ordering from them again!!!"
        }, 
        {
            "index": 376, 
            "rating": 5, 
            "review": "This is another of my favorite places to eat. Great food, it reminds me of back home in Virginia and the Sweet tea is like no other. The service is good, the owner TC is a very friendly and outgoing fellow. Service like that, will definitely make me come back. They have specials on various days and the have a spread of desserts as well. I recommend the banana pudding with a scoop of vanilla ice cream on top. I've been eating banana pudding all my life but since I tried with vanilla ice cream, I can't eat it without it lol. Every time I've been in it has seemed very busy, so if you had to wait to be seated I would be surprised. This place is definitely soulful with great meals, sides and the portions are quite worth it."
        }, 
        {
            "index": 377, 
            "rating": 5, 
            "review": "I came for the lunch special for takeout :) I had the rib tibs with a side of potato salad it was all very good."
        }, 
        {
            "index": 378, 
            "rating": 5, 
            "review": "OMG.....That's all I can say. The ribs were fall off the bone good. The service was great. The wait staff was very attentive and friendly. There is a great yelp deal as well for 10 dollars you 20 dollars worth of food. Highly recommend coming here."
        }, 
        {
            "index": 379, 
            "rating": 2, 
            "review": "I should have payed attention to all the warning signs and ran away.  In a strip mall strike one when it comes to bbq. No smoke smell whatsoever.  Strike 2. 1st plate came out fully sauced.  Strike 3. I should have been out of there.  But I had a Groupon.  Sigh\n\nOrdered 3 meat plate with ribs, rib tips and brisket. Came out all sauced and brisket chopped. This is a good way to hide bad bbq. I asked if the sliced brisket and they tried to to tell me it was.  Please sell this to someone who is clueless not someone who had reviewed 30 plus bbq restaurants from great to awful.\n\nFinally got my plate and was really unimpressed.  Everything was lackluster.  Rib tips sigh, ribs sigh and the pulled pork okay. It all needed the sauce.  Not good for a bbq place.  No smoke ring or Smokey flavor. I almost doubt there is a smoker on the premises.  Not sure outside of the sauce I would even call this bbq. \n\nThe sides mac and cheese and baked beans were better than the meats but still not awesone. \n\nThe one thing that earned this place a second star was the 1 dollar banana pudding. This is worth a stop just for dessert.  As I would never go here for any other reason.  The banana pudding itself earned this place the second star. \n\nI would not recommend stopping here of you like good bbq whatsoever."
        }, 
        {
            "index": 380, 
            "rating": 5, 
            "review": "T.C Rib Crib hands down great BbQ I really enjoyed the beef ribs the way ,they season the rib the meat was tender the sauce was off the meter"
        }, 
        {
            "index": 381, 
            "rating": 5, 
            "review": "My husband came across this spot a while back, and it's hella good! Love the fact that it's  family owned  too. Definitely  would recommend  it to anyone wanting a bbq fix."
        }, 
        {
            "index": 382, 
            "rating": 1, 
            "review": "DON'T BOTHER, it was a terrible experience from the moment we walked in: Unfriendly, No smiles, slow, gawd awful service. Full rack is ONLY 7 ribs. They came dry & charred with hardly any edible meat. We could do better ourselves!! Would've never heard of them if it wasn't for Groupon, yet u get treated badly when u pay with a Groupon. Ridiculous! SO NOT WORTH IT!"
        }, 
        {
            "index": 383, 
            "rating": 5, 
            "review": "Do not set foot in this place if you are on or are considering being on any sort of diet! \n\nThe food is amazing.  Large portions of freshly cooked great tasting southern/soul food.   For those from the south this is a taste of home.\n\nA tip... order your Kool-Aid by Color!  \"I'd like purple please!\" and don't be afraid to ask what colors they have today.  On one visit they had green (lime). (warning: don't order if you are diabetic.   This is the full sugar kind of kool-aid)"
        }, 
        {
            "index": 384, 
            "rating": 4, 
            "review": "Been here a couple of times young kid is very knowledgeable food is great love the Mac and cheese and baby backs girl isn't always the happiest but still nice."
        }, 
        {
            "index": 385, 
            "rating": 5, 
            "review": "Ordered food from here twice while I was on leave in Vegas. Hands down the best BBQ I ever had in vegas including the six years I was stationed here. We ordered the brisket and pulled pork the first time and I changed mine from pulled pork to the two meat platter the second time and chose the baby back ribs and quarter chicken. Anxiously awaiting its arrival but I have absolute faith it will be fantastic. As for sides. The salad was on point. The mac and cheese incredible and the potato salad...about average... but for vegas restaurants I've been to, that is amazing. I can only hope the next people that go here are as amazed as I was. Keep it up TCs!"
        }, 
        {
            "index": 386, 
            "rating": 3, 
            "review": "I seen it on fox five news.. So i decided to try it out .. As soon a i went in i was greeted by a short black dude .. And i took the 3 meat combo.. Home got 2 sausages and 3 ribs ..Ribs were great even doe there was no meat on them ..!!  I would try them again .."
        }, 
        {
            "index": 387, 
            "rating": 2, 
            "review": "Upon entering TC's, the decor is very warm & inviting. We were the only people in the place on a Saturday morning.\n\nWe wanted to come for breakfast. There was no breakfast menu even though they are open for it? Not a big deal, but wanted to try a new breakfast joint.\n\nService was a bit slow for being an empty restaurant, but we were not in a hurry so it was not the end of the world.\n\nOrdered a 3 meal combo & a cheeseburger.\n\nLet me say the sweet tea might have been some of the worst ever. I personally despise Lipton & GMO tea. I always felt a sweet tea would come from a brand maybe made or big in the South? Maybe a better brand? \n\nThe meal came... the cole slaw & mac & cheese were our sides. I will say this was some pretty great mac & cheese. The cole slaw was blended perfectly as well. The sides were better than our meats (brisket, pulled chicken, & rib tips).\n\nWhether it was the brisket or the pulled chicken, something had a weird aftertaste to it. Not sure if it was the sauce or freezer burn. \n\nCheeseburger was nothing special. Just a frozen patty fired up. Some meat probably purchased from Sysco Foods. A shame because a ground burger from Brisket would have been totally better. \n\nThis is one of those rare moments where I felt bad for the struggling business. If I could nominate them for Restaurant:Impossible, I would. The decor is so nice and inviting to just have a dud in food."
        }, 
        {
            "index": 388, 
            "rating": 2, 
            "review": "It was just okay. The ribs were good. Everything else (sides and stuff) was just okay. Not sure if I'd travel across town to go there, but if o was on that side of town and was really hungry for ribs then I'd go back."
        }, 
        {
            "index": 389, 
            "rating": 2, 
            "review": "I visited this restaurant on Sunday early afternoon. The food was ok. Our macaroni and cheese was cold. Gross. I've also never see diced up brisket before. It was alright. \n\nUnfortantly, when I left the restaurant I left my cell phone behind. Not 15 minutes later did I realize this. We called the store and the manager claimed it wasn't there. We went to the store and there was no phone. The female told me no one had been in the store since I left but she didnt have it. I asked to speak to a different manager and se said I couldn't. She said the owner doesn't allow customers to call her. I left an alternative number to be reached on. No call. On Monday night my phone text my friend saying someone at rib crib had it and to come get it. I went Tuesday when they opened to get it. My phone was returned minus my $37 dollar case. The owner was nice and offered me a free meal. However I nor will\nI allow anyone else I know to return to this restaurant. There is just something not right about a waitress stealing your phone."
        }, 
        {
            "index": 390, 
            "rating": 1, 
            "review": "Went here the other night and when I walked in with my family there were only two people there.. Didn't think much of it, the service (at the beginning) seemed on top of it but once she placed our food down we never saw her again! Everyones drink was empty and I had to call a different waitress to get us the bill.. \n\nLet's talk about the food. I had pull pork sandwich with sweet potato fries I can say it was good (8.99). My husband had brisket and it was horrible! It tasted like lunch meat and was just smothered in this sour BBQ sauce... (recommendation- smoke your brisket) it was 12.99 and the portion was so small. (not worth it) My daughter had two beef ribs that didn't even have enough meat on it AND was too spicy for a 6 yr old to eat! I tasted it and couldn't eat it. Why would they put that on the kids menu and not specify that their BBQ sauce is spicy?! \n\nWe obviously couldn't tell our concern to our waitress because we never saw her again! This place is ridiculous and I wouldn't recommend it at all!!"
        }, 
        {
            "index": 391, 
            "rating": 4, 
            "review": "So this restaurant met all of my expectations, and I left very full and happy. As someone who's spent most of their life in Oakland and LA, I have been looking for some soul food bbq for a while now in Las Vegas. And I want to be very clear about it being SOUL FOOD bbq. It's the kind of bbq that your uncle cooks at the family picnic. Nothing exceptionally spectacular, just pretty good bbq. It's obviously not going to win any Food Network World Champion BBQ competitions, but it was cooked well (the pork on my ribs literally just slipped off the bone) and has good sauce. \n\nThe sides were also good. I got the mac and cheese and greens, which were far superior to what I was served at M&M's. The mac and cheese was perfectly seasoned (I only added a little bit of pepper, which I do to everything as almost a tick), and the greens were the perfect mix of sweet and salty. Most meals also come with a cornbread muffin, which was ok. I personally prefer slices of white bread with my bbq, so I'll consider asking for that next time I come. They also have all the best soul food drinks (Kool-Aid, Sweet Tea, Muddy Water), and come in a massive cup for like $2. My red Kool-Aid was literally served to me in the biggest cup I have ever received.\n\nThe atmosphere was typical of soul food restaurant: family photos on the wall, R&B music playing, those slippery booths they also have at Subways. The dinnerware were those hard plastic ones, and the utensils were disposable plastic ones. I wasn't mildly surprised by any of this, because, once again this was typical of SOUL FOOD BBQ restaurant. I've been to bbq restaurants that literally have three tables, and give your your food in Styrofoam containers regardless of whether you're taking it to go. \n\nThe only thing that I found a bit unfavorable was that I thought it was a bit pricey for what your got. My 1/4 rib meal cost $11, and only came with one side (I split the other with my friend). That being said, I rarely leave a Vegas restaurant under $10, so I wasn't too surprised. \n\nAll in all, TC's Rib Crib is pretty good soul food bbq spot, and I'll definitely be back."
        }, 
        {
            "index": 392, 
            "rating": 4, 
            "review": "i love TCs! best macaroni and cheese i have ever had. collard greens are flavorful, BBQ is succulent, and banana pudding is to die for!\n\nthe place itself has a real mom and pop family oriented feel. yelp had a $10 for $20 coupon and i definitely took advantage of that to purchase bucket loads of their mac and cheese for last years Thanksgiving. My family loved it. Check out their website for daily deals too. On tuesday they have 2 for 1 meals. i wish i lived closer to this place."
        }, 
        {
            "index": 393, 
            "rating": 4, 
            "review": "Came here on T. C. 's 76th birthday  so we had good carrot cake & chocolate cake for dessert after our meal of 1/2 all white BBQ chix with 2 sides ($11.99) & 2 meat combo  beef brisket & pulled pork with 2 sides fried okra & mac n cheese ($14.99).  Our server Mona was so good & personable.  We also won the raffle they had which was a prize of a $10 gift cert & a white T.C.'s Rib Crib Tshirt (the server's are in black Tshirts)"
        }, 
        {
            "index": 394, 
            "rating": 5, 
            "review": "Now that's BBQ!!!! Took one bite and I already knew what the rest would be like.. Tender.. Juicy.. And FLAVOR!! Great work guys.."
        }, 
        {
            "index": 395, 
            "rating": 3, 
            "review": "We have heard good things about the ribs so we tried it this past weekend the staff were all friendly. I had the pulled pork with sweet potato fries. The pork was good but the fries were over done. My husband had the ribs which also were good but his onion rings were to done. The dinner ware was plastic which just was a turn off."
        }, 
        {
            "index": 396, 
            "rating": 3, 
            "review": "I enjoy southern cooking, so I stopped in at TC's Rib Crib to try their beef ribs. I have to say that the beef ribs were disappointing. There was not much meat on them. They decently do not come close to Lucille's beef ribs. The catfish was excellent though. I will definitely be back for the catfish."
        }, 
        {
            "index": 397, 
            "rating": 5, 
            "review": "I've travelled all over the south and Texas. This is the best BBQ there is. Service is great. Get the desserts, the donut bread pudding is amazing."
        }, 
        {
            "index": 398, 
            "rating": 5, 
            "review": "Ordered for delivery and what a great experience!!!!!!\nFood arrived timely and piping hot........\nSpare ribs, brisket, hot links, greens and mac and cheese!!!!!\nMeat tender and full of flavor!!!\nSides are like grandma use to make......\nWill recommend to many!!!"
        }, 
        {
            "index": 399, 
            "rating": 3, 
            "review": "Everytime I pass by I always see a sign for $4.99 lunch specials but when I look at the time it's either to early or to late. I always slow down looking at the sign as if it would magically change. $4.99 has to be a really good deal for BBQ so to save some bucks I wanted to go during lunch. Passed by on a Saturday, like clock work I see the sign, slow down, read the sign, and check the clock.  Almost continued on as usually but it was lunch time so turned at the next chance.  \n\n\"Yea Im gonna get my BBQ ON!!\" Not so, no lunch special on Sat and Sun but a 2 for 1 breakfast special which was OK but I really wanted some BBQ.  Not much of a BBQ menu for breakfast, mostly omelets and waffles. Ordered the brisket omelet not my favorite I was expecting it to be covered with BBQ sauce and big chunks of brisket pieces instead there was tiny slices of brisket and not a lot of taste.  All there was on the table was hot sauce and ketchup. It was plenty filling though. Next time I'll see if they can give me some BBQ sauce.\n\nI ordered some BBQ to go. Some of their \"world famous\" BBQ ribs which tasted really good and the meat fall off the bone tender like it suppose to.  The full slab was $20 but had a $10 for $20 yelp coupon so scored.\n\nI had the craving for some brisket, hence the brisket omelet, so ordered that to. Again I was expecting thick pieces of brisket, you know something you can cut with fork.  Instead very thin slices kind of how you would eat deli meats.  It was also rubbery and chewy, not a fan of the meat but loved the sauce.\n\nServices was good, friendly and warm must have been the holiday season.  The place was decked out for the holidays, stocking hanging, xmas tree, and music playing.  It was slow there so I don't think they mined me stay there a just relaxing after I ate.  Even stole a few ribs and brisket pieces out of my containers before I left LOL. They have dessert but I had no room, menu say to ask for their $1.00 dessert of the day.  I'll probably be back for more ribs and to try more of their BBQ menu. I like all of the old photo all over the wall."
        }, 
        {
            "index": 400, 
            "rating": 4, 
            "review": "The beef ribs! Never eaten at TC's but we had TC's make some beef ribs to come home. The beef ribs were a hit with my family. The sauce was so good, it made you wanna smack your mamma! Besides the sauce, the beef was tender. My only gripe was the lack of beef on the rib, it wasnt love at first sight but once eaten that all changed. Other than that the ribs were really good."
        }, 
        {
            "index": 401, 
            "rating": 4, 
            "review": "Great mac and cheese to go with my fried chicken. I usually burn my fingers trying to eat the chicken because I don't wanna wait. It's that good to me. It's worth it!"
        }, 
        {
            "index": 402, 
            "rating": 1, 
            "review": "I must make this clear. This isn't a review of the food, which is wonderful, but of the TERRIBLE service that my Dad and I experienced today.\n\nWe were both in the mood for BBQ, and having been to TC's before at the old location, we decided to check out the new place. We walked in and were greated by the waitress on duty, a young Asian woman, who promptly seated us and gave us menus. There was only one other group of people in the room, which was surprising. We sat there looking at the menu for about 10 minutes, and then she finally took our drink order. After that, she dissapeared. Another 10 minutes walked by and we got up to leave. We crossed paths with her as we were walking out and she asked if we were leaving as she had the drinks we had ordered 15 minutes prior in her hands. We said yes, and she just said, \"Okay,\" and dumped the drinks out in the sink.\n\nThis girl has to be one of the worst waitresses I have ever experienced. She obviously doesn't care at all about service, and I'm pretty sure the owners of the restaurant would be a little miffed at her for the waste of the drinks. \n\nI almost wish TC's had stayed at the old location, as it had much more of a family-oriented vibe to it...much more intimate. I'm going to give TC's another shot sometime in the future, but I think I'll call in the order and pick it up rather than face this sort of service again.\n\nIF YOU SEE THE YOUNG ASIAN WAITRESS BEHIND THE COUNTER WHEN YOU WALK IN, YOU MAY AS WELL JUST TURN AROUND AND WALK OUT. Unless you want to be ignored for a good 30 minutes, that is."
        }, 
        {
            "index": 403, 
            "rating": 2, 
            "review": "This is painful. We've been coming here since shortly after the folks running TC's Rib Crib escaped hurricane Katrina. We bragged about them and sent our friends. \nI can no longer recommend this place. We spent $30 on beef ribs that were way too fatty, probably boiled first, the greens were bitter and stringy. \nThese people used to win awards. I don't know what happened but, the lost they touch."
        }, 
        {
            "index": 404, 
            "rating": 5, 
            "review": "Heads Up, this place has moved to behind the O'Leary's Pub on Durango just south of Spring Mountain. \n\nAnyways, this place makes great food. I agree with other reviewers that it isn't as great as what you'd find in Texas but this is vegas not Texas so for the area their food is great.\n\nIf you want to have your socks knocked off then try their banana pudding. It's my favorite thing about this place."
        }
    ]
}