{
    "category": "Las-Vegas", 
    "entity": "Noodle-Shop", 
    "avg_rating_stars": 2.228723404255319, 
    "review_count": 376, 
    "reviews": [
        {
            "index": 1, 
            "rating": 1, 
            "review": "Panda Express is god compared to this place. Grossssssssssss"
        }, 
        {
            "index": 2, 
            "rating": 1, 
            "review": "You would think this would be the perfect place to cure a hang over right? ...We were wrong... there was 10 of us and we only had to wait about 15 minutes for them to clear 2 tables for us. Once we were seated, we looked at the menu only to find the prices were pretty freakin nuts for the type of food this place offers. (ie. $20 for pho, $18 for pad thai, $18 for wonton noodle, $26 for wonton, scallop, pork, vegetable soup, $10 eggrolls, $4 for thai ice tea, etc **these aren't the exact prices but its around this price**).\n\nAfter ordering our food, we had to wait about 15 minutes just to get our drinks. Had to wait another 45 minutes to get our food. I guess they wanted to serve us all at once so half of the food that came out was already cold or room temperature. Onto the food.... ABSOLUTELY the worst chinese/vietnamese/thai food we've ever had. Everything lacked flavor, meats and seafood was chewy, soup tasted water down, portions were kind of small for what you pay for, etc. I work and eat in downtown Oakland China Town all the time, and The Noodle Shop doesn't even compare to anything there.... Pho or wonton noodle soup is my hang over food, and this place just wanted to make me throw everything up.\n\nThis place was highly understaffed, and the cooks were slow.... My friends and I have already made complaints, so in the mean time...STAY CLEAR AWAY!!! You're better off walking 5 minutes away to McDonalds!"
        }, 
        {
            "index": 3, 
            "rating": 4, 
            "review": "Extrememly fast service which is great when you need a quick lunch while at the pool.  Har gaw dumplings were great as was the seaweed salad. Soup was huge and more than enough for 2, so when they tell you it's small, don't believe them!"
        }, 
        {
            "index": 4, 
            "rating": 2, 
            "review": "Had a quick meal here as it was 2pm and all we had to eat so far that day was Fat Tuesday's frozen daiquiris (yes, with the extra shot). I wasn't about to repeat my L'Atlier experience from last year. I needed something in my stomach before dining at Sage, stat! My friend ordered the beef satay and I got the Hong Kong won ton noodle soup. I've had better, but for under $12 it hit the spot. The broth lacked any of the subtle nuances that you can get with ramen broth, but the won tons had generous amounts of shrimp (and not much else). My friend thought her beef satay was way too sweet. Service was well, true to what I call \"Asian restaurant service\"--they bring you your food and leave you alone. I rarely tip 15% nowadays but here is where it may be justified. The reason why this place exists is because Vegas attracts a lot of Asian gamblers and if they're like my parents, they would prefer to eat Asian food. Heed my advice and do not eat here if given the choice. A better meal awaits you somewhere else."
        }, 
        {
            "index": 5, 
            "rating": 2, 
            "review": "Since my son wanted some Asian food and this place is just downstairs we had to give it a try. We had BBq pork -roast duck combo. Fried rice.\nAll we good  also my son had the wor won ton soup.  As with every one else I think it was pricey for the type of food.  What I don't understand is \nif the food is blah why is it so dang busy.  The 1st time we ate there we were greeted and seated within minutes.  The 2nd time we ate there yes we ate there twice. The was a wait for about 15 minutes or so before we got in.  The waiter were ok although they do tend to forget about once they serve your food.  Over all experience 2 stars If I only knew there was a Panda express across the street you'll be better off eating there."
        }, 
        {
            "index": 6, 
            "rating": 3, 
            "review": "Ok spot. Way too pricey considering many many many many other asian hybrid places do it better."
        }, 
        {
            "index": 7, 
            "rating": 4, 
            "review": "I don't know why this place has such a bad wrap. I have been going here since they opened, which was a long time ago\nTonight I had the shrimp dumplings, hay graw and BBQ pork which were all delish\nI also managed to have a Sapporo with sake. I will admit that the price is ridiculous though... Favorite spot so it won't stop me!"
        }, 
        {
            "index": 8, 
            "rating": 1, 
            "review": "Food was weird. Not a typical Chinese restaurant, really bright lighting. The pad Thai was bland and tasted like uncooked fish. The hot and sour soup looked like it had already been digested and regurgitated. Would not come back."
        }, 
        {
            "index": 9, 
            "rating": 3, 
            "review": "I come here to eat roast duck noodle. I always order double meat and the duck can't be fatty. It's always pretty good. One time I forgot to be fussy on my order like I always am. The duck in the soup was disgusting. If you like non fatty duck, don't forget to be fussy when you order your duck soup."
        }, 
        {
            "index": 10, 
            "rating": 1, 
            "review": "We only walked in because nothing else was open at 11:30pm on a Saturday night. We sat down to a sticky table, the lady handed us some wet straws. We ordered the calamari appetizer and the Mongolian beef which were both way under Panda Express level. The Mongolian beef was drenched in sauce, and the calamari came out after we finished our dinner entree. This place is horrible, SAVE YOURSELF THE TRIP AND DONT GO. Order some room service instead. And it was expensive for what it was, paid $40 for this unpleasant meal."
        }, 
        {
            "index": 11, 
            "rating": 1, 
            "review": "The one star is way too much for this place , the most horrid food I have ever had .. Panda Express is fine dining compared to this. I ordered calamari to start and cashew chicken for my entre , the cashew chicken came first and it was really not edible , I never in my life had to spit food out until I tasted this sh....,  I really think this chicken was really old and had gone bad , it had a funky taste  and not in a good way ,, then my appetizer arrived and it was so bad I. Really couldn't get my self to eat beyond 2 bits.... How is this place in business ??? Why ???"
        }, 
        {
            "index": 12, 
            "rating": 3, 
            "review": "Noodle House at the Mandalay Bay. \n\nExactly what you'd expect from a Chinese Noodle House.\n\nPrice: Cheap.\nFood: Will satisfy most.\nServings: More than enough for one, unless you always eat supersized meals.\nPresentation: Nothing fancy, just straight out good food.\nTaste: We've ordered a few of their dishes and no bad words were spoken, well except that their China tea which cost like a mother... The beef tenderloin noodle i had was delicious. \nWait: It was fast, our food was served in the nick of time after we ordered, like fast food, except the food tasted better than we expected. \n\nNot a fan of noodle houses though. This place ain't that bad if you're craving for hot soup after getting buzzed."
        }, 
        {
            "index": 13, 
            "rating": 2, 
            "review": "I wish I saw the reviews before we went here.  Food was average, that's being nice.  Go elsewhere!"
        }, 
        {
            "index": 14, 
            "rating": 3, 
            "review": "Being of Asian descent, I always look for a place that serve a hot long noodle soup.  This place inside the Mandalay Bay Casino has such a dish.  Certainly there are better places for that like in Venetian or Bellagio.  And no soups can beat the one in the Monte Carlo.  But to their defense, this is not their specialty.  They serve Chinese food.  Not the greatest in the world, but not bad either.  I like coming here since I rarely have to wait and can get your standard Chinese dishes at a reasonable price."
        }, 
        {
            "index": 15, 
            "rating": 4, 
            "review": "This was a lovely little place!\n\nThe service was wonderful - very, very friendly waiter. \n\nFood was really good too. I had sweet and sour chicken which was better than your average American-Chinese stuff. \n\nThe pricing was exactly what I would expect from a similar hotel casual dining restaurant in Vegas - definitely no surprise there.\n\nI'd definitely stop by again!"
        }, 
        {
            "index": 16, 
            "rating": 1, 
            "review": "If you want the most expensive, least bang for your buck, biggest ripoff of a restaurant you can imagine, come here.  $8 for a bowl of soup (3-4 spoonfuls)?  My Chinese ancestors, preaching a culture of frugality, are rolling over in their graves.  I hate this place for making me feel so unjustified for spending that money...and seeing as that's all you do in Vegas w/ gambling and partying, for the Noodle Shop to be my biggest loss that weekend is just sad."
        }, 
        {
            "index": 17, 
            "rating": 3, 
            "review": "I have eaten here a few times over the years when conducting business at the hotel/casino. I have never been disappointed with the soups. I usually order the Wonton Shrimp or the Duck.\n\nThere are many awesome Asian restaurants in Las Vegas, away from the strip with great food and decent prices.\n\nI don't see this place as a restaurant locals would go out of their way to go to. They are serving hotel guests, gamblers or show attendees. They probably don't really care about their Yelp reviews as much as a local, non-casino restaurant would.\n\nWith that said, I would go back if I was already on the property and wanted soup but I would never go to this place as a destination restaurant."
        }, 
        {
            "index": 18, 
            "rating": 1, 
            "review": "Yuck, Yuck, Yuck!\n\nThe name is Noodle Shop, yet their noodle soup is probably THE worst on the strip or in the entire Vegas.  AND probably the most expensive too!  If you are stuck in Mandalay and you must have a bowl of noodle or you will die - still, don't go there. Just pick up a hamburger and go to bed.  Yes, it is that bad!"
        }, 
        {
            "index": 19, 
            "rating": 1, 
            "review": "Really really not good. Very pricey - everything was watery for some reason - inside of egg rolls were mush, and noodles and dumplings in soup were tough - Many other places that are so much better to eat at Mandalay -"
        }, 
        {
            "index": 20, 
            "rating": 1, 
            "review": "If all my friends get upset stomachs after eating here, expect that you are going to deal with an upset yelper.\n\nTrust me, I don't care so much if I get sick.  But when my friends get sick, THAT is the worst offense.  We couldn't really enjoy the rest of our night because our stomachs felt awful.  However, this is only the beginning of the offenses.\n\nIf my friends got sick, I wish at least I could say the food was good. IT WAS NOT! The food was not flavorful and noodles fell flat.  Some of our soups came out lukewarm.\n\nThe price of the food here too is completely ridiculous.  I understand that everything is a little overpriced in Vegas but COME ON! You are charging almost $20 dollars for poor quality pho?  You are better off gambling $10 dollars on slots and getting a burger and fries at McDonald's. At least then you would be decently full, maybe make some money, and still have your faculties about you to enjoy the rest of your day.\n\nThe one shining star was that the wait staff was super friendly and attentive. Unfortunately, this was not enough to overlook the poor quality and overpriced food here."
        }, 
        {
            "index": 21, 
            "rating": 4, 
            "review": "Let's start with the Seaweed Salad \nIt was ok it feels like it was missing something not \nSUre what \n\nAnd I went with the sweet  and sour chicken \nNow my friends I have to tell you , that was good it was flavor OVEr CHICKEN \" and I say that because most of the time wen I eat SS chicken oh Orange Chicken , is mostly breaded sugar .\n \nPascual was not my server , but he was on top of everything, water ,how was everything,do I need anything,ect... My actual waitress forgot about me , she only came by to bring my food and the check  ,, we need more customer service like Pascual ."
        }, 
        {
            "index": 22, 
            "rating": 2, 
            "review": "Mediocre Chinese food.\n\n+ Located inside our hotel so it was convenient.\n\n- Small portions\n- Somewhat expensive\n- Small portions\n- Small portions\n- Small portions\n- And last but not least, SMALL PORTIONS! \n\nThe one plate per person rule doesn't apply here.  Two or three plates per person would be more fit.  \n\nIn Vegas, restaurants should have one of two things: \n1) Great food  \n2) All- you-can\nThis place has neither.\n\nI think the food would've tasted a whole lot better AFTER the Halloween party..."
        }, 
        {
            "index": 23, 
            "rating": 2, 
            "review": "We ordered Moo shoo Duck, Wonton Noodle Soup, and Pad Thai. The Moo Shoo Duck was a bit salty and the wrappers were dry and fell apart before anything was added to it. The wonton were really still and hard and you couldn't tell if there was shrimp in there or not. The noodles were soft, which was nice but not memorable. The Pad Thai was flavorless and the noodles were HARD!! \n\nThe busboy who brought out the drinks was efficient. Our server who brought out our food was in some big rush even though the place was pretty empty. He reminded me of Jackie Chan, running around, carrying a zillion plates and putting them on our table so fast and talking a mile a minute that we could barely comprehend what was going on. \n\nThe restaurant is pretty nice and clean, but I've had better food for half the price."
        }, 
        {
            "index": 24, 
            "rating": 1, 
            "review": "Way too over-priced for a not-so-great bowl of pho. The pho was bland and not worth $16. The duck noodle soup wasn't great either. The duck was on the dry side. I will never coming back!!!"
        }, 
        {
            "index": 25, 
            "rating": 3, 
            "review": "Had dim sum sampler for 2, seaweed salad, BBQ pork noodle soup.\nIt was just a sponteneous lunch at Mandaley. \nPrice was not cheap either (we paid about $60).  Will go Chinatown next time."
        }, 
        {
            "index": 26, 
            "rating": 2, 
            "review": "$16.00 for a bowl of pho. you get about 5 or 6 pieces of beef which are very tough, and I think they use a a lot of MSG  in their soup. Service is OK."
        }, 
        {
            "index": 27, 
            "rating": 3, 
            "review": "This place is honestly not all that bad. The rating for the Noodle Shop is probably low just because A) not everything here is tremendous and B) the prices. I get it. The prices are lofty, but the food is homey and comforting.\n\nWe decided to get the dim sum sampler, the duck noodle soup, the shrimp dumpling noodle soup, and the sichuan.\n\nThe sampler? Probably not worth the $20. You get four different types of dim sum, with 2-3 pieces of each type. Tasty, but it might've been better if it were $10 or so.\n\nEverything else was very good. The duck in the noodle soup was perfectly cooked, the shrimp dumplings were tasty and plump, and both noodle soups had great broths and noodles. The eggplants were especially delicious.\n\nWhy a three? Though the food was tasty, I JUST found out that restaurant.com offered a coupon for the Noodle Shop... SO ANGRY RIGHT NOW. Don't make the mistake I made -- retrieve a gift card from restaurant.com before you go here!!!"
        }, 
        {
            "index": 28, 
            "rating": 2, 
            "review": "Decent quality noodle soups here, but docked 2 stars on the value proposition.  What goes for $13-$15 here, can be had for maybe $7 in Chinatown.  2x for the Mandalay Bay premium seems a bit high.  This place used to be more of a cheap eats business, but has since changed."
        }, 
        {
            "index": 29, 
            "rating": 2, 
            "review": "Nothing more disappointing then getting bland Thai food. Should have checked the reviews first. The Thai iced is good, hard to screw up but the pad Thai has no flavor. They asked me if I wanted it spicy, said yes, no spice to be detected. Don't waste your money, much better elsewhere."
        }, 
        {
            "index": 30, 
            "rating": 5, 
            "review": "I don't know what all the bad reviews are about. My family and I had dinner here and we got huge portions everyone shared their food! It was great! Servers and waiter were super sweet. The food came out fast. I would definitely recommend this place. Try their beef chow fun it's amazing!"
        }, 
        {
            "index": 31, 
            "rating": 1, 
            "review": "SLOW SERVICE, and its expensive, which is fine if they could've at least made my food the way asked (extra spicy, extra garlic) instead it was the exact opposite. Did I mention how slow they were? \nIt seriously took 10 minutes to see a waiter, we almost walked out. Then the drinks came after the food and the appetizer came with our entrees. Then while waiting on our change the woman decided to sit 2 couples then answer phones, maybe they are understaffed.  I finally had to get up and ask for my change before she continued to seat people!"
        }, 
        {
            "index": 32, 
            "rating": 1, 
            "review": "Food poisoning from the congee. I wish I had read reviews first. Avoid!"
        }, 
        {
            "index": 33, 
            "rating": 1, 
            "review": "Rude waiters. Guy with the squeaky voice and bowl haircut gave me an attitude when I ordered takeout and then the food wasn't even hot when I got to my room. They also didn't pack soy sauce. \n\nThe Singapore noodles ended up causing me to throw up. I think the shrimp was bad. \n\nDon't eat here. It's not a convenience and you'll hate yourself when you wasted money on an overpriced casino restaurant that makes Panda Express look like the French Laundry."
        }, 
        {
            "index": 34, 
            "rating": 1, 
            "review": "Never come here. The food is terrible. We ordered the chicken wraps and didn't even know what it consisted of it looked and tasted horrible. Ordered the chicken satay and yuck that was bad too. We ordered the veggie spring rolls that were super mushy in the middle and probably only tasted decent because they were fried. They need help in the kitchen."
        }, 
        {
            "index": 35, 
            "rating": 3, 
            "review": "This was a nice source of comfort food to get ready for an evening of debauchery.  I had a bowl of Pho....actually a HUGE bowl of Pho!  My friend had a bowl of chow mein.  We were thoroughly satisfied with our cuisine.\n\nThe server was very attentive, nice, and efficient.  \n\nThis restaurant is located in within the cavernous halls of the massive Mandalay Resort."
        }, 
        {
            "index": 36, 
            "rating": 1, 
            "review": "All 5 of us agreed that this was the worst asian restaurant we ever ate at. Avoid at all cost!"
        }, 
        {
            "index": 37, 
            "rating": 1, 
            "review": "Hello food network, we need intervention - please run an episode of restaurant impossible. Their 16 dollar bowl of pho is awfully bland, you are certainly better off driving 2 miles off the strip to eat a more graceful bowl of pho. I also had their fried rice and it was awful as well. For a restaurant inside a major hotel, I expected plenty more."
        }, 
        {
            "index": 38, 
            "rating": 4, 
            "review": "I love this place.   Ok , the food is straight up average , BUT .. I like that the staff is Asian and they're honest with suggestions.  I've eaten here at least 10 times now.  It's been consistent over the years.   If you're looking for the best of the best , this isn't the place.  If however you're looking for decent consistent Asian noodles then this is a great place.  \n\nMy favorite is the chow fun and house special fried rice.   The Pho is VERY American so if you're looking to re-live that trip to Vietnam it's not gonna be for you.... But I still like it in a hurry.  Honestly it's probably only on the menu as a stop gap for traveler who only know Pho from some American back home spot. \n\nBottom line ...\nIt's clean , fast , honest , and priced accordingly for where its at.  \n\nIt's my go to spot for quick lunch and light dinner when I'm at The Mandalay.  \n\nEnjoy."
        }, 
        {
            "index": 39, 
            "rating": 1, 
            "review": "Disappointing flavorles & soupy pad tha with an off tasting filet of chicken sliced into.\nI should have complained to the management to get a free meal comp for another Mandalay Bay  I think this was the worst pad that ever, boxed is better!"
        }, 
        {
            "index": 40, 
            "rating": 4, 
            "review": "Disappointed that website had number to call for reservations.... I called and NO reservations, but then no waiting..  Website also had kids menu, but got there and NO kids menu BUT server made up for it by honoring kids menu items anyhow.  Food was probably 3.5 out of five.  Staff and service was excellent and warrants the fourth star.  Price comparable to everything else around, higher than it should be."
        }, 
        {
            "index": 41, 
            "rating": 3, 
            "review": "This place was neither bad nor good. It is one of those places that tastes better as your hunger increases. The food is not bad nor is the value. I most certainly have had worse. Obviously this doesn't sound like a glowing thumbs up but in all honesty it is just \"ok.\" The service is marginal at best but if you find yourself with a growl in your stomach and you walk by this place you can rest assured that you will get a decent tasting meal. This place might fair better as a small local hole in the wall Asian restaurant but it is in a major Vegas hotel so the standards shift a little bit. I do not regret having lunch here but I wouldn't tell anyone to drop that hot hand at the tables to come for eats at the Noodle Shop. \n\nThe wonton noodle soup was very basic, nothing fancy. It had a decent broth and I felt satisfied eating it, how much will I remember of it after....well that's another story."
        }, 
        {
            "index": 42, 
            "rating": 4, 
            "review": "I've eaten here a few times now and been pretty pleased. I can think of places worth two stars but this is not one of them. The Singapore noodles are great, with generous amounts of shrimp and chicken. The shrimp were not at all fishy. The shrimp dumplings were plump with shrimp and also very nice. The BBQ pork with mixed vegetables was surprisingly good, very nice assortment of vegetables and a flavorful sauce. Service was fine, though the restaurant was not crowded and the lady with the mop should have waited till we left before mopping all around our table. I would go here again next time."
        }, 
        {
            "index": 43, 
            "rating": 1, 
            "review": "Unfortunately we were in a hurry to eat before dashing off to a show, so we didn't bother to look at any reviews before crossing the threshold. Strategic error. \n\nOur party ordered, among other things, the pad thai and the duck. I had the pad thai, which literally consisted of over 50% grilled white onions. Seriously.  There were more onions than noodles.  The chicken was undercooked, and possibly a little raw.  My brother's duck was mostly bone and skin. All of this was way overpriced. Avoid. Avoid. Avoid."
        }, 
        {
            "index": 44, 
            "rating": 1, 
            "review": "Extremely disappointed! I waited over 20 minutes for the worst, overpriced meal I had in a long time.  My takeout order was the roasted duck with rice.  A pretty basic choice -the duck was over cooked and salty.  \n\nThe meal seasoning must have been all MSG, because my entire body started itching  & developed hives.\n\nIf Maladay Resort was smart it shut it down.  Foolish of me for not reading the reviews first."
        }, 
        {
            "index": 45, 
            "rating": 4, 
            "review": "Good food decent price only complaint lettuce wraps made with romaine everything kept falling out but the taste was really good."
        }, 
        {
            "index": 46, 
            "rating": 2, 
            "review": "It's easy to find and centrally located in the casino.  It's fairly large with plenty of seating, cute asian themed decor and seems deceptively nice.  But . . .  it is a disappointing lunch spot.\n\nFirstly or waitress was hard to be found when needed, slow, not very friendly and overall not horrible but not good either.  We had to ask other staff in a nearly empty restaurant to help us.\n\nThe food.  Well I ordered the pad thai, it's a fair amount of bland food.  It just didn't have a lot of flavor, from the chicken to the noodles - nothing.  The peanuts were the only saving grace of the dish.  I also shared a pairing of meats including ribs and duck.  The duck was a little dry but fairly good.  The ribs though good hardly had enough meat.  So it was pretty ok.  The white rice was good . . . .\n\nOf course it's expensive, it's Vegas but the quality of food and service did not match the prices."
        }, 
        {
            "index": 47, 
            "rating": 2, 
            "review": "Food was good but their serivce was terrible! Our waitress was very rude and it was extremely difficult to get her attention."
        }, 
        {
            "index": 48, 
            "rating": 1, 
            "review": "This place was an absolute joke! My husband and I were on vacation so we happen to get hungry while in the Mandalay Casino and decided this was most convenient. Our waitress (Wendy was her name) went straight to getting our drink orders and then came back to take our food order. She was not personable and she may hate her job. She then came back with our food and that was the last we saw of her. She didn't ask us how anything was or if our drinks needed refills. I then went to go pay for the bill and was just wanting to get out by that time. The lady at the cashier desk asked us how it was and after explaining our experience, she just said that she would speak to her after her shift. No apologies and nothing offered to help. A discount would've been nice being that the food was way better at any other food court eaten while we were there. But seriously don't even waste your time!!!"
        }, 
        {
            "index": 49, 
            "rating": 5, 
            "review": "Best chinese food ever in my life \n\nThe real Chinese food for Asians!　正　宗的　　港式　面　　炒　饭　，　不　错"
        }, 
        {
            "index": 50, 
            "rating": 1, 
            "review": "Disappointed!!! Don't come here. \n\nHorrible service!! Rude. \n\nExpensive but food was not worth it! \n\nMy friends and I came here to get lunch and the soup we ordered was bland, the wontons were small and lacked flavor. The Thai food was extremely bland, and the the rice dishes....how can you mess up rice?!! \n\nWhen we asked the waiter to split the check , he made a big deal about it and gave us a scolding look and told us that we should have told him earlier. BUT HOW ARE WE SUPPOSE TO KNOW?!  No one told us ahead of time and all places let you asked for split checks at the end! \n\nRidiculous. Don't come here. The waiter watched us write down how much tip we were giving him...he lingered behind us. And then picked up the receipt as soon as we put the pen down and stared at the tip amount in front of us and walked away without saying anything to us. \n\nSo rude! Never coming back here!!! I think he might have also been the manager. Unbelievable."
        }, 
        {
            "index": 51, 
            "rating": 2, 
            "review": "We stopped in for a quick bite to eat before we caught our flight.  For hunger purposes it served its need.  I've eating many Asian soups before and this one wasn't anything to brag about.  The shrimp wonton noodle soup was equal to ramen noodle with delicate dumplings. For the price just grab a bagel or something else if you are famished or go in the gift shop or better yet wait until you arrive at the airport."
        }, 
        {
            "index": 52, 
            "rating": 1, 
            "review": "Anyone that gives this place more than two stars deserves to have their yelp account taken away. \n\nGot the cheaper kung pao chicken (14.50 I think) and immediately regretted it. I would pay 5 dollars for that entree. \n\nAlso, the noodles my friend ordered came out in less than 5 minutes. \n\nI don't know about you but 5 minutes is not a lot of time to cook(reheat) anything. \n\nThe only reason any1 should ever come to this place is when all the other places inside the hotel are closed.\n\nMake sure to plan your day accordingly :)"
        }, 
        {
            "index": 53, 
            "rating": 4, 
            "review": "Glad I didn't read the reviews before I ate here.  Actually ordered to go twice during our stay.  Ordered only two items and both times my daughter and I were very happy with the food.  The hostess actually recommended these two items. Yes expensive for Chinese food , but isn't everything in Las Vegas expensive? The pork, chives and shrimp dumplings had a solid amount of meat in it with a light dumpling skin.  Only 4 of them but so delicious.  The chow mein was so great especially at 10:30pm at night.  Both hostesses who took my order were very friendly and my food was ready within 10 min.  We got Togo a second time because I knew my daughter wanted it again.  I'd go here again to our next visit to Mandalay bay."
        }, 
        {
            "index": 54, 
            "rating": 3, 
            "review": "some haiku's\n\nFifteen dollar Pho?\nOh hell no, I don't think so\nWe shared other stuff.\n\nVietnamese drip\nThe coffee helped me revive\nAfter long weekend"
        }, 
        {
            "index": 55, 
            "rating": 4, 
            "review": "I ate at the Noodle Shop several times while I was in Vegas. Initially because it had the shortest line but two more times because their menu was extensive and reasonably priced. I had duck last night that was delicious."
        }, 
        {
            "index": 56, 
            "rating": 1, 
            "review": "I feel bad for the folks who had not tried asian cuisine before and this place happened to be their 1st time. Worst Pho we have ever tasted. Incredibly bland, aboslutely no flavor. Bad service. And of course everything was overpriced. Such a huge disappointment for a great location."
        }, 
        {
            "index": 57, 
            "rating": 1, 
            "review": "Honestly horrible. Ordered tofu pad Thai and got chicken, plus it was just tasteless. The rice was overdone. There were more bean sprouts than actual rice. No flavor whatsoever. Never again."
        }, 
        {
            "index": 58, 
            "rating": 1, 
            "review": "Ok, dined here last night for the third time in 2 years. Sorry Mandalay Bay but the Noodle Shop is just terrible and horribly overpriced. I swear the chefs have no idea what chinese and thai food is supposed to taste like. If I buy an asian cookbook can I open a restaurant?  Seriously, for the third time the pad thai was a wattery soup that tasted like jiffy peanut butter.  The lettuce wraps had absolutly NO seasoning or flavor. The mu shu duck was fair but the pancake was so dry it just crumbled upon folding. Why is this place soooooo bad yet stays alive. If you think panda express is great asian food you will still be utterly disappointed! There are so many great noodle shops in Vegas that are traditional, delicious,  and less expensive, try the one in the back corner of the Venetian!\n\nBy the way, I was sober every time I've eaten here.\n\nDo not waste your money or one good evening in Vegas."
        }, 
        {
            "index": 59, 
            "rating": 3, 
            "review": "This was the place to stop by after that late or tweener flight into vegas.  It was nice to go somewhere casual after getting in, have a bowl of noodles.  Yes.... it was a bit expensive, but for \"strip\" eating, its about par.... par meaning about 40% high, but with good service to match."
        }, 
        {
            "index": 60, 
            "rating": 3, 
            "review": "I agree with other reviews that service here is really odd. We were seated immediately and then sat waiting for quite a while before the hostess came and took our drink order. I requested a Kirin beer, and then what seemed like a very long time later (and we flagged down staff to ask where our drinks were) I was given a carrot juice. Definitely a possibility of a language issue there... but hey, if you like carrot juice, they have it.\n\nWe ordered the Hong Kong Noodles and Singapore Noodles. The first was on the bland side while the latter was bursting with flavor. The Dr. the taught me a few tricks of using the provided sauces, spices to enhance the meal. The food was great and you get a lot for your money. We could have easily shared 1 of the noodle plates. \n\nStill the service needs to improve. As we ate, you could see tables around us also getting slow service and waiting for their bills. I stick with 3 stars based on the quality and quantity of food."
        }, 
        {
            "index": 61, 
            "rating": 1, 
            "review": "I don't understand how it survived this far and I regretted for taking a chance despite its low ratings on Yelp.\n\nWe ordered 4 dishes which cost almost the same as two dinner buffets but all of them were so disappointing that I left hungry. They were overly salty without the right flavors. Even Panda Express makes better Chinese food in my opinion."
        }, 
        {
            "index": 62, 
            "rating": 4, 
            "review": "My husband and I really enjoyed this place.  The soups are a must for a good hangover!  I'm giving it 4 Stars because of the Roasted Duck soup, and the service was friendly. 5 Stars are for the \"OH MY GOSH!\" places. While good, this wasn't one of those.\n\n  I think the reason people aren't giving this place better reviews is because they are used to their hometown Chinese joint, which I get, and because it's Vegas and it's pricier than their hometown too! LOL.  We loved it!  It tastes like Sam Wo's in SF, CA! Which I LOVE!  My sister ate here as well with us, and we've literally been craving the place, and my sister is SUPER picky with food!  So, there is my opinion!  I love it."
        }, 
        {
            "index": 63, 
            "rating": 3, 
            "review": "EXPENSIVE NOODLE SOUP, but boiling hot soup sure does help from a night of hard partying in Vegas. Sure it's 110 degrees outside, but inside the Mandalay it's a cool, crisp 70+ degrees!\n\nI only had the Roasted Pork Egg Noodle Soup and I must say, I LOVED IT. I loved watching the oil sit on the top layer of my soup (HELLO, oil is the cure to a mean hangover in my book).\n\nOh and I really did want to try the Har Gow but I couldn't justify spending $8.50 on something that usually costs less than $2. \n\nI'm going back to Vegas in Sept... so I'll be here again. Prices suck, yes.... but it's going to be the same no matter where you go!"
        }, 
        {
            "index": 64, 
            "rating": 1, 
            "review": "Black ship of Mandalay Bay dining. \nThe service was too fussy, the server kept coming back every 2 mins (come on, we were literally the only customers there and you can tell when ppl finally pull their curious noses out of the menus). \nThe food was ordinary, i did like their appetizer dumplings sample, but as for the rest, honestly i experienced better flavors in much cheaper and less fancier places."
        }, 
        {
            "index": 65, 
            "rating": 3, 
            "review": "We are ordering some wonton noodle soups and an appetizer of dim sum. Soup was just ok, the veggies were a little al dente and raw. The dim sum was ok, just a little sticky. The shu mai was a little dry on the edges and chewy. Lunch was okay but I'd probably look for other options within the resort."
        }, 
        {
            "index": 66, 
            "rating": 5, 
            "review": "Yesterday, I was craving some soup after I saw their advertisement in the Mandalay Bay in house dining section.. I really didn't care for the chicken wraps as much. I think pf changs has better ones in my opinion. I ordered their pho w/ chicken instead of beef. I have to say it was one of the best I've ever tried... I am super picky about my pho. It's so good, that I might go again tonight!"
        }, 
        {
            "index": 67, 
            "rating": 1, 
            "review": "We attended a late show in the Mandalay and opted to eat at the Noodle Shop afterward for dinner as it was closeby.  There were several tables occupied and we were promptly seated.  The service was slow.  The food was awful. The peanut sauce for the satay was tomato based (!), and the chicken was dried out, obviously cooked hours before.  The other two entrees were orange beef, gummy and off tasting - a clump of meat on a plate without any type of sauce or garnish, and beef and vegetable low mein (chopsuey/fried noodle) which was extremely greasy with the only 'vegetables' being a generous handful of onions.  Yep, only onions.  We were half through the meal before the hot tea arrived.\n  I guess the most telling point was the waiter, who was fairly scarce,  NEVER asked how things were even when 90% of the food was uneaten.  My advice, go down to the food court and get Panda Express.  At least there the food would be fresh and half the price."
        }, 
        {
            "index": 68, 
            "rating": 4, 
            "review": "Not going to complain about the price as EVERYTHING is overpriced in the strip's hotels.  They have decent HK style food and we even ordered in Cantonese.  We had the flat rice noodles with beef and it was excellent.  The \"yee-meen\" noodles with veggies were alright."
        }, 
        {
            "index": 69, 
            "rating": 3, 
            "review": "Had a craving for noodles so we ate at The Noodle Shop for dinner.\n\nWe ordered:\n\n- 2 meat BBQ Appetizer - Duck and Pork - the pork was a bit tough and the duck was pretty good\n- Beef Stew Noodle Soup - I liked the beef stew noodle soup - the noodle was al dente; the broth was good; the beef chunks were tender and there was some tendon and Shanghai Bok Choy  as well;  \n- Shrimp Wonton Noodle Soup - Good wontons and good broth\n- Beef Chow Fun - smaller than usual portion \n- BBQ Pork Noodle Soup \n- Choy Sum with Oyster Sauce \n\nWait staff was attentive.\n\nIt was an OK dinner.  Not sure If I'll come back."
        }, 
        {
            "index": 70, 
            "rating": 4, 
            "review": "I came here, starving, after unnecessarily fasting for over 15 hours (oh laziness, what you can do to a girl) I came here, STARVING. \nI was unpleasantly greeted with a line, however, I was delirious due to hunger so I waited. (I did notice like, 5 empty tables waiting for seats, but the this place was REALLY understaffed) \nI sat and ordered Thousand year old egg with shredded pork congee. My mother ordered wonton mein, and my sister ordered... pot stickers? \nThis place was a mix of different kinds of asian cuisine, I managed to find a red bean beverage and pad thai (not chinese food) So this place could be your fix for all sorts of asian cuisine.\nThe staff understood cantonese, so they're authentic and my entree seemed legit. The congee was super flavorful but it was WAY thick... I'm not saying I like watery congee, but this was like pudding thick. Anyways, the pork was a tad salty, but overall, the congee was really good.\nMy mom seemed content (not stoked) about her wonton mein and my sisters pot stickers looked like fried sui mai. \nor not pot stickers of any sort, to be honest.\n\nI liked this place a lot, if the service was better, I'd consider coming back within the same trip.. maybe, the price was very off putting though."
        }, 
        {
            "index": 71, 
            "rating": 1, 
            "review": "Where the hell does a restaurant come off trying to charge $7.95 for kimchi?! My friends and I only ordered due to the convenience factor being that we were staying at Mandalay Bay. Everything on the menu was WAY overpriced for mediocre Chinese food. I'd have gladly went to a restaurant in Spring Mountain if we were mobile, but with the outrageous prices I would have forked over the cab money in retrospect. I think I was really grumpy that night due to lack of sleep (Vegas...), but things started off poorly after it took almost 15 minutes to get the beer we ordered. I'd talk about the food, but really it's nothing to really write about."
        }, 
        {
            "index": 72, 
            "rating": 1, 
            "review": "Do not eat here. This place is overpriced cheap terrible tasting Asian food. Panda Express is much better than this. I've never had worse asain food. The orange chicken was cold, was processed chicken and tasted worse than McDonald's chicken nuggets. Please fire the cooks! How could you have a place like this that gets terrible reviews and not make a change in the food?? My table also had other dishes and nobody liked their food. Even my lemonade tasted like water! How do you mess up lemonade?? $100 later and not happy!"
        }, 
        {
            "index": 73, 
            "rating": 1, 
            "review": "I wanted something soupy so I ordered the pho noodle soup (I figured they couldn't mess that one up even though it was a Chinese restaurant). The soup was lukewarm, noodles were not pho noodles and the thick slabs of beef were impossible to chew through. It is overpriced, disgusting food that gave me a really bad stomachache right after. \n\nDont even think of eating here unless you are desperate for a bad stomachache."
        }, 
        {
            "index": 74, 
            "rating": 1, 
            "review": "Food was very good but server openly asked for us to give him a tip....we were giving him a tip by the way... but it wasn't what he wanted. I think his name was Sam so if you get him he'll make you give him a tip he likes not what you want to give him. He wasn't very friendly either as the other staff were. Just beware so he's the reason for 1 star."
        }, 
        {
            "index": 75, 
            "rating": 3, 
            "review": "My boyfriend was hungover and I was craving a soup like dish. He ordered their PHO which was mediocre for how much it costed. But lets be real, it's the strip and Mandalay Bay. It's like trying to get Costco price alcohol on the strip. Not happening. :/ I ordered their PORRIDGE w/ the black egg (\"thousand year old egg\"). I enjoyed my dish, but agree with my boyfriend. The cost of eating there was a bit more expensive, but we were in dire need of some soup based meals!!! Aside from the cost of the food the service was still really good. ENJOY!"
        }, 
        {
            "index": 76, 
            "rating": 3, 
            "review": "If you are looking for some delicious pho, this is your place. I have been there once. My fiancé and I were craving something healthy and we split a beef pho and a seaweed salad. I must admit the seaweed salad was weird. I had a very strong, almost putrid aftertaste but I highly recommend the pho. It was probably the best pho I've ever had. The broth is amazing and they give you all of the sides. If you are craving something healthy and you don't mind the atmosphere I would definitely recommend this place. The atmosphere is kind of dull and boring but the soup is amazing. Did I mention that? Also, the service was outstanding. We had the sweetest, most helpful gentleman serving us. I stay at Mandalay Bay a lot and I always wanted to try this place. Its pho-king yummy!"
        }, 
        {
            "index": 77, 
            "rating": 1, 
            "review": "The noodle soup with roasted duck was good, the grey goose martini I ordered tasted like a dirty dish towel. My wife sent back the Lettuce wraps saying they tasted like dog food. I didn't know she had eaten dog food before to compare. Who knew ?"
        }, 
        {
            "index": 78, 
            "rating": 1, 
            "review": "If I could give this place no stars, I would.  The food is bad and the service is worse.  We told the waiter our pork was raw, he took it, left and never came back.  And they charged us for it.  They also brought the wrong main dish.  I blame myself for eating here"
        }, 
        {
            "index": 79, 
            "rating": 1, 
            "review": "While the menu looks appealing, the food was quite disappointing. This is the first time that I have had orange chicken where the chicken was processed chicken--yes, that's right--chicken nuggets for $16.50. The local drive thru nuggets with sweet & sour sauce rivals this for a third the price!"
        }, 
        {
            "index": 80, 
            "rating": 2, 
            "review": "My party was seated very quickly because, well, the place was pretty damn empty. This was on Sunday around lunch time. Fortunately, the food came out quickly too. I ordered the sea bass congee, and it was pretty basic. A few green onions. Small sea bass pieces. No Chinese donut. No century egg. The problem here is the price. For what it is, way too much to recommend. The congee itself was fine but not spectacular enough to justify the price of $17+. Do not plan on coming back, but I do plan on having some better, cheaper congee soon."
        }, 
        {
            "index": 81, 
            "rating": 3, 
            "review": "Noodle Shop.  I really don't like giving out terrible Yelp reviews.  I rarely do it because everyone has bills to pay and I don't want to be responsible for anyone not being able to put food on their table.   I don't feel being a Yelp Elite is something to brag about and it's just fun to have it on your Yelp profile.  I get a good laugh from it now that I've been an Elite for a couple of years.  It's pretty lame to be honest.\n\nLastly, I'm catching a cab next time for a meal.  The food was really 1.5 stars but I decided to bring it  up to 3 stars because of the staff and decided not to write any reviews lower than a 3.  It's definitely not your authentic Asian spot and definitely catered to tourist who think Taco Bell is authentic Mexican food."
        }, 
        {
            "index": 82, 
            "rating": 4, 
            "review": "Would not have tried this , but as I always am reminded in California Chinese mainlanders and first generations  like to gamble and eat ......Chinese food. I'm thinking there has to be some Chinese chefs back here in Vegas! Hell they changed the whole facade of the Lion's mouth entrance for the MGM Grand since many Chinese would not go there!!  (bad luck) Ok remember where you are..... listen to the staff. They are almost all from China or Hong Kong Cantonese speaking!  the place is called Noodles ! it will be overpriced and not as good as Monterey park or your last visit to a Hong Kong street corner. Do not order the Pho, the Thai food, and for that matter ....the Japanese udon! These are all different Asian countries ! Thats like going to a place called  \" EuroBeef \" ... having the same guy making Brats, Beef Wellington, and  Beef Bourguignon... Have what these guys make all the time... Chinese noodle soup and the congee.... again overpriced, but that seems to be the theme in this hotel!  I had the seafood won ton noodle soup.... with chilean seabass? Yes it was really seabass (i was skeptical at first) .... seems like a waste in the soup . Really it was not bad and was as tender and buttery as any Chilean seabass. I have been reading reviews about the service.....well i am not defending by any means, but have they been to Chinatown / Monterey Park at all??!!  I know it looks like PF Changs.... \n  Anyway my girlfriend had the Pho..... I warned her. It came with  Italian Basil like the kind you use on Caprese, and not the Thai/Asian  (her review will be 1 star! lol) The congee did look good too..."
        }, 
        {
            "index": 83, 
            "rating": 5, 
            "review": "Best Har Gow and Chow Fun!!!\n\nMy boyfriend and I went for dinner while we were in Vegas for a week for a convention and loved it so much that we convinced  our group (6ppl) to go for lunch 2 days later!  It is a perfect casual noodle/Asian cuisine restaurant.  Which is great for a casual experience when you tend to eat such heavy, large meals in Vegas.\n\nAmazing Har Gow with a bit of expected wait. The chow fun was delicious... Even when I ordered it without onions or bean sprouts. The pad thai was a tad oily so we asked for light oil the 2 time and enjoyed it. Great hot tea. \n\nThe service was a little sub pair ESP for Vegas. The food out-weighed my opinion of this place."
        }, 
        {
            "index": 84, 
            "rating": 2, 
            "review": "Average Chinese food, certainly not fusion.  Spring rolls boring and greasy, as was veggie chow mein boring.  Broccoli in oyster sauce was good and a good price"
        }, 
        {
            "index": 85, 
            "rating": 3, 
            "review": "The food definitely was not anything special. I would say it was a step up from a Chinese dollar scoop. More likely to get better food at a PF Changs. But the service was fine and we did not have to wait long for the food. Our glasses never went empty and the hot jasmine tea was bottomless."
        }, 
        {
            "index": 86, 
            "rating": 2, 
            "review": "Horribly slow service. Our waiter maybe came around to our table once and when we asked a woman passing by for an extra bowl of rice I don't even think she understood. I found a lot of their noodles were oily and over sauced. Although my chow mein was good (generic) my friend did not enjoy his pad thai and said it made him want to throw up later."
        }, 
        {
            "index": 87, 
            "rating": 3, 
            "review": "Same as Annette (it was after my wedding ;D), and while I can't give it 4 full stars, I would totally give it 3.5 if I could.  They sat and dealt with 11 rowdy people with ease.  The prices were ridiculous, but it was a Vegas casino on the strip - it looked about as ridiculous as anything else we were at.\n\nI got the shrimp, noodles, and XO sauce and while I had to add a good deal of chili sauce to spice it up, I thought it was delicious.  I also tried the orange peel beef, the chicken with black bean sauce, and some of the pho broth which was totally yummy.  Everyone I was with liked their food quite a bit!\n\nI'd go here again if the opportunity presented itself - but being that there are so many restaurants in Vegas and I'm only there so often, I don't think I'd make it a priority though."
        }, 
        {
            "index": 88, 
            "rating": 4, 
            "review": "Been here twice, always enjoyed it, generous portions, great staff, the beef noodle soup and bbq pork rice was good, my family raves about the Thai Ice Tea!!! A nice spot for some hot noodle soup."
        }, 
        {
            "index": 89, 
            "rating": 1, 
            "review": "The pad Thai was absolutely disgusting. The Mongolian beef was average. I would have been happier at a Panda Express. It's sad because the service was good but we should have taken a clue when the restaurant was empty."
        }, 
        {
            "index": 90, 
            "rating": 3, 
            "review": "The Noodle Shop was our meal of choice on the even of the 2013 Chinese New  Year.  Located just off the casino floor in the Mandalay Bay resort, it is designed in a simple, and modern style.\n\nThe menu is a mix of Chinese, Thai and other dishes. However, if you are looking for true Thai dishes, this is not going to meet your desires. Lots of rice and noodle dishes, which are great to cure a case of the beer (or wine, or bourbon) flu.  Since I was suffering from a strain of the Guinness-Jameson blight, I chose a hot Green Tea and the Roast Duck noodle soup. This was the perfect cure. The duck was excellent, perfectly cooked, perfectly done meat, with a little bit of fatty skin.  The broth complimented the duck perfectly.  It also had some noodles and a little veg, though I wish there were a little more of the greens added.  My wife  had the Tom Yum Thai soup. Good but not really Thai style, missing elements like the lime and the sour style that is common.  When suffering from the 'flu' it is best to have a spicy dish. The hot bean paste condiment is excellent. Nice roasted and smoky flavor. It does pack a wallop.\n\nThe price was right and the service was quick and efficient, and friendly. The General Manager stopped by, asked about our meal and when asked, he gave us a little education on the pending Chinese New Year.  A very nice touch."
        }, 
        {
            "index": 91, 
            "rating": 2, 
            "review": "So the waiter was very nice. The sake was awesome. The sampler platter of cooked dim sum was mediocre and my dinner plate of chicken lo mein was so salty I couldn't finish it. The restaurant was clean but they really need to up their food quality. Definitely not worth the money."
        }, 
        {
            "index": 92, 
            "rating": 4, 
            "review": "We went in for a late dinner, about 9pm. Got the chicken chow mien and Singapore noodles. Both dishes came out pretty quick. Both were really tasty, and good size portions. Would have given 5 stars but for the cost."
        }, 
        {
            "index": 93, 
            "rating": 1, 
            "review": "Run, don't walk away from this place.  I'm a slut for a good bowl of soup.  I literally go to sleep at night dreaming about package ramen noodle. After dining in this restaurant today I died a little bit inside.\n\nAll I can say about the soup is it smelled awful, had zero flavor, fuck, I'm actually angry I wasted a meal in Vegas at this kennel.\n\nDined with a total of 8 people. Our food came out in 3 shifts last plate coming out 15 minutes after the first.  Honestly I don't even want to keep writing about it.  Do not eat here."
        }, 
        {
            "index": 94, 
            "rating": 3, 
            "review": "Needed soup after a three-hour drive from Utah with a sore throat. Noodles seemed like the perfect place. I got the Duck Noodle Soup and it hit the spot. It wasn't seasoned much, but a scoop of chili sauce helped clear my sinuses. \n\nMy friend ordered the sweet and sour chicken, which she wasn't impressed with. The smaller chicken pieces were almost entirely breading and were very hard. She wished she had ordered my lunch. \n\nThe staff was polite, took our order, and brought our food out promptly. I did not have any issues with the service.\n\nThis place is pretty good, but you should make sure to order its namesake- NOODLES."
        }, 
        {
            "index": 95, 
            "rating": 1, 
            "review": "One of the worst Chinese restaurants I've been to. The waiter recommends chicken chow mein saying it's full of vegetables ,only to find out onions is what he was referring to as vegetable. When asked , he says additional vegetables is going to cost you more!!  . Chicken fried rice is more like white rice with chicken."
        }, 
        {
            "index": 96, 
            "rating": 3, 
            "review": "This place had 2 stars at the time I ate here, and honestly, it's not that horrible. This is not the best place, but it is digestible. You want 4 or 5 star quality go elsewhere. \n\nMy big complaint however is the price, I get that it's Vegas but 60 bucks for egg rolls, pork buns, a small wonton soup, and pad thai is a joke."
        }, 
        {
            "index": 97, 
            "rating": 1, 
            "review": "After a long night of partying, we were in desperate need of something warm or hot and comforting. What better cure for a hangover than Pho? We had a group of 12 and the people working there wanted to cram us into 2 TINY ass tables..... Are you kidding me?! We kindly requested to add an additional 3rd table... they gave us this dirty look wow.\n\nAnyway, most of us got Pho, some of us got rice dishes and others some other noodle soup dish. The Pho was like $17?! What in the @#$%!! I anxiously waited for my Pho.... and it came 30 minutes later.... I do not know why it took them so long to slice up some beef, add the hot broth that should already be simmering in a huge pot, and some noodles.\n\nThe Pho wasn't even hot!!! It was lukewarm at best!! The beef wasn't even cooking thru!!! The whole bowl had like 4 slices of beef.... no meatballs, no tendons, no tripe. I didn't know you could mess up Pho, but this place did!\n\nSuggestion: Don't come here. Bad and expensive food. Terrible service. Gah I'm still mad... I would've rather bet that money and lose it."
        }, 
        {
            "index": 98, 
            "rating": 2, 
            "review": "Yeah ummmm. Totally didn't read the reviews before going in here today, and was expecting a bit more flavor from this place.\n\nGot the roast pork (cha chiu), Chinese broccoli  and steamed rice.  Well, I got it like 35 minutes after I ordered it.....\n\nI was kinda pumped to see they had some of my favorites, but I have to say it was pretty bland.  The cha ciu was not sweet enough, and there was little-to-no brown sauce to add flavor. The Chinese broccoli was blanched properly, and had a drizzling of oyster sauce on it----but that only gives flavor to the lucky broccoli that got the sauce.\n\nAgain, if you are in need of a real Chinese fix, this joint isn't the top choice.  Head over to the Spring Mountain Rd area..."
        }, 
        {
            "index": 99, 
            "rating": 2, 
            "review": "Appetizer was ok, I got one of the dumplings they had on the menu.\n\nI had a shrimp entree that was decent, I think it was the szechuan shrimp.\n\nBut I also tried the Hong Kong Style Pan Fried Noodles and Seafood. It was the worst dish I've ever had at a chinese restaurant. We couldn't eat it. Just don't order that and maybe you'll be ok. Like I said, the szechuan shrimp was ok."
        }, 
        {
            "index": 100, 
            "rating": 1, 
            "review": "Oh my do these people deserve their 2.5 stars!\n\nI have been going to this place for as long as I can remember, every time that my tradeshow pops up at Mandalay Bay. And it gets worse, and worse and finally - disaster!\n\nFirst, I have to say that they have this incredibly amusing waitress who is any other Cantonese style Hong Kong restaurant, would be just as incomprehensible but alas...would only serve you great food, even if it was still moving when it arrived. Living in Hong Kong, I met plenty of ladies like this. And none would have ever remained in a job at such a terrible excuse of a Chinese restaurant. Even by Qwai Lo standards - this was a disaster.\n\nWe had a bunch of dishes. The fish was fishy in smell. The noodles - bland. The chicken tastes better in those free samples given out at shopping malls. \n\nIt was honestly one of the worst places I have eaten food at - period.\n\nThe hotel gave me a 100 dollar gift certificate after we complained about our 45$ meal. They own the Noodle Shop and if they ever bother to read their reviews, it is a real wonder why they don't switch up the chefs/staff and management - fast!"
        }, 
        {
            "index": 101, 
            "rating": 2, 
            "review": "Worst place. You could get any corner of any city better Chinese food than this place. \nIt used to be a great restaurant. I wonder what happened.\nIt's located inside Mandalay Bay."
        }, 
        {
            "index": 102, 
            "rating": 2, 
            "review": "After a few days in Vegas doing what you do in Vegas -- eat, drink, eat, drink, rinse, repeat -- I wanted something \"light\": Asian food! In more of a hurry and not really caring we ducked in here for a quick lunch. I really wish we would have tracked down a Pei Wei instead...\n\nThe pan seared pork (and shrimp) dumplings were very good, but the Pad Thai shrimp fell short. We weren't quite sure what was going on with it, but as my friend noted, \"why is it so orange?\" might have been one thing. The shrimp were definitely frozen and beyond small, over cooked, etc.\n\nStick with the dumplings, steer clear of the Pad Thai shrimp."
        }, 
        {
            "index": 103, 
            "rating": 2, 
            "review": "Overpriced, not a friendly atmosphere at all. We ordered the shrimp wonton noodle soup. Soup was good. While ordering the waiter told us the soup was only enough for one person. It was enough for two adults actually. Thank goodness for our two kids we were able to order off the kids menu. We had the chicken fried rice and the chow mein- it was ok. Service is odd. The waiter only brought two soup bowls out when there were 4 of us at the table. The kids menu came with a drink and the staff only wanted to bring out one juice since they brought me a refill on my coke which I didn't ask for. Coke was 4 dollars. We asked them to bring out the two drinks since we had two kids and it came with the meal. At the end we asked for a to go container for the soup and they said they don't have any. So I guess if you order soup you can't take it to go? Weird. We just used our juice cup since the kids enjoyed the noodles and wanted it for later.  They gave us the kids menu which had coloring on it, but they only gave us one menu and  no crayons. \n Some of the menu items are just outrageously priced. \n Who pays 16.50 for fried rice and a lot of their single dishes like fish or beef were upwards of 24 dollars and up? \n  My kids did like the soup. The atmosphere and customer service of the staff is definitely lacking."
        }, 
        {
            "index": 104, 
            "rating": 5, 
            "review": "Very good hong kong style food. I don't know why it's only a two star but as a chinese person, the food is authentic. Smaller portion than I expected but all food is overpriced on the strip. Waited super nice too."
        }, 
        {
            "index": 105, 
            "rating": 1, 
            "review": "I was out with the family and I was very disappointed. The service was substandard. I live in Nevada. People ask me for my recommendations all the time. Noodle Shop needs to remind their servers that people come to Vegas to have a great time and want great service. I am retired and I have a lot of time on my hands. I love to eat out. Sorry Noodle Shop. I shall not return."
        }, 
        {
            "index": 106, 
            "rating": 1, 
            "review": "My wife and I were wandering around Mandalay Bay after visiting the shark exhibit and happened upon a The Noodle Shop. I did not check Yelp until after  we ordered our drinks and appetizer. I'm so happy we stopped there, the BBQ trio was lackluster at best. The chicken was rubbery, the pork was dry and the duck felt and tasted like it had been boiled. Please avoid this please. I expected more out of you Mandalay Bay."
        }, 
        {
            "index": 107, 
            "rating": 1, 
            "review": "Went there when I was really hungry hoping to satisfy my Chinese food craving. I ordered the bamboo shoots as a appetizer it was edible but not the best. Then I ordered the steak with eggplant and the Singapore noodles as well. Both plates were pretty gross not my flavor palette at all. They did however work with me and not charge me for my meal at all. I wouldn't go back but the only thing good I have to say about it is the staff is friendly and understanding."
        }, 
        {
            "index": 108, 
            "rating": 1, 
            "review": "This negative review does not apply to all the waitress here in this Restuarant.. The waitress that was serving us was not very friendly, he actually had an attitude with me and my boyfriend when we're ordering food. Never coming back here EVER again!\nBad Service!."
        }, 
        {
            "index": 109, 
            "rating": 1, 
            "review": "Hands down the worst pho I've ever had in my life. I could put together a better dish cooking while drunk (thats pretty bad). I came here other day and the gentleman serving us was very accommodating. Tried the bbq combination platter, not much to say other than it was decent. My lady got the pho; she said it was terrible. I wanted to give the place a benefit of doubt since the food is of her native country. Maybe she was being a little harsh. \n\nGave it a try today since i had quite an alcohol-filled night, pho if you dont already know is the cure to everything. Wish i could say the service experience was the same as the other day. \n\nSat down for quite a while until a gent stopped by to see if i wanted anything to drink. This guy wasnt even my waiter, though i would have preferred him to be honestly. He took my drink order and chased down the guy who is supposed to be my waiter. I asked for fiji water because the vegas tap water tastes a little funny. Sure enough he brought out tap water. The gent from earlier saw this and kindly took it away apologizing for my waiter. Fiji arrives with a wet glass inside and out. It looked like the waiter dumped the cup and reused it, not caring to dry off any residue. \n\nIn short, stay away from the pho. Service is hit or miss. And i just got the bill without a pen."
        }, 
        {
            "index": 110, 
            "rating": 1, 
            "review": "My husband and I are foodies and enjoy trying new restaurants. This experience started with a martini that was watered down with vegas tap water. He sent it back because he couldn't drink it (he has never met a drink he didn't like, btw). We decided to go with the appetizer menu and ordered the calimari and dim sum sampler. The calimari came out first. It was under seasoned and under cooked. We wanted to send it back, but were afraid after already sending back a drink. The dim sum platter came and it looked decent. It was alright until we got to the shumai. This is my husband's favorite. It tasted like a barn animal's a**hole. My husband actually spit it out. And we refer to him as the human garbage disposal. I have never seen him spit food out. Ever. Additionally, their spicy mustard was watery. My husband asked our waiter if it was watered down. The waiter admitted it was and said it was because they made it with powdered mustard. Our final bill was $79 which included a diet Pepsi and two drinks."
        }, 
        {
            "index": 111, 
            "rating": 2, 
            "review": "So....I decided to ignore the 234 review 2 star rating......and you get what you deserve.......2 stars at best.  Over priced (yes, even for Vegas standards) and just ok to mediocre food.  Do yourself a favor and listen to those who took the time to review this place.  Mandalay Bay, time for a change in tenants........"
        }, 
        {
            "index": 112, 
            "rating": 2, 
            "review": "My tip: don't eat here.\n\nThe restaurant itself is located inside Mandalay Bay, but is tucked away far enough that you're not inhaling cigarette smoke from the casinos.  The staff is very sweet.  These are the only positives.\n\nThe food is bland and really not good at all (we had 4 different dishes).  In fact, I believe I got a small bout of food poisioning.  :("
        }, 
        {
            "index": 113, 
            "rating": 2, 
            "review": "Huge portions- must have traditional taste for Chinese-  I hated - hubby said was good- he eats anything-"
        }, 
        {
            "index": 114, 
            "rating": 1, 
            "review": "This place has the worst food ever. We ordered Pho and it was bland. Even putting the sriracha and hoisin sauce was still nasty. Guess how much they charge for a bowl!? 18 bucks! Seriously? Here in Oakland it's 7-8 bucks and it's delicious. Now I understand why it's expensive cuz its a hotel rest. but damn at-least make ur pho better..We also ordered pad Thai and it wasn't good. If you want to get pho go to Chinatown in Vegas it's way better and cheaper. It's not that far. Customer service sucks at this place too. Came here cuz we were in a rush. We didn't want the Pacquiao bus leaving us to go to LA."
        }, 
        {
            "index": 115, 
            "rating": 5, 
            "review": "We thought this place was excellent.  The servers are always moving and very attentive.  We ordered the Kung Pao chicken and beef and shrimp in garlic sauce.  Both were delicious.  Prices were usual for an overpriced resort restaurant."
        }, 
        {
            "index": 116, 
            "rating": 2, 
            "review": "Best way to describe this place is fast food Chinese. Food was not fresh and was previously prepared. Rice was dry."
        }, 
        {
            "index": 117, 
            "rating": 2, 
            "review": "It's ok food. A little better than your normal Chinese but that's all. Service was fast. Portions are normal sized for a Chinese. It's pricey, 70 bucks for 3 but it's normal prices for Vegas. Definitely overpriced."
        }, 
        {
            "index": 118, 
            "rating": 2, 
            "review": "Came here for lunch - long wait, restaraunt slow to clear tables, to the point where one member of our party who was in restaraunt management boldly walked in and started bussing tables!  They got the point.\n\nPeople who complain about the language barrier outta just get over their egos and learn from the experience.  Be patient, speak slowly, listen attentively.  \n\nHigh prices.  Ok food.  I had the seafood tom kha, which was loaded with squid and shrimp and noodles.  Broth just ok,  i expected a lot more flavor.  We ordered a calamari appetizer that was below par.\n\nLarge parties are charged 18% gratuity, which we were not informed of and created quite the headache afterward.\n\nTwo star due to value. $100 for 4 bowls of soup and an appetizer.  Take a cab to ChinaTown, better food and you'll save money."
        }, 
        {
            "index": 119, 
            "rating": 1, 
            "review": "One thing I found it interesting is, you paid arms and legs in these kind of hotel restaurant, but the food doesn't taste good at all. \n\nWe came here on Christmas day. The service is not very good. 20 min wait with tons of empty table. \n\nOkay. It is a holiday. I am not going to complain. But after we sat down, it took so long for someone to serve us. That is ridiculous. \n\nThe food, is well kind of bad. It is eatable. But doesn't taste good at all. If you have a car, it is really better to go out and eat. \n\nFinally, the price... Too expensive !!!! It costs us over $30 per person. If you are not hungry for asian food, you may find a better place to eat in this hotel."
        }, 
        {
            "index": 120, 
            "rating": 3, 
            "review": "The food was good-Ish but definitely overpriced for the quantity and quality. I came here for the convenience since we stay at the hotel but there are definitely abundant of better choices else where."
        }, 
        {
            "index": 121, 
            "rating": 1, 
            "review": "Quicky Review: overpriced basic chinese american dishes. Eat elsware. \n\nAte lunch with the family. Do not get the pho. It is extremely bland and the noodle texture is stiff and not chewy. The pho costs double the price compared to back home, it takes 5 times longer to come out, yet it tastes like warm water with noddles. We also ordered orange chicken, mongolian beef, and garlic lobster. All the items were good but way to overpriced for simple dishes. There are so many delicious restaurants at the Mandalay Bay, steer clear of Noodle House"
        }, 
        {
            "index": 122, 
            "rating": 1, 
            "review": "Terrible service and terrible quality food. \n\nOrdered cashew chicken and received chicken and macadamia nuts. \n\nEverything was bland and overpriced. \n\nPanda Express is leagues better.\n\nAvoid!"
        }, 
        {
            "index": 123, 
            "rating": 2, 
            "review": "I paid $20 for a seafood pan fried noodle that was pretty bland. I ordered takeout, so if I had to say one good thing about this place, its that it took them about 5 minutes to make my food.\n\nOther than that, if you're at the casino and you're hungry, do yourself a favor and get out to In-N-Out. Or, walk across the street to Panda Express and/or McDonald's."
        }, 
        {
            "index": 124, 
            "rating": 5, 
            "review": "I was here the first time last year's memorial weekend and I enjoyed it so much I went 2 days in a row. You can always tell when a place is good when it's busy with patrons and it was, especially full of Asian customers! ;) This time I came in with the intention of ordering the crispy duck noodle soup which was delish! I forgot to request flat rice noodles instead of egg noodles but it was great anyway as the duck was meaty and perfectly cooked. The soup was more than enough especially for lunch. We had a lady named lua (I think) service our table, she was very friendly and attentive, she was quite endearingly cute! A little pricy but the restaurant was clean and didn't look cheap at all, nicely decorated with plants, mirrors, artworks and soft colours used. The toilets are clean and spacious! Free wifi available too. Always a place to visit when I'm in town!!"
        }, 
        {
            "index": 125, 
            "rating": 1, 
            "review": "Definitely nothing to write home about with this place... so I'll write it here.  My group of friends (myself included) were NOT impressed with this place at all.  It was expensive and didn't seem like much food was brought to the table.\n\nOne of my friends became ill after eating here, and I think Asian fast food tastes better than what was served here."
        }, 
        {
            "index": 126, 
            "rating": 2, 
            "review": "Food here....yuck!  I ordered the seafood soup which tasted bland, others ordered the pho, Mongolian beef, etc, and all seemed like it was missing something.  Not talking about MSG, but it seems they didn't even bother to taste or season well the food.  And to compound our wonderful excursion, the waitress when giving the bill said, \"Don't forget to leave tip!\"  I usually leave more than 20% when I eat out, this time, she doesn't even deserve half that!\n\nIn summary, yucky food, high not worth prices, and rude service.  A must skip if ever in the Mandalay Bay Hotel!"
        }, 
        {
            "index": 127, 
            "rating": 1, 
            "review": "If you've ever picked up a piece of gum off the sidewalk, chewed it for awhile, then spit it into someone else's mouth, that's probably the most accurate estimation of this dump's chicken chow mein. The service was unapologetic for how toxic the food tasted. Hot and sour soup was a hidden gem."
        }, 
        {
            "index": 128, 
            "rating": 3, 
            "review": "Service at The Noodle Shop was good, our server was very attentive. Servings are family style and the price is reasonable, we had order the typical.\n\nBeef and Broccoli: delicious!!\nFried Rice: bland\nChow Mein: oily and bland"
        }, 
        {
            "index": 129, 
            "rating": 2, 
            "review": "If you're reading this and haven't sat down to eat yet, turn around and leave now. My husband and I have been to Vegas several times, and rarely have a bad meal. This trip we were here three days and this was the only \"meh\" meal we had (serves me right for not looking up reviews before we sat down.) \n\nWe ate here out of convenience - needed a place before the Michael Jackson Cirque show (which is amazing, btw). All the reviews for this place are true. The food is mediocre at best - on par with food court Asian at triple the cost. Service was not good. \n\nAll in all, it wasn't the worst dining experience ever, but it's expensive not good food with lackluster service. Skip it."
        }, 
        {
            "index": 130, 
            "rating": 3, 
            "review": "What will you pay for Asian food when you don't want to leave mandalay bay and you have a hangover?  This is the place!!\n\nNot bad congee and onion pancakes. Vegetable dish was a little over cooked."
        }, 
        {
            "index": 131, 
            "rating": 2, 
            "review": "Yikes...their standards have dropped yet again from 2 years ago.  I don't care about the price - it's going to be expensive - as another reviewer has mentioned, you're in Vegas.  Seriously.  \n\nHowever, I ordered a BBQ pork w/ rice dish and the rice was over dry and the BBQ porked lacked any sort of sauce.  I was also given 2 dingy pieces of Chinese broccoli that was way overcooked.  \n\nOverall, it was a very mediocre dinner.  I don't think I'd ever go again."
        }, 
        {
            "index": 132, 
            "rating": 1, 
            "review": "We went because our kids love Chinese food. We ordered the lettuce wraps which were the most edible thing we ordered. I didn't know Chinese used pine nuts in their dishes.  We immediately turned away the seafood tom yum kung soup which was absolutely horrendous....cold and they didn't have a ladle....the broth tasted like old seafood and they used ramen noodles that resembled top raman.....we replaced the soup with kung pao chicken.....the only good thing about the dish was the roasted peanuts....they used chili paste, not whole Chiles. They was no pao to this chicken.   I'd noodle past the noodle house and go to PF Changs down the street."
        }, 
        {
            "index": 133, 
            "rating": 1, 
            "review": "Meal started off ok with yummy egg rolls, however both my friend and my meals were not good especially for the price.\n\nThe chicken and vegetables had no flavor, was served in a runny sauce and the vegetables were undercooked.\n\nThe seafood soup also had no flavor. Even the rice was bad. How do you mess up white rice!!\n\nVery below par good for the high prices. Will not return"
        }, 
        {
            "index": 134, 
            "rating": 2, 
            "review": "Not that good period over battered calamari , oily food and I would tell you what I really think if it was not comp'd.... wish they make this into a great Chinese food establishment , such a great culinary history to pull from and we get this"
        }, 
        {
            "index": 135, 
            "rating": 4, 
            "review": "I was there in January of this year with my sister.  We both had the Shrimp, BBQ Pork, Scallop, Sea Bass, and Won Ton Soup with the added noodles.  It was really good.  I think it was about $25 which is pricey but considering what we got in it-understandable.\nService was fine-not like Chinese restaurants in Hawaii where they are almost mean to the customers!  Haha.\nI'm wondering if the bad reviews are more for the entree type dishes.  My sister and I had no problem with our saimin/noodle dishes or the service."
        }, 
        {
            "index": 136, 
            "rating": 3, 
            "review": "We came here because it was open late.\n\n1. Hot & sour soup tasted like tomato soup.\n2. shrimp and pork wonton noodle soup was delicious.\n3, fried rice was ok.\n4. Staff was friendly and nice."
        }, 
        {
            "index": 137, 
            "rating": 4, 
            "review": "Yummy Singapore Noodles and pork dumplings. I love the little hot sauces they have on the table too, great for mixing with rice/noodles/ etc.\nSUPER friendly service. Expensive -sure but still cheaper than the main restaurants! \nSave the money - don't eat at Shanghai Lilly -just eat at the Noodle Shop!"
        }, 
        {
            "index": 138, 
            "rating": 4, 
            "review": "Was expecting terrible food from reading other reviews.  We had lunch here just before leaving Vegas and were pleasantly surprised.  Everything had good flavor and was well cooked.  We got our food in timely fashion and the waiter was prompt to refill our drinks and ask if we needed anything else.  This is a great place for a quick and yummy lunch!"
        }, 
        {
            "index": 139, 
            "rating": 2, 
            "review": "We got in late and needed some food fast. So, we chose to eat in the hotel we were staying at. Noodles sounded perfect. \n\nAside from the prices that were 2x what we would have expected, the food was mediocre at best. \n\nThe Singapore fried rice noodle dish was not much like it was advertised. Wheat noodles, with curry and a few shrimp and slivers of pork. Oh, it was fried. They were just ok. The steamed sea bass was the best of the night. Moist, cooked perfectly. The sauce was ok. Presentation was simple. Finally, the Chinese broccoli was properly prepared and simply served.\n\n100 bucks for that meal. That just didn't add up....\n\nSo, ok food for outrageous prices."
        }, 
        {
            "index": 140, 
            "rating": 1, 
            "review": "How can you make something like Pho taste like hot water and still have the nerve to call it Pho?!  When you're in Vegas you need something brothy to bring you back to life and this stuff just made it worse.  I even had to go down to pick it up because they don't deliver AND it's EXPENSIVE!  \n\nTried the bbq pork noodle dish too and that was a huge disappointment!  \n\nI've said this before but seriously how are you still in business?!  Amazing!"
        }, 
        {
            "index": 141, 
            "rating": 2, 
            "review": "I had the hot & sour soup and chicken shrimp & beef with garlic sauce.  It was OK.  At the time, it hit the spot.  I came down with a case of food poisoning, but I am not sure if it came from here.  I guess I will never know."
        }, 
        {
            "index": 142, 
            "rating": 2, 
            "review": "Overpriced, underseasoned, disappointing.\n\nWe spent $55 and got a cup of hot and sour soup, some seaweed salad, singapore curry noodles, noodles with beef and broccoli (it was $3 to add the broccoli), and a coke.\n\nFriend said the soup was good, the seaweed salad was solid - right amount of sweet and sour, good variation in types of seaweed, yum - only downside was it was sort of warm.\n\nNoodle dishes were not good. Singapore noodles were bland and very, very dry. Like sawdust dry. Tasted like they just mixed together rice noodles, curry powder, and oil. No delicious vegetables, just a few slices of onion, a few measly pieces of BBQ pork, and like 6 baby shrimp. Beef noodles were similarly bland, tasting of nothing but soy sauce. Thank goodness we added the broccoli because that's what was picked out and eaten.\n\nWould not eat here again."
        }, 
        {
            "index": 143, 
            "rating": 2, 
            "review": "way over priced for mediocre food. Soup was Luke warm. Dinner came out 3 minutes after we got our soup. $90 for two people for less than average food."
        }, 
        {
            "index": 144, 
            "rating": 3, 
            "review": "Perfect cure for a cold, esp when you're stuck in the Vegas strip.\n\nI'm not too sure why the reviews were so harsh. The service was great, food came out promptly, and the food was good. While the pricing is a bit high, consider that you're in Vegas and in the Mandalay Bay. \n\n Roasted duck noodle soup cured my sinus prob.The flavors were great and the duck was amazing.It really helped bring out the duck flavor in the broth as well. I also ordered the seaweed salad. It was good except I wasnt fond of the mayo salad on the bootm.\n\nOverall, not a bad place. Give it a shot if you're too lazy to head to chinatown for food."
        }, 
        {
            "index": 145, 
            "rating": 1, 
            "review": "Over priced Asian food! I get it, it's a vacation spot and they have to price accordingly.\n\nBut hey at least make the food decent. I ordered a seafood stir fry with veggies and I think that was around $18 (yikes- really super high)\n\nThai ice tea was $4.50 - and I didn't order that.\n\nTheir Phou soup was priced supper high. I don't have a problem paying vacation prices, but it seriously was not that good. Greasy, salty and unsatisfied..........."
        }, 
        {
            "index": 146, 
            "rating": 1, 
            "review": "This place was disgusting. Great service, but horrible food. Please don't spend your time and money at this place."
        }, 
        {
            "index": 147, 
            "rating": 3, 
            "review": "Surprised to like the beef and noodles here, but service was a bit lacking and the food was overpriced.  Convenience was the buying driver in this case since I was staying at THEhotel and attending a convention at Mandalay Bay.  This is a lunch spot...no more."
        }, 
        {
            "index": 148, 
            "rating": 1, 
            "review": "This is the place for you ONLY if your idea of tom yum is vegetable broth with shards of celery, canned wood ear mushrooms, canned tomatoes, gluey vermicelli, and too much siracha, or possibly ma po tofu consisting of little squares of warmed tofu in a brown sauce with frozen peas and carrots.  The only upside was that my soup spent a lot of time in the microwave and was too hot to eat for 15-20 minutes. We were hopeful that the food here would hit the spot after a long day of traveling, but instead it left us hungry (after we couldn't eat the food) and mad at having spent $50 (that did include drinks:  what was advertised as a house special martini but turned out to be gin & cranberry juice in a martini glass, and a peculiarly orange \"Thai iced tea\"). Please  avoid this place so no other unsuspecting travelers make the same mistake."
        }, 
        {
            "index": 149, 
            "rating": 3, 
            "review": "Pho soup was really good..  Service is okay but far from the best.  I would go with the pho or the wonton soup."
        }, 
        {
            "index": 150, 
            "rating": 1, 
            "review": "Saw that there were some mixed reviews for the place on Yelp but I was staying at the Mandalay and needed some food.  I was a bit disappointed in the Noodle shop.  The staff was a bit brusque and slow at times.  I felt that the service was extremely slow for an afternoon late lunch with a near empty restaurant while several staff members present.  Figured that the authentic service would be a good sign, but alas I was in for a disappointment.\n\nThe food was average chinese food that I could get in Delaware, which if you have read my posts before that is a very low bar.  I ended up getting the chicken lettuce cups as an appetizer and the Hong Kong style noodles with seafood.\n\nThe chicken filling was well made with a nice mild sweetness it.  The water chestnuts were chopped and crisp.  As a difference there was some pine nuts mixed in which was a nice crunch and flavor.  Chicken was moderate, but nothing special.  Disappointingly the dish came with only 3 leaves of lettuce for the dish, much too few.  The other problem was that they served it with ROMAINE lettuce, not much of a cup or able to wrap it up.  Poor choice of lettuce type.\n\nHong Kong style noodles were not freshly made, they were standard type thick noodles.  Not exactly pasty but pretty close.  The fish in the seafood was cold and flat tasting with a bit of gristle.  The shrimp was well seasoned and prepared but that was the only highlight of the dish.  Overall the dish was a bit oily and disappointing.\n\nWhile I understand that the food would be a bit more expensive because of the location in the casino it was way overpriced considering the quality of the food.  The dishes were of low quality compared to what I would expect at Vegas in a casino.  I avoided this place during the remainder of my trip and would not return."
        }, 
        {
            "index": 151, 
            "rating": 2, 
            "review": "I'll give it 2 stars because the good was alright but definitely not worth the price. Seriously? $30 for a standard plate of noodles? And also the waitress had no idea what she was doing when billing our room and took forever for us to get out of there but not before asking if we were going to be taking a box for leftovers (my daughter couldn't finish all of her orange chicken) which we replied yes. She then ended up taking her food, which was roughly half a plate, and threw it away. Not worth the price."
        }, 
        {
            "index": 152, 
            "rating": 4, 
            "review": "Decided to eat here while we were waiting for our door lock to be fixed by the locksmith. I ordered Pad Thai with chicken and thought it was good. I also ordered Thai tea which was also good. Service was good as well. I would come back if we stayed in the hotel again."
        }, 
        {
            "index": 153, 
            "rating": 3, 
            "review": "Cozy spot I'd say, I got the hot and sour soup to start and It was fantastic!! I also got the kung pao beef and that was also pretty good. The thai style chicken curry on the other hand was a letdown, seemed promising and for 18 bucks it was a waste!\n\nA bit pricey too, 16 a plate seems pretty steep."
        }, 
        {
            "index": 154, 
            "rating": 2, 
            "review": "Seriously terrible and disappointing. $30+ for some lame shit tossed in soy sauce. Service is bad. Porridge is okay but the meat in it is terrible. \n\nIf you're Asian and have any idea what authentic Asian food tastes like, then you won't like it here. If you think Panda Express = good Chinese food, then you might have a chance. \n\nIt's Panda-level, maybe even below...sometimes Panda is good.  Do yourself a favor and keep walking when you see the menu sitting outside. I walked by it 3 times and finally gave in. Biggest mistake of my life this week. \n\nI didn't give it a 1 star because I save that honor for places that I truly hate. This place is just truly disappointing."
        }, 
        {
            "index": 155, 
            "rating": 3, 
            "review": "**Take out Review**\nI hate to go against the grain, but I really enjoyed The Noodle Shop. My husband and I were in need for some comfort food, and for us, that's noodles. We ordered pad thai and Hong Kong Style Pan Fried Noodles and Seafood to go. The staff was helpful and kind, they kept it short and sweet so that we could be on our way. We had to go take care of some business with the concierge and when we got back, our order was waiting for us. \nWe took it up to the room and enjoyed our noodles and TV (as God intended). The pad Thai was fantastic, and I am fully aware that it could be because I was starving, but either way, I enjoyed it very much. Mr. R. finished his dish and even had some of mine. I appreciate the Noodle Shop for being different from the other casual fare offered at Mandalay Bay, sometimes you have to take less than desirable noodles in order to get noodles at all."
        }, 
        {
            "index": 156, 
            "rating": 1, 
            "review": "Have you ever heard about location location location when it comes down to have business? So this place is one of them.  The food tasted really bad, weird and old. I was so starving, but I could only ate not even half of what I ordered. The server never checked on me if I was doing OK,  even though I was by myself. Not recommended unless you have no choice and starving."
        }, 
        {
            "index": 157, 
            "rating": 1, 
            "review": "Bland soup. Spicy means it has garlic. Overall overpriced and not recommended. So sorry I hate submitting poor reviews."
        }, 
        {
            "index": 158, 
            "rating": 5, 
            "review": "First of all I want to say that the food was great! Service was attentive. The Restuarant looks small but it's not it's cozy. Now for the price that everyone complains about, seriously everything on the strip is going to be pricey honestly if it's to expensive then stop complaining and go to McDonalds they raise there prices on the strip. When going to a resort in Las Vegas be prepared to spend money!!! Overall service was great and on top of their game, the food quality is great and the entrees were phenomenal. I see bad stars for this Restuarant but honestly it was most likely from people who can't afford  it  and are looking to complain about something. This place was great and I'm definitely coming back"
        }, 
        {
            "index": 159, 
            "rating": 1, 
            "review": "Giving this place 1 star because I can't give a 0. The service sucked, the front desk lady had the most rude tone of voice. Also the food is way too overpriced for its taste and quality. The 5 dollar bowl of hot and sour soup was the size of my palm and it wasn't spicy or sour, it was bland!"
        }, 
        {
            "index": 160, 
            "rating": 2, 
            "review": "Food are definitely edible, but I just wouldn't come back again because for the price and yes, I understand that it is a restaurant that has to pay hefty in rent to be in the Mandalay Bay, the quality just wasn't up to par. My standard wasn't like sky high or anything, I just think I've received better Asian food because Noodle Shop may somewhat be confused of what it is. It's mainly all Chinese food and then you have random dishes from other Asian ethnicity like Pad Thai or Pho so maybe a non Asian person can come in and not see any difference in taste or care much, but for us Asians we are somewhat critically with the food we grew up with.  \n\nThe atmosphere looks and feels nice, it was in a clean environment so that was a plus, but the end results all comes down to the actual product that it delivers and Noodle Shop did not delivered good food to me."
        }, 
        {
            "index": 161, 
            "rating": 1, 
            "review": "Panda Express has better quality food than this place!  The kung pao chicken has peanuts sprinkles on top of it instead of being cooked in the dish...it looked like someone sprinkled the peanuts straight out of the jar!  Our second dish, was a sad case of Chow Mein.  I wouldn't recommend eating here unless your super drunk and have lots of money to blow."
        }, 
        {
            "index": 162, 
            "rating": 2, 
            "review": "The waitress was friendly and the waiters are nice.  We went here twice.  The first time we thought it was very expensive.  Do not order the prawns!  They're not prawns..  They're just shrimp and they added the title \"prawns\" to them so they can charge you $26 for 9 shrimps bedded with salad.  It's pretty expensive here so you're better off getting comp from the casino to eat.  That's what we did the second time and it was okay.  \nThe food is \"not\" bad nor is it spectacular.  The best plate there is probably the Shrimp/Pork Dumpling for Appetizer.  It's only 6 bucks and I would order 3 of those with a few drinks and call it.  If you want tea then they'll charge you $2.50 for a cup.  This is the only place I have ever been to that charges you tea.  LOL.  This place is still surviving because it's the only Asian Restaurant you'll find that caters to Asian people in Mandalay Bay.  I can't hate it...  I just hate the prices!"
        }, 
        {
            "index": 163, 
            "rating": 1, 
            "review": "I could give no stars if it were an option. My husband and I stay at Mandalay Bay frequently, and end up eating in some of the newer restaurants since the renovation. My husband LOVES noodles, ramen, udon everything... Ordered the spare ribs appetizer, they were luke warm, ordered the beef stew for myself that I was told my our waitress was THE BEST. It smelled of fish and was FULL of fat.... had the waitress take it back and ordered something a little easier, Pad Tai Chicken and it was RAW! We ended up leaving, and with the manager not being very surprised at our reaction, I can imagine it happens alot..."
        }, 
        {
            "index": 164, 
            "rating": 3, 
            "review": "So on this trip to Vegas I decided I wanted to eat something else besides burgers, steaks, and buffet food. So I finally gave in and went for some overpriced Chinese food.  I came pretty late (like thirty minutes before closing..which I think was midnight), so I was seated very quickly.\n  \n  The atmosphere of the place is pretty cozy and chic, but without having that uber \"hey look we're a fusion restaurant\" look. The menu had a good amount of items that seemed pretty authentic. Anyway I ordered some Chinese broccoli in oyster sauce, beef chow fun, and a roasted duck noodle soup. \n\n  Service throughout the night was very quick and friendly (even though the place was pretty much closing) and the servers constantly came by to check on me...which was nice. The food on the other hand...well I don't know what it was...but nothing was that hot...in temperature. As if everything was cooked, but sat out for five or ten minutes before they served it to me.  As for the quality, it was somewhere between what you'd get at a Chinese buffet and actually going to a restaurant in a decent Chinatown. As for prices...well it's Vegas so it's definitely higher than what you'd expect from a Chinatown place (i.e. Beef Chow Fun was like $15...where as in Chinatown would be closer to $8-10). But not going to make you go broke by any means.  I think my only major beef with the place was that my hot tea was luke warm...kind of annoying.\n\n  Anyway The Noodle Shop is definitely not a place I would go out of my way for. But the food quality was good enough, the prices were fair, and the service was very good. If I was craving Chinese food and in the Mandalay Bay or near it...I wouldn't hesitate to stop in. \n\n~G"
        }, 
        {
            "index": 165, 
            "rating": 2, 
            "review": "For some reason I didn't read the reviews before I came here. But they're right, 2 stars is even a little generous. \nI had the $19 duck appetizer. Now I love crispy duck and could eat it all day, but the skin was soggy and slimy and there were bones everywhere. Then I had the Singapore seafood noodles. I got 2 shrimp, 2 scallops and 1 piece of white fish. Expected more for $26. \n\nWith so many other options in Vegas, it's safe to say I won't be coming back."
        }, 
        {
            "index": 166, 
            "rating": 2, 
            "review": "The food is too pricy for the quality. Spare ribs were not the best, soup was very plain  and both entrées were loaded with sodium      and were below par.  The staff is friendly and offered good service.  The atmosphere is nice but what good is a pretty cell phone with bad reception and dropped calls? Would never come here again."
        }, 
        {
            "index": 167, 
            "rating": 2, 
            "review": "I went to get a quick bite to eat at noodles . I ordered the satay chicken $13 for 3.5 pcs .  The wait was around 20 minutes from the time I ordered . I order satay chicken all the time around Las Vegas and for 5pcs it is usually $7-$8 . The most important thing is this was the worst tasting satay chicken I have ever had . The service was fine ... The food was not good and was overpriced !"
        }, 
        {
            "index": 168, 
            "rating": 3, 
            "review": "This was just okay. Nothing we ordered was bad, but it was a bit overpriced. Okay, I know that should not be surprising in Vegas, but the environment was sparsley decorated, no real vibe of any sort at all. Bowls of soup were like $10. I guess I am used to the hard core authentic places that give you awesome food for giveaway prices.  \n\nWonton soup was fine. Nothing here nor there. http://www.yelp.com/biz_photos/IImZFNzX4cP84rFsyb-9mQ?select=bc-yxdm0IHKl6nonLzfwpw\n\nSeaweed salad was again fine. Standard. http://www.yelp.com/biz_photos/IImZFNzX4cP84rFsyb-9mQ?select=QCkc2BuIX6v5Pq17ia_x1w\n\nPan Fried Dumplings were good. Nothing great, but good.  http://www.yelp.com/biz_photos/IImZFNzX4cP84rFsyb-9mQ?select=Dw-0ZFQtX-biYZj9ZKMAMA\n\nIt wasn't very Vegas festy inside. I think maybe if you have a hard core drunk craving for Chinese in your room and are willing to pay more than the usual price, this may be the answer, Otherwise, I wouldn't bother. Too many other cool places in Vegas to experience."
        }, 
        {
            "index": 169, 
            "rating": 3, 
            "review": "There aren't that many places open for lunch at Mandalay, so I was surprised that this place wasn't more crowded.  There is nothing special about this place, but just a quick place to drop in and get something to eat.  The orange chicken was decent, but nothing worth coming back for."
        }, 
        {
            "index": 170, 
            "rating": 2, 
            "review": "Nothing else was open at Mandalay Bay at 12am (even the Raffles Café).  It was exactly what I expected.  I just wanted soup but they were out of the only thing I wanted (hot and sour soup).  \nWhat to expect?  Overpriced Asian food.\n\nTried the Pad Thai - wasn't horrible but I've had better at Fast Food Thai Places that is quarter the price"
        }, 
        {
            "index": 171, 
            "rating": 4, 
            "review": "Restaurants are a hit and miss and if you truly only rely on reviews to dine at a place, you might have missed out on a lot of good places. Then again, everyone's food preference is different. What may be tasty to you might not appeal to everyone and vice versa. \n\nBased on Yelp, this Noodle Shop is rated poorly, two stars in fact and I'm glad I didn't refer to Yelp before deciding to dine here. Some places has been overrated and in this case, underrated. Probably have CES to thanks too, since everyone is just super busy and just trying to grab a quick meal before hitting the convention halls. \n\nThis is my 2nd time dining here since I got in for CES. Tried a total of 3 dishes: \n\nNoodles 8/10- The broth is tasty, thick and flavorful. I opted for the thick broth(hot and sour soup broth). Noodles were perfect, exactly how I wanted it to be and not over cooked. The Chili on the side is nice and compliments the dishes. \n\nFried rice 9.5/10- I'm not a fan of soft, gooey, sticky fried rice. I love my rice \"separated\" in individual grains and still have that texture to every bite. This place serves the perfect Asian fried rice. \n\nVegetarian fried rice $13\nShrimp fried rice $16 \n\nPrice point is not that bad considering this is Mandalay Bay and Vegas! Would I come back, of cos!"
        }, 
        {
            "index": 172, 
            "rating": 1, 
            "review": "Sorry, wanted to like it but just can't. We've been here every year for the last 3 years at least. This past month will have been our last visit. The Mongolian beef was expensive, small, and mushy. It was nothing like I'd even expect from our local takeout place. It was more disappointing since we had phenomenal Mongolian beef from Monte Carlo the day before, for cheaper! The only thing that has been decent is their noodle soups but even those are fair at best.\n\nOh and the worst part was watching them \"clean\" the dirty tables. After a party left, a woman came to clean off the table. She used one of thief USED a water cups, dumped it on the table and wiped it down with a rag....umm that is NOT cleaning!"
        }, 
        {
            "index": 173, 
            "rating": 3, 
            "review": "This is a solid 3 star restaurant judging from our one and only experience here.\n\nFOOD. We ordered the BBQ pork over rice and the beef chow fun. The BBQ pork was so-so, mostly because there was a strong spice in there that isn't in most BBQ pork rice dishes I've consumed in my life (I have had many, even in Hong Kong). Still, it was edible and all fine. The beef chow fun was the same experience... Ok / not great, pretty salty but still pretty edible.\n\nSERVICE. Good actually! They checked in fairly often to see how everything was and if we needed anything else. No complaints. If anything, my only complaint was for the table beside us - Chinese mainlanders with a kid who was watching his iPad movie on FULL BLAST. So. Annoyed. \n\nThe restaurant itself is well maintained. Felt clean, updated, etc."
        }, 
        {
            "index": 174, 
            "rating": 4, 
            "review": "I still like this lil Hidden hawaiian joint in the CAli hotel.  It's not fancy but the food is hearty and tasteful enough to make you feel like you're eating authentic hawaiian food.  We typically order the Saimwn, daily special, and musubi!"
        }, 
        {
            "index": 175, 
            "rating": 1, 
            "review": "Oh no...one word in a nutshell: BLAND!  Located in the Mandalay Bay casino I don't know how this place stays afloat...you're  better off going to Panda express trust me!"
        }, 
        {
            "index": 176, 
            "rating": 2, 
            "review": "I was pretty famished after landing in Vegas - so I need some lunch immediately. I wish I hadn't made the snap decision of eating here. Considering everything in Mandalay Bay is upscale - I thought this place would be good to eat.\n\nSorry, it isn't. I had a bowl of seafood soup. Let's talk about that. \n\nSoup Base: Tasted of Instant Replicated Add-hot water broth.\nSeafood: Yay for reheated frozen shellfish\nVegetables: Just a few overcooked leaves of kai-lan?\n\nI paid 15 bucks for reheated shellfish and instant soup? \nI won't be around for Round 2."
        }, 
        {
            "index": 177, 
            "rating": 1, 
            "review": "Both my friend and I got sick eatting here over the weekend.  Had a craving for some won ton noodles and I really didnt want to drive or catch a cab to go some place else.  Big mistake.  The broth was warm, the noodles were soggy and the won ton was barely cooked.  It's very expensive by the way.  You are looking at around 14 dollars for a bowl of noodles.  Sam woo in Spring mountain road is better if you are willing to catch a cab out there.  The wok at the mgm is cool too if you want to walk across to MGM.  Hate to say this but if I had to stay at the Mandalay Bay again, i might have to eat there again............I guess I won't be staying at the mandalay bay.........hahahaha.  If you would like to eat at a great authentic chinese restaurant off the strip.........try Joyful House."
        }, 
        {
            "index": 178, 
            "rating": 2, 
            "review": "The only thing that's good here is the won ton noodles, i mean the texture of the noodles... Other than that everything else was NO BUENO! Our vietnamese coffee was watered down, and our duck was OLD! never again!"
        }, 
        {
            "index": 179, 
            "rating": 1, 
            "review": "The Tai fish soup really needs to have fish in it! Three morons stood talking while I waited for my check. They handle real money like it was an alien from outer space."
        }, 
        {
            "index": 180, 
            "rating": 2, 
            "review": "I learned the valuable lesson of what happens when you don't yelp a restaurant when traveling.. The Noodle Shop was utter crap... Overpriced and seriously mediocre.. I passed by the place and it looked  decent and it was jam packed with smiling Asian folks... I thought that was a good sign.., but boy was I wrong... I tried the seaweed salad with deep fried tofu, seafood wonton soup, and roasted duck/ BBQ pork combo.. The BBQ pork was decent but only had about four bites with the serving.. Totally overpriced $18.... The ice teas were like $4 bucks and of course \nyou gave to pay for a \"small\" side of steamed rice... The rice was actually worth it's price tag, but really \"how do you f$*k up rice\"... If you have a need to waste money and torture you're taste-buds then the Noodle Shop will not disappoint...\n* gave this place a second star  because the service was good despite it being packed...."
        }, 
        {
            "index": 181, 
            "rating": 1, 
            "review": "Biggest mistake that I made on my recent visit to Vegas was not checking Yelp on this restaurant.\n\nAs most reviewers have noted the food is not good and it is way overpriced.\n\nLowlight of our meal.... My daughter order the BBQ pork noodle soup.  It was horrendous; it smelt and tasted like a bad fish market.\n\nFind any other restaurant.  Don't waste your time or your taste buds."
        }, 
        {
            "index": 182, 
            "rating": 1, 
            "review": "Wow, this place has gone downhill fast. It used to be my go to late night restaurant. Not any more.\n\nFried rice tasted stale, and the chicken tasted odd."
        }, 
        {
            "index": 183, 
            "rating": 1, 
            "review": "Wow really? \n\nI was way too hungover to check yelp before coming here.  That's the last time I make that mistake.  It was way overpriced and flavorless.  Our group had the wonton soup with noodles.  The broth was like boiled water.  I had the lunch special with mongolian beef and hot and sour soup.  Some special at almost 20 bucks.  Not much beef.  Also there were flies in the restaurant.  I could accept that at a hole in the wall joint not a place inside mandalay. \n\nPLEASE DO NOT WASTE YOUR MONEY HERE!!!"
        }, 
        {
            "index": 184, 
            "rating": 2, 
            "review": "Our server was extremely friendly and accommodating. The food was sub par. We had the beef brisket soup that had a layer of fat oil lining the top. The beef broth was tasty but probably wasn't skimmed of the fat. We also had the chicken with vegetables. The sauce and chicken basically had zero flavor and was completely boring. Definitely a waste of money."
        }, 
        {
            "index": 185, 
            "rating": 2, 
            "review": "The only reason they get 2 stars instead of 1 is bc my extremely mediocre and overpriced black bean chicken temporarily ruined my appetite & left me more room for the Rio seafood buffet the next day. Then again, maybe I subconsciously wanted to pay a lot to eat blah food - being from LA, how did I expect this place, catering mainly to drunken tourists that have never had authentic bb chicken, to compare with the real stuff in LA? Also, I was particularly upset that I discovered the Burger Bar was also at Mandalay Bay right after eating here. I had been jonesing for a burger alllll night and specifically had my mind set on burger bar, but forgot which hotel it was in. On the bright side, my skimpy little shreds of chicken accompanied by a few bell peppers was probably a lot less caloric."
        }, 
        {
            "index": 186, 
            "rating": 3, 
            "review": "i was surprised coming here for the second time. I ordered beef noodle soup and it was pretty good.  It is pricy for casual chinese but it is expected."
        }, 
        {
            "index": 187, 
            "rating": 2, 
            "review": "The price is very high but the quality of the food is deeply unsatisfying.we ordered Yangzhou fried rice and their special fried rice. They tasted the same. Disappointed."
        }, 
        {
            "index": 188, 
            "rating": 3, 
            "review": "Oddly, for all the negative hype of this place, and the ridiculous price tag (and I'm talking ridiculous - I think we paid the same amount here as we did the Border Grill, and that's a signature restaurant while this one is labeled \"casual\" by Mandalay Bay), the food was actually pretty tasty.  I think the expense has to do solely with the fact that this is Vegas we're talking about - anywhere people can be bilked to fork over change, whether it be for fois gras or a plate of fried rice, it's going to happen.\n\nThat all being said, my potstickers and chow fun were tasty and came out of the kitchen hot.  I was satisfied and pleasantly surprised.  If you're stuck in Mandalay Bay and are craving asian, this is fine by mid-level standards."
        }, 
        {
            "index": 189, 
            "rating": 3, 
            "review": "This is probably a repeat of what most yelpers have said already, but this place is way too pricey for the quality of food.  I had the shrimp wonton soup, which wasn't bad, but wasn't mind-blowing either.  I also ordered the lychee martini which tasted like the juice that comes with canned lychee, and that was it, little to no alcohol content.  My sister had the chicken chow mein which she said was a little too salty.  My mother really liked her rice porridge, however, and I had a bite of the pan-seared dumpling that my other sister ordered which I found rather tasty.  Service was super-friendly though, couldn't fault them for that.  Still, I probably won't be returning."
        }, 
        {
            "index": 190, 
            "rating": 1, 
            "review": "I do NOT recommend wasting your precious time in Vegas by eating at this restaurant.  Not only are portions small,  the manager at the particular moment was not customer friendly & tried to give someone else's business card when I asked for hers. If this is her name, Yvonne Chow. SO UNTRUSTWORTHY. I Can honestly say I've never experienced anything like that before.  Unapologetic & rigid. What happened to customer service?  Doesn't exist here! I Wouldn't Expect This at Mandalay,  where we come each time we visit Las Vegas. NO STARS!!!"
        }, 
        {
            "index": 191, 
            "rating": 1, 
            "review": "Astoundingly bad. We had some sort of chicken dish - it had an overly sweet sauce with way too much soy sauce and only after I was half way through did I realize what was really wrong. The chicken pieces appeared to be the preformed chicken  nuggets you get from any fast food joint smothered in a disgusting sauce. You can get better from the freezer cabinet at Safeway.\nBeef chow mein was tough, greasy and bland."
        }, 
        {
            "index": 192, 
            "rating": 1, 
            "review": "Ugh, what a waste of a meal.  It was certainly overpriced, but the bigger problem is that the food was flavorless.  The pho broth was watered down, the beef in the pho was tough, and the noodles were swollen.  We got other dishes and all the same story.  The Mandalay Bay could do much better, especially with a restaurant right off the casino floor and in a high traffic area."
        }, 
        {
            "index": 193, 
            "rating": 4, 
            "review": "I'm not sure why people are so down on this. I would give it 3.5 to 4 stars.\n\nI was these for a convention so I grabbed a quick lunch   I had the shrimp udon with xo sauce. The noodles were very good tender and the portion was large.  The flavor was good not too salty at all.  Lost of onions and scallions which I liked. It was served piping hot.\n\nI also tried the shrimp shumai. They take longer to make. These were a bit tough and over steamed.\n\nThe service was very good and attentive.   I definitely preferred this as a reasonable lunch option in a resort that is not the greasy food court."
        }, 
        {
            "index": 194, 
            "rating": 2, 
            "review": "Inside the Mandalay Bay. If you're looking for a hangover cure.. this isn't it.\n\nWonton noodle soup- 2/5. I suppose this may be relatively good here? Noodles are hard and soup is generic and MSG tasting.\n\nThousand year old egg porridge- 2/5. Bland once again with small portion of thousand year old egg and a measly small sprinkle of green onions.\n\nMongolian Beef- 1/5. More like elementary school 'mystery meat mondays' for $20.\n\nLettuce mince meat wrap- 3/5. Okay tasting but small portions, more like a small appetizer. \n\nHigh priced, but then again you are in Vegas so that's to be expected. But the quality is not good. It's much more worth it to drag yourself to a Pho place off the strip to cure that hangover."
        }, 
        {
            "index": 195, 
            "rating": 1, 
            "review": "What a rip off! I  have never been charged 15 bucks for a pot of Chinese tea . They need to state it on the menu.  Also, our dinner costs 70 bucks for a plate of noodles and a bowl of porridge.  I rather buy a cup of noodles."
        }, 
        {
            "index": 196, 
            "rating": 1, 
            "review": "This was a horrible experience.  Singapore noodles were the worst i have had. Prices were stupid for quality."
        }, 
        {
            "index": 197, 
            "rating": 3, 
            "review": "Good for a late night bite if you are in the mood for Asian.  I thought the service was fast and pretty upscale considering a diner like setup.  Food tasted good but no it will not be any kind of healthy so hit the gym in the morning after your late night bite here!"
        }, 
        {
            "index": 198, 
            "rating": 5, 
            "review": "Amazing food! Reccomend Pho soup! Not with the beef it comes with though, that meat was disgusting! Minus the meat it was Amazing.. Mongolian beef was great as well! I felt the plates were pricey for being very casual dIning, also didn't serve you that much Meat. \nGreat service, friendly & upbeat! Would reccomend!"
        }, 
        {
            "index": 199, 
            "rating": 5, 
            "review": "Yummy!  I love this place!  Tasty dishes for a great price!  You definitely get your money's worth.  And the employees there are so cute and nice!"
        }, 
        {
            "index": 200, 
            "rating": 3, 
            "review": "A-OK. Our experience was certainly better than a lot of other people here and we are used to VERY GOOD Asian food in Chicagoland.\n\nVery nice tastefully minimalist decorated with very tall white private booths, white tablecloth etc. You pretty much completely disappear once you are seated, and would have to stand and turn around to see any other guests. Great Escape frankly from the marble hallway endless music din from a nameless cover band and casino pinging in the distance; also a good place for that \"it's not you it's me\" conversation initiating  some good makeup or goodbye sex and a fight over the cat and dog.\n\nI'll be honest, it was late enough and we had enough of a buzz going from whatever show we had been to that we do NOT remember exactly what we had, but it was Good AND we had leftovers and ate them too. I think we had Singapore noodles and a duck entre, I know it wasn't tofu, seafood or chicken. Spices were low, I know I asked for medium on something and got low. Anyway, of course their site isn't going to spit a menu up but here for some reason, but here is how to eat here if you are in the Mandalay Bay Complex hungry and it is after 10pm. \nTell your server any food limitations and preference and ASK what they recommend and go with it if it sounds good because I KNOW that is what we did and it was late enuf that I am pretty sure the chef served our meal, not a waitress. They also had some ok LARGE by the glass wines. And use some common sense, The Noodle House passed my yummy smell test when we came in, but we weren't ordering the weekend seafood special on a Tuesday night at 10:30pm. If it doesn't feel right, get up and walk out, trust your intuition; I do it all the time and never regret it. \nBon Appetit."
        }, 
        {
            "index": 201, 
            "rating": 1, 
            "review": "This was really bad. Wanted to get a quick bite before a show and they atmosphere, waitresses, and food was terrible. I had shrimp and vegetables which tastes like it was in water instead of a garlic sauce and my husband had a chicken, beef, shrimp dish in brown sauce which was also terrible. Food came out in ten seconds suggestive its not fresh and the bill was brought before I was done eating. No good drink specials."
        }, 
        {
            "index": 202, 
            "rating": 1, 
            "review": "UGHHHHHH! after we ate here we were immediately dying from all of the MSG used in the food...everything was WAY too salty. and its very hard to make congee taste bad but they did...\n\nmy husband had the pho and a friend of ours had the pad thai.......both of these were absolutely disgusting!!!!!! Its a cute fast place but the food is absolutely disgusting..."
        }, 
        {
            "index": 203, 
            "rating": 3, 
            "review": "Have roast duck on rice and mandarin braised beef noodle soup. The noodles and the rice part is good but not the meat. My roast duck has distinguishable skin and fat layer, which wasn't that enticing. I would expect a very good bowl of beef noodle soup but the texture of the meat is just too weird. I give an overall 3 start because the service is okay but food doesn't impress me that well."
        }, 
        {
            "index": 204, 
            "rating": 1, 
            "review": "Most expensive Chinese food ever!! Sad thing is that the food looked and tasted like it was the 1/4 of the price charged... very, very, disappointing!!! We weren't even asked once if we wanted our soda topped off !!"
        }, 
        {
            "index": 205, 
            "rating": 2, 
            "review": "$18 for a bowl of soup with a 1/2 pound of spagetti noodles, two thin slices of beef, a pinch of basil, a pinch of bean sprouts and a pinch of cilantro with a couple hot peppers.  Maybe it was because it was the end of my four days in Vegas and it gets tiring to be hammered with overpriced food day after day after day, but this was the final straw."
        }, 
        {
            "index": 206, 
            "rating": 2, 
            "review": "The food was so whack. My dad and I ordered the wonton noodles and they were very soft, almost like rice noodles instead of a slightly gummy/al dente texture that egg noodles are supposed to have. My dad's coworker ordered pad thai, which was oddly yellow in color, something I've never seen any restaurant make before. They also didn't have any Vietnamese coffee because they were apparently having issues with their supplier or something. The prices are high, but it is what it is being a Vegas hotel restaurant. \n\nThe waiter on the other hand was very friendly and I felt bad for him because it seemed like he was struggling handling the bowls of very hot soups."
        }, 
        {
            "index": 207, 
            "rating": 2, 
            "review": "Expensive for Pho. Worst Pho I've had to date...I wanted to eat all of it because Iwas paying so much for it, but I couldn't stand it any more...I ended up leaving my bowl 1/3 full. I ate at Viet Noodle on West Spring Mountain the other day for less than half the price of this Pho and it was some of rhe best Pho I have had in Las Vegas. The lettuce wraps were sub-par. P.F. Chang's lettuce wraps are much better...and less expensive. Service was quick and decent. Though, the restaurant wasn't very busy at 8:30 on a Monday night."
        }, 
        {
            "index": 208, 
            "rating": 4, 
            "review": "Came here for a quick lunch with my parents since we didn't want to leave the hotel. We ordered the chicken lettuce wrap and shrimp fried rice. My dad and brother really enjoyed the the fried rice while the chicken lettuce wrap was just whatever for the price we've had better"
        }, 
        {
            "index": 209, 
            "rating": 3, 
            "review": "usually places that serve multiple types of cuisine can't hang, but i actually found the food at the noodle shop to taste just like at back home.  too bad the prices are double what a normal SGV restaurant would charge.  it IS vegas afterall, so you really shouldn't be surprised.  \n\nfor the convenience factor of being inside the mandalay bay, and the fact that you can satisfy everyone in your groups craving with choices ranging from won-ton noodle soup to pho, i was pretty satisfied."
        }, 
        {
            "index": 210, 
            "rating": 1, 
            "review": "Even after you read all the reviews and you're thinking to yourself, it can't be that bad... don't go.  \n\nIf my friends and I could give this zero stars, we would.  We're not sure we've ever had such a bad experience.  Ever.  \n\nWe ordered pad thai and the shrimp and asparagus - both were lackluster and tasted odd...even the plain white rice tasted smoked or burnt.  We couldn't decide.  \n\nEven though it's inside Mandalay Bay, don't be fooled... it's hard to imagine how this place has stayed open as long as it has.  \n\nI know this review is harsh, but it's truthful.  Find another place for dinner.  You'll thank me later."
        }, 
        {
            "index": 211, 
            "rating": 1, 
            "review": "completely overpriced. service is slow. food is moderate.. would not recommend the pho or the preserved egg congee. but I guess if you are trapped in the Mandalay and must have Chinese food (and money is no object).. then consider yourself forewarned."
        }, 
        {
            "index": 212, 
            "rating": 3, 
            "review": "The wonton soup at the Noodle Shop was just what my tummy needed after indulging at buffets along the strip for the last couple of days.  The broth was hot and flavorful, and it helped soothed my throat which has grown weary from inhaling the smoke filled air of the casinos. The long thin noodles were a lot of fun to eat and were very tasty.  The wontons were good, but I don't think they were as good as other wontons I've had.  They offered generous portions which left me comfortably full.  However, the downside is the price-- $13 is a lot for a bowl of wonton soup!  I'd probably see what other Asian restaurants there are in the area before I return to this one."
        }, 
        {
            "index": 213, 
            "rating": 2, 
            "review": "Before coming, we read the reviews. We should have listened. However, we were staying in Mandalay Bay and craving warm asian food, so we figured to give it a try- how bad could it be? \n\nWe ordered the fried rice, beef chow run, and dim sum platter. To start off, everything is overpriced, but that is fairly typical on the strip. The fried rice was very bland. The beef chow fun was too salty. Nothing seemed to be going right.\n\nThen, it got worse. We were told the dim sum sample platter for 2 would take 15 min to arrive. It took way longer. It consisted of 8 pieces shumai/ dumplings and 2 pork buns. For $30, I was expecting a bit more. To top it all, everything was disgusting. The dumplings were rubbery and everything else look liked it had been dyed with food coloring. After eating 2 pieces, we couldn't take it anymore and stopped. \n\nI've never had such a bad asian dining experience before. I didn't expect authentic food at a hotel in vegas, but I definitely never expected to encounter such a dining experience. Ever."
        }, 
        {
            "index": 214, 
            "rating": 4, 
            "review": "Hmmm The Noodle Shop. Me and the girls wanted something cheap and easy, and we didn't feel like going off the strip. So we went to old relible which is The Noodle Shop. We each order the same thing which was Kung Pao Chicken. (I know lame but hey) I ordered my extra spicy and they did not let me down. I swear we each had so much food but as hungry as we were, it was well worth it. Service was a little off but considering we were not in a hurry and had no where to be, it was quite ok.\n\nIf you are ever in Vegas and staying at the Mandalay Bay, stop over to The Noodle Shop. Yes the reviews are all over the place but you just may be pleasantly surprised."
        }, 
        {
            "index": 215, 
            "rating": 4, 
            "review": "My husband and I ate at the Noodle Shop twice while we stayed at Mandalay Bay.\nIt was 4 pm on Sunday the first time we were there. We were seated immediately and ordered our drinks. We ordered Mongolian Beef ($17.5), Hong-Kong Style Pan-Fried Noodles with Seafood ($18.5), Thai Iced Tea ($5.5), and house sparkling wine ($8).  The food was delicious and the right amount. My Pan-Fried Noodles were flavorful and I enjoyed every bite. My husband enjoyed his Mongolian Beef tremendously too. \n\nWe had a http://restaurant.com coupon for $25 off. Our bill came out to be $37.2. This is not a cheap place, but the food tastes good and it's convenient if you stay at Mandalay Bay.\n\nWe went back for dinner at 8:30 pm on Monday night. Again we were seated immediately. We shared Yang-Chow Fried Rice (with BBQ Pork and Shrimp, $14), and my husband had a Coke ($4).  The food was good and the waitress was attentive. The price of the meal is much friendlier this time. \n\nOverall it's a solid Chinese restaurant. I took off one star because of the price. We will go back again if we stay at Mandalay Bay."
        }, 
        {
            "index": 216, 
            "rating": 2, 
            "review": "The food is as bad as everyone one says. I only ate here because a friend that was staying at the Mandalay Bay was already here eating & invited us to come over from the Luxor next door and join them. I tried some of the beef bowl & the shrimp noodles, this was some of the blandest food I've ever had in my life. I didn't bother to try anything else they ordered since my friend said it was all pretty bad. Everything turn out pretty pricy too. We had about 3 or 4 orders of food & the bill was over $100.00. We should have just got on the tram to the Excalibar and got pix up stix from the food court."
        }, 
        {
            "index": 217, 
            "rating": 2, 
            "review": "Beef- filet mignon w asparagus - meat was chewy and fatty not lean- steam rice was dry.  Very disappointed after spending $60 for 1 person."
        }, 
        {
            "index": 218, 
            "rating": 3, 
            "review": "If you like MSG, come to the noodle shop in Mandalay bay to get your $15 a pop wonton soup.  \n\nWhile the service was impeccable and the waiters and waitresses were running around with their cute little Chinese restaurant accents (I am almost certain people do not talk like this normally - the Chinese accent for restaurants is totally romanticized.  i.e. I know plenty of Chinese people with terrible accents and enunciate on all the wrong harsh syllables.)\n\nAnyway, I can't believe we paid almost $30 for 2 bowls of MSG noodles.  It's straight robbery, I tell you.  I'd probably do it again, if I was stuck in Mandalay bay and hungover."
        }, 
        {
            "index": 219, 
            "rating": 3, 
            "review": "Came here after checking in at the Mandalay late on Friday.\n\nTo be honest, this place was okay, but I'll give it 3 stars cuz the service was pretty damn good. \n\nI ordered wonton noodle soup. Not bad, not awesome. Big portion, just pretty average in taste.\n\nBF ordered singapore style curry noodles. They were okay as well, nothing spectacular. I guess if you are hungry and it's late and you dont want to go to the Bellagio for their bomb ass noodle shop, then this is a good option.\n\nWe had the duck summer rolls to start. BLECH!! Just gross and hard and not worth it. Also had the shrimp shumai. Eh.. they were ok. Overall, this place was just ok."
        }, 
        {
            "index": 220, 
            "rating": 2, 
            "review": "Oh Boy, nothing sums it up than the service felt very forced and not very courteous from the hostess who sat us, and yes the server herself. You know that ominous feeling like you're just another digit versus maybe a repeat paying customer? Yes that feeling, like asking to get more menus for all of the people in the party? Isn't that restaurant 101 or were they that short on counting fingers to figure it out! The menu: typical choices you would find at all fast food \"Chinese\" take out. Flavor: tasted like the typical \"Chinese\" food from any average casino buffet. I say that because we were staying at Mandalay Bay and went to Bayside Buffet and the \"Chinese\" items were that much better! We had a fairly big party of 14 people, but there was maybe another 3 little parties in the restaurant the whole time we were there. 6 o'clock Saturday on Easter weekend. This place was empty, the service was lacking, you had to ask for everything (refill, napkins, etc). With a handful of workers just standing on the side wall coming from the kitchen, they should've been more attentive to a big party. The only item that was half decent was the Beef/Broccoli only because it was the only entree that came out like it was made to order and was somewhat hot. Everyone's meals were room temperature or looked undercooked. Everything was BLAND! Makes you wonder who cooks and manages this place in a nice Hotel like this. The second star is because the place was clean, other than that all negative reviews are true about this place. I for one would never recommend it no matter the convenience because you'll be paying the average price of $16-19 an entree, where your average good Chinese restaurant you would pay about half across the board. Service :1\nFood:2\nPrice:1  \nYou get the picture, avoid, avoid!"
        }, 
        {
            "index": 221, 
            "rating": 1, 
            "review": "Ooooohhh emmmmmm geeee. Horrible. Horrible. Panda Express is better than this. And that's a chain restaurant. \nWe ordered the house special fried rice. Nothing special. Orange chicken. More like battered chicken in oil. Steamed/seared shrimp dumplings. More like fried/burned dumplings. Please do not waste your money here or appetite."
        }, 
        {
            "index": 222, 
            "rating": 1, 
            "review": "Vegas is expensive, but it doesn't justify the price that the 'Noodle shop' is asking!  I can't quite remember, but I think the pho was like $15...  It's just highway robbery!\n\nThe place has small portion, and below average taste.    One of the dishes we ordered was the House special fried rice.  The waitress told us it has dry scallop, when the fried rice came we didn't see any.  Toward the end of the plate, then someone found like 3 small strings.\n\nIf this place was in Bay area, it would never survived this long  If you must order, the Hong Kong style noodle was decent taste."
        }, 
        {
            "index": 223, 
            "rating": 1, 
            "review": "Stopped by here on Sunday hoping to get a bite of some hot soup (great after a night of drinking) before our flight  - we had one hour to kill before we head to the airport for our flight -\nafter being seated, we waited around for liek 10 minutes and hadn't even been served water yet!!!!! so we figured service was going to be suuuuuper slow\nAdd that to the prices (16 bux for a bowl of pho! 12 for a bowl of wonton soup!), we just got up and left\nthe service was so bad, they didn't even notice we were there in the first place"
        }, 
        {
            "index": 224, 
            "rating": 1, 
            "review": "This was my first time @ The Noodle Shop, and to be honest, it sucked. Maybe I just ordered the wrong things, but doubt it. My friend and I ordered the shrimp in garlic sauce and the lo mein. Neither of them had any flavor whatsoever. The atmosphere, however, is super nice, and our waiter was AMAZING! I can't remember his name but he provided us with outstanding service. The prices at The Noodle Shop are not worth the bland flavored foods."
        }, 
        {
            "index": 225, 
            "rating": 1, 
            "review": "From the moment we were seated, we felt like we were an intrusion for the people working even though it was not very busy. They made our order wrong and the food was just ok. Also, the menu is a mix of dishes - it isn't really a 'noodle' restaurant."
        }, 
        {
            "index": 226, 
            "rating": 1, 
            "review": "I've gone here for years simply because the annual event I attend is at Mandalay Bay and it's the only place that serves food past 9:00pm (which is another problem).\n\nSo this year, I'm sitting there with my friends like always, we've had too much to drink like always, and we go to the noodle shop to get some food in us before we go to bed like always.  And finally, after so many years, it dawned on me....this place sucks.\n\nThe food is very bland even if you add 15 spoonfuls of hot sauce.  The service is insanely slow even though you can clearly see the servers standing around, talking to eachother, and always exchanging lots of pieces of paper.  The paper exchange thing is lame and annoying and I realized, in my booze induced haze, that this noodle place has been this way every single year.  I'm serious when I say, it is consistently mediocre.  The table is never completely set, you always have to ask for hot sauce or soy sauce.  The whole damn place is using hot sauce and soy sauce but you still have to ask for it.  What's the deal with that?\n\nLast but not least, the prices are absolutely insane.  $19 for a bowl of noodles?\n\nI miss the good old days when every hotel casino had a 24 hour coffee shop where you could get good food for next to nothing.\n\nScrew this place, I don't care how hungry I am, I'm never going here again."
        }, 
        {
            "index": 227, 
            "rating": 2, 
            "review": "I wish I read the reviews 1st - before dinning here! \n\nIt said 2 stars - that's accurate! \nHow do you mess up Pad Thai!? \nSauce was off / noddles were egg noodles, not rice :/ \n\n2 stars for clean / good service\n1 star for food"
        }, 
        {
            "index": 228, 
            "rating": 3, 
            "review": "This place is crazy over the top pricey for what looks like the 24 coffee shop in most hotels in Vegas. \n\nHowever, if you just want a dish, it soooo good. I had Singapore Noodles and shall crave them from California."
        }, 
        {
            "index": 229, 
            "rating": 1, 
            "review": "EW.....was walking through Mandalay Bay with my BF on our last day in Vegas and saw this place and got really excited. We were both a little hungover and some chow mein and fried rice sounded perfect. \n\nI SO wish I had checked YELP before dining here. Service was horrible...we were seated right after a couple who looked wasted but were given a great booth and we were given a table in the middle of the dining area...um no\n\nMe: \"Can we PLEASE be moved to a booth?\" \n\nHostess: \"Oh, hmmm..okaayyy...is this better for you\" gave us a nice big booth with some big attitude to boot. \n\nMe: \"Yes actually this is PERFECT\"\n\nServer was quick, too quick for not being crowded at all. As if she didn't care and just didnt want to talk to us at all. They also forgot my drink, which just irked me in my hungover state. \n\nTo the food: the Spring Rolls came out about 10 mins after we ordered them and they were mildly warm. To me this equals: They are premade and left out and then poorly reheated...ew. \n\nI got chicken chow mein...greasy, slimy, gross. \nMy BF got pork fried rice...I dont like pork and this pork looked totally uncooked and the rice was not \"fried\" and barely had any veggies. \n\nOur server never came back to ask us if we wanted water and since there was so much sodium in the food we were dying for water. Had to practically yell at her across the room because she was darting about and talking with the other servers. \n\nBill was about $60 which is fine since we were in Vegas, but NOT for \nthe quality of the food or the service."
        }, 
        {
            "index": 230, 
            "rating": 4, 
            "review": "I visit the Noodle Shop at least once every time I go to Vegas. It's fast, easy and convenient.\n\nI really like the curried Singapore Noodles here and order it every time! The pork and shrimp in the dish are delicious.  The moo shoo duck appetizer is ok and their honey bbq pork noodle soup is just ok too, I'd suggest sticking to the Singapore Noodles they're my favorite! \n\nIf you're looking for a more formal sit down, full service experience go to Shanghai Lily or China Grill. The Noodle Shop is good for a quick casual meal."
        }, 
        {
            "index": 231, 
            "rating": 3, 
            "review": "Had the Young Chow Fried Rice which was alright.  The pieces of BBQ Pork could have been larger and tastier.  Service was OK."
        }, 
        {
            "index": 232, 
            "rating": 3, 
            "review": "Good hangover food at the Manday Bay Resort.  The duck and noodle soup ain't bad.  Kimchi was average at best."
        }, 
        {
            "index": 233, 
            "rating": 3, 
            "review": "$28 for Wor Wonton soup? It wasn't that great, even for being hung over.\n\nThe manager was really nice, however and comped the bachelorette a mimosa."
        }, 
        {
            "index": 234, 
            "rating": 5, 
            "review": "My daughter and I ate here twice during our stay at Mandalay Bay, despite the bad reviews on here and it was great. We were seated promptly and someone came up to take our drink orders right away. After giving us a couple minutes to study the menu our server came up to take our order. We got the Chicken Chow Mein and the Chinese Broccoli. It only took 10 minutes to arrive before us and it was good. The chow mein was not too greasy and had plenty of flavor and my 5 year old daughter and I are picky about our chow mein. The broccoli was perfectly cooked with just the right amount of oyster sauce. I would eat here again."
        }, 
        {
            "index": 235, 
            "rating": 4, 
            "review": "Every time I have attempted to visit the Noodle Shop restaurant at the Mandalay Bay something has happened which prevented me from going. (E.g., Closed due to remodeling, closed due to water main break, closed due to stars alignment with Jupiter, etc..)  Anyway, I finally had a chance eat at the Noodle Shop and we weren't disappointed.\n\nMy daughter Muff, sister Luch and I were exhausted and broke after spending the day at the Fashion Show Mall.  We barely dragged ourselves back to the hotel and decided to eat before we went to our rooms. (We said that if we could make it to our rooms, we were NOT leaving.  And the previously checked out room service menu didn't strike our fancies.)\nWe perused the menu and here's what we ordered:\n*  Shumai, \n*  Singapore-Style Fried Rice Noodles with Shrimp and Pork\n*  Shrimp, Beef and Chicken with Garlic Sauce;\n*  BBQ Pork with Mixed Vegetables\n\nOnly four dishes with rice and enough to feed a family of moose!  Everything was delicately flavored and wonderful.  I love garlic, but it can easily overpower any other flavor in its path.  It was present and accounted for in my Shrimp, Beef and Chicken with Garlic Sauce but not overly so.  My sister's Singapore-Style Fried Rice Noodles with Shrimp and Pork was also delicious.  And my daughter Muff's BBQ Pork with Mixed Vegetables was simple yet enchanting.  And the freshly made Shumai was delightful.\nWe had a scrumptious lovely meal to end our day of shopping madness."
        }, 
        {
            "index": 236, 
            "rating": 1, 
            "review": "Drunk or not, the service is terrible. The attitude of Chinatown without the price or the authenticity or flavor. You'd do better at Raffles since the wait would be just as long but at least it's a comfortable setting."
        }, 
        {
            "index": 237, 
            "rating": 2, 
            "review": "Don't waste your time dining here-mediocre food at best with sloppy plating and presentation. Shrimp pad thai was tons of bland noodles, a few tail on shrimp, and some onion with the option to add peanuts and squeeze lime on top. All the limes in the world wouldn't have helped this flavorless dish. Very pricey for quality and value. Be sure you don't expect to try dessert-the check was presented with no question of any dessert or drinks-and when we queried the waitress-we were told they don't have dessert? Drinks, appetizers, entrees, rice, noodles, but no Dessert? Just plain weird."
        }, 
        {
            "index": 238, 
            "rating": 3, 
            "review": "mmhmm...except for pre-req overpricing on every food item, it was delish and not msg-y."
        }, 
        {
            "index": 239, 
            "rating": 1, 
            "review": "Walk away while you can.\n\nWent to Vegas for a bachelor party and statyed at The Hotel at the Mandalay. After checking in my boy's and I needed a quick fix and wanted something quick and cheap, which we could not find at the hotel. So we ended up at the noodle shop. \n\nLong story short, the food was okay and we paid  around $11 for effing soup that was just blah. We were still hungry and ordered the combination fried rice which was $12 blah, but for $12 I was expecting a mountain full of rice. Instead we got a speed bump of rice. \n\nOverall this place was an overall bust, that placed $25 in my pocket. If you can't find anything to eat at the Mandalay that's quick and cheap I recommend walking a little further to the Luxor or go to the Cafe."
        }, 
        {
            "index": 240, 
            "rating": 4, 
            "review": "We had the honey BBQ pork and roasted duck noodle soup and were very happy with both out dishes.  It came with Chinese Broccoli which was a plus.  The broth was flavorful for us - we drank the whole bowl.  I would come here again."
        }, 
        {
            "index": 241, 
            "rating": 1, 
            "review": "so disappointed.Checked in late and kids were hungry Thought I would take them to a nice dinner..We ordered orange chicken.it was gross and just some fried chicken with soy sauce.Told waiter we did not like and it was nothing like orange chicken we have had elsewhere.His response was that was how they do it.Chow Mein a little better but very average same with fried rice.As a previous reviewer said Panda Express would have been much better and not cost $55 for 3 dishes.A waste of money and a big disappointment!"
        }, 
        {
            "index": 242, 
            "rating": 4, 
            "review": "The house chow mein was amazing! The service was quick & friendly! I am definitely coming back!"
        }, 
        {
            "index": 243, 
            "rating": 1, 
            "review": "Really horrible Asian food in Mandalay Bay, right next to the casino.  I ate there once and didn't go back."
        }, 
        {
            "index": 244, 
            "rating": 1, 
            "review": "Called for the House Special Fried Rice with chicken and shrimp and the BBQ Pork Fried Rice. Both sucked. I could feel the crunch of MSG on both. BBQ pork had no flavor (zero). House Special Fried Rice was nothing but normal fried rice with chicken and shrimp. Nothing great about the ambience. Go only if you are craving for low grade asian food."
        }, 
        {
            "index": 245, 
            "rating": 4, 
            "review": "I don't know where the negativity is coming from. \nI loved my chicken chow mein, and my husband loved his chicken pad Thai. We also shared the BBQ Pork Buns, and OMG they were soooo good!!\n\nThe service was on point too, waters were refilled constantly, and plates removed after finishing our meal.\n\nI would definitely recommend this eater-y!!"
        }, 
        {
            "index": 246, 
            "rating": 2, 
            "review": "With all the good food around in Mandalay Bay, our expectations for Noodle Shop where high. Unfortunately, for the second time, we were disappointed. We tried it last year, and again this year. Their menu is varied and looks good. But the food we ordered was bland.  This time, we had Pho (Vietnamese Noodle Soup).  We eat lots of Pho in various cities, and this one just wasn't close. \n\nThe only saving grace is they offer a shaved ice, with red beans and coconut milk. Yummy!! For this, we went back a couple times for dessert.  But other than this, we do not recommend this place to our friends."
        }, 
        {
            "index": 247, 
            "rating": 1, 
            "review": "Wow, where to begin with this place. Only came here because of my brother in-law. He kept saying how great this place was and plus every restaurant there was pack expect this place. I wounded why... So I by pass looking at the tips and reviews that everyone wrote so I can give this place a fair chance.\n\nSo soon as we put our name on the list we waited only for about 5 mins. Okay, that is cool place didn't seem so bad. Right? Place look clean, got seat away from everyone else so it was a nice family style of five. Then this is when the stars kept on falling here... We waited for ten mins for the server to get us water and our orders to be put in. We had to flag some manger to get someone to attend to us. \n\nNow comes the good part dinner. We order fried calamari, pancake, and BBQ pork. Out of the three the BBQ pork was the best. The pancake was too powdery too me. And the calamari it was all batter! Horrible. As for our main course the duck soup with noodles was bland. Shrimp fried rice was okay but lucky for me they had sriracha  the house special noodles was okay but again sriracha is needed again.\n\nTo sum it all up, come here for BBQ pork. If you really have too. I mean if you have no where else to go and your super hungry. Other than that if you still have the power to wait else where to eat then go somewhere else. This was not worth the money or time to try."
        }, 
        {
            "index": 248, 
            "rating": 1, 
            "review": "Inside Mandalay Bay, Great environment clean establishement .\n\nI ordered the pork....or was it beef? noodle soup, it was ok , A giant plate of Mexican Clemole would have been better. The coffee was excellent! \n\nI am not an Asian food expert but I have found Thai food to be my favorite and what ever this was wasnt even close as taste is concerned . It was, hmmmmmm....decent."
        }, 
        {
            "index": 249, 
            "rating": 1, 
            "review": "This is bay far the worst \"asian\" food I have ever had the displeasure of consuming.  My group of 6 needed to have a quick lunch, and since we were staying at the hotel, decided to give it a try.\n\nWe each ordered something different on the menu.  I went with the beef noodle soup, while my friends tried the pho, broccoli beef, mapo tofu, pad thai, and some chicken stir fry dish.  To my disbelief, each dish qualified as the worst version of these foods I have ever tasted.  They used the wrong sauces and the wrong noodles in each dish.  My friend that ordered the pho had to send it back (the first time he's ever had to do this at a restaurant).\n\nThis place should be shut down, then burned to the ground."
        }, 
        {
            "index": 250, 
            "rating": 4, 
            "review": "I dont know why everyone rates this place so bad, i thought it was pretty good, good enough to come here twice! Yea of course expect vegas prices, dont complain about the cost. I had beef noodle soup and added won tons for extra $4 that was such a bomb and hearty meal! Had my asian cravings satisfied, they are generous with the meat portions. Also ordered some dumplings that tasted great juicy inside and fresh. 2nd time around I ordered pork, seafood soup no noodles; it came with scallops, shrimp, bbq pork, won tons, squid, and some veggies. Filled me up! I would come here again if i stay in mandalay otherwise its a bit too far from the other hotels."
        }, 
        {
            "index": 251, 
            "rating": 4, 
            "review": "Went here with a group of 11 this weekend after a wedding, reception and a little bit of after partying.\n\nEveryone got something different and there was a lot of sharing and tasting around the table.\n\nEvery single one of us was happy with our food, another reviewer said that they would rather go to Panda Express and that just blows my mind.  The food at Noodle Shop was really well prepared and perfectly seasoned when we were there!\n\nSome of the standouts from the evening include the Pad Thai (both shrimp and chicken) the Pho (expensive for Pho but tasty!), the eggplant, the black bean chicken and a tofu dish.  The lettuce wraps were tasty but the ones at P.F Changs are better (and I hate PF Changs).\n\nThe place is a little pricey but it's a restaurant in a casino in Las Vegas.  I don't think they were priced more than any similar places we saw and the food was MUCH better than most casino/hotel cafes I've been to.\n\nI will definitely hit up the Noodle Shop again when I am in Vegas next."
        }, 
        {
            "index": 252, 
            "rating": 1, 
            "review": "The food here sucks. Everyone in our party had a stomachache after eating here. The pho was disgusting. Instant wonton noodles are better than the stuff they serve at this restaurant. The Mongolian beef was mostly onions and the meat was still raw. Service was not good. One person had to wait 20 minutes for his food after the rest of us got our food. Do not go to this restaurant."
        }, 
        {
            "index": 253, 
            "rating": 3, 
            "review": "I stopped here for lunch after seeing the Bodies exhibit at the Luxor.  Fusia was closed (my first idea), and I didn't really feel like doing the bus transfer thing all the way out to Chinatown.   That doesn't mean I didn't want Chinese food.  This is where I ended up.\n\nThe selection was okay, the food wasn't bad, but wasn't good (certainly not as good as what I could have gotten in Chinatown), and the prices were somewhat inflated (which I expected in a casino)."
        }, 
        {
            "index": 254, 
            "rating": 2, 
            "review": "Eh, not that great.  I definitely expected a lot more because of the location and price of the restaurant.  The service was not that great.  I actually had my bill slapped on my table as I was eating my lunch.  He expected me to pay too! but that wasn't really why I gave it 3 stars.  The food wasn't that good.  I tried the thai spicy noodles that costed me 15 bucks.  Ugh, just.. not that amazing.  Mediocre, poor service, and just bleh.  \n\nI really liked the interior design though!"
        }, 
        {
            "index": 255, 
            "rating": 2, 
            "review": "Wasn't the best. The food was pricey for the quality. The most annoying thing was that we wouldn't understand a word our server was saying. We constantly had to correct her because she was getting everything wrong. If they want to give their Chinese place an authentic feel, that is fine, but hire people who speak English. It made such an unpleasant lunch to have to do sign language and correct the server because of the language barrier. \n\nThe positive: The food came out very quickly."
        }, 
        {
            "index": 256, 
            "rating": 1, 
            "review": "I wish I could give it 0.00. It was not great, overpriced (26.00 for a very small entree and cup of streamed rice.  Don't go there."
        }, 
        {
            "index": 257, 
            "rating": 2, 
            "review": "We ordered 3 dishes.\nCrispy Calamari for an appetizer.\nThen, Orange Chicken & Hong Kong Style Pan Fried Noodles w/ Sea Food.\n Crispy Calamari was oily rather than crispy in texture. I did not like the dipping sauce at all, too sweet for me. \nIt could have been sweet & sour sauce...try adding the hot sauce.\nOrange Chicken was missing orange flavor. It was strong garlic and soy sauce flavors. Rice was on dry side...\nHong Kong Style Pan Fried Noodles w/ Sea Food was tasty. It was over $50 just for food..."
        }, 
        {
            "index": 258, 
            "rating": 1, 
            "review": "We got orange chicken and pas Thai noodles.\nService was good but food was terrible.\n\nWorst orange chicken of my life :("
        }, 
        {
            "index": 259, 
            "rating": 1, 
            "review": "It's been more than a week since I was here, but having just found the receipt from this restaurant in my wallet I felt it appropriate to warn all tourists to not eat here.\n\nThe Mrs. and I ordered soup and noodle entrees (Won Ton and BBQ Pork) which were tasty, but definitely not worth the $17.95 and $12.25 we paid. A few Thai Iced Teas later we were looking at close to $50 for two people eating soup for lunch. I understand the rules of traveling, especially when you go to Las Vegas. You'll normally spend $10 for every mixed drink and $8 for every beer. That's just how it works and it's fine if you get good food and great service, but that's not what we got.\n\nI'm not sure if it was how we looked or dressed but our server \"Wendy\" was rushing us the entire time. She kept checking to see if we were done with our soup and kept peaking from behind the exit to see how much longer we'd be eating. Another server came by and tried to take our bowls when we weren't even done. They didn't even leave us an option for desert as Wendy rushed the bill to our table. For mediocre-good food, this place had poor service. I couldn't understand why they wanted us out so quickly, it's not like this place was busy at 2:51pm on a weekday afternoon. \n\nIn Summary: The food was good, the tea was fine, the prices were inflated and the service was awful. Instead, go to the Chin-Chin restaurant at New York New York Hotel & Casino for amazing Asian food and top notch service with reasonable prices."
        }, 
        {
            "index": 260, 
            "rating": 1, 
            "review": "We ordered the fried rice which was very bland had no flavor and we couldn't  find any chicken in our lettuce  wraps. Service was  a little slow but ok."
        }, 
        {
            "index": 261, 
            "rating": 1, 
            "review": "Came in to get soup to go. Got ignored for 6 minutes, ended up leaving. Probably just as well since the ratings aren't all that great to begin with."
        }, 
        {
            "index": 262, 
            "rating": 2, 
            "review": "This place was extremely quiet when we arrived. It was around 3pmish....so, in between the lunch and dinner rush. Even with only a few people here, our server took forever to take our order. Which was odd. She would just be walking around. Finally, a different lady came over and asked if we wanted to order....uh, yeah! Dont get me wrong, the servers were friendly. Just slow. \n\nAnyhow, I ordered the sweet and sour chicken and hubby ordered fried rice with shrimp, chicken, and beef. Not much to say. The flavor was bland. Nothing to get excited about. For the Mandalay Bay, kind of surprising this restaurant would just be so so. \n\nLong story short, will go somewhere else next time."
        }, 
        {
            "index": 263, 
            "rating": 3, 
            "review": "My mom, aunt and i were in a hurry to find something to eat so we can go catch our Lion King show in 30 mins! We went in and were greeted by a really nice lady who gave us our menu, our waitress came and asked us if we wanted something to drink and my aunt was like \"I'm sorry but we're in a hurry and we're hungry so we were wondering if  we can order the shrimp fried rice and the tom yum soup, and if you can make it really quick?\" and she was like \"Of course! so she put in the order came back and was like \"would you like to pay now since i can take it and get everything done for you so you can eat and go?\" \n\nand my aunt was like \"that would be awesome!\" and guess what...the food came in i swear 5 mins super fast! The fried rice was okay...there are better places and the soup was eh...could have been better. We ate like we were in the military or something...thats what my mom said lol\n\nwould we go here again? Maybe when we're in a hurry like that hahahah"
        }, 
        {
            "index": 264, 
            "rating": 3, 
            "review": "A little pricey, but worth it.  This is my second favorite place to eat at Mandalay.  It definitely hits the spot when craving a good noodle bowl with quality ingredients.  The proteins are not grisly like a lot of noodle restaurants.  The service always seems to be a little slow, but you really can't go wrong here.  Try it!"
        }, 
        {
            "index": 265, 
            "rating": 1, 
            "review": "If you are like me, you are reading this review as you sit at this restaurant wondering why everything is so awful. You may be wondering why an experienced yelper like myself would be checking reviews AFTER they are already eating somewhere. First, every other restaurant had a long wait. I was REALLY hungry, hubby wasn't feeling well and just wanted to get me fed so we could head up to the room. The empty restaurant should have been a sign, but I went for it because how much can you screw up noodles? Reception is always tough in casinos, so I didn't even try to check reviews. \n\nI ordered Pad Thai, my husband ordered wonton soup. I'm not sure I even can even use words to describe how seriously awful the Pad Thai was. If I was blind folded I don't know that I would even know it was Pad Thai. My guess would be that it was leftover noodles from a chafing dish at a 10 year reunion the night before. The flavor was awful, the texture bizarre, as hungry as I was I could not even make myself choke this down. My husband's soup was almost edible if you avoided the wonton. So basically the broth was bland enough to force it down your throat in a pinch.\n\nI so very rarely send food back, but this was inedible and expensive to boot! I kept trying to flag a server down, finally after 10+ minutes I went up to the hostess and said I needed either a manager or my server. When the server came over I started to explain why I didn't like it. He didn't seem surprised at all, just took it away and asked if I wanted something else. I decided not to subject myself to anything else from this place. We paid for the soup and then headed over to a small souvenir shop in the hotel. We grabbed a bag of pretzels and called it a night. Those Rold Gold pretzels were AMAZING after the slop we'd had here.\n\nI don't think there is anything you could do to get me to eat here again. Even if it was free! Even if I was hungry and given the option of this or nothing, I think I would choose nothing every time. AVOID AT ALL COSTS!!!!! Mandalay Bay should close this place down and open a good noodle place. Noodles are awesome when you have had a little too much Vegas fun, and even if the noodles were just average I think it would do very well! If you saw a picture of how tired this place looks, you would not even think this would be open inside Mandalay Bay. This place needs to go!"
        }, 
        {
            "index": 266, 
            "rating": 3, 
            "review": "We were looking to carb-load the night before the marathon, so we took a vote, and noodles it was. It's this weird veneer of vegas flash over Chinese dive, you know, one of those places where there's a secret menu and the server wants to know if you can REALLY handle spicy. \nOne of the gals tried to order the beef flank steak with noodle soup (essentially mi with tendon), and was immediately and strongly discouraged by the waiter.\n\nThe soups were the strong point -- broths were good, the wonton soup with a boatload of wontons and noodles is a Vegas steal at $10 for a huge bowl. The more generic dishes, like beef with broccoli, etc, were just gummy and salty and AWFUL."
        }, 
        {
            "index": 267, 
            "rating": 2, 
            "review": "Despite peeking at the reviews beforehand, my family and I went to the Noodle Shop since we wanted something light (after having buffet and steak the 24 hrs prior). We were promptly brought to a table. A lady took our drink order, but seemed to be a bit impatient when my dad didn't decide what drink he wanted right away. All of us ended up ordering different things and only my sister was pleased with her dish (seared sea bass), though she was the one who refused to go after I told her about the subpar reviews. My dish had crispy noodles and seafood. It was bland and the texture was sort of uneven (?). My mom's Vietnamese noodle soup was bland and my dad's Pad Thai had no sauce. The Thai tea was good and the service was kind."
        }, 
        {
            "index": 268, 
            "rating": 1, 
            "review": "Eating at this restaurant compelled me to sign up for yelp. It is outrageously overpriced (even for Vegas) and the quality is lacking. We had a party of 8 and there wasn't anything being enjoyed. The Dim Sum platter for seemed to be microwaved as the dumplings were unevenly heated and lacked flavor. One guests Pho was thin and the meat was super fatty and tough. The shrimp in all the dishes was fishy and mushy. Service was poor for how empty the place was. My beer glass was also washed poorly and looked like the previous beers foam dried on the glass. \n\nP.S. \n\nI would like to know if anybody has ordered the $175 Birds nest soup."
        }, 
        {
            "index": 269, 
            "rating": 2, 
            "review": "Pretty basic Chinese food. Ok if you're in a hurry and want a quick meal. Do NOT order the hot tea unless you're willing to pay $4/person!! You won't find out until you get the bill..."
        }, 
        {
            "index": 270, 
            "rating": 2, 
            "review": "Oh dear Oh dear. How can you go wrong with chinese broccoli and oyster sauce? Well let me tell you can. And the spring rolls were like little cigars dripping in grease and you could not taste the veggies inside. I won't be back."
        }, 
        {
            "index": 271, 
            "rating": 2, 
            "review": "Had the shrimp wonton noodle soup. Overall it was average and overpriced. You are in Vegas and in a casino so the price was expected. If you're use to Chinatown authentic soup, this would not be the place."
        }, 
        {
            "index": 272, 
            "rating": 4, 
            "review": "I've been here a hundred million times. Literally.\n\nThey have really good food. I used to come here with the casino hosts from the Mandalay Bay, so we never 'did' lines. But, there are lines, there are tons of people who want to be here all the time, and the place is small. \n\nXO string beans. They have an asparagus thing that is pretty good. Their Pho is so-so. Eggplant is pretty good. Its all good. Its all very very expensive."
        }, 
        {
            "index": 273, 
            "rating": 1, 
            "review": "Oh dear this place is just bad.  The meat is bad, the noodles are bad, and the soup is completely terrible.  And it's super pricey.  Stay away!"
        }, 
        {
            "index": 274, 
            "rating": 1, 
            "review": "Overpriced and tasteless. Do not waste your money. The main dishes here had no taste. I think the chef was asleep. My family was totally disappointed. By far, the worst meal we had in Vegas. I would have enjoyed Burger King."
        }, 
        {
            "index": 275, 
            "rating": 1, 
            "review": "Very much over-priced place. They charge something like $15 for 4 shrimp dumplings. Shocked."
        }, 
        {
            "index": 276, 
            "rating": 3, 
            "review": "Not bad if you do your homework and read the Yelp reviews. From what I have read\n1. Don't order the Pho. \n2. Noodle dishes tend to be salty.\n3. The pictures do not have much vegetables in the noodle dishes.\n\nThe beef chow fun and the chow meiin have gotten the best reviews on Yelp so far. So I ordered the beef chow fun. Asked for low salt. And also paid an extra $3 for additional vegetables. In the end, I ended up with a decent meal. I may try this with the chow mien next time."
        }, 
        {
            "index": 277, 
            "rating": 1, 
            "review": "Sorry to say, worst dinner I've had in a long long time. Service sucks, don't waste your precious time and money"
        }, 
        {
            "index": 278, 
            "rating": 4, 
            "review": "Just ate at the Noodle Shop a few hours ago and everything was great! Being Chinese myself, I know what authentic Chinese food is, and this isn't it.  It's comparable to a PF Changs, maybe.  \n\nI would probably never pay full price to eat here, I had a restaurant.com coupon that I used to get $25 off.  We had the sweet and sour chicken and the mongolian beef.  Both plates were solid and tasty.  Portions are just right and respective sauces were good.  \n\nAt the end of the meal, what was supposed to be a $40 meal after taxes and tip, came out to $15.  I felt a little bad since service was great, so I just tipped a bit more.  \n\nI will probably be back next time I'm in Vegas, but i will be coming armed with a coupon."
        }, 
        {
            "index": 279, 
            "rating": 5, 
            "review": "Spectacular in all aspects. Great Hot and Sour soup. Great Vegetable Egg Rolls (and mustard sauce and sweet and sour sauce)!  The Scallops and Snow Peas were to die for. I always find scallops to be unpredictable. (At worst, rubbery.). These scallops were tender and delicious. The service was fast and friendly. Table service was white cloth napkin and I thought it was above the \"casual dining\" it had been described as. We'll be happy to return."
        }, 
        {
            "index": 280, 
            "rating": 2, 
            "review": "I grew up eating congee in the most dirtiest of places in Chinatown in Manila.  Those have always been good.  \n\nI'm a bit skeptical about the congee here at The Noodle Shop, (just because my surroundings are actually clean looking) but I've got such a serious craving for congee when I woke up and I wasn't having anything else.\n\nSince we were staying at Mandalay Bay, it was convenient to eat lunch here.  I ordered the thousand egg and shredded pork congee ($10.50)  I had to season my soup with soy sauce but the pork itself is already salty. I like the big chunks of egg in there.  Bf had the wonton noodle soup, it was tasteless and for $14 wasn't really worth the money.\n\nOur server was looking distressed from the many tables she was attending.  I thought she forgot about us, but she did manage to throw out a \"how's everything??\" , just as I was about to look up and respond, she was gone. \n\nDisinterested server and mediocre food.  A skip."
        }, 
        {
            "index": 281, 
            "rating": 1, 
            "review": "If I could I would give this place 0 stars. Not good. Ordered chicken fried rice and the shumai. The fried rice was ok. Was a little sweet so wasn't my favorite. The shumai took a while to come out and when it did they did not smell good at all. Honestly they kind of smelled like canned pet food. I chose not to even try them, but my boyfriend took a bite and said they tasted worse than they smelled."
        }, 
        {
            "index": 282, 
            "rating": 1, 
            "review": "I do hope people read this before they eat here. I agree with the previous review. The service is slow and disorganized. The food is waaaaaay overpriced for the portion and quality. We ordered Singaporean noodles and what we had seem like it came from Iraq or anywhere else except Singapore. The food here is just horrible. You're the better off getting a meal at the deli next to the sports book area. One more thing, our bill came out immediately after our dishes, literally. Just the type of service you expect from a place in a 5-star resort charging $18 entrees right?"
        }, 
        {
            "index": 283, 
            "rating": 4, 
            "review": "This is a good spot for a casual/quick lunch. Food was great. Flavor was great. Ambiance and decor was really good. Price was more than what you would expect for a casual spot but not outrageous (~$20 per person). Service is good too. Again, good spot for quick lunch away from the hustle and bustle"
        }, 
        {
            "index": 284, 
            "rating": 4, 
            "review": "A little surprised by the negatives on Yelp.  It's a solid 4 star.  Great for a lunch or brunch."
        }, 
        {
            "index": 285, 
            "rating": 2, 
            "review": "Great location in the Mandalay Bay...great ambience...however, the food is overpriced....and not that great. My friends and I shared Mongolian Beef and Fried Rice...we waited a good 20 minutes before our food arrived and I wasnt very impressed with the food. Had better Chinese food in a mall....."
        }, 
        {
            "index": 286, 
            "rating": 2, 
            "review": "If eating food counted towards your gambling debt than this place should be considered part of your losses. In fact this place is a total loss, a \"bad beat\". \n\nI had a beef stew over rice, which came out quickly but it wasn't anything special. Brother had a pad thai dish which he said that he's had better.\n\nThe place is over priced for average food, but I can't complain about the price, it's Vegas."
        }, 
        {
            "index": 287, 
            "rating": 1, 
            "review": "This is the worst restaurant I have ever experienced in Vegas. I was looking for a moderately priced Asian restaurant on the south strip, and looking at the menu online beforehand, saw a lot of things that sounded good.  I should have known otherwise when we walked in and only 2 tables were occupied. Dining companion and I both ordered chicken dishes for the main course. She thought the chicken tasted rubbery, as did I. I usually associate this with undercooked meat. We both got very sick to the stomach about 2 hours later and these dishes were the likely culprit. We spent the remainder of our evening on the toilet back at the hotel room.\n\nThe only positives were that the server was attentive (because there were only like 7 customers at 6pm) and the Chicken Satay appetizer (which appeared to be cooked properly) was actually pretty good.\n\nDon't go here. Even if you are trying to burn casino comps or something. Read the other reviews, we aren't making this stuff up."
        }, 
        {
            "index": 288, 
            "rating": 3, 
            "review": "It turns out Mandalay Bay has pretty much eliminated their room service. So wanting something quick after a long day of working, I ventured in. Of course I read the Yelp reviews after I had been seated and was really nervous that I had made a poor choice.\n\nI decided to go with simple menu items (how can they screw those ones up?) and avoided all the ones that were specifically reviewed as bad.\n\nI went with the chicken satay to start and the Thai curry chicken as an entree. The chicken satay came out and was ok. The peanut sauce it was served with tasted more of taco seasoning (your guess is as good as mine on why) and was not a nice creamy peanut sauce. It wasn't bad, just not what I was expecting.\n\nThe Thai curry chicken was a generous portion. The chicken was a strange texture (boiled, maybe?) but tasted ok. The red and green peppers with it were fresh and pretty crispy still. The sauce had some yellow curry in it but not quite enough. The flavor was weak but the spice level was strong. The dish was ok. Not great and not terrible.\n\nAll in all, I probably wouldn't eat here again but it's not quite as bad as some of the other Yelp reviews -- at least not with my experience tonight."
        }, 
        {
            "index": 289, 
            "rating": 3, 
            "review": "Got the duck noodle soup and the wonton noodle soup.  Duck noodle soup is really greasy from the duck.  Shrimp wonton is not bad when my tummy is not feeling well.  Soup base is just right.  The down size is completely over priced.  Each bowl cost $17-$19.  It's nice to seat and eat a hot soup in an AC room."
        }, 
        {
            "index": 290, 
            "rating": 3, 
            "review": "I wrote a favorable review for Raffles, and The Noodle Shop is next door...or rather in Raffles or an appendage thereof.  You would think they shared the same kitchen\n\nThis is a different review...I did not enjoy my won ton soup with noodles..It was bland and tasteless.  Perhaps, I cant remember enjoying a soup less..and I am happy with Campbells\n\nYet at the same time, everyone seemed to enjoy their selections:  Fried rice, Orange beef, Marinated chicken, Pad thai, Veggie spring rolls\n\nSo what am I saying?  Go to The Noodle Shop except for Noodles?"
        }, 
        {
            "index": 291, 
            "rating": 1, 
            "review": "1/5 stars\nLocated INSIDE Mandalay Bay. \nService was good, but food was not. \n\nBooo..we were hungry, desperate, and thought this place would be a good idea. It definitely was NOT a good idea. Why?\n1) Super salty\n2) Expensive\n3) Peking duck was HORRIBLE\n\nOrdered:\n1) Peking duck: 1/5 HIGHLY DO NOT recommend this dish. This was the worst dish on the table. It tasted like peking duck you would pick up at a fast food joint. \n2) Spicy garlic beef: 1/5 way, way salty\n3) Beef Chow fun: 3/5 this was the only dish on the table that was edible."
        }, 
        {
            "index": 292, 
            "rating": 2, 
            "review": "Expensive and bland!\nMy grandma always has to get her soup on when she gambles, so we came here and good lorddddddddd... I am better off eating Cup O Noodles in my room, which are so much more flavorful!  The staff could use some flavor too!  Everyone had this look on their face!  Maybe their coworker just passed away, and if that is the case, then I take back what I said, but if not, then based on their facial expressions, this is what they say about Noodle: \"Don't come eat this pathetic excuse of an Asian restaurant.\"\nI know it is Vegas, so it will be generic tasting.  I'll give them a star for trying and another for their wide range of Asian dishes."
        }, 
        {
            "index": 293, 
            "rating": 3, 
            "review": "We came here one afternoon, after a morning of heavy drinking by the pool. We ordered a fried rice dish and something with duck. The service was very quick, the atmosphere was very nice and the food was delicious. It helped sober me up enough for the evening and was definitely the best food quality and portion size to price ratio we found in Vegas. \n\nThe place was almost completely empty while we were there, maybe that's why things were better than other reviewers are reporting, but for whatever reason, I had a very nice experience there and would go back if I were staying at Mandalay Bay again."
        }, 
        {
            "index": 294, 
            "rating": 2, 
            "review": "Broth bland. Everything we ordered is salty (jook, gong chow lau ho, won ton noodle). Overpriced. Poor quality food. Service was nice. Atmosphere is nice."
        }, 
        {
            "index": 295, 
            "rating": 1, 
            "review": "SO awful! This is one of those moments where I'm extremely disappointed in myself for not yelping some places before I go to them. I assumed that this restaurant being in a well known well liked hotel that it was equally well liked. WRONG! \n\nIt took a solid 15-20 mins for our server to greet us for the first time. If it wasn't for being hungover in Vegas and not wanting to move we would've left and had lunch somewhere else. My friend and I ordered Pad Thai, Chow Mein and Veggie Egg Rolls. I honestly could have had better if I just order Chinese take-out. The food was like cardboard, flavorless and unappetizing. \n\nBut enough about the food, it was the service that threw us over the edge. Not only did it take 15-20 mins for the server to greet us but after he brought us our food we never saw him again! We literally had to get up from our table at one point and search to pay our bill! I can't even remember if that's ever happened to me before. Overall it was one of the worst dining experiences I've had....ever."
        }, 
        {
            "index": 296, 
            "rating": 3, 
            "review": "Service was great. Food was pretty good. I wasn't blown away. Not bad for a casual meal but definitely not for a date."
        }, 
        {
            "index": 297, 
            "rating": 1, 
            "review": "Close this Place. \nShould have know it. Empty Restaurant on Thursday Night. \nService was very very nice but the Food. Awfull. \nPf. Chang & Panda Express have better Food than this Restaurant. \n\nThe Dessert Menu was a joke 3 Things to choose. \n\nSkip this Place."
        }, 
        {
            "index": 298, 
            "rating": 4, 
            "review": "Nice lunch menu for $19.  The Kung Pao Chicken was excellent (and I eat at a lot of non-Americanized Chinese restaurants."
        }, 
        {
            "index": 299, 
            "rating": 1, 
            "review": "if you've ready any of these reviews, you already know this place is pricey so i won't harp on it (almost $16 for pho, are you kidding me?!). okay maybe a little.\n\nbut if they're going to rape and pillage our wallets, i suggest they at least try to make the food tasty. more to the point, have some taste/flavor. also, for a place called \"the noodle shop\" there was a disappointing choice of noodles. really? yes, really.\n\nFOOD-\nafter getting my bowl of beef noodle soup, the soup looked pretty bland and there was a lot of oil floating on top. i gave it the benefit of the doubt as looks can be deceiving but after taking a sip of the soup, i knew that looks were right on. there was NO flavor to the broth. it was more like oily water with a tinge of beef. the beef pieces were also fatty and stringy with maybe two pieces of that were of any substance. \n\nmy friends ordered two staple dishes: the pad thai (how can you go wrong with that?) and beef fried rice (how can you go wrong with this?). the pad thai did not taste like pad thai. i understand if you want it to be all fusion-y but should it not at least retain some of the flavor of what it claims to be? it was orange-colored like pad thai. didn't taste at all like pad thai. the fried rice was bland and needed chili paste to bring out some semblance of flavor. speaking of chili paste...\n\nSERVICE -\nwe went at 9pm and there were maybe 4 other parties in the whole place. after we received our order, we didn't see the waiter again for half the meal as i ate slowly because i wanted to ask the waiter for some chili. eventually, i had to walk up to the hostess and ask her for it because we had no idea where our waiter was. a few minutes later, our waiter came briskly by our table without a word (no \"sorry for the wait\" or \"is there anything else you need?\"), plopped the chili down and kept walking. at least he didn't throw it.\n\nsure, it's convenient, but it isn't worth that convenience. walk outside the strip and get some panda express if you're jonesing for asian food. it certainly beats this place in terms of taste and is cheaper.\n\np.s. - $2.50 per person for tea?! the casino's robbing you enough already. don't waste it on this joint."
        }, 
        {
            "index": 300, 
            "rating": 4, 
            "review": "My Boyfriend recommended that we eat at the Noodle Shop since we were already at Mandalay Bay Casino. We ordered a Seafood Wonton soup and a BBQ over rice dish. Wow! The BBQ Pork was so tasteful and perfectly cooked! Its probably the best BBQ Pork I've tasted.  The Customer Service was pretty good! Prices are a bit higher here for Chinese food. One thing I would complain about is the price for tea here. They charge $4.00 a person for hot tea? So we pretty much paid $8.00 for a pot of tea? Thats right! I guess thats the price you have to pay to eat at a Restaurant inside a casino."
        }, 
        {
            "index": 301, 
            "rating": 1, 
            "review": "I went here in July 2012 and the service was horrible! The hosts and servers barely spoke English. We asked how big the portions were and our waitress couldn't even tell us, she didn't know. She just said, \"order your food, if not enough, order more\". Once we got our appetizers, they were extremely small. There was not enough for even two of our five party members to eat. We ordered pad thai, which was actually good but they brought us toppings to put on it and there were jalapeno and habanero. We were not told that there would be such spicy peppers. One of our party members is allergic and did not realize they were the spicy kind. She started choking and had to spit it out. We talked to the manager in the end and she made light of the whole situation. All in all, my biggest concern was the major language barrier and the lack of knowledge of the employees."
        }, 
        {
            "index": 302, 
            "rating": 1, 
            "review": "Noodle BARF!  I was super hungry and drunk.  Even so I could tell this was the worst place I've ever eaten. How hard it is screw up ramen. It's all in the broth. Staff was even apologetic.  Do your research.  Not hard to fix!"
        }, 
        {
            "index": 303, 
            "rating": 1, 
            "review": "read karen's review. \n\nI'm the guy who wanted to throw up."
        }, 
        {
            "index": 304, 
            "rating": 4, 
            "review": "I did not expect this to be so good! I read these reviews and went anyway since I had a restaurant.com coupon. We ordered the seabass and pad thai and I loved them both. I wasn't' exactly stuffed as the portions aren't huge but it was as yummy as could be. Surprise for me! I have to assume with so many poor reviews on this place that it depends what you order. No idea how this food was rated poorly. It was delish!!"
        }, 
        {
            "index": 305, 
            "rating": 3, 
            "review": "Had lunch here last month and honestly, you have to judge it for what it is folks! You're in a casino in Las Vegas. Obviously, it's not going to be the most authentic spot on earth, and obviously, prices are going to be 3 times what they'd be anywhere else. Does it do the trick? Totally! And is it still a lot more affordable than other Vegas options? Totally! I had the pho with white chicken meat and was more than happy with my option. My friend had a chicken dish and liked it as well. Looking for something a little less pricey in Mandalay, especially good comfort food, this will do the job."
        }, 
        {
            "index": 306, 
            "rating": 4, 
            "review": "My favoring chow mein is Chef Chu's near Mountain View, CA. My next favorite? Noodle Shop in Mandalay Bay!!. Good service, noodles were perfectly cooked and pan fried with just the right amount of spices, vegetables and plenty of white meat chicken. Yummy!!"
        }, 
        {
            "index": 307, 
            "rating": 2, 
            "review": "Food & service are underwhelmingly blah. Seems like they should be in a run down strip mall instead of an elegant resort."
        }, 
        {
            "index": 308, 
            "rating": 1, 
            "review": "The food is way overpriced for the quality. We had spring rolls-more greasy than most and soggy in the middle. My pad thai tasted nothing like pad thai-just grease and a cheap sauce, no flavor. My husband had the house fried rice and it was steamed rice with a few veggies and cold shrimp. He had a coffee and I had green tea. Our bill was $60. Nothing was good. We will never eat there again."
        }, 
        {
            "index": 309, 
            "rating": 1, 
            "review": "The worst pad thai we have ever had and the waitress just threw food at us and ran off.   They were understaffed and the quality is horrible."
        }, 
        {
            "index": 310, 
            "rating": 3, 
            "review": "Would we ever eat here if it wasn't for the comp that comes with our stays?  Probably not.  Food tastes okay, but nothing tastes great for the prices they charge.  And this surely isn't Chinatown in LA.\n\nGarlic shrimp, chicken & beef was a little sweeter than I would've liked.  But nice serving portion for two.  The shrimp wonton noodle soup was more bland than I'd like, but plenty of noodles and something like 6-8 (big) wontons, so hey, that's a definitely plus.  The calamari we probably wouldn't get again.  Cooked for too long as they were very chewy/rubbery, and the garlic salt & pepper didn't really cling on like the way it does when you order it from a 'legit' restaurant.\n\nService is okay.  Our drinks were refilled and nothing landed on the table cold, but then again we were wrapping up just as they started seating the ocean of people who were coming out of UFC 143, so I can't speak for how they are when they're busy. \n\nThat food with two sodas cost us just a little over $55, including tax & tip, so not bad for 'hotel' food for two, but again, without the comp, we wouldn't be eating here.  I wouldn't recommend this place either.  I'll definitely take the Dragon Noodle Co (?) at Monte Carlo over this place (that one has combo dinners/specials for 2+ people with bigger portions, more choices & better food)."
        }, 
        {
            "index": 311, 
            "rating": 3, 
            "review": "Not bad, not great.  We had two dishes... Pad Thai, which was not that good.  Also Orange Beef, which was good but salty.  Next time I will try the Chinese place at the Wynn."
        }, 
        {
            "index": 312, 
            "rating": 2, 
            "review": "For $20 I expected some really good Pho.  There was a lot of chicken but it tasted like it came from a can.  edible but not satisfying"
        }, 
        {
            "index": 313, 
            "rating": 2, 
            "review": "I wanted pho and I didn't want to venture far from the hotel so when I saw this restaurant I thought I'd give it a try.\n\nI was disappointed.\n\nService could have been friendlier.\n$17 for pho was a slight shock considering I can get it for under $10 in So Cal, probably at a larger size.\nThe broth was flavorless, even with the added sauces. It just turned into a flavorless spicy broth.  The beef was a little chewy and they don't use Thai basil. \n\nI will say that the restaurant was clean and quiet and service was quick."
        }, 
        {
            "index": 314, 
            "rating": 3, 
            "review": "Not as bad as 2 stars, but not great either.  I'd say it is passable.  Everything is just ok, not great, but not bad either."
        }, 
        {
            "index": 315, 
            "rating": 4, 
            "review": "Delicious vegetarian spring rolls & grandfather chicken, mediocre service, nice atmosphere."
        }, 
        {
            "index": 316, 
            "rating": 1, 
            "review": "Dreadful service. Boring food. Stupid prices.\n\nOn a relatively slow night, I was seated immediately, but it was fifteen minutes before a waiter came to my table and asked \"What do you want?\"\n\n\"Well, a menu would probably be a good start.\" I replied.\n\nHe disappeared for another five minutes before dropping off a menu without a word.\n\nTen minutes later, same thing; \"What do you want?\"\n\nI asked some questions about the food that were answered with only the barest minimum of information.\n\nService with a snarl seemed the order of the night.\n\nI finally settled on the curried noodles and a cold sake. I should note here, that while I believe that there are several sake options, none other than cold/hot were offered to me, and there was no drink menu.\n\nThe dish was like a package of store-bought ramen noodles with just a hint  of curry flavor, but TONS of salt. It also had a few shrimp and some duck bits in it, which was fine for me - but was not mentioned on the menu. Vegetarians beware. \n\nSadly, with such a salty dish, I never got a refill on my water, nor on my sake - as a matter of fact, the waiter never visited my table again until he brought the check. He never asked if I wanted anything else - desert, maybe - and I had to beg for another glass of water.\n\nHe then hovered over me while I figured out the bill (almost $40 for ramen and a glass of cheap sake).\n\nHorrible, horrible, horrible.\n...AND, I might add, Horrible.\n\nDon't do it."
        }, 
        {
            "index": 317, 
            "rating": 1, 
            "review": "By far the worse noodle pla I've ever been too...I would of rather paid $20 for a Cup O Noodles....Save Yourself, and Walk Away"
        }, 
        {
            "index": 318, 
            "rating": 2, 
            "review": "Mediocre Chinese food with small portions for the price. I'm not a good cook but when I was eating I felt even their special Curry Tofu was something I could make at home and taste the same with sauce from a jar. I was starving and alone so I ducked in a booth and ate everything pretty much anyway. Service was very polite, refilled my water before I realized it was low. Certainly not somewhere I'd recommend but it was okay for what I needed at the moment.\n(I was debating between here and some of the cheaper, less well reviewed buffets in the area and the price difference with tip probably would only have been $10. If I had a little more time and energy I might have done that.)"
        }, 
        {
            "index": 319, 
            "rating": 1, 
            "review": "The worst Chinese food ever.\nWasted $25 for a single serving noodle.\nWill never return."
        }, 
        {
            "index": 320, 
            "rating": 3, 
            "review": "I liked this place! What better way to nurse your hangover than a big bowl of pho or veggie chow mein? Service was quick  and friendly too.\n\nPrices were a little steep, but this is on par for all other pricing at any of the restaurants in/near the Mandalay Bay.\n\nI recommend it if you don't mind spending $20 on noodles."
        }, 
        {
            "index": 321, 
            "rating": 3, 
            "review": "I should start out by saying that I live in NYC so I have several Chinatowns near me and have high expectations of chinese food.  That being said, the food was good but not great.  The main issue is the food was never hot.  I did go twice but only because I really wanted to try the Seafood Pan fried Noodles. I wasnt thrilled with it.  \n\nThe first day, I had the lunch special of chicken, shrimp and beef with garlic sauce and 2 mini spring rolls (the app should have been served earlier than the main and it was not, so tell them if you want it that way).  That dish was excellent and had it been hot, it would have been stellar.  It came with white rice.  The lunch special is 18.99 and they have about 8 choices of specials; my dish was enough for 2.  Service was slow the first day and quick the second day. My water was refilled constantly and the waiters were very nice as was the Maitre D.  It is a casual restaurant located right off the casino so there is some people watching to be done if you get a table closer to the front.  \n\nI would recommend the restaurant for the chicken, beef, and shrimp dish but not for the pan fried noodles. I also would be specific and ask for very hot food and apps served first. None of these requests should be needed but if done, this review would have been markedly higher."
        }, 
        {
            "index": 322, 
            "rating": 3, 
            "review": "Wish I had read the reviews first.  Really too expensive for what you get.  My daughter thought her tofu dish was kind of bland.  I got the shrimp wonton soup and it was decent.  My GF had a beef/rice noodle dish and thought it was just ok.\n\nOur waiter was super friendly and did a good job."
        }, 
        {
            "index": 323, 
            "rating": 2, 
            "review": "The 2nd star is for being open so late. The food is overpriced and not good at all. Meats were fatty and too well done. The shu Mai was not edible.   To further annoy me, not only were all the BBQ meats fatty and too tough to eat, when I was starving, but I was asked when I ordered if I would like rice with it?  I assumed in typical Chinese restaurant style this meant it came with it so I said yes and was then charged $4.25 for it. \nAre you kidding me?\nThe shrimp dumplings were the only thing that was good. \nI would never ever again come here for this overpriced terrible food."
        }, 
        {
            "index": 324, 
            "rating": 4, 
            "review": "Only stop by for a quick lunch. Order Yang Chow Fried Rice and Wonton Noodle. 100 points. Almost same as Hong Kong....."
        }, 
        {
            "index": 325, 
            "rating": 1, 
            "review": "I'm pretty generous with my reviews...and I gave this place a shot despite the terrible reviews because I was starving and it is so conveniently located to Mandalay Bay hotel rooms. \n\nI ordered the XO shrimp udon to go and it was TERRIBLE. And after tax $31.  So disappointed =T"
        }, 
        {
            "index": 326, 
            "rating": 2, 
            "review": "Stopped by here to grab something quick after the NKOTB concert and before drinking at LAX, shared an order of beef chow fun.  It was super greasy, we were hungry so we are it all.  After finishing it you can see all the grease that was left on the plate....ick...oh well, don't have plans to eat there again. Just gave it a shot since it was convenient to where we were coming from/ where we were headed."
        }, 
        {
            "index": 327, 
            "rating": 1, 
            "review": "Service wasn't great, and the food was also disappointing.  I wanted some Chinese BBQ pork and the texture was a big grindy and there were still some \"wildness\" in the taste.  The rice was dry and overcooked."
        }, 
        {
            "index": 328, 
            "rating": 1, 
            "review": "I have been here two time and the foods was way over priced for what you got and tasted awful. I don't want to go into much detail because someone flagged my last review of this place, so this is my nice attempt to warn others not to eat here."
        }, 
        {
            "index": 329, 
            "rating": 1, 
            "review": "Terrible. The food was bland and low quality. If you're at Mandalay bay and hungry, keep walking. Plenty of good options close by."
        }, 
        {
            "index": 330, 
            "rating": 3, 
            "review": "The food was good, but the prices were a little steep.  I would skip this place and head to any other restaurant at Mandalay Bay."
        }, 
        {
            "index": 331, 
            "rating": 2, 
            "review": "This place was alright. There's not very much special about this place. It was the last minute lets go before it was close at 1130pm meal when the good restaurant was closed on the strip and every one from my party wanted noodles soup. Thai tea was watered down. The only thing good was the pho. Every thing else was bland. \n\nWhat was on the menu: \nVietnamese beef pho\nCurry fried noodles \nDuck noodles soup"
        }, 
        {
            "index": 332, 
            "rating": 1, 
            "review": "Don't bother. I was served lukewarm cashew chicken that was under cooked. They took it off my bill but seemed to not understand why I didn't want it."
        }, 
        {
            "index": 333, 
            "rating": 1, 
            "review": "Just had the worst crispy duck ever.  It is fat and not done.  Hard to eat.  The one star is for the waitress and the congee."
        }, 
        {
            "index": 334, 
            "rating": 3, 
            "review": "The Noodle Shop was good.\n\nI know most Asian places in Las Vegas, on the strip in the hotels (not including Panda Express types) tend to be expensive, in the realm of 2x - 3x the price you'd find at Chinatown, with maybe some Asian naysayers touting the possible whitewashing and lack of authenticity of some Chinese restaurants.\n\nLet me tell you 'tho... I've tried most of the overpriced Chinese restaurants in the high end hotels, and I've never had a bad meal.  Sure, there is a bit of sticker shock when you see the menu and get the bill, but the food is indeed delicious and good most of the time.\n\nSo, with that I do give 'em the * * * A-OK rating, which I would say I'd come back again and also would refer others to try."
        }, 
        {
            "index": 335, 
            "rating": 3, 
            "review": "The food was good, but nothing special. The service was adequate. I had a noodle dish with beef and duck, and the noodles had an unappetizing slimy feel to them. The duck was good, but the portion was very small. They charge $2.50 per person for hot tea, which I thought was a little much, and everything on the menu is $13 or more. For the quality and portion sizes, I'd expect them to charge half the price. On the plus side, the place was cute and well lit and it was easy to forget you were in a casino."
        }, 
        {
            "index": 336, 
            "rating": 3, 
            "review": "My wife and I enjoyed a nice meal here before going to see Michael Jackson's ONE.  I ordered the seafood won ton soup and was pleasantly surprised with the amount of seafood.  The soup had shrimp won tons, sea bass, shrimp and scallops.  Soup broth was a bit bland, but I just added chili sauce to kick it up a bit.  My wife had the BBQ Pork Noodle Soup, which contained a lot of BBQ Pork.  She enjoyed her meal and the service was good as well."
        }, 
        {
            "index": 337, 
            "rating": 4, 
            "review": "We were pleasantly surprised at the quality of food at Noodle Shop - it was quite good!\n\nWe were staying at the Mandalay Bay and we've walked right by it for years, but never bothered to try it.   Well now we have and I can say that I would definitely go back if given the chance.\n\nThe Orange peel chicken was soooo good - I am still thinking about it.  The flavor was delicious - and though it was fried, it was not battered so it was not greasy at all.  But the flavor - truly delicious.  \n\nHubby had the noodles with shrimp and xo sauce - which was very expensive for what it was - but still quite tasty.  \n\nService was eager and attentive.  Price overall was expensive for Chinese food.  But if  you're staying at Mandalay Bay - this is a solid choice for a bite."
        }, 
        {
            "index": 338, 
            "rating": 4, 
            "review": "I'm not sure why this place got so many bad reviews. I went in knowing it might be a complete clusterfugg but was pleasantly surprised. Quick service although I really think the waiter we had was acting out the Chinese role. He had on fake black glasses which i could tell has no prescription on them and he sounded and acted like Mr. Chow from the hangover. \n\nRegardless, I had the kung pow chicken dish which came with white rice. It was a large portion and very tasty with a perfect heat level. People complain about the prices but for $19 I thought it was normal.. Were in vegas people.. Everything will be a few dollars more than non vegas prices.\n\nI like that they didn't try to force the sale of expensive alcohol like most restaurants around. \n\nAll in all I thought the noodle shop delivered exactly how it should have. Well done!"
        }, 
        {
            "index": 339, 
            "rating": 4, 
            "review": "I grew up around authentic Chinese food and thought this was pretty good.  I suspect the bad reviews come from a higher price for Chinese food.  But i paid $125 for pasta in another restaurant in mandalay and $20 for a beef sandwich next door for lunch at the seabreeze cafe so the prices are in line.  If you want chinese food here i hope the other reviews don't put you off.  I ordered mongolian beef and the bbq mix which included hainan chicken."
        }, 
        {
            "index": 340, 
            "rating": 2, 
            "review": "For what is a \"go to destination\" resort the Noodle Shop disappoints. You can pretty much expect high price, poor service.  If you really want a good \"noodle restaurant\", venture down to the Golden Noodle at Monte Carlo and get great noodle dishes with much more in terms of value"
        }, 
        {
            "index": 341, 
            "rating": 1, 
            "review": "This place is absolutely awful. Then Pho is disgusting and the dumplings or Shumai gave one of my team members food poisoning. Literally some of the worst (and overpriced) food in Vegas. Stay far, far away."
        }, 
        {
            "index": 342, 
            "rating": 2, 
            "review": "I know that I live in Irvine, the MECCA of authentic and tasty Chinese food, so perhaps my superior and spoiled palate has a higher standard for Chinese cuisine, but COME ON REALLY!!!! How do you mess up Mongolian Beef? \n\nMy boyfriend and I got the Mongolian Beef (more like The Sugah Beef) and Mabo Tofu (it was aiight). \n\nThe beef was WAY too sweet! I was expecting a spicy and savory flavor sensation, but clearly the cook was thinking something else!\n\nDefinitely won't be going here again! $17.95 for sugary beef makes me a sour puss!"
        }, 
        {
            "index": 343, 
            "rating": 1, 
            "review": "We made a big mistake coming here. We were craving Chinese food and this was the only place that we saw open. I ordered a won ton soup and my wife ordered a chicken dish. When we both finished we both came to the same conclusion. The food was the blandest we ever tried. After reading the reviews I realized the mistake we made by walking in here. I highly recommend finding anywhere else to eat."
        }, 
        {
            "index": 344, 
            "rating": 1, 
            "review": "Never ever go here.  Really bland overpriced food with horrible service.  \n\nI've had better kung pao chicken out of a frozen bag from Trader Joe's....much better actually."
        }, 
        {
            "index": 345, 
            "rating": 2, 
            "review": "service was great but the food quality...oh man! the pho i ordered was so tasteless i always finish my pho but could barely choke it down. the beef pieces were too thick...i suggest slicing them on the slicer thinner and if you cant, freeze the beef so that its easier to slice thinly. the pan fried shrimp and chive was good with the sauce. i wish i got the shrimp wonton noodle soup which my friend got. easier to eat."
        }, 
        {
            "index": 346, 
            "rating": 2, 
            "review": "Food was decent price for it being vegas, but the food was really dry. I had the roast pork on rice. It was relatively dry and the rice was badly cook. How do you mess up cooking rice?"
        }, 
        {
            "index": 347, 
            "rating": 3, 
            "review": "A-ok for a restaurant in our hotel.  We were here a few years ago with our daughter and her friends and it's a quick meal, a bit expensive but convenient if you are staying at the hotel.  Server was friendly since we speak Cantonese (enough to order lol)."
        }, 
        {
            "index": 348, 
            "rating": 3, 
            "review": "This place was ok! Not nasty but not amazing.\ni ate the whole pad Thai dish because I was starving but it was pretty bland and everything felt wet. The chicken was wet and soggy.\n\nDon't know if I would go back...\nIt's a mystery to me."
        }, 
        {
            "index": 349, 
            "rating": 3, 
            "review": "Around the Excalibur-Luxor-Mandalay Bay corridor, your Asian food options are quite limited. I have to say that Noodle Shop was actually an ok place even though you are paying 2x to 3x more for Asian cuisine. You are definitely paying for the convenience, but it definitely hits the spot after a long night of partying. I had the roasted duck noodle soup and the preserved egg congee. The roasted duck noodle soup was pretty good, although after a while, you notice the heavy presence of salt. So, after I tasted too much salt, I tried to tame the salt with a bowl of congee. The congee wasn't good at all. I had to douse my congee with pepper to make it taste better which was disappointing."
        }, 
        {
            "index": 350, 
            "rating": 4, 
            "review": "I think this place deserves a higher than 2 stars for several reasons...\n\n1. People are complaining that this place is expensive. Yes, you are in Vegas! It's like a giant airport, just expect to pay at a minimum double what you normally would for everything.\n\n2. This place adds some variety. There's so many places that are just cafes/pizza places.\n\n3. Their noodle soups are good. \n\nThe beef brisket soup was good and so was their wonton soup! Just don't venture far from the Chinese noodle soups. (I saw someone getting a pad thai there and it looked pretty bad... Also, their pho was mediocre at best...) All in all, my experience was 4-stars especially because this is exactly what my body needed."
        }, 
        {
            "index": 351, 
            "rating": 2, 
            "review": "I use to count on this place for a good bowl of pho or BBQ pork soup. But times have changed. \nOur party of three had both of the above, orange chicken, spring rolls and scallion pancakes and NONE of it was edible.\nPho-looked like gray dirty dish water\nand tasted same. \nBBQ Pork Soup- Not sure how they accomplished this but the pork was bone dry even in the soup. \nSpring rolls-way too greasy. \nOrange Chicken-see Spring rolls. \nScallion Pancake-See Spring Rolls. \nWake up Mandalay and hold your restaurants accountable to have a little pride in what they serve."
        }, 
        {
            "index": 352, 
            "rating": 4, 
            "review": "I can't say much about the restaurant or service because we ordered food to go to take it to the pool. \nI got the chicken chow mien and my husband got the shrimp dumplings. Both were really good. The chow mien was flavorful and packed with chicken and veggies. I would order to go again! \nShe also gave us waters in to go cups for the pool!"
        }, 
        {
            "index": 353, 
            "rating": 1, 
            "review": "This was a frustrating and not so tasty dining experience. \n\nWe are at Mandalay, and I was overcome with a craving for noodles. The obvious choice (without doing the smart thing and jumping on the 15 and heading to Spring Mountain) was The Noodle Shop.\n\nWe were seated quickly, but it took quite some time for our waiter to take our order. When he arrived, we wanted his suggestions for the best noodles. He recommended a XO Vietnamese noodle with shrimp, the most expensive noodle. My husband warned me that the waiter was just trying to up sell the pricey dish. Regardless, it didn't sound too appealing to me, when our waiter returned, I went with the Singapore curry noodle. I wanted to get tofu instead of shrimp, but our waiter said it would be $2 extra! Sorry, but that is unacceptable. If I am not getting shrimp, there should not be an upcharge for tofu. So, I went with shrimp even though I wasn't planning on eating them. \n\nMy husband ordered the $26 Vietnamese noodle with shrimp. That's right. He ordered the thing he had warned me against. Crazy husband.\n\nMy curry noodles were edible, but over curried (this coming from a die hard curry addict) and they were lacking that seasoned wok flavor. \n\nMy husband's dish was sad. The portion was teeny, and the jumbo shrimp were no larger than the standard shrimp at Red Lobster. The flavor was just eh. He was so disappointed that he called over the manager and told her they should take the dish off the menu (true, but I was still embarrassed!). When he asked why in the world this dish was $26, she said it was the XO. For $26, my husband should have at least gotten tipsy off the noodles. He didn't. I am generally okay with a Strip premium, but this was unacceptable for a pretty casual dining experience with mediocre flavor and sub par service.  \n\nMy visions of a happy, noodle filled belly were squashed. Sorry, Noodle Shop, but there were just too many issues."
        }, 
        {
            "index": 354, 
            "rating": 1, 
            "review": "This place was very bad I ordered chicken chowmein it tasted like they used oriental ramen powder  and soy sauce.  The green onion pancakes tasted like they were frozen. My wife dish was god awful the veggies tasted like they were canned and the sauce was bland. Service was very lacking. Don't eat here"
        }, 
        {
            "index": 355, 
            "rating": 3, 
            "review": "When you're at a hotel, your choices for any type of food are usually limited. At Mandalay Bay, this Chinese restaurant doesn't disappoint...until you see the bill.\n\nThe beef chow fun was great and the won ton noodles were exactly what you'd expect from a Chinese place. The menu is fairly large with plenty to choose from. The food is tasty without the MSG overload of most Asian places. \n\nOverall, the quality seems fresh and the service is thankfully prompt and friendly. Everything is on the pricier side so be prepared or head to one of the many Chinese restaurants along Spring Mountain Road."
        }, 
        {
            "index": 356, 
            "rating": 3, 
            "review": "Everyone in our party said their food was 'good, but different.' The pad Thai was tasty, but orange-colored and more tomatoey than we've experienced. The orange chicken was bland and more crispy than anything. The fried rice rocked! The pho was good, but the beef in it was incorrigible -- tough and had to be cut on a plate, but a nice addition once added.\n\nThe service left something to be desired. Nice folks though."
        }, 
        {
            "index": 357, 
            "rating": 1, 
            "review": "What a big disappointment.  The restaurant has the atmosphere of a McDonalds and besides the Chinese lanters overhead has no Asian flavor whatsoever.  Appetizers arrived before main courses and the food was mediocre at best.  I was positive that I'd been here 2-3 years ago and I'm sure I was at some version of the restaurant then but it looks like it moved and is now located in an annex of the cafe next door.  Funny how a bad atmosphere can make a meal feel cheap and that's what's happening at Mandalay Bay's Noodle Shop."
        }, 
        {
            "index": 358, 
            "rating": 3, 
            "review": "My friend and I ate here for lunch before we were to head out to the Airport. It wasn't something I will rave about forever and a day. But it wasn't bad either.\n\nIt hit the spot. I'll take it :) Chicken wasn't over cooked. Sauce was flavorful. It worked quite well in a pinch when we were having a hard time trying to figure out what to do for food before our airport shuttle arrived."
        }, 
        {
            "index": 359, 
            "rating": 1, 
            "review": "We should have checked the Yelp reviews before we went to The Noodle Shop at Mandalay Bay.   It is absolutely terrible.  Do yourself a favor and go elsewhere.  \n\nWe ordered the \"Roasted Crispy Duck\" appetizer and was told that it actually wasn't crispy, but just roasted.  We got it anyway and it was disgusting.  The taste was lousy and it was some of the worst duck I've ever had.  \n\nWe also ordered the Cashew Chicken.  Our waitress came out about 5 minutes after we ordered and told us they were out of cashews, but they would make it without cashews.  Are you kidding me?  They ran out of cashews?\n\nOur waitress was awful.  She was extremely annoying and her manager wasn't any better, as she seemed about as clueless as the waitress.  \n\nI give you all the same advise I told people looking at the menu when we were leaving: this place is terrible.  Don't eat here."
        }, 
        {
            "index": 360, 
            "rating": 3, 
            "review": "Fine for tourists, but locals gotta go to china town for this stuff"
        }, 
        {
            "index": 361, 
            "rating": 3, 
            "review": "I've been coming here for several years. Service is consistently inconsistent. Today's waiter seemed angry. Food is usually good (not excellent) but if you need a quick meal between conference sessions this is a good place to go."
        }, 
        {
            "index": 362, 
            "rating": 5, 
            "review": "This place is a good choice if you like Asian food. I had the chicken pad Thai noodles. There was a lot of noodles, enough to share if you wanted. The staff was friendly and the service was good. Would eat there again on a future trip."
        }, 
        {
            "index": 363, 
            "rating": 3, 
            "review": "My waitress was very sweet - I appreciated that she mentioned that my dish had peanuts in it, even though that is almost the only thing I'm not allergic to.  Stupid allergies.\nAnyway, the space is lovely, if you have your back to the entrance, you might forget you're in a Vegas casino.  \nI had the kung pao chicken and it was delicious!!!  $17 delicious?  Probably not."
        }, 
        {
            "index": 364, 
            "rating": 1, 
            "review": "This place is a joke. Save your money and go somewhere else. Panda Express is way better."
        }, 
        {
            "index": 365, 
            "rating": 3, 
            "review": "Great concept: just had it better and cheaper elsewhere.  With that said, this is a soul satisfying place for soups.  I especially liked the thin noodles with duck and Chinese greens and Bok Choy.  The noodles were a little \"dry\" in the mouth-feel, but the duck was perfectly cooked."
        }, 
        {
            "index": 366, 
            "rating": 1, 
            "review": "The noodle soup I ordered was salty and only had 3 shrimps and a few squids in a so-called seafood Tom yum soup. It was bad and way overpriced. Would never come back"
        }, 
        {
            "index": 367, 
            "rating": 4, 
            "review": "Yes it's ridiculous to pay these prices for noodles.  But you know what, it's the middle of the night, you didn't think twice about the price you're paying to be staying at Mandalay Bay, and you want comfort food.  Pho, congee, pad thai, whatever your craving is after a long night.  This is it, lots of variety and be realistic - it's as authentic as you're going to find in a casino hotel.  Relax, think of it as your little oasis in Vegas.  Enjoy it; you'll win big tomorrow! Right?"
        }, 
        {
            "index": 368, 
            "rating": 3, 
            "review": "Went here last week with my girlfriend.  The waiter was nothing more than a skinny little rude SOB.. Acted like we were a bother and only checked up on us once. Good food, but bad experience.   We asked if they had wonton chips for the soup he freaked out and said \"No!!!!!\".  I guess we offended him or something lol, he reminded me of the waiter from booty call inside that restaurant where they skimp Bunz on a few shrimps and he complains."
        }, 
        {
            "index": 369, 
            "rating": 3, 
            "review": "Located in the Madalay Bay, this place is pricey for what it is.  Having a restaurant.com gift certificate definitely helped though, so I recommend that.\n\nMy friend had the pork dumplings.  There were only 4 but he said they were very good.  The Tom Yum soup was good as well.  \n\nFor entrees we had the mongolian beef and szechuan shrimp.  Good, but the place is pretty expensive so it should be good.  It's decent and so I may go back."
        }, 
        {
            "index": 370, 
            "rating": 2, 
            "review": "On our last day in Vegas, everyone wanted to eat something different. As for me, I remember seeing the noodle shop, and having some hot noodle soup or chow mein sounded yummy after drinking all weekend. So, our group headed over to the noodle shop.\n\nFirst off, the service is really really bad here. The service is slow, and half of the staff doesn't know what they're doing. Granted you don't get good service in a Chinese place, it was still worse than many other places. Our waiter just didn't care about anything, and never came back to ask how our food was or refill our water. On top of that, we wanted to split the bill at the end. So the way we usually do that, is write each person's last 4 digits of their credit card number and the amount they want to have charged on their card. At every restaurant, waiter's are please to see us make it so easy for them, and have it done right away. However, the staff here just couldn't figure it out. We waited a total of 20 minutes just to get our bill back. I noticed that there was about 4 people trying to handle the bill, and none of them could get it, so they finally had the manager come out. After the whopping 20 minutes, we finally got our bill back.\n\nAs for the food here, let's just say I much rather go to Panda Express for my Chinese food. I ordered chow mein, and it was soo bland and soo oily and greasy. I can't cook Chinese food for shit, and I could whip something better up.\n\nOverall, I was really disspointed since I was craving some good , or even settle for decent, Chinese food. Good thing I went over to my aunt's house after and she made me some amazing Cantonese food."
        }, 
        {
            "index": 371, 
            "rating": 2, 
            "review": "Don't be fooled by the designer's touch and the great service. You're here for the food and the food is mediocre at best.\n\nOrange Peel Chicken: we asked to substitute chicken for beef. What did they do? Threw a bunch of breaded chicken in a beef sauce. Imagine putting chicken in your mouth and tasting beef.\n\nKung Pao Chicken was way sour and dulled down.\n\nCury Crab Potstickers were good.\n\nOverall, a mediocre meal for $60. Keep walking. There are better places at Mandalay Bay."
        }, 
        {
            "index": 372, 
            "rating": 5, 
            "review": "I've been there in October 2014 and it was great. Waiters were nice, place was nice and the Pad Thai chicken I ordered was good"
        }, 
        {
            "index": 373, 
            "rating": 3, 
            "review": "Just ok, I started with the pork soup and had yang chow rice. All ok, nothing special at all. It is cheaper than some other spots and has a decent wine selection. \n\nThe service is quick and aloof as you might expect. No love when I went so that's a plus. Might go again for take out."
        }, 
        {
            "index": 374, 
            "rating": 1, 
            "review": "We stopped by The Noodle Shop before seeing the Lion King. I had the crazy idea that the larger casinos' restaurants would at least be \"decent\", so I didn't check Yelp beforehand. I should have known better!\n\nMy boyfriend ordered pho and I ordered vegetable pad Thai. We split the seaweed salad as an appetizer. The seaweed was good but the added tofu was unnecessary. Overall though, pretty good. Since there aren't many vegetarian options on the menu, I asked if the pad Thai could be made with vegetables instead of meat. She said that wouldn't be a problem. \n\nOur dishes came and I was disappointed to see that my entree consisted of nothing more than orange, oily noodles and a few pieces of onion. That's it. No extra veggies, peanut crumbles or fresh bean sprouts. I'm sure it would have been acceptable for some hungover frat boy, but I expected a little more. It lacked the taste and texture that's pretty standard at even the worst Thai restaurants. My boyfriend compared his soup to \"mall pho\" and it was missing the traditional condiments. \n\nOverall, this place definitely wasn't worth the price and I recommend skipping it."
        }, 
        {
            "index": 375, 
            "rating": 3, 
            "review": "Needed to spend a resort credit and no options were appealing.  We decided on this place and I found it to be adequate, but much too expensive for either the portions or the quality.  The pork buns were good, but at $12 for three they were way overpriced.  The vegetable curry I had was not very spicy, was heavy on the eggplant, and was only ok.  The best thing we ordered was sweet and sour chicken, but it was't much better than panda express and sure cost a lot more!  Wish I would have consulted yelp! before checking this place out.  One plus was that the service was friendly."
        }, 
        {
            "index": 376, 
            "rating": 1, 
            "review": "There is no flavor in the food. The noodle tastes so weird and even worse than instant noodle. It has the worst wonton noodle I've ever tasted."
        }
    ]
}