{
    "category": "Las-Vegas", 
    "entity": "Bonito-Michoacan", 
    "avg_rating_stars": 4.222453222453223, 
    "review_count": 481, 
    "reviews": [
        {
            "index": 1, 
            "rating": 5, 
            "review": "I have been coming here off and on for about 16 years and this gets better and better they have extended their menu over the years as well as their desert and cocktails. You really can't go wrong with anything you order I have had chicken, steak, and seafood. Breakfast is also good and the posole. Prices are fair and it's a good little spot if you want to get out of the strip a bit and enjoy some good Mexican food and yes I am Mexican"
        }, 
        {
            "index": 2, 
            "rating": 5, 
            "review": "Great food. Great service. Tortillas were perfect. And the margaritas are huge! They did not skimp on the liquor. Love this place."
        }, 
        {
            "index": 3, 
            "rating": 3, 
            "review": "Carne asada tacos- 3/5 stars. Just average. \nLengua tacos- 4/5 stars. It was tender and delicious. \nFresh churros- 5/5 stars. I'd like to come back just for the desert and that's it. \n\nI think overall it's not a bad place, but there wasn't too much of a standout item for me besides the desert and lengua tacos."
        }, 
        {
            "index": 4, 
            "rating": 5, 
            "review": "My boyfriend and I decided to try this place after work and LOVED it!!! \nI think our waiter name was \"Israel\" and he was so so helpful, funny, and courteous. Not only did we get free seconds on the bean dip and salsa, we got free soup too! He also hooked my boyfriend up with a flavored margarita instead of the regular house kind. They also helped me with certain Spanish words and answered all of my annoying questions! Lol! We even got our picture taken and printed on a free coupon! \n\nThe food was excellent! No complaints what so ever! \n\nThe restroom cleanliness was about a 4 out of 5."
        }, 
        {
            "index": 5, 
            "rating": 4, 
            "review": "This was a recommendation from one of my coworkers and I decided we would stop in there after work the other day and get dinner... \n\nFirst thing is first, the building is not the prettiest of places but i guess it fits the overall feel of the place, you walk in and 2 young ladies dressed in old Mexican dress great you and get you seated, the waiter then came by to see us and offer us drinks.. Let me stop and say that the waiter was extremely friendly and on top of every aspect of our meal. We ordered a Margarita and waters with the Table side Guacamole for an appetizer. this was probably the best guacamole i gave ever had. The meal also comes with not only your entree but you get sopa de fideo with every combo plus beans and rice, My grandma used to make sopa de fideo before she passed and it tasted just like her.  memories!!!  \n\nOkay so now that my review has turned into one long run on sentence I will just finish by saying the meals are huge, tasty and fairly priced, I definitely recommend this place if you like Mexican food and great service."
        }, 
        {
            "index": 6, 
            "rating": 4, 
            "review": "Great place for music, drinks and mariscos very friendly. Friends and I stop by for dinner on our vacation to vegas we had verity of food.  Coctel de camaron, agua chile, ostiones, camarones al mojo de ajo, margaritas, vampiros everything was as expected good great taste drinks on point, deftly will eat at this please on my next vacation to sin city."
        }, 
        {
            "index": 7, 
            "rating": 5, 
            "review": "First time here. Recommended by my compadre. I am impressed. The service was fabulous. Julio was great! He was friendly and he even gave my kid a complimentary sopa de fideo. Maybe because I told him I was going to split my meal with him and he felt bad. Hehe. 3  of us ordered the beef machaca. Our plates were left clean. Two others prefers huevos rancheros. Plates were left clean. It's located about 3 miles from the Orleans."
        }, 
        {
            "index": 8, 
            "rating": 5, 
            "review": "Extremely friendly and made me feel like i was at michoacan. I loved it! Food was delicious. We checked in and received a free margarita.  great place if you are looking for great mexican place!"
        }, 
        {
            "index": 9, 
            "rating": 5, 
            "review": "Absolutely delicious!  My husband and I love checking out Mexican restaurants where ever we go. This place is the real deal!  We tried several different things on the menu. The shrimp tacos were fantastic!  Service was great. We will make a point of going back next time we are in Vegas!"
        }, 
        {
            "index": 10, 
            "rating": 1, 
            "review": "I got sick after eating here!!!!!! Horrible stomach pains!! Do not waste your time or money on this place. Worst enchilada I've had in my life and their \"steak\" was low grade beef I wouldn't feed my dog. The place was packed and had great reviews so I was shocked when my food arrived. So disappointed and will never step foot in that place again."
        }, 
        {
            "index": 11, 
            "rating": 4, 
            "review": "Exactly what I was looking for and more. \n\nA family friendly, sit-down establishment with a fun and welcoming atmosphere with live music, house made tortilla chips, fresh guacamole made at the table, attractive and tasty dishes, with an extensive beer and cocktail menu. \n\nPerfect for parties and one-on-ones alike. Next time I'm in Vegas, I'll be sure to have a meal here."
        }, 
        {
            "index": 12, 
            "rating": 5, 
            "review": "This place has the best customer service, truly. I came in needed to place an order for pick up later in the afternoon and they were so helpful. I was not sure what to order and the staff was great at recommending what I should order. \nThen when I came back to order like three people asked me if I needed help. Just very nice and the prices are good and this place is clean."
        }, 
        {
            "index": 13, 
            "rating": 1, 
            "review": "Saw the restaurant on yelp all the good stars went yesterday cinco de mayo and it was the worst service ever .. Their was two of us and our waiter only had four other tables , he approached us in a timely manner got our drinks didn't see him for twenty min later , I finally said can we order he said yes .. Told him what we wanted 45 min goes by no refills and no food , he came by and said the foods Gonna be another min( I asked for refill) 15 min more my food came out their was cheese I told the guy this isn't what I ordered he said oh sorry .. The waiter apologized and said they read the ticket wrong 5 min later came back out and their cheese again.. Finally I said screw it were leaving my friends was good thou... The waiter ask if he can get us anything I said no thank u I waited 1:15 min for a burrito with no cheese.. And we paid the bill for my friends food and left I was very upset :-("
        }, 
        {
            "index": 14, 
            "rating": 2, 
            "review": "If it weren't for the excellent service this place would have 1 star. The food was awful, the soda was watered down, and the restrooms stunk like sewer. I have eaten here years ago and it was very good, i'm very very disappointed in Bonito Michoacan. Also, the mariachi band, AWFUL and ANNOYING!\n\nNote: try Frank and Finas on Grand Canyon and Flamingo instead, best Mexican food in town, IMO. And guess what, no mariachi band:)"
        }, 
        {
            "index": 15, 
            "rating": 5, 
            "review": "Chips, salsa, and bean dip right on the house off the rip to start?! What! Snuck in a little after 6pm and still got the happy hour price on the margarita's?! Damn who still does that. Had a regular and mango margarita. Margarita craving fixed. \n\nGot the guac as an app. A must. They mash it up table side, so you pick the ingredients. No onions for me. I had the chicken taco, tosdada,and enchilada combo joint. Wow! My girl had the bean burrito and beef taco combo. Said she liked it (Was her pick to eat here since she said it was the best). Tons of stuff on the menu. All this for $55 and my girl had 2 margarita's too. Definitely good.  \n\nThe only complaint is that the decor is a little old, but I like the mom and pop hole in the wall type places. I also ate wayyyy too much and it felt like a rock was in my stomach all night."
        }, 
        {
            "index": 16, 
            "rating": 5, 
            "review": "Carne Asada plate was excellent. The meat was cooked well. Nice and tender. If and when you are in town check this spot out. Service was excellent and Jenny at the bar was very conversational."
        }, 
        {
            "index": 17, 
            "rating": 5, 
            "review": "Just had dinner here tonight. This place has good vibe, vibrant decorations, lovely music, amazing food and outstanding service. We had shrimp ceviche, steak tacos entree and steak fajita. Everything was delicious. Complimentary chips and salsa are served as soon as you sit down. Rice, beans and soup come with most entrees. I checked in on Yelp and got a free Margarita which was also good and refreshing. The waiters were very nice, friendly and attentive. We really had a great experience at Bonito Michoacan tonight and will definitely come back."
        }, 
        {
            "index": 18, 
            "rating": 5, 
            "review": "I love everything about this place. Its always packed, and the service never slows down! These guys do the same super fast service no matter how busy it is! Awesome place, with hilarious live music."
        }, 
        {
            "index": 19, 
            "rating": 5, 
            "review": "Came here with me and my 2 friends we instantly were seated. Sat down the food runner brought us chips, beans & salsa the beans were good the salsa good but a little bit to spicey for me. On yelp if you check in you get a free margarita it was delicious.  I ordered the 2 shredded beef tacos (comes with rice and beans) everything was delightful!  Also a mixed coctel the shrimp, ocotopus and oysters yum! The preparada and the coronarita perfect!  My friends scarfed down there food so overall wonderful Mexican food with good prices we never had to asl for anything.  Our waiter was on it!"
        }, 
        {
            "index": 20, 
            "rating": 3, 
            "review": "My husband and I went here to use our groupon. He ordered chile rellenos and I carnitas. Food was great specially with our groupon. However our server was not the best. He waited several minutes  before he checked on us or to refill our drinks. But the busser was very attentive and took care of us because our server wouldn't. Also the so called live music is just a man with a key board. If my review was solely based on food I would rate it 4.5. However based on the overall experience I had to rate 3."
        }, 
        {
            "index": 21, 
            "rating": 5, 
            "review": "Fantastic place!!! Mexican people is very positive, friendly and funny! Food is delicious and atmosphere is super romantic!!!Highly recommended!)"
        }, 
        {
            "index": 22, 
            "rating": 1, 
            "review": "Waited over an hour never got our food. Never coming back no attempt to make it right just kept telling us to wait. \n\nShould have just walked out without paying for our drinks but at least we'll have our integrity. \n\nDon't come here if you are on a schedule"
        }, 
        {
            "index": 23, 
            "rating": 1, 
            "review": "Ordered a Shirley Temple and didn't get something close. No cherries either. The Ceviche tasted and looked like imitation shrimp and the tostadas that came with it were so hard you could have broken a tooth.I found stems from the avocado in my Ceviche. I had to ask for a refill, more chips and the bill. The over weight sweaty waiter was not friendly at all. The only friendly one in there was the female waitress with blonde hair. She's a gem stuck in that hole. Wish I could post a pic but it's not giving me an option."
        }, 
        {
            "index": 24, 
            "rating": 4, 
            "review": "I love this place. Be sure to get the table side guacamole. I would say they have the best guacamole in town.  The food is consistently good. The service isn't really the best but the food makes it worth it. They have a happy hour, too, so that's when to start drinking the Cadillac margaritas."
        }, 
        {
            "index": 25, 
            "rating": 4, 
            "review": "Bomb!!! However this rude waiter brought the check to my party and said outlays that both mine and my boyfriend was declined. That was upsetting and embarrassing. I'm from LA so our bank put out account on hold. He should've not done that infront of my family. He should've pulled us a side or in low voice. But he rather screamed out on purpose. We didn't like him btw. \n\nOther than that it was amazing! My bday surprise my bf got me was fantastic! Maybe mariachi every night would be nice."
        }, 
        {
            "index": 26, 
            "rating": 5, 
            "review": "Love this place. The food and the staff are amazing. Only had one bad experience but it was late night and I think both me and my server were too exhausted to understand each other. My go to spot for Mexican and love the margaritas (on the rocks of course)."
        }, 
        {
            "index": 27, 
            "rating": 5, 
            "review": "If you are in Las Vegas please come to this mexican restaurant it is the best. Great service and wonderful tasting food at its finest. The best service I have had here were from Nacho and Gabriel. Gracias chicos son de lo mejor, cada vez que venga ha las vegas vendre visitarlos"
        }, 
        {
            "index": 28, 
            "rating": 5, 
            "review": "Our friends took us to Bonito Michoacán for lunch, and they did not disappoint! Large parking lot, but since it was a Sunday they were pretty crowded. Festive colors adorn the outside of the building, and inside there were a lot of Mexican decorations and murals. Very loud and very crowded with lots of Spanish speaking folks, so I was hoping that meant the food is good--and si, it was! Traditional Mexican dishes and drinks abound, and our server Jonathan was most friendly and patient with our numerous questions about the definition of some words on the menu and the food. I decided on the Carnitas Michoacán, which is pork marinated in oranges and spices and listed as \"the best carnitas in all of Mexico\", and I gotta agree! I really enjoyed the flavor and tenderness of the meat and all of the accompaniments--awesome! The portions were quite large, so most of our party did not finish their meals, but I totally wolfed mine down--lol! I also had a jalapeno cilantro margarita to go with my meal--woohoo, spicy and refreshing! We will be sure to visit again when we're in Vegas!"
        }, 
        {
            "index": 29, 
            "rating": 4, 
            "review": "This is very good quality food and excellent service!\nI have been here several times before, this particular visit I was a little disappointed with the bean dip. I look so forward to the chips, salsa, and bean dip that is served when you are seated. Usually it is AMAZING and I dive in like a maniac! Today the beans were hard and dry, just not good at all.\nChips and salsa were still good though..... just a bad day for the beans I guess.\n\nToday, my husband and I shared the Parrillada de Marisco. A huge platter of shrimp, crab, fish, and rice.\nA very good value for $45. \nThere was shrimp prepared different ways, butterflied and fried (which was very tasty) bacon wrapped (wasn't my absolute favorite) shrimp in enchilada sauce (very good, especially when eaten with the fabulous rice in the center of the platter)\nThere was not a lot of crab. One bunch of snow crab legs... they were nice and sweet though. \nA large Tilapia filet in a butter sauce, which was very good. \nWonderful creamy rice piled right in the center of the tray.\nThen on the side they serve an amazing queso and warm fresh homemade tortillas!\n\nWe accompanied our Parrillada de Marisco feast with a couple of shots of tequila, 1942 and it was FABULOUS!!! Pricey tequila shots, but good!!!"
        }, 
        {
            "index": 30, 
            "rating": 5, 
            "review": "Favorite Mexican place in Vegas. I have been here four times now and ordered something different every time. the chilaquiles are amazing as well as the fajitas and the albondigas taste homemade! Juan was our server tge most recent time. He was VERY attentive which i truly appreciate especially since it was the middle of the lunch rush. I never even had to ask for a drink refill because i had a fresh drink before i reached the bottom! The amuse buche is tortilla chips salsa and homemade refried beans. These beans are as good as my own mothers but dont tell her i said that! This is the only traditional authentic tasting mexican restaurant i have found since moving to LV.\nI reccommend the chicken mole. The sauce is rich and thick and frafrant with spices. You will not regret it!"
        }, 
        {
            "index": 31, 
            "rating": 5, 
            "review": "Absolutely The Best Mexican Restaurant In Town\n\nMy husband and I drive from Southeast Henderson almost weekly to enjoy Bonito. We have always had excellent service and the food is phenomenal. Anytime we have out of town guests we bring them here for a special treat. We have tried many different items on the menu and have never been disappointed. We love the decor and enjoy the piano player on weekends. We always leave happy and satisfied."
        }, 
        {
            "index": 32, 
            "rating": 5, 
            "review": "Great place to eat! We come here every time we come to Vegas. If you like Real Mexican food and a free margarita stop by. You'll keep coming back for more! Guaranteed!"
        }, 
        {
            "index": 33, 
            "rating": 4, 
            "review": "The service is top-notch and as far as Mexican restaurants go this is one of the better spots in Vegas. The decor is bright and fun with a cheerful atmosphere. \n\nThey have an extensive menu with a nice selection of seafood. I've tried the orange roughy and the camarones a la diabla but my go-to is the red snapper. It's a whole fish served fried or in garlic sauce with rice, salad and french fires. You can sub for beans or veggies. I usually do, it just doesn't feel like fries are the best option for this meal.\n\nThe guac is good and they serve a habanero salsa with a nice kick. It's not the standard salsa that comes to the table with the chips and bean dip, but if you request it they are happy to comply. There are no taps at the bar and the bottle selection is limited. The beer is not the main attraction at this bar, it's all about the margarita."
        }, 
        {
            "index": 34, 
            "rating": 3, 
            "review": "Normally me my boyfriend & friends go to eat here every time we go out to Vegas & honestly use to LOVE this place ! But this weekend that we were there the service SUCKED & the food had a different taste. . . I normally get the shrimp cocktail which is my FAVORITE & didn't taste the same as well as for the rest of the food ordered, what we did like was the oysters with ceviche on the top we got a dozen to share within 4 people & the waiter didn't bring us any side plates to use for them until we asked for the place was just way to dead unlike when Juan was there he was the life of this place !!"
        }, 
        {
            "index": 35, 
            "rating": 4, 
            "review": "Craving the delicacy we call carnitas, I found myself at Bonita Michoacan.\n\nI ordered the Michoacan carnitas expecting deep fried goodness but came out with a savory, saucy goodness! It was coated with a delicious green sauce that was superb for the carnitas!\n\nThe tortillas were thinner that what I was use to but they were homemade. Being different made it better!! The tortillas were also larger than the normal corn tortillas.\n\nI LOVE BEANS! So it was a plus that they gave SALSA and BEANS with our chips at the beginning of our meal.\n\nFor all you clown-a-phobics, do not go here! There is clowns galore near the bathroom. If you go, you'll know what I mean."
        }, 
        {
            "index": 36, 
            "rating": 5, 
            "review": "Very authentic and well prepared meals. The staff was friendly and even had singing and dancing in the back. Good food and good energy..."
        }, 
        {
            "index": 37, 
            "rating": 5, 
            "review": "We are visiting Las Vegas from near Memphis, TN and really wanted to try some authentic Mexican food. After reviewing the many positive reviews on Yelp, we knew Bonita Michoacan was a 'must try' place. We were not disappointed. Oh, my, what awesome food and absolutely wonderful service.  We were initially provided with chips and their home made red salsa and also a bowl of refried bean dip. The salsa was well seasoned and the beans were addictive. We ordered a hotter salsa (because that's how we roll) and were brought a green salsa--whew! Fabulous and very hot.\n\nWe ordered the Mexican Pizza appetizer with a side of roasted jalapeños and grilled onions. Both were so delicious -- we highly recommend!  I had a combo platter with the pork verde and guacamole burrito -- fabulous. This truly is a must - try restaurant!"
        }, 
        {
            "index": 38, 
            "rating": 5, 
            "review": "Very nice place for lunch!!!  Fast service,great food and awesome employees.(teamwork) everybody want you to feel comfortable and in family.\nthanxs so much Lalo and all the team for a great time."
        }, 
        {
            "index": 39, 
            "rating": 5, 
            "review": "This is THE place for Mexican food in Las Vegas....and there are plenty of good places here. Started coming here in 2006 or so, love everything I get and it won't break the bank.\n\nThe soup!!!!\nGreat Drinks!\nAmazing food\nBest seafood dishes (as my partner claims, I hate seafood)\nHome made tortillas\nChips and Salsa!!!!!\n\nAt least 50% of the customers are Mexican and come in groups. They do it right here.....It's worth getting off the strip for if your visiting, and the money you save eating away from the strip pays for your cab ride.\n\nWhat are you waiting for?"
        }, 
        {
            "index": 40, 
            "rating": 5, 
            "review": "This place is great! One of my best places to go, the Steak Cilantro is my fav. All the waiters are nice and they never leave your drinks empty. They always offer us tortillas to take home and they serve you Fidelo Soup before your meal..\n\nYUM."
        }, 
        {
            "index": 41, 
            "rating": 5, 
            "review": "I had my dad's birthday here. The staff was above and beyond accommodating. They allowed all 20 of us to sit and drink a while before ordering. They let us bring balloons and decorations. They split our check into small parties. I cannot say enough how much I appreciate their customer service. To top it all off, they sang happy birthday and gave my dad a 60th birthday shot! Great food, great service, great atmosphere...GREAT, GREAT, GREAT!"
        }, 
        {
            "index": 42, 
            "rating": 4, 
            "review": "Been enjoying this place for years!  I am not sure if i should review today's experience or combine my overall opinion.\n\nToday there was a VERY long wait for our food.  This is not typical so I am not going to give less than 4 stars."
        }, 
        {
            "index": 43, 
            "rating": 5, 
            "review": "Excellent dining experience. The ceviche was awesome, carne asada dinner was one of the best I've ever had! Very nice service staff, everyone had a smile and kept our drinks and chips full. The gentleman providing the music on the keyboard was very talented. We gave him a $20 tip! It really set the mood for a authentic Mexican dining atmosphere. Whenever I come back to LV, this is a must stop for us!"
        }, 
        {
            "index": 44, 
            "rating": 5, 
            "review": "My favorite Mexican food joint in town. Hands down. \n\nCustomer Service is always excellent, but I like to sit down on the right side of the restaurant and get served by the pretty dressed up lady. Otherwise, service is usually pretty good overall. \n\nI would come back here whenever I come back in town. Its one of those must."
        }, 
        {
            "index": 45, 
            "rating": 1, 
            "review": "Servers are very nice but the food taste like microwaved leftovers.  However, if you give them a good review they give you a free margarita. Guess I'm not getting one..."
        }, 
        {
            "index": 46, 
            "rating": 4, 
            "review": "I moved to Las Vegas from Phoenix where excellent Mexican food is very common. Which surprisingly, is not the case for Las Vegas. But alas, after almost 3 years in sin city and my search for a great Mexican spot has finally ended........and although i cant pronounce the name of this joint, it is delicious! and not over priced! Make sure to get the guacamole! (SP?)  Hand made to your taste, right at your table, just how it is suppose to be made! I have only been there on one occasion and it was packed, which is understandable, however i don't enjoy eating in overly crowded restaurants (which is the only thing holding back from a 5 star rating)"
        }, 
        {
            "index": 47, 
            "rating": 4, 
            "review": "I really loved this place!  Visting LV a local friend of ours took us here.\n\nwere were immediately served chips with excellent salsa that actually had some kick to it!  not only that, refried beans were served along with them too..very nice touch!  I had the tacos al pastor...the were ok and not served with the traditional pineapple, onions and cilantro.  Bf got the seafood mariscos..he liked it.  Friend had chicken tacos in hard shell..they looked good and he finished them so thats a sign.\n\nall in all it was a nice experience and very nice to be off the strip. \nOh if anything go there to check ou the shrine of creepy clown figurines, dolls and puppets...very odd"
        }, 
        {
            "index": 48, 
            "rating": 5, 
            "review": "Came here yesterday with my husband. Ordered a molcajete mixta, it was amazing! Staff was very welcoming and friendly. Will definitely come back when I'm In town again."
        }, 
        {
            "index": 49, 
            "rating": 5, 
            "review": "This place has been here forever, and while the decor is a little campy the food is honest and delicious.  I'm not a big fan of mexican, this place really shines."
        }, 
        {
            "index": 50, 
            "rating": 5, 
            "review": "The fresh guacamole made at the table was delicious.  I had chicken enchiladas which were huge portion & taste wonderful"
        }, 
        {
            "index": 51, 
            "rating": 5, 
            "review": "I love it!!!! Very Mexican. \nTortillas made by hand \nThe drinks are great \nAnd the food is amazing"
        }, 
        {
            "index": 52, 
            "rating": 5, 
            "review": "Muy buen ser visio mi mesera Ivonne fue muy atenta me recomendó una mangoneada y estaba riquísima"
        }, 
        {
            "index": 53, 
            "rating": 2, 
            "review": "I wanted to like this place, I really did.  The decor is great, and the men that serve the drinks are all totally on top of it and very friendly.  That is why it gets two stars.  Our waitress unfortunately wasn't as nice.  But without even that, the food just isn't good. Maybe this is a different type of Mexican food that my mom and I are just unaware of.. But neither of us liked anything.  The salsa was funky flavor, rice barely had flavor, chile Colorado was hard to chew, not tender.. Etc.  Well, we tried! On to the next..."
        }, 
        {
            "index": 54, 
            "rating": 5, 
            "review": "I came here for dinner once. Their Carne asada was really good and guacamole amazing.  You must try this place out!"
        }, 
        {
            "index": 55, 
            "rating": 5, 
            "review": "Fantastic food, great service and cute kitchy decor. My cheese enchiladas were delicious and my boyfriend can't stop raving about the fajitas."
        }, 
        {
            "index": 56, 
            "rating": 5, 
            "review": "Out of the way restaurant -- in more of a residential area -- but the food and service are great. Extensive menu. Never had a bad meal here. Try it. You'll like it. And a big hug to the lady who hand makes the fresh tortillas -- to die for. Love her."
        }, 
        {
            "index": 57, 
            "rating": 5, 
            "review": "Very good food! Fast service. Came at lunch (1145). We got our meal within 10 mins of ordering.\n\nMy husband and I shared the lunch fajitas! Very delicious ! More than enough fo two people !\n\nWe also had the queso fundido!  So so good! Highly recommend! \n\nI also checked in on yelp and got my free margarita! \n\nThey have free Wi-Fi here as well!\n\nWe will be back for sure!"
        }, 
        {
            "index": 58, 
            "rating": 5, 
            "review": "Carnitas, carnitas, carnitas.\n\nI have to give a place props when they make carnitas so tender and yet the meat is not fatty.  I respect that!  Portions are so big, you can easily share this dish with someone else.  \n\nThe restaurant has a singer, our server was very attentive and upbeat, you get this addictive re-fried bean dip with the appetizer, it's easy to get full before your food comes.\n\nI have yet to try the guac, everyone is talking about it in the yelp reviews."
        }, 
        {
            "index": 59, 
            "rating": 5, 
            "review": "Best Mexican food ever!! Everything is so packed with flavor and deliciousness, even to the extent that something as simple as Chile Relleno is superb."
        }, 
        {
            "index": 60, 
            "rating": 5, 
            "review": "A hidden gem in Las Vegas.  Service excellent.  Food excellent.  Prices very good.\n\nWe were served (gratis) chips and salsa AND refried beans.  I can't remember the last time refried bean were given as a free dish.  AND IT WAS SOME OF THE BEST REFRIED BEANS I EVER HAD.  The salsa was good, but I would have preferred it hotter.  We were hungry from a day hiking so we also ordered a guacamole  appetizer.  The guac was prepared table side to our taste, also excellent.  I ordered a coca-cola steak ala Mama Cielo, surprisingly it wasn't sweet at all just incredible juicy.  My adventurous choice paid off.\n\nThe service was exceptional.  The server came by, without asking and refilled my drink whenever it was empty (which was often - did I mention 100 degree weather in Las Vegas and hiking).  They also had a musician singing and playing Mexican love songs, surprisingly at the correct volume.\n\nIf I lived in Las Vegas, this would be my number 1 Mexican restaurant."
        }, 
        {
            "index": 61, 
            "rating": 4, 
            "review": "One of my favorites! I've been going to this place for years now but as I've grown older I've grown to appreciate the amazing food they offer.\n\nThe chips, salsa, and beans they offer as soon as you sit down are always so delicious that I have to limit myself lest I spoil my appetite (I'm not fancy - I've just always wanted to say \"lest\"). If I'm particularly hungry I order the Nopalitos as an appetizer. I absolutely love cactus and the way that it's cooked with onions and peppers is amazing and it's healthy!\n\nI've had the shrimp cocktail, which has never let me down. The shrimp ceviche is one of my favorites as well. On hangover days I like to go in and get the Fideo soup (I have tried the menudo - I wasn't a fan). And nothing cures a hangover like a Michelada! The ones offered here never disappoint! The margaritas are also very good, as well as the Corona Margaritas, but the mixed drinks I've found are way too strong.\n\nThe one dish that I actually had to send back was the Mole. Call me spoiled but once you've tried my mom's mole, nothing compares. Mine was too sweet and the meat was too chewy. I sent it back and got a shrimp cocktail.\n\nI guess this place just depends on your taste. Amazing for something things, not so great for others. Try it anyway."
        }, 
        {
            "index": 62, 
            "rating": 5, 
            "review": "The staff was so friendly and welcoming. We just happened to stumble upon this place(Glad we did). Food was great! I really liked the Mexican feel and the live music: a guy playing a keyboard and singing..not loud so you can still talk and enjoy the atmosphere"
        }, 
        {
            "index": 63, 
            "rating": 5, 
            "review": "I thought the restaurant was really good. I had the chicken tacos, which came with (3), rice, beans, and guacamole. There was also a starter of a light tomato soup with noodles, which was also REALLY good. What made it even better was our server, Jonathan, who was very knowledgeable about the menu and was able to steer us in the right direction. \n\nI also appreciated the free check in margarita that the restaurant offered, which made us come to the restaurant in the first place. I live close by so this will definitely be on my list of places for my fiancé and I to go and eat during the week/weekend."
        }, 
        {
            "index": 64, 
            "rating": 5, 
            "review": "Very great restaurant! Great service and great food! Thanks to Jonathan, Omar Soto, and Nacho give us the great experience!! Will definitely come back!"
        }, 
        {
            "index": 65, 
            "rating": 4, 
            "review": "Great service and friendly staff; food is good and prices not bad $$. I will defenilly comeback again."
        }, 
        {
            "index": 66, 
            "rating": 4, 
            "review": "Not bad.  Living in LA and having this place suggested for dinner, I thought 'meh', but it was pretty good.\n\nVery good service, an old building but clean - food was excellent, with homemade tortillas as a big plus!\n\nNice to get away from the casinos, thanks Yelpers for the suggestion."
        }, 
        {
            "index": 67, 
            "rating": 3, 
            "review": "It was between here and Amigos Tacos, I decided to try this place because the reviews were pretty good. The parking was wide open, we were seated immediately and as I was excitedly anticipating, we got our chips - salsa - and beans. The chips were good, fresh. The salsa was very good for me but my BF prefers salsa with a little kick. The beans... well... they were OK, a little salty, but add salsa to the beans and a wonderful treat. \n\nThe menu is HUGE! It took me a while to go through everything and make a decision, I finally decided on the 2 taco combo (beef tacos) and he got the beef enchilada with green sauce combo. While snacking on the chips they brought out a soup.. I wasn't expecting soup, I still don't know what kind of soup it was but it was OK. About 2 minutes after the soup came, our meal came... The food looked good, plates were hot, that's always a good sign. \n\nNow the meal... I took a bite of my taco and it was... a taco. The beef was lacking flavor, it was almost like they didn't season it while cooking, every Mexican restaurant I have been to has always used a combo of onions and other veggies/herbs to season their meat.. it just seemed.. blah. The rice was good, a little on the salty side as well and I usually put salt on everything, I like salt, but it was too salty for even me. my BF and I swapped plates to try each others dishes and his was very good. His beef was good, and it was the same type but since his food was covered lightly with enchilada sauce... i think it helped it out. I used some of his sour cream and the salsa and fixed up my taco.. not amazing but it was good. \n\nAll in all, I am happy we got to try it and I would come here again but I would definitely order something different. I will give Amigos Tacos a try next time and hope that their menu isn't as costly as it was here... over 5$ for guacamole..? Not worth it. But the main reason I will come back was the service, everyone was very friendly, our server paid attention to our table and once our drinks were half empty they had fresh ones on the table..."
        }, 
        {
            "index": 68, 
            "rating": 4, 
            "review": "Went here for a company birthday party and I must say that the waitress we got, was on her game.\nShe was working our table, 12 people and a few others that were 2-4 people and she didnt miss a beat.\n\nThe food was good. The albondigas soup was awesome. Im kinda plain when it comes to ordering, so I had myself a couple shredded beef tacos with some rice.  The beef was seasoned nicely and was a lil too tender for my liking, but good for the most part.\n\nThe atmosphere is great. They do karaoke(or at least i hope it was karaoke, not a band) when it gets a lil later into the evening."
        }, 
        {
            "index": 69, 
            "rating": 4, 
            "review": "This was the second place we ate at while visiting LV(check my other reviews for into).  Coming from the San Francisco area, where good Mexican food is hard to find, this place was a step up with chips and great refried beans served right up, nice Mexican decor, and excellent service.  I started with their Cadillac Margarita with Patron Silver.  Nice size goblet and a nice buzz that lasted the meal.  My girlfriend ordered the \"Vampiro\" which tasted like slightly alcoholic cool aid.  We sent it back and immediately had it replace with a delicious pina colada.  I had read about their Chile Colorado, a new york cut into pieces in a red sauce(gringos need not worry about it being a spicy sauce) to which I added their flavorful spicy sauce and that did the trick.  I ordered the flour tortillas (I believe they are freshly made, as it tasted that way to me.)   My girlfriend ordered the Mexican combo beef taco, chicken enchilada,  and chile relleno ( The beef taco took first place, chili relleno second, I found it delicious on a taste test, and enchilada a distant third.  Finally, always in search for the authentic churro, it was done right served with small decorative flowered whip cream flowers to dip in.  It was crisp and not overly sweet.   Overall I give this place a B+, as their chili colorado good have been better, perhaps make it bit more flavorful.  Nevertheless, as Mexican restaurant goes from where I am from, this place any day."
        }, 
        {
            "index": 70, 
            "rating": 4, 
            "review": "Made reservations for my daughter here for her 21st Bday while we were here in Vegas...she wanted Mexican food and based on all the reviews this place looked like a great pick. Drove in and the barely found a parking spot so for me was a good sign for also a good pick as well...dropped the ladies off at the front door and parked the car. \n\nAfter checking in with my wife things didn't look so positive...they didn't have our table ready which was very frustrating! I gave them hours notice which in my opinion is totally their fault. I will say the staff was  very friendly and very apologetic about the situation. The managers even came out and bought our whole group a round of drinks and brought the kids lemeonades. Finally after a 25 minute wait we did get seated, but again the manager came over and gave us free table side guacamole and again apologized.  At this point no one remembers the wait my daughters could care less and everyone was having a good time. Our waiter Richard made my daughter feel really special and did an awesome job with her birthday. The food here was really good and everyone really enjoyed the atmosphere...would love to come back and enjoy this place again on a trip to Vegas."
        }, 
        {
            "index": 71, 
            "rating": 1, 
            "review": "Second time here and never will I return. Service is good drinks r good. But there food is just not my type.  Got chicken Chipotle last time n was just tomatoe sauce. Got drunk shrimp today and had no flavor. Sent it back to add some spices still the same. Only ate 1 shrimp that's how bad it was. Sorry but I'm from southern California and this is more for different type of people"
        }, 
        {
            "index": 72, 
            "rating": 2, 
            "review": "I went here with a friend because of the reviews. 4 and 5 stars? I don't see it.\n\nThey do have a good mix of authentic and Tex-Mex on their menu. The menu is extensive...but I'm only going to comment on what I had.\n\nFajitas. I ordered a mix of pork and beef. When they arrived they were sizzling hot but flavorless. It's sad when the bell peppers have more flavor than the meat. The only way I could tell the difference from the beef and the pork was that the pork looked like pulled pork -- and about that... isn't fajita meat typically grilled? It honestly looked like they threw some pulled pork on the sizzling plate and tried to pass it off on me. \n\nThe only plus was that the tortillas were freshly made.\n\nI forgot what my friend ordered but when I asked him how his was he just shrugged his shoulders and said, \"It's ok I guess\".\n\nThe service was great and the waiters were very friendly. The salsa was \"ok\" and the bean dip that came with it was, well, bean dip...nothing \"addictive\" about it like I saw in another review.\n\nThe lounge singer they had was playing mostly songs from the 80s. 'I Just Called to Say I Love You' by Lionel Richie? C'mon, Man. I think he played 2 Mexican songs the whole time we were there. I personally think it was more annoying than entertaining but hey, maybe other people like that kinda stuff.\n\nI probably won't be back because it simply wasn't worth it. Bland and ordinary."
        }, 
        {
            "index": 73, 
            "rating": 3, 
            "review": "It's so sad I have to change my review. First we walk in and as we waiter a table a lady is talking to what looks like a manager about finding a hair in the god. Uh ok anyways we get our table. The server takes forever! His assistant did most of the work. I got a refil after it had been empty for 10 min. We had to ask for soup, which was served the same time as our food. My mother in law got nachos which was just cheese and jalapeños. No beans? I could've made those nachos at home. I'll be going somewhere else for Mexican food :/. It was nice knowing ya for 10 yrs"
        }, 
        {
            "index": 74, 
            "rating": 1, 
            "review": "The service was incredibly slow, are drinks or not kept up with, the hostess who seated us was upset we didn't want to sit in the back where we couldn't hear the music and gave us attitude when we requested to be moved and the food was just so-so."
        }, 
        {
            "index": 75, 
            "rating": 4, 
            "review": "Fun place to celebrate a birthday because they sing to you and give you a sombrero to wear and maracas to shake. The mariachi guys take requests of regular songs too. \n\nThey serve complimentary warm bean dip and spicy salsa with fresh tortilla chips. \n\nFast service even when it is crowded. Authentic decor but the booth table was too high even for my tall husband. \n\nThe fried shredded beef tacos are awesome! Good enchiladas, rice and beans."
        }, 
        {
            "index": 76, 
            "rating": 5, 
            "review": "Top notch Mexican food, if you're in the area make sure to stop here if u like Mex food; aside from the great food it has an awesome atmosphere and great customer service."
        }, 
        {
            "index": 77, 
            "rating": 2, 
            "review": "Im a big fans o Chipotle Mexican Grill and Cafe Habana i know they are not the authentic mexican food but i think i will like Mexican food. My friend told me this restaurant was good so i went there with my boyfriend for dinner. The decoration in the restaurant are quite special (looks like a normal house) and the staff are very nice and friendly. My friend told me the Steak Cilantro was good so I ordered this one and my boyfriend had the Coca cola steak. When my dish came, i could smell something bitter and i just didnt want to touch my dish so I switched mine with my boyfriend. So I had the Coca cola steak now, the sauce was nothing special and the steak was overcooked. The yellow rice which came with it was not really good. And my boyfriend didnt like the Steak Cilantro neither. Maybe we just do not like the authentic Mexican food and think we will stick back to Chipotle and cafe habana. People who like authentic Mexican food might wanna go there and try and see."
        }, 
        {
            "index": 78, 
            "rating": 4, 
            "review": "\"This Car Stops for Hot Sauce\"\n\nMid-afternoon Tuesday the hot sauce cravings began. Perhaps you've had them before--a pulsing, salivating tingle on the back of your tongue that flows into the mandible and EXPLODES with pent-up desire, thereby forcing a car's driver to delete an entire day's schedule and head for a Mexican eatery.\n\nAh, life.\n\nThe play? A west side joint called Bonito Michoacan. A cute little corner casita on Chinatown's edge, right where Twain kisses Decatur like cousins on a third date: roughly, rudely with nary a care of red lights. I parked the Crown Vic LX with leather interior by the entrance and strolled inside.\n\nPretty empty, but not surprising since it was only 3:30. I sidled by some clucking hostess stand chiquitas and bee-lined it to the bar. Two small screens showing sports and news glowed brightly in the gloom. Baseball on one and something about an airliner that disappeared on the other. I sat at an empty stool while a lassie two places down promptly turned her back to me, feigning interest in the sweaty boys of summer.\n\nA barmaid with gorgeous eyes asked if I wanted a drink and menu. I said yes to both. She brought me a Corona and chips and I ordered sopitos and a carne asada burrito. I ate hot salsa by the chipful as I watched investigators futilely attempt to explain what happened to an airplane. Every once in a while I would glance at the slender back to my left, its owner uninterested in the life of an accomplished and handsome young man. Such a shame. I could have made her so happy. If only for a night....\n\nWhen my half dozen sopitos arrived I promptly dumped my salsa all over discs that held ground beef, chicken and steak. Occasionally I would dab said discs into sour cream or guacamole. What a delight. I asked for Tabasco and doe eyes placed it before me. She saw me eyeing shelved tequila bottles and asked if I wanted a shot. I told her I was unable to drink a single shot because one had an unbreakable habit of turning into six. She laughed and hip swung to the kitchen. When she returned she had my entrée.\n\nThe carne asada was tender and plentiful, its cavern lightly browned with properly melted cheese. I ordered more beer and enjoyed the rest of the dish. By this time Slender Back had paid her bill and snorted her way past, but not before the barmaid had bade her farewell. \n\nOh, well. Sometimes I'm just too good looking for people.\n\nAnyway, my bill was twenty bucks and I left five for a tip. Outside I looked at the kissing cousins and turned the car homeward, but not before reminding myself to come again soon. Only next time I would not allow Slender Back to get away so easily...."
        }, 
        {
            "index": 79, 
            "rating": 5, 
            "review": "This is one of the top two places I've had the best Mexican food in Las Vegas.  The food is authentic and the delicious EVERY time I have dined here. The staff is extremely helpful and pleasant on a consistent basis.  Occasionally they have a Groupon but it's rare. \n\nPROS: Steak Cilantro \n             Chili Relleno\n             Steak Fajitas\n             Lengua Tacos\n             Pollo al mojo de ajo  \n\nI haven't had a bad experience yet and I've been here a few times. It's great for meeting friends for lunch or dinner. There is something on the menu for everyone."
        }, 
        {
            "index": 80, 
            "rating": 5, 
            "review": "Birthday celebrations are festive and make you the center of attention. Great employees, really make you feel at home."
        }, 
        {
            "index": 81, 
            "rating": 5, 
            "review": "This place is super awesome! The service was great! Very attentive! The food was absolutely on point. Order the shrimp fajitas and they were delicious! Drinks were amazing and at a reasonable price! Homemade tortillas were delicious! Ugh loved it here! Would highly recommend this restaurant to my friends!"
        }, 
        {
            "index": 82, 
            "rating": 5, 
            "review": "My 5 stars are specifically for the quality of the food, the meal was phenomenal. Amazing flavor and a very large portion. A tad bit expensive but what can you expect from a great quality restaurant. Hands down one of the top 5 Mexican food spots I've ever had, I'll be back whenever I find myself on the west side of the strip."
        }, 
        {
            "index": 83, 
            "rating": 4, 
            "review": "Loved the camarones a la diabla..not too spicy but just right. Even the micheladas were so great I had to order two. It was a bit crowded but luckily we got there just in time. I'm not from that area but I can tell that place is very popular by how people kept coming and going. I went with a group of people and they did not have not one complaint. Our waiter was efficient and quite the charmer. I definitely will be back when in Vegas."
        }, 
        {
            "index": 84, 
            "rating": 4, 
            "review": "Best Mexican food off the strip. Authentic dishes and excellent atmosphere.  Over the 10 years I have been visiting this location the food and services has not changed. Person favorites are the carne asada tacos and the pollo a la parilla."
        }, 
        {
            "index": 85, 
            "rating": 4, 
            "review": "I have been to a few of the Michoacan restaurants before. I feel it is safe to say Bonita Michoacan is my favorite. \n\nI came here with my family last weekend while they were visiting from out of town. They were told of Bonita Michoacan by a waiter they met at an IHOP who also works here also.\n\nWe were seated quickly upon arrival even though it was a Friday evening and we were a party of five in this busy restaurant. We did not have to wait long before chips and salsa were brought out. Then we were also brought the sopa de fideo as is customary at the Michoacan restaurants. As were were looking over the menu and munching on chips, we saw another table which had ordered the fresh guacamole. We thought it looked good and ordered it too. I'm glad we did. It was chunky, creamy, fresh and just the right level of spicy. That was a nice way to start our meal.\n\nFor my entree I ordered pollo al cognac. One bie and it quickly became my favorite chicken dish any where. The plate was huge as was the chicken breast though I could not really see the latter. It was a large breast grilled to perfection while maintaining tenderness then smothered in a sour cream sauce with mushrooms, onions and a touch of cognac. I am a sucker for sour cream and mushrooms so this was just awesome. I would go back and order that again for sure.\n\nThere are only a few small things I take issue with at Bonita Michoacan. They are the margaritas, the salsa, and the sopa. At least on this occasion. I ordered a house margarita and that is exactly what I got. My issue with it is that it taste like a premixed syrup like the ready made stuff in the grocery stores. It is very sweet and I don't care for that. The salsa was Ok. It had good spice but then there was a bitter after taste. Possibly from dried chilies being used. And finally the sopa was kind of salty. I realize it is soup and soup is salty. This was just a bit much for a couple of us in my party. Aside from those things that I'm just nagging about, this was a primo spot for dinner and we were all glad we tried it out."
        }, 
        {
            "index": 86, 
            "rating": 4, 
            "review": "Went to Bonito's today for lunch and I'm sure I'll be back!\n\nGreat fish tacos!!  The \"special sauce\" that goes on top was all that, it was delicious.  Chips and salsa were awesome, but the beans weren't right.  I'm not sure what it was about them, but they weren't as good as at other places.  Others in my party had the chicken burrito and the chicken sopas -- both of which were reportedly great! \n\nService is super speedy -- they are quick and that includes taking your plate as you shove the last bite in your mouth and bringing you the check while people in your party are still finishing up too!  That's better than waiting for the check in my opinion though!"
        }, 
        {
            "index": 87, 
            "rating": 5, 
            "review": "I'm from California and will travel to Las Vegas just to have breakfast, lunch, dinner and drinks... This restaurant is worth the drive!\n\nThe old saying in Vegas \"Save water, drink Margaritas!\" \n\nLove the cheesy bean dip, fresh avocado dip, and fresh tortillas... OMG soo good! I must go back ASAP!"
        }, 
        {
            "index": 88, 
            "rating": 5, 
            "review": "We went at 4:30, which unfortunately is before the live music! (I don't know if it was every night, but as we were finishing, a mariachi band started playing).\n\nOne weird thing, either the seats at the booths were low, or the tables were high (or both...) but when I sat down the table was noticeably higher than a normal table...but I'm short.\n\nThis was some delicious food.  We got the tableside guacamole (made fresh, to order, pretty good, but no tomatoes) and it was quite an amount, more than most other sides of guacamole I've gotten.  We (me and three guys with appetites) didn't even finish it.  Of course, that may have had something to do with the HUGE portions that came our way.  One of the guys got fajitas (I think shrimp) and all his fixin's took up a full third of the table.\n\nI got nachos with carne asada...mmmmmm.  A huge plate, piled high.  I think I only got through a third of it before collapsing.  After lunch (lunch at 4:30...this is what happens when you wake up at noon...) we went down to Fremont Street for a couple hours, and even nachos after fours hours sitting in a car were soooo goood...."
        }, 
        {
            "index": 89, 
            "rating": 5, 
            "review": "Great staff, food and experience! This is a place for sure we will come back to when in Vegas!!!!! Found our new favorite spot. No complaints! Homemade fresh flour tortillas, too! Had to order some to go."
        }, 
        {
            "index": 90, 
            "rating": 5, 
            "review": "This is the best Mexican food I've ever tasted in Las Vegas . Their ceviche was delicious and their table made guacamole was even better . I recommend this place to any and everyone . And their customer service was awesome ."
        }, 
        {
            "index": 91, 
            "rating": 4, 
            "review": "I've come here a couple times now...I don't love it or hate it...but there are certainly some very bright spots!  \n\nThe gringo in me feels like i'm deep inside a different culture just by walking in here.  Also, I love that the menu does a little translating for us...such as: \"Servidos con sopa de fideos, arroz, frijoles y tortillas\" and then the translation they give, \"Served with sopa de fideos, arroz, frijoles y tortillas\"...could we be missing anything here?\n\nAdditionally, they have some solid prices on some of their higher-end tequilas!  They make fresh guacamole right there at your table!  Their hotter salsa is tasty and...eh...hot!  I haven't found a 5 star Mexican restaurant in Vegas...Bonita Michoacan does a solid, authentic, job!  Carnitas and I have this thing...we love each other deeply.  The carnitas here don't love me enough for me to come here for them specifically, but they'll do in a pinch."
        }, 
        {
            "index": 92, 
            "rating": 5, 
            "review": "After an all day trip to Death Valley and back my aunt recommended this place.  First and foremost the atmosphere and customer service was exceptional.  I had the Uruapan combo which had green pork and bean burrito, beef enchilada, and chicken taco.  A very tasty and esoteric medley.  I will certainly be recommending and experiencing this place again the next time I'm in Vegas."
        }, 
        {
            "index": 93, 
            "rating": 2, 
            "review": "I've come here several times over the last 12 years. This time was one of the worst! The food was lacking flavor. Normally you get a huge plate full, not this time. Very little of anything. My daughter ordered the kids shrimp. The price was $8 and it literally had 3 shrimp and about 10 fries on the plate. I doubt we'll be back any time soon, if at all. It'll probably be another couple of years."
        }, 
        {
            "index": 94, 
            "rating": 1, 
            "review": "The only good thing about this place is the salsa.. Had the steak fajita and it was so tough you could not eat it... Great service just below average Mexican food.."
        }, 
        {
            "index": 95, 
            "rating": 4, 
            "review": "I just moved here 21 days ago from California, I had ask the movers where is a good place to eat Mexican food he told me to try Bonito Michoacan, so after a long day of unpacking and cleaning we went  to have dinner I ordered the Chile Verde was not impressed with this dish, but the beans they serve with the chips and salsa got me coming back 4 times already.  can't wait to take my family and friend there when they come to visit."
        }, 
        {
            "index": 96, 
            "rating": 5, 
            "review": "This place has AMAZING Mexican food!!! Serving portions were big and the prices were right! Be sure to check in on YELP for a free margarita, then vote for them through text and receive a SECOND free margarita!!! Can't beat that!! \n\nI showed up with a friend who was having his birthday dinner there and our server \"Richard\" took great care of us. He was funny, entertaining, and attentive to our needs. He recommended the prime rib carne asada plate and it definitely did not disappoint! He kept the drinks coming and even showed us how to get the free margaritas on the house by voting on text and checking in through YELP.  He also recommended the sampler special and made us fresh guacamole and dip at the table side. Real funny guy also.\n\nIf you show up at dinner you also get treated to listen to their one man mariachi band on the keyboard doing his thing lol. 5 stars for EXCELLENT service. Will definitely be back if I'm craving for some Mexican food!"
        }, 
        {
            "index": 97, 
            "rating": 4, 
            "review": "Love the food here! One of the best mexican in town hands down. Service and time to wait for the food though NEEDS WORK. The staff does not really know how to coordinate seating and we had 3 different waiters come to our table almost every time i ate here. Otherwise highly recommended for good authentic mex."
        }, 
        {
            "index": 98, 
            "rating": 5, 
            "review": "This restaurant is amazing! The guacamole is a must. Great ambiance, friendly staff, and incredible food. We found this place while searching on Yelp for a family friendly restaurant. The kids loved everything. Even the free margarita we received for checking in on Yelp was delicious. This will be a must go to place every time we come to Vegas!"
        }, 
        {
            "index": 99, 
            "rating": 5, 
            "review": "I went to Vegas with a large group of friends, and we decided to try this place out after it being highly recommended. The recommendation did not disappoint. It is about a couple miles off of the strip, and is situated in the middle part of a suburban area. \n\nAs soon as we got there, it was evident that this was going to be a great restaurant judging by how packed it was. There were nothing but locals here, and the waiters/waitresses were great! They were really funny and accommodating. There was live music playing in the background and I think there must have been at least 4 birthday celebrations while we were there. They make a huge deal about birthdays and even bring out the tambourines.\n\nThe food was excellent (I highly recommend the Steak Al Cilantro), the service was great, and the atmosphere was fun.  The prices were reasonable for the amount of food you get. Oh yeah, did I mention they give you fresh made tortillas? \n\nTry this place out for some great Mexican food! You will not be disappointed!"
        }, 
        {
            "index": 100, 
            "rating": 5, 
            "review": "This is my favorite Mexican restaurant in town. I'm never really disappointed here and I felt the need to bump them up a star for being my favorite. It's still not the best Mexican restaurant in the world, but it's definitely one of the best in Las Vegas!\n\nEvery dish I've tried is delicious and the portions are extremely generous for the price. The menu is ridiculously extensive. There is just too much to choose from sometimes. I try to get someone to share dishes with me so I can get a taste of multiple things. \n\nI enjoy the decor and as a fan of clowns (rare, I know) I actually quite enjoy the back room that is decorated solely with clown figurines and pictures. \n\nGreat place for large groups as well. I highly recommend it."
        }, 
        {
            "index": 101, 
            "rating": 5, 
            "review": "This is a new favorite place! The bf and I came here last night with my little brother and sister at the coaxing of my little brother for some bomb a** Mexican food. And boy was he right. \n\nUpon pulling up and seeing the parking lot was packed I got a little worried we would have to wait for a table but...NOPE. We were happily greeted by two pretty hostesses and taken to our table for 4. Our server arrived promptly, took our drink order, and even gave us a little free cup of their homemade guacamole (delicious!!!) after our chips and salsa arrived. It seemed we had multiple people waiting on us and making sure our drinks & chips were full. I appreciated that, a lot. Pretty cool that they were all having each others backs and truly their focus was on the guests dining experience. \n\nWe ordered different varieties of the usual Mexican flare so I won't go into details describing it all. Everything was delicious and we were all happy with our food. \n\nOne thing that I thought was pretty awesome and makes me want to go back for my birthday....they had a few people with birthdays while we were there. They make a HUGE spectacle with singing to you, complete with a sombrero and a free shot of tequila down the hatch!  Oh my gosh it was sooooo loud but ya know I didn't mind it, even though it wasn't for anyone at our table it was still fun to watch and even other guests joined in on singing the happy birthday. Pretty awesome!!! \n\nWill definitely be back here :)"
        }, 
        {
            "index": 102, 
            "rating": 2, 
            "review": "No, no, no. Not for me. \n\n- They got our order wrong 3 times. \n- Forgot our requested condiments.\n- Drink refills were hard to come by. \n- Lumpy and uneven booth seating.\n- Flies! \n- Live band was wayyyy loud- sporadically.\n- Waiters were just standing around and talking. \n- Bland food!\n\nWill not be coming back."
        }, 
        {
            "index": 103, 
            "rating": 4, 
            "review": "My hubby, son and I went here to Celebrate Cinco de Mayo and give the restaurant a try since we always drive by.\n\nThe food was delicious with really good portions. They serve chips, refried beans and salsa right when you are seated. We devoured them! \n\nMy hubby and I ordered us a round of Cadillac Margaritas which were worth the $12 we paid for each. \n\nI took my time looking throught the entire menu, trying to figure our what i wanted to eat since everything sounded so good. I decided to go with the Mar y Tierra (Surf and Turf) since I was able to order from any of their shrip dishes and NY steak dishes! Best decision ever. \n\nThe atmosphere was good and the service was decent. The only reason we would come back would be for the food and drinks!"
        }, 
        {
            "index": 104, 
            "rating": 4, 
            "review": "Good food with genuine flavor, good variety of items on the menu, and the waitstaff was nice and attentive. Minor complaint--very noisy where we were seated, making it hard to have a conversation at times! \n\nAfter being in the area a few days and always seeing lots of cars parked out here, we gave it a try--figured it must be good with it always being crowded!"
        }, 
        {
            "index": 105, 
            "rating": 5, 
            "review": "Great place. Stopped by for a drink at the bar end up having a blast. There was a band playing and the singer started singing songs for me and mom. The service is great! The bartender Karla was very nice and recommended new cocktails for us to try. Havent tried the food yet but next trip over its going down."
        }, 
        {
            "index": 106, 
            "rating": 5, 
            "review": "Amazing food, great atmosphere, fair prices. This place has great tasting classic Mexican dishes. I've been coming here since I was a kid and will continue!!"
        }, 
        {
            "index": 107, 
            "rating": 5, 
            "review": "Food was delicious \nMargaritas are very good!!!\nLove the beans and salsa with chips. \nShrimp chili rellenos were awesome. \nCamarones al coñac were fantastic \nWill return next time I'm in town."
        }, 
        {
            "index": 108, 
            "rating": 5, 
            "review": "This place has an authentic mexican vibe to it. Great ambiance and the best service I've had in any restaurant in a while. The waiter and bussers are super attentive and friendly. You can tell they all care about making your experience memorable. Great food, drinks, and live music on the weekends. Great place to have a birthday dinner!"
        }, 
        {
            "index": 109, 
            "rating": 3, 
            "review": "The food was great but they refused to honor my free Margarita offer for checking in via yelp. No bueno."
        }, 
        {
            "index": 110, 
            "rating": 5, 
            "review": "This is the place for Mexican food in Vegas. We go every time we're in town for both our daughter's softball tournaments and it's always satisfying. The salsa and beans they start you off with are great. The guacamole is made table side and you choose what you want on it. Almost every plate comes with a hefty serving of guacamole as well. If you check in they give u a margarita. It's always packed hit the service is great. Your cup will never empty.. Even with the Aguas Frescas. Their food is authentic and a reasonable price compared to similar higher end Mexican restaurants in the LA area."
        }, 
        {
            "index": 111, 
            "rating": 4, 
            "review": "This place is quite good. Lunch specials that are price really well and the food is muy bueno!!  The clown room is a little creepy but I'm down with the clown today. Be careful with the beans and salsa. The salsa is great but only the first round is free after that it's 2.50. The only thing keeping this 5 star is I prefer a little dirt."
        }, 
        {
            "index": 112, 
            "rating": 4, 
            "review": "Lively atmosphere maybe too much.  Above average food but not exquisite thus the barely four star rating.  Perhaps bigger menu than needed.  At your face but not rude service that won't over sweeten you.  That said the service was still good.  The booths felt odd to sit on.  They were spaced too far back from table and too low.  Will go back."
        }, 
        {
            "index": 113, 
            "rating": 5, 
            "review": "Excellent ambience.  Cilantro steak was delicious. Service was top notch and checked in to enjoy a margarita on the house. Finished the dinner with flaming ice cream that was a hit!"
        }, 
        {
            "index": 114, 
            "rating": 4, 
            "review": "Very delicious restaurant with great service.  Our drinks were always full, the food came out fast,  and for the price it was a good place. I'm giving it 4 stats because the chips and salsa were so - so and my chicken was dry but the carne asada steak was amazing!!"
        }, 
        {
            "index": 115, 
            "rating": 4, 
            "review": "Was in Vegas for a friend's birthday weekend and looking for a place to go eat brunch/lunch at and one of our friends mentioned Bonito Michoacan, we all thought it sounded great so off we went!\n\nWhen I got there, I check in on my handy dandy Yelp App and guess what! Just checking in I scored a free margarita, how sweet is that!  But they also had a little text promo too that gave you a free margarita as well, so the table of 12 was already set with free margarita haha.\n\nThey start you off with homemade chips, bean dip & salsa, the bean dig is great, mix it with the salsa and it becomes amazing!  Just take note, 1st round of homemade chips, bean dip & salsa are complementary, additional orders are 2.99, but we were a party of 12 and there was plenty.\n\nAfter checking out the menu I went with Zitacuaro - 2 enchiladas in a Verde sauce, I picked chicken for my meat, and I have to say these enchiladas were great, the corn tortilla I believe was homemade, it was perfectly cooked, the chicken was shredded and it was moist and very good tasting, however they season/marinade the chicken was delish! The Verde sauce was delish too! One of the best I have had, full of flavor and the perfect texture. These were some great enchiladas.\n\nService was great and friendly, glad to have found this lil gem in Vegas!"
        }, 
        {
            "index": 116, 
            "rating": 5, 
            "review": "By far the best Mexican restaurant I've had in a long time I'm from Oregon and there's no good love in Oregon I need to come to Las Vegas to have some great Mexican food because they're the bomb.com"
        }, 
        {
            "index": 117, 
            "rating": 4, 
            "review": "Very good food.  Wanted to get off the Strip for a meal and this is definitely a go to place for authentic and fresh Mexican food.  Don't forget to check in and get your free house margarita. Will definitely come back when I am in town."
        }, 
        {
            "index": 118, 
            "rating": 3, 
            "review": "Found this restaurant via Yelp. The complimentary chips, salsa and bean dip was great. The peach margarita was good, but needed more tequila for the $14.00 price. The food was average. Although I purchased the group photo for memorabilia, the Photograher was horrible. Would not return."
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "El mejor comienzo para una cena en familia son unos totopos con frijoles y salsa picante... Después una media docena de para abrir el apetito y para terminar la cena perfecta una parrillada mixtanexcelente para compartir... Todo en un ambiente familiar connmusica en vivo... Apesar de que el mesero estaba un poco ocupado el bus person siempre estuvo al pendiente."
        }, 
        {
            "index": 120, 
            "rating": 2, 
            "review": "What has happened to this restaurant?  Just two years ago when my husband and I discovered it just blocks from the Rio Hotel and Casino, we were thrilled to have a great Mexican meal so close to the strip.  When we ate there in November we thought the food was not the same quality that we had just a few months before Then my daughter and I tried it in February and it was worse.  I ordered the steak Fajitas.  They arrived on a cold plate, not sizzling like they normally do.  There were 9 small pieces of beef, three small pieces of onion and 3/4 of the Fajitas consisted of bell peppers.  The Fajitas were flavorless.  No seasoning, just cooked meat and peppers.  What a disappointment.  We noticed on the menu that if you want more chips and salsa, you must now pay $2.99 for them.  What a ripoff since the bowl of chips is small and was about  1/2 full.  Ricardo's is at the corner of Decatur and Flamingo and I hear it is better thanBointo Michoacan."
        }, 
        {
            "index": 121, 
            "rating": 4, 
            "review": "Found them online, got takeout from them tonight.  One star less as they forgot a single fish taco in our order, but everything else came as ordered and was excellent. They may have the best guacamole I've tasted outside my own kitchen. Great refrieds and all else was very good. Super friendly on the phone and at pickup."
        }, 
        {
            "index": 122, 
            "rating": 5, 
            "review": "Superb service. Sat in a bar booth.  Served immediately despite a heavy Valentine's Day crowd.  Food was awesome (carnitas michoacan). Highly recommended.  Would love to eat here again."
        }, 
        {
            "index": 123, 
            "rating": 5, 
            "review": "Probably the best Mexican Food I've had, by the way I'm Mexican I eat these things all the time. We came to Las Vegas from Maui Hawai'i back in July of 2015. In Hawaii we have Mexican Restaurants but none are as good as this one. I was amazed at how authentic the food was because it really felt like home. The atmosphere was great and the service and employees were friendly. I hope to go back one day to eat here again.\n\nFINAL JUDGEMENT: \n5 STARS-----Customer Friendliness \n5 STARS-----Taste of Food\n5 STARS-----Restaurant Appeal \n4.5 STARS-----Pricing (Well worth the cost) \n4.5 STARS-----Cleanse \n\nAVERAGE 4.6-4.8 STARS but Ill give it a 5 STARS simply because its too good to be missed."
        }, 
        {
            "index": 124, 
            "rating": 5, 
            "review": "ive had great mexican food for 65 years ,i would put this place in the top 5 I have ever been too. service was great, food was outstanding, i go here every time I am in Vegas"
        }, 
        {
            "index": 125, 
            "rating": 5, 
            "review": "This place was really amazing. They have a great menu and very creative dishes. I had the fillet relleno, wash it down with a ice cold michelada and you're set."
        }, 
        {
            "index": 126, 
            "rating": 5, 
            "review": "First time i been there honesty the waiters are very nice and the food taste so good. Shrimp cocktail is alright to compare to others i have. Tostadas of shrimp are the bomb and also we had other plates which i heard they were  delicious. Agua frescas were good. I would recommend to someone else to come and eat there."
        }, 
        {
            "index": 127, 
            "rating": 5, 
            "review": "Food was amazing! Authentic Michoacan cuisine, from the sauces to the steak, it was all delicious. I had the Enchiladas Michoacanas and a Chile relleno ala carte, my husband had the Huevos Rancheros and a pollo azado enchilada ala carte. We enjoyed the food. The staff was very friendly and attentive. This is definitely the place to go if you want authentic Mexican food away from the hassle of the strip."
        }, 
        {
            "index": 128, 
            "rating": 5, 
            "review": "Great food this place did not upset especially since I'm visiting from California. I had enchiladas they were great the service was excellent food came soon after ordering they give you sopa and chips with beans and salsa while you are waiting I highly recommend this place"
        }, 
        {
            "index": 129, 
            "rating": 3, 
            "review": "I don't remember what the specific name of dessert but it was their version of bananas foster was $7 and worth it ... perfect amount of bananas ice cream and alcohol."
        }, 
        {
            "index": 130, 
            "rating": 4, 
            "review": "Firstly, I really like this place! Now down to brass tacks:\n\nFood:\nI've been here twice, and the second time was specifically because of how much I loved the food. The green enchilada sauce is amazing, as well as the citrus marinated carnitas. I had some huevos con machaca tonight (breakfast for dinner!) and it was great! Oh! The flour (have not tried the corn yet) tortillas are very good. \nMargaritas are made with fresh squeezed lime juice rather than a bottle or gun of sour mix. Very tasty.\nThe chips are very disappointing and so is the salsa. This is the only reason I could not rate it 5 stars.\n\nService:\nThis is some of the best service I've seen in a while. The staff (bus staff included) truly want to make sure that you have a great time and love every minute.\n\nAtmosphere:\nWhile the typical Mexican restaurant theme is the basis for the atmosphere, it is done well and does not feel \"cheesy.\" Pretty quiet most of the time, but can get loud when busy (of course).\n\nCan't wait to go back!"
        }, 
        {
            "index": 131, 
            "rating": 1, 
            "review": "This was me and my husbands favorite Mexican restaurant, until one day...I ordered a steak with cognac, I always order this every time we eat here, but that time they over cooked my steak...or should I say they burn my steak. I didn't noticed it because it was covered with sauce. When I sliced it that's how I noticed my steak was burn and the sauce taste burned! I called my server and told them what happened. They took my plate and When they returned it they gave me the same steak! It seems like they just washed it!!! How do I know? Because I know how it looks like and where I cut my steak! Grosssss....!!! I paid in full didn't eat the food that they gave me. Since then never go back to that place again!"
        }, 
        {
            "index": 132, 
            "rating": 5, 
            "review": "This is my favorite Mexican restaurant in Las Vegas. Great Fideo soup, enchiladas and tamales. Don't forget to try the Sophie's"
        }, 
        {
            "index": 133, 
            "rating": 5, 
            "review": "This is my favorite Mexican restaurant! The food is always spectacular, service is good, and I love the atmosphere!"
        }, 
        {
            "index": 134, 
            "rating": 4, 
            "review": "Ok it feels wrong to add stars for this reason, but I'm doing it anyways. As my coworkers have a borderline obsession with this place, I'm learning to adapt. I'm on a loose sort of \"diet\" (very strong word), I'm really trying to avoid Mexican food joints as they are very hard to eat semi-healthy at. \n\nAs I stared hard at the menu searching desparately for something I could call \"diet\".. I did notice they have a diet section, but all the food sounded bland and too well diety for my taste. I decided to try the lunch special called chicken #9 ($9.99 with soda). It rocked! It was chicken marinated in garlic, spices, chilis and it was full of flavor but light on the spice (just my style). It was served with guac, rice, beans, and tortillas (hardly diet food, but just noting you could eat this as a full calorie dish as you desire). Some of the best grilled chicken I've had in awhile... yay for a mexicn place that has something on the menu not full of lard !"
        }, 
        {
            "index": 135, 
            "rating": 5, 
            "review": "real chips, real bean dip, real mexican food!  I love this place.  The waitor is hilarious and the live entertainment is so fun!  I love coming here and I love the food!  They have great coupons and always honor them!  The lunch special is a great deal as well!"
        }, 
        {
            "index": 136, 
            "rating": 5, 
            "review": "This place is amazing, the steak ranchero, steak cilantro and the lingua are all fantastic. I moved to vegas from Texas and when I first got to vegas I was extremely disappointed with the Mexican food. Thats until I found this place, it does get crowded during peak hours but it's soooo good."
        }, 
        {
            "index": 137, 
            "rating": 5, 
            "review": "This place is the best Mexican food I've found since moving to Vegas! It's Mexican food that is up to par with my favorite Mexican food from LA. \nI'm so happy to hAve found this gem and can't wait to go back. \nI had their strawberry margarita, but the bartender told me to try the prickly pear (I think that's what she said) next time and of course I will! The chips, salsa and bean dip was my for sure favorite. Although a little more chorizo in that bean dip would make it even better!\nSee you soon!"
        }, 
        {
            "index": 138, 
            "rating": 4, 
            "review": "I'm sureee there's lots of opinion on best Mexican restaurant here in Vegas..let's review bonito Michoacan. NOT to be confused with, lindo Michoacan, that's just wrong. Atmosphere 8/10. Menu 8/10. Customer service 8/10. \nTrust me, if you want good Mexican food, I don't see how you'll leave this place disappointed, yes I've had better, but not in this city. So let's be fair, when it comes to providing all of the good stuff like tacos and tostadas, you'll find that here. I love the live music and friendly staff, adds to the experience. Get a margarita here because they do that veryyy well. Good food, good atmosphere, and nice staff...all three aren't easy to find."
        }, 
        {
            "index": 139, 
            "rating": 5, 
            "review": "This is my favorite Mexican spot in Las Vegas. The menu is extensive, with items you don't see at every Mexican restaurant, many of which are specific to the Michoacan region.\n\nRight away, you'll notice the salsa and bean dip are great. Next, you'll notice the appetizer soup is flavorful. Then, you will certainly enjoy your entree, almost all of which are memorable and tasty. What's more, if you get the tableside guacamole, you won't be disappointed.\n\nAs a vegan, I'll say you can't beat the veggie fajitas. Probably the best veggie fajitas I've ever had or heard of anywhere, which are an interesting and delicious assortment of vegetables, served up with homemade tortilas, flour or corn (you can't go wrong either way).\n\nFor out of towners, this place is located conveniently about 5-10 minutes west of the Strip and, seeing how it is miles ahead of any Mexican restaurant at any casino, it is worth the short trip."
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "Great authentic mex place! It's impossible to find food like this in NY. Well worth the visit if you're in Vegas!!"
        }, 
        {
            "index": 141, 
            "rating": 4, 
            "review": "How awesome is it you get a free margarita with just your check-in! This is not a watered-down drink...it's a delicious and refreshing blended margarita!\n\nAnyways... onto the review. As usual, I will split the review is three basic areas:\n\nFacilities: Very clean and inviting, with an authentic flair. Sitting in this restaurant makes you forget you are in Vegas! Centrally located, its a great restaurant to visit if you are in the mood for some great food.\n\nService: There is an opportunity in this area. Although our drinks were always full and bussing was prompt, the staff could have been a bit friendlier. Do not expect smiles from your waiter.\n\nFood: Probably some of the best Mexican food in Vegas. Any item on the menu is fresh and delicious! Do yourself a favor and try and try either the chicken or the steak with cognac sauce... it is out of this world!!!"
        }, 
        {
            "index": 142, 
            "rating": 5, 
            "review": "The enchiladas were great and the service was outstanding. Don't forget the jalapeño, cucumber margarita."
        }, 
        {
            "index": 143, 
            "rating": 5, 
            "review": "This place is the bomb! I've searched and searched for the best mexican food in vegas and I've finally found it!  The food is super authentic, the margaritas are so yummy and the service is amazing! Thanks Saul :) I don't live anywhere close to here but would crawl over broken glass to come back :) So yummy!!!"
        }, 
        {
            "index": 144, 
            "rating": 5, 
            "review": "Fabulous and authentic food!! Free chips with salsa and beans PLUS a bowl fideo too!! All before you even order your food! Seriously the BEST MEXICAN FOOD I EVER HAD!!! Homemade tortillas! My husband is Mexican and he quickly agreed!!!"
        }, 
        {
            "index": 145, 
            "rating": 5, 
            "review": "For me being in Vegas 30 Years now..this is the best by far all around restaurant..food..service..its always packed for that reason! Tho its quite large inside and have never had to wait. The ambiant..decor is stunning! The waiters are 1st class and can handle even the worst drunk customer with the up most class! A must try..you will not be disappointed. Everything here as far as the food is to die for!!!!  And on top of that they can satisfy any special requests too...the sopapillas are the best..I always end up ordering like 3 orders..haha!  It has a casual and refined and relaxed feel..they just got it right!!!! What else can I say?"
        }, 
        {
            "index": 146, 
            "rating": 4, 
            "review": "Consistently good food, decent prices, friendly service.\n\nBeen here twice so far...\ngot fish tacos the first time ($13.99 for 3)\nenchilada + chile relleno most recently \n\nfood has always been good, nothing to write home about and nothing amazing but definitely above average\n\nthe free salsa + bean dip they provide with chips is delicious\n\n+points for clean bathrooms"
        }, 
        {
            "index": 147, 
            "rating": 5, 
            "review": "Service is always great and the food portions are very large! As an appetizer, I strongly recommend the live guacamole. It is made right at the table, with all your favorite ingredients! Can't go wrong with any items on the menu and their oysters, margaritas, and ensalada marinera are wonderful!"
        }, 
        {
            "index": 148, 
            "rating": 5, 
            "review": "Seriously! Why would anyone ever go to Lindo.... So they can pay double for 1/2 the flavor?  Bonitos is the best.  Cheap, yummy, fun, great service! Eat here!\n\nGet the pollo sarendeado tia esther!"
        }, 
        {
            "index": 149, 
            "rating": 3, 
            "review": "Happy hour is good. Margaritas r ok. Food is and always had been outstanding. Need a bit more attention to service at the bar."
        }, 
        {
            "index": 150, 
            "rating": 1, 
            "review": "As one of the first to arrive on this Saturday morning, we were promptly seated and provided menus.  The complimentary chips were commercial grade and both salsas probably originated in a factory.  We ordered the breakfast of champions, huevos rancheros, but both dishes were slightly overcooked and unremarkable as were the accompanying frijoles refritos, salad and rice.  My disappointment was only nominally tempered by the use of a 2/1 coupon found on the RJ's website:"
        }, 
        {
            "index": 151, 
            "rating": 5, 
            "review": "Update:   Violeta, while still full of awesomeness, only works the day shift now.  If you visit in the evening Evelyn (Evie) rocks!"
        }, 
        {
            "index": 152, 
            "rating": 2, 
            "review": "I have to remember, just because its near my house doesn't mean it's gonna be better!\n\nViva Michoacan and Lindo Michoacan  have such better food an atmosphere, I've learned my lesson to take the extra time and gas and get some good food.\n Our waiter was friendly, and full of energy, he made the experience better. \nThe free tortilla chips were dark and over fried, also tasteless. The bean dip and salsa were okay, just seemed not as hot (spicy). The fideo soup was watery with about 20 noodles in it, I mean, it is so cheap to make fideo and this is what I get? I got a Soft Beef Taco and a Crunchy Chicken Taco, there was so much lettuce and shreded cheddar cheese on top I had to dig my way to my tacos. Both were edible and had a good amount of meat but didn't have much taste even after I drenched them in salsa. The crunchy taco was a little greasy. I actually thought they'd be more like street tacos since that's what I'm served at the sister restaurants.\nMy husband got the Carne Asada Burrito, but he had them add cheese and mole sauce which they gladly did, it was okay, but was still missing something...especially some heat (spice).\n\nI won't be going back, especially since there are so many better mexican restaurants."
        }, 
        {
            "index": 153, 
            "rating": 4, 
            "review": "Gotta get the Guac!!\nEverything I've had here is great, but the Shrimp dishes are the business."
        }, 
        {
            "index": 154, 
            "rating": 4, 
            "review": "By far one of the BEST Mexican restaurants I've been to from LA to Las Vegas.\n\nThey give you chips salsa, and a warm bean dip to start!\n\nI ordered the Ceviche tostada to start and my main  course was the hueto plate that included a chicken taco, tostada, and enchilada. The food was so flavorful and well seasoned that I didn't need any salsa!!! \n\nThe salsa is actually my only issue. It lacked flavor, and was a little too spicy for me and they only have spicier salsa, so I was a bit disappointed that my request for Pico de Gallo was turned down, but if spicy is your thing then this place will hit the spot!\n\nOverall it was a wonderful experience and somewhere I will ABSOLUTELY visit anytime I'm in Las Vegas!"
        }, 
        {
            "index": 155, 
            "rating": 4, 
            "review": "Ok, first time here for us here. We were greeted with fresh chips, salsa, retried bean dip and sopa de Fideo and two Free Margaritas for checking in! After another long day on the Vegas strip we worked up an appetite. I had a large shrimp and octopus cocktail that was pleasantly loaded with shrimp and octopus. The flavor was great! Same with the Asada. Service was very fast efficient and friendly. Really enjoyed this place"
        }, 
        {
            "index": 156, 
            "rating": 5, 
            "review": "Best Mexican restaurant hands down! The service is top notch and they're very welcoming, the food is the best everything my family has had has always been amazing! We live in Cali and everytime we come to Vegas we have to visit!"
        }, 
        {
            "index": 157, 
            "rating": 4, 
            "review": "Very cute little restaurant. Music isn't overly loud. We sat the bar, very clean. 2 female bartenders were very attentive. Checked in on Yelp and got the free 12 oz margarita. The Steak Cilantro was very yummy and the steak was cooked just the way I asked. Guacamole was tasty. Mangoneada we both loved. Chicken fajita    was delicious according to my bf and they weren't greedy with the chicken like some places. Restroom was clean."
        }, 
        {
            "index": 158, 
            "rating": 4, 
            "review": "My husband and I had the \"Papa Chencho\" appetizer and it was great! We had filete relleno and pollo con rajas as entrees and they were so yummy! Our server Lili and armando were very attentive and prompt. I will definitely be coming back soon!"
        }, 
        {
            "index": 159, 
            "rating": 4, 
            "review": "I ordered the Machaca con Huevos; Superb! However, the service was super slow though. Because the food is so good and authentic, I give them a pass."
        }, 
        {
            "index": 160, 
            "rating": 4, 
            "review": "Excellent meal, and quite a steal when you add in the Groupon discount. The salsa and bean dip were good. Not the best I've ever had, but tasty and they were quick to bring a second serving when we finished off the first. Very quick to take our drink and food orders, and service was quite fast. I ordered a tilapia dish to do something different from the usual burrito or combo plate, and was very impressed. Whole fish, flaky moist meat, crispy skin and a flavorful sauce. It didn't feel at all heavy for a fried item. Came with a healthy portion of rice and beans, as well as french fries? Don't understand that part but even the fries were delicious. Very reasonable price ($13) for seafood and the portion size. Everyone else at the table seemed to thoroughly enjoy their selections as well.\n\nI would definitely go back, even without a groupon."
        }, 
        {
            "index": 161, 
            "rating": 5, 
            "review": "First time in Vegas struggling to find a place to eat. Saw that Bonito Michoacan had 4 stars so decided to give it a try and I was thoroughly impressed! The service was fast and most of all DELICIOUS!!!!!!! the service was great & I enjoyed sitting next to two parties that had the staff sing Happy Birthday Fiesta Style! I'm happy and full!"
        }, 
        {
            "index": 162, 
            "rating": 3, 
            "review": "Nothing to special about the place , the portion size of the food was good but for my personal taste it needed a lil bit more flavor, the service was good even though it was packed."
        }, 
        {
            "index": 163, 
            "rating": 5, 
            "review": "Steak cilantro was amazing. Went on cinco de mayo. Being a Mexican restaurant, it was busy, but in 20 minutes we were seated and had our drinks.THE STEAK. WAS THE BEST!!!!! I had chile relleno and it was delicious and... Delish. Do not miss steak cilantro! We stuffed ourselves with guacamole and their fabulous bean dip so we were already kind of full. Totally worth the short wait. I recommend this to anyone who likes Mexican food. Large menus ensure everybody gets what they are looking for and even if they don't know, it's safe to try something new!"
        }, 
        {
            "index": 164, 
            "rating": 5, 
            "review": "Excellent and friendly staff.....the food is terrific as well. If your looking for mexican food near Sahara and Decatur don't pass this place up."
        }, 
        {
            "index": 165, 
            "rating": 5, 
            "review": "Had a large party. 15 people. Very accommodating. Great food. Great service. Good prices."
        }, 
        {
            "index": 166, 
            "rating": 4, 
            "review": "This place is great!  Huge portions, great service and awesome food.  The decor has a little to be desired here but who gives a flying F when the food is this good?  Awesome lunch specials too."
        }, 
        {
            "index": 167, 
            "rating": 5, 
            "review": "Came in during my lunch hour and it was very fast and it was very delicious. My friend asked for freshly made guacamole and to my surprise they actually make the guacamole right in front of you. It was very delicious as well. I had a chile relleno which did not disappoint me at all. It was a great atmosphere, great experience, and most of all great food. Will definitely go there again!"
        }, 
        {
            "index": 168, 
            "rating": 3, 
            "review": "Nice atmosphere and great service.  They had live music for Mother's Day which added to the experience.  Even though the restaurant was very busy, all the staff seemed to be in a great mood.  I came here expecting a great experience all together, but I can't say I did and it's only because of the fish I got.  The drink I got was a bit strong as well, but I'm not one to complain about that!  I do hope to return and give this place a second chance because I do like the Michoacán in Centennial Hills.\n\nJust don't get the garlic fish."
        }, 
        {
            "index": 169, 
            "rating": 5, 
            "review": "This is by far my favorite Mexican place in Vegas. Perhaps the entire west coast. Authentic feel from the ambience to the servers. Dishes are large and full of maximum flavor."
        }, 
        {
            "index": 170, 
            "rating": 5, 
            "review": "This is a great place for lunch.  You can have a ten minute or sixty minute lunch, up to you - the staff will meet you half way on whatever YOU WANT.  Be sure to ask for Violetta, she gives the best service and is so pleasant, you'll want to come every day.  Ask for a bowl of the special picante sauce that they make daily and be sure to get the guacamole made table side.  Other than that, get what  you are hankering for because all of the food is good.  Don't miss this place - can't beat the price/quality mix!  ENJOY!"
        }, 
        {
            "index": 171, 
            "rating": 5, 
            "review": "My fiancé and I stopped by here while in Vegas. It was delicious food with a unique taste. I ordered the enchiladas michoacanas and they were delicious, the taste was very homey and authentic. My fiancé ordered the veggie enchiladas and he loved them. The servers were attentive, helpful, and had great energy. We'll be back the next time we're in Vegas!"
        }, 
        {
            "index": 172, 
            "rating": 2, 
            "review": "The food is good, not excellent, but good. Customer service is what can take a restaurant to another level but they lack that here. \n\nNot friendly, no eye contact, they don't smile and seemed annoyed being asked for normal requests. We politely asked for more chips and for our drinks to be filled. They brought more chips but didn't bring more salsa or beans for the chips?  \n\nThey forgot about our fideo soup and asked us if we ever got it and we told them we never did. They ended up bringing the fideo soup out with our meal.  It became uncomfortable asking for service from waiters or waitresses that simply don't want to be there or help you.  Like I said, the food is good but don't expect great customer service here."
        }, 
        {
            "index": 173, 
            "rating": 5, 
            "review": "GREAT SERVICE!!!!\nGREAT FOOD!!!\nGREAT PEOPLE!!!\n\nIt's a must stop for us when we visit to Vegas. We usually take a taxi to and from our hotel/casino...this time when our server called on a taxi, they said it would be an hour wait for pick up...the lady at the counter offered to give us a ride back to our hotel/casino.  FYI we offered $$ to kind lady for the ride and she refused to take our money....THANK YOU SO MUCH FOR THE RIDE!!!"
        }, 
        {
            "index": 174, 
            "rating": 4, 
            "review": "Ok this is a nice place... The food was good, I like the flavor of the fajitas better at other places but the tortillas were good. The guacamole my daughter said wasn't as good as a few other places as too chunky for her.... I like how they had basic options like chicken fingers for kids meals though. The mole poblano got good reviews at the table and some shrimp and cheese dish was big stars. The salsa had a nice kick. \nThe waiters were great.. Very attentive, and we were celebrating so they came and sang happy birthday (comic relief as maybe they sing that no matter the occasion as wasn't a birthday and they knew that lol) they put candles in the cupcakes they let us bring in and they offered to dance with the kids to the live music. \nThey let you watch the tortillas being made and overall a positive fun experience....other places I would go depending on what wanted but if the group wanted to go there I wouldn't protest"
        }, 
        {
            "index": 175, 
            "rating": 4, 
            "review": "這家餐廳是道地的墨西哥食物，裡面的裝潢非常墨西哥式，我本人非常喜歡，偶而還有墨西哥樂團來唱歌，就好像在墨西哥一樣。而且收費也不是很貴，算是物廉價美的一家餐廳，如果你喜歡墨西哥食物，你可以來嚐嚐看！"
        }, 
        {
            "index": 176, 
            "rating": 5, 
            "review": "We loved this place!!  The service was spectacular!  The food was unique and delicious. They still had traditional items but some very creative dishes as well including beef tongue.  \nMaybe it's because we have been mostly eating on the strip where service is wakeful and the food is way over priced and bland. But this place with its festive decor and very very friendly and attentive staff really made our night! \nWe come to Vegas often and plan on making it a regular stop'"
        }, 
        {
            "index": 177, 
            "rating": 5, 
            "review": "This place is a very good Mexican Restaurant. The people here are very friendly and welcoming. I usually do work birthday parties here at this location. I always reserve a spot for 15-20 people at lunchtime and they never say no!! When its your bday they bring out a big Mexican hat and make you wear and sing Happy bday to you in Spanish. Then they bring out a nice complimentary desert. I recommend this place to anyone that craves Mexican Food!!"
        }, 
        {
            "index": 178, 
            "rating": 4, 
            "review": "It really is the best Mexican food in Las Vegas. The atmosphere is quaint, the service is friendly, and the food is phenomenal.Been searching for the best Mexican spot and I think we found it... the food had large portions and the live band was cool.. The pricing is affordable and although our waiter was useless the bus boy was great.. we are new yorkers so we know good service.. TABLESIDE GUACAMOLE IS THE BEST!!! & peach margaritas come with real peach slices, it's the best snack place!! Fish tacos weren't life changing though.Tableside guacamole that is so good. Ceviche was one of the best I have had. I thought the food was all good. Equivalent to lindo michoacan. The service was friendly.Bonito Michoacan really is a diamond in the rough out here on The West Side. It may not seem special on the outside, but the food inside is worth the drive.The enchiladas here actually do have taste. The chile relleno is also a good choice. I could even tell the salsa was homemade.It's good Mexican comfort food here, and the food shouldn't be disappointing.great mexican place good service, homemade tortillas, freh table side guacamole, good music, good margatitas! I am very pickey when it comes to Mexican food due to being of Mexican decent and enjoy finding the \"real thing\". Bonito Michoacan is The Real Thing.....love the food, atmosphere and the people. It's a great place to eat or just go and have their delicious margaritas."
        }, 
        {
            "index": 179, 
            "rating": 4, 
            "review": "Fun!\nThe experience is fun, yummy margaritas.\nThe food isn't anything that I haven't had before. I ordered one of he combinations, it was tasty but nothing crazy different from other Mexican restaurants I've been to.\nI'll be back though, it was a lot of fun and looks like a cool place for birthdays."
        }, 
        {
            "index": 180, 
            "rating": 1, 
            "review": "Waiter had an attitude, used the check in for the margarita . Oh well keep it professional and ate our food. The attitudes not necessary. Food was great"
        }, 
        {
            "index": 181, 
            "rating": 2, 
            "review": "The food is great!!! Too bad that's the only good thing about it. Customer service is BAD and with an ATTITUDE. They take too long to bring you the food but it comes with the check."
        }, 
        {
            "index": 182, 
            "rating": 1, 
            "review": "Okay Yelp, you did me wrong on this one.  This is the absolute worst Mexican food that I have ever tasted.  First of all the food is not flavorful, I had to put salt on everything from the salsa to the beans and every item on my plate.  I ordered a combo plate with a chile relleno, chicken enchilada and chicken taco.  The chicken did not have any flavor and was very dry.  The chile relleno was full of water and the sauce on it tastes like pure tomato sauce.  Overall, it was a horrible meal.  The best part about my dinner was the tableside guacamole which of course needed salt and the wait staff who were very attentive."
        }, 
        {
            "index": 183, 
            "rating": 5, 
            "review": "Found this place on accident while in Vegas! Great place! Great decor! Great food! Great service! Very authentic. Will be returning in my next visit to Vegas. I would have posted photos BUT we ate it all."
        }, 
        {
            "index": 184, 
            "rating": 5, 
            "review": "Really good service and nice people. Really good food. Especially the fresh made guacamole and menudo. I would definitely recommend it. I would come back whenever I come back to Vegas."
        }, 
        {
            "index": 185, 
            "rating": 4, 
            "review": "This is probably my favorite Mexican restaurant.  We come here often for lunch and some Birthdays. We always sit in Violeta's section and she has it together. She knows what we want without us ordering!  Margaritas and food magically appear!  The chips and salsa are delicious as is the fresh table side guacamole!  Well worth a trip!!"
        }, 
        {
            "index": 186, 
            "rating": 1, 
            "review": "Can't give lower or I would...1:00 lunch on Saturday...crowded, with a couple of big parties of 10+...My wife and I getting a couple of burritos, maybe $18.00 w/$4.00 tip...got the chips and dips, with soup to start...and that was it...chips gone, soup gone and an hour later, we were gone...nobody came to our table for an hour...our waiter was next to us, behind us, but never said a word about where our burritos were...no refills, no water, nothing...at least the gal taking pictures didn't stop and try to get us buy pictures for $10 a piece...pretty intrusive....stay away unless you want to get free chips, dips and soup and then eat your entrée somewhere else"
        }, 
        {
            "index": 187, 
            "rating": 5, 
            "review": "Wow!!! This place was a treat, I have no complaints service was friendly quick and hospitable. I was surprised when they welcomed us to our table with complimentary soup salsa n bean dip. But what really made this a great experience was the shrimp plate, I have never experienced a taste like that. I'll be back soon!"
        }, 
        {
            "index": 188, 
            "rating": 5, 
            "review": "Even better food than the Lindo location in Henderson just without the view.  \n\nConsistently good food and lively atmosphere.  Our server Mimi was awesome.  She was engaging, funny and took great care of us.  We will ask for her next time we go here.  \n\nThe food is super fresh, well prepared and plenty of it.  The tortillas are amazing and we can't get enough of them.  This is my favorite place when I want Mexican food."
        }, 
        {
            "index": 189, 
            "rating": 5, 
            "review": "came in to vegas for vacation, i ask a local were to go for good mariscos. he was dead on this place was great.  good food good service great beer"
        }, 
        {
            "index": 190, 
            "rating": 5, 
            "review": "Excellent guac, and the shrimp and avocado salad was delicious. Very busy with locals for lunch."
        }, 
        {
            "index": 191, 
            "rating": 5, 
            "review": "Good authentic food with reasonable price. They have exceptional service with live band... I will definitely come back here with my fam... Have to try their fresh  guacamole made to order..."
        }, 
        {
            "index": 192, 
            "rating": 5, 
            "review": "I visited this place yesterday afternoon with a friend. I hadn't been in years, but thought I remembered it under a different name years ago?? Anyway, decor, service and food did not disappoint. The restaurant has a very authentic feel and I love the decorations. Our server and other staff were very pleasant during our dining experience; chips and salsa and drinks never went empty. We both ordered combination plate entrees--mine was a pork guacamole burrito (excellent), a cheese enchilada, and a chicken taco. We also enjoyed the house margaritas which are offered through check in. They were so good, we opted for one more :) I would definitely recommend this place for people looking for good, authentic Mexican cuisine."
        }, 
        {
            "index": 193, 
            "rating": 3, 
            "review": "I prefer New Mexico mexican food but Bonito Michoacan has some very good dishes.  The carnitas are very good, as is the mole enchiladas.  The gratis chips, salsa and beans is a nice touch too."
        }, 
        {
            "index": 194, 
            "rating": 3, 
            "review": "I am seriously torn.  When it come to Chinese and Mexican food, I think there is a fine line between value, and rip off.  I mean if I'm eating a perfectly delicious taco for $3, how much better will it get for 6-8x the price.  I understand that at a restaurant there are other amenities, advantages, and portions are bigger, but on flavor and experience alone, is the mark up really worth it?  This place serves delicious Mexican food.  I have no complaints, service was professional, and friendly.  There is nothing wrong with this establishment.  I just feel that I would hit up one of my favorite no frills taco joints before returning here."
        }, 
        {
            "index": 195, 
            "rating": 3, 
            "review": "Love the ambiance but i think it was the ambiance that made the food taste good.  Food was on the bland side.   I got the steak fajita and i prefer the steak fajita served at Chilis. It was very bland and steak was over cooked. I mean overcooked to well done and i don't believe anybody should eat steak well done.  I will definitely be back for the ambiance and hope that the next dish I order isn't like the fajita."
        }, 
        {
            "index": 196, 
            "rating": 4, 
            "review": "I love the authenticity of the decor and cuisine. I celebrated my birthday there. It was a blast. The salsa and chips were savory and spicy and had you wanting more. The portion sizes was pretty plentiful I left with a to go bag. The waiter we had reminded us of a family member serving Sunday dinner he was laughing and joking and also very friendly. I had the \"combancion mary y tierra\" (Grilled steak and shrimp) which was DELICIOUS.... It was an enjoyable experience. I truly recommend for authentic Mexican and a good time....Try this place..."
        }, 
        {
            "index": 197, 
            "rating": 5, 
            "review": "This is my favorite place to get Mexican food. I live in Salt Lake City and make it a point to come here at least once every time I come to Vegas. The guacamole is awesome, they make it fresh at your table."
        }, 
        {
            "index": 198, 
            "rating": 5, 
            "review": "Such amazing food! I'm a sucker for Mexican food and this didn't disappoint! The service was phenomenal and very attentive!"
        }, 
        {
            "index": 199, 
            "rating": 5, 
            "review": "Came here to celebrate my Dads birthday and we absolutely loved it! The food was great and the service was exceptional! Thank you Bonito Michoacan for making our celebration a little more special there's nothing better than going to a restaurant and getting great service and great food! We will def be back!"
        }, 
        {
            "index": 200, 
            "rating": 1, 
            "review": "Went to dinner here last night for my birthday. We had previously eaten here in May, 2013. That time we enjoyed the meal very much and planned on going back again for a special occasion. This time in no way resembled the previous experience. I had the # 1 combination of chile rellenos, chicken enchilada, and a beef taco. The rellenos was covered in some generic tomato sauce and was bland tasting. The cheese was very stringy and tasteless. The enchilada was so-so and the beef taco was almost Inedible. Beef was dry and the taco shell was hard as a rock. My date had a green chile burrito that had big chunks of pork instead of shredded, the chicken taco also had big chunks of chicken instead of shredded, and her cheese enchilada was basically a tortilla rolled up with sauce and cheese on top. She didn't care for any of it. She also ordered sopapillas to be served with our meal, and they showed up 15 minutes after the entree. When we asked where they were the waitress said they were \"cooking them fresh\".The bean dip was also bland and the chips were stale. Being a Specialty Room Chef in Las Vegas for over 20 years, I know good food. My hunch is that management has sourced cheaper product to cut cost and the quality dropped immensely, or the kitchen staff totally changed and doesn't produce the same quality as the staff from last year's visit. Lastly the table in our booth wobbled and we felt like we were sitting way to low, with the table height up to chest level because of the worn out seating. Also the music could drop a few decibels. It's not a nightclub. Needless to say I would never go back. Chipotle or even Taco Bell would be a preferred dining choice."
        }, 
        {
            "index": 201, 
            "rating": 4, 
            "review": "Good, solid food- a cross between Tex-Mex and authentic Mexican, definitely a place that caters to both American and Mexican tastes- the menu is HUGE! Chips and salsa are outstanding as is the guacamole. I had enchiladas and they were awesome, beans and rice typical. \n\nVibe is great and waitstaff are wonderful. I will definitely be back!"
        }, 
        {
            "index": 202, 
            "rating": 5, 
            "review": "What can I say? Girlfriend wanted to go to a Mexican restaurant and heard some good reviews from some of my coworkers at work so I decided to give it a shot. Immediately we were greeted at the door and a booth was found for the two of us. We ordered our drinks, and then chips and bean dip and salsa (which we did not both particularly care for) sat in front of us. The fideo soup was simply amazing, and was complementary as well. She ordered the carnitas plate with beans and rice and guacamole. 10/10 for that. I ordered the Pollo Al Cognac. 10/10 has well. The carnitas was better in my opinion, but both dishes were extremely flavorful. We took our dessert home with us since after the beans, fideo soup, and our meal we were absolutely stuffed. I ordered the cheesecake burrito and she ordered flan. She said the Flan was good. I personally do not care for flan at all, so I did not try it.\n\nFood - 10/10\nService - 8/10 (merely for the fact they sat the menu down in front of us and literally 20 seconds later asked us what we wanted. Made me feel slightly rushed)\nAtmosphere - 9/10 (the live music was a tad bit loud and sometimes I could not hear by date while she was talking to me)\n\nI would definitely recommend this place to anybody looking for a good Mexican restaurant with decent prices and huge portion sizes."
        }, 
        {
            "index": 203, 
            "rating": 5, 
            "review": "I love this place I come here often and they never disappoint me  food is always fresh and yummy I get the same thing every time lol"
        }, 
        {
            "index": 204, 
            "rating": 5, 
            "review": "We came for the Preparados - also referred to as Michelada - so yummy and refreshing when you feel a little crappy after too many drinks the night before. They're very satisfying here. \nI also got the cactus appetizer which was super juicy and fresh, very large portion, too. My friend got the steak with rice and beans and the steak was super flavorful and tender. \nThe beans they serve have so much flavor and I ate them w chips over the salsa because the salsa gave me a crazy cough attack (I think a little bit of pepper was stuck in my throat) which was embarrassing and something I didn't want to happen again lol\nAlso, the service was really good. We were laughing because I would ask for something and they would bring it two seconds later. We started to think they could read our minds!"
        }, 
        {
            "index": 205, 
            "rating": 5, 
            "review": "Coming from a native San Diegan who has been exposed to GOOD Mexican food her entire life THIS PLACE IS LEGIT! Their menu had a good variety of dishes and the service was absolutely great! Boyfriend had the steak in cilantro & lime and I had the tamal plate. Everything was fresh and delicious! Will definitely be back!"
        }, 
        {
            "index": 206, 
            "rating": 5, 
            "review": "Consistently delicious! Great lunch specials and good service. Love the sopa de fidelo soup it's sooo good!"
        }, 
        {
            "index": 207, 
            "rating": 4, 
            "review": "Great food and great service, parking is tight and come prepared to wait."
        }, 
        {
            "index": 208, 
            "rating": 4, 
            "review": "Pros:\n-Service was excellent. The servers were very polite and our food came out fast. We had about 3 people constantly filling our drinks/chips/salsa/beans. Plus, they're really good at singing happy birthday :)\n-My fiance loves beans and was really excited to see they served complimentary beans with their chips and salsa. A nice touch and one I have never seen before in a Mexican restaurant\n\nCons:\n-The food was OK. I got #16 (two hard chicken tacos, all rice) and I enjoyed it, although the tacos were a little small. My fiance had a combo plate as well (hard beef taco and enchilada, all beans) and did not like the enchilada's red sauce.\n\nAll in all, the restaurant was alright and if I was in town again I might consider coming back."
        }, 
        {
            "index": 209, 
            "rating": 4, 
            "review": "Great service, great guacamole, generous Margaritas, and all around very good food.  It's the tastiest Mexican food in town and the best service too."
        }, 
        {
            "index": 210, 
            "rating": 4, 
            "review": "Their ceviche was good, but their margaritas were even better. What I loved most about this place wasn't the food, it was the service. The waiters are incredibly friendly and helpful. They make sure you enjoy your visit there."
        }, 
        {
            "index": 211, 
            "rating": 5, 
            "review": "If you go there, be prepared to eat!  The food there is delicious, and the service fantastic.  We brought our daughter for her birthday meal here, and they could not have been more gracious."
        }, 
        {
            "index": 212, 
            "rating": 5, 
            "review": "I have been there 10 plus times now and still have never had a meal that wasn't outstanding.  Best authentic Mexican I have ever had and I travel the us for a living.  Just ask the server Richard for his favorite and you will never be disappointed."
        }, 
        {
            "index": 213, 
            "rating": 5, 
            "review": "Not really much to say.... Really good food excellent customer service and one if the best wetback burrito spots in town"
        }, 
        {
            "index": 214, 
            "rating": 5, 
            "review": "The margaritas are good.... not too sweet, but not trying to drown the sweetness with too much liquor. The food took a little long, but they were busy for a Monday I thought. Once the food came out, it was easily worth the wait. I had the mojara which is a pretty traditional dish that is replicated a lot in Mexican restaurants, but is a hit or miss. It was crunchy on the outside, moist in the inside. The waitress was friendly and efficient. This location is a gem outside of the strip and I would highly recommend it."
        }, 
        {
            "index": 215, 
            "rating": 4, 
            "review": "Great spot. Love the fideo soup they bring out and the tableside guac. Good atmosphere. Friendly staff. Would definitely recommend."
        }, 
        {
            "index": 216, 
            "rating": 5, 
            "review": "OMG the best, freshest truly truly authentic Mexican food this side of the border.  The pina coladas were to die for; to die for.  The ceviche was HUGE and out of this world fresh.  Real fresh fish!  I had to leave a little to make room for the Mole Poblano which was amazing.  My husband had fish tacos and I never heard him surface for air the entire meal.  The staff is super cool, too.  Beautiful atmosphere, super authentic.  The bathrooms are so cute!!  Super clean, too.  Will most definitely go to again and again!!!"
        }, 
        {
            "index": 217, 
            "rating": 4, 
            "review": "I had a Groupon for Bonito Michoacan.  I was seated in the bar area and the bartender was my server.  She brought me chips, salsa, and bean dip quickly along with my iced tea.  She passed the empty sweetener bag test with flying colors!\n\nFirst. my dinner came with fideo soup.  It was very good with less of a tomato taste than I'm used to getting.  There was more of a chicken stock flavor.  For the main course, I ordered the Enchiladas de Mole con Pollo, two cheese enchiladas heated in a red mole sauce with a chicken breast, refried beans, rice, and some lettuce shreds and a dollop of sour cream.  The mole tasted a bit sweet at first but then I got the undertones of the other spices and the richness of the mole came out.  The chicken breast was good.  It was seasoned in any manner so I gave it a good shower of Tapatio.\n\nFor dessert, I got the fried ice cream.  I guess fried ice cream is just something that comes out of the freezer.  I don't think anyone \"breads\" and fries the ice cream in real time anymore.\n\nI was very pleased with my visit.  I was of two minds about where I was seated.  Two men were having a loud discussion (argument?) about politics in Spanish and the one had enough tecate to not know how loudly he was talking.  However, I could have been sitting in another part of the restaurant where there was a crying baby.  I think it was better where I was.  \n\nThis was an enjoyable dinner!"
        }, 
        {
            "index": 218, 
            "rating": 5, 
            "review": "This is the best Mexican food in Las Vegas it's a tradition to go eat when we visit absolutely amazing. I love the sopa aguada that they give you as a starter you must have have their refried   beans.Customer service is absolutely great always cheerful and very pleasant I don't think I will ever stop coming to this place... it's a bit far from the strip but the drive is worth it never had a bad experience  nor bad food and for that I will continue  to return!!!!!"
        }, 
        {
            "index": 219, 
            "rating": 5, 
            "review": "Hostess and Server were awesome, gave suggestions and the Cilantro steak was so delicious! We asked him to customize and it was perfectly cooked and amazing. Best place for real Mexican food!"
        }, 
        {
            "index": 220, 
            "rating": 3, 
            "review": "Pretty good place... just not into the clown decor there. \n\nOne remarkable thing is that their hand made tortillas are AMAZING!!! Especially, the flour ones... mmm mmm mmm... make sure you work out before you eat there because you will gain a good amount there."
        }, 
        {
            "index": 221, 
            "rating": 5, 
            "review": "Definitely the best Mexican Food in Vegas.  Their salsa is fresh and delicious.  Ask for the verde if you want to kick it up a notch.\n\nAll of their dishes are good, but I have fallen in love with the pollo sarandeado."
        }, 
        {
            "index": 222, 
            "rating": 5, 
            "review": "Where should I start? This place has great Mexican food for Las Vegas! The bean dip compliments the chips very well. My boyfriend and I visited this place mid November and we didn't know what we wanted to eat for breakfast. It was already passed 10am when we realized that McDonald's would stop serving breakfast at 10:30am! I decided to google some Mexican restaurants and voila'! This place is close to the Las Vegas new strip. I had the machacado plate and he had the chorizo with cheese plate. Everything was great, the customer service and the price. I will definitively be coming back here every chance I can when in town. I am from Texas and it's sad to say the food here is better than some back home. Now, you know! When in Las Vegas stop by here for Authentic Mexican Food....Only a 10 minute drive from the (new) strip."
        }, 
        {
            "index": 223, 
            "rating": 5, 
            "review": "When you come to Mexican Food, I always tell people to go to this place. Great interior and exterior color such as authentic mexican feel you were in mexico. I cant say anything bad about this place little bit of louder music who playing the keyboard in the corner. May be that's a part of mexican lol. ANyway, The very first thing you try is the Fresh Guacamole  they made in front of you and give with home made chips and the mouth watering beans ad salsa. They have a biggest verity of any mexican restaurant in the town... Their Number of stake is right on the money and their other plates are also huge.  Also, The soup they gave you before the meal is make a great appetite.  \n\nFinally, they have great magaritas and great seafood if you love to be drunk and a islander...."
        }, 
        {
            "index": 224, 
            "rating": 4, 
            "review": "Our first time here.  Loved the bean dip and salsa.  Our meals were better yet.  Recommend the Camarones Saranadeados ... Delicious."
        }, 
        {
            "index": 225, 
            "rating": 4, 
            "review": "This place is a hidden jewel to all the tourist. \nif you are looking for a tradtional authentic mexican restaurant then this is the place. the owner came from Michoacan, Mexico and they know how to cook.\n\nfrom homemade tortillas to everything on the menu. You can not go wrong with nothing on this menu.\nthey even bring you chips, homemade beans, and salsa in the beginning.\n\ni would recommend this to anyone. Great food, Great service, and TRUE mexican food."
        }, 
        {
            "index": 226, 
            "rating": 2, 
            "review": "This has always been my favorite Mexican restaurant especially for lunch. For over two years I've ordered lunch  here... never a problem. But today we ordered the green chili burritos there was literally about three chunks of meat in it along with a spoonful of beans and it was the flattest burrito I've ever seen. There was a spoonful of beans on the side and a fair portion of rice. Typically when we order and pick up we get the lunch special which includes one order of being dip and chips and a drink. Today there were  no chips ...just a container of salsa. I know sometimes things happen I hope this is just a rare occasion!  we'll give it one more shot but we were really disappointed. I hope this isn't another case of great restaurant gone bad."
        }, 
        {
            "index": 227, 
            "rating": 5, 
            "review": "The food is on on point!  I ordered the carne asada and it was a full strip steak.  I loved it.  She had the cilantro chicken and it was great.  The chips and salsa with beans are some of the best in town.  Will definitely be back.  Great filling lunch specials too."
        }, 
        {
            "index": 228, 
            "rating": 2, 
            "review": "Came here on a groupon. Had bacon wrapped shrimp. good flavors, but the shrimp was over done. Typical beans and rice. Nothing special. The food did come to the table hot. Nothing really stands out about this place."
        }, 
        {
            "index": 229, 
            "rating": 5, 
            "review": "Bonito Michoacan is simply the best. We come here every time we come here everytime we come to visit from California. Everything is absoultely delicious and we bring everyone here everytime we come. Homemade fresh delicious taste this restaraunt can not be beat. It is the best mexican food in all of Las Vegas Nevada."
        }, 
        {
            "index": 230, 
            "rating": 3, 
            "review": "We live near this restaurant which appears to always be hopping and very popular.\nI truly appreciated the welcoming and very attentive staff. Margaritas were good. My husband had camarones rancheros which come in a red sauce with beans and rice as well as a soup. I had flavorful camarones borrachas which were better- buttery garlic sauce with red pepper flakes.\nWe had very nice coffee and split a flan. \nI thought at around $18 the entrees were overpriced.\nPortions are not overwhelmingly huge which is good.\nA good solid family place- not Wow but Good."
        }, 
        {
            "index": 231, 
            "rating": 4, 
            "review": "Came here at 1pm for lunch and they are packed! We waited for 5 mins and got a table by the window, yayy love it! At first they served us the chips, salsa and bean. The salsa kinda disappointed me because its plain, tasted like chilli oil without flavor. But that's not a big deal because it's free lol can't complain about it. I ordered the New York steak Carna Asada. It was very good.  Will def come back!"
        }, 
        {
            "index": 232, 
            "rating": 4, 
            "review": "Delicious, mouth watering fajitas. Outstanding service and even better margarita's. I'm a Mexican food consumer and have eaten at many authentic places from Las Vegas all the way to mexico. So far this is good in Vegas!"
        }, 
        {
            "index": 233, 
            "rating": 5, 
            "review": "We met a local friend here at his invitation, and it did not disappoint.  \n\nCurb appeal is inviting and parking ample.  We were seated immediately and our very gregarious, personable waiter took excellent care of us from beginning to end.  \n\nThe margaritas had plenty of authority; the warm chips and salsa delicious.  Apparently, every entree includes a small cup of chicken-broth-style soup, which had a nice flavor.  We didn't see our favorite thing on the menu--a fajita combo of steak, chicken, and shrimp--but we asked and they gladly made it for us.  It was perfect, with just the right amount of char, served on a sizzling platter.  The rice was flavored superbly and the guacamole fresh and creamy.  \n\nMy only complaint is the lighting:  It glares just a bit, and could be solved easily and inexpensively with dimmer switches."
        }, 
        {
            "index": 234, 
            "rating": 5, 
            "review": "I think you'll notice in many of the reviews you see comments on how exceptional the service is at this location and I completely agree! Our server, Richard, was totally awesome and boosted this from a 4 star to a 5 star review. He was super friendly, helpful, attentive and made some bad-ass guacamole! The food was delicious and very authentic according to my latin boyfriend. The homemade tortillas were sooo good, the steak & chicken fajitas very tasty also. We had a great time and will definitely be back for more."
        }, 
        {
            "index": 235, 
            "rating": 5, 
            "review": "This place has the best food out of all their restaurants! Delicious drinks! \nThe atmosphere is so live with music, the best service, & very colorful! They all make you feel so welcomed. Juan is my absolute favorite server! He just lights up your day as soon as you see him, he's always happy & always makes you laugh! Their birthday surprises are the best! Definitely must try!!"
        }, 
        {
            "index": 236, 
            "rating": 4, 
            "review": "Pros: good mole sauce\nAttentive staff above average food\nThey bring out complimentary bean dip\n\nCons: busy on weekends"
        }, 
        {
            "index": 237, 
            "rating": 4, 
            "review": "Mexican food is a weakness of mine, especially since I'm supposed to et right for my blood type. However occasionally I will splurge and this is where I go! \n\nNow the food is always excellent and I enjoy the atmosphere and even though the prices are still higher than I think they should be its a good stop to fulfill the craving. \n\nI recently went to eat here with my husband,friend and little boy. The food came out hot and quick and they didn't miss a beat with filling our drinks. So they have great service. The only thing i wasn't found of is that the music was soooooo loud I couldn't hear my friend across the table. But that's really an observation rather than a complaint! \n\nI will I back again and bring friends."
        }, 
        {
            "index": 238, 
            "rating": 5, 
            "review": "I first became a fan of sister restaurant Lindo Michoacan on Desert Inn but Bonito is much closer to my home.  \n\nWe are \"regulars\" there so it's nice to walk in and have the waiter or waitress know your order.  \n\nTry the table side guacamole.  It's the best guacamole I've EVER had. And if you can, try to sit in Violeta's section.  She makes it even better than the other waiters. However, Juan and Jose (I think that's his name) are good waiters too.  \n\nThe veggies in the fajitas are so fresh and delicious but you can't really go wrong with anything you order here."
        }, 
        {
            "index": 239, 
            "rating": 4, 
            "review": "Busy cozy colorful place with great Mexican food at a reasonable price. Lots of  blue collar workers have lunch here. They know good food."
        }, 
        {
            "index": 240, 
            "rating": 5, 
            "review": "We just had a fantastic experience here.  OUT_SSSTANDING.  The food was excellent, fresh guac prepared table-side, excellent salsas, chips fresh from the oil, great portions, super service, super prices...\n\nThe food was delicious, fresh, our server Julio was superb...the hostesses were smiling and really friendly.  No visit to LV will be complete in the future without a trip to this place.  It was that good."
        }, 
        {
            "index": 241, 
            "rating": 5, 
            "review": "Fan-friggin-tastic. get the chicken they recommend - it's a mind blower! Menu is insanely difficult to navigate so I just asked for a recommendation and poof, it was killer good. The best Mexican food I have ever eaten."
        }, 
        {
            "index": 242, 
            "rating": 4, 
            "review": "Prices are higher now but the quality of the food is still superb. I love the seafood cocktail and the fillet relleno(don't think I spelled it right.) It's very delicious and highly recommended. Food is 5 star. One star removal for the prices but I always go. Lol."
        }, 
        {
            "index": 243, 
            "rating": 4, 
            "review": "Love the atmosphere! The waters are so upbeat and fun and the food is really good! They also have a great view of all the pretty lights from the strip. Careful though they really like to up sell."
        }, 
        {
            "index": 244, 
            "rating": 5, 
            "review": "My experience here with my family was outstanding. Our waiter was hilarious and he really took care of us. All of our food was SO flavorful and obviously cooked with care. I'm writing this review two years after the fact, so I know that I am leaving out some parts of our experience here, but all I can remember is how delicious and wonderful everything was. Go here, please."
        }, 
        {
            "index": 245, 
            "rating": 5, 
            "review": "Yum!!! I love that they serve beans with the tortilla chips. If you order a combination meal they serve fideo soup with it which is tasty! I like to order the #5 Santa Clara (enchilada, tostada and taco) with rice and beans which don't disappoint. I like the huevos rancheros too. Friendly service and fun atmosphere! The mariachi band is great!"
        }, 
        {
            "index": 246, 
            "rating": 1, 
            "review": "Truly awful.  If I had not eaten here, I would not have believed it was possible to mess up Mexican food this badly.  By comparison, Taco Bell gets at least two Michelin stars.\n\nAmbiance - A cut or two below Denny's, with Mexican colors.  The best I can say is that I didn't actually see any cockroaches.  There was some noise, which I assume was intended as music, but which sounded more like drunk UNLV students celebrating a basketball victory.\n\nService - Quick and disinterested.  In fact, quick is an understatement.  The food appeared within less than a minute, and was obviously pre-cooked and sitting under a heat lamp in the kitchen.\n\nFood - Awful, awful, and more awful.  The tortilla chips were not fresh.  The guacamole had so much lime juice that it was nearly inedible (and I LOVE guacamole).  The soup tasted like equal parts dishwater and vinegar, with a thimbleful of ramen noodles thrown in.  My beef burrito had chunks of beef (God, I HOPE it was beef) that appeared to be boiled soup meat, although the tortilla was fresh.  Even the rice and beans tasted acidic.  The portions were small (no Woody Allen jokes here, please), and the prices (by Mexican restaurant standards) were no bargain.  Don't get me wrong - $8 for the guacamole and $10.50 for each Margarita is not ridiculous in and of itself, but by the time the check came I was thinking they should have paid me to eat here."
        }, 
        {
            "index": 247, 
            "rating": 5, 
            "review": "Great authentic mexican food and environment. I have never been let down by the food and you can't beat their chips with bean dip and free Margarita with each check in."
        }, 
        {
            "index": 248, 
            "rating": 5, 
            "review": "I went the other day for lunch with a friend and was pleasantly surprised. The restaurant is very authentic with hand painted chairs and decor. I liked the chill atmosphere. I had the lunch special beef fajitas and LOVED them. They didn't get served on a sizzling plate, but they were scrumptious all the same. I also really liked the complimentary chips, bean dip and salsa. I will totally be making a return."
        }, 
        {
            "index": 249, 
            "rating": 5, 
            "review": "Searching desperately for a Mexican restaurant that stayed open a little later than 9pm on the night of my friend's dad's birthday, we settled on Bonito Michoacan.\n\nWhat we received was extremely friendly service, a lot of delicious food, and they had like a 4 piece band sing happy birthday and gave our man of the hour a free shot of tequila.\n\nI don't really see anything I could have criticized from our experience. We were seated promptly, treated well, and the food was surprisingly very delicious. Additionally, we stayed there for a good 40 minutes after their closing time and never felt rushed at all.\n\nI had the steak cilantro, whilst the others around the table had an assortment of chimichanga, a crazy gigantic burrito, and chicken helena or something along those lines. Everything was cooked really well with rich strong flavors.\n\nWe also got the hand-made table side guacamole and it was extremely tasty and fresh.\n\nAll in all it was a very pleasant experience."
        }, 
        {
            "index": 250, 
            "rating": 5, 
            "review": "People, if you are in Vegas for a few days, hire a car and get off the strip.  The restaurants are 100 times better off the strip.  I have to confess:  I have never been a fan of Mexican food until I discovered this place and Lindo Michoacan - also in Vegas city.  Admittedly, the only Mexican food I've had has been in Toronto and ... well, need I say more.  Everything at this place is good.  They even prepared (complimentary) table side guac. for us.  OMG the freshness of the ingredients is unsurpassed.  They have traditional Mexican food like pozole (one of my favourites) and chicken with wine and prunes.  I salivate just thinking about the place.  Spouse loves the chicken verde as well.  The freshness of the ingredients ... tomatillos that were not out of a can ... indescribable.  The refried beans is like silk going down.  One of my all time favourite restaurants ever.  The owners are truly nice guys who really make one feel at home.  Go there.  Tell them I sent you."
        }, 
        {
            "index": 251, 
            "rating": 4, 
            "review": "Great Mexican food off of the strip. It's a short cab ride and was recommended to me by a local. There are a lot menu items to choose from, even some that are very traditional Mexican. \n\nI had the Carne Asada which was very tasty, cooked perfectly and with the homemade tortillas were fantastic.\n\nNora, the bartender, had great service and made a really good margarita. \n\nI would recommend this place to anyone in the Vegas area."
        }, 
        {
            "index": 252, 
            "rating": 1, 
            "review": "Not sure what experience former reviewers have with Mexican food but don't believe the positive reviews. This place was awful. Carnitas are stiff and smell like old feet, bland chicken tacos, bland enchiladas. Only positives were the shrimp which were decent at best and the homemade tortillas but what good is a tortilla if there's nothing tasty to put in it. \n\nIf you're from la or sf skip and save your Mexican for cali. If you're from Vegas go anywhere else. There's no way it can be worse than this."
        }, 
        {
            "index": 253, 
            "rating": 5, 
            "review": "We were so surprised at how excellent this restaurant was. We had no idea. The food and service were impeccable. We had taken guests out to a well known steak house the night before and the food here was 100 times better than the fancy steak house. The service was much better too. The food we all had was great, the atmosphere was perfect and the music was very enjoyable. We have found one of our new favorite Mexican restaurants and the prices were great too and offer such value for the high quality food you get."
        }, 
        {
            "index": 254, 
            "rating": 2, 
            "review": "This place is just eh...\nEdible I suppose....\nSeems like their food always takes so long just to come out warm.\nThe chips and salsa are ok. \nThe service is never great but ok. Like most Mexican restaurants they just take your order, bring your food and your bill....\nI only eat here when I'm invited to join someone, never by choice."
        }, 
        {
            "index": 255, 
            "rating": 5, 
            "review": "I called all over Las Vegas and this is the only place I found so far that makes homemade flour and corn tortillas so it's definitely worth a stop."
        }, 
        {
            "index": 256, 
            "rating": 5, 
            "review": "Found out about this place via Yelp while out in Vegas with my whole family. So happy I did! From the moment we walked in to the time we left, everything was great!!! To start off, the waitress was super attentive and friendly. \nWe all got the menudo... Yummy! My sister had some type of mango margarita with chamoy that was refreshing and delicious. My dad had a michelada and swore it was one of the best. \nIt's a bit of a drive from the strip but it's worth it! \nWe will definitely be going back when on Vegas!"
        }, 
        {
            "index": 257, 
            "rating": 5, 
            "review": "This is a place that my friends from California really like to go to.  The service is quite excellent where when you get chips you get salsa as well as bean dip.  When ordering food I suggest you get the Flour tortillas to be used because they taste so much better than the corn ones where the nachos are very delicious where they don't skip out on anything in it.  I ordered the Flautas (which are nicer taquitos) and it was really really good."
        }, 
        {
            "index": 258, 
            "rating": 1, 
            "review": "Absolutely one of the 2 worst Mexican restaurants I've been to ever.  I thought maybe b/c it's in Vegas and not southern CA? It starts out with soup that tasted like freeze-dried Lipton noodle soup. None of the 3 of us ate it. We took our waiter's recommendations, and although he was efficient, he was not right.  We ordered from the Specialities, and 1/3 was good: the camarones a la cognac. Booths were too short for the table. The live music-1 guy- was okay for free, but sang American songs, which did not contribute to the Mexican atmosphere. Subsequently, 2 of us went to El Nopal restaurant in Vegas, which was excellent, and proves Vegas does have good Mexican restaurants!"
        }, 
        {
            "index": 259, 
            "rating": 5, 
            "review": "There are lots of things to do in Las Vegas, but there is only 1 thing that is mandatory on our list: dinner at Bonito Michoacan. For me it's all about the carnitas. My wife it's all about the handmade flour tortillas. A trip to Vegas hasn't even begun until we've had our fix. We just love, love, love it."
        }, 
        {
            "index": 260, 
            "rating": 5, 
            "review": "Everything about this place was amazing!\n\nFood selection and quality, service, bustling vibe, etc. Experience here will be something you never expected from a Mexican restaurant.\n\nTacos de Camarones (deep fried shrimp tacos) was super tasty.\n\nParking lot is huge, but it's always packed. You'll see why, on your first visit."
        }, 
        {
            "index": 261, 
            "rating": 5, 
            "review": "I gave up on Mexican places to eat here in Vegas. Even this place at first. But then was reintroduced to this place and it soon became the only place i'd go for Mexican food. Food is always on point here. Fun atmosphere and the best margaritas!!! Love the staff they are awesome and so is their table side guac making skills!"
        }, 
        {
            "index": 262, 
            "rating": 5, 
            "review": "Excellent chips and salsa Verde! Great device and they have a vegetarian fajitas which were very yummy!"
        }, 
        {
            "index": 263, 
            "rating": 5, 
            "review": "Great food. Great service. Our waiter Julio was excellent. Definitely coming back. I have to say that the seafood was very fresh. My wife love this place just as much as I did. We can't stop talking about the food."
        }, 
        {
            "index": 264, 
            "rating": 4, 
            "review": "One of our favorite Mexican places in town. The handmade guac at the table is delicious, entree portion size leaves you full and the Margarita's are tasty. Good service and very good family crowd. Lots of creepy clown type figurines prevents the 5 star review..."
        }, 
        {
            "index": 265, 
            "rating": 2, 
            "review": "My wife and I went here last night.  We had a shrimp dish and the carne asada.  The steak tasted salty which was weird.  The shrimp was a little too chewy.  Not great overall.  The service was good, lots of helpful guys.  The reason for only two stars was the after-affect the next morning of Montezumas revenge for both of us.  That was an experience we could have had at a roadside taco shop.  No amount of free alcohol would make me 'Vote Benito'  Thanks."
        }, 
        {
            "index": 266, 
            "rating": 5, 
            "review": "I went to Vegas on a family trip, we stumbled upon this restaurant since we wanted authentic Mexican food and it really did not disappoint. We were greeted right away by the host and seated maybe about 5min after. They accommodated our group of 8 right away. The décor is so cute and fun. Our waiter was very helpful and friendly. They bring you a fresh fideo soup for the whole table and it is warm and delicious. The Micheladas are so good and big! They have all these different types of drinks with fun names! The food is very delicious and flavorful, I ordered the carne asada, so juicy and full of flavor. I asked for the Carne Asada medium done and it was exactly how I wanted it. Everyone at the table was very satisfied and happy we came across this restaurant the service was great, food was definitely authentic, I will be coming back whenever I'm in town. \n\nAlso they take these cute pictures of your whole table that you can purchase afterwards!"
        }, 
        {
            "index": 267, 
            "rating": 3, 
            "review": "We are in Las Vegas for a convention and wanted out of the hotel for dinner, the bell desk recommended this restruant. Six of us went,  we all ordered different items and drinks.  All were pleased with their meals.  The chips, salsa, bean dip along the the guacamole, made at table side were great.  \n\nPricing was reasonable.  I would return if in town again."
        }, 
        {
            "index": 268, 
            "rating": 5, 
            "review": "We stopped by here on vacation. The food was great, service was great and the environment was great. It's well worth a stop."
        }, 
        {
            "index": 269, 
            "rating": 5, 
            "review": "Just fulfilled my craving for Huevos Rancheros. Great place. Beautiful friendly Hostess and great server. Of course I will return."
        }, 
        {
            "index": 270, 
            "rating": 5, 
            "review": "Great service and food as always. Can't go to Vegas without stopping here to recover after a long night. I had the Pollo Del Res. The veggies were so fresh with tender shredded white meat chicken. The tortillas both corn and flour are made fresh. I highly recommend!"
        }, 
        {
            "index": 271, 
            "rating": 5, 
            "review": "This place is delicious!!!  The atmosphere is very traditional and expected. The food was amazing. Had the tamal and enchilada and it was amazing!!  The wait staff was pretty quick. Our waiter was a bit inattentive but I won't hold it against the restaurant.  Definitely worth checking out!!  Next time trying the mangoneada and tamarind ma"
        }, 
        {
            "index": 272, 
            "rating": 3, 
            "review": "Went here for the first time. Food was average for las vegas mexican food, no better. I will say the menu was huge, so there could be plenty of things that are great, just don't know after one visit. The facility itself is in need of repair. It is a little on the old side and looks it inside. As for the employees, our waiter was 'Lorenzo', and if you are looking for the one single employee who has no personality, as in zero, this is you man. Holy smoke. Drove out of our way to get there, not again."
        }, 
        {
            "index": 273, 
            "rating": 5, 
            "review": "had my 36th birthday here with a party of about 10. They were very accomodating and the food was excellent.  It is not cheap but the everything was very well cooked and about half our party were natives of Michoacan so they are very very fussy about their Mexican food.  Everyone loved it. My 3 old loved the clown motif although that may not be for everyone.  The margaritas were sassy!  Great job :)"
        }, 
        {
            "index": 274, 
            "rating": 4, 
            "review": "Service was good, food was okay I'd give it 3. Stars for food and 4 for service. The guacamole was really good- got some fresh homemade tortillas to go with it. I got a veggie burrito and I heard the chicken enchiladas were okay."
        }, 
        {
            "index": 275, 
            "rating": 5, 
            "review": "Great service, friendly staff. The food is so delicious!! I Highly recommend this restaurant. It was our first time being here and We fell in love with it! We are most definitely returning when we are in town."
        }, 
        {
            "index": 276, 
            "rating": 5, 
            "review": "Have eaten at several Mexican food places in vegas great price.. excellent service excellent food.."
        }, 
        {
            "index": 277, 
            "rating": 4, 
            "review": "I really like the food here.  My standard is the Tacos con Carne Asada.  It;s very similar to Tacos al Carbon which is grilled meat, with rice & beans.  \n\nI also like the bean dip and salsa they provide for free. Refills are no problem and the service when I've there (3 times) has been quick and friendly.  \n\nThe last two times there was a guy on an electric keyboard playing which was (ahem) interesting.  Depends on your musical taste, but played a lot of cheesy 70's toons.  Overall solid choice for Mexican, I'll be back."
        }, 
        {
            "index": 278, 
            "rating": 5, 
            "review": "With a gluten free intolerance, I usually avoid Mexican restaurants, but our group of 6 heard fantastic recommendations for this place, so I went along with a positive mindset and was pleasantly surprised. Our server was not only knowledgeable of gluten, but told me with confidence exactly what menu items were safe. It seems the make all tortillas, chips, etc fresh in their restaurant and possibly the dressings as well. \n\nWith a gf peace of mind, I enjoyed a beautiful spinach mango artichoke salad with sliced jicama and raspberry vinaigrette. The best, the BEST salad Ive ever had. That say a lot for a salad!!!\n\nAll of the five gentlemen in my group greatly enjoyed their meals as well, from the guacamole made table-side to the fajitas and other authentic dishes. Delicious, delicious food with knowledgeable servers in an authentic and clean environment. Check it out!!!"
        }, 
        {
            "index": 279, 
            "rating": 5, 
            "review": "Food is delicious so tasty awesome service Eduardo our server was so nice and friendly I will definetly be coming back to this place. The ambiance is good not a long wait and great decor I'm glad I found this place while visiting from la"
        }, 
        {
            "index": 280, 
            "rating": 5, 
            "review": "This is easily my favorite Mexican restaurant in Las Vegas.  The chips and salsa are great.....both are home made and the salsa is very spicy.....just the way I like it.  It is not for the weak.\n\nMy favorite dishes are:\nQueso Fundido w/Chorizo - Basically a cheese appetizer with chorizo served on a hot fajita plate.  Comes with flour or corn tortillas....this is very good.  I order this when I take friends to this restaurant for the 1st time and every one of them agree with me.\n\nCarne Asada Burrito - Very tasty, good quality Carne Asada.\n\nInside their menu, they have a lot of dishes to choose from....not to mention an extensive combo menu where there are a lot of combo dishes.....I have tried at least 7 or 8 different combos...all are very good.\n\nWe go to this restaurant at least 1 to 2 times per month for lunch at work and 1 time per month for dinner.  The prices are very reasonable too."
        }, 
        {
            "index": 281, 
            "rating": 5, 
            "review": "Tortillas hechas a mano! Excelente service and the food is is delicious. .. great find. We came for breakfast and will be coming back for dinner."
        }, 
        {
            "index": 282, 
            "rating": 5, 
            "review": "This is my favorite Mexican restaurant that reminds me of the authentic Mexican food found in So Cal! Great prices, free chips and salsa and bean dip, I love the deep fried taco combination and the fried ice cream! Every time I go to Vegas, I have to eat here! Very fun atmosphere and lots of singing for bdays also which makes this place extra fun!"
        }, 
        {
            "index": 283, 
            "rating": 5, 
            "review": "Excellent service!\nVioletta section the best !\nExcellent food , great place to enjoy family"
        }, 
        {
            "index": 284, 
            "rating": 4, 
            "review": "Quesadillas and ceviche here are yummy!  Our server was really friendly and seemed to love working here."
        }, 
        {
            "index": 285, 
            "rating": 5, 
            "review": "This place is awesome! I can't complain about a single thing! The food is great! The people are great and its always fun! Ask for Juan as your waiter and I promise he will make your visit worth your while! We had our wedding rehearsal dinner there and it was amazing! Go there once and you will go there again for sure."
        }, 
        {
            "index": 286, 
            "rating": 2, 
            "review": "I got to give 5 stars on my 1st visit on Septemeber 2016 on our vegas trip to celebrate my daugther bday the food was excellent and the service from a wonderful lady was just amazing give her 10 stars not sure what her name was they take cute pictures and the happy bday song and the sombrero was just amazing so we where happy to have come across a real mexican place in Vegas so we decided to come once again in Nov on thanksgiving weekend they server was man with horrible service we had drinks and coronas and ask for Lemon he came back saying they where out of Lemons like really how can a mexican place the sells tacos be out of Lemons so a few minutes later we see him on a another table making guacamole and he is using LEMONS!!!!!  Ok whatever i decided to stay quiet and not say anything he will take for ever to come to our table to check up on us or for refills he was just horrible the guys cleaning up the tables where more helpfull they have funny names on their food and its a cute place and our server did not even brough us the fideo soup i had to ask for it in the end and he only came with one he was just horrible"
        }, 
        {
            "index": 287, 
            "rating": 5, 
            "review": "The happy hour here is awesome!  Great preparadas and margaritas.  The street tacos and the ceviche tostadas are bomb!!  The bartenders are all pretty hot too!  Very welcoming and give great customer service."
        }, 
        {
            "index": 288, 
            "rating": 5, 
            "review": "I have been on the search for a great Mexican restaurant ever since I moved back here a few months ago & THIS IS IT! I feel like I am in Mexico every time I go. The atmosphere is great. The staff are friendly. The place is clean. The location, super easy to find. Good parking spots. \n\nFirstly, the chips & salsa they serve when you first sit down are delicious. They also serve BEAN DIP! We always get the guacamole as well & it is made table side! Be careful not to eat too much & stuff yourself before you even order, like I always do. \n\nThe menu is so big, it always takes me a while to decide. They have a combination menu for people like me who can't decide on what to get. Last time I got the beef taco & cheese enchilada combination, which is served with rice and beans. \n\nThey also have a great desert menu! I forgot what the name was, but we ordered the Fried ice cream with bananas around it. It was delicious! Also, their margaritas are exceptionally good. \n\nDefinitely going here any time I want good Mexican food in Las Vegas."
        }, 
        {
            "index": 289, 
            "rating": 5, 
            "review": "The atmosphere, staff, and food are all wonderful. The waiter we had, unfortunately we forgot his name, but he was the best. The cilantro steak was amazing. It's a little pricey but worth it."
        }, 
        {
            "index": 290, 
            "rating": 5, 
            "review": "Never been disappointed at this spot. When we are craving Mexican food these guys are on point.  Live music tonight and everyone is in a great mood.  Servers are fast and polite even singing along in some instances\nThe food is good and portion size satisfies.  No problem with substitutions or extras.  \nFree margarita with Yelp check in is a nice touch as well.  Good place, good food, good times"
        }, 
        {
            "index": 291, 
            "rating": 4, 
            "review": "I sure like this place.  It's the \"go-to\" Mexican restaurant for meeting friends in Las Vegas.  I've been four times.  It's been excellent every time.\n\nService is outstanding.  Quick friendly seating, attentive waitstaff, and an eagerness to get everything right.  I once had a dish that wasn't as hot as I wanted and they fell over themselves to please me -- getting it exactly right the second time.  I don't eat onions.  No problema.  I want extra sauce, or sauce on the side, or extra jalapenos.  No problema.\n\nMy latest visit, with my good friend Andrei, was typical.  I had a monstrously large Caldo de Pollo (Chicken Soup) as a dinner.  Wonderfully ample white meat chicken -- at least a breast, maybe a breast and a half.  The cilantro was fresh.  The other spices delicious.  My friends garlic chicken was similarly spectacular -- even without the red peppers he's allergic to.  All the chips, salsa, and guac that you could want.  And a price that left money for our main purpose -- playing poker.\n\nI love variety.  And Las Vegas probably has more Mexican restaurants than any city, including Mexico D.F..  Even so, a trip to this city always includes a trip to this restaurant -- so sure am I of getting a high quality, reasonably priced, delicious meal."
        }, 
        {
            "index": 292, 
            "rating": 5, 
            "review": "Came here for some awesome menudo. First time ever! The service was amazing. Hand made tortillas. The Agua de Limon bombness in its self. Great for hangover food. Customer service on point. Went around 12pm and it starts getting packed. Come early for the afternoon type a feeling. Atmosphere was like you were in that setting of amazing culture!!"
        }, 
        {
            "index": 293, 
            "rating": 5, 
            "review": "This was my first visit and I will definitely return and recommend it to friends and family. The food was delicious, the prices were great, and the service was EXCELLENT! \n\nI had the beef enchiladas, my wife ordered the chile rellenos, and my sons had the shrimp fajitas and steak fajitas. Plus, we had 2 margaritas and deep fried ice cream for dessert. A fantastic meal."
        }, 
        {
            "index": 294, 
            "rating": 5, 
            "review": "Third or fourth time having dinner here. Fantastic, authentic Mexican food. Richard has been our server each time. He is friendly, efficient and amusing. I highly recommend this place."
        }, 
        {
            "index": 295, 
            "rating": 5, 
            "review": "Delicious, traditional, conventional (non-fusion) Mexican food. REALLY friendly servers. Try the Gringo challenge. If I can do it, you can too (you'll see).\n\nReally, the food was quite good, and I'm a snobby Californian saying that."
        }, 
        {
            "index": 296, 
            "rating": 5, 
            "review": "So glad we ate here and not at the over priced not real Mexican food at the strip. Super friendly staff, waiter started us out with a sopa de Fideo that was outstanding perfectly flavored broth. I couldn't make up my mind so I created my own combination plate of a carne asada sope and a chicken green enchilada. I also ordered a mangonada margarita the best margarita I have ever had."
        }, 
        {
            "index": 297, 
            "rating": 5, 
            "review": "Tasty guac, chips, margaritas and chicken mole!!  Service is always quick and friendly!  Great place to dine with friends!"
        }, 
        {
            "index": 298, 
            "rating": 5, 
            "review": "Stopped in for a quick lunch and the service was amazing.Their soup is so tasty and the food is just as good. I will for sure recommend this place for a great Traditional Mexican Meal.Ill be frequenting this stop more often."
        }, 
        {
            "index": 299, 
            "rating": 4, 
            "review": "Me and my family are regulars here. The food is good and the service is awesome, especially if you have Ricardo as your waiter. If you are a seafood lover you must try the fish enpanada with their creamy sauce on top. If you are into steak their new York strip with cilantro sauce is very good. Hubby and I really enjoy the Oyster with ceviche on top (they are not stingy with the shrimp). \nWe do birthday dinners here ALL the times because we love the atmosphere. \nFor birthdays the waiters and waitress get together and do a band like show for the birthday person, love it!\nThank you guys for a pleasant experience we will see you soon"
        }, 
        {
            "index": 300, 
            "rating": 5, 
            "review": "Yet another great experience, just when I thought it couldn't get any better...we tried the seafood combo plate..... Wow!! It was absolutely delicious. Its enough food to feed 3-4 people. We washed it all down with climato prepped beer! Another favorite of mine. Overall great food, nice atmosphere and friendly staff. I highly recommend Bonito Michoacán."
        }, 
        {
            "index": 301, 
            "rating": 4, 
            "review": "We came here with a Groupon. I was reluctant since I'm just not thrilled with the Michoacan restaurants as a whole. I find the food to be overpriced and ever so bland. But, Boyfriend wanted Mexican food, so off we went!\n\nThis location is considerably less crowded than the others. We were seated immediately and had drinks within minutes. We ordered not long after that and were eating quickly. I noticed that the menu items are cheaper than at the other locations (combination meals average $11.99, as opposed to $14). The food was marginally better than other locations, I think.\n\nI would love to go back to this location, though, because the service was phenomenal. Seriously, the best service I've ever had, ever."
        }, 
        {
            "index": 302, 
            "rating": 5, 
            "review": "超好吃！超大份！ 点的牛扒cilantro steak，真的很棒！价格也不会贵  记得爱吃辣的你，一定要问服务员超辣酱.\n但是服务生没告诉我们点得太多了......差点没撑晕"
        }, 
        {
            "index": 303, 
            "rating": 1, 
            "review": "Thats is not a real mexican food we ordered chicken mole we got grilled chicken w mole on top grilled chcken con mole l am from mexico a my wife fron guatemala and she like mole but not grilled chicken horrible  and chilaquiles con huevos estrellados the eggs was raw eggs l told them to cook om they burned and the chilaquiles w no cheese and onion Would I do not eat not recommend the place is nice But the food is not real Mexican food we never come back again"
        }, 
        {
            "index": 304, 
            "rating": 5, 
            "review": "Best Authentic Mexican Food!!  You gotta try the soups, chile verde and aquas chile! \nGreat skinny margaritas, too!  Local people come to this restaurant. You can't go wrong!  You gotta try it. No foo foo stuff here. Just real Mexican food!!"
        }, 
        {
            "index": 305, 
            "rating": 4, 
            "review": "As I was searching for another authentic Mexican food spot to try out, I decided to give this spot a try since the reviews were great. \n\nThe service was great from entering the restaurant by being greeting by the hostess and didn't have to wait for a table. Our server was very friendly and always checked up on us and right away we were served with chips, salsa, and beans. The salsa was okay I just wish it was more fresh than watery. I ordered the guacamole since everyone recommended it and it was delicious. You get to pick what you don't want in it because they make it in front of you. I went with the steak ranchero for dinner since I felt like some steak. I have to say it was made to my liking' not too salty and not too dry. \n\nCan't wait to come back here and try another dish!"
        }, 
        {
            "index": 306, 
            "rating": 3, 
            "review": "A pretty big disappointment all around. Decent location, ample parking. This is a plus. Enter, no clear host stand/seat yourself situation. We stood awkwardly waiting while people piled in doing the same. \n\nGot seated in a cute booth. Fun decor. Lighting hurts. Ceiling fans make for a strange strobe light effect. Maybe a special for Halloween? \n\nService is terrible - possibly the worst in Vegas. Our \"server\" was Israel (so says our receipt). Forever to greet us. We probably were 1/3 way done with complimentary chips (the salsa is hot, the bean dip with is excellent) before he remembered to ask someone to bring water to our table. We ordered cocktails. They came out separately. By about ten minutes. \n\nOrdered an appetizer (ceviche - pretty okay). Israel came by to ask for our entree order. We said we wanted to wait for our appetizer before we ordered our entrees. It had been a while. He gives us an \"oh yeah!\" Guess he forgot that too. \n\nOrdered our meals. A table sat down after us. They got the included soup and chip refills AND entrees before us. We had to ask for included soup - from I'm assuming a food runner - he was hustling though! \n\nOur busboy had our meals boxed for us before Israel came by to see how they were. \n\nFood was okay (pollo al cognac). Not worth going back for, when such terrible, neglectful service is \"provided\". Definitely not worth the price though. \n\nHowever, shout out to Domingo, our hardworking busboy who kept our water full and table clean. The server could learn a thing or seven from his work ethic and care for guests. \n\nSucks it's so close to home, but I'd say it's worth the drive for ANY (maybe even Bell of Taco) other mexican food in the area."
        }, 
        {
            "index": 307, 
            "rating": 3, 
            "review": "Cute decor and authentic setting. It seems like they are trying to be an upscale Mexican restaurant but the staff and setting don't agree. We ordered table side guacamole but never got it. Asked to have it removed from the bill and waiter made it out like he was doing us a huge favor to remove it. Food was pretty good, we had steak fajitas and tamales."
        }, 
        {
            "index": 308, 
            "rating": 3, 
            "review": "This place reminds me of a El Torito chain with mildly better food.  I started at the bar while we waited for our table. I ordered a negro modelo and she handed me a bottle.   I had to ask for a glass and I got my own lime wedge.  The appitizer selection was a bit week so I started with just a dinner salad.   I thought they might have some  mexican infused dressing but nope. Bottle sauces.   For my entre I had the cilantro steak.  The steak had a lot of silver skin and the steak was covered in sauce but lacked much flavor.   This is a typical gringofied mexican restaurant.   You guerro friends will thank you."
        }, 
        {
            "index": 309, 
            "rating": 5, 
            "review": "Best Mexican food! Authentic, and great customer service. I've made it a tradition to stop by before leaving Vegas!"
        }, 
        {
            "index": 310, 
            "rating": 5, 
            "review": "Everything you expect from a great Mexican restaurant.\n\nVery home-ish feel. Good food. Good service.\n\nParking lot in front of the restaurant. No wait on Saturday night for dinner.\n\nEveryone in my party had something different and it was all delicious.  \n\nWill definitely be back."
        }, 
        {
            "index": 311, 
            "rating": 3, 
            "review": "Not sold on Bonito Michoacan.  Food was mediocre.  Guacamole was wonderful- avocados freshly cut in front of us.  Sangria tasted like cheap box wine with lemons.  Shrimp enchiladas were good.  Would stray away from this place but wouldn't suggest it. Maybe better for takeout..."
        }, 
        {
            "index": 312, 
            "rating": 5, 
            "review": "We pulled thus up on Yelp and with the reviews. We decided to try it. Everything was amazing from the service to the food."
        }, 
        {
            "index": 313, 
            "rating": 4, 
            "review": "Just tried this place tonight. I liked the free margarita that they give you just for checking in on yelp. I ordered chicken enchiladas with green sauce and they were really good. They came with rice and beans. I thought that the service was good, but I didn't get asked if I wanted anything else to drink when my margarita was getting low, but that is okay. My friend ordered the steak in coca-cola sauce which was good. I think if I end up going back here, I may order this dish. I liked the laid-back atmosphere of the restaurant and the prices were good as well."
        }, 
        {
            "index": 314, 
            "rating": 2, 
            "review": "Pretty standard mexican fare. Cheesy mexican lounge singer singing christmas music added to the ambiance or something. I had the camarones al cognac which was in a rich cream sauce and quite good. My mom had some camarones a la diabla or something like that was spicy, but it masqueraded any flavor. The rice and beans were not good. The salsa was pretty good, had a good kick to it. It was okay, but definitely not the best I've had. Their menu is massive, which yields a lot of choices for groups. Standard is all I can say. And the booths are definitely not at a normal height."
        }, 
        {
            "index": 315, 
            "rating": 5, 
            "review": "Excellent service, excellent service, excellent food.  The prices are a little high, but they don't nickel and dime you for more chips and salsa.  They also have fresh refried beans with those homemade chips..  Staff was very attentive and in point, this is the kind of place that will bag your to-go portions for you.. awesome. Overall this place was very nice and I highly recommend stopping by."
        }, 
        {
            "index": 316, 
            "rating": 4, 
            "review": "The restaurant is a classic family owned mexican cantina vibe with quality food and a fun atmosphere. The menu is large and the drinks are strong. Definite a solid place to check out."
        }, 
        {
            "index": 317, 
            "rating": 5, 
            "review": "I can't write a review because I'm too busy enjoying my chamoy margarita and delicious food!! Seriously, A+ guys. I haven't found a decent Mexican food place since I moved out to Vegas 4 years ago, and this place is like a dream come to life. GREAT service, excellent margaritas, and as authentic as you can get!  I'm in love!!"
        }, 
        {
            "index": 318, 
            "rating": 4, 
            "review": "Its really Mexican food in a great ambiance. The service is A1. I had the freshest soup since I live in Vegas. The ingredients were naturals. As many places they alway serve chips with salsa. I would go again."
        }, 
        {
            "index": 319, 
            "rating": 4, 
            "review": "Better service, better food, and a LOT less crowded (although it's only Tuesday..), than their counterpart Lindo Michoacan there in Henderson.\n\nSure, sure, Lindo has the spectacular views and what not, and their food is decent but all of that gets cancelled out when you're in a packed and noisy (super kid friendly) restaurant. Moving right along..\n\nBack to Bonito!\n\nGreeted by a friendly gentleman and escorted to our table, my eyes scanned the room to observe the typical, I mean traditional Mexican themed decor; vibrant colors, cheesy artwork, and no Mexican restaurant would be complete without \"football\" on the telly. My party and I giggled at the music selection throughout our entire meal, it went from Latin Country, to Latin Classic Rock, and my all time favorite, Latin elevator music. I have saved the best for last though folks when it comes to the decor at good ol' Bonito Michoacan..THE MILLIONS OF CLOWNS EVERYWHERE!\n\nWhat's up with clowns amigos? I just don't get how creepy clowns and puppets dangling from the ceiling tie in to delicious home made guacamole and sizzling, cooked to perfection fajitas. The clowns didn't sit well with me, but luckily their food did! (*round of applause from my stomach*) \n\nIn any event, this fine dining establishment earns 4-starts on the Kim-scale-o-food-places, the fifth lacking for, well, it's no real mystery here: the clown decor (ok and I don't fancy the location either).\n\nGreat job Bonito, I'm not positive you would be the first place I would pick should the mood for Mexican food strike again, but you're for sure in my top 5!"
        }, 
        {
            "index": 320, 
            "rating": 5, 
            "review": "If you are going to dinner with another person order the Tierra Cliente. This dish comes steaming hot with chicken breast, carne asada, carnitas and chorizo stuffed jalapeños. \nWith a compliment of beans and rice you will need a to go bag and several hours of exercise to work it off. \nGreat service and hot food. Absolutely worth it"
        }, 
        {
            "index": 321, 
            "rating": 5, 
            "review": "I typically hate going to mexican restaurants because I usually leave thinking that I could have made better mexican food at home but this place totally made me feel like I was at home eating my own homemade food. Their guacamole is delicious, the beans were so good, tacos were fried perfectly and not greasy. My husband had the chile rellenos and enchilada and loved them. My son had the fideo and quesadillas, he said his dinner was \"the best\" :D Our favorite was the sopa de fideo. This is the first restaurant I have been to that offered it in their menu and it tasted totally homemade and was incredibly delicious!! Also the service was awesome, probably the best we've had in a long time. Waiters were friendly, our drinks and chips/dip were never empty, and they made sure to check in with us pretty often. Highly recommend this place! Will definitely come back next time we are in Vegas!!!"
        }, 
        {
            "index": 322, 
            "rating": 5, 
            "review": "Another great meal (and I ate too much!). Service was great, nice atmosphere and live music that is not obnoxious.\nThis is an main stay for Mexican food with plenty of options to choose from.\nGreat margaritas!"
        }, 
        {
            "index": 323, 
            "rating": 2, 
            "review": "Received free margarita for checking in, so decided to go here for Cinco De Mayo. The margarita was served on the rocks in a very small glass. We could not taste any liquor in the drink,  and noticed other folks paying for their drinks had full size glasses. We've been traveling the southwest (new mexico, arizona, california and west tx) for a month eating at a different Mexican restaurant every day and this place is nothing out of the ordinary. The flour tortillas tasted store bought and the green chili verde was gross, pork rubbery not falling apart like we are used to. The chips, salsa and bean dip are served complimentary, but did not wow us. Our server Lorenzo was arrogant and acted as if we inconvenienced him. Worst food we have had in a month. We will not be back. Go to Yuma or Tucson for some really great authentic Mexican cuisine."
        }, 
        {
            "index": 324, 
            "rating": 1, 
            "review": "Walked in and was greeted by friendly faces, assigned a table, drinks brought. I waited for the waiter ... And waited ... Had to get someone to get him. Party of 5 by the way. Finally he shows up, waited for my food ... And waited .... I liked the food wife did not like her's. Finished my\nFood. Check was brought promptly.  Waited for him to come get the card to ring me up ... And waited ... And waited ... Wife left with two of my three kids .... I still waited ... And waited ... And waited. One of my kids fell asleep cause im still waiting  and waiting .... Still wai.. Zzzzzzz ... Zzzzzz"
        }, 
        {
            "index": 325, 
            "rating": 2, 
            "review": "Came here for Mother's day 2014. Sign said open at 9am, but the doors were still locked.  As we were walking a lady said the door will open shortly.  9:15 the door finally open, guess who opened the door...yup the lady that was walking from her car.  Can you say getting to work late?!\n\nAnyways we order chilaquiles, one with red sauce and the other with green sauce with eggs.   It was okay.\n\nTwo kids plate,  one had a long hair in the rice. Yuk as my daughter commented.  They comp one of the kids meal and gave her a plate of new rice.\n\nJulio did an excellent job, but the women Griselda (i think that is how you spell her name) was rude. She didn't acknowledge when we ask for things and her body language came across very negative.  What a disappointment since it was our first and probably will be our last time here. \n\nThanks for an unforgettable start to mother's day. \nGlad we still have the entire day to make more memories."
        }, 
        {
            "index": 326, 
            "rating": 5, 
            "review": "This place never disappoints! Food is always fresh, customer service is always the same. Same friendly faces all the time. I come to Vegas for business every month and always look forward to breakfast and dinner here. Definitely a customer for life!"
        }, 
        {
            "index": 327, 
            "rating": 4, 
            "review": "I'm back at it again with the yummie Bonito.. I really like this place with the happy hour and the drinks are great. I love coming here it reminds me of the real deal LA food. I've been to other Mexican restaurants but this one just makes me want to come back for more. \n\nThe service is great. When we go there we try to go during happy hour. I always have to order the Ceviche, Street tacos (carne asada, carnitas and pastor), sopitos and Toreados con chorizo. The hubs just shares with me but like to order the guacamole and chips. But the drinks oh man I get the Paloma and margarita.  The hubs get the beer. The tacos are delish, reminds me of LA taco trucks. Love the home made sopitos.  It is made in house which is amazing. The Treados con chorizo is good but I think I would rather just have cheese but then that would be called Chili Relleno. Good stuff this place has. With great happy hour price can't beat that for Mexican food."
        }, 
        {
            "index": 328, 
            "rating": 4, 
            "review": "A nice mexican restaurant!!! Very good food!!! Our server donal was very kind and funny, litle bit loud cause of the tv , but is ok"
        }, 
        {
            "index": 329, 
            "rating": 3, 
            "review": "Este restaurant no tiene el servicio excelente como dice la gente como es posible que una soda de maquina la vendan en $ 2.50 cuando es casi solo agua y ni si quiera  rellenan"
        }, 
        {
            "index": 330, 
            "rating": 3, 
            "review": "I'm surprised by all of the 4 and 5 star reviews for this place. I found the food to be very blah.\nLet me first say that the service was excellent. The servers were so friendly and checked on us often. If it weren't for them I would have given 2 stars.\n\nThe meal started off with chips, salsa and bean dip. The bean dip was ok but the beans really had no flavor and were very runny. The salsa was horrible.  It was also watery thin and had a weird flavor. After what I heard about this place I was excited to try the salsa but I prefer a chunky fresh salsa and this tastes like something from a can.\n\nThen came a cup of Fideo Soup for us. This was tasty and it had a lot of noodle in it. \n\nFor my meal I had the #4 which consisted of a cheese enchilada, beef taco and a bean tostada with guacamole. Blah blah blah! The enchilada had barely any cheese in it and the sauce they put on top was as nasty and weird tasting as the salsa. The beef taco was cute and small but the beef had no flavor. My tostada had beans and tons of lettuce.. The small of guacamole I had was actually very tasty. I would never order this again I just didn't care for it and the taste. I could have done with out all the lettuce and had more of the other stuff on it.\n\nMy man had Fajitas and he said they weren't as good as Ricardo's or Cabo but he said they were decent. I tried a piece of his flour tortilla and I have to say I should have just ordered a stack of those and some guacamole because the tortillas were good. And the tortillas weren't small either they were a decent size.\n\nThe pic I took and posted on here looks way more appetizing then it really was. I tried to like it but I just honestly didn't :(\n\nThey had a man singing live music which was a nice touch. and happy hour specials  but during happy hour a margarita is still going to run you $4.50.\n\nI don't see when we would be back here since there are other yummy Mexican places around town and especially with Ricardo's just down the street."
        }, 
        {
            "index": 331, 
            "rating": 4, 
            "review": "Good food and great portions. They keep the fresh tortilla chips with beans and salsa coming. I got the pollo con rajas y crema, which was freaking awesome. Oh, and you get a free margarita if you check in."
        }, 
        {
            "index": 332, 
            "rating": 5, 
            "review": "Great Mexican authentic food. Read about this place and decided to try it next time I was in Vegas; It's like El Toritos Mexican food but better.  The hot bean dip they bring to the table is good.  I ordered the chese enchilada and beef taco hard shell you don't see hard shells these days anymore.  Service and ambience were good. I would return next time in Vegas."
        }, 
        {
            "index": 333, 
            "rating": 5, 
            "review": "Awesome!  Had their steak cognac and it was killer.  Great service too."
        }, 
        {
            "index": 334, 
            "rating": 1, 
            "review": "Well, I think I know why their other location closed down...\n\nWe had very bad customer service this time around. We have been to the other location that got closed down (Viva Michoacan in Henderson). It took forever for them to take our order, the waiter forgot about my guacamole & sour cream, they forgot to refill my boyfriend's soda and my friend pronounced the very long Spanish word that supposedly earned him a free margarita...which they never brought.\n\nYes, I'm Mexican so let me say that the food is mediocre. I think you'd had better luck going to Pepe's Tacos down the street. The beans needed salt and. I felt that they were like Rosarito beans that you get from a can and just heat up. I don't understand why all their burritos are smothered in sauce and cheese. that's more of a enchilada...and if I wanted an enchilada I'd order one. A burrito is meant to be eaten with hands, not with a fork."
        }, 
        {
            "index": 335, 
            "rating": 5, 
            "review": "Amazing Food and Experience! Took 4 others with me to celebrate my birthday. We made reservations earlier in the day for 6:30pm. We walked in and were sat immediately. They had a Yelp checkin that offered us a free margarita so we all checked in and got some. Our Servers were Awesome and they care very much about making our experience with them Wonderful. They sang to me with a band of fellow servers and gave me dessert and tequila slammer to top it off.\n\nNeedless to say we Highly recommend Bonita Michoacan!\n\nMust try the carnitas and Enchiladas with green sauce."
        }, 
        {
            "index": 336, 
            "rating": 4, 
            "review": "Very good food and great portion:price ratio. -1 star for slight inconsistencies at every visit. Sometimes the beans are more runny, and sometimes the salsa is more watery than other times. Sometimes the Chile relllenos are completely stuffed with cheese, and sometimes there's much less. When. It's very busy and they have large parties, the smaller tables can be forgotten about regarding refills. Minor things like this can be easily overlooked because the taste and quality is always great and staff is always friendly."
        }, 
        {
            "index": 337, 
            "rating": 5, 
            "review": "Today we decided to have Mexican food for lunch.  We have been here before, but I have never reviewed this restaurant.\n\nWe started out with the chips and salsa along with bean dip.  I could actually make a meal out of these alone, but I paced myself.  Unlike my last review I was able to get my favorite Raspberry Iced Tea, and it was delicious.\n\nMom had a Chicken Chimichanga, our daughter had a Steak Burrito, and I ordered a Chopped Beef Burrito.  All of them came with the usual rice and beans.  We ordered a side of Guacamole and to our surprise, our server Lorenzo brought out all of the ingredients including the fresh avocados and began to prepare it right there at our table.  He seasoned it just to our liking and wow, delicious.\n\nMom and I spooned the fresh guacamole on our burritos, mmm, a nice added spice to an already delicious burrito.\n\nLorenzo was a great server, very attentive to our needs, and of course, our drinks never went dry.\n\nOverall, Bonito Michoacan is an excellent restaurant and we will certainly be back."
        }, 
        {
            "index": 338, 
            "rating": 4, 
            "review": "We are from LA where thiers an abundance of Mexican restaurants,, but when we leave it's seams hard to find a decent restaurant that's authentica Mexicana. This hidden gem of the strip tailors to the local clientele.  What a treat it is. They would of gotten a 5 star from me but. Customer service is a bit busy. This restaurant can probably hold 200 plus. And frequently they do. So food is great! But service is slow. Try the homemade gugamole, just like mom made at home right in front of you ( table side.) Thanks Vegas coming back soon again."
        }, 
        {
            "index": 339, 
            "rating": 3, 
            "review": "Good authentic Mexican food. Huge servings and good flavor. My only issue was the service. Our server was not very friendly and honestly seemed impatient with us when we placed our order. The hostess was nice when we walked in but just the server was not nice. \n\nI enjoyed my Posole and enchilada. Oh and the free chips and salsa were very good too. They also give you free bean dip. \n\nWe did get a free picture with our meal. The girl was trying to sell us photos but when we opted out she gave us our free picture and also seemed annoyed. Oh well. \n\nFor the food in itself I would probably go back but wish the service was better."
        }, 
        {
            "index": 340, 
            "rating": 4, 
            "review": "Great food. Good drinks. Closest to my mother in laws home cooked meal that I have found. Love the live music on the weekend. Great place for large groups.my favorite is the menudo on the weekends. The shrimp cocktail is yummy to."
        }, 
        {
            "index": 341, 
            "rating": 4, 
            "review": "I really like this place. We come here pretty often and never really have a bad meal. Service is hit or miss, but we usually have a good time. My favorite dishes are the green pork burrito, whole fried fish and menudo. The salsa is good and spicy too."
        }, 
        {
            "index": 342, 
            "rating": 4, 
            "review": "We've been coming here for a couple years now since we found it. The environment is colorful and culturally authentic to the food. Although I haven't quite yet figured out how the dolls & clowns play into it but whatever, it's fun to look at. \nThe staff has always been very friendly and on point with their customer service. My glass is never empty, the buss boys are like ninja re-fillers. \nI love that they do table side guacamole and you can make it as mild or spicy as you like. Chips, salsa and bean dip come to the table when you first sit down. \nOne of my favorite dishes here is their fajitas. Shrimp and/ or chicken. The tortillas are home made, you can't beat that! Fideo soup usually comes with an entree. I always add a little salsa for a kick. \nIf you're celebrating a birthday be sure to let them know. They'll come on over and sing in English & Spanish. \nWe always save room for some sopapillas too."
        }, 
        {
            "index": 343, 
            "rating": 5, 
            "review": "Bonito Michoacan - \nConsistent excellent service, food, and affordable selections. (I'm getting hungry just thinking about your menu)\nSo this is what we are experiencing. We like to take our visiting guest out to a nice dinner (affordable). Throughout the years that we have been taking our guest to your restaurant, you have never let us down. \nSo now, we have created clientele for you driving in from the Bay Area, California wanting to dine at your restaurant. \nWe will see you soon as our California family member wishes to celebrate her 17th birthday at your restaurant. \nThank you for all the great food, awesome service, and the smiles you bring to my family."
        }, 
        {
            "index": 344, 
            "rating": 5, 
            "review": "I love love LOVE this place!!!! Great authentic Mexican restaurant.  Every time I'm in Vegas I make sure to stop here for some yummy food."
        }, 
        {
            "index": 345, 
            "rating": 5, 
            "review": "Our favorite Mexican restaurant of all time. We've been going here for 10 years and never had a bad experience. Table side guacamole is delicious and neat presentation made in front of you.  I've tried about everything and loved it. Lorenzo or Julio take great care of you."
        }, 
        {
            "index": 346, 
            "rating": 5, 
            "review": "Real authentic Mexican food. If your looking for something off the strip and want a family style restaurant, this is the place to be!"
        }, 
        {
            "index": 347, 
            "rating": 5, 
            "review": "I was having a bad day and was in a horrible mood. Came here to eat and relax with my girlfriend. Juan totally turned my day around, he was the best server I've had in a long time. He Turned my night around and I left in a better mood. Food was good, price was affordable. I will be back again!"
        }, 
        {
            "index": 348, 
            "rating": 5, 
            "review": "Free Margarita with check in.  I got the steak with cheese enchilada, rice, and beans.  It also came with your choice of tortillas.  The complementary soup of fideo was to delicious!!! I would come back here again.  There are TVs throughout the place for game action too."
        }, 
        {
            "index": 349, 
            "rating": 2, 
            "review": "Granted there were two large parties in our area, but service was extremely slow and inattentive. The food was ok, nothing extraordinary, but not bad. We waited 19 minutes after we were visibly done with our meal for our waiter to finally come back by and ask if we were ready, then it took probably another 10 minutes to get our check give him the card and get it back. I went in at 8pm thinking it could be a nice quick dinner and took almost 2 hours for 2 people..just seems ridiculous to me."
        }, 
        {
            "index": 350, 
            "rating": 5, 
            "review": "Superb Mexican food.  Although we had to take a cab there and we wanted to stop at the market before returning to our condo, the drove us to the market.  They did say that the sometime pickup and return customers to the strip, but not sure of details."
        }, 
        {
            "index": 351, 
            "rating": 5, 
            "review": "This restaurant has a very welcoming and casual atmosphere and the hostesses and waiters are very friendly. For starters, complimentary fresh fried tortilla chips are served with warm bean dip and red salsa or you can request for the spicier habanero salsa which I love. They also give you a complimentary small bowl of fideo soup to wet your appetite. For appetizers, we ordered the beef sopitos which were very juicy and delicious topped with guacamole and sour cream. If you checkin with your Yelp account, they give you a free margarita! I always end up getting full just from the the complimentary appetizers, so save room for the delicious entrees. \n\nFor dinner we ordered the Carnitas Michoacanas and the Chicken Mole Poblano. The carnitas were cooked in spices and were very succulent and tasty. They are served with a green salsa and a spicy charred jalapeño, yum! The chicken mole poblano was juicy and served smothered in a flavorful, mildly spicy and sweet brown mole sauce, so good! Both entrees are served with Mexican rice and warm beans topped with cheese. \nAlso all of the entrees come with freshly made corn or flour tortillas that are warm and delicious. We always leave here stuffed, satisfied and with leftovers because the portions are huge!"
        }, 
        {
            "index": 352, 
            "rating": 5, 
            "review": "Every time I'm in town I try to swing by.\nI love the locals vibe. \nThe bar is fantastic!!!!"
        }, 
        {
            "index": 353, 
            "rating": 5, 
            "review": "This place caught my eye Becuase of its colorful exterior building design outside. I mentioned this place up to my girlfriend ,and so she decided to take me here on a Sunday lunch. We had this excellent waiter which I totally forgot his name. But he was very friendly and explained everything on the menu. We checked in on Yelp to receive our free margaritas which was awesome. He only downfall about this place was just the ceviche tasted a little watered down but my main dish made up for this restaurant. The steak was really juicy with my side of salsa to balance the flavor. Complimentary chips and salsa of course is the best."
        }, 
        {
            "index": 354, 
            "rating": 5, 
            "review": "The best in Vegas by far. This is where the locals go for Mexican. Many different dishes not just tacos, burritos etc. Many seafood dishes.  Service was exceptional. They make the to taste right at the table.  Drinks are also good. As an added attraction there is a lady making tortillas right in the front. Not the easiest place to find but worth the search."
        }, 
        {
            "index": 355, 
            "rating": 5, 
            "review": "Had lunch here yesterday before heading back to LA. Ordered camarones a la diabla. Service was great."
        }, 
        {
            "index": 356, 
            "rating": 5, 
            "review": "My 2 friends, son (toddler) and I ate here about 2 weeks ago and we loved nearly every minute of our lunch! We had the cerviche and shrimp cocktail for appetizers and they were both awesome.  I wanted street tacos but I guess that's only during happy hour but the tacos I had were decent. I really enjoyed a much needed Michelada as well! Our sever was really great, I'm kicking myself since I can't recall his name (blame the memory issue on the 1 Michelada) but it was like he knew what I needed just before I asked for it. We will be back and I'm very happy to see that the quality of food or device hasn't gone down over the years! Gracias!!"
        }, 
        {
            "index": 357, 
            "rating": 5, 
            "review": "Came here again and as per usual, the food is great and so was service. Unfortunately our eyes are bigger than our stomachs so we didnt manage to finish our meals. If we had a fridge and microwave in our hotel we would have taken home the leftovers.\nThe tableside guac is a nice touch and made to your tastes."
        }, 
        {
            "index": 358, 
            "rating": 5, 
            "review": "This is a must stop every visit to Las Vegas, the bacon wrapped is the bomb. Great food all around and great Margaritas."
        }, 
        {
            "index": 359, 
            "rating": 3, 
            "review": "Slow service.....food was good, but waited 30 min to get check AFTER credit card slip was signed. Then found waitress having a lunch break when I went to ask what was taking so long."
        }, 
        {
            "index": 360, 
            "rating": 5, 
            "review": "I recently moved from Cali and was looking for some bomb Mexican food. I definitely found it here. The whole family was pleased. They give you chips, salsa and beans as soon as you sit down. Than they bring you tomato Fidel soup. Oh my so yummy. The customer service here is off the chart. all the way around."
        }, 
        {
            "index": 361, 
            "rating": 4, 
            "review": "Chile relleno was excellent.. Free margarita with check in.. You know a Mexican restaurant is excellent when over half the customers are Latino..."
        }, 
        {
            "index": 362, 
            "rating": 4, 
            "review": "Place is fire.. The atmosphere is a bit loud but food is amazing. Ceviche extremely fresh and the steak is on point"
        }, 
        {
            "index": 363, 
            "rating": 5, 
            "review": "I'm not going to claim \"I know REAL Mexican\" - who's to decide what is?What I will say is this is my favorite Mexican restaurant. They have one of the best Moles I've had.  Recommend the Pollo sarandeado Tia Esther and the buckwheat noodle soup."
        }, 
        {
            "index": 364, 
            "rating": 5, 
            "review": "My husband and I found this restaurant through Yelp's reviews as we were looking for Mexican food off of the Strip. This was, by far, the best Latino food that we have ever had. The atmosphere was great and everyone working there greeted us warmly and were very friendly throughout. There was a Mariachi band playing, but not too loud, and everything just felt comfortable. The decor was bright and festive, but it was not over the top. The thing that we noticed first was that almost everyone eating there was Latino, and that, to us, is always a good sign of authentic food. The food did not disappoint. Everything was so good overall that we came back the next day for lunch before heading back home-- just to get another taste of it. The best of what we tried: the oysters (I am not a fan but my husband ate the heck out of them happily), the cheese fundo, and the guacamole. The warm, homemade tortillas were the best tortillas I have ever had as well, and if I could somehow magically have them at my house every day, I would be eating a steady diet of them. All in all, a good value for the money, a nice experience, and wonderful food."
        }, 
        {
            "index": 365, 
            "rating": 1, 
            "review": "Great atmosphere, but that's where it ends.  The dips were okay, not the best salsa.  The rest of the food was terrible.  The red sauce was like someone opened a can of tomato sauce and poured it on top.  not the worse Mexican food we've had, but close."
        }, 
        {
            "index": 366, 
            "rating": 4, 
            "review": "Love the Mexican food here, went this weekend with my in-laws and they loved it too. Some friends of ours introduced us to this place and were hooked. Mexican pizza is delicious."
        }, 
        {
            "index": 367, 
            "rating": 3, 
            "review": "I always get the same thing at Mexican restaurants, shredded beef taco and chicken enchilada with rice and beans. I've eaten here about 3 times and I think I keep going back because of their lunch specials. Their rice and beans is not the best. Sometimes when the main dish sucks, I can just fill up on rice and beans and be ok with that. But not here. They do have good horchata and my boyfriend absolutely loves this place. I don't know, just me I guess."
        }, 
        {
            "index": 368, 
            "rating": 5, 
            "review": "We celebrated my wife's birthday here and the waiter got the mariachis to come sing Happy Birthday in Spanish and English and put a big sombrero on her head while she downed a shot of tequila mixed in lime juice. I recommend the 16-ounce rib eye with a bone. We only went here because the one on DI was closed for the employees Christmas party."
        }, 
        {
            "index": 369, 
            "rating": 5, 
            "review": "Love the Margachela (margarita) and their service! Look for Julio (attendant) and Jose (food server) you will love your time there and the cozy atmosphere and the very cultural ambience and wood carved, painted chairs and tables. Lovely tine and friendly people!"
        }, 
        {
            "index": 370, 
            "rating": 5, 
            "review": "I love this place! Great service, food and usually there's fun music. Ask for the extra spicy salsa (not just the habanero one) because it's delish! \n\nIt's a go-to for date night when we don't want to spend a bumch of money."
        }, 
        {
            "index": 371, 
            "rating": 5, 
            "review": "My favorite Mexican restaurant in all of vegas. Great customer service, awesome energy, easy parking, and hands down the tastiest Mexican food every time I go!"
        }, 
        {
            "index": 372, 
            "rating": 5, 
            "review": "Proud to make this my first ever Yelp review. This place is one of the few restaurants I've ever been to that give you a full on \"experience\" from beginning to end. A group of friends and I in our travels dropped in due to a free margarita promotion and the party started with our awesome waiter, Richard. Then I - a black guy - took on the Gringo challenge (not spoiling it, go and take it on yourself) and got another free drink! The food was top notch and pardon the misogyny but the ladies are gorgeous too, please respect them as they want to make sure your time there is optimal with pictures and drinks as well. I'd type more but the tequila is working  go here!!!"
        }, 
        {
            "index": 373, 
            "rating": 5, 
            "review": "What can I say.. Excellent customer service.  The food was  delicious.  It was so worth the money.  Authentic Mexican food.  I haven't had any Mexican  food that tastes like this in years! I highly recommend visiting this place"
        }, 
        {
            "index": 374, 
            "rating": 2, 
            "review": "1) long wait to order\n2) long wait for food after ordering\n3) 3 out of 4 meals were cold\n4) salsa and bean dip were pretty good. \n\nWe ate-\nCarnitas- (pile of meat. Not much else)\nSopes- looked ok. But was cold\nChile Rellano de camarone- cold chile rellanos aren't very good\nChicken burrito- cold. Not much flavor. \n\nYes, we could have sent cold food back. But after the wait, we were pretty much ready to eat and leave."
        }, 
        {
            "index": 375, 
            "rating": 4, 
            "review": "This place had really friendly service. The food came out fast and hot. The food was great especially the fresh guacomole that they make infront of you, just the way you would like it."
        }, 
        {
            "index": 376, 
            "rating": 5, 
            "review": "The husband and I came here on a whim because I had an overwhelming craving for Mexican food. We searched via yelp and luckily were just down the street. \nJuan might be the best server we have ever encountered- he was fun and personable. The food was authentic Mexican, genuine Michoacan flavor! We had the carnitas plate and eggs with shredded pork, highly recommend both dishes and this restaurant. We've decided to make this a tradition and stop here every time we come to Vegas!"
        }, 
        {
            "index": 377, 
            "rating": 5, 
            "review": "Seriously good food, and great service!  Very authentic,  and they made stuff for our group that wasn't even on the menu!"
        }, 
        {
            "index": 378, 
            "rating": 5, 
            "review": "By far one of my favorite Mexican restaurants that I've found here in Vegas. Traditional Mexican food. First time here and thus far I'm loving it. Great atmosphere, great service and beast of all great quality food! I'll definitely be frequenting this place more often. Thanks Saul for your service! My only complain... homemade tortillas yes..... but though to eat."
        }, 
        {
            "index": 379, 
            "rating": 5, 
            "review": "OMG I'm in LOVE with this place. I grew up and lived in this area and have been going to Bonito Michoacan for years. It's the best mexican restaurant that I know of in Las Vegas. I always start off with thethe part. Their steak pacado is my #1 dish!! \n\nI love this place so much that everytime my husband asks me where we want to go on my birthday I choose Bonito! MMM! 5 stars all the way!"
        }, 
        {
            "index": 380, 
            "rating": 5, 
            "review": "We've been going to Bonito's for a few years and I'm not sure why I haven't added a review yet.. Anyways the food is great, the staff is friendly and it's a fun place to go.  Juan the waiter is a superstar and I think he has quite a following.  Always hugs both my husband and I when we arrive and leave.\nThe guacamole made at your table is so good, and last night I tried their ceviche for the first time and that too was yummy!  Of course the margaritas aren't bad either!  Love this place!"
        }, 
        {
            "index": 381, 
            "rating": 3, 
            "review": "Parking here is super easy! If you go left when you walk in you'll see a full bar and they do karaoke! If you want it a LITTLE more quiet sit on the right side. My hubby and my daughter went with another couple who also had a 3yo and they had an easily accessible table for the 6 of us. Us ladies ordered frozen guava margaritas which were veeeeery tasty and the consistency was very smooth. I'm usually a rocks kinda girl and I'm truly not a guava fan but I tried hers and needed one too!!! While we were deciding our server brought out sopa de fideo for the kids which was nice because we didn't even ask!\nNow to the food! With the location of this place the prices surprised the hell out of me.....I'm not saying it was über expensive but the average was probably $15 which is a little out there for a Mexican restaurant IMO. Every meal comes with chips, salsa, and beans and the sopa. I had birria de chiva which is goat cooked in a red sauce or was pretty delish! Hubby had a shrimp/octopus coctel it was the usual nothin special. The other couple had an enchilada and then shrimp fajitas. All pretty ordinary. I did see they make guacamole table side and got to watch another table have it made it looked pretty cool!  We were too full for dessert... \nService was good\nDrinks were awesome \nThe food...nothin special.\nWill I return, yes! I think I'm gonna try somethin different/unique so they can change my mind a lil :)"
        }, 
        {
            "index": 382, 
            "rating": 5, 
            "review": "*The BEST Fideo soup. Ever. \n\nMy favorite Mexican Food place in town, hands down. Better than Viva Zapta's, Roberto's and some of the more expensive places. They give you free chips, salsa and bean dip from the get go. If you order an entree they bring the tomato/noodle (fideo) soup out pre-meal as well. The enchiladas are fluffy and cheesey and the enchilada sauce isn't so strong or greasy it gives you heartburn. The 'Mexican Pizza' appetizer is awesome, very crunchy with light fluffy chicken (or beef if you choose) on top. They'll make guacamole right at your table for like $7. It can get a little chunky if you put everything in it, but it's a big amount you can take home. I enjoy everything I order here and have heard rave reviews about the Steak Ranchero as well. Haven't had anything bad yet. I'd like to save room for once to try their fried icecream, it looks like they give a generous portion!"
        }, 
        {
            "index": 383, 
            "rating": 5, 
            "review": "If you're looking for more authentic taste like home Mexican food, this is your place! When you seated they bring out bottomless chips with salsa and bean dip, they also bring out Fideo all complimentary. The food proportions are huge and the food is amazing. You definitely won't leave this place hungry. Not to mention the excellent staff & customer service. Been coming here for years."
        }, 
        {
            "index": 384, 
            "rating": 4, 
            "review": "Went here a couple of weeks ago on a weekend at about 3:30-4'ish.  There were a few people in there but it wasn't packed.  I had the Sopes,  (Sopes -Three  handmade tortillas gorditas, lightly deep fried. Topped with chorizo, carne asada or pollo asado.) with carne asada a taco, basically, but with a  thicker, fried corn tortilla, complete with onions, cilantro, etc.  No sissy lettuce and tomato on these tacos.  It also came with beans and rice (some of the better rice I've had, I find it always to be dry and bland, but I like flavor) I finished 2 of them (out of the 3 I had), but couldn't handle eating anymore.  My boyfriend had a dish that was even better than mine.  I can't remember the name of it, but I'm waiting for him to answer me so I know what it is. - Now I know! It was the Steak Picado- (New York steak in small chunks, sautéed with onions, cilantro, jalapeños, tomatoes and mixed with Spanish & verde sauce.) I remember, it was nice chunks of meat in a red sauce (not mole, not chile colorado), I took a bite of it, and the meat was incredibly tender, not the dry, in the crockpot for 6 hours, shredded tender, the tender that only comes from a good piece of meat.  It yields slightly, but as soon as you bit in, it's pure, soft, moist bliss.  And no gristle!  Their handmade tortillas are also very, very good.  I watched the nice lady make tortillas the whole time I was there, she was a busy lady!  \nWe finished it off with the fried ice cream.  To me, it left more to be desired.  The coating seemed...almost stale, it was hard to chew and the ice cream was just plain vanilla ice cream.  I heard the table next to us order the fried banana after the waiter's suggestion, they seemed satisfied with it and finished the whole thing.  All in all, I will definitely go here again, just on the Steak Picado alone."
        }, 
        {
            "index": 385, 
            "rating": 4, 
            "review": "Had a nice lunch with my sisters on a Sunday afternoon around 12pm. Busy, busy, busy!\n\nThe food is always very delicious which receives a 5 Star, but I rated this review a 4 Star because the servers were not very attentive and seemed like they really didnt care. Upon checking in on yelp, you can receive one free house margarita, which we showed to the waiter. He wanted to take our phones to the bartender...Whoa...ah, no you cannot take our phones to the bar(which was on the other side of the restaurant! Would you let a person who you did not know, take your phone and your sisters to the bar? No! LOL. So, I had to walk all the way to the bar and show the bartender myself. I thought that was weird and not very professional. Anyways, after that incident, it seemed like the waiter became dis-interested. Our water glasses were never refilled, had to continually ask for a refill of the salsa and chips, and when we were presented our check, he just set it down and never said thank you.\nOk, I know they were very busy, but it just seemed like he could careless. We would have left a higher tip, but felt like we really weren't treated very well(we have been dining here for years).\n\nAll in all, the food is great and I will continue to dine here."
        }, 
        {
            "index": 386, 
            "rating": 5, 
            "review": "Get a free margarita when you check-in on Yelp! Generous portions of delicious Mexican dishes :)"
        }, 
        {
            "index": 387, 
            "rating": 1, 
            "review": "Parese un restaurat de fast food la parrillada fria nada q ver con el otro de la desertinn por el mismo precio la atencion desordenada"
        }, 
        {
            "index": 388, 
            "rating": 5, 
            "review": "Amazing Mexican food and service !! Authentic Mexican food and very friendly environment ! Will definitely be back when I'm in Vegas again"
        }, 
        {
            "index": 389, 
            "rating": 5, 
            "review": "Why I keep coming this place? Well, Because I really like the authentic Mexican food and here you have it. My wife is from Michoacán and she said that the food is definitely authentic from Michoacán.  This time I ordered mole with chicken, oh wow. It was delicious. The pasta soup they serve is so tasteful. The margaritas are so delicious. The personal is so friendly. They speak English or Spanish. Your preference."
        }, 
        {
            "index": 390, 
            "rating": 5, 
            "review": "Excellent food and service. Reasonably priced. Not touristy - local favorite and off the strip. One of my favorites in Vegas."
        }, 
        {
            "index": 391, 
            "rating": 5, 
            "review": "Great service. Good food. And a free margarita to boot if you check in through yelp.  Would go back in a heartbeat!!"
        }, 
        {
            "index": 392, 
            "rating": 5, 
            "review": "Delicious. 1st timers and was not disappointed. The wifey ordered the cheese enchiladas but wanted white sauce, not red. Our server Richard, suggested another sauce cooked with cognac. Needless to say, wifey killed the plate. I ordered the chicken fajitas. Can't go wrong and didn't. The grilled tortillas were a nice touch. Will be back for sure. \n\nPS, don't forget to check in on Yelp and get your free margarita."
        }, 
        {
            "index": 393, 
            "rating": 5, 
            "review": "Excellent menu of traditional Mexican cuisine.  We had a group of 12, everybody ordered something different.  Everything was great.  The staff was friendly, the service prompt.  I had the carnitas, they were moist and flavorful.  This place is off the strip but not too far.  I would highly recommend it.  We come here every time we visit Vegas."
        }, 
        {
            "index": 394, 
            "rating": 5, 
            "review": "Came to Vegas and was a bit tired of the overpriced Vegas Strip food. I love coming to this place when I visit from LA. I highly recommend it!"
        }, 
        {
            "index": 395, 
            "rating": 5, 
            "review": "There is no better mexican food in las vegas as far as I am concerned. The service is top notch the food is excellent and fast! Do yourself a favor and order the table side guacamole! You will not be disappointed !!"
        }, 
        {
            "index": 396, 
            "rating": 5, 
            "review": "Great place to eat! Excellent authentic Mexican food  sope, enchiladas, taquitos, burritos & carnitas michoacan"
        }, 
        {
            "index": 397, 
            "rating": 4, 
            "review": "Delicious Mexican food with an authentic feeling environment.  If you are looking for some tasty Mexican food, it's tough to find a better place that Bonito Michoucan.  It's definitely one of the top places in town."
        }, 
        {
            "index": 398, 
            "rating": 5, 
            "review": "If you were a fan of Viva Michoacan on Sunset, you're probably still crying about its close.  Well, dry those tears!  This place has recipes that are similar, if not the same, as Viva!  The soup, tortillas, and dishes like Shrimp Dionisia and Chicken Zirahuen are to die for.  And the service!  Our waiter was so nice - you truly feel welcome there.  And if that wasn't enough, there was a man playing music, too!  Excellent Mexican food, excellent service, and prices way better than the Lindo in GVR.  We will drive out of our way to Bonita whenever we want the best.  PS- Football fans - there are TVs everywhere!"
        }, 
        {
            "index": 399, 
            "rating": 3, 
            "review": "Great food. Not great atmosphere. But when you are with good company, that part matters less. \n\nPros: \nchips, salsa, bean dip, yum \ntasty tomato base soup for free, yum \ngood margaritas and they made my specialty margarita correctly! \nfriendly and attentive staff \n\nCons: \nodd decor - clowns....creepy \nodd floor plan \nright when you walk in you can see the nasty kitchen lights because the wall around the kitchen is low \n\nI had a poblano cream chicken dish with rice and beans. OMG. TDF! I couldn't stop eating. \n\nWe will be back! I just recommend a little redesign/redecorating. Hire someone to help with that. Don't just let the wife/daughter of the owner handle it. A professional who can help make it more appealing and attractive and updated."
        }, 
        {
            "index": 400, 
            "rating": 5, 
            "review": "We stopped by on Super Bowl weekend and were not disappointed the food was great Bam Bam was at his best. One of the most interesting men in the world ! Friendly and entertaining waiter."
        }, 
        {
            "index": 401, 
            "rating": 5, 
            "review": "authentic mexican. live music, bar, attire & decor\nmake fresh salsa & guacamole tableside. my tea never got 1/2 empty. more chips & salsa without ever asking\ntruly the best authentic mexican yet!! very spicy & meats were tender and juicy. crispy tacos too\na truly authentic mexican joint with great lunch specials. $5.99/$7.99/$9.99 for 1/2/3 item combos"
        }, 
        {
            "index": 402, 
            "rating": 1, 
            "review": "Looks are deceiving let me tell you! \n\nThis is NOT REAL MEXICAN FOOD. The salsa had no flavor the chips were stale \nThe coffee creamer was expired! Oh man our plates blaahhh!! We got huevos rancheros and chilaqueles it was horrible rice was nasty dry the salsa on top of the food was straight out of a can! Yuck! Never again.. \n\nI'M MEXICAN THIS FOOD IS NASTY STAY AWAY!! I KNOW WHAT I'M TELLING YOU!!"
        }, 
        {
            "index": 403, 
            "rating": 4, 
            "review": "I really like the food here. the restaurant itself is really cute from the outside looks like something that belongs in Mexico! I love it\n\nthey sang me happy birthday with a full mariachi it sounded like. the staff is really nice and attentive. \n\ngood place to come if your in Vegas and in the mood for some Mexican food."
        }, 
        {
            "index": 404, 
            "rating": 5, 
            "review": "I took my parents here when they came for a visit. We celebrated my birthday with fajitas and margaritas! I had the chicken fajitas and they were cooked to perfection! The noodle soup that comes before the meal is one of my favorite appetizers! My mother and I had traditional margaritas and we both agreed they were definitely made with love and great skill. All margaritas are not created equal, some leave you feeling weighed down with all the sweetness, not these! They were made perfectly! The service was great and my birthday tequila shot was awesome (not much of a shot person, but it was sweetened with some lemon juice and it went down smooth). The cinnamon churros with whipped cream were a nice end to a wonderful birthday dinner!"
        }, 
        {
            "index": 405, 
            "rating": 5, 
            "review": "Best food in town! Make sure to request Richard as your server, he's the best!! \nAnd special bday dance for the ladies \nDon't forget to order table side guacamole and queso fondido"
        }, 
        {
            "index": 406, 
            "rating": 4, 
            "review": "I have passed by this location many times and they always have a nice crowd. Tonight, we decided to try out Bonito for my birthday dinner. The atmosphere was authentic and our server was very helpful.  I had the chorizo tacos, which were filled with their homemade chorizo and served with rice, beans, and a scoop of guacamole. Their chorizo was good, not too spicy, but smoky. My partner got a combination platter with a chile relleno, taco, and enchilada. He said everything was good as well.\n\nThis location offered a free house margarita for checking in for Yelp users. The drink was actually very good and I ordered another. I did notice they only give each table one complimentary chips/salsa/beans starter and charging $3.50 for additional refills. I have to say I've never encountered this, even at more upscale restaurants.  The beans served were good, the salsa a little too smoky for me.\n\nAll in all, Bonito offered an authentic Mexican dinner for my birthday this year. There was a nice live band performing and the service was very good. We will more than likely be back to try some other options."
        }, 
        {
            "index": 407, 
            "rating": 5, 
            "review": "Okay HI! We tried a different place each night on this last little jaunt to Vegas and because I am so much of a Smartina Navratolova I wanted Mexican food and so I went to my Yelp app on my Smart phone and searched for a highly rated restaurant with reasonable prices and Bonito Michoacan came right up.  We were in the neighborhood (my brother in law is Chinese) so we hung a U and drove right into the parking lot (yeah buddy they even have parking fa YA)! \n\nWe went inside and the place is beautiful.  There is a beautiful woman who hand makes tortillas RIGHT there. I love that. \n\nThe bathrooms are beautifully decorated ...beautiful I LOVE the copper basins.\n\nThe whole place is colorful,extremely inviting and interesting. \n\nSo we walk inside from hot to cool.  We are greeted by a young woman with a beautiful smile and they have a table ready for us (party of 7).  They bring over these hot chips, with warm bean dip AND really delicious salsa.  (This is new, most places offer salsa and chips and that's it right?) \n\nThen a very nice gentleman asks if we would like drinks YEAH! We order 3 top shelf frozen margaritas (two plain, one mango) and my Mother said it was the best margarita she's ever had...they came out quickly, very well blended and huge (meets all my criteria :-)  \n\nSo far ...I AM IN HEAVEN I thought...but then we hear music and there is a male singer who sings a beautiful array of Spanish dinner songs and even one Bossa Nova (EYE EYE YEY) Now I am in heaven.\n\nSo we check the menu, very reasonable prices, I ordered the Steak Ranchero medium rare, my Mom ordered SHRIMP Ranchero and there were 5 other orders ...I was a little too busy with my margarita to tell you what they got but I can tell you they were all happy.  We did not have room for dessert this time but I am definitely going back next time I get to Vegas and I will update this report when I do okay? \n\nThe food was fresh, tasty, hot and it came out of the kitchen quickly.  I had to get a to go box and so did my mother.  \n\nThey offer hot tortillas, with butter if you ask and the service was oN POINT. Friendly, polite, sweet and generous. My mother said she loved that place and believe me ...she is usually a ...well... a mother. \n\nI have not felt as if I got MORE than my money's worth in quite a long time but (well technically since I didn't pay ...oh you get the picture) \n\nVery very good find, thanks yelp, thanks everyone who rated this restaurant because you all helped make a great evening possible for my family.  My mother has been ill and we thought this trip would cheer her up and she loved this place so much, we all did. \n\nNow you go and eat there and bring your family and friends ( I saw a wedding party y'all) and tell me how you liked it.  I know you are going to be so happy! Go now."
        }, 
        {
            "index": 408, 
            "rating": 3, 
            "review": "This place was cute, but pretty average.\n\nOur server kept trying to rush us to order because he had a party of 15 he was trying to help as well. We sat down and felt super rushed into ordering he kept saying if we didn't order now the part of 15s order was going to go in before ours and it was going to take way longer to get our food.\n\nThe food was nothing spectacular. Tasted like pretty much every other Mexican restaurant I've been to.\n\nWe ordered fried ice cream and bananas for dessert and to light them on fire they poured a full shot of tequila over it. All we could taste was tequila it made it pretty much inedible. \n\nDecent food but nothing I would recommend."
        }, 
        {
            "index": 409, 
            "rating": 5, 
            "review": "Came here to finish our vegas trip randomly found it on yelp ! Food is so good cant get more authentic . Service js great !! Dont forget to check in for your free margarita!"
        }, 
        {
            "index": 410, 
            "rating": 5, 
            "review": "Always good food, and the service is always spot on. Great guacamole made at the table. We have become regulars at this restaurant."
        }, 
        {
            "index": 411, 
            "rating": 4, 
            "review": "4.5 stars\n\nMy family and I were introduced to this place by my in-laws.  They are regulars to this place, and it didn't take us long to see why.  This place has good food and good service.  \n\nThe experience is started off with Chips & Salsa AND Bean Dip.  Chips are nice and fresh; not salty.  Salsa is usually good, but I love the bean dip!  The bean dip is excellent when enjoyed with the chips.  It is served warm and just melts in your mouth.  \n\nOur Entrees were just as good.  Some ofthe entrees that we ordered included a Chicken Flautas (my item), Chile Relleno / Beef Taco Combo, Lightly Breaded Thin Slice of Steak served with French Fries, etc.  although I feasted on the chips and bean dip, I was still able to feast on my Chicken Flautas.  They were nice and crispy (not oily) with juicy chicken pieces inside.  We also had the pleasure of ordering a large mango margarita.  Wow, it was definitely LARGE.  We even got to keep the margarita glass (rinsed clean thanks to our server).  \n\nLoved that they sang to my wife in celebration of her birthday!  A churro dessert was served as the birthday dessert.  To top that off, our server even had a shot of Tequila and Sprite to help commemorate the occasion.  \n\nService was great!  Our server and team (food runners, etc.) did a great job.  \n\nPrices were also not too bad, especially considering we were there for dinner."
        }, 
        {
            "index": 412, 
            "rating": 2, 
            "review": "Nice authentic feeling environment with a very large menu. I am not sure if i had a bad day but  the service and food were not very good. Tried this restaurant based on Yelp and another persons suggestion. But after eating here it was disappointing. I ate the fajitas and my friend had the Carne asada. Nothing seemed to be very fresh and the vegetables were overcooked. I wasn't expecting to be this disappointed but it really was not what I expected. Overall not great and will not be trying to return anytime soon. Sorry but that is the truth."
        }, 
        {
            "index": 413, 
            "rating": 4, 
            "review": "Just finished having dinner for the first time at this restaurant after driving by it for so many years!  Well, we could kick ourselves for not stopping in before. \n\nI ordered the Chile Rellenos Camerones, which were 2 mild green peppers stuffed with shrimp and topped with cheese. They were really tasty and the shrimp tasted fresh and not like they've been sitting in the fridge for a week.  This entree came with tortillas (corn or my choice, flour) freshly made on-site.  Curiously though, as many homemade tortillas I have eaten in my life, these got really stiff, pasty and cracker like once they got cold.\n\nThe wife had the Sopes with Carne Asadas which she enjoyed.  Our sons enjoyed a cheese quisadilla and the other, a cheeseburger and fires, which were really good.\n\nAll entrees came with a really good fideo soup.  \n\nService was really good.  The only hiccup came at the end.  At the beginning of the meal (when we were ordering) I presented our 20% off coupon from our local newspaper that was valid Sun-Fri.  Our server told us he would deduct the discount when he brought our bill at the end of the meal and placed the coupon in his shirt pocket.\n\nI made a silent bet with myself that the bill would not reflect the discount because the server was going to worry we would not tip him appropriately.  My wife and I are not those kind of tippers.  If they are good they will always get 20% from us and if there is a discounted amount, they always get the pre-discount amount for a tip, but we know there's a lot of people who don't practice this but to each their own.\n\nAnyways, we finally got the bill adjusted and left, happy.\n\nWe'll definitely be returning here and bring out of town family and friends here also, since El Patron closed.  This place is a lot cheaper than Lindo in HD, whose parking lot also sucks!"
        }, 
        {
            "index": 414, 
            "rating": 4, 
            "review": "Best borito in town and there chiros are great not too sweet service here is good too soft drinks are bottomless our drinks never got half way before it was refilled we like coming here for lunch. \nWe are going to try there dinner next"
        }, 
        {
            "index": 415, 
            "rating": 4, 
            "review": "Randomly driving off the strip and happen to spot this place. The bean dip tasted just like typical frijoles so i wasn't that impressed, but it was good. I had 3 tacos de chorizo and they were super delicious! The chorizo was piled high on these which was a nice surprise. My plate came with more beans and some rice both good. The sopa de fideo wasn't bad either but I love my mom's better :) the service was awesome. Our waiter was super courteous and came frequently to refill our drinks. The place is very nicely decorated with authentic Mexican decor and the Spanish music (Vicente Fernandez) playing in the background just added more charm and authenticity to this good Mexican restaurant. I'd definitely eat here again the next time I'm in Vegas."
        }, 
        {
            "index": 416, 
            "rating": 5, 
            "review": "We checked in on yelp for the free margaritas, I was surprised and delighted that they were 2 margaritas on the rocks and not frozen overly sweetened blended margaritas.   This was a perfect way to start our meal,  while we were looking over the menu we were served chips, salsa and beans.   We were starving so that went pretty fast.   We then ordered our entrees,  I ordered the camerones al conac and he ordered camorones dionisio.  We were still hungry after the chips and salsa so we ordered chips and guacamole which they prepare tableside.   (You can definitely tell these servers do the tableside guacamole several times a day) it's nice that they ask if you want all the ingrediants and how spicy you would like your guac.  The guacamole was nice and refreshing with our margaritas.   Then our soup came.   The fideo soup was a small cup of tomatoey brothey noodle goodness,  I finished every last bite.  When our entrees came out, we both finished everything off our plates,  shrimp,  tortillas,  rice,  beans and a dallop of guacamole,  everything was good!   I enjoyed everything from the service to the margaritas to the appetizers to the entrees,  by this time we were pretty full so passed in the desserts,  I definitely recommend this place for the service,  atmosphere and food."
        }, 
        {
            "index": 417, 
            "rating": 5, 
            "review": "I love this place! My favorite dish is Camarones Dionisia! By the way ask for Juan the waiter he's the best!!!"
        }, 
        {
            "index": 418, 
            "rating": 4, 
            "review": "Great food, nice atmo...They always give you more than you can handle. Almost any entree is started w/ soup...Fideo.... I have fond memories with friends at this place...It almost takes me back to the time before I had kids & we could sit at the bar drinking Corona's till they close. \n\nI have a bad habit of ordering the same thing...\nFajita's... \nI guess 'cause I know thier good & I am a definate creature of habit.\nhighly recommended I would have given 5 stars but I guess i'm just picky that way."
        }, 
        {
            "index": 419, 
            "rating": 5, 
            "review": "This place is fantastic. Very Mexican looking, a large restaurant with plenty of seating.\n\nStaff is wonderful and very attentive all the time. They have an extensive menu and their food is really good.\n\nThey even make plates that are not listed in the menu. I always get the \"Pollo Milanesa\".\n\nThey have a live band as well.\n\nTheir tortillas are so so so fresh and so so so yummy. You can have a soup with your plate as well.\n\nTheir prices are great and you get a lot of food. Their chips are really good and they come with salsa and bean dip."
        }, 
        {
            "index": 420, 
            "rating": 4, 
            "review": "I came here to eat with my family and it was very good. Everything about this place is great. The customer service was good as well. The prices are decent nothing to complain about. I was recommended by a friend and her experience went very well as she had told me. Im looking forward to come back soon and I also recommend this place."
        }, 
        {
            "index": 421, 
            "rating": 4, 
            "review": "Such great food! I've never been disappointed with anything I've ordered. The chilaquiles and chorriqueso are my absolute faves. Only downside is that it's off the strip, but definitely worth the short drive from it."
        }, 
        {
            "index": 422, 
            "rating": 5, 
            "review": "Absolutely the best Mexican food in Las Vegas!  We always stop here when we are in town and it never disappoints!  Juan has hot to be one of the waiters I've ever had.  Upbeat and fun!  Great food!  All around great time!"
        }, 
        {
            "index": 423, 
            "rating": 4, 
            "review": "Every time I would drive by this restaurant the parking lots always at its max capacity.  So finally on a slower day I decided to give it a try :P\n\nThe ambience was highly energetic.  All the coworkers  gathered and sang two different birthdays.  The decor was very colorful and gave the Spanish vibe.\n\nAs I looked their menu I was getting pretty  full eating their complimentary snack- chip and dips.  They had bean, salsa and guacamole (this was extra $8)  :P  what was so awesome, was how they made the guacamole right in front of us!  Two whole avocados and get to tell them how spicy you like it.  Then they also give this comp soup cup - chicken/tomato I think ? It was pretty delicious. \n\nTheir cilantro steak ($16) was very tender - I ordered the steak medium rare.  They had \nGreen sauce with sautéed onions on top of the steak.  It came as a combo - with rice and beans.  \n\nI also tried their chilé relleño burrito ($8.95).  I wasn't too impressed with it.  This is what I would order at any other Mexican fast food chains, but this restaurant made it like an enchilada style - with tomato salsa over it.  \nMaybe next time I'll tell them just like a regular burrito with beans and rice inside the burrito and no sauce on top :P"
        }, 
        {
            "index": 424, 
            "rating": 3, 
            "review": "Typical Mexican fare and atmosphere. The margaritas were refreshing. Service was good and attentive.\nThe table side guacamole is always fun and tasty. I liked the chili Verde. \nOverall, it was all good; just nothing different that most other \"good\" Mexican restaurants.\nIf you're looking for a solidly good meal, this will meet your needs. If you're expecting anything more than typical Mexican fare, I'm not sure you'll be happy."
        }, 
        {
            "index": 425, 
            "rating": 3, 
            "review": "Well....out of all the Michoacan family of restaurants, I would rank this my #3 choice, with Viva being #1 and Lindo being #2.\n\nThere's a couple of reasons for this -\n\n1.) Viva gives you complimentary fideo soup when requested. If it doesn't come with an entree, Bonito charges you $2.50 for it. It's good soup but not worth paying $2.50 when it costs probably $.25/cup to make. \n2.) The customer service is off par from the rest. I experienced a rude, short tempered server today at lunch. When I advised my meal came out wrong, he refuted \"well this is the way you told me you wanted it!\". Well, actually that's not the way I told you and I wouldn't be telling you it was wrong if you just listened the first time. My last visit, when I asked the question \"what is fundido dip?\" I was treated like I was stupid for not knowing. It was off putting.\n3.) The busser was kind but she was bad at refilling drinks. My one pet peeve is drink refills. Don't keep me hanging....\n4.) The chips and bean dip that come out are bland. Do they use different chips & dip than the other Michoacan resturants? I'm not certain but they don't taste as good here. \n\nThere are good things about the resturant as well - \n\n1.) They have an extensive Mexican themed menu with many options for even the pickest of eaters. My favorites are the beef chimichangas and the beef flour flautas. Their spanish rice is decent and their refried beans are good & consistent. I tried my friends carne asada steak today and it was juicy and yummy. Their homemade flour tortillas are delish!\n2.) They run resonably priced lunch specials. For two of us, we escaped at around $20.00...not bad for a sit down lunch. \n3.) It seemed as though before our tushs hit the seats that there were chips and dip on the table. We were immediately asked what we would like to drink. Very speedy in this regard.\n4.) Pleasant hostess staff, large restaurant seating areas and a full service bar."
        }, 
        {
            "index": 426, 
            "rating": 5, 
            "review": "In town with the family, we choose to eat out at a Mexican Restaurant, they being locals and we being from out of town took their word.\n\nThis place serves you chips with beans and salsa to start and their re-fried beans are amazing delicious. \nWhen I ordered my food I had to ask for another side of re-fried beans.\n\nI tried their Green Chicken Enchiladas, the sauce was not spicy at all which is a plus, because if the food is too spicy where you can't even enjoy it that's not a good experience.\n\nI got 2 enchiladas with rice and beans and that was enough to fill me up, I wasn't left hungry or over full either.\n\nMy family members ate the Shrimp Ceviche Tostadas, I tried one of these and they were amazing.\n\nThis place was a good pick, they had music, great tasting food, the price was right, the atmosphere was nice and the servers were very fast and nice."
        }, 
        {
            "index": 427, 
            "rating": 4, 
            "review": "Second time here and it was just as good as the last time. We arrived Saturday night @730pm. It was packed but we were able to get a table right away. The hostess was friendly and was able to get us regular table instead of a booth by a very loud party. Our water and chips were almost immediately served. The salsa was hot......ouch, but not for my partner who devoured the bowl!  Seconds followed and so did our waiter to take our drink order. I had a mojeto.........pardon my spelling. It was tall, cool and refreshing. This was laden mint leaves and plenty of alcohol.\nWhile waited for food, a DJ played some funky 70s tunes with Mexican music, we laughed and thought it was cool.  Our food was good, nothing out of the ordinary...I had the shrimp sautéed in a cream sauce with lots garlic which I love. My partner had the burrito....covered in cheese and sauce......uh interesting since burritos are not covered in either.  It looked more like a huge enchilada.  The overall service and atmosphere was great. The food, good....but not exceptional.  We will go back."
        }, 
        {
            "index": 428, 
            "rating": 2, 
            "review": "Pattern of sadness: BIG Mexican restaurant = BAD tacos. \"No rice en beans por jur tacos??\" \n\nMy eyebrows grimaced at the waiter with a silent OH HELL NO. Whoops, I've become such a taco-snob. \"No thanks\", I replied more politely. \"But can I please get onions, cilantro, and salsa for them?\" \n\nAt that he half-grimaced back at me with a silent HUH? \"Chure, ob course.\" ...aaand then they forgot the toppings when my tacos came out... \n\n2   S T A R S\n\n* FOUND THE TACO GEM!\nNever fails -- every place has an unexpected taco-gem. The joy of a Taco Flight is that sweet moment of discovering the stand-out. \"JUREKA!\"\n:::: Raja Con Crema Taco -- MEXCELLENT! Slices of poblano peppers and steak bathed in a creamy mushroom sauce, and served in a fresh tortilla. Every bite was moist and delicious!! \n:::: Fried Fish Taco -- DECENT. Crispy and fresh. Toppings could have been better, but nonetheless it elicited happiness.\n:::: Fresh Tortillas -- WOOT!\n:::: Consomme -- DECENT. Starter soup with tiny noodles.\n\n* BIG, FESTIVE JOINT\nBonito Michoacan is the prototypical, fun-for-the-whole-family, Mexican-American restaurant. It's got the hostess in bright, ethnic dress, southwestern colors and faux-adobe walls, mariachis selling songs, a photographer selling photos of the dining parties. No cheesy sombreros, so a little dignity is preserved.\n\n3   M I N U S E S\n\n- TERRIBLE MEATS\n:::: Carnitas Taco -- MEH! Soo dry! They forgot the toppings. SKIP!\n:::: Asada Taco -- BLEH! Flavorless beef. Basically inedible. SKIP!!\n:::: Steak Picado -- TRASH! My buddy's steak was just disgusting. Dry, worst cut of the cow, tasted like meat-cardboard.\n:::: Rice -- AVERAGE.\n\n- EXPENSIVE!!\nDude! $28 for 2 average margaritas?? $18 for a plate of STEAK TRAGEDY??\n\n- DISCRIMINATION?\nMy dining buddy watched the restaurant photographer go from table to table, taking nice pics of the customers and offering to sell them prints. Our table, which featured the only Black man in the restaurant (not me), was ignored. Hmm... The photographer came back a few minutes later and skipped us again. Coulda been nothing, but the double cold-shoulder left a taste in our mouths almost as bad as the Steak Picado."
        }, 
        {
            "index": 429, 
            "rating": 1, 
            "review": "Came here for a family gathering. Unfortunately, there are no real vegan options. Even the beans are made with dairy. The rest of the family seemed to enjoy the food, but vegans should come prepared to starve."
        }, 
        {
            "index": 430, 
            "rating": 5, 
            "review": "What 4 stars overall really? This place is way better then Lindo There service is amazing I never had a to call the waiter our food was delicious. Venue is great. Overall it was AMAZING!!!!! Ever since Viva closed this has been the new to go restaurant."
        }, 
        {
            "index": 431, 
            "rating": 5, 
            "review": "The service is always great, even when they have a packed house. They also offer a good selection of vegetarian options. The alcoholic drinks are nice and the tortillas are a must try! This is my favorite Mexican restaurant in Las Vegas."
        }, 
        {
            "index": 432, 
            "rating": 4, 
            "review": "Great food and fun atmosphere. If you enjoy good Mexican food in a nice setting please check this place out."
        }, 
        {
            "index": 433, 
            "rating": 4, 
            "review": "I was visiting my sister and family in whittier ca and decided to go to Las Vegas for the weekend. We were looking for a good mexican restaurant and asked when stopped for gas. Thank God they gave directions to this place. Being from San Antonio tx I like tex mex food. Was this a pleasant surprise as soon as we walked in. I really liked the sopa de fideo to start with. Then the chips with salsa and very good re fried beans in a small bowl. Settled on chicken enchiladas with white sauce . Must not have liked it because I don't remember it being very good. Service was great. Ordered guacamole and they fixed it at the table for you. Very good. Was not crowded since it was Sunday before noon. Did not like being in a cramp place. There were five of us. Also used the womens bathroom they ran out of paper towels. Told waitress and a very nice lady and gentleman talking to her offered me their napkins. Waitress didn't know what to do.we were there in April. But overall the food was very good. I will go back next time in Vegas.we had been looking for a good place every time we are there."
        }, 
        {
            "index": 434, 
            "rating": 5, 
            "review": "The menu is amazing. I can't wait to come back so I can try everything. I had the ceviche and fish taco. Everything was delicious! Great service too!"
        }, 
        {
            "index": 435, 
            "rating": 5, 
            "review": "One of my favorite vegas places. Giant margaritas, crazy clown decorations, live music, wacky servers. If you are looking for fancy Mexican food this is not the place for you. I always bring out of town guests here for food and fun. Once the server got up on the booth behind us and danced as he made guacamole ha! The food is good and the menu has lots of choices so you are sure to find something you like. Even though its casual the service is always great. Refill waters BOOM, refill chips BOOM. Birthdays are hilarious, they come out and sing to you and put a sombrero on you haha. It's fun and funky familiar Mexican fair."
        }, 
        {
            "index": 436, 
            "rating": 5, 
            "review": "My favorite mexican restaurant in town! Always delishious, I come here when I want hearty comfort food."
        }, 
        {
            "index": 437, 
            "rating": 3, 
            "review": "Foos is great but service from the hostess could be much better. Get rid of the two gals at the front and then maybe 5 stars. They are rude, not welcoming and careless"
        }, 
        {
            "index": 438, 
            "rating": 4, 
            "review": "This is a solid place for Mexican. The food is usually amazing. I did have to send something back once, but they graciously and quickly made me something else that was fabulous.  Great service!  Great prices! Great food!  I do recommend!"
        }, 
        {
            "index": 439, 
            "rating": 3, 
            "review": "Nice people helpful. But the food I ordered was very very bad!!! I ordered some asada tacos, I didn't even eat them. they were full of oil and it didn't taste nor it looked like carne asada. Very disappointing. I have to say their free margarita was very good and their chips with salsa and bean deep was good. But I wouldn't go there just for margaritas and chips with salsa and beans"
        }, 
        {
            "index": 440, 
            "rating": 4, 
            "review": "Food is fabulous as always but the day I decide to bring my family the service was real slow. While others were getting served right away."
        }, 
        {
            "index": 441, 
            "rating": 3, 
            "review": "The service here is probably the most noteworthy, fun and relaxed- and ultra attentive. Everyone in my group seemed to enjoy their food- \n\nFor my Chile verde I substituted Lengua, and it was great. Their Utra Margarita is awesome though! 6 shots in a huge margarita glass you get to take home afterward. I can't belive I got through the whole thing! My fiance tried some of their cocktails which were just- eh, nothing special. \nGo for the Tequila Margaritas you GRINGOS!\n\nThis is a fun place for classic mexican dishes. Ole!"
        }, 
        {
            "index": 442, 
            "rating": 5, 
            "review": "Wonderfully authentic Mexican food! The best server is Richard, go in and ask for him. He is very knowledgeable, funny, enthusiastic and makes your dining experience even better. Nice live music, great family feel. The food is delicious, you will be coming back!"
        }, 
        {
            "index": 443, 
            "rating": 4, 
            "review": "Atmosphere is Very pleasant, the service is very good. Menudo homemade and is very tasty, enchiladas are all very good, the bean dip is tasty with the salsa which is brought to every table. The avocado dip know as guacamole is very tasty but very high in calories. The cactus appetizer is very yummy served with either homemade flour or corn tortillas.  We first learn of this location on Cico De Mayo and have been back several times. One thing I must insist that you do not order are the tacos unless you want to become very disappointed like I did after ordering myself and my date at lunch a la carte two tacos and tostada de ceviche. Only the tacos were very small and fried with maybe a tablespoon and half of chicken and cheese combined and served over shredded lettuce.  These taco's looked like something you would generally avoid at Jack In-Box."
        }, 
        {
            "index": 444, 
            "rating": 5, 
            "review": "We are from the Rio Grande Valley  on the border of Mexico and this was the most authentic food  I have ever had.  Fantastic  service  really cute waitresses, and  very cold beer.  Well done"
        }, 
        {
            "index": 445, 
            "rating": 5, 
            "review": "Homemade tortillas are sooo good. Get the fundido, it's in the classic style. \n\nI grew up in So Cal, and it's really hard to find good Mexican food around vegas (at least to meet my standards!) This place does not disappoint."
        }, 
        {
            "index": 446, 
            "rating": 5, 
            "review": "Cozy atmosphere and great food. Get out of the casino and go eat authentic Mexican food. We took uber from Caesar Palace and with food was cheaper then one dinner at casino. Highly recommend!!"
        }, 
        {
            "index": 447, 
            "rating": 3, 
            "review": "Tasty margaritas that come in giant sizes.  Not only do you get the standard chips and salsa but a really yummy bean dip too.  Friendly, if a bit over the top service.  A gargantuan menu.  I think this place is a solid hit with tons of Mexican standards.  Even though my carnitas weren't the best I've ever had, some of the other dishes were delish.  I'd eat here again.  Three plus plus stars."
        }, 
        {
            "index": 448, 
            "rating": 5, 
            "review": "Hands down best Mexican in Las Vegas! Food & service is always great. Staff is super happy & on point. Everything is delicious! No complaints!"
        }, 
        {
            "index": 449, 
            "rating": 4, 
            "review": "It was really good. The service is excellent and it has some pretty cool ornaments; nice ambiance. We had the carne asada plate which was delicious. My gf had the menudowhich was not bad, just a bit too much fat on the menudo. \nThe bring you chips, salsa and frijolitos mmmmm really good! It could use a bit more lighting in some areas.  They got this old guy playing music  from back in days.... de la era del caldo lol."
        }, 
        {
            "index": 450, 
            "rating": 5, 
            "review": "This was an amazing meal... The Mole was killer. Service excellent. We're from out of town, always willing to try new places, this did not disappoint."
        }, 
        {
            "index": 451, 
            "rating": 4, 
            "review": "Bonito Michoacan is one of the more authentic Mexican restaurants I have been to in Las Vegas. Even the funky decor is pretty damn authentic! \n\nThe complementary chips, salsa and bean dip are excellent, we always end up getting more because of how quickly they disappear. Rarely do we have to ask for more chips, salsa or anything for that matter since service is always very attentive... \n\nI tend to stick to 'standard' dishes when I eat here... they have great tacos, excellent fideo soup, wonderful enchiladas and the strawberry margaritas are made with real fruit, yum! They make their guacamole table-side here, you can request it as mild or as spicy as you prefer.  Prices are reasonable for the large portions you get... \n\nThis isn't your on the strip, \"fine dining\", spending $50 a plate, fancy dancy type restaurant but it's still well worth a stop even for a special occasion like a birthday... The employees come out singing, with musical instruments and a big sombrero for the special person to wear. I think you get a complimentary dessert as well... It's embarrassing if it's your birthday, hilarious if you are with the birthday boy/girl and entertaining if you just happen to be there when it happens."
        }, 
        {
            "index": 452, 
            "rating": 5, 
            "review": "My family and I absolutely love Mexican food and this is a great spot we've been coming to for years! The margaritas are very delicious and the food is quite traditional!The staff is very attentive and I look forward to coming back very soon!"
        }, 
        {
            "index": 453, 
            "rating": 5, 
            "review": "I cannot believe I have not yet Yelped that Bonito Michoacan es muy bueno! I've eaten here several times with friends when I visit Vegas, but this time brought family here! I know they thought I was crazy leaving the strip, but I told them it was well worth the short trip! Two family members are Mexican and took a long time to study the menu. They are both from California and have never seen some of these entrees on a menu except in Mexico!\n\nThe complimentary bean dip is good and the tableside, fresh-made guacamole is the best! My niece does not usually eat guacamole and she loved it here! I've had some of the lengua dishes before and they are the best I've had! This trip I had the Biria de Chivo (a type of goat soup). I have not had goat since I was in Greece in the 90's and this was so tasty and tender with excellent spice. My only issue is that I did not have room for more! Oh, and let's not forget the margaritas! They actually make them with tequila...good and strong...wink, wink. Fantastico!\n\nIf you want to enjoy REAL Mexican food at a fraction of the price of restaurants on the strip, then this is the place! Great food, great service, great prices and more money for Blackjack!"
        }, 
        {
            "index": 454, 
            "rating": 5, 
            "review": "Love the fish in a foil! \nAsk for Richard, he's the bomb! \nOh and try the top shelf margarita...."
        }, 
        {
            "index": 455, 
            "rating": 2, 
            "review": "I used to love coming here! It was my family's place to always go out to eat but recently, the last couple of times I've gone have not been to great."
        }, 
        {
            "index": 456, 
            "rating": 5, 
            "review": "Food was great. Had steak and shrimp combo. Servcie was outstanding (Richard). \nHighly recommend."
        }, 
        {
            "index": 457, 
            "rating": 5, 
            "review": "This place have really good & authentic mexican food!! I try a lot of food there and all good!! The ambience make you feel you are not in America but Feel like you are in mexico.. And they have good horchata drink as well.. All the employees are so welcome and nice. Love it!! Love it!!"
        }, 
        {
            "index": 458, 
            "rating": 3, 
            "review": "Very expensive...but way worth the high prices because the all male staff is the greatest best courteous kind waiters in Vegas....a lot of the food comes out Luke-warm. Refried beans and the rice came out Cold...and the Fideo soup came out cold also...but waiters are so apologetic"
        }, 
        {
            "index": 459, 
            "rating": 5, 
            "review": "This definitely is one of Las Vegas best Mexican restaurants. From the decor to the service and the food, it all deserves 5+ stars. We found this place on Yelp and with all the great reviews everyone left we had to try it. The restaurant was as good or even better then everyone said it would be. We were greeted as soon as we walked in and seated right away. Our server came right out with chips salsa and beans to dip. After looking at the menu for a few minutes our server took our order and the food came right out. Everything everyone ordered looked and tasted great! We told our server it was one of our friends BDay and the whole restaurant came out and sang 2 songs to her! One in English and one in Spanish lol its was soo cool! They even gave her chooros topped with whipped cream lol we had a great time here and id recommend everyone who is looking for good food and great service to come here. You wont regret it!"
        }, 
        {
            "index": 460, 
            "rating": 5, 
            "review": "Just all around delicious authentic Mexican food with authentic atmosphere. Manager came out and let us utilize the free margarita from Yelp. Hostess was beautiful and helpful. Waiter was fast and always on top of everything. Salsa was good. Shrimp tacos were bomb. Cheesecake burrito was a new dessert worth trying. Just go, no way to be disappointed."
        }, 
        {
            "index": 461, 
            "rating": 5, 
            "review": "Went here for lunch with my co-workers and it was a great experience. The food is phenomenal and the service is top notch. We will definitely be returning for lunch and I plan to bring my family in for dinner some time as well. Definitely worth a visit!"
        }, 
        {
            "index": 462, 
            "rating": 4, 
            "review": "The service here is just excellent! Fast and efficient.. the food was a little bland but the service makes up for it.. glad we stopped by before our drive back to Cali. Totally worth it!"
        }, 
        {
            "index": 463, 
            "rating": 5, 
            "review": "I've been to many different locations from Viva Zapatas to the Michoacana the food here has always been good for me and I highly recommend this place to anyone that wants to have that authentic Mexican food taste service is amazing and the atmosphere is extremely relaxing they have live music and they give free soup tortilla chips salsa and beans I give this place 5 stars because I've been coming here for years and every time they live up to them stars so if you're out looking for a good authentic Mexican place to eat choose this place"
        }, 
        {
            "index": 464, 
            "rating": 5, 
            "review": "Bomb! Bomb! Bomb! I love everything about this place. \n1. Service is great\n2. Food is as authentic Mexican and delicious \n3. Price is very reasonable.\n\nMicheladas are the reason we first went here and they did not disappoint they are delicious with the Perfect amount of spice and lemon. Table side guacamole is always a must. The aguachile extra spicey was so fresh and delicious,everything just perfect. It's a must go to place whenever I'm in Vegas."
        }, 
        {
            "index": 465, 
            "rating": 5, 
            "review": "Great place for vegetarians. Started off with their complementary nachos, hot salsa and crushed beans. It was perfect! Veggie enchiladas and veggie fajitas for dinner. Went well with a glass of their house Merlot. Great and friendly staff. We will be recommending to friends and family."
        }, 
        {
            "index": 466, 
            "rating": 3, 
            "review": "Came here after recommendation from others as well as seeing the reviews on Yelp.\n\nFirst off, the starter chips and refried beans/salsa are great. They come quickly, taste fantastic, and are plentiful.\n\nService is also great - I found it hard to reach the bottom of my glass before refills, waiters were (sincerely) friendly, etc.\n\nSoon after ordering they brought an appetizer of spaghetti soup(?) which was way too salty for my taste.\n\nI had ordered the fajita, which was just okay. The beans/rice/guac that came with were high quality but pretty sparse. It came with some pretty amazing flour tortillas though, which really carried the meal.\n\nFlan topped off my lunch here for dessert. It was definitely too sweet and soft for my taste, but was edible."
        }, 
        {
            "index": 467, 
            "rating": 5, 
            "review": "Yes! Yes! Yes! Si! Si! Si! I put hot sauce on my burrito babay!!! Make sure you try the fresh made guacamole! Can't go wrong with anything you try but if your unsure. Ask your friendly server and they will certainly lead you to a tasty choice!"
        }, 
        {
            "index": 468, 
            "rating": 2, 
            "review": "This was our second time coming. I was so disappointed on the service. I was so sad I brought my parents with me. There was so much mis communication between the staff. I should have left it with our amazing first experience last year."
        }, 
        {
            "index": 469, 
            "rating": 4, 
            "review": "Good place to eat good decor and good food and drink. Chili verde was good Cadillac margarita was good.. Nice service guac made fresh bean dip was good I'll definitely go again when I'm in the area"
        }, 
        {
            "index": 470, 
            "rating": 5, 
            "review": "Very good food ,the fideo was delicious . Had a party of 8 ,would have been nice to have more chips and bean dip than the 2 small bowls. Definitely will come back when in Las Vegas again. Prices are very reasonable ."
        }, 
        {
            "index": 471, 
            "rating": 5, 
            "review": "My lunch was delicious! The service was fast, our waiter Julio was very courteous, and the rest rooms were clean. I recommend this place for people who are looking for something off the strip when visiting Vegas."
        }, 
        {
            "index": 472, 
            "rating": 4, 
            "review": "Love this place the servers are always attentive. And make the dinning a welcome adventure, always great. Hoodie for authentic Mexican flavor! Margaritas spot on.. steak salad has been the best I've had in a long time. Thumbs up!!"
        }, 
        {
            "index": 473, 
            "rating": 4, 
            "review": "We're out-of-towners and came here on a recommendation from friends that frequently come here. They also recommended we try the Playa La Llorona (seafood platter). This dish is full of flavor, very tasty. There were various shrimp prepared differently. The crab legs were also tasty. The rice served in the platter was my favorite with a flavorful sauce that included fish and squid -- yummy!! Violeta, our server, was very gracious and friendly. Would definitely recommend this place and come back next time we're in town."
        }, 
        {
            "index": 474, 
            "rating": 2, 
            "review": "My family and I went to this restaurant on Mother's Day so perhaps I am being biased as I know most restaurants are out of control on that particular date.\n\nThis was my experience: We had a group of 9 and got seated right away. That was initially impressive! Our waiter was a man named Lorenzo. We ordered drinks, got our chips and salsa/bean dip rather quickly. We ordered our food and from then on it was a 45+  minute wait to receive the food. I think I would have been okay with waiting on the food if I didn't notice that all other families that arrived after mine were brought their food right away. Small or larger groups everyone else's waiters were ON IT; however, ours was not. I finally could not stand it any longer and approached him to ask if he could bring our food as each plate was ready, versus waiting on all of them to be ready entirely. He seemed annoyed at my comment, but noticing how slow he was moving kept irritating me.\n\nOnce the food arrived, I was starved and shoved everything down. I had a combination plate with Huevos Rancheros. The hand made tortillas that came with the meal were a nice surprise. However, the rice was bland. My huevos rancheros had a weak red sauce with no flavor. I asked around the table, and the variety on our table had burritos and fish combo plates, yet they all agreed that each item was rather bland. \n\nThe alcoholic drink selection although not that large, was very good. I ordered something called \"Que Viva la Borrachera\" and I have to say that probably saved this entire rating. They packed on the alcohol!\n\nI would consider this place for appetizers and drinks with a friend, but not for a meal."
        }, 
        {
            "index": 475, 
            "rating": 5, 
            "review": "Food is great and service is fast!!Awesome guacamole made to order tableside!!! \nChips with salsa and beans are complimentary!!!"
        }, 
        {
            "index": 476, 
            "rating": 2, 
            "review": "Okay I have been putting off this review for almost 2 weeks but I've finally got the time to explain why my rating for this place is only 3 stars! I came here with a co worker on a lunch break a little over a week ago. Greeting from the hostess was pleasant as well as the customer service from our waiter! Good we ordered was the tacos lengua(cow tongue) and my fish tacos! Everything tastes okay UNTIL I went to go eat my last tacos and noticed a baby ant hop off my plate O_o yeah and we all know ants just don't roll solo now do they? Know what this means right? There's clearly more and to what wasn't a surprise I glance over at the window seal and it's plenty more under this vase! YUCK! We immediately got our server who apologized and told us this wasn't likely well we decided to kill one of them and save it in a napkin for management and surely she came out thinking that it couldn't be possible.. She explained that they always clean very good.. Well apparently not because these ants been shacking up for a while. She apologized and gave us HALF off our bill which actually should've been completely comp'd and maybe even a gift certificate to try them again. After being grossed out I didn't even want a to-go box..not sure if i would've wanted anymore ants to bring home (a lot of pun intended).."
        }, 
        {
            "index": 477, 
            "rating": 5, 
            "review": "I went with a friend because I was really craving tacos and margaritas. I think we went on a Saturday night around 10pm. There was no wait. \n\nThe tacos were really good. The margarita with the 7oz corona with it was amazing! I seriously couldn't love the taste of it more! I definitely want to come back here again. The staff was also friendly."
        }, 
        {
            "index": 478, 
            "rating": 5, 
            "review": "Delicious chicken fajitas, fresh and tasty shrimp ceviche. Very attentive staff, from the bus boys,expo and server great guys. Bomb fideo soup, reminds me of grandma cooking that .Cannot wait to go back"
        }, 
        {
            "index": 479, 
            "rating": 4, 
            "review": "The service was really great, the atmosphere was incredibly authentic. The food was delicious. I would definitely come here time and time again. It also was really good for a larger group."
        }, 
        {
            "index": 480, 
            "rating": 3, 
            "review": "Food is good generous portions.  The acoustics in the restaurant are punishing, bordering on painful.\nImpossible to hear your waiter or dining companions."
        }, 
        {
            "index": 481, 
            "rating": 3, 
            "review": "Even though my husband and I have been here several times because it's the closest mexican restaurant to where we live...I will still give it 3 stars. Out of the about 6 or 7 times we've been there, food is always GREAT and Fresh...but unfortunately, we've never had great service. Either something is forgotten, they don't come around often enough to check on us, they bring out the wrong order, etc. I hate to only give this location 3 stars because the food is so good...but as far as the overall experience, I hate feeling \"forgotten about\" or a \"burden\" because I ask for a refill on my drink, then have to wait for 15 min to get it. : /"
        }
    ]
}