{
    "category": "Las-Vegas", 
    "entity": "Archi's-Thai-Cafe", 
    "avg_rating_stars": 3.7756097560975608, 
    "review_count": 410, 
    "reviews": [
        {
            "index": 1, 
            "rating": 4, 
            "review": "Dishes in order of awesome:\n\n1. pad kee mao with pork- spicy (although only a 5) with plenty of veggies. Weird to have lettuce underneath though. Pretty darn awesome.\n2. pineapple fried rice- addictive!\n3. pad thai- a tad sweet but still tasty\n4. house curry- not as rich as other curries but still alright\n\nLarge portions, good service, reasonable prices. I'd come again."
        }, 
        {
            "index": 2, 
            "rating": 5, 
            "review": "We order takeout from Archi's almost weekly. We love the crispy fried wontons, tom kha soup, pad thai, and yellow curry. We get the 6 spicy rating and it is perfect! I highly recommend this place for great Thai food!"
        }, 
        {
            "index": 3, 
            "rating": 5, 
            "review": "Archis has vindicated themselves. Today was a 180 degree turn around across the board. I guess last time they had an off night. My pops had the pad thai very tasty,solid. I had the silver noodle soup with pork to start...the ingredients so fresh and tasty seriously one of the best soups I have ever had..anywhere! I had the yellow curry with chicken also excellent. I asked for 3 on the heat and omg it was spicey lol..be careful what level you ask for....service was outstanding and pleasant. It is always a pleasure to write a great review....if they deserve it they get it and this place definitely showed that my first visit was a flook...without a doubt will return to this restaurant."
        }, 
        {
            "index": 4, 
            "rating": 1, 
            "review": "Was late from my work today due to stupidity of the waitress in Archi's Thai Restaurant. Stop by today and order food to go at 11:14am. Ill keep asking the waitress every 30 mins where's my order & waiting for almost 1hour & 30mins. Just find out that they forgot my order & missed up. Not even apologizing there mistake from the start & never even offer any discount or even just a decent apology for there mistake. Im not happy. I'm very disappointed and upset!!! Sad to say...been spending a lot of money here for almost 6times every month to dine-in with friends & take out order. This is was a worst experience I had with this restaurant. Never come back here again!"
        }, 
        {
            "index": 5, 
            "rating": 3, 
            "review": "My experience of Archie's from another location was notably better than this location. I may be trippin', but I don't think so either. \n\nPanang chicken curry- 4 stars. The other location was a definitive 5 stars. \nCurry fried rice w/ pork- 3 stars. The other location was also a definite 5-stars. \nStuffed chicken wings- 3 stars. It was good. \n\nI'll be heading over to the other location to get my Archie's grub on. But, I'd say it is one of the best Thai food in town from my experience at other location."
        }, 
        {
            "index": 6, 
            "rating": 5, 
            "review": "It's my favorite restaurant. Great food, excellent selection and great service. My favorite dishes are num tok beef and pad see-ew w/ chicken. I highly recommend this place"
        }, 
        {
            "index": 7, 
            "rating": 4, 
            "review": "Pyaar Indian Restaurant a few stores down...Y U WEBSITE SAY U HAVE BUFFET MONDAY BUT U NO OPEN MONDAY?!?!\n\nMaybe it was for the best...Original plan was to hit up Pyaar for indian buffet and get some spice and flavor on. Too bad it was closed but this couldnt have worked out better as a vast majority of people leaving their parked cars were migrating toward Archi's.\n\nShapow man ordered a beef salad which came real quick. My red curry lunch special took it's sweet time but what lacked in readily available made up in mmmm mmmm good.\n\nThe soup that is included with the lunch special was kind of a thai american fusion. It was chicken soup but was thickened and egg dropped. Thick cuts of onion, carrot slivers, and celery with decent sized slices of chicken white meat.\n\nI was overall impressed with the red curry. Medium wasnt quite as spicy as i was expecting ordering a medium but it had a very pleasant creaminess from the coconut milk. Lots of bamboo shoots which i love. Salad was perfectly dressed with a thickened fish sauce (i think) based dressing. Overall everything on that plate was friggin good.\n\nTotal damage done between an order of the red curry lunch special, a beef salad, and a cranberry juice: 21.49\n\nWait....what? the total damage rung up to twenty one fiddy?? Oh hells no i'm bout to come back a few more times."
        }, 
        {
            "index": 8, 
            "rating": 1, 
            "review": "We are frequent diners at both of Archi's locations. We use this one if we plan on seeing a movie. \n\nOur experience today will make us never come to this location again. We were seated promptly in their new section against the windows. We waited for 5 minutes before someone even approached out table. We ordered drinks and waited to have someone take our food order. Another 5 minutes. We didn't get anything crazy - 1 order of Thai egg rolls and 2 plates of Pad Thai. This took a little longer than usual but they were busy so it was understandable. However, we were only approached once for a refill and that's it. \n\nWhen I say that's it, I mean WE HAD NO MORE SERVICE. No one came to check on us again, no one asked if we needed to go boxes, no one asked if we were done and ready for our check. I tried flagging down our waitress since we were trying to get to our movie to no avail. Finally, my boyfriend left to purchase our tickets thinking I would be ready to go by the time he got back. Nope. He actually had to ask for our check and a box at the hostess stand. What a horrible experience. I felt bad for the people who got seated 2 tables down from us who had to wait 15 minutes to be approached. However, the people who came in 10 minutes after us and ordered, ate, and left 10 minutes before us (ordering more food AND getting refills and checked up on) maybe you could give the rest of us some advice on how to handle this place."
        }, 
        {
            "index": 9, 
            "rating": 2, 
            "review": "Ordered Phad Thai, Pad See ew, Beef Panang and Papaya salad. Papaya salad came in first and it was delish and while enjoying eating it, guess what, it has hair. I told the waitress they apologize and gave us a new one. Phad Thai came and it has no peanuts and just ok. Pad see ew was overcooked. Beef panang is not that bad but just ok."
        }, 
        {
            "index": 10, 
            "rating": 5, 
            "review": "I love how there food is authentic. I always order extra peanut sauce.& Thai tea! :)\nMy experiences with takeout and din in are always awesome!"
        }, 
        {
            "index": 11, 
            "rating": 5, 
            "review": "Ohhhh man this place was so good! I've taken take out before but couldn't remember how it was. We ordered the pineapple fried rice and this was the BEST! Definitely a must order. The size is pretty big I was surprised, enough for 2 people. Also ordered the pad see eww and it was good. Not the best I've tried but not the worst. Overall price, quality and amount of food is great!"
        }, 
        {
            "index": 12, 
            "rating": 5, 
            "review": "I just ordered takeout from Archi's and the food is amazing! I ordered the Green Curry with Beef (medium) and the Penang with Chicken (medium) and they're both delicious. Both were $9.95 each. It's exactly how spicy I wanted it to be. I've been looking for a really good Thai restaurant since I moved here and thankfully I've found it. The host was friendly and the place was clean. They deserve 5 stars!"
        }, 
        {
            "index": 13, 
            "rating": 5, 
            "review": "By far the best Thai restaurant in Las Vegas.  We drive across the city just for their food!!!! I highly recommend!!!!!"
        }, 
        {
            "index": 14, 
            "rating": 1, 
            "review": "So my I brought my folks here for a post-Christmas dinner. I ordered my favorite pineapple rice. Not only did they make it spicy, I found a strand of hair! So the server made us a new one. But it was still spicy. I have brought my guests and friends here many times but this experience ruined it. Makes me wonder how sanitary they are in the kitchen."
        }, 
        {
            "index": 15, 
            "rating": 5, 
            "review": "We can't get enough of this place!  It is the BEST Thai food in Las Vegas hands down.  You MUST try the Pad Kee Mao, nobody makes it better.  Their Thai Tea is also the best you will find in town.  Highly recommend!!!!!"
        }, 
        {
            "index": 16, 
            "rating": 3, 
            "review": "Friend and I ate here for lunch on a weekend in June.  I had the pad thai which I usually get at a Thai restaurant I've never been to before since pad thai is my benchmark of the eatery's cooking.  It was ok.  Restaurant decor was nice and service friendly.  \n\nThis was the second Archi's restaurant I've tried and I think I'll stick with the single store, mom & pop Thai eateries.  Actually, we only ate at this Archi's because the line to Bachi Burger was too long.  I would rate this Archi's 4-stars had I been there for a weekday lunch special.  As it was, with it's weekend menu pricing, the place was ok."
        }, 
        {
            "index": 17, 
            "rating": 4, 
            "review": "Food is ridiculously great! We ordered Spicy Basil (spicy level 3 is perfect, it's spicy enough that you can still taste the flavor) and the Panang (it is curry with a pinch of awesomeness).\n\nThis location, W Sahara and Ft Apache, is good if you are not in a rush. The staff is friendly but you will have to wait alot to get your drinks, to order your food, to get your food, to get your bill.... So on, you get the picture. This is why I give them a 4 stars.\n\nOtherwise, the food is amaaaaazing and it is perfect location for a date nite (right next door to a theater!)."
        }, 
        {
            "index": 18, 
            "rating": 2, 
            "review": "Kept hearing from everyone that Archi's is awesome.  Overrated in my opinion.  You sink in the chairs and feel like a child in a high chair and I'm a very tall person.  Food was not as good as my favorite Thai place - Thai style noodle house, and was more expensive.  Won't be returning.  Nothing stood out."
        }, 
        {
            "index": 19, 
            "rating": 4, 
            "review": "Great Chicken Pad Thai and Pad See Ew!\n\nEvery other dish I have gotten here has been good as well including soups and appetizers. \n\nGreat service too. Very fast and friendly."
        }, 
        {
            "index": 20, 
            "rating": 5, 
            "review": "The best green chicken curry ever! I recently found out about this place and have been going about twice a week Definitely my new addiction"
        }, 
        {
            "index": 21, 
            "rating": 5, 
            "review": "Hands down a very good place to have lunch.  The food was delicious and hot.  The service was good are cups are always full whenever are drinks are almost halfway.  Price for food is awesome especially for good large portions.  I will come again for lunch or even for dinner no doubt thanks guys."
        }, 
        {
            "index": 22, 
            "rating": 2, 
            "review": "Worse service ever. The tables around us were all complaining so this isn't me being overly picky. Food however was good."
        }, 
        {
            "index": 23, 
            "rating": 3, 
            "review": "I've heard lots of folks talk about this Thai place called Archie's.  this is my favorite kind of food. I've eaten here 4 times now. Ordered different food each time. I think the food here is good. Good I say, not great. I could not find anything that puts this restaurant above any other Thai restaurant. The price is high for the for the food you get. I recommend it but with a note added that the meals will cost almost double that of other good Thai restaurants."
        }, 
        {
            "index": 24, 
            "rating": 4, 
            "review": "Yesterday I came in with a friend to try out their fresh spring rolls and peanut sauce. I also ordered Kung Pao Chicken. I was impressed that the food was good and I did not have to wait as long as others. While devouring the spring rolls we were immediately served chicken soup or something like it. It was good. By that time our food was being brought out. I asked for medium by right away I determined I should have asked for HOT. Anyhow, Archi's delivered. Go try it for your self."
        }, 
        {
            "index": 25, 
            "rating": 5, 
            "review": "I can't believe I haven't written a review for Archi's! \n\nArchi's is really authentic! I haven't had a bad experience with them. I always order the seafood combo with green curry and their chicken pad thai. I also like their fried rice, spicy eggplant with tofu and seafood tom yum soup! :) i didnt like their thai tea though because it was very sour and bitter. \n\nService is excellent and food is really cheap! Come by and check it out!"
        }, 
        {
            "index": 26, 
            "rating": 3, 
            "review": "3 stars only because their food is good. Stopped by with my boyfriend at around 7. The place was full but not super full. We were quickly led to a table in the back corner and given two menus, great! I start looking at the menu but soon notice no one has passed by to ask us for our drink order. I look up at another table that had came in after us and noticed they had already received their drinks. Annoyed with this drink situation, my boyfriend starts looking around and then a male worker comes up to ask us if anyone has taken our drink order. We respond no and he asks us what we want.... okay, everything is fine. While we are at it my boyfriend asks for some crispy wontons..... the waiter says \"I'm not your waiter\".... ummm k......so he leaves and then two minutes later another girl comes by asking our drink order. We explained someone had stopped by already. This waiter theme continues throughout the night, literally 3-4 different waiters stopped by dropping things off at our table or to ask us something. Also, why is everything placed in the corner far away from the customer? Lol, I don't mind reaching, I just don't understand. In the end, we ate our food, it was great! I just didn't particularly like the service per say."
        }, 
        {
            "index": 27, 
            "rating": 4, 
            "review": "I have been to every Archi's location in Vegas.  You cannot go wrong with the food.  It is fantastic.  Service is good, but can be a bit unorganized when its busy.  Overall definitely worth going to."
        }, 
        {
            "index": 28, 
            "rating": 4, 
            "review": "My first time coming here for a friends Bday and to think I've been tolerating and spending my time at Original Thai BBQ and not have known about Archi's this whole time.  Best Thai dish I've had in Vegas and service is great also.\n\nFriend recommended the Chee Choo catfish in curry sauce. Ordered medium spicy which was not at spicy at all but other than that it still had the right touch of flavor and the curry sauce was good. But after trying out my friends spicy beef eggplant, it made me wish I ordered that instead."
        }, 
        {
            "index": 29, 
            "rating": 5, 
            "review": "Archi's for me always always been my favorite Thai spot in Vegas. I have been a fan ever since there first location on flamingo. Just seeing Archi's grow with two more locations all on my side of town not only makes it more accessible. I love seeing non franchise chains or that small family style run restaurant succeed. The thing about success and growing more restaurants is will the consistency be there at ALL locations. I can honestly say before I tried this location the one on rainbow my go to since closest to home. The food has been just as awesome, amazing, and on point every time. I am huge fan of the lunch specials! I also come lot for dinner with my brother family. I have never had bad dish on the menu. Some of my favorite are the spicy basil, any of the curry, and really can go on and on. Just ry it if never had Archi's. \n\nThis location it right next to the movie theater so makes for perfect before movie or after movie spot. Honestly that shopping center almost ridiculous amount of quality and assortment of food can get not just Thai food. Leave that for another review. Lol! \n\nTwo things that stood out for me came to this location versus the others. I felt like the lunch special portion was twice the size compare the rainbow location. I would order the same thing spicy basil with ground chicken. Swear the spicy basil was twice the size. The plate was full full compare to rainbow location everything looked nicely portion size. Just overflowing almost. Thumbs up for me!!! The dining area might be the same size as rainbow location but feel like bigger again maybe double in size. Fair the set up lot more different. The dining room has high ceilings compare to the rainbow location. Upfront almost like dining room next to dining room. Not as loud so comes lunch time or busy no need to shout out conversations. The tables not literally next to one another then rainbow location. The decor like definitely know walking into Thai restaurant. The service feel like they stop by more often check up on you. I went right around prime lunch hour and not as busy as rainbow location. \n\nOverall Archi's is my five star Thai hands down. Just happy not only do they have multiple locations but knowing that get the same great food at each one. Five star all on its own. Consistency..."
        }, 
        {
            "index": 30, 
            "rating": 2, 
            "review": "I stopped in for the first time last week for dinner and gave them a 5 star review. Today was lunch with my little one and I have to say the service was subpar. Food was still great so the cooks know what they are doing, but the service not so much.\n\nI ordered the lunch Pad Thai and a side of plain rice noodles for my one and half year old (didn't see any children's menu or offered a separate children's menu). \n\nSoup it came with was good. They brought out a bowl of rice which I thought came with lunch, and my food a bit later.\n\nNo noodles for the baby. Had to ask about 5 minutes into my own meal all the while trying to keep me quiet by giving him the rice which he just threw on the floor.\n\nThe baby started to fuss toward the end of the meal so I handed them my CC so we could get out of their quickly. When I got it and bill I noticed they had charged me for the rice, which I never asked for. Not wanting to flag them down and reverse the transaction I signed their copy and made a note on the itemized copy about the overcharge. \n\nBecause this place doesn't seem family friendly I will not be coming here on a regular basis. Maybe once in and blue moon for dinner when we have a sitter, but even that will be rare. In the meantime, I will be looking for another thai place that meets my expectations."
        }, 
        {
            "index": 31, 
            "rating": 5, 
            "review": "Good Thai food \nClose to the cinemas\nHad the tofu Kung post, veg fired rice and Lab chicken salad\nAll items were good \nQuick service and friendly staff"
        }, 
        {
            "index": 32, 
            "rating": 4, 
            "review": "Spur of the moment lunch time stop turned into restaurant love affair! That's what happened last weekend between Archi's and I. \n\nWhat a great find! What I loved immediately about this place was the warm, welcoming interior. I forgot that I was in a huge strip mall somewhere in Vegas.\n\nMy cucumber salad was sweet and refreshing and my chicken was delicious. The veggies were fresh and tasty. Our drinks were filled at all times, and we never went without anything we could need or want. \n\nThe prices were fair (really good lunch specials during the week, but we were there on a weekend). \n\nI think this is standard everywhere, but it still bugged me that we weren't able to just pay a little extra to upgrade to brown rice (we had to get the steamed rice that came with the meals and then pay for a huge side of brown rice). If that's my only real complaint about this terrific restaurant then I know I'll be back (but only when I have to be on this side of town). \n\nThere's something so exciting about stumbling in to a new place and being totally blown away by it. I'll be thinking of this restaurant and that meal for quite some time!"
        }, 
        {
            "index": 33, 
            "rating": 4, 
            "review": "Picked up take out, shrimp fried rice and ongchoi with pork.  Packaged nicely. \n\nExactly what I wanted.  Delicious !"
        }, 
        {
            "index": 34, 
            "rating": 1, 
            "review": "The service was horrible and the food was mediocre at best. I waited 25 minutes after ordering for my bland portion of prik king to come out. After eating, it took another 10 minutes for them to actually notice and bring over my bill. Will not be returning."
        }, 
        {
            "index": 35, 
            "rating": 3, 
            "review": "Just ok.  Nothing special.  Last time I was there was a hair on my plate.  Food is better then other thai places in summerlin.  I'll be back."
        }, 
        {
            "index": 36, 
            "rating": 4, 
            "review": "My go-to place for days when I can't be bothered to cook dinner and am looking for some real&good Thai food in a comfortable setting. I've come to always gravitate towards the red curry (at least lvl5 heat, because I love myself) and the spicy eggplant. The service has generally been great, and the food consistently hits the spot.\n\nTake-out here is also a great option; they usually take 15-25 minutes to prepare my order after I call in, which gives me enough time for me to make the drive to pick it up. The containers they use are also really convenient for storing any leftovers."
        }, 
        {
            "index": 37, 
            "rating": 5, 
            "review": "I was referred to this place from the Rocky Fritz store owner and said it's really inexpensive and they tasted good. So why not give it a try since I haven't had a Thai cuisine for 2 years already. I asked the server what can he recommend and he pointed out the Spicy eggplant which I like eggplant also and you can combine with your choice of pork, vegetables or seafood and I chose pork. Hmm for a skinny person like me I ate the whole plate LOL!!! My bf ordered Pad Cha2x and it tasted good also. So far I'm loving this restaurant already and will come back for more."
        }, 
        {
            "index": 38, 
            "rating": 4, 
            "review": "Beef noodle soup has great broth and is unique in the valley.  It comes with a lot of watercrest, bean sprouts and a lot of beef (brisket, tendon, and slices).  \n\nThe curries here are solid.  We generally also order the fish cakes for sharing which comes with a small sweet & sour cucumber salad with peanuts crust on top.  We can't decide which of the two is tastier! \n\nThere are many Thai places in Las Vegas, however the flavors are good here and quality is consistent."
        }, 
        {
            "index": 39, 
            "rating": 3, 
            "review": "I went there with my boyfriend and my best friend.  I ordered the pad Thai and it was delicious. The portion was huge,  (for only me) so I ate half of it and took the rest home. Prices are very affordable. The  only thing I dislike was how long we waited for the food. They also brought out my friends food first, which left her waiting another 10 mins or so until our food got there. I really liked it but it didn't surpass my expectations. The service was just okay, not too much attention was given like other restaurants. I will most likely visit again but Pin Kaow is still my favorite Thai restaurant. I would give it 3.5 stars!"
        }, 
        {
            "index": 40, 
            "rating": 4, 
            "review": "So Archi's turned out to be a hidden gem after going there for the first time, I thought the food was decent but not spicy as I had ordered. I LOVE spicy food- the hotter, the better. I know most people think they like spicy food and when you give them a mildly hot dish they start crying like a baby. Which is why I always order my dishes at the highest spice level a restaurant serves. And so, my first visit to Archi's I did as such and was disappointed by the lack of heat. I mentally crossed them off my checklist of my favorite Thai spots....  A month later I was craving Thai and Archi's is literally a block from my house so I gave them another try. After the first 5 bites of food, I was breathing FIRE!! I couldn't believe the extreme turn around of spiciness level and I absolutely loved it! \n\nArchi's has now become one of my top favorite Thai places and I know I can count on them to live up to my expectations. I work in a smoky bar and when I get home from work I usually feel sick to my stomach from breathing in second-hand smoke all day. The Tom Yum with chicken (level 10) always does the trick to make me feel better or cure a hangover. I also LOVE the Pad Pak w/chicken (lot's of delicious veggies with choice of meat), Garlic Pepper Chicken, and Red Curry. The only think I don't care for is the Pad Thai at this place. It's reddish orange for some reason....??"
        }, 
        {
            "index": 41, 
            "rating": 4, 
            "review": "Food is always good but service is not good. They've expanded the place but it made service worse. A lot of empty tables but a line at the door with one guy working register, seating people and acting as a waiter too!!! Normally I would get up and leave but food is good\nAll said and done I'll still come back\nAdios"
        }, 
        {
            "index": 42, 
            "rating": 3, 
            "review": "Dinner review only.  The red curry is very good! But the portions were small and I felt like the amount of rice was too small.  I prefer pin kaow."
        }, 
        {
            "index": 43, 
            "rating": 4, 
            "review": "I have driven past this place for awhile now and finally decided to stop in, WHOA I have been missing out, this place is awesome.  We were greeted immediately and given a nice booth. Our server was prompt, courteous and very informative. We loved the food and will be back for sure"
        }, 
        {
            "index": 44, 
            "rating": 4, 
            "review": "Good Food best thai food i town. \n\nThe only thing that we dont like about this place is when we come here around 9pm they start cleaning and mopping flor. Which is kinda rude and the smells of clorine is bad!"
        }, 
        {
            "index": 45, 
            "rating": 5, 
            "review": "A friend recommended this place to me because I could not find any Thai restaurants that can actually make Thai hot food.  This location has a scale of 1 to 10 but they have a secret scale you can go 1 to 30 on the Hot scale and now I have a new favorite Thai restaurant I will definitely keep coming back"
        }, 
        {
            "index": 46, 
            "rating": 3, 
            "review": "This Thai restaurant is quite a ways from the Strip.  We had went to another restaurat before Archi's, but that restaurant had too long a waiting time.  So we decided to try this place instead.  Fortunately, we had no wait time.  There was one table just waiting for our party of 4.  The ambiance was relaxing, and the restaurant was nicely decorated.  Staff was attentive without being intrusive, and the food came out quickly.\n\nSo, this is what we ordered and shared.  Beef Pad see ew for $8.95, ginger ginger ginger chicken for $9.95, spicy chicken basil fried rice for $9.95, green curry chicken for $9.95, and Thai iced tea for $3.95.  Everything tasted fine.  Not outstanding, but above average.  \n\nLas Vegas has so many restaurants to choose from.  If I was in the area craving Thai food, I would certainly drop by here again.  If I was not in the area, then I would not come all the way here to eat.\n\nOverall though, Archi's Thai Cafe is a good spot to eat.  If they were in my hometown, I'd rate them 4 stars.  In Vegas, though, because of all the choices out there....I can only give them 3 stars."
        }, 
        {
            "index": 47, 
            "rating": 4, 
            "review": "My fiancé and I went to Archi's when the kid was in school. We asked for the Pork Pad Thai. We also ordered the chicken panang and they both were a delight. \nThe restaurant was pretty comfortable spacious unlike many Thai bistros or restaurants. I appreciated the decor it was very nice inside. I gave it a four because they were not busy at all on our waitress was not really on top of our drinks. It was a warm day and spicy food ='s Need for water and Tea. After our meal we had some scrumptious Coconut ice cream after our meal and it helped cool us off. Being that the place is one block from our home it will be a new spot for me and my girl.\nI posted a menu link for this Thai restaurant. Hope you enjoy it as much as we did."
        }, 
        {
            "index": 48, 
            "rating": 5, 
            "review": "Definitely deserves a 5 star rating! My friends and I have been coming to the Archi's Thai Cafes for a few years now and we always order BIG family style! If you're lucky to get Pete at one of the Archi's, he's a real cool guy! We used to order the Catfish Delight until Pete highly recommended the Choo Chee Catfish at #3! Soo good! The mood is right for casual dining or if you'd like to have a good quiet dinner with a special person ;) Our friend is Thai and they said it's one of the best they've ever tasted!\n\n\nOur usual order looks something like this: Tom Kha soup, Choo Chee catfish, Pad Kee Maw, Lard Na, Eggplant beef, and LOTS of steamed rice! Hope you're prepared for some knockout food! Sawadee ka and bon appétite! (dang, three different languages?!)"
        }, 
        {
            "index": 49, 
            "rating": 5, 
            "review": "Always great food and people here....lotta people here for lunch...we love the chicken satay and Pad Thai combination house special."
        }, 
        {
            "index": 50, 
            "rating": 5, 
            "review": "Great service, ambiance, food, and the lunch menu is so affordable!  $7.95 for a half serving of entree, salad, egg roll, and house soup. I always have to pack mine up."
        }, 
        {
            "index": 51, 
            "rating": 5, 
            "review": "My wife and I ordered Pad Kae Mao (drunken noodles) Spicy Level 6 and Spicy Basil with Pork Spicy Level 7. \n\nThe restaurant has a nice and open layout. A good amount of space between tables. The waitress and servers were nice and attentive.\n\n- the drunken noodles was delicious. I usually order this in most Thai restaurants and this is probably the best I have had in Vegas (so far). I personally don't like Thai food that is towards the sweet side, and this was definitely very savory with a nice light basil flavor. There were lots of vegetables like mushrooms, baby corn, and green beans. The spice level was up there, so if you don't like spicy food, I recommend ordering much below a 6.\n\n- spicy basil with pork was an above average dish. It came with a tiny bowl of rice. With all of the sauce, I was hoping there would be more rice. The dish comes with ground meat, and we requested sliced pork instead and they accommodated us without any problems. There is a soy sauce, basil, stir fry flavor. I would probably try something else off the menu next time.\n\nAll in all - good place to eat with a convenient location next to the movie theater."
        }, 
        {
            "index": 52, 
            "rating": 5, 
            "review": "Best Tai food in the area. They get busy but it's worth the wait. Order to go and it's fantastic too. The environment is ok, a little crowded but not too loud. Chicken Satay is the best, next level delicious. Great! I could eat here everyday."
        }, 
        {
            "index": 53, 
            "rating": 5, 
            "review": "Great for take out! Just remember they are closed on Tuesday. Beef salad is amazing - choose a 5. Just the right amount of heat."
        }, 
        {
            "index": 54, 
            "rating": 5, 
            "review": "Hands down, one of my favorite Thai spots to eat.  I LOVE the thai beef jerky, nobody makes it like them.  I also love the pad thai, and the pad woon sen.  When someone says 'thai food', my brain immediately thinks about whether or not this place is open right then."
        }, 
        {
            "index": 55, 
            "rating": 5, 
            "review": "AWESOME thai tea. Love their ginger dishes. This place was really good, and service is always quick and friendly. Definitely a new favorite spot. I have been here about 3-4 times in the past month already!"
        }, 
        {
            "index": 56, 
            "rating": 4, 
            "review": "Consistent. Love coming here for casual dining. Very clean, friendly. The food is spot on. \nThis time around had the ginger, ginger beef and curry pandang wit chicken. It was delicious. \nGreat Thai food!"
        }, 
        {
            "index": 57, 
            "rating": 5, 
            "review": "Can't go wrong with the pinapple currie! I never skip it when I go here. I love the environment and the service is attentive, even though some can be stingy sometimes. The prices are on the high side. Have had desert here too and its really good. Great thai food altogether."
        }, 
        {
            "index": 58, 
            "rating": 2, 
            "review": "2 visits, 2 stars.  OK, so for the good and the not-so-good:\n\nI had eaten here for a late lunch and had the Tom Yum / Shrimp Seafood soup and hot tea.  I liked that you can control the spice level of the soup from 1 - 10.  The soup tasted very good, and very fresh too.  I left feeling very satisfied.  And, I liked the decorum and presentation of the place.  Its location is very convenient, near Summerlin right by the movie theater.\n\nI liked this place enough, that I decided to head back several days later for another lunch.  I wanted to try one of their salads.  \n\nBefore I ordered, I went to the restroom.  A worker from the kitchen was using the restroom at the same time, and I noticed that he did not  seem to wash his hands after.   While it is possible he might have washed his hands in the kitchen after he left, it is certainly not something I wish to speculate about nor think about when eating.  \n\nI would have said something to the waitress, but she was busy. I ended up leaving without ordering anything, and it is highly unlikely I will ever return."
        }, 
        {
            "index": 59, 
            "rating": 2, 
            "review": "let's be honest. the food is great here. The service? friggin sucks big one. they are so rude. I think our waitress forgot to put one of the dishes in. our crab fried rice came out when we were almost done with our meal. than she told us that crab fried rice takes longer than any other dishes to prepare. wtf? she must thought we were stupid. as i said, go there for food but don't expect good service. tall nerdy looking guy with glasses seem like he didn't care when I complained. PinKow is just as good and I always get good service there."
        }, 
        {
            "index": 60, 
            "rating": 5, 
            "review": "Delicious! I went here 4 times in 1 week. LOL...can't get enough of their curries."
        }, 
        {
            "index": 61, 
            "rating": 3, 
            "review": "So, i love the food. Its the best Thai restaurant I've been to EVER...butttttt recently the service there has been very poor over the past couple of months. the last two times I've ordered take-out, both orders were completely wrong and I've had them read it back to me as well to make sure we were on the same page. Apparently, i need to take out my entire meal from now on in the shop to make sure I've gotten what I wanted correctly...."
        }, 
        {
            "index": 62, 
            "rating": 5, 
            "review": "I love Thai Food. Like, a lot. And I'm super picky about my Thai. I moved to vegas about a year ago and tried a few places. They were all ok but none were really amazing that i had to go back. Then someone recommended Archi's. Since I'm giving it 5 stars (which honestly may not be enough stars), you can probably assume I love this place and go often. I have finally found my Vegas thai restaurant and will continue to go back. Pretty great deal on the lunch special with large portions. Can't go wrong."
        }, 
        {
            "index": 63, 
            "rating": 5, 
            "review": "Archi's is my go to Thai place in Vegas! Anything you get here is going to be delicious, no lie. Some of my favorites are..\n\nPanang Curry - I would definitely recommend this dish with tofu, it literally will melt in your mouth. The tofu is slightly fried so the outside has some texture and it is served over white rice. Sadly brown rice is an extra $2. \n\nPad Kea Mow - This dish is so satisfying and delicious. Best Pad Kea Mow I have ever had.\n\nTom Yum Soup - Sometime I will get this as an light appetizer before my main entree, but  be careful they make this REALLY spicy so get a low number for spice.\n\nPad Thai - always a winner.\n\nI also really like the red and green curries, pineapple fried rice, pad prik king, spicy basil and rad nar. \n\nThe service here is usually pretty good and the servers are attentive. The prices are reasonable and the food is always delicious. I can't get enough Archi's :)"
        }, 
        {
            "index": 64, 
            "rating": 5, 
            "review": "I love Archi's.  While it's not the place I go most often for Thai food, it's the place I go when I want a decent assortment of dishes on the menu and Thai food prepared consistently well.  There's enough variety there to satisfy what you're looking for most of the time:  appetizers, salads, soups, entrees (including curry and noodle dishes) and desserts.  I've eaten at the W. Sahara restaurant, and Rainbow Blvd. restaurant and found the food and service to be consistently good at both.\n\nLunch portions are almost as big as the dinner portions and include an egg roll and small soup.  They're definitely worth choosing from during the lunch hour.\n\nDinner is always delicious.  For those who enjoy Thai food, you'll see many of your usual favorites there.  If you're new to this variety of Asian cuisine, consider adding your choice of meat to the Pad Thai (everyone seems to love this dish), Pad Se Ew, Pad Prik Pow, or Broccoli.    If you're in the mood for curry, there are eight dishes to chose from and they're all good.  If you'd rather go with soup, I highly recommend Tom Yum or Tom Kha.  (Tom Kha is essentially Tom Yum but with coconut milk added to make the soup creamier rather than brothy.)\n\nI prefer the fried Egg Rolls (they're served warm, right out of the fryer) rather than the fresh Spring Rolls (served cold).  And if you've never tried one, don't forget to treat yourself to a Thai Iced Tea.  They're almost too sweet for me, but they still taste fantastic.  It's almost like a liquid dessert.\n\nFinally, like with most Thai restaurants, you can dial the spiciness up or down.  The waitstaff will ask, so go conservative if you're a little nervous and dial up from there.  You'll start to feel the heat with anything above a moderate level, and if you're adventurous, go for \"Thai hot\".  (But you better like spicy food.)\n\nParking (at the Sahara location) is ample since the restaurant is located in a storefront.  When you enter the parking lot, look for the Regal Cinema.  Archi's is to the right."
        }, 
        {
            "index": 65, 
            "rating": 1, 
            "review": "Terrible service... good food. The server took the order and vanished, never brought the requested spice tray nor refilled drinks. I think her name is Dhen. Unfriendly, coarse and unprofessional. But the food is consistently good."
        }, 
        {
            "index": 66, 
            "rating": 3, 
            "review": "I like Archi's but it's not the best.  It is nice that they opened up a decent Thai Place in Summerlin.  But the selection (veggie), is a bit small and run of the mill.  The atmosphere is nice, the service is good and the food is tasty, but something is just missing.\n\n\nI will go back because it's close to my parents, but I still prefer lotus of Siam."
        }, 
        {
            "index": 67, 
            "rating": 4, 
            "review": "Thai food is \"hit and miss\", and this is a \"hit\".\n\nThis is not exotic, like Lotus of Siam, but it is good, and the portions are generous.\n\nWe have compared this place to other Thai places, and also fee that the ingredients are good quality. \n\nWe have tried many of the appetizers and our favorite is the the stuffed wing.\n\nI suggest the Papaya Salad and the Panang Curry with Chicken. I go with a spice level of 5 or 6.\n\nMy wife's favorite is the Spicy Basil, spice level 8, but she's Korean.\n\nWe have also tried the other noodle dishes, and have been very pleased. \n\nI give them 4 stars, not 5 because the service is fair at best. You will meet the whole staff being served. One girl will take your order, another will bring you your food, another will refresh your water or iced tea, another will bring you your check. \n\nMake all your requests at one time, or you may have to hunt down your server.  We find ourselves frequently yelling for a bus boy, which is not considered rude in the Thai Culture. \n\nThis place is located next to a Movie House, so I think it's perfect for Dinner and a Movie!!!\n\nSettibello Pizza, Bachi Burger, 808 Hawaiian Tapas is also here. Skip these places and go to Archi's. Your taste buds and wallet will both thank you!!!"
        }, 
        {
            "index": 68, 
            "rating": 1, 
            "review": "I regularly go with my family and friends to this restaurant only b/c of the food. In the recent times the staff here became a nightmare the serving is horrible, they always mess-up the order and spice level, Zero respect to the customer (They think they are serving the food for free). I go so regularly (Almost every week) but my last visit made me decide never to visit this place again. This restaurant needs a serious discipline I request to the regular customer's to teach them a lesson by avoiding it. The owner of the restaurant has to put lots of effort to improve the behavior of the staff (The basic step welcoming the customers with a smile)."
        }, 
        {
            "index": 69, 
            "rating": 3, 
            "review": "I've eaten here a few times. The food is very good and the service is ok. The lunch specials are priced great. I do feel that they can turn it up and do much better with the service. The friendliness of the staff lacks genuine feelings.\n\nOn the last visit I ordered a cola to be served a can of cola and glass of ice. Really? No soda fountain! No fresh brewed tea? Ok so the food is good but they also deliver it at very spaced and awkward timing so not all parties receive their food at the same time."
        }, 
        {
            "index": 70, 
            "rating": 3, 
            "review": "Decent Thai food, but didn't quite blow me away. True to what others have said, they really do make \"spicy\" spicy. I ordered the tong yum soup and the red curry, both at medium spicy level, and both were indeed quite spicy (I am also a fan of spiciness). They were generous with with the seafood in the tong yum, and the curry was solid. Portions are also very generous. I\"m not from the area, so I can't comment on how it compares to other places in Summerlin, but it's decently good in my opinion."
        }, 
        {
            "index": 71, 
            "rating": 4, 
            "review": "Fine, Archi's....you win! \n\nThe Tom Kha soup here is soooo delicious, I start salivating (and sweating) just thinking about it! Coconut milk mixed with an abundance of spices like lemon-grass and basil...and cute button mushrooms....ugh, I want some right now! I get it with level 3 spicy and it's perfect. \n\nThey have a pretty complete menu of authentic Thai food here, and you can order Pad Thai noodles with varying degrees of spiciness (from 1-10). Pad thai is nothing special, and I've tried the Rad Na noodles as well, which was a little too saucy for me. Overall, noodles are like 3 star quality. \n\nAlso, if you order the Thai Iced Tea, get ready for a HUGE glass of tea :D  It's a little sweet for my liking, but they are very generous with portion size!"
        }, 
        {
            "index": 72, 
            "rating": 1, 
            "review": "There food is great but organization is a total shit show. They have no idea who is waiting and or who has to be seated. Sad because this was really close to my workplace. I'll continue to go to the rainbow location but this location sucks!"
        }, 
        {
            "index": 73, 
            "rating": 4, 
            "review": "This place is goooood. I came with a friend for dinner, and he ordered a pad thai while I chose the pineapple fried rice. The food was served quickly and the ingredients are fresh, and the prices are reasonable.\n\nInside it appears somewhat small, but the decor is very well laid out and there's a lot of open space. The nighttime dining atmosphere is well-lit to ensure you don't accidentally jam food up your nose instead of into your mouth.\n\nThere's not much service here, all they do is refill your water and hand you the bill, but it's likely the quality of the food will make you forgive them for the crappy service."
        }, 
        {
            "index": 74, 
            "rating": 4, 
            "review": "I have been a fan of this place for about 4 years. I finally got my husband to eat here and he is hooked! We both love the pad Thai which is super yummy. I also really like the Yellow curry with sticky rice. If you enjoy spicy foods this is your place cause they don't mess around when it comes to spicy!"
        }, 
        {
            "index": 75, 
            "rating": 3, 
            "review": "Great lunch specials. Nice location. Red curry is tasty good, Thai-Tea is classic."
        }, 
        {
            "index": 76, 
            "rating": 5, 
            "review": "When I first walked into this place, the atmosphere felt warming and it looked very authentic. Normally when I go to a Thai restaurant, I usually order pad Thai. The pad Thai tasted so delicious. The portion was just right, the spice level was on point also. The staff was also very kind and helpful."
        }, 
        {
            "index": 77, 
            "rating": 5, 
            "review": "Omg the food is so good! I only come here once every couple of months because my roommate and I are VERY fond of the Thai beef salad and its a little on the expensive side (about $40 for two including the Thai iced tea). Its totally worth it though. The shaved papaya is so fresh, meat juicy, and veggies crisp. Be careful with the heat though. I eat a lot of Thai food and judging how hot these places make your food is hard. I ordered the 5 my first time here and nearly choked it was so hot. The 3 was a little cooler but still spicy. This time I ordered the 2 and it was perfect. This place tends to ALWAYS be crowded. Its best to call in your order and then pick up. I made the mistake of just dropping by and had to wait in a line almost out to the parking area."
        }, 
        {
            "index": 78, 
            "rating": 4, 
            "review": "I love thai food and usually stick with Pin Kaow 3, but I had spotted Archi's Thai Cafe (during multiple trips to Bachi Burger...shh don't judge) and made a mental note to try it soon.\n\nI'm glad I did! Came here for a late lunch with friends. There were a handful of other people in the restaurant. Service was ok, the waitresses were mostly attentive but there were long gaps between water refills. Other than that, the waitresses were nice.\n\nWhat really made me happy I tried Archi's Cafe was that their spice level is actually SPICY! Their scale is 1-10 (like Pin Kaow and other thai restaurants) but ordering a 9 here, felt like a real level 9! \n\nIt was spicy, my lips were on fire halfway through my plate of veggie pad thai and I was in heaven. I consistently order spicy level 10 at other thai restaurants and it's hot but not truly spicy. Archi's did that for me."
        }, 
        {
            "index": 79, 
            "rating": 1, 
            "review": "Service is the pits. Get ready to settle in. We waited a hour for a take out order that had 3 appetizers, 3 entrees, and a soup. The Tom Yum Chicken soup was delicious, but everything else was just okay. Other places do it just as well, in a timely manner."
        }, 
        {
            "index": 80, 
            "rating": 4, 
            "review": "A co-worker and Yelp coaxed me in to trying this place and it did not disappoint.  I came specifically for the Tom Yum Chicken and it was quite delicious! (I'd have given it a 5, but I've never had Thai before so there was nothing to compare it to.)\nI ordered to-go...the cashier was very pleasant...and my order arrived quickly.\nI'll definitely be back!"
        }, 
        {
            "index": 81, 
            "rating": 4, 
            "review": "love Thai food.  we tried this place one random night the husband was away for work.  las vegas is a large grid.  so going down one main exit street could take hours to find the end.  we just moved here so we drove down 215 and found an exit to travel down one such street and chance stumbling upon a restaraunt we wanted to eat at.  \n\nagain, the streets can go on forever as ever.  we were almost to\nour own street [buffalo] so we had to decide fast.. \n\nwe came upon a plaza that had a jollie bee, a fancy shmancy, a couple other things... and archi's thai cafe.   though I told the kids they could pick what they wanted, I came out the winner in this game.  again, I love Thai food.\n\ntheirs lots of parking.. \n\nthe decor is very traditional thai and is a really good sized restaurant with lots of seating.  our waitress was friendly and though it was busy.. she never forgot about us.\n\nthe order:\n\nappetizer- stuffed chicken..  [wow]  the kids loved it..  my son, who doesn't often venture from the norm,  loved  this dish a lot.  super good..\n\ni had my usual yellow chicken curry mildly spiced and i they had an excellent curry..\n\nwon ton soup- the won tons were juicy and the broth flavorful.. the vegetables and slices meat slices were plentiful.  it definitely did not disappoint.\n\nshrimp fried rice- comes with a lot!  it's tasty.\n\nafter trying archis for the first time..  i'm a fan!\nwill definitely try the one closer to our house.. not sure when i'll ever see this particular location again.. but if i were closer i'd probably be a regular!"
        }, 
        {
            "index": 82, 
            "rating": 1, 
            "review": "Got here to The Sahara location at 9:28 and they are already cleaning up and the guy In the front says were only doing take outs. REALLY it's 30 mins until you close. Not 30 min until you lock the door and leave. I really hate placed that are in such a damn hurry to get out and close. I assure you the Owner of the company isn't there it's just the lazy workers who want to go home as early as possible.  I come here a couple times a month and have never experienced this.  Might not come back."
        }, 
        {
            "index": 83, 
            "rating": 5, 
            "review": "I loved Archi's on Sahara and was so bummed I would no longer be able to eat its yummy dishes when I moved back to NY.  I am in love with their stuffed chicken wings and their curries. All colors and flavors of curry are delicious.  Their noodle dishes are also quite good and soups. No dish has been disliked by me yet. \n\nOne bad thing is they are not open late. They're only open til 10p and for late night diners, this sucks. There are three locations which is a good thing though."
        }, 
        {
            "index": 84, 
            "rating": 4, 
            "review": "Best pad see ew and mint leaf/basil fried rice in town. However the pad thai is not nearly as good as in Pin Kaow by a long shot. Overall one of the better Thai restaurants in Las Vegas. It is clean and easy to find and very convenient if you live in or near Summerlin. \n\nOne area of constructive criticism since I do eat here often with the family: I would say is the customer service needs to be improved drastically since this is the only area that has a lot of room for improvement since their food is very good. It is not bad by any means, but they often appear disorganized. Some servers are better than others. Specifically, when lines start to form the given estimated times are more like guesses and substantially differ depending on who passing by at the front. It appears that having a hostess at the front at all times (during the peak times) would be a quick fix."
        }, 
        {
            "index": 85, 
            "rating": 4, 
            "review": "We've been going to the Archi's locations for awhile a couple years now and like in any location that we go to, I usually stick to our \"usual\" (Tom You Shrimp w/ white rice & calamari) because I have a fear called-- disappointment and I hate it. But I've been trying to get over my fears and one day we decided to venture outside of the usual. Our newest discovery was the Papaya Salad. Shredded Papaya with a sweet chili flavor type sauce and leaves of lettuce. My husband loves spicy food, so he gets (from a scale of 1-10) a 6, as for me, I am a fricking wimp when it comes to heat in my food so, I usually have a few bites and eat the crap out of the lettuce since it's mostly water and it's super refreshing! \n\nOther than the Papaya Salad, the food is like any other Thai restaurant and can assist with any fix that you're looking to get for Thai food. The thing that differentiates Archi's from other Thai restaurant is the fact that they pay attention to detail through service and presentation. Pure white plates and carved garnishes are usually small indicators that they care about- presentation. The decor of the restaurant is very modernized. Walking towards Archi's the first time, you'd assume that the place was as plain as the exterior of the restaurant... Not at all true. \n\nBoo! No refills on Thai Ice Tea!! Some restaurants refill, some don't and Archi's does not. That's the only reason why I knocked one star off."
        }, 
        {
            "index": 86, 
            "rating": 4, 
            "review": "I was never a big fan of curry, but Archi's has changed my mind.\n\nThere are several Archi's in Las Vegas, but this location is my favorite.  I love their pineapple chicken curry and they put the right amount of spice (#5). \nThe service is good, very friendly, and check on the customers regularly.  \n\nThe atmosphere is simple and the restaurant is clean.  I would definitely go back and must try an new item."
        }, 
        {
            "index": 87, 
            "rating": 1, 
            "review": "I loved their food till today. Customer service/management was POOR! A meal for one person at our table was completely forgotten, until we reminded the server of it. The server did not seem to understand that we were ALL eating a meal there at the same table at the same time. The meal was then brought out when everyone else at the table was almost done. Drink refills were never offered as well. To top it all off, NO apology was offered AND they would not adjust the bill. The management actually argued with us. That is NOT how you keep customers coming back. There will be a least six less Las Vegans dining there from now on."
        }, 
        {
            "index": 88, 
            "rating": 4, 
            "review": "Great meal. Tom yum soup hits the spot on a cool day. \nLast couple trips here it seems the soup and entrees come out very close to each other. I would prefer to eat the soup before the entree arrives. \nBut a solid meal everytime."
        }, 
        {
            "index": 89, 
            "rating": 2, 
            "review": "Archi's is a decent enough Thai restaurant - 3 stars - but when we visited today the manager/supervisor who seated us was surly and angry, for no apparent reason. She seated us and then came to the table 3 minutes later to take our order- \"are you ready\"(add attitude)...we ordered a few minutes later and she didn't say thank you, or do you have any questions... Menus taken away with a sneer... Saw her leave at 5pm, barking orders to her staff. Bad karma rolls downhill Ms. Supervisor/Manager ... Not coming back. RUDE."
        }, 
        {
            "index": 90, 
            "rating": 4, 
            "review": "I've never had a bad experience here! Food is good, reasonably priced and pretty quick. They have all the standard Thai dishes, so if you're looking for a good Thai place, you will probably find the dish you're looking for."
        }, 
        {
            "index": 91, 
            "rating": 3, 
            "review": "\"It was the best of times, it was the worst of times\", sums up our most recent visit to Archies. \"The best \" was the food. Pork Satay, Pad See ew and Pad Kea Mow are favorites and always perfect. \"The bad\" was the service. Usually its okay at best, but today they acted like we were interrupting them by showing up. Every phase of customer contact was terrible, from the time we walked in and waited at host stand for 10 minutes just to get a grunt of an acknowledgment. to the server who seemed almost angry with us. Would have given 5 stars if service was good. Will still go there, but no as often and will probably try other locations first."
        }, 
        {
            "index": 92, 
            "rating": 4, 
            "review": "Loved Archi's Thai Café.  It was recommended by a friend in the area, and it didn't let us down.  We had basil chicken, yellow chicken curry, pad thai, & fried rice.  My 1 & 4 year old devoured the pad thai and fried rice...this may be a direct result of the amount of thai food I consumed while pregnant with both of them. \n\nThe basil chicken and yellow chicken curry have to be some of the best I have ever had.\n\nWith that said, I had 2 babes with me and the service was a little slow, and less than attentive. They also put us in the very back corner, which felt a little like \"they have kids keep them out of the main area.\" It took a long time to get drinks and have our order taken.\n\nOh well, we had the back to our selves and my kids got to sit on the long bench and were stoked!  We will be back!"
        }, 
        {
            "index": 93, 
            "rating": 5, 
            "review": "I just moved to Vegas and this is my favorite place to get thai food! Their red, green, and yellow curry with tofu, and tom kha are heavenly! The wait is a bit long so if I get take out, I make sure to call at least 25 minutes ahead of time."
        }, 
        {
            "index": 94, 
            "rating": 1, 
            "review": "I absolutely love this place , the best Thai food in Vegas on my list but if we've been waiting for an hour already to get our order and everyone around us is already eating and we got there before they have ..... AND I have to say something and follow up on my order, there is something wrong ... On top of that the server did not own up to their mistake and at least say that she has forgotten about the order , \"it's busy\" she said... Okay... And so I give her another chance and she said give them 5 minutes ... 6 minutes later ... No sign of food coming towards our table ... Now we just look outright stupid for even giving them a chance ... HIGHLY disappointed ... I am so upset that I'm writing this review right after I walked out .. ARCHI's please increase your staff so your servers aren't running around like chickens with their heads cut off ... Smh"
        }, 
        {
            "index": 95, 
            "rating": 4, 
            "review": "Very good thai basil, independent of what you enjoy in it. I also must say the service is very good."
        }, 
        {
            "index": 96, 
            "rating": 5, 
            "review": "Clean restaurant.  Pad se Yu is out of this world. That's what I get at every thai place and this was by far the very best. Extra egg  to die for.  Getting take out tonight. Can't wait to try the fried rice."
        }, 
        {
            "index": 97, 
            "rating": 5, 
            "review": "I've been coming here for years and it's fantastic! I almost always get the Tom Kha soup with a side of rice, sometimes I get the pad Thai but it's always great no matter what. The iced tea is so great, kind of floral, and the service is always on point. \n\nKeep being great, guys! :)"
        }, 
        {
            "index": 98, 
            "rating": 4, 
            "review": "Good food, reasonable prices and clean, almost swanky atmo. \nI had papaya salad, tofu panang and some kind of delicious coconut soup...I ordered it a 7 on the spiciness scale of 1-10, and it was perfect. \nI would definitely come here again..."
        }, 
        {
            "index": 99, 
            "rating": 4, 
            "review": "Big fan of this place. They have a great lunch special that is priced very good. Last time I was there I had the sweet and sour shrimp. The spice level I chose was a 5, but wasn't that hot. Next time I'll try the 6. I definitely recommend this place to someone who loves Thai food."
        }, 
        {
            "index": 100, 
            "rating": 5, 
            "review": "Really love this restaurant! Good service, good food. Their beef salad is the best!!! :-) Highly recommend!"
        }, 
        {
            "index": 101, 
            "rating": 1, 
            "review": "Attempted to have dinner here, been to Archi's before for lunch many times at both locations.  Horrible service or just awfully mismanaged!  Waited 10+ minutes to be seated, wasn't ever even greeted (even speak some basic Thai).  We watched them setup a table for 2, our party was 3.  At that point we walked..not sure any of us will return."
        }, 
        {
            "index": 102, 
            "rating": 5, 
            "review": "Best Thai we have found so far after moving to Vegas.  An Extra Plus is that they have knowledge of Celiac Disease and what has Gluten.  We had family visiting for a conference.  We showed up for dinner.  We were seated promptly.  Pad Thai was some of the best I have had.  We will return, especially on a movie night!!"
        }, 
        {
            "index": 103, 
            "rating": 3, 
            "review": "To be honest I've been coming here for such a long time and the flavor is really good. Recently I noticed that they are becoming stingy on meat. I didn't order a full plate of onions with 7 pieces of beef. (Which really just happened) Sadly, I'm disappointed because when I complained they came back with the same amount of meat but with more peppers to make the plate look more full. I won't be coming back."
        }, 
        {
            "index": 104, 
            "rating": 4, 
            "review": "Really enjoyed both lunch meals I've had here.  Authentic and fresh ingredients a winner. Check their lunch specials. I especially like the red curry.  The Thai ice tea is also a nice addition."
        }, 
        {
            "index": 105, 
            "rating": 2, 
            "review": "Its ok. I have had better Thai food. The resto is nice inside although they are so busy. Maybe we got the wrong dishes but the dishes we had like the Thom Kha was nothing spectacular. It was average. I had high expectations because of what I heard from people but unfortunately it did not rise to the occassion."
        }, 
        {
            "index": 106, 
            "rating": 4, 
            "review": "\"You never know how strong you are until being strong is your only choice\"\n- Bob Marley\n\nArchi's Thai Cafe was the first Thai spot that really stood out to me and got me hooked. They had my favorite Pad Kee Mao for years. Now, I typically go to other places because I have found almost all of my favorite dishes done better at other Thai restaurants, but Archi's remains consistent and I'll probably always have a soft spot for some of their recipes.\n\nMy love really enjoys the Yen-Ta-Fo at Archie's. I know without a doubt that if I stop by to pick her up some soup I can always pick up and enjoy some Pad Kee Mao or Panang Curry for me. While the Pad Kee Mao is not my absolute favorite version of Pad Kee Mao anymore, Archie's is still a very good and robust one, with lots of character...easily one of the better versions in town...throw in the fact that they do so many dishes well above average and you won't hear me complain about coming here."
        }, 
        {
            "index": 107, 
            "rating": 4, 
            "review": "My favoriteThai restaurant in Summerlin area .Price reasonable, clean,service fair. I love Pad se ew, beef with broccoli, thai tea and pad thai."
        }, 
        {
            "index": 108, 
            "rating": 4, 
            "review": "Ordered to go two times so far and have been thoroughly satisfied both times. I've visited a few other Thai places in the valley and have yet to found one worthwhile. Sadly I think this is the first place I've been to that had somewhat fresh vegetables. I think Archi's is \"the one\"!"
        }, 
        {
            "index": 109, 
            "rating": 4, 
            "review": "Im a fan for the food, not the service. We got seated fairly quickly, however, it took about 5 minutes for someone to come to our table for the first time. Eventually I ordered the Pad Thai lunch special with a #2 spice level. (Spice levels range in 1-10, with 10 being the hottest) Which came with soup of the day, which our waitress neglected to inform us of, a wonton, an egg roll and of course the main dish. When the soup arrived it was OK. I asked the waitress what it was and she said coconut milk something or rather. And thats all....while the broth was good, the ingredients werent. There were thee brown hard circles, chicken, something that looked like lettuce or cabbage, green onions (I think) and carrots. I wasnt impressed. Then our main dish came out. The Pad Thai was a little too spicy for my liking and way to peanuty. I ended up only eating the wonton and egg roll and having to order a whole other meal. That was annoying. I ordered the fried rice in place of the Pad Thai and it was amazing. Thats what I go to Archi's for in the first place. The down side is I ended up paying basically $16.00 for fried rice due to me not liking my first order, they wouldnt take it off my bill. In summary: I would go again, not during lunch, and play it safe with items ive ordered there before."
        }, 
        {
            "index": 110, 
            "rating": 5, 
            "review": "Love this place! The Pad Thai is sooooo good! Be careful though, we looooove spicy food but the level 5 spice is almost too much for us to handle!"
        }, 
        {
            "index": 111, 
            "rating": 5, 
            "review": "I love this place! I've been to Thailand many times, and it taste just as good."
        }, 
        {
            "index": 112, 
            "rating": 5, 
            "review": "I was introduced to Archi's by a friend of mine shortly after moving to Las Vegas in September and I have been hooked ever since! Honestly I think I stop in or take home an order at least once a month. Their beef pad thai and pork satay skewers are two of my staple favorites.\n\nTheir lunch special is a great deal with a ton of food that usually adds up to at least two lunches if you take half home like I do.\n\nThis place is truly dangerous being a couple blocks from our house but we love the food and the service so I know we will continue to be happy customers!"
        }, 
        {
            "index": 113, 
            "rating": 4, 
            "review": "Finally, FINALLY, got to tick this place off my restaurant bucket list, where it has aged for several years.  Three Archi's in Vegas, and this was a first for any of them.\n\nA restaurant that has our favorite wine, Riesling, as their house wine gets an extra star in my book, because it's never happened before.  Kudos!\n\nWe started with Tom Kha, and it was up there with the best we've ever had, loaded with white meat chicken and lots of flavor.  How did it know it would be just what the doctor ordered for the flu I'd come down with the next day?\n\nFor once, I managed to convince Herb to let me take a break from our chicken-infused life, and we ordered the Garlic Pepper Shrimp.  I was in heaven!  It was delicious, and had a good-sized helping of the elusive (at least in my culinary world) crustaceans.  I even convinced him to eat a few, since there were too many for me.  That's because there was yet another chicken dish to dig into.\n\nCountry Curry (with chicken, natch) wasn't as successful.  It was okay, but a little too bland, though we'd ordered it medium.  The waitress took it back to the kitchen for an additional helping of hot stuff, and it was vastly improved.  We've been a little skittish ever since going to Australia and learning what REAL Thai \"medium\" is like, i.e., smoke pouring out of your ears, so AmeriThai medium turns out to be not spicy enough too often.  \n\nService was excellent, and even though we got there late and were the last people to leave the restaurant, we didn't feel rushed.  \n\nI'm looking forward to trying some of the other dishes on Archi's menu, and maybe even one of the other locations."
        }, 
        {
            "index": 114, 
            "rating": 5, 
            "review": "I often order from the lunch menu.  My go to lunch order is ginger ginger chicken.  Food is served quickly and it's a fresh made to order food!\n\nFresh Thai food at good price."
        }, 
        {
            "index": 115, 
            "rating": 4, 
            "review": "Consistently great Thai food. They are always busy for a reason. Pad Thai, pineapple fried rice and pineapple curry are all fantastic. Service is attentive and fast."
        }, 
        {
            "index": 116, 
            "rating": 2, 
            "review": "This was my first time at this location- I usually go to the Rainbow location. The food tastes the same. I got the Tom Ka, Pad See Ew, and Panang. My friend likes to eat very spicy food and I can handle only some bang bang! in my food so we agreed on a level 5. The food came out in a good amount of time. The soup came out first, and it was very good. My only complaint was this - the restaurant wasn't that busy, and our waitress took our order by memory. I understand that there are alot of people out there with stellar memories and take orders like this all the time, but she was not one of them. When we first gave our order, she messed up our meat selections for each dish several times. We wanted beef pad see ew, shrimp tom ka, and chicken panang. She had to recite our order to us several times. I even suggested jokingly that she should write it down just in case she mixes it up! She just laughed and said she got it. Trustingly, my friend and I were like ok, and we weren't worried. When we finally got our food, every dish had the wrong meat selection. We were thinking about sending it back but we were too hungry to even argue. All in all, never coming to this location again"
        }, 
        {
            "index": 117, 
            "rating": 5, 
            "review": "My boyfriend and I visited this restaurant based on a recommendation from our new apartment manager. It was delicious! Very authentic and affordable. I ordered the fried wonton's as an appetizer. For my main lunch, I ordered the Pad See Ew, and it reminded me of my mama's cooking! \n\nOur waitress was very friendly and was quick to take our orders (even though it was quite busy that afternoon). We will be going back to enjoy more of their food and service!"
        }, 
        {
            "index": 118, 
            "rating": 5, 
            "review": "Best Pad Kea Mow in town if you ask me and the Basil Fried Rice is just too good.  I eat my meals here at spice level 9 or 10 and it has such flavor - but be warned some say the spicing is hot (not to me but I think something is broke with me - can't get it hot enough).  \n\nFriday's soup with lunch specials is a fantastic coconut chicken soup (Tom Kha\n\nAlso a must try is the Papaya Salad - great with a Thai beer.\n\nAnd if you love Curry then get the red curry with chicken and buckle up."
        }, 
        {
            "index": 119, 
            "rating": 5, 
            "review": "I've been wanting to try this thai restaurant for years; passed the rainbow location (the 1st one?), noticed the drive-thru window, convenient. I even checked out the website a few times. Finally, we got the chance today for lunch. We are not on this side of town much, though it's not too long of a stretch (just one street). We watched a movie, caught a matinee bright and early, the first showing. It was noon. There were quite a few diners but it is spacious, so it didn't feel crowded.\n\nThe ambiance is very elegant and pretty, with many dark rich solid wood pieces of furniture, giving you the feel of being in a resort lobby---it is one of the prettiest thai restaurants around. I thought they were for show but they were functional. The decor on the walls were simple (silk greenery variety) and ornate (wrought iron looking, rectangular-shaped). Seating is mainly chairs and tables with some bench seating. There were touches of alters but nothing large (or gawdy, for that matter). The kitchen is well concealed but you can hear the cooking activity (it isn't very distracting that you don't enjoy your meal, if you can still carry on with conversation, it's all good).\n\nI was so excited to dive in, I didn't take any pictures, but I can still see the delicious dishes in my head. (Before we went into the theater, we checked out the menu on Yelp, so we knew what we wanted.) We ordered the fried rice, chicken and yellow curry, chicken, which came with a bowl of steamed white rice. It was so yummy. The fried rice was flavorful without being overly salty. It was big. The curry dish was excellent. We had seconds but we also had leftovers. It was a little over $22, without the tip. \n\nThe wait didn't seem long at all. The staff was nice and our server was attentive, refilling our waters without us asking. (We got greetings both on our way in and as we were leaving.) \n\nI am sure we will be back as my husband loved both dishes, and I loved it too. Really satisfied our thai food cravings."
        }, 
        {
            "index": 120, 
            "rating": 5, 
            "review": "Really good thai food with quick service. Portion sizes are decent. Average pricing."
        }, 
        {
            "index": 121, 
            "rating": 5, 
            "review": "What a great restaurant.  The food was delicious and so very reasonably priced.  We had pineapple curry with pork, pad prik king (spicy green beans) with chicken, vegatable chow mein, white and brown rice.  We each had two beers and the check was a very reasonable $53 with tax.  Plus there was enough left over for lunch one day this week.  The service was right on target, the food hot and delicious.  What more could one ask for?  Really great meal."
        }, 
        {
            "index": 122, 
            "rating": 4, 
            "review": "My third favorite of the three Archi's locations around town. It's the farthest from me, so therefor the one I frequent least. \n\nAll my same favorite dishes apply to this location. Curries, noodles, soups and eggplant are always my favorite. I still steer clear of the chicken dishes. Pork, tofu, catfish and shrimp are the way to go usually.\n\nMy Thai obsession knows know boundaries and Archi's (all locations) is always there to feed the addiction. Cheap, clean, good service and food. That's all I ask for in a great restaurant and Archi's delivers every time. \n\nI don't order drinks here either. I hate having to pay for refills. Only my favorite Archi's on Rainbow has a fountain.\n\nGood for the location and especially right before or after the movies."
        }, 
        {
            "index": 123, 
            "rating": 4, 
            "review": "Came in here for lunch for the first time today. My husband orders from here pretty regularly during the work week and he said it's great so I figured I'd try it out. Ordered the chicken pad thai and the basil chicken. SO YUMMY! Service wasn't bad at all, had about 3 different members of the staff come to see how we were doing, refill our drinks pretty regularly and ask if we were enjoying our meal or if they could get us anything.\nWill definitely be back!"
        }, 
        {
            "index": 124, 
            "rating": 4, 
            "review": "The food is great!! Had chicken pad Thai level 5. It was the right amount of spicy. Service not so great. Was never offered water. When they came to take my order still waited to be offered water. Nothing. I called the busser over and asked for a thai iced tea (which was delicious). No one came to check on me to see if the food was good or if I was finished. I had to wave a waitress down to say i was ready for my check. But the food is great."
        }, 
        {
            "index": 125, 
            "rating": 5, 
            "review": "Food is always great. We love the Beef Salad and Panang Curry. Very friendly atmosphere."
        }, 
        {
            "index": 126, 
            "rating": 2, 
            "review": "Big restaurant, nice decor, great tasting food but really slow service. I waited over 30-minutes for what was supposed to be a quick lunch. Didn't leave until an hour later and late to work. \n\nHere's the thing, Las Vegas has a huge Thai community. Therefore there are many Thai restaurants where the food is just as good with far better service and efficiency. normally i don't do  this but as I was walking out and people were walking in, I recommended they go elsewhere if they we hungry because of the wait time."
        }, 
        {
            "index": 127, 
            "rating": 5, 
            "review": "The best Pad Thai noodles in the Valley, bar none.  If you haven't had a chance to try their Pad Thai noodles,  you're missing out.  If you do decide to give it a try, you may want to consider trying their shrimp fried rice too.  The best thing about this spot is that they're consistent.   Enjoy!"
        }, 
        {
            "index": 128, 
            "rating": 5, 
            "review": "LOVE Archi's! Always a clean and friendly environment to enjoy a meal. Yellow curry with chicken and shrimp is always a favorite with a side of brown rice (rare in town) and has a few specials for lunch. Never a long wait and the restrooms are immaculate here. A pleasure to come to Archi's! Z"
        }, 
        {
            "index": 129, 
            "rating": 5, 
            "review": "One of the best Thai restaurants on the west side.  My boyfriend and I eat here a lot.  We usually order the Chicken Pad See Ew, Chicken Pad Thai and Tom Yum Kai.  The Pad See Ew is one of the best I have had, ranking up with the ones I ate in Bangkok.  The Pad Thai and Tom Yum Kai are very good as well."
        }, 
        {
            "index": 130, 
            "rating": 4, 
            "review": "Great Thai! The green curry was loaded with chicken and had good flavor, not the BEST I've had though. Their spice scale is serious, more intense than most. Papaya salad was huge, but missing more dried shrimp- I hardly saw any."
        }, 
        {
            "index": 131, 
            "rating": 3, 
            "review": "Food is great, service is not-so-great.\n\nWe came in at 6:30 today with a 3-person group and ordered everything. After 10 minutes, we got some water. I kept asking if our food was on the way and they kept saying it's coming soon. I kid you not, I waited an hour for an appetizer to arrive. The waiter might've messed up my order because an appetizer did not show up, but that was normal, so it didn't bother me. What bothered me was a couple groups came after us and they got their entrees and all the food way before us, within 20 minutes. I asked why it took so long, and they started explaining that bigger groups get superiority. Uh-no. We came in a good 15 minutes before them and got nothing. That's a weigh over money (larger groups), rather than taking care of customers in an etiquette manner. I found this completely unfair. We should at least be given food at about the same time, not 40 minutes later. At least the food was good."
        }, 
        {
            "index": 132, 
            "rating": 4, 
            "review": "Had to get my dishes 0 spicy because I was sharing them with my child.  Lo and behold, everything was still mighty tasty! Service was good & the food came out fairly quickly."
        }, 
        {
            "index": 133, 
            "rating": 5, 
            "review": "Just happened to be roaming around in our neighborhood and wanted to try something different, new atmosphere and food well this was it! After reading the reviews on Yelp we proceeded inside. Service, atmosphere all a ten! OK so far so good. We decided to order many , many items to try and get a feel for the food and the cook. Was expensive that way but now we know what we'd order next time since the portions are very generous and food was so delicious!  Was craving lots of fresh crunchy vegetables and we got it! Fish cake was completely different from anything we've ever had before was so, so good! Really we loved everything we ordered and my husband is very picky about his Asian food growing up in Hawaii,  well he loved it and we will be back!"
        }, 
        {
            "index": 134, 
            "rating": 2, 
            "review": "Great food, horrible service!!! Our server practically ignored us the entire time. She forgot to put in our order and didn't even acknowledge that it took around 30 minutes for our food to come out. Then she continued to avoid our table because she knew she screwed up. Instead of fixing the situation she just made it worse. This will only be a \"take out\" spot from now on."
        }, 
        {
            "index": 135, 
            "rating": 2, 
            "review": "I heard and saw so many great reviews about this place so I was really excited to finally try it. We ordered Thai iced tea, yellow curry, and pad see-you. I guess I'm spoiled with all the good Thai places in town but I felt like the portions were small and the prices were slightly overprices by at least a dollar on each entree. The teas were overpriced too and not that great. I've had better elsewhere. As for the ambience, the location is convenient, there is plenty of parking, and the interior is nice. There are nice upgrades that you wouldn't find in other Thai spots like shutters and engraved drinking glasses but I care more about the food than the decor."
        }, 
        {
            "index": 136, 
            "rating": 3, 
            "review": "Enjoyed the lunch menu, nice selection and good value for money.\n\nThe red curry with tofu was a little light on tofu, but delicious.\n\nReally appreciated the staff putting tables together to accommodate our large group, after I called about 30 minutes ahead to give them notice we were coming.\n\nCareful!  Closed Tuesdays!"
        }, 
        {
            "index": 137, 
            "rating": 5, 
            "review": "This is my favorite thai place in Vegas. I recommend the Pad See Ew, curry or class Pad Thai. You can also sub tofu or veggies for meat so it's very vegetarian friendly."
        }, 
        {
            "index": 138, 
            "rating": 4, 
            "review": "Archi's on Sahara serves up very solid Thai food. I live very close to this location and order takeout frequently, but I have eaten in the restaurant many times as well - I recommend both!\n\nMy favorite things on the menu are the pad see ew and tom kha ghai (chicken coconut soup). I love the broth so much that I usually order extra broth and less of the soup contents. Once it didn't work out so well - I got home to find that they had written \"extra broc\" on the top of the soup container and the entire soup was filled with broccoli! :) Even though it wasn't what I wanted, it still scores them a point for doing anything a customer asks, even when broccoli isn't actually an ingredient in the soup!!\n\nThe curries, salads, and other appetizers are quite good too (except I've never been a huge fan of the spring rolls, which are normally my favorite thing at a thai place). Prices are very reasonable and everyone is friendly. Not the best thai in Las Vegas, but good enough to keep going back!"
        }, 
        {
            "index": 139, 
            "rating": 5, 
            "review": "Best Thai Food in all of Las Vegas.  Freshest ingredients, clean, inviting space and excellent service.  This is a go to place to take out of town guests for lunch or dinner.  A+"
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "I love Thai food and this spot hits the mark! Great food, excellent selection and awesome service. The Stuffed Chicken Wings are a must and the Silver Noodle Pad Woon Sen is better than what I've had in China Town. Good morning,\nI didn't receive your phone call to update me on the status of my pending lab consultation. While I do understand how incredibly busy your office is, I would like to point out how unbelievably insignificant I have been treated as a new patient. I'm not sure who runs the office and it bears mention that I have shown up with an appointment only to feel like a drop in. If there's no specialist available to aid in my treatment please let me know. Thanks and God bless.Plus it's next to the movie theater! Thai food and a movie, my idea of a killer date!"
        }, 
        {
            "index": 141, 
            "rating": 2, 
            "review": "This is actually my second time here. The first time, we waited ten minutes to be seated at the almost empty restaurant. We eventually gave up before walking two does down to Bachi Burger. I decided to give it another try. I have to say, both food and service are unimpressive at best. I will not be returning."
        }, 
        {
            "index": 142, 
            "rating": 4, 
            "review": "The pad Thai was delicious! We came here when my parents were in town (from the Midwest) and neither have ever really had Thai food before. They both loved it. My mom, who hates spicy things, ordered pad Thai with 0 heat. I forget what my dad ordered, but he asked for a 7 on heat. Now, my dad has burned most of his taste buds off over the years from eating spicy things, so most things advertised as spicy barely register for him. He said the 7 was fine, it had some heat, but it wasn't too much. I didn't see a kids menu and didn't think to ask for one, but my kids, who are fairly picky, ended up eating fried rice with no problems. I really enjoyed my experience at Archi's and can't wait to go back."
        }, 
        {
            "index": 143, 
            "rating": 3, 
            "review": "Great food....not so great service. Arrived at 11:55 and we're seated promptly. Waited forever for everything else as did the ladies next to us.  Waitresses wouldn't even make eye contact us \nwe had to speak up to get their attention on multiple occasions.\n\nYes - I'll return again since the food was so good and affordable...."
        }, 
        {
            "index": 144, 
            "rating": 3, 
            "review": "Again, fighting a cold so soup was on my mind.\n\nSurprisingly a lovely restaurant located in a strip mall with dark wooden tables and white shutters on the windows.\n\nWe sat down right away and ordered off the lunch menu, I was the exception. I ordered the chicken Tom Kha and some Thai Iced Tea.\n\nI have to say the broth was very good and it was hot but the chicken was overcooked and rubbery.  Thai tea was very good served with lots of ice.\n\nOur food was served right away but they were slow to pick up dirty dishes and slow to drop off the bill.\n\nOverall it was okay but I won't come running back...at least not for the soup. I may come and try other items."
        }, 
        {
            "index": 145, 
            "rating": 5, 
            "review": "My favorite Thai place by a landslide. I go here on an almost weekly basis. Pineapple fried rice is a MUST. Panang curry is another favorite of mine (basically a thicker curry sauce, referred to as a gravy). Hope they get delivery soon."
        }, 
        {
            "index": 146, 
            "rating": 5, 
            "review": "My wife treated me to dinner tonight here at Archie's. My first time here and it was delicious. We were seated immediately. Service was great. Food was delicious. They removed our dishes in a timely manner so there was no clutter on the table. We got our check when asked and to go boxes. Everything was great. Definitely recommend for awesome Thai food."
        }, 
        {
            "index": 147, 
            "rating": 4, 
            "review": "I always like going to Archi's.  Nice folks and good place to get consistently good quality Thai food.  This location has a nice ambience and hasn't been too horribly crowded when I've been.\n\nGet the stuffed chicken wings.  Best in town.\n\nLately, we've just been getting food to go.  Last time we just walked in and ordered and got our food in 10 minutes.  Awesome!  \n\nSpice levels are from 1-5.  3 isn't really spicy at all so if you want spicy, go for a 4 or 5.  In my experience, this restaurant doesn't do crazy Thai spicy and they have been pretty conservative with the spice, at least with us."
        }, 
        {
            "index": 148, 
            "rating": 4, 
            "review": "Very cheap authentic Thai in a nicely appointed dining room.  \n\nI liked the spicy basil beef.  They also have a great coconut soup with shrimp.  Definitely home made and tasty.\n\nGo as spicy as you can handle or keep it mild!  Gooood Food!"
        }, 
        {
            "index": 149, 
            "rating": 5, 
            "review": "Archi's is my go-to  Thai place! \n\nExcellent service, awesome location, and most importantly: YUMMY FOOD!! And oh my goodness, the portions! So much food! Even this fatty couldn't handle it. But hey, I love leftovers! So Archi's is perfect for me :)\n\nThe interior is decorated with dark wood and a lot of different decoration pieces. It feels more like eating at someones [rather large] home than in a generic restaurant setting. \n\nThe food was so good! We got Chicken Pad Thai (10), Kung Pao Shrimp (9) and Mongolian Beef (9). So good, my mouth is watering just thinking about it lol. Food quality was great. Prices were on par with any other Thai place so it wasn't expensive. \n\nLocated next to the Regal Movie Theater in Village Square and close the the Coldstone (dessert, anyone?)"
        }, 
        {
            "index": 150, 
            "rating": 4, 
            "review": "I stopped in here the other night before a movie, without having done any research or prior yelping, which is very unusual and risky for me! The menu is vast, and prices pretty decent for the area, selection, and ambiance. I had the drunken noodles with beef and a HUGE portion was delivered. Tender wide rice noodles arranged on a bed of fresh veggies, wood ear mushrooms, lettuce, and flavorful beef. Around $13 w/ tax + tip I believe, quite the bargain and provided me with leftovers! Would go back if I was in the area."
        }, 
        {
            "index": 151, 
            "rating": 4, 
            "review": "The food is very tasty here.  When the server says a dish is spicy believe her or him!!  \nThe bathroom (women) was disgusting, however, and looked as if it hadn't been checked for an hour or two. In all fairness, I did let somebody know so I imagined it was looked into."
        }, 
        {
            "index": 152, 
            "rating": 1, 
            "review": "Ridiculous pick up service.  I put in an order and they said it would be 25 minutes because they were backed up. Then, when we went, we had to wait ANOTHER 25 MINUTES!  During that time, they could have cooked many other meals which they did.  They helped all the people in the restaurant first even though they told me it would only take 25 minutes.  Plus, we went to pick up the order ourselves.  If you are backed up, you need to tell people not to come and give a better wait time.\n\nWhen I called in to complain, the manager was not very nice.  He wasn't very apologetic and just said he would talk to the person taking orders.  He didn't offer a discount or any other good will.  We have been to that restaurant countless times and the manager was very rude.  He just hung up and wasn't willing to talk it through and just complained that it was \"very busy\" today.  Instead, he should have offered some sort of discount or something else for having us wait for so long.\n\nDo not order take out from them.\n\nLast time we did it online and then found out the restaurant was closed because all of the servers had quit that day.  \n\nThis time we ordered and had to wait an additional 25 minutes.  What is the point of ordering take out if you have to wait that long.\n\nFinally, BEWARE when you order certain dishes.  We have ordered some dishes like curry, and the entrees, and the portion sizes are extremely small.  They aren't even big enough to fill half the plate.  I think when they are busy, they split the dishes into 2 so they can accommodate 2 take out orders."
        }, 
        {
            "index": 153, 
            "rating": 4, 
            "review": "Food wasn't bad, only problem was the wait. They don't take reservations and it was hard getting a table. At least the food was good enough to bring it up to 4 stars. Quality is way better now than 6 years ago which was the last time I was here. Friendly staff. Kinda loud and was hard to hear my gf I felt like we were shouting at each other."
        }, 
        {
            "index": 154, 
            "rating": 4, 
            "review": "Amazing! Had the pad puck with shrimp and will definitely keep going back! My bf also had the sweet and sour chicken & shrimp. Again very good. Spring rolls as an appetizer and we were all set. I hope they do carry out because I'd love to have them even when I don't feel like sitting in."
        }, 
        {
            "index": 155, 
            "rating": 5, 
            "review": "I've been coming to Archi's for years! (The rainbow and warm springs location) and the service never disappoints- the staff is friendly & quick. Also, the atmosphere is always extremely clean and modernized with a nice \"cultural\" feel. And don't get me started on the food! Everything is decently priced and i've never had a dish that I didn't like- Id recommend the Thai macaroni, pad Thai, or their chicken chow mien!"
        }, 
        {
            "index": 156, 
            "rating": 5, 
            "review": "My go-to place for thai food :) Although it's kinda far from my house, I still like to come here whenever I want thai food.\nI have tried green, red, and panang curry, pad thai, pad kee mao, pad see ew, tom yum kong, pineapple fried rice. All of them are amazingly good.\nThe portion is pretty decent for the price too.\nService is decent, the waiter/waitress always have a smile on their face, which is a good thing.\nDefinitely worth a try :)"
        }, 
        {
            "index": 157, 
            "rating": 4, 
            "review": "They got the best food out of all the Archie's I been in but their servers don't really check on customers when they get busy. I see them standing around a lot making the orders come out slow. And some servers only get nice when its time to pay the check and determining how much tips to give them. BUT other than that, service is okay, food is amazing especially their PAD THAI."
        }, 
        {
            "index": 158, 
            "rating": 5, 
            "review": "I have really been wanting some good Thai food. A co worker told me about this place. Turns out it's around the corner from me. Hubby and I ordered the stuffed wings, (Sounded interesting) and I'm so glad we did. They were delicious, served with a spicy sweet sauce, yum! We ordered larb. They made it perfectly, with just the right amount of spice. We shared the beef salad with lemon dressing. The sear on the beef was perfection and the dressing was very refreshing. Hubby had a pork dish, pad prik pow (yes, that's really the name), but it was great. The service was very fast, friendly and done with a smile. I highly recommend this place. Excellent food, even if some of the names of their dishes sound.......wrong. Lol"
        }, 
        {
            "index": 159, 
            "rating": 5, 
            "review": "5 stars for this visit. Food was ready in the exact time they told me for my takeout order. All the food we got was excellent. Best Thai food restaurant that we've been to in the Summerlin area - and we've tried a bunch. Glad they got their takeout business on track and glad I came back for a 2nd try."
        }, 
        {
            "index": 160, 
            "rating": 1, 
            "review": "Good food if u like it! If u r new and don't the service on behalf of the management is HORRIBLE!!! Pete the manager not only compared our experience to others on the sales item, but wouldn't be courteous enough to remove the item. I have NEVER heard of the customer when dining having this matter. \nI enjoy the food but because of treatment will NEVER eat here again!"
        }, 
        {
            "index": 161, 
            "rating": 4, 
            "review": "I finally found a thai place by my house that it pretty good! I'm a huge fan of thai food and have been desperately looking for something comparable to the restaurants back in Denver, CO.  I  recommend this place for the yummy pad thai!"
        }, 
        {
            "index": 162, 
            "rating": 3, 
            "review": "Would recommend their food to anyone.  Vary tasty and good specials.  Customer service is questionable at times."
        }, 
        {
            "index": 163, 
            "rating": 4, 
            "review": "This place is consistently great.  I've been here for lunch and dinner and enjoyed it every time.\n\nFor lunch, I definitely recommend ordering off the lunch section on the back of the menu.  Food is great and the price is a good deal.\n\nFor dinner, I recommend starting out with the Tom Yum soup.  Noodles are fantastic, as are the curries, and the fried rice is delicious.  The only disappointing thing I've had was the shrimp roll appetizer.  It was whole shrimp wrapped in rice paper and deep fried, which was not at all what I was expecting.\n\nOne thing to note is Archi's has a few restaurants around town and the numeric scale they use to tell how spicy you want a dish is not consistent.  A 4/10 at one location is more like an 8/10 at another."
        }, 
        {
            "index": 164, 
            "rating": 4, 
            "review": "High quality, VERY authentic (I lived in Thailand 2+ years), great atmosphere and wait staff.  The only reason I give this a four instead of five is that the menu is a little shallow and uninspired"
        }, 
        {
            "index": 165, 
            "rating": 4, 
            "review": "I love this place. The food is always good. It's consistent. I always order the Panang or masaman curry, pad Thai, tom yum soup, spring rolls, Thai beef salad, and spring rolls. No complaints. The service is good too. Not spectacular, but good."
        }, 
        {
            "index": 166, 
            "rating": 2, 
            "review": "We were quite disappointed that we ordered a meal to share - portion quite adequate and some leftover - however, sooo hot and we only ordered a '2' in hot... other than that - good service, clean, probably tasty if we could taste it over the hot..."
        }, 
        {
            "index": 167, 
            "rating": 5, 
            "review": "My absolute favorite Thai in Las Vegas.  \n\nThe Pad Thai at Archi's is excellent.  It almost has a buttery quality to it.  This is one of the spots I always take friends or out of towners and they are always pleasantly surprised.  \n\nYou will be happy at any of the three Archi's locations.  The Ft. Apache and South Rainbow locations are newer and nicely decorated.  The original spot on Jones and Flamingo is tiny and old but tasty as ever.  \n\nLunch specials are great.  I usually teeter between my favorites, the spicy basil beef, and the pad thai.  Other delicious items on the menu: papaya salad, spicy eggplant, mango with sicky rice, thai iced coffee.\n\nThey offer brown rice - always a nice option.  \n\nPrices are right, food is delicious.  Archi's is a 5 star Thai experience."
        }, 
        {
            "index": 168, 
            "rating": 5, 
            "review": "I remember when Archi's was the namesake for Thai food 25 years ago when it sat on Flamingo/Torrey Pines and didn't have a liquor license.  I have eaten a lot of Thai food since then and finally stopped in their new location at Village Square.  I had what may have been the best pad Thai ever.  Everything was excellent.  Had the beef salad, spicy basil beef, chicken pad thai, tom kha soup  and red curry chicken.  The only plate that I was not blown away by was the red curry chicken. The curry was excellent, but I think it was the chicken slices that could have been better. They were a little flat and dry.  But seriously this is one very small complaint.  Everything else was exceptional and again, best pad thai in a long time!!!"
        }, 
        {
            "index": 169, 
            "rating": 3, 
            "review": "Food is very good and the price is reasonable but the service tends to be on the slow side. So don't go there if you are in a hurry.  Be ready to spend time."
        }, 
        {
            "index": 170, 
            "rating": 4, 
            "review": "Archi's is fine gourmet Thai cusine that have higher standard of quality restuarant over all Thai resuarants as well as all others type.Focus only on few popular dishes that would be everyone favorites is hit the local market of can't live without it.All locations are cleaned service is good.You always will be happy with the test of Thailand here.The prices and sizes are awesome."
        }, 
        {
            "index": 171, 
            "rating": 4, 
            "review": "Not bad for a good Thai restaurant. I've gone to all of Archi's Thai restaurants and I believe this one is the BEST! I came to this Thai restaurant with my cousin many years ago. After many years of not going, this restaurants seems to get BUSIER every time and GAIN popularity. \n\nFrom my last visit (3/ 25/16), I ordered their Chicken Pad Thai, Beef Salad, and many more at this restaurant and it's very GOOD and DELICIOUS!\n\nI RECOMMEND coming here because this Thai restaurant is the best around this area. They have good staff but I recommend coming around 2-5 p.m. because they are not that busy around that time. Otherwise, you will be waiting for your food at least over an hour with the place crowded and servants busy."
        }, 
        {
            "index": 172, 
            "rating": 1, 
            "review": "I went there for dinner tonight and had a most annoying experience ever. They greeted us so I told the worker 2 adults and 3 kids. I need 2 high chairs and room for a stroller. Then a girl took us to a big table which was perfect. She brought us 2 high chairs and kids were all seated and we got everything situated then they told us we needed to move because they thought there was more people. That place wasn't even that busy. I was annoyed but just swallowed and got all the kids and went to a different table. It was a same size table that they sat us! So we were trying to get situated again and someone came and told us to move to a smaller table. I was annoyed AF and the girl saying I thought more people.. WTF do they not understand English or just plain stupid? I was so pissed we decided to leave. They didn't apologize or anything. If you're stupid then that's fine with me but don't be wasting my time and energy. Definitely not going back there."
        }, 
        {
            "index": 173, 
            "rating": 4, 
            "review": "Decent service. Food tasted great. Real restaurant quality. \n\nI love how much amount of food they give you. Its usually more than enough so I take them home and enjoy them later on. Tastes just like other delicious thai restaurants but with more food.\n\nEspecially for pad thai, i've had better pad thai but just cannot go anywhere else anymore because of the amount that this place give us.\n\nI have two favorite thai restaurants and this one is one of them."
        }, 
        {
            "index": 174, 
            "rating": 5, 
            "review": "I love this place, its a little expensive but they do have a lunch special suring the weekdays....you get the choice to pick how spicy you want your plate 1-10"
        }, 
        {
            "index": 175, 
            "rating": 4, 
            "review": "The service  is so good.   Their lunch specials are very good, and the portions  are large.  Excellent Thai food."
        }, 
        {
            "index": 176, 
            "rating": 3, 
            "review": "Nothing to write home about but not horrible.  Probably wouldn't want to come back since there are other options for Thai nearby."
        }, 
        {
            "index": 177, 
            "rating": 2, 
            "review": "Pad Thai was a little salty and greasy... and they charged my friend $1.99 for extra rice !!!  Been coming here several times already and not been charged extra for additional servings of rice (which is the usual for Asian Restaurants)... Rice is like water to most Asians... should be free !"
        }, 
        {
            "index": 178, 
            "rating": 3, 
            "review": "Came in for lunch. Such a cute place.soft instrumental music playing. Clean big comfy chairs, but the food took a while. The service was poor, but I enjoyed their food."
        }, 
        {
            "index": 179, 
            "rating": 3, 
            "review": "I don't know why I keep going back to this place, it hasn't been a pleasant experience the last three times I've been, I need to remember to scratch this place off forever.  The service is mediocre and the food is not what it used to be.  Waiters do not bring food out in unison and the food is no longer exquisite, flavor is just not the same anymore."
        }, 
        {
            "index": 180, 
            "rating": 3, 
            "review": "Neat little place, the food was great but like other reviewers the service was lacking. It wasn't busy when we arrived but an hour and a half to wait for food is kind of ridiculous. Also, they forgot one of our dishes which took another half hour after asking about it three times. By then the place was busy. And three hours later we finally got our check."
        }, 
        {
            "index": 181, 
            "rating": 4, 
            "review": "Food gets four to five stars. Service gets three to four. To be fair, I went on a Saturday night so they were busy.  Their prices are lower than I would have expected. All in, it's a good restaurant. I will go back."
        }, 
        {
            "index": 182, 
            "rating": 4, 
            "review": "i was a little hesitant to try another thai restaurant in vegas because it felt like i was betraying LOS by doing so. but my friends (both locals) were very convincing so we decided to finally try this place. i'd have to say this is not a bad \"other thai option\" if one is craving thai food and don't have the time to wait (or was unable to make a reservation) at LOS. \n\nthe tom kha was good, the glass noodles (forgot the thai name) was one of the best noodle dishes i've had, the combination fried rice was well seasoned and could very well be a full meal on its own, and even the spicy basil pork was pretty tasty. the only thing that was amiss at our table was the red curry. it was like 3/4 bamboo shoots. will never order that again. \n\ni ordered spicy level 2 but next time i think i'll try a 3. \n\noverall, this is a solid thai restaurant."
        }, 
        {
            "index": 183, 
            "rating": 4, 
            "review": "If you're looking for some solid Thai food, this is a place to be.  It definitely appeals to the American palate. Their food is a great introduction for those looking for something different and savory."
        }, 
        {
            "index": 184, 
            "rating": 5, 
            "review": "I really like Archi's. Good food, nice ambience, fairly inexpensive and close to my house. What's not to love?\n\nSince discovering Archi's I've stopped going to my old, cheap Thai eats place, Thai Style Noodle. When I can pay an extra $2-$3 for an infinitely better dish, it's a no brainer. The noodles are great. I usually get the Pad Seeyoo(sorry about the spelling) or Pad Thai. Both great options, but it really depends on the day. The chefs are usually pretty consistent.\n\nThai Basil Fried Rice is good too and the curries are delicious. One of my only complaints is that even though they ask you your spiciness preferred level (1-10), their tastes usually run hot. No biggie, but when I'm with people that want mild, they expect mild and I don't want them having a bad time that night or the next day.\n\nAnyways, Archi's is now in my restaurant rotation so I hope they continue to stay yummy."
        }, 
        {
            "index": 185, 
            "rating": 4, 
            "review": "I wanted to grab a bite to eat before seeing a late night movie next door. We arrived around 8:30 pm so I thought whatever I get should be light. Then I thought again ...I'll order a side of Pineapple Fried Rice just in case. My husband ordered the Thai Beef Salad which has grilled top sirloin, tomatoes, red onion, cucumber, green onion, cilantro, and hand-tossed in spicy lime dressing . That salad never lets me down..it always turns out really good. I ventured away from my usual chicken curry dishes and wanted to also order a salad. I chose the Papaya Salad that had sliced green papaya, tomatoes, green beans, peanuts, dried shrimp, and spicy lime dressing. When I read it on the menu my eyes failed to see the dried shrimp. I was picturing nice big juicy shrimps on top of that salad. When they served it I thought \"Maybe I forgot to mention the shrimp\" ..because I couldn't see them. I started eating the salad and my husband starts eating it too. Then I tasted the little dried up shrimps which are smaller than the peanuts so they are barely noticeable. I dare not say a word because my husband loathes mostly all seafood and he already ate half of of the dish! It was a nice crunchy salad because of the papaya but I didn't mind. If I were to get this again I would have them leave out the dried shrimp because I'm not a fan of it. I also had my safe Pineapple Fried Rice which has Jasmine rice, stir fried with tomatoes, onion, green onion, pineapples, cashews, raisins, egg and cumin powder. It's a nice melody of flavor that blends nicely together. I had to stop myself from taking more than a few bites so I wrapped the rest of it for lunch for the next day. We ended with the Mochi Ice Cream which comes with three flavors we chose Red Bean, Green Tea and Strawberry for my husband.( He has a hard time trying new things) I always enjoy the ambiance here because it's relaxing and the food is delicious!"
        }, 
        {
            "index": 186, 
            "rating": 3, 
            "review": "I love Archi's! I've been eating here for years. But I have to say the west flamingo location shits on the west Sahara location, in service and consistency. On flamingo, I know the pad Thai is always going to taste the same and the service is on point. Sahara.. The food is always good, but always different. And the staff is never in a hurry. Tonight I saw one server in the entire dining room. As it got busy, she looked like a deer in headlights. Really? Get more help! This happens every time I go there."
        }, 
        {
            "index": 187, 
            "rating": 5, 
            "review": "Been this location 3X plus 2 others. Hidden deep in rear of lot next to movie theater on NW corner.  Pad Thai noodlesw/shrimp combo, spicy eggplant, Kung Pao w/pork, Pineapple fried rice,  All delish! I got level 4-5 spice and do not consider that to hot, but I like bold, spicy food. If you don't get zero heat or only 1.  The Thai iced tea is so good and different. Tea but rich and spicy, creamy and you get a huge glass.  I recommend you tell the waitress to go light on the ice but am hooked on it and going to beg for the recipe. This is not for people in a hurry on a 30 min lunch. Everything is custom cooked, hot, fresh and delicious. You get your choice of meat w/each dish and choose your heat level. The lunch combo includes a side of greens, spring roll and cup of soup with your entree all for about $7-$9 depending on your meat choice. Good for Vegan's too.  Best Thai I've found!"
        }, 
        {
            "index": 188, 
            "rating": 5, 
            "review": "The BEST Thai food in town!\nArchie's deserves 5 stars for the great food, ample portions, friendly & efficient employees, and a clean restaurant.  I have never been disappointed and I eat there regularly \nIt doesn't hurt that the restaurant is next door to a Regal theater which makes the combo a perfect date night destination."
        }, 
        {
            "index": 189, 
            "rating": 4, 
            "review": "Amazing place, full of authentic decor and ambiance! Papaya salad is so refreshing and full of flavor. Combination pad thai with pork beef and shrimp is enough for two meals.  Thai toasts for an appetizer consists if minced chicken and shrimp baked on toast served with cucumber salad. It us a must try!!"
        }, 
        {
            "index": 190, 
            "rating": 4, 
            "review": "I have to comment on the service here above all. Our waitress brought paper for my granddaughter to draw on. When she got fussy she gave me the check quickly.\n\nI had the Pad Soon Wen. The bean sprouts were crisp and the egg bits tasted freshly cooked. For $2 more I had five shrimp. The shrimp were pretty big. To be honest I would rather have seven medium shrimp especially for two dollars. \n\nThe food was good and the service was great. I will definitely visit again."
        }, 
        {
            "index": 191, 
            "rating": 1, 
            "review": "My first review on Yelp. And I had to leave a review here.\nOh my holy God. The WORST of the WORST!\nIt was my first time at a thai-sh restaurant and I truly do wish I could write a happy, positive, 5star highly recommended kind of review but I can not and you will know why in 2 seconds.\nI found two pieces of tapes(LONG) inside the chicken noodle soup after having a couple bite. I first thought it was a piece of uncooked noodle because the texture was similar, but it was a piece of shittttt!!! Imagine what would have happened if I swallowed it by accident? Thinking of, 'oh this one piece is not cooked throughly, but its oki doki my stomach is strong enough to digest anythang' \nAnyways, I called the server A.J and he apologized sincerely along with a free dinner (we prolly ate about 15% of the dish)which really did stop me from calling the health department for a further investigation. Seriously I feel sick right now."
        }, 
        {
            "index": 192, 
            "rating": 4, 
            "review": "Whoa. Their Thai iced coffee is gargantuan! I forgot to look and see how much it cost but I could only finish about 1/4 of it and so the rest went to waste. :( I also ordered a red curry with tofu and it was very good even though I only ate maybe 1/10 of it. I liked the fact that the tofu was lightly fried which means less fat! My friend Adam kept me well distracted and I totally forgot to eat my food. Oops. \n\nThis place is casual, nice, clean and spacious. It's right next to the movie theater so you can grab lunch or dinner before the movie. I kind of wish we had more time so I could try the mango and sticky rice dessert. This warrants a return trip in the near future!"
        }, 
        {
            "index": 193, 
            "rating": 5, 
            "review": "Archi's is by far my  favorite Thai restaurant in Vegas. I've been coming here with friends for the past couple years now and the food here is to die for. You can get your food however spicy you want it ranging in a scale of 1-10 of how spicy you want it. I've always left this place with a smile. They have great service and three convenient location here in Las Vegas. Definitely a place to go for some good Thai eats."
        }, 
        {
            "index": 194, 
            "rating": 5, 
            "review": "My wife loves the Tom Yum soup, and the Thai iced tea is great.  I pretty much like everything on the menu. We always visit this place when we're in Summerlin."
        }, 
        {
            "index": 195, 
            "rating": 1, 
            "review": "I went there today and it was absolutely horrible....service was something I normally would have walked out but I was meeting someone there....It took at least 10 min of waiting there before anyone greeted me and I was the 2nd table in the whole restaurant. I finally had someone greet me and I asked if I can have there WiFi password and they dont offer that...which ruined my whole meeting. \n\nThere were at least 4 servers on the floor and none of them cared that we were sitting there.....Service is not worth it but food is good."
        }, 
        {
            "index": 196, 
            "rating": 4, 
            "review": "One of my favorite Thai places in town.  Whenever I am on the west side of town craving Thai food, this is where I go.  I feel like it used to be cheaper then it is now, which was part of the reason I loved it so much."
        }, 
        {
            "index": 197, 
            "rating": 1, 
            "review": "We had a bad experience at the restaurant. We ordered fried rice and their country curry; the fried rice came out 10 minutes before the curry and it got cold, the servers did not check up on us to inform us about our curry dish or even help to improve our experience, and the country curry was not prepared up to its usual standard. As we were leaving the restaurant, the owner was standing at the register and counting cash, and he did not acknowledge our complaints. There are better Thai restaurants all around town that maintain a standard of service and this restaurant did not have it."
        }, 
        {
            "index": 198, 
            "rating": 4, 
            "review": "The food was amazing, but the thing that lost them my 5 stars was the service. There's this one male server with the tattoo sleeve that continued to avoid giving us service. His coworkers were great, but his lack of service was what killed it."
        }, 
        {
            "index": 199, 
            "rating": 4, 
            "review": "Location wise is perfectly situated right by Regal Cinemas in Village Square! Conveniently accessible for those hunger cures before of after a movie.  For those unfamiliar...Archi's Thai Cafe may seem like another Asian/American Fusion like PF Changs...or pick up stiX...but in fact when one takes a closer look, 100% Authentic Thai is clearly shown.  Try and behold for this is true.  Upon first walking in, the restaurant feels small, but the wooden shutters, and wooden tables and chairs balances this out and gives you a good feel of solidity to its decor.  This is not your usual Asian themed furniture but don't let this fool you, for the food is as good as it gets.  \n\nWaiters will take your order and ask you from a level of 1-10 how spicy you would like your food to be, and plenty enough to satisfy all types of taste buds and spice level to handle.  Tom Kha may not be for everyone but It is a great little soup starter like won ton soup for Chinese food.  Price could be cheaper, but the quantity of food is decent enough and good enough for the price.  I don't know if your typical person would go everyday, but nice to have once in a while.  Thai food is comparable to Pin Kaow or Lotus of Siam\n\nArchi's is clean and food comes out at a respectable time frame. A little advice tho, get there before 6pm or off times because after 6pm the restaurant starts to get busy and picks up a lot of customers...you may have a line out the door or wait.  Others must think it is good though to keep coming back for more.  Give it a try...It is pretty good."
        }, 
        {
            "index": 200, 
            "rating": 5, 
            "review": "You know the food is good when you're full but want to keep on eating. Had the red curry lunch special. Delicious. Really great price for what you get."
        }, 
        {
            "index": 201, 
            "rating": 4, 
            "review": "Love getting their Pad Thai and Spicy Basil. On top of that I get a Thai Tea. Best one Thai food I had in Vegas so far!"
        }, 
        {
            "index": 202, 
            "rating": 5, 
            "review": "I tried Thai food here for the first time with my girlfriend and her family and let me say, this place is amazing. The service is great and so is the food. I get Chicken Pad Thai with a level 4 spicy and it's just the perfect balance of noodles and chicken with just that kick of heat to turn up the tastiness!!!!"
        }, 
        {
            "index": 203, 
            "rating": 3, 
            "review": "Eh, i honestly don't see what the hype is about. Pad thai was mediocre to say the least-had no tofu, the noodles tasted of shrimp (never tasted that before) and it was spicy after i specifically said \"no spice\". Service was below an \"eh\" but above \"awful\". I asked for extra napkins and instead of responding he walks away so my friend asked if he heard me. I waited to see what he would do before i said anything and he ended up walking to a station to get napkins...is it that difficult to say \"sure\" or \"yes\"? Not the worst thai place but i will definitely be visiting OSHA in San Fran next month!"
        }, 
        {
            "index": 204, 
            "rating": 1, 
            "review": "I've been to this location a few times before and its always been good food and good service however I met up with my friend just 45 minutes ago and I couldn't wait to get out of there! \nWe walked in and a girl with a bob haircut was at the computer, she looked at us and looked back down at the computer then looked back up to us with the most miserable facial expression. Um 2 please. She grabs two menus, puts it on the first table and walks away. Uh okay weird but whatever. Then after five minutes another girl asks if we want sometimes to drink and then another girl comes and asks what we want to order. The food comes out quick but here comes the girl with the bob again, she puts down the food at the edge of the table, doesn't even look at us and walks away. So now we're watching these girls and they're nice to every other table except us! My friend is Ethiopian and there is no one else in this restaurant with darker skin color and I don't want to say they were being racist but I don't know why else we were treated so horrible. These girls didn''t come back or say anything to us except fill waters but they kept watching us from a far and kept looking at us. I don't know, maybe they were hungry? But regardless, never coming back to this location again."
        }, 
        {
            "index": 205, 
            "rating": 4, 
            "review": "Good place for lunch during the workday if you can risk taking a little over an hour at times.  They are usually pretty good at turning tables, but it seems towards the end of lunch they get a little tired and take longer.\n\nThe food is really good, I like the Pad Thai, eggrolls, and wonton soup."
        }, 
        {
            "index": 206, 
            "rating": 5, 
            "review": "we eat here once a week with our three kids best larb chicken salid on the planet"
        }, 
        {
            "index": 207, 
            "rating": 1, 
            "review": "I LOVE Thia Beef Salad, so my wife wanted to go somewhere nearby. This is the closest place to my home. (So this isn't my first time here) None the less this 2 star rating was well earned, as I write this I am thinking one star. To start off, this is one of the few locations in town that charge you for refills.  2nd, FAT should not be part of a salad. I had to tear apart the meat from the FAT using a spoon and fork.  3rd, we shouldn't have to ask three times for Water or Napkins. I mainly disappointed in the fact that my Hamburger I had earlier today had more lettuce than this Thia Beef Salad. Is there a shortage on lettuce I don't know about??? This being the 4 valid concern, I am changing from 2 stars to a more deserved 1 star. I hope this was a fluke and they return to there ways, of better customer service."
        }, 
        {
            "index": 208, 
            "rating": 5, 
            "review": "First time coming here with my cousin and husband and kids. Very small place but the service was good and the menu had a good selection.  Love how they rate the level of spicy for you, although we got a 5-6 it was pretty spicy! We loved it!  We couldn't finish everything and we has left overs! Awesome! Very authentic Thai Food!!"
        }, 
        {
            "index": 209, 
            "rating": 3, 
            "review": "Fresh spring rolls and Satay chicken are good appetizers. Pineapple curry combo was delicious. Sweet and sour chicken is the same as anywhere else."
        }, 
        {
            "index": 210, 
            "rating": 4, 
            "review": "Archi's is my current favorite Thai restaurant in town, and I have tried many including Thai Spice, Komol, Lotus of Siam, Thai BBQ, Pin Kaow, Marnee Thai, Promarres, King & I, Panna Thai, Tipps, and Basil 'n Lime. This is their 3rd and newest location.\n\nWe usually get the Pad See-Ew, Pad Thai, Spicy Eggplant, and sometimes a Thai Iced Tea. My wife also loves their Green Papaya Salad and enjoys their various curry dishes. For the spicy dishes, they will ask you how spicy you want it on a scale of 0 to 10. We usually go with \"2\" because their \"3\" can be extremely hot, as in sweat-inducing, nose running-like-a-river hot! I can't even fathom what a \"10\" might be like. Their prices are very reasonable except I do get annoyed when they charge you $1 for a small bowl of rice without letting you know ahead of time. Pet peeve, I know.\n\nWhat distinguishes this place from most other Thai restaurants (and the original location) is the warm, clean, and contemporary interior. You feel like you are dining in an upscale restaurant instead of a hole-in-the-wall joint. Service is typically friendly and efficient.\n\nThe combination of quality food at reasonable prices, solid service, upscale ambience, and as an added bonus its proximity to home make this our go to place for Thai. Well done, Archi, well done."
        }, 
        {
            "index": 211, 
            "rating": 5, 
            "review": "I'm impressed!  This was some pretty good Thai food.  And my favorite part is that they have a spicy level that goes from 1-10.  I like my food on fire so of course, I ordered my food at a 10.  She told me it will be \"very spicy.\"  After I did that, I was nervous for a minute. Then, I got my food.  I got a Tom Yum Seafood soup at spice level 10.  Okay, it was hot and you could just smell the spice.  But for me, I think it was just right. In fact, I think I could've handled it spicier.  And from reading the reviews below, it appears that the spice level may even go higher - to a 30?!?!?!  Perhaps I'll have to try a higher level next time.  But in any event... the food was good.  The only thing that I didn't like was the summer rolls, but that's only because I think in my head I was thinking of the Vietnamese summer rolls.  These particular rolls were actually wrapped in a flour tortilla and on the inside, it had Chinese sausage, veggies, and other stuff.  It was different. It was good.  But it was just not what I expected."
        }, 
        {
            "index": 212, 
            "rating": 5, 
            "review": "I was feeling ill last week, so I decided to get some soup and noodles to sustain my cold, and I tried this place out since I live down the street, and I was impressed! the chicken soup and a variety of vegetables and had a good bite of spice to it which helped clear up my chest congestion and the chicken noodles especially tasty with carrots and lettuce chopped in it. I'll be trying this place soon again with it being right next to the movie theater makes it even better."
        }, 
        {
            "index": 213, 
            "rating": 4, 
            "review": "We were in the mood for Thai and came across this place so decided to get food to go. When I first walked I noticed they were very busy with people waiting to be seated and others picking up food they had ordered to go.  I realized there will be a wait time for my food so I ordered our food and was told it would take 40 minutes which I didn't mind. I left and came back 40 minutes later only to be told it was not ready yet. It was 1 hour since the time I ordered that we finally got our beef salad and wor won ton soup. I must say the food is good however the only reason I gave it stars 4 is because of the long wait time for to go orders. \n\nTip: either eat there or call in your order for pick up."
        }, 
        {
            "index": 214, 
            "rating": 3, 
            "review": "First time. Very slow service. Not bad food, but not worth the trouble waiting to get served. First and last time we will eat their."
        }, 
        {
            "index": 215, 
            "rating": 4, 
            "review": "I've eaten here twice with friends & I always let them order because I'm no Thai food expert, but I know when stuff is tasty, and Archi's serves up some tasty food! I used to frequent the movie theater next door when I was a teenage hoodlum and remember when this place used to be some really crappy Americanized Chinese food place that always smelled like crappy Chinese food. I was really surprised it was the same place considering how cute & Thai-like the inside looked! \n\nWe've sampled their yellow curry, panang curry, beef and basil, pineapple fried rice, pad thai, pad kea mao, and papaya salad. My favorite is the panang curry! Omgosh, it was so delish, until I went home and checked out the calorie content. Panang curry typically has about 40-50g's of fat for one serving. Ouch! Well, anything with that much fat better be worth it, and I'd say that one serving of panang curry is worth it. Their pad thai is on the greasy side and kind of bland when you think about what's in it. I definitely prefer the pad kea mao because it has more veggies and tastes like basil (yum!!!)  compared to what you'd get in pad thai with just bean sprouts & peanuts.\n\nI did not enjoy the papaya salad. It was my first time trying it, but for $10, you get a \"salad\" that has a grated green papaya and this \"dressing\" that just tasted like fish sauce? Did they give us the wrong sauce? I don't know. Regardless, I will be back to Archi's! It has a cute ambiance with some delicious options. Definitely try the panang curry & pad kea mao!"
        }, 
        {
            "index": 216, 
            "rating": 5, 
            "review": "Gahhh I love this place so much! This is my go to Thai restaurant that has a well rounded menu. The place is large and spacious. It's cozily decorated in a way that kinda makes me feel at home. Haha. \n\nMy go to is their tofu panang curry, pad thai, and tom kha - extra spicy! My family especially loves their spicy basil beef. It's making my mouth water just thinking about it. Ugh. \n\nHowever, the service is pretty inconsistent. It varies every time I come in. Sometimes it would take them a while to take our orders or for our food to come out; while other times they were efficient and speedy! I would recommend coming in at lunch time, when it isn't too busy."
        }, 
        {
            "index": 217, 
            "rating": 4, 
            "review": "I lunched here today with a coworker. The decor and atmosphere are delightful. The food was delicious! I ordered the chicken with basil lunch special (lvl 4 spicy). My friend had the green curry chicken (lvl 7 spicy). I will order it more spicy next time, but the dish was very flavorful, fresh and delicious. The egg roll and the fried wontons were standard, nothing special. The soup of the day was nice and refreshing, although one bite of the big chunk of ginger was a bit overpowering. We weren't told the name of the soup, but it was in a broth with chicken, lemongrass and veggies. The lunch specials were a deal at 6.95 each, and the portions are not skimpy! I will return here soon!"
        }, 
        {
            "index": 218, 
            "rating": 3, 
            "review": "Pretty good Thai food. \n\nI had the only curry that doesn't use a coconut milk base, I believe they called it \"country style\".  It was in a chicken broth.\n\nThe country style curry had a nice savory broth and plenty of heat (I ordered it hot). The shrimp were plump and juicy.  I would have preferred more and different veggies.\n\nThe atmosphere was pretty nice and the service was good if a little rushed seeming.\n\nBottom line?  I'd go back but they're not high on my list of Thai places in Vegas."
        }, 
        {
            "index": 219, 
            "rating": 5, 
            "review": "Panang curry double chicken w/ brown rice level 8 is BOMB.COM . I get take out here weekly! Very clean and healthy!"
        }, 
        {
            "index": 220, 
            "rating": 4, 
            "review": "Good chicken Tom Kha--great broth and the chicken had little to no fat, but it had that stale chicken flavor that I hate...the tinge smell--that almost ruined it but great broth!  The pad seayou chicken was great--- so so good!  It was better than the beef by far!  Generous portion of Thai iced teas, and clean and good service.  I will be back--hopefully often but I am always scared of chicken that's of fresh."
        }, 
        {
            "index": 221, 
            "rating": 1, 
            "review": "The owner needs to take a customer service class. I admit I had mistakenly ordered at wrong location. I had called in an order @rainbow instead of Sahara. But I come all the time at Sahara location since day 1 that they opened and they won't let me eat today or make another order.. I understand its my fault but he said\" I have to give you hard time\",thats not how do business"
        }, 
        {
            "index": 222, 
            "rating": 4, 
            "review": "I have eaten in once and I had take out again tonight - about the 6th time I've had Thai food from here.  It is wonderful!  I really like the place, but since it's so close to my house and my wife doesn't do Thai, I get her Chinese on West Charleston and then bop over here to get my dinner for home.\n\nI have been through all of their curries.  I usually get an 8 spiciness and I could go higher.  Next time, I'll do 9 for a try.\n\nI really enjoyed the one time I ate in.  The restaurant is very nice."
        }, 
        {
            "index": 223, 
            "rating": 3, 
            "review": "I was looking for a Sprint store and remembered there being one near Ft Apache and Sahara, but I arrived too late and they were already closed.  So I decided to check out Rising Sun Sushi, which is supposedly located in the same strip mall (sign is still up), but after driving around the entire strip mall and not seeing any sign of Rising Sun and finding Archi's Thai Cafe next to the movie theater I decided to check out their dinner menu.\n\nThe restaurant itself looks nice, the dining area is split into 2 sections (at least), as I was directed to a corner table in the smaller more secluded dining section closest to the parking lot.  I was hoping to be seated in the main area, but whatever.  They have a few waitresses and 1 waiter, and I am not sure if they take turns in getting customers/tables, but I ended up with the waiter that still have a lot to learn about getting better at being a waitperson in a restaurant. If the number of guestcheck holders in their apron is a direct count of the number of tables they are currently assigned, then I would say he has 3 tables to look after while I was there, and he was overwhelmed with just those 3 tables.  After I ordered and the food was served (by a different waitress), he did not come by to check up on the table until I was practically done eating, and it took forever (at least 5 minutes, but most likely not more than 10 minutes) to have him come by again to pick up the money.  This while at least 10 people were eying me sitting there waiting, while they wait for a table to be freed up so they can get seated and order some food.\n\nAnyway, moving on to the food.  I have tried the curries before, and I thought about trying something new.  Sukiyaki (Thai Style) was what i ended up ordering, and I was thinking a Japanese Sukiyaki with Thai ingredients.  Completely wrong imagery!  What I ended up with was a bowl of Thai noodle soup that I remember eating at one of the street food vendors when I was a kid in Bangkok.  The flavor was the same as what I vaguely remembered. It was served piping hot (good), with lots of vegetables (sure why not), a lot of pieces of chicken and 2 shrimps, plus a side of chili paste (cool, you can adjust how spicy you want).  But still I thought that item was overpriced for what it really is, and I will not order it again.\n\nThe Thai Iced Coffee is still large, and I think is worth the price of admission, and still very enjoyable.  I sometimes feel like just ordering that to go, if I am too lazy to shop at one of the Asian supermarket that sells them premade in cans or as a mix.\n\nOverall:\nService: 2/5\nFood: 3.3/5\nPrice: 2/5 (For their Sukiyaki - Thai Style)\nAtmosphere: 4/5\n\nThis location is not recommended if you want to try Archi's and staying on the Strip, as their W. Flamingo location would be closer, and my experiences there have always been a good one. But if you live near this location, by all means drop by and try any of their curries."
        }, 
        {
            "index": 224, 
            "rating": 4, 
            "review": "I am a big fan of Thai food, so when I moved here, I saw a whole bunch of Thai Restaurants that didn't impress me much. I happened to accidentally stumble upon Archi's Flamingo location by turning into that parking lot since i couldn't make a U-turn. I decided to give it a go a week later with my auntie and I was impressed. \n\nThe atmosphere inside the restaurant is warm and inviting, something about it makes you feel like you belong there. I dunno, it's weird. I got there a little after lunch time started and it wasn't that busy. I was greeted by two waitresses and they were very friendly. \n\nThe menu has a pretty good selection, and most dishes you have the choice of what type of meat (or shrimp) that you want. I pretty much just looked for what I know, and ordered it up. My auntie ordered the Pad Thai with Chicken, i ordered the Curry and we shared a plate of Papaya Salad. YUMMY. It was so good, the curry had a nice balance of spiciness and creaminess with a touch of sweetness. The papaya salad was good too, when we ordered it they ask how spicy you want it. Well, other places you go to, when you say spicy it's usually just mild. HA HA. No, not in this case, it was so spicy we had to take it to go and work on it another time! :) But my favorite dish, till this day is the Pad Thai. It has such a RICH flavor to it, and when you receive it, YOU mix the noodles, sprouts and peanuts yourself. :) \n\nSo far, I'm liking it, I will be back hopefully next time to try out more dishes!"
        }, 
        {
            "index": 225, 
            "rating": 1, 
            "review": "When we arrived there was no waiting area and we were standing around tables waiting to be seated. There were tables open and people weren't being seated in a timely manner.\n\nAfter we sat down a server came and told us and \"you want drinks?\" And we all just wanted water and the guy gave us a dirty look. After we got our waters we waited 15 minutes for someone to come take our order. We had to go ask someone to take our order. After taking our order they took forever but as I was looking around people who sat down after us got their food and was practically half way done with their meal. I got up to speak with the manager and he walked away from me. He had our food on the tray he was bringing out and walked over to our table and started to place them on the table as I was trying to tell him about how terrible the service is. After he put 2 of the 3 plates we ordered down he told me that they are busy and that's why it took so long. Being busy doesn't excuse you to give some of your customers crappy service. And when someone is speaking to you, you shouldn't turn your back and walk away.\n\nFood was okay. Had a lot of toppings in the curry but no soup."
        }, 
        {
            "index": 226, 
            "rating": 3, 
            "review": "I'm giving Archie's a 3-star review based on their phone service should be one star but I've had their food in the past and it was excellent. Tried to call earlier this evening to order some pineapple fried rice , lady asked me if I could hold for a few seconds and then set the phone down, 5 minutes later she is still not come back on the line. Frustrated I hung up and attempted to call back now it's been 25 minutes and the line is still busy. I'm presuming it's still sitting on the counter waiting for someone to pick it up and take my order from my original call. I guess you have to order in person."
        }, 
        {
            "index": 227, 
            "rating": 5, 
            "review": "Great food, Ok (not so great) service.  Strongly recommend. This is probably the best  Thai food place in Vegas."
        }, 
        {
            "index": 228, 
            "rating": 5, 
            "review": "Great dining experience, wonderful service and excellent Thai food!  Highly recommended if you are looking for great Thai food that allows for spice accommodations from 1-10."
        }, 
        {
            "index": 229, 
            "rating": 1, 
            "review": "Not going back to this location after today!\n\n About 2 weeks ago my 3 year old daughter and I went to eat there just before 5 pm on a Friday. We got our food and after only a few bites, my daughter needed to use the restroom. I could not locate a staff member to let them know that we would be right back so we left our practically untouched food there and quickly went to the restroom. Just before that, the restaurant started to get extremely busy and large numbers of people began showing up. We returned to our table about 5 minutes later, only to find that our plates had been cleared and they had already seated somebody else there. When i let the hostess know that we were at the restroom and not done eating, she said that they threw our food away because they thought we left without paying. I asked if we could be seated in a different table and have our order re-made quickly and she said that they did not have any tables for 2 people and that there was going to be a wait. I asked if they would be able to make our order to go and again, she said that there was going to be a long wait since they were busy. I also spoke to a manager about this who apologized, but again did not offer a solution. Even though we did not get charged for the few bites that we ate, i find it very frustrating that my dining experience was ruined (not to mention that I am trying to feed a 3 year old dinner) all because they got busy and in a hurry to seat everybody that showed up just after 5. I vowed then that i would never go back to this location. \n\nThen...today I was in the neighborhood and thought i would give them a second chance. I ordered a Thai beef salad (spicy #2). I have ordered this more than 5 times at this location and it was always perfect amount of spice for me. I also order it this way at the Flamingo location (which has always been amazing!) I was sooooo disappointed to taste my salad, only to discover that they did not put ANY spice at all. (totally changes the taste of the salad!) I called them from work (30 min away) and let them know. Instead of apologizing, they started yelling at the cook (with me still on the phone) and came back on the line and said that they did put spice and that #2 is not hot and i should have ordered it hotter. I told the girl that i always order it this way and i know they did not put any spice, she just said sorry i asked the chef and they did put spice (basically calling me a liar). She said that i could bring it back in and get a new one. I let her know that i work 30+ min away and i am not coming back on a Friday after 5 (considering my last Fri experience). She put me on hold and I think talked to a manager. She came back on the line and said that next time I should have brought it back right away. \n\nClearly, not returning here! Also, I am pretty upset about the whole thing, considering I have never left a review good or bad on yelp."
        }, 
        {
            "index": 230, 
            "rating": 5, 
            "review": "Archi's is an incredible place for good Thai food.  They have a wide selection of tofu dishes that I am able to choose from. The food came out in a timely manner considering it was pretty packed for lunch.  I have only been to the Sahara and Fort Apache location, but the service there was great.  The lunch specials rock!  Red curry with tofu and brown rice!  Perfection!"
        }, 
        {
            "index": 231, 
            "rating": 5, 
            "review": "We love Thai Food and Archi's is where we go for our fix. It's definitely spicy though so those of you who think you can handle the 5 may want to rethink it if you want to taste your food. I'm typically a 5 but usually go with a 3 here. Just the right amount of hot."
        }, 
        {
            "index": 232, 
            "rating": 1, 
            "review": "Great food but WTF is up with them advertising they close @ 10pm when they turn u away when you walk in @ 9:30pm. They told us kitchen was already closed but if we wanted to order for take out we could!!! WTFFFF!!! Kitchen's close but if we order to go they'll open it??? Unprofessional, your in America practice american restaurant practices & serve till your advertised closing hours. I can see if we had walked in @ 5 or 10 mins of but WTF 30 mins before?  You lost me as a customer, there's plenty of better & less expensive Tai restaurants all over Vegas & with better service!"
        }, 
        {
            "index": 233, 
            "rating": 3, 
            "review": "I always end up coming to archis at this location, just because it's the closest one to my house. I've tried archis that are at different locations. For all of the locations I've tried ( sahara, flamingo, and warm springs), heres my review:\n\nFood : always on point with their spicy level, tastes and look fresh, never found a hair in my food, and everything I've tried tasted so delicious (esp. Pad thai with beef)\n\nWaiting time: if you go there at a peak time for lunch or dinner, wairing time to be seated or get your food will take longer than usual but that's expected for any restaurant. Usually I find my waiting time to be OK\n\nCustomer service: this part let me drop down 2 stars. No matter what time, day, or which location I go to, customer service is just not good. One time I was still working on my plate maybe half finished,  but my server just took the condiments without asking me if I'm done with it or if I still need it. I find that so rude... and nobody really smiles"
        }, 
        {
            "index": 234, 
            "rating": 5, 
            "review": "Hands down BEST Thai food I have ever had, better yet...best of Las Vegas!!! Amazing service, beautiful restaurant, great for family dinner or date night. The food was absolutely delicious!! Not one complaint for this lovely place!! Highly recommended to anyone and everyone!"
        }, 
        {
            "index": 235, 
            "rating": 5, 
            "review": "Archi's is THE BEST Thai Food in Las Vegas. Honestly it might be the best I've had anywhere. The Sahara location is jsut as nice as all the others, and a little less crowded.\nDo yourself a favor and go here as often as possible!"
        }, 
        {
            "index": 236, 
            "rating": 4, 
            "review": "Tried Archies cafe for the first time. The service was great and the food was the best Tai food I've had so far. I ordered the Pad Tai 6 on the spicey scale and it could have been a little hotter. It is a great atmosphere and overall a great restaurant."
        }, 
        {
            "index": 237, 
            "rating": 5, 
            "review": "Pad Thai with tofu was real good and flavorful.  Prices were very good.   It's one of the few restaurants in Vegas that doesn't feel designed for tourists or as an afterthought."
        }, 
        {
            "index": 238, 
            "rating": 5, 
            "review": "Been to just about every Thai place in Vegas. Archis is definitely one of the best. Best beef noodle soup in town by far. Spent a month in Thailand and although the name kind of has an american feel, the food is authentic! So good! Do your self a favor and eat here. For the price, one of Vegas' gems."
        }, 
        {
            "index": 239, 
            "rating": 4, 
            "review": "The name Archi's doesn't scream Thai cuisine or anything Asian for that matter, but once you get passed the unusual name, this place is definitely one of the better Thai restaurants in Las Vegas (chain or otherwise). \n\nTom yum soup is delicious here and you can really judge a Thai restaurant from the quality of this traditional Thai soup. The Lunch specials they have from 11 a.m. - 3 p.m. are a very good deal and equally as scrumptious!\n\nOverall the interior of the restaurant is very pleasant and appealing for what it is and the menu prices are very reasonable. If you like Thai food you should stop by here sometime!"
        }, 
        {
            "index": 240, 
            "rating": 5, 
            "review": "Great food.  Good ambiance!  We got there early so seating was quick.  The place filled up fast.  It ski wonder because the food is that good.  Beware ... When they say \"10\".  They mean it!   I liked the stuffed chicken appetizer and the spicy basil!  My friend had the catfish.  Now that was good!  She picked 10 so ...,I just tasted it.  Overall a great place for a meal !"
        }, 
        {
            "index": 241, 
            "rating": 5, 
            "review": "Archie. Man. It's been awhile. I thought about you each night. Anyway... I'm here. The food you prepare for me is just so awesome. The price you charge me is even better. I can't get such a deal anywhere else. You treat me like a king, level 6 spicy of course. Thank you Archie. You deserve better. Farewell."
        }, 
        {
            "index": 242, 
            "rating": 4, 
            "review": "We've had dinner here a few times.  Love their Pad Thai and chicken!  We had an unfortunate incident on our last visit as they delivered my sister-in-law and my food order and we were completely finished before they delivered my husband and brother-in-laws food.  Once received it was cold, so it had sat somewhere.  That the staff did not notice that only two of us were eating and that we had asked a couple times and were told it was coming was very disappointing and unimpressive.  Hopefully it was a one time oversight.  Again we had ate there a couple times prior with friendly competent service.  Hot and spiciness desired is on a number system from 1-10 which is great as we have always went with friends and we all have different variations on how we enjoy our food.  The menu is extensive. Enjoy!"
        }, 
        {
            "index": 243, 
            "rating": 1, 
            "review": "Just tried to call in an order for pick up. They put the phone down and never came back to take my order. I could hear staff talking in the background the whole time. I actually hung up and tried to call back as I was really craving Thai food and the line was tied up. Out of curiosity tried back several minutes later - line still tied up. They either completely forgot or just didn't care. This was mid-afternoon on a Monday... Not exactly a lunch or dinner rush."
        }, 
        {
            "index": 244, 
            "rating": 4, 
            "review": "Archi's has become my regular Thai place.  The food is consistently good, the service is nice, and the lunch specials are awesome.   I love that I can ask them to make my food without all the sugar, and they actually do it (unlike some restaurants that say they will, and make the same thing they always do).   The atmosphere in here is great, so eating in is always nice.  Take-out is always packed very carefully.  I've never had an order mix-up, or a leaky container. \nThe only issue I have with Archi's is that they don't seem to give you as much rice as other places.  If you order some curry, you get a box of rice.  If you order two curries, or a curry, and a tom kha gai, you still only get one box of rice.  I sometimes end up having to make more at home, which kind of negates the whole take-out thing.  I'll just have to remember to ask for more before I leave next time."
        }, 
        {
            "index": 245, 
            "rating": 5, 
            "review": "By far the best Thai food in Las Vegas! The Pad Thai is delicious the spice doesn't take away from the flavor of the dish like a lot of other places seem to do. All of their curries are flavorful and well prepared. Overall this place has great quality Thai cuisine."
        }, 
        {
            "index": 246, 
            "rating": 5, 
            "review": "By far the best Thai restaurant in Las Vegas. Also I'd like to add that this is my new overall favorite restaurant! The service was great and the food was amazing!\n\nI'd recommend this to ANYONE & EVERYONE in the Las Vegas area even if you're just visiting."
        }, 
        {
            "index": 247, 
            "rating": 4, 
            "review": "Love this food here! I like the pad Thai with chicken and also the red curry for lunch.. Thai tea is a must get and the beef pad see eu is bomb here as well!! Lunch specials are the way to go in this place!"
        }, 
        {
            "index": 248, 
            "rating": 3, 
            "review": "Shrimp was a bit over cooked, and wasn't a a fan of buying a $2 canned soda without any refills. Other than that the rest of my meal was ok. Only reason I would come back again is for the movie theatre next door."
        }, 
        {
            "index": 249, 
            "rating": 1, 
            "review": "I love Archi's however we walked in at 9:30pm (they close at 10pm) and they told us we couldn't dine in, they were only doing to-go orders?! Very disappointed with their customer service, as we are regular customers."
        }, 
        {
            "index": 250, 
            "rating": 3, 
            "review": "I love the food but the service is very disorganized, I feel I'm always calling them. They seem to have language barrier and it's frustrating to get service here."
        }, 
        {
            "index": 251, 
            "rating": 4, 
            "review": "3-1/2 starts actually, but I'll give them the other 1/2 star for good service.\n\nSo far, the best Thai food that I've tasted in Las Vegas. That probably doesn't say much, as I've only been to one other Thai restaurant. Came here around 6:30p on a Friday night. There was a little bit of a wait, (20 minutes), but no big deal. Started off with the Satay Chicken - nice and tender, and able to cut with a fork. I didn't really care too much for the Thai Egg Rolls, not that it was bad or anything, but it was just an ordinary egg roll. It did taste a little better with the peanut sauce from the Satay Chicken. Got the Larb (spicy sausage salad). My dining partner insisted on a spiciness level of 8, then after tasting it, proceeded to complain how it was too spicy - Lol! I liked it, but it was a little sparse on the salad part. Pad Kea Mow w/ chicken seemed to be a popular dish, so, we got that one too - it didn't disappoint. Even though those were the only dishes we ordered, there was enough leftover for lunch the next day. Service was good - server kept our water glasses full and frequently checked to see if everything was ok. On my next trip here, will try one of the curries, the spicy eggplant, and possibly the stuffed chicken wings."
        }, 
        {
            "index": 252, 
            "rating": 4, 
            "review": "I had a very similar experience to Jill C.'s.  I also had the Basil Chicken lunch special and I thought it was great, also great was the $6.95 price.  I ordered the level 5 spiciness and it really wasn't hot at all.  I will definitely keep this place in my lunch spot rotation."
        }, 
        {
            "index": 253, 
            "rating": 5, 
            "review": "One of my favorite Thai Restaurants in Vegas, great food at reasonable prices. We usually get their chicken Pad Thai and chicken fried rice both are good. My only complaint is whenever we try to call for a reservation they never ever answer the phone it always goes to voicemail. \n\nSo we usually just drive there wait for a table and the food is always great. We've tried to call for reservations on three separate visits and never get through. But the great food makes up for this inconvenience."
        }, 
        {
            "index": 254, 
            "rating": 4, 
            "review": "Just a quick and non critical warning.  The shopping center is under renovation and the parking situation is pretty hit and miss.  You will likely park on gravel and have to walk a bit till they get the lot fixed.  That having been said, this is a solid choice for delicious, well done authentic Thai food.  I've been here three times and all meals were first rate.  I have had the Pad Thai with tofu and once with chicken--8/10 hot level--both excellent.  My son swears by the sweet & sour chicken.  Pad Se Ew was excellent.\n\nService has been first rate here, and the lunch specials are well priced.  Will be back."
        }, 
        {
            "index": 255, 
            "rating": 5, 
            "review": "2 days straight I've on school lunch ordered the Red curry thai entrée with a SEVEN heat level and it's been consistent both times which is rare with thai food!  So good I want it again tomorrow."
        }, 
        {
            "index": 256, 
            "rating": 2, 
            "review": "Fresh but very bland Thai food.\n\nPleasant but I would never come back.\n\nWay too many choices out there.\n\nBroccoli main entre had no taste.\n\nSpring rolls very bland.\n\nGinger ginger tasted like soy and ginger.\n\nVegetables were fresh.\n\nDishes $10-$13 mid range for neighborhood fair."
        }, 
        {
            "index": 257, 
            "rating": 5, 
            "review": "The food and the service is excellent!  We drove to this location because the location near us was closed! Great ambiance and clean! They even have a drive thru. There are 3 locations, you must try! Enjoy!"
        }, 
        {
            "index": 258, 
            "rating": 4, 
            "review": "We came here only because next door at Bachi burger they left us waiting to be seated for 5 minutes without greeting us, so we left and thank goodness we did. I went with my mother and two children and we ordered way too much food. Pad Thai, fried rice (for my picky child), fried wonton, shrimp green curry, chicken satay and my other son also wanted tofu soup. Why so much? I have no clue but I'm glad we did because everything was delicious and now we have more for later. The only complaint I have is that the pad Thai wasn't as hot (temperature) as we'd prefer but it wasn't cold. We will definitely be going back, I just wish I knew of this place sooner."
        }, 
        {
            "index": 259, 
            "rating": 2, 
            "review": "Food ok..took about an hour for my order to be ready..way to damn busy..dont go here on a weekend"
        }, 
        {
            "index": 260, 
            "rating": 4, 
            "review": "My friend Susan is always draggin me around to try new things.. \nI was a little hesitant to try it... but she was driving . \nWe sat down and ordered. \nI ordered Pad Thai and She ordered Pineapple fried rice.\nThen we did what our Momma's taught us and Shared our dinners with each other. \nTruly good food. \nI was very impressed with the textures and flavors of the pineapple fried rice. \nthe Pad Thai was not overly hot, and was pleasant on the palate\nDefinitely gets added to the MUST TRY AGAIN list."
        }, 
        {
            "index": 261, 
            "rating": 1, 
            "review": "Unbelievable. They lost my credit card. \n\nI stopped in for a solo lunch, sat down, and had their Pad Thai which I'd probably rate a 4 out of 10 - it's super greasy and not all that good. \n\nAfter I give the waitress my card to pay the bill she brings me a book with a receipt to sign but not my card.\n\nI ask her where my card is and she's saying she would have brought it to me.\n\nI'm wearing sweats without much stuff in my pocket -keys, wallet, chapstick, phone.. I hadn't moved the entire time - not to go to the restroom or anything. My wallet barely fits any cards so there's only one secured place it fits.\n\nThere is nothing under the table or in the seat. \n\nI emptied the contents of my wallet into the table in front of her.\n\nFlipped the book inside out.\n\nThey spend all but a few seconds to look for it around the restaurant and suggest to me to cancel my card. \n\nNo person acknowledged responsibility or even offered a genuine apology. Just the suggestion to cancel my card. \n\nGreat advice."
        }, 
        {
            "index": 262, 
            "rating": 2, 
            "review": "This place used to be really great prior to their expansion.  They are just ok.  The foods never persistent.  Different cooks, several locations = Avg quality."
        }, 
        {
            "index": 263, 
            "rating": 5, 
            "review": "Delicious food at reasonable prices has my family coming back over and over again. I usually order the massaman and thai iced tea. They do charge $1.50 for extra rice, which perplexes me because they expexct three adults to share one scoop of rice, but whatevs. The service is fast, even when it is busy."
        }, 
        {
            "index": 264, 
            "rating": 4, 
            "review": "Food is always great! It can be really spicy so be careful when you say \"10\".  Only reason its 4 stars is because service is not great.  Understand they are extremely busy during lunch time but it should not be an excuse for bad service.  I now order \"pick up\" only.  Highly recommended."
        }, 
        {
            "index": 265, 
            "rating": 4, 
            "review": "So good the food you crave it after you et it I will be back. The service was great this was a spur of the moment place to dine before a movie.I have had a lot of  Thai food around town and this is really good food"
        }, 
        {
            "index": 266, 
            "rating": 1, 
            "review": "I've definitely had way better thai. I always order tom kha soup at thai places and this was by far the most bland I've had. They also need more help answering phones and seating people."
        }, 
        {
            "index": 267, 
            "rating": 5, 
            "review": "I have to say this is my favorite restaurant in all of Las Vegas! Love the food...especially the Mongolian beef and Mongolian tofu! Been going here for at least 7 years and don't think I will stop anytime soon."
        }, 
        {
            "index": 268, 
            "rating": 2, 
            "review": "We were very eager to try this restaurant out after seeing how moist and saucy their noodle dishes looked in other yelper's pictures. The reviews also seemed like this place wouldn't disappoint.\n\nWhat started off as a positive experience, slowly and annoyingly became a long & drawn out waste of our time. \n\nAfter 30 minutes of waiting for our food, I became drawn in and aware of the time - I was starving! I saw that there were tables that were seated after us, receiving their food, I suppose it's because they were appetizers? I couldn't tell. I was still annoyed and very hungry. \n\nI kept looking at the time and it had soon become 35 minutes, yet still no food. At this point I was very antsy, hungry, and aggravated. My soda has watered down a lot at this point (I like to drink it fizzy with my meal.)\n\n45 minutes later, our food arrived. We asked the server if they could be so understanding to swap out my coke for a fresh one, since I hadn't even drink it yet and it had gone flat since we waited so long for the food to come out. The waiter didn't understand, he thought we wanted a coconut water - so he got the manager involved. The manager listened to our concern and request, but he said that they don't do that here and that our request was unusual. So we just had to say - ok thanks, never mind then.\n\nIt's just a simple coke - we were agitated about the extensive wait, my watered down coke that was clearly not drank from, but they weren't concerned about our complaints. He was polite and professional - but I still feel slapped for the whole experience. It wasted our time and not once did our server or any server come out to explain the long wait for our food or check on us. \n\nAlthough, we requested spice level 7, it was really a level 1. We asked 3 times for a chili tray to be refreshed as the chilies were gone - 3 different servers later, brought the chili tray. We also asked for lemons 2 times in a row, the second person finally brought it for us. There were a lot of servers but no one wanted to help our table. Our food was getting cold as were were waiting for these things.\n\nThe positive things I could take from this place was that the noodles were moist, the pad kee mao had nice flavor, and the pad thai (although bland) was a massive portion - I feel like it was at least 4 portions that they brought out, which is a good deal. \n\nYet, I wasn't a fan about the horrible service.  If I ever feel inclined to come back, I would order take out instead.\n\nMy search for a no fail and delicious thai restaurant close to home continues."
        }, 
        {
            "index": 269, 
            "rating": 1, 
            "review": "I hate that i am writing a one star review but for this location its a must. I have been a long time Archi's fan back years and years when they first started here in Las Vegas. \nEverytime I seem to come to this location either the food is bad or the service is bad. \n\nToday for our lunch break my boyfriend and I decided to give this place another try. Bad idea.  I walked in and got seated by some server who seemed to have an attitude. We waited about 20 minutes before we were greeted by a busser asking what we wanted to drink. We asked her to order food as well and she told us she had to get our server.\n15 minutes later finally a server came over and took our order. The food took forever to come out but the food was actually good though. The whole process took an hour and a half which in my opinion is very lengthy not to mention IT MADE ME LATE BACK TO WORK! \n\nOf course, when it came time to pay they were super fast on picking up my credit card.\n\nThe sad part was we werent the only table that was complaining."
        }, 
        {
            "index": 270, 
            "rating": 5, 
            "review": "I have been searching for years to find great pad thai here in Summerlin.....Done!  I have yet to dine in but it looks really nice.\n\nI do the pick up option and the portion is do big I can have half for lunch and the rest for dinner!  Not bad for $8.  \n\nHoping to go in one of these days."
        }, 
        {
            "index": 271, 
            "rating": 5, 
            "review": "I didn't even like Thai food until I started going here.  I wonder if they secretly add some kind of crack to this food because I crave it fortnightly.  Sooo good.  \n\nMy favorite is the Pad Kapow (spicy basil), Pad Thai, and the chicken fried rice is the.best.ever.  It is seriously amazing.  Yes, I know that's a \"boring\" dish.  I order it for my kids and wind up eating whatever they don't finish.  It's even better the next day.\n\nWe usually get take out but the actual restaurant is wonderful.  I love the plantation shutters everywhere.  The staff is friendly, although not always fluent in English.  I love this place.  I hope they don't change their business model any time soon."
        }, 
        {
            "index": 272, 
            "rating": 4, 
            "review": "I like Archi's pad thai and pad see ew...especially because they use chinese broccoli. The south rainbow location is good too."
        }, 
        {
            "index": 273, 
            "rating": 4, 
            "review": "Their food is the best out of all the places i been Thai'ing it up! I always have their Chicken Panang Curry and Chicken Pad Ke Mow and for apps the thai spring rolls! Very delicious and spicy. Dont forget the mango sticky rice!!"
        }, 
        {
            "index": 274, 
            "rating": 5, 
            "review": "Excellent food!  The ambiance is also lovely and clean.  Love all their curries and the best of all is the Pad Thai.  Service is usually very good.  THe most wonderful thing is their lunch menu!  Same delicous food but in large portion (single item only served with egg roll and soup).  A great value.  We will keep returning."
        }, 
        {
            "index": 275, 
            "rating": 4, 
            "review": "Mine and my husbands default place for food. I get the same thing every time and love it: spicey basil with chicken."
        }, 
        {
            "index": 276, 
            "rating": 5, 
            "review": "3 words: YELLOW CHICKEN CURRY. The curry is not a paste thick sort but rather a mixture of  sweet and spicy yumness! The spices in this dish are not overwhelming at all and they provide a taste like no other. Like most curry dishes you have to choose a spicy range from 1 to 10. I love spicy food and let me tell ya, 7 is pushing it but I've tried 8 and while it is very spicy, you can still taste well enough to enjoy the dish. So far everything I've tried has been delicious from Pork Phad Thai to their Tofu soup to Tom Kha Shrimp. If I had anything bad to say about Archi's it would be that their fried rice is mediocre, I've most definitely had better fried rice before, but its not terrible- just bland.  Make sure to try the Thai Tea with your meal- DELICIOUS! :)\n\nFor some reason this location is hidden away like some redheaded step child. Its a tiny location in the Village Square shopping center, but once you find it and go inside you will find a warm and friendly environment. This location is always clean and ready to serve. The staff is so friendly- I once picked up some take out and  the waitress offered me a drink  while I waited (which wasn't long)."
        }, 
        {
            "index": 277, 
            "rating": 4, 
            "review": "When my youngest son and his fiancee brought me here yesterday for Lunch... I thought to myself as I walked in.... \"I've been here before... but when?\". They tried to bring me here last year when I was visiting, but Archi's Thai was closed that day... They took me to another place... and was extremely disappointed. As you can see by the rating, Archi's was a pleasant surprise and very good Thai cuisine... judging by the Lunch Specials.\n\nAs I told the kids... Archi's is deserving of 5-Stars for the sampling of the Lunch Special... and if the Dinners were as good and consistent as the Lunch Special that I had.\n\nAtmosphere is most unlike Southeastern Asian.... The decor is set in medium dark woods... furniture is French Provincial in style... pictures are, surprisingly, of Thailands French Colonial days with framed pictures of their former Royalty in Thailand of days gone by. You will be surprised by this atmosphere... a little of French Colonial in an Asian restaurant.\n\nOn the menu....\n\nTom Yum Soup (**** Complimentary) Lemongrass, Lime Leaves and Blue Ginger infused Broth, Mushrooms, Tomatoes and Lime Juice... sprinkled with Cilantro and Green Onions. For a smallish 3\" diameter cup / bowl... this Soup could be considered Thailand's version of Chinese Hot and Sour Soup. Dang good... but left me wanting more... but it's complimentary.\n\nLunch Special #4 - Red Curry Dish with Beef (***** $6.95 Shrimp-$7.95) Fresh Red Curry Paste in Coconut Milk with Zucchini, Bamboo Shoots (a lot of 'em), Basil, and Bell Peppers. \n\nWhen you order this... the wait-staff will ask you the degree of Hot-ness that you want your Soup (from 1 to 10... with 1 being a lack of Heat and 10 being Super Hot)... I was considering ordering the Soup with a 10... My son and his fiancee looked at me quizzically or amazingly. They really tried to convince me to reconsider.... I tried this tactic... I asked the waitress... \"If you ordered this, what number would you order?\" She replied with a 6. So, I compromised.... 8.\n\nWhen the Soup came out, The Soup was accompanied by a very small Green Salad which was totally inconsequential considering it's size; a Thai Egg Roll (***)... I really don't like totally Veggie Egg Rolls, and a thinly fried Won-Ton (****). This was just a small sampling of from their extensive menu.\n\nThe Red Curry Soup was something else altogether... As you travel West across SouthEast Asia... you'll notice that the Asian countries will be more influence by Indian Cuisine as you travel. This Soup was silky smooth from the Coconut Milk and the Red Curry gave it a warm color and unique flavor that only Curry can impose. Coconut based Soups are some of my very favorite. If I had to penalize the Soup for any reason, it would be for the amount of Bamboo Shoots... just too much. Otherwise, something you should try whether it be a Lunch Special or at Dinner.\n\nLunch Special #5 - Spicy Basil Dish with Beef (***** $6.95) Stir Fried with Zucchini, Bell Peppers, Garlic, Chili and Fresh Basil. This was a sampling that my son's fiancee obligingly gave me to try.\n\nA very delicious Stir-Fry with Ground Beef. I will try this next time... whenever that may be.\n\nWait-Staff was very friendly, helpful. I asked the waitress how the smallish chain came to be named Archi's... She said Archi was the nickname of the owner, who started his restaurants seven years ago. This location started up two years ago taking over a Pick-Up-Stix franchise that went bust. She also said the owner usually is at the Rainbow location ( http://www.yelp.com/biz/archis-thai-kitchen-and-thai-bistro-las-vegas ) since that was the original restaurant and is quite larger in size.\n\nOne other advantage of this location is the proximity to my favorite Cinema in Las Vegas... the Regal Village Square 18 ( http://www.yelp.com/biz/regal-village-square-18-las-vegas ). Archi's would be a good pre or post movie visit.\n\nBTW, Archi's has been rated the Best of Las Vegas 2005-2007."
        }, 
        {
            "index": 278, 
            "rating": 5, 
            "review": "I love this place!!! My favorite place to get pad Thai. My husband & I come here at least once a week."
        }, 
        {
            "index": 279, 
            "rating": 5, 
            "review": "Our go to Thai restaurant .. Nice decor / great service / right next to the movie theatre. They are closed one day of the week can't remember if it's tues or wed .. Great lunch special deal . Fabulous soups and red curry"
        }, 
        {
            "index": 280, 
            "rating": 4, 
            "review": "Yummy!! The Pork Larb and Chicken Curry fried rice were delicious. The Spicy Basil was meh. But my family thoroughly enjoyed the experience. We can't wait to come back."
        }, 
        {
            "index": 281, 
            "rating": 5, 
            "review": "Garlic pepper beef!! Yes please!!! One of my favorite Thai restaurants when I'm in town. Wish I could magically appear whenever I get the Thai bug, Sacramento is LACKING! If you are in the mood for good Thai in Archis is a must!"
        }, 
        {
            "index": 282, 
            "rating": 4, 
            "review": "A friend who's very critical of food establishments told me this place was good so it's got that going for it. I've only been once but would definitely recommend it. I got the Pad Thai lunch special which was a good deal. They give you a regular sized portion of the noodles as well as soup and a salad. \n\nThe servers are super nice and attentive. I'll be back to try out some curries!"
        }, 
        {
            "index": 283, 
            "rating": 4, 
            "review": "Excellent quality and flavorful cuisine.   The beef salad was so delicious!  The portions are also good and the prices are just right.  I will definitely eat here again."
        }, 
        {
            "index": 284, 
            "rating": 4, 
            "review": "This is a great lunch spot. I wouldn't get too crazy by saying you will have an authentic experience but you will leave satisfied. The spice levels are a bit low so you might consider kicking it up a notch like your buddy Emeril."
        }, 
        {
            "index": 285, 
            "rating": 5, 
            "review": "Archi's always delivers! This was my first time at this location and I gotta say I like the other locations better. This one is much bigger (read- more busy/crowded) and the service left something to be desired. But once we dropped a hint the main guy, things went alot more smoothly. HIGHLY recommend the red curry and the papaya salad. Just a warning the salad was WAAY spicier than I expected, so be conserved on the level you ask for. Also got the flat noodles with chicken- pretty solid. I highly recommend Archi's to anyone and everyone!"
        }, 
        {
            "index": 286, 
            "rating": 1, 
            "review": "Love the food but not at 90 degrees. I sweated the whole time and was ignored when I asked if they could make it cooler. Sorry, Not coming back."
        }, 
        {
            "index": 287, 
            "rating": 5, 
            "review": "After having a bad take out dinner at Basil and Lime down the street... I have to apologize to Archi's for not giving them an excellent review since I've been going here for a few years. It's time to give them props.  Tom Yum - right amount of spice and sourness, pineapple fried rice awesoooome, Pad Thai yum yum, Panang Curry so delish, Pad See Saw - I guess that's what its called also perfection.  Props to this chain great food, I won't cheat on you again, only did it cuz you close on Tuesdays.... why Thai food is good any day in my book."
        }, 
        {
            "index": 288, 
            "rating": 5, 
            "review": "I've been a regular here and always get the pad Thai or their curry dishes. I wish I had know of yelp! since I had my iPhone!"
        }, 
        {
            "index": 289, 
            "rating": 4, 
            "review": "Pretty great tasting place, they do take time to get you your order. Some of the best Thai food I've had. Its right across the street from me so when I'm hungry this is my go to place."
        }, 
        {
            "index": 290, 
            "rating": 1, 
            "review": "Came here for dinner. Geez, no one bothered to greet us, seat us or act like we existed. Waited long enough & finally gave up & left.  Take your business & eat where they welcome customers. These people could care less"
        }, 
        {
            "index": 291, 
            "rating": 5, 
            "review": "Voted best in Las Vegas for 10 yrs for a reason! Always fresh, always professional. We usually order at least once a week. Everytime we come inside we always think how CLEAN everything is and how nice. We are always greeted warmly and the wait is never too long. Archies makes it easy and what's not to love!"
        }, 
        {
            "index": 292, 
            "rating": 4, 
            "review": "I love Archi's \n\nI highly recommend the seafood pancake! I don't think they list this on their menu... I'm not sure why but I heard about it from my mom and it is amazing! \n\nDon't leave without having the sticky rice and coconut ice cream either ^.^ \n\nOnly down side... the service was slow. It was busy so I know it can get crazy trying to take care of all the tables but we didn't get a single refill and tried to flag the waitress down like three times before we were able to get her attention."
        }, 
        {
            "index": 293, 
            "rating": 2, 
            "review": "Update: Not happy! On 5.17.2015 I dined in the restaurant with a friend and the male waiter ran my card at the wrong table, then proceeded to run my card for my check for the full amount when we paid half cash. He brought it to me to sign and I called him out on it. He went back and ran he it for the correct amount, but I'm pissed. Who does that??? You ran my card at the wrong table?!? Not okay!  Then took my cash and ran my card for the full amount... Not okay!!! They should have offered my meal free or discounted. I eat there at least 3 times a month. I'm very disappointed and upset! I'll be attaching a photo from my bank statement showing all 3 charges that are still pending on my account. \n\nUpdate: I really love this place! I've tried other Thai restaurants and I have yet to find one that is better than Archi's. The Yellow curry is my favorite. I've inly eaten inside the restaurant maybe 2-3 times. We typically order takeout."
        }, 
        {
            "index": 294, 
            "rating": 4, 
            "review": "I forgot how good Archi's is. I tried once about a year and a half ago with family. The Sahara location isn't anywhere near me but it was a good central spot for a family meet. \nThe staff is always friendly and welcoming. \nI had the Thai tea to start. It was very good. Not too sweet and not too strong.\nI love pad Thai and I love it HOT! So when I ordered my chicken pad Thai at a 10 the waiter was surprised and confirmed the spice level. He also confirmed that there was peanuts and egg in the dish. I thought was a great idea for any food allergy people. I've never had a restaurant do that. \nI also got the Tom Kha soup. Great flavor and the coconut milk made it a little creamy too. The serving is enough for 2-3 people to split if you're ordering as an appetizer."
        }, 
        {
            "index": 295, 
            "rating": 4, 
            "review": "We frequent this location whenever we want to see a movie at Village Square.  They have expanded their seating recently so the wait isnt too bad.  Tasty chow mein and soups.  The papaya salad is also good.  Food comes out in a timely fashion, and they are good to hurry your order up if you are pressed for time to get to your movie."
        }, 
        {
            "index": 296, 
            "rating": 5, 
            "review": "Archi's is definitely my go-to Thai food place. I've been coming here since it opened and replaced my beloved Pick Up Stix. I LOVE their pad thai and can live off of it for days. A few other favorites are the Sweet and Sour chicken and Masaman curry. I eat here about once a week and the only thing I don't love is the consistency of the service. It's always the same handful of workers and sometimes they are fabulous and sometimes they just drop our plates on the corner of the table and walk away. I still love the food and just order it to go to avoid the chance that the service might not be as good that night."
        }, 
        {
            "index": 297, 
            "rating": 4, 
            "review": "I love the mint chicken dish with Thai Tea. Mmm.\nIf you are a spicy food lover. You have to give them a shot. Save room for dessert because that rice ice cream dessert thing is delicious. I just cannot remember what it's called!!"
        }, 
        {
            "index": 298, 
            "rating": 4, 
            "review": "Archie's is delicious, the beef curry fried rice spicy 10 can't be beat. The portion size is extremely large and cost is affordable this ratio is why it is a must eat place in Las Vegas. Food taste fresh and it has the right amount of spice along with flavor.\n\nThe service has its hit and misses, normally though they get it right ... I think twice out of a dozen times I had to wait roughly an hour for my food. My girl friend and I learned its easy to call and order it to go and enjoy the food at home while watching a movie. The space went under a remodel giving additional (much needed) space so wait times for a table are next to nothing when we go to dine in. \n\nCan't compare if to other Thai restaurants as this is my first Thai restaurant, but I do enjoy their food and believe they have set the bar high. Their food is good, menu has options for everyone, atmosphere is comfortable, service is okay could be slightly better, portion to size ratio AMAZING... so Give them a try you too may enjoy what they have to offer."
        }, 
        {
            "index": 299, 
            "rating": 3, 
            "review": "I really love Archie's Thai Kitchen. My husband and I have been going to the Flamingo location for years.. We normally order the Pad Woon Sen, the beef fried rice and the wonton soup which is incredible..\nWe have had unpleasant experiences here at this location several times now. It is closer to our house than the Flamingo or Rainbow location so we really wanted it to be more convenient for us. Sadly enough, every time we go here our order comes out wrong. We order a spicy number 6 and no spice is added, we order a spicy number 4 and it burns our heads off. We don't run into this problem at any other location. \nWe have also been to this location and it is super busy and their is no one to help us sit or order food. \nNew management is needed here. They really need to change these things. I would love to frequent this restaurant but find that it is hard to trust that our food will be done consistently."
        }, 
        {
            "index": 300, 
            "rating": 5, 
            "review": "I eat here at least once a week. Basil fried rice, beef salad, and the pad see ew is my usual order. This place is a must go."
        }, 
        {
            "index": 301, 
            "rating": 1, 
            "review": "Stopped in for lunch today and three of us sat down to enjoy Thai food.  An order of Suki Hang  came with a well cooked, well seasoned whole napkin in the middle of the food.  No idea if the napkin had been used by the cook to wipe his nose or wipe his brow, etc.  The waitress apologized and went to the kitchen to have another order prepared.  The waitress returned in a few minutes to let us know the owner was contacted and allowed for no charge on that one order.  The manager on duty and the owner never came to the table to offer an apology, instead they allowed the waitress to handle the situation.  The incident caused all of us to lose our appetite when we considered what the napkin had been used for and how it made it into the food.  A totally disgusting situation and we have eaten at this restaurant previously and had one other incident of food not being prepared properly.  Look before you eat your meal at this restaurant!"
        }, 
        {
            "index": 302, 
            "rating": 4, 
            "review": "Archi's Thai Cafe changed my outlook on Thai food.\n\nI've never had good experiences at the Thai places I've been to in the past, which pretty much made me avoid Thai restaurants in general.  All I remember are \"bean sprouts\" and \"peanuts\" - LOTS of them.\n\nSo I was a little reluctant to try Archi's, but am SO GLAD that I DID.  Can't believe I waited this long.  Their chicken pad thai is so good and their chicken fried rice is bomb. I was pleasantly surprised to see that not everything is bean sprouts and peanuts!  \n\nWe ordered those 2 dishes, an eggplant dish and a Thai iced tea which came out to be ~$40 including tax.  I wasn't too thrilled with the eggplant, it was a little bitter and harder than what I'm used to.  The serving portions are fairly large and we pretty much ended up taking 75% of the food home.  Yeah, pretty ridiculous that we ordered that much food for lunch, but they served as nice leftovers :)\n\nI would DEFINITELY go here again.  They also do take-out!  There are a few locations so make sure you call the right one to place your order!"
        }, 
        {
            "index": 303, 
            "rating": 3, 
            "review": "Woohoo!  It's Friday night.  You know what that means.  Mommy's off kitchen duty.  ;)  Time for takeout!  I had a craving for Thai so we turned to yelp for a recommendation.  We ordered the Tom Yum soup, Pad Thai, and Panang curry.  We ordered spicy level 5 for all three but the soup was spicier than a 5.  Maybe more like a 7-8.  The pad thai and panang curry were pretty good.  I wish the curry had more a bit more curry...didn't seem to have much liquid but I liked how it had green beans.  When we ordered they told us it'd be 30 minutes.  Hubby went to pick it up after 30 minutes and he still had to wait another 10-15 minutes.  While he was waiting he spoke to a few other patrons who were waiting to be seated/pick up their orders and many of them said they've often had to wait an additional 30 minutes to pick up their orders.  And he said the place was packed with maybe six tables worth of people waiting to be seated.  I guess dinner options in Summerlin are pretty limited.  I think the food is worthy of a 3.5.  I'm going to give it another try and reevaluate."
        }, 
        {
            "index": 304, 
            "rating": 4, 
            "review": "Never been disappointed here--dinner and lunch specials always hot & fresh at a good price.  The fried tofu appetizers are crispy delights, their panang or red curry dishes are savory, the stuffed chicken wings amazing (how do they get so much stuffing in there?).  Servers are attentive and friendly."
        }, 
        {
            "index": 305, 
            "rating": 5, 
            "review": "After having tried various Thai restaurants around Vegas we had finally arrived at Archi's.  Let me just say that we should have tried here first. \n\nAte the Panang Curry, fried tofu, and broccoli. Way more than enough for two and much much better service than lotus of siam. If you're in the mood for Thai then this is the place."
        }, 
        {
            "index": 306, 
            "rating": 5, 
            "review": "Such great food ! Big portions, awesome environment. That are always very fast and the flavors are just beyond this world ! Keep it up!!!"
        }, 
        {
            "index": 307, 
            "rating": 3, 
            "review": "Food: \nPad Thai with tofu 8/10\nAmazing pad Thai!!!\nTofu Panang with brown rice 8/10\nDelicious Panang!!!\n\nService:\nTook a little long but that's okay they were a little busy I def understand. Saw us a couple times trying to get a check,not a biggie at all.\n\nCleanliness:\nWOW, the wall I was sitting by, food particles everywhere. Above us was a hanging light, dust all over it. A/C vent, dust all around it blowing that crap who knows where. One of the services sneezed in his hands then wiped it on his apron then served food. The lady expo coughed on her hands, texting on her phone, then prepped food and put her hands on the plate. Absolutely disgusting. Not the Restaurants fault because I'm 100% they go through servsafe for this kind of stuff. Unbelievable, please attend to your employees."
        }, 
        {
            "index": 308, 
            "rating": 4, 
            "review": "Archi's has the best Pad Thai. The food is consistently good, unlike some other Thai restaurants in town. The beef salad is always great and refreshing; and has a modest proportion of beef for the price. The curry is creamy and not overwhelming with a perfect blend of spices and goes great with the pineapple fried rice. I've tried plenty of Thai restaurants in town, but definitely keep Archi's as my top pick."
        }, 
        {
            "index": 309, 
            "rating": 1, 
            "review": "We've been sitting here for half an hour so far and have received just tea. They recently expanded but don't seem to have the help to cover the additional seating. Seem more concerned with their to go orders than their restaurant patrons. Pity."
        }, 
        {
            "index": 310, 
            "rating": 3, 
            "review": "I really thought the food was good but just a little underwhelming.  Beef salad was actually very tasty but there was a definite lack of juice that accompanies the dish.  Hubbs ordered chicken pad thai, was lacking in a little acidity but it was not bad.  Again, the food was okay, but nothing fabulous.  On the plus side, portions were generous.The only weird thing was that we both ordered #6 spice to our dishes and my husband's dish was about 2 levels under my spice.  I really think mine was the true 6 ;) .  I hope it wasn't done on purpose after they took one look at the whiteboy and decided to underplay the spice request.  We did not attempt dessert because the service was way too slow.  I want to give it another try sometime but maybe during  lunch."
        }, 
        {
            "index": 311, 
            "rating": 4, 
            "review": "Ate here for the first time and I will say I that I am very pleased with the food. For appetizers we ordered the won tons and the satay chicken skewers with peanut sauce, both were very good. My entrée was the red curry w/bamboo shoots and rice. It was DELICIOUS! My boyfriend ordered a ground chicken dish, I don't remember the name of his, but it was delicious, as well. \n\nI would have given them 5 stars, but we were with another couple and first they brought out our appetizers without bringing theirs and then they brought out our entrees without bringing out theirs, so we felt obligated, out of courtesy, to wait about 5-7 minutes for the rest of our party to be served first before we could eat. I didn't like that my food was just sitting there. Yes, I know I could have just started eating, but most restaurants serve everyone at the same time. Also, they serve the soda in cans, so there are no refills. I don't like when restaurants do that. However, the food was good enough for me to return."
        }, 
        {
            "index": 312, 
            "rating": 5, 
            "review": "I come here at least once a week. Delicious food with very quick service. Great for take outs too. I highly recommend this place."
        }, 
        {
            "index": 313, 
            "rating": 5, 
            "review": "Thai food has been a new obsession for me. We've been getting take out every week for a while now and Archie's is fantastic!  Food always tastes fresh service is fast."
        }, 
        {
            "index": 314, 
            "rating": 4, 
            "review": "Amazing food! \n\nHowever, service is not always that great. I came in once, by myself, and the waiter kept looking at me like a fool.. after about a good minute, I asked to be seated, clearly making him look like a fool, he was a douche the whole time. Second time I go, this time with someone, waitress was just apathetic."
        }, 
        {
            "index": 315, 
            "rating": 5, 
            "review": "This has the best Panang Curry I have ever tried. I don't how they make it so much better than any of the other Thai places I've been to before.  Also, make sure you try their curry fried rice (make it spicy is even better). You can't go wrong at eating here."
        }, 
        {
            "index": 316, 
            "rating": 5, 
            "review": "This is my favorite Thai restaurant in the whole city! Due to its popularity there is usually a bit of a wait for dinner, so be prepared. When we go we usually get the pad see ew, fried rice, pad won sen or any of the curries. I'm not a big fan of their soups but everything else on the menu has not been a disappointment."
        }, 
        {
            "index": 317, 
            "rating": 4, 
            "review": "Archie's is a Thai restaurant chain with locations convenient to both my work and home. I love their lunch specials for the good portions and value. I would recommend their Pad Thai lunch and Kung Pao chicken (better than Chinese kung pao). They serve consistently good Thai food with my only complaint being the spice number is not consistent. I've asked for spicy number 5s that may be more like a three on some days and like a nine on others. Yikes! But it's so good, I'll eat it anyway. I would suggest not getting the salads or the soups too spicy because the spice tends to overwhelm these dishes. Better to add more spice later than be sorry. Besides the lunch specials,  a few other favorite dishes of mine are the Panang curry, Massaman curry and Tom Kha Gai soup. If in season, try the mango and sticky rice for dessert. Love it!"
        }, 
        {
            "index": 318, 
            "rating": 5, 
            "review": "Always consistently good. It isn't the fastest service, but the food is delicious, the restaurant is clean, the staff is friendly. We just don't come if we are in a hurry or we get take out. Can't compare it to other Thai, because we are always pleased and don't feel the need to go elsewhere."
        }, 
        {
            "index": 319, 
            "rating": 4, 
            "review": "My go to spot for curry and pad thai in my neighborhood. There are very few places that I visit on a consistent basis that make me as happy as a trip to Archi's does. It is my guilty pleasure without the guilt.\n\nLets start off with my favorite dishes. \n\nThe yellow chicken curry is a balancing act of perfection. A carnival of different flavors melded together to make one kickass curry. Throw in some potatoes, onions, and carrots with whatever meat you desire and you have a hearty delicious meal on your hands. Choose your desired spicy level, give me a side of rice, and I'm done!\n\nNow the pad thai is easily one of the best pad thais I've ever had. It is not some fancy rendition of pad thai with overcomplicated ingredients or an unnecessary presentation. It's pad thai, with a side of chopped peanuts and baby sprouts. That is it. It does not need to be more than that.\n\nI will say that not all dishes are created equal at Archi's. Their fried rice is just not that well put together. It looks delicious but it just really falls short on the flavor department. And another shortcoming of Archi's is their inconsistant spice level. I usually order a spicy level of seven but it will vary wildly from mouth scorcher to somewhat mild. I think it depends on who is preparing it but make sure to keep that in mind when ordering.\n\nDespite the complaints, Archi's still goes down in my book as a solid place to get some pad thai or curry."
        }, 
        {
            "index": 320, 
            "rating": 4, 
            "review": "Ate here with my girlfriend this evening. She had the Mongolian entree and I had the Pad Cha Cha Cha entree. Both were excellent.\n\nWe've also eaten here once before and had no complaints that time either.\n\nService was prompt and friendly.\n\nWe'll definitely be back again."
        }, 
        {
            "index": 321, 
            "rating": 5, 
            "review": "First time here and will definitely come back. Food was delicious and pad Thai was amaaaaazing. We ordered sweet sour pork, chicken pad Thai and beef curry all spicy 6. It wasn't as spicy as I thought it would be. Definitely the proportions are bigger and better then Pin kaow (located on rainbow and lake mead). I would recommend to just get an entree because for a dollar more, you get more food than the lunch size ones. I love their decor and their friendly staff. I would definitely recommend it to any food lovers out there!"
        }, 
        {
            "index": 322, 
            "rating": 5, 
            "review": "Been living here in Las Vegas for almost two years now and have not found a great Thai cuisine place with decent prices off of the strip until I ran into this place. The food is very flavorful and great! Pricing is not sky high it's just right. 5 stars for friendly staff and great food. Decor and atmosphere is nice a cozy inside. Come get one of the best pad thai in town. And your option of spicy level 1-10 is absolutely awesome! Finally found my go to for Thai cuisine from now on!"
        }, 
        {
            "index": 323, 
            "rating": 1, 
            "review": "I will never ever ever eat here again for as long as I live!!!!!!!   My brothers thought it'd be a good idea to take me here for dinner since I lived in AZ and there is no thai restaurants in my town.   They had been here before and said it was really good.  But OMG it was a big mistake.  about an hour after we ate here we just started vomiting and we got severe diarrhea that lasted for 3 straight days.  I mean it was non stop, so severe in fact that on the first night I slept on the bathroom floor next to the toilet.   I know it was this food that made us very ill....   This is why I don't recommend this restaurant to anyone, cuz I have nothing good to say about it.  Even our waitress was so rude that night.       \"EAT HERE AT YOUR OWN RISK.\"....   This place traumatized me so, that i'm afraid of going to eat thai food.   This place SUCKED!!!!!"
        }, 
        {
            "index": 324, 
            "rating": 4, 
            "review": "I am not really a Thai food enthusiast; however, my boyfriend is and I have heard great things about this place so I wanted to give it a try. The place was very busy during lunch hour but we were immediately seated. We both ordered $6.95 Lunch specials which is really a great deal of food for the price. His red curry was fantastic! My Kung Pao chicken was just ok. All the other food with the meal was delicious. I will go back again but will stick with ordering curry."
        }, 
        {
            "index": 325, 
            "rating": 1, 
            "review": "Disappointed with the service, we came in ,5 employees ignored us to seat us down. Asked for soy sauce she said yaa we have! Never got it! Asked another lady and she ignored us, I was like what is going on here.... Wanted to leave right away but I couldn't cause she took for ever to get me the bill ! Wow . I usually, when I got the bill I got charged for two ice teas two Thai ice teas one soft drink extra, all we ordered and got was ice teas wow keeps getting worst by the minute. I will never ever come back!! I'm pissed! I"
        }, 
        {
            "index": 326, 
            "rating": 5, 
            "review": "Loved pad kea mow....it's the best I have ever tried. We do come here for pad kea mow  ever other day for lunch...."
        }, 
        {
            "index": 327, 
            "rating": 1, 
            "review": "Not authentic!! I was very fooled by the pictures I order pad see ew.. I expect Chinese Broccoli due to what the previous Yelp pictures showed it did not look the same it also had no flavor and the noodles are very mushy definitely not fresh noodles and to top that they had very bad customer service which I was going to let pass but for the food to not be good I had to leave a review."
        }, 
        {
            "index": 328, 
            "rating": 4, 
            "review": "Archis is was one of the better Thai food restaurants in Vegas. I've been going here for years. I usually get the Penang, Thai beef salad, pad kea mow. Can't go wrong with any of those."
        }, 
        {
            "index": 329, 
            "rating": 5, 
            "review": "The Tom Kha soup was amazing. We will be back soon! The atmosphere was quiet and felt traditional. It also appeared to be family run which I think makes for better food."
        }, 
        {
            "index": 330, 
            "rating": 1, 
            "review": "I was very disappointed in my visit today. From looking at other's reviews, it seems like Archi's takeout service is horrible. I can definitely agree. When I called this afternoon, no one picked up the phone. I called again and placed my order at 1:17. The lady said she will \"see me in 25 minutes.\" We got there at 1:44. The food should have been ready by then, right? We waiting until almost 2:15 to get our food.. I placed my order almost an hour ago. My boyfriend had to wave down a server 3-4 times. I ordered spicy level 4 and 5 on my dishes and they were not spicy at all. Portions were lacking for paying over 10 dollars for 1 pad thai dish. I've dined in here before and it actually replaced Thai Style Noodle House for a while. Don't think I will be coming back though."
        }, 
        {
            "index": 331, 
            "rating": 4, 
            "review": "Great place. The food here is wonderful at a great price. The only Thai in summerlin with a 4 star in my book"
        }, 
        {
            "index": 332, 
            "rating": 4, 
            "review": "Really solid restaurant. The service is great and so is the food. If it had the option I would rate it as a 4.5. The reason not a five is because its great but its also not the absolute best I have had. I would say it is authentic and I would highly recommend!"
        }, 
        {
            "index": 333, 
            "rating": 5, 
            "review": "Yummy!!! Had the panang curry and pad ke mao noodles 7/10 spicy and they made it vegetarian for us! Delicious found a fav by the house."
        }, 
        {
            "index": 334, 
            "rating": 2, 
            "review": "Normally I would say that Archies is one of my favorite Thai food places, but this time was not as pleasant. I walked in to a busy atmosphere and it took one of the girls walking by me three times before I was greeted. I place my order at 1:23 for just basic pad Thai and some red curry.... After patiently waiting, at about 1:55 she says it's coming out in just a minute. Finally my food is here and I can go enjoy it at home, well the pad Thai was great as usual, but I've been having bad experiences with curry lately so I'm always extra careful when eating it... And of course there it was, a giant, black, wavy piece of hair, I almost puked. I couldn't believe it, I'm literally still in shock as I'm writing this review! I didn't pay 23$ plus tip for food with nasty hair in it! I just don't know if there are any decent Thai food restaurants left in this town, so discouraging."
        }, 
        {
            "index": 335, 
            "rating": 4, 
            "review": "We love the food here! The pad Thai never disappoints. The lunch special is the best deal ever. Huge portions. BUT... DON'T ORDER A SODA at this location. They bring you out a glass of ice and a can of soda... NO REFILLS and it's $1.95. Crazy to pay that for a can of soda. The Thai tea is delicious and it's $3.95. No refills but comes in a big glass."
        }, 
        {
            "index": 336, 
            "rating": 3, 
            "review": "i wasnt as impressed as i thought i would be. The food was good but i think I was expecting more based on the great reviews. I didn't care for the fresh spring roll, it was not like any other fresh spring rolls I've ever had. It was more like a sausage roll with some veggies and glass noodles rolled in a dough. The silver noodle salad medium spicy was good."
        }, 
        {
            "index": 337, 
            "rating": 4, 
            "review": "Huge portions, great tasting food, and very good service. I will be back again."
        }, 
        {
            "index": 338, 
            "rating": 5, 
            "review": "Should definitely try the stuffed chicken wings ! The soup is very authentic. Not overly sweetened like all the other Thai restaurants trying to make it tailor to customers other than Thai. Very authentic I would say."
        }, 
        {
            "index": 339, 
            "rating": 3, 
            "review": "This is good Thai-American style food. Service is fast and good, prices are right and it is clean, and tidy.  We were a party of 3 and ordered 3 dishes to split. All were good but the green beans and fried tofu with basil was very yummy. They gave us an ample amount of rice and a hot sauce that was actually hot! The spring roll was fresh and flavorful, but the brown sauce they served it with was uninspiring. I prefer a more authentic taste of Thai, but this place is good."
        }, 
        {
            "index": 340, 
            "rating": 4, 
            "review": "I actually love Thai food and have tried so many Thai restaurants. Archie's has its select dishes that are absolutely delectable. Including the choochee I think that's what it's called amazing!"
        }, 
        {
            "index": 341, 
            "rating": 5, 
            "review": "My favorite Thai place in town. I've been here many times over the past few years and it never ever disappoints.\n\nThe service is usually very good and the servers are very attentive.\n\nThe yellow curry is by far my favorite and the best curry in town I think. The chicken and seafood varieties are very good although I prefer the seafood.\n\nTheir pad Thai is also very good and the fish cake app is amazing."
        }, 
        {
            "index": 342, 
            "rating": 3, 
            "review": "Oh Archi's.  What has happened to ye?\n\nI used to love and frequent this place often, but then went through a phase where I just wasn't feeling the Thai vibe.  Recently, though, I got a craving for some red curry.  I could just taste that flavorful goodness as we drove down to the restaurant.  My husband was excited about the Pad Kea Mow.\n\nUnfortunately, I was disappointed in my grand comeback to this former go-to spot of mine.  \n\n- The service was terrible.  We waited almost 20 minutes for someone to come and take our order.  I felt so bad for the couple next to us, hidden in a corner.  The staff completely forgot about them back there and the husband had to go ask the hostess TWICE to send over a waiter.  Maybe it's because it was a Monday holiday (President's Day) and they didn't expect such a big crowd?\n\n- The prices had increased.  One of the things I loved about Archi's was their price point.  It's still moderately priced, but it was still disappointing to see the increase.\n\n- My beloved curry (spiciness level 3) was over spiced and over powering.  The beef was overcooked and tough.  The Pad Kea Mow (also a level 3), on the other hand, was bland and had no spice to it!\n\nOhhhhhh Archi's.  Of course I'll come back and try again because I love you so much, but I really hope this isn't the end of our relationship."
        }, 
        {
            "index": 343, 
            "rating": 3, 
            "review": "The food here is really good.  The fried rice and pad Thai is excellent.  Having said that,  we had to ask for someone to take our food order. Really?  Take out is highly recommended ."
        }, 
        {
            "index": 344, 
            "rating": 2, 
            "review": "Below average.  Use to be good, but now they just toss stuff together.  Too much spice ( turmeric) in one dish.  The other dish -papaya salad tasted a few days old.\nI won't be returning.\nTry Natalie Thai."
        }, 
        {
            "index": 345, 
            "rating": 5, 
            "review": "We love Archi's for dining in or taking out! Our go-to is the Basil rice, panang curry, yellow curry, and drunken noodles. They never disappoint and the service has always been great"
        }, 
        {
            "index": 346, 
            "rating": 4, 
            "review": "pretty good place.  my father would rate this place a four star, he is here every moment that he can get to eat. i luv it because it is clean and it is good for family gathering. If you get a chance to eat here and love seaqfood try as an entree the tom yum soup (sea food mix). It will be good enough for four or more people to eat. Also, most their plates can feed more than two. check it out!!!"
        }, 
        {
            "index": 347, 
            "rating": 5, 
            "review": "The  spicy chicken thai basil is delicious and their lunch special can't be beat!"
        }, 
        {
            "index": 348, 
            "rating": 4, 
            "review": "Very good Thai food and reasonable prices. My spice level was a 2 which was plenty for me, husband got a 5 which was a bit too much for him. Pad Thai and spring rolls were my favorite dishes."
        }, 
        {
            "index": 349, 
            "rating": 5, 
            "review": "We love this place! The service is always fast and the people are nice. The food and prices are excellent. We've tried a lot of items on the menu and everything has been good. The tom yum soup is fantastic."
        }, 
        {
            "index": 350, 
            "rating": 3, 
            "review": "First time trying Archie's. We were in the area and we found it strictly based on Yelp reviews.\n\nReally enjoyed the atmosphere and the service was extremely attentive!\n\nI personally enjoyed the Pineapple Chicken Curry a lot. Chicken had lots of flavor and was cooked perfectly.\n\nMy wife had the Chicken Chow Mein (and I must agree) it was very bland and lacked any type of seasoning.\n\nOur biggest issue was the \"Fresh Spring Rolls\" which are a signature of any good Thai restaurant. These had a very doughy wrap and felt more like vegetable sushi rolls. Once again, no seasoning or signature flavor at all. The peanut sauce was extremely tame and didn't add much.  Did not enjoy these at all (mainly because of the wrap)\n\nI wanted to give Archie's five stars right when we walked in... It's a beautiful spot. But it wouldn't be the truth after eating the food."
        }, 
        {
            "index": 351, 
            "rating": 4, 
            "review": "I have heard many people rave about archie's and I agree!.  I was unaware of how close this place is to my home, which is definitely a plus!\n\nFood: Variety of options with lunch specials served on weekdays (except for holidays) that are reasonably priced.  We came on the weekend so I did not have an option of trying these.  My husband and I started with the stuffed wings appetizer.  5/5 YUMMY!  I had the red curry with shrimp 5/5.  Flavor and spice spot on #6 spice level very tolerable.  My husband had the yellow curry with chicken spice level #5, equally tasty!  I prefer things more on the spicy side so next time I'll try #8  I love how the rice soaks up the juice from the sauce!\n\nService: decent.  Not over the top.  We did wait a bit for our bill, but nothing to complain about.\n\nOverall I would recommend and will be back to try other things on the menu!"
        }, 
        {
            "index": 352, 
            "rating": 5, 
            "review": "Unlike the other Archi's Thai restaurants in Vegas, this one is very very close to my home. This is a very dangerous thing!\n\nI get, exclusively, the Chicken Panang Curry because it is delicious. I use Archi's Panang Curry as my bar to which other Thai food is compared.\n\nPro-tip: they'll ask you if you want spicy level 1-10. If you're a fan of spicy food, it actually goes to 30 (in increments of 5 after 10). I get the 30. It's good. At the one on S. Rainbow a 30 is *incredibly* and inedibly hot for me. Here, however, it's only *incredibly* hot, and thus edible. Different Archi's have different levels once you venture into the land beyond the 1-10 scale. Tread lightly. Work your way up."
        }, 
        {
            "index": 353, 
            "rating": 5, 
            "review": "Lots of times when people say they like Thai food that sometimes means their talking about the Pad Thai. lol I'm one of them~\nAnyways I love coming here EVERYTIME I eat here I am satisfied and happy. \nService-excellent fill up my drink all the time and food comes out fast\nfood- oh yes. hmm....spicy eggplant. yes try it. try try try. any food that comes out of their kitchen is the bomb. It might be a illogical fallacy but whatevs. Archis make good food all the time ;deal with it"
        }, 
        {
            "index": 354, 
            "rating": 4, 
            "review": "Hands down the best Thai Restarunt in Las vegas, definitely worth checking out if u love Thai food, the portion sizes are good, great location, with great prices. Customer services is good. It can be better but I don't mind it because the food is execellente"
        }, 
        {
            "index": 355, 
            "rating": 3, 
            "review": "Waited for about 10-15 minutes. Order the food, and waited for about 1 hour before the food came. During the waiting for food, the server never stopped by to give updates or anything. Food is good but not great. Ordered Fried Egg on the side, came cold. Server told me that she will get a new one. 30 seconds later with the same egg that I cut in half soggy... They must put it in microwave.\nService: 3/5\nWait Time: 1/5\nFood Quality: 2/5"
        }, 
        {
            "index": 356, 
            "rating": 2, 
            "review": "Oh so disappointed. Everyone raves about this place so we finally tried it and were let down. We were seated in the corner and totally forgotten about. We ordered the tom yum soup and it was bland and barely had anything in it. It was more like a bowl of broth. The masaman was watery and flavorless. In my opinion they cant compare to Pin Kaow on Lake Mead and Rainbow."
        }, 
        {
            "index": 357, 
            "rating": 1, 
            "review": "Horrible customer service.  My husband placed a to-go order and I went to pick it up.  Paid, left a 3.00 tip on a 12.92 order, ordered pad thai.  Got all the way home and my husband was calling me telling me they sent me home with the WRONG order and I needed to go back.  I went back and asked how I was going to be compensated.  She either had no idea what I was asking or was playing dumb.  She offered me a tea \"to make me happy.\"  I went 20 minutes out of my way, gave a $3.00 tip on a to-go order and SHE screwed up and offers up a tea.  Our business will be taken else where."
        }, 
        {
            "index": 358, 
            "rating": 3, 
            "review": "As a lover of Masaman curry, I've been trying a lot of places to try and find the best one.  At around 10 dollars (including tax) I'd say their beef masaman curry is well worth the money.  It's definitely not the best.  My favorite so far would be Komol's (in Sahara) but this is a good alternative considering I live in Summerlin.  The reason I don't think theirs was as good was because the beef pieces were \"sliced\" (as opposed to chunks of beef like at Komol) and the potato wasn't cooked as thoroughly as I'd like (it was still kind of hard).  The service was subpar."
        }, 
        {
            "index": 359, 
            "rating": 4, 
            "review": "One of the Best Thai Restaurants in town.\n\nLet me start off by saying I have been to all of the Archies locations and this is by far the best and most consistent. The interior is beautiful and the wait staff is very friendly. But if your like me and order take-out then prepare to suffer through ordering because one of the kitchen staff normally answers the phone and lets just say Ixnay on the English. But for the quality and price of the food you cannot beat it. \n\nI normally order the Chicken Satay and to be honest there have been times when this has been overcooked. But only when I phone in an order. And I can honestly say it's only been twice in 30 some odd visits. The peanut sauce is my favorite out of all the Thai places I've tried. Also on the appetizer front is Beef Jerky which comes with a light citrus sauce. I dont care for Thai Jerky on a norm but theirs is good. \n\nFor the entrée my norm is Pad Ka Pow (Spicy Basil) Beef. It is ground beef in a spicy chili basil sauce with sliced bell pepper and zucchini. Seriously, it is without a doubt my favorite dish of theirs. The meat is so spicy and flavorful. It always clears the sinuses. If I'm not feeling Ka Pow on a certain night than I get Pad Thai. Their Pad Thai has a fresh taste to it. And while I enjoy shrimp Pad Thai; theirs while being good had the tails intact which is a pain in the keester. So I would suggest getting the chicken version of the dish.  I have had other various entrées that are equal in quality and flavor. And love trying new dishes when ever I need a change. \n\nAnd finally dessert. They feature a plate of sticky rice with fresh fruit which is amazing. It's a bit pricey ringing in at $7 but I think it is worth it for the amount of yummy goodness you get. And it is easily big enough for two people. \n\nSo take a chance and try this place. As I have said it's the best Archies in town. \n\nHappy Eating,\nJace"
        }, 
        {
            "index": 360, 
            "rating": 5, 
            "review": "Classic Pad Thai today for lunch special!  Great atmosphere. Attentive service. Located right next to the theater deep in the shopping center. Soup came out warm, not as hot (temp) as I like or should be; but flavorful and full of ingredients. The Pad Thai special is touted as their signature dish. Delicious and hit the spot for me.  Sweeter than the other Pad Thai dishes I've had around town; like Pinkow, Lucky Thai, or Le Thai (my favorite for atmosphere-but small and parking sucks.) I got a 6 on the 1 to 10 spicy scale at Archie's. Medium as it should be at 6. You might want to go to an 8 or higher if you want to clear your sinuses. Nice place for lunch. Quick, clean and classy. Good parking."
        }, 
        {
            "index": 361, 
            "rating": 5, 
            "review": "I am a huge soup fan and I just love their shrimp soup. Very Fresh tasting and I will go back here. I do like other thai places in town which I have reviewed but this one is near my house in Summerlin and is very good."
        }, 
        {
            "index": 362, 
            "rating": 5, 
            "review": "I cannot say enough good things about Archie's.  I highly recommend this place.  Food is amazing and the service is great"
        }, 
        {
            "index": 363, 
            "rating": 5, 
            "review": "This place is AMAZING, to say the least. \n\nI've been looking for amazing Thai food, and thanks to some friends, I found it. We ordered about 7 different dishes, and they were ALL delicious.\n\nYou will definitely find me here."
        }, 
        {
            "index": 364, 
            "rating": 2, 
            "review": "I usually love Archies, however tonight was a horrible experience from the time we walked in. The guy at the front was trying to do too many things and wasn't seating people in a timely manner when there were tables available. Then some how my name got crossed off the waiting list and they sat the people who came in after us...he did seat us as soon as I brought the t to his attention but I shouldn't have had to. Then we placed out order and they brought my dinner date the wrong order and they had to wait. And mine got cold. Then they rushed us out with the to go boxes and taking out dishes away, however they took forever to bring the check. It wasn't the good service that we are used to. Hope they get their act together or we won't continue coming here..."
        }, 
        {
            "index": 365, 
            "rating": 3, 
            "review": "I recommend the chicken pad thai, tom ka soup and yellow chicken curry.  The food is authentic and the service is ok!"
        }, 
        {
            "index": 366, 
            "rating": 4, 
            "review": "When we are in the vicinity and feel like Thai, this is our place to go. The food is pretty expectant that of Thai Food. I mean, it isn't anything different than from another authetic Thai establishment...but they're pretty good! They aren't a hole-in-the-wall business, but its ambiance isn't stuck up. I like.its ambiance/decor. Feels kinda homely for some reason.\n\nWhat makes this place stand out for me is this is the \"closest\" place for pad prik pow. I swear everytime I hit up a Thai spot that dish is like a rare find on a menu. More so, it isn't some exotic or unique dish. Well anyway, they got it and it's good enough! Beats driving all the way to russell/215, but dang...it's almost there being I'm driving all the way from the North side.\n\nThe service is a hit or miss for us. Sometimes they're attentive and other times you're thinking, where the hell...but never have they been rude. Makes a difference, right? It does! Good thing the lack of attentiveness doesn't drag-on like some other places. So nope, no yawning here.\n\nDefinitely recommend if you're feeling Thai and you're nearby. You don't gotta jump into your car to drive through the creation for. Kid and stroller friendly!\n\nEnjoy!"
        }, 
        {
            "index": 367, 
            "rating": 4, 
            "review": "Love love love this place!!  its missing a star because they NEVER have mochi  Take it off the menu if youu dont carry it anymore"
        }, 
        {
            "index": 368, 
            "rating": 4, 
            "review": "Must try the Pineapple Fried Rice and Thai Toast! Great prices for their large portions! Great quality food! Super clean! My husband loved the Pad Thai."
        }, 
        {
            "index": 369, 
            "rating": 5, 
            "review": "This is my favorite thai place, possibly ever. Service is attentive, the food is fantastic and never takes very long to arrive, the price is incredibly reasonable, and the aesthetics are super nice. With the movie theatre right next door, it is the perfect location for a low-key date night. The pad see eau never does me wrong, and as someone who is gluten intolerant, I feel like it is worth saying that I have never had a reaction from their food, either."
        }, 
        {
            "index": 370, 
            "rating": 4, 
            "review": "Nice environment. Went with friends. Good portion. Vegetable ginger stirfry and Thai salad was good. Padh Thai was a little too sour for me, maybe a bit too much of lemon grass. Pineapple fried rice was good too."
        }, 
        {
            "index": 371, 
            "rating": 3, 
            "review": "I ended up ordering the chicken Pad Thai which was ok. A bit on the dry side. Also, it would have been nice if the server asked me if I wanted a lunch special or the full entrée. A bit pricey for the quality of food. I'd rather go to Corner Thai Kitchen. Better food and better prices."
        }, 
        {
            "index": 372, 
            "rating": 2, 
            "review": "The food here is fantastic!! But the service is incredibly slow, they don't seem to communicate between their employees because my party had to frequently deal with the same issues regarding orders, checks, and sluggishness. \n\nBut if you order to go you won't be disappointed!"
        }, 
        {
            "index": 373, 
            "rating": 2, 
            "review": "Archie's has some of the best Thai food in the valley but has the worst take-out. The location is always slammed and living local it's nice to pickup and eat at home but after witnessing through others and first hand, the servers constantly get orders wrong and then you get stuck waiting close to an hour for your food. After this being my 3rd experience, we've decided to order take out some place else."
        }, 
        {
            "index": 374, 
            "rating": 2, 
            "review": "It was my bf & I's first time trying archi's and it was a horrible experience. We ordered pad Thai and was asked what level we wanted it to be. It was our first time, so I kindly asked what she recommended and all she said was that there's a level of hotness  (well that clearly answers my question).... \n We got our food after how long, but I got to admit that it was delicious! We ordered pad Thai (level 3) & garlic pepper shrimp. Half way through the garlic pepper, we found a strand of hair and it really just ruined our appetite... \nThey were polite, apologized & removed it off the bill so that's a good thing. It coulda been okay if we didn't find the hair in our food. So I give it 2 stars..."
        }, 
        {
            "index": 375, 
            "rating": 5, 
            "review": "One of the best Thai restaurants I've been. We were seated right away on a Saturday evening, and the service was fast, accurate, and very friendly. \nWe ordered pad kee mow - amazing! And also the country curry. I would recommend the pad kee mow because the portion is quite big. Mild spicy doesn't taste spicy at all. The country curry wasn't that impressive, unfortunately. It is water based, so it doesn't taste like the traditional coconut based curry. \nThe dessert was fantastic. We ordered coconut ice cream with sticky rice. Wow! It was so big and delicious! Definitely do it if you like coconut. \nWill come again next time we are in Vegas!"
        }, 
        {
            "index": 376, 
            "rating": 4, 
            "review": "I've eaten here once before and I think they're pretty good.  We came late in the evening.  I just wish the server would have told us the kitchen was closing.  You know...last call?  We wanted to get dessert but when we asked after another server unceremoniously dropped the check on the table without saying a word, we were told we could not order anything but mochi ice cream.   But the rest of the service was pretty good.  Waters were filled, though I did ask once.  And someone checked on us after we had started eating.  I hope to try Lotus of Siam soon and see how the 2 compare."
        }, 
        {
            "index": 377, 
            "rating": 4, 
            "review": "Great Thai food!!!  Their curries and pad thai are among the best I have ever had!  Love that you can choose your own spiciness temperature for each dish, which many Thai restaurants don't offer!  They also have great Thai Ice Tea.\n\nGreat and convenient for take out!"
        }, 
        {
            "index": 378, 
            "rating": 2, 
            "review": "I used to go to Archi Thai a lot when they were still small, mom & pop kind of place. Their first location at flamingo was the place we go to. I've been to their location at Sahara a few times and has always been disappointed. The food has gotten more expensive, lesser meat, smaller servings and too sweet for my taste. Don't get me wrong they are still busy but service as well is going down the drain. I can go into detail but I don't want to waste any more of my time."
        }, 
        {
            "index": 379, 
            "rating": 1, 
            "review": "If I could give zero stars I would. We placed a phone order and accidentally called the other location. When my husband went to pick it up the guy refused to make food for him. He said \"You called the other location so pick it up there.\" When my husband asked if he could just place a new order, the guy told him no! They refused to make us food! The other location was way downtown, not just a few blocks away, and it's a simple mistake. We have never experienced this kind of rudeness at a restaurant before. We will never go back!"
        }, 
        {
            "index": 380, 
            "rating": 1, 
            "review": "Wow what an obnoxious manager they have running this place. My daughter ordered Sweet and Sour chicken and normally it's deep fried and their's isn't however the taste of the sauce was horrible so I explained that she wasn't going to be able to eat it and he told me I would still be charged because everyone else in the restaurant was eating the same chicken. In all my years of dining out that has never happened to me. I told him that I wasn't going to eat my food and we walked out! Horrible customer service skills. Their are a lot of great restaurants in town so good luck in the future Archi's."
        }, 
        {
            "index": 381, 
            "rating": 4, 
            "review": "Awesome service.\nAwesome location.\nSolid atmosphere.\nExcellent food!\n\nBeen here for lunch and for dinner and it rocked both times.  All very very good: Red Curry Chicken, Spicy Basil (both Beef and Chicken) and Pad Thai.  Fresh spring rolls are just so-so but thats not because of Archi's.. they are always just so-so anywhere.\n\nHot rating runs a little hot from my experience... a 4 here is like a 6 at other places but its still super good.\n\nDon't miss this place, the great food or the great service."
        }, 
        {
            "index": 382, 
            "rating": 4, 
            "review": "Archi's has very good Thai cuisine. Their menu is comprehensive, the restaurant is clean and modern, and the only drawback was the service, which seemed a little disorganized and inattentive.\n\nWe tried the Pad Thai and Shrimp Fried Rice on a recent lunch outing.  Both dishes were excellent, full of flavor and seasoned just right. Lunch specials come with soup of the day, a fried Spring roll and a Wanton.  The portions are on the large side, maybe a bit too much food. \n\nRecommend highly."
        }, 
        {
            "index": 383, 
            "rating": 5, 
            "review": "Best Thai food in town!! Amazing food and amazing prices."
        }, 
        {
            "index": 384, 
            "rating": 2, 
            "review": "No. No. No. Service was awful. We were served several dirty dishes. The food was decent, but not worth the awful service! You couldn't pay me to come back and deal with this service. Look out for hidden fees."
        }, 
        {
            "index": 385, 
            "rating": 2, 
            "review": "Every time we try to go to Archi's, they're closed!!! It's either remodeling, taking extra time off for the holidays, or it happens to be Tuesday and they're closed every Tuesday. How does a business stay open? So annoying!!!"
        }, 
        {
            "index": 386, 
            "rating": 3, 
            "review": "So, I'm pretty much ALWAYS in the neighborhood/general vicinity of this place, it's also been there for close to four years and yet as a lover a Thai food I STILL haven't tried this place? I hit up Buldogi's, Jollibee and Pyaar (R.I.P.) long before I even bothered to check this place out. Could it be living across the street from Basil n' Lime? I really don't know.\n\nSo I finally did check the place out. What a wise decision. :)\n\nThis may seem a little underwhelming to some because I had Pad Thai. I know, I know, too \"Americanized,\" but that's the very dish that eased me into trying and loving Thai food, and to this day I feel the only way l I can trust a Thai restaurant is if they do Pad Thai right. Anyways, on to how I felt about the Pad Thai. It came out in a HUGE plate, and they don't skimp on the meat (a very good thing since Basil n' Lime is starting to get skimpy with the meat in their Pad Thai). It was fresh, and of course it would be ridiculous to expect Pad Thai to not be greasy at all, but the grease was at a minimum, which was great. No groggy, increased blood pressure feeling afterward. The only issue I had with the pad thai was a few too many glass noodles, they really could have cut back on that (and looking at other plates around the restaurant it seems like they smother EVERYTHING in glass noodles) In addition to the Pad Thai, I also had the Thai spring rolls. These definitely could have used a little more seasoning, but they were fine when dipped in the sweet chili sauce on the side.\n\nThe service wasn't very attentive unfortunately, I had to flag people down for pretty much everything, and the fact that the restaurant wasn't even that crowded made it even weirder. The dining floor is very nice though. Small but cozy feeling, not cramped. The ambiance is also in a sort of middle ground between casual and formal. The decor was also very in character (with the exception of the small Budda (not Buddha) statue on the front table....wtf?). The chairs were uncomfortable though, just saying. \n\nMy bill came out to be about $13. At B n' L, it would be almost $16 or $17 for a similar meal, so that's one pro Archi's has over them.\n\nTHE FINAL VERDICT:\n\nPros:\nFresh food.\nReasonably priced.\nThey didn't screw up the pad thai, a good enough pro in of itself.\n\nCons:\nIffy service.\nToo many glass noodles in everything.\nUncomfortable chairs, so it's probably better to do take-out.\n\nThe wtf?:\nIs the fat Buddha (appropriately known as Budai) apart of Thai culture at all?\n\nSuggestions:\nBe more conservative with the glass noodles. You only need a little bit of them for some crunch in the food, since they don't have much of a flavor on their own. \n\nWill I return? I'm really not sure."
        }, 
        {
            "index": 387, 
            "rating": 5, 
            "review": "One of my favorite Thai restaurants in town. If you have a chance, visit during lunch. Their specials are extremely reasonable and delicious!"
        }, 
        {
            "index": 388, 
            "rating": 4, 
            "review": "This place serve some very decent Thai food and we eat here on a fairly regular basis. Never had a complaint here, prices are affordable and service is more than acceptable. But the construction in the shopping complex, where this particular Archi's is located, is something that you should try to avoid, at least until after it's completed."
        }, 
        {
            "index": 389, 
            "rating": 4, 
            "review": "Spicy Basil, always amazing. Their tofu was cooked well, which is hard to come by and they didn't skimp on the zucchini (huge plus).  I like really spicy thai food, but my friend ordered this dish mild and it was still super delicious with a good amount of spice."
        }, 
        {
            "index": 390, 
            "rating": 4, 
            "review": "Archi's is a Las Vegas Thai chain with 3 locations, and I must admit that a recent obsession with Thai Noodle had caused me to forget about how much I do enjoy some curry and noodles at Archi's, particularly at my neighborhood location. \n\nWhen we first moved to town, Archi's was our go to spot for Thai. The food can be great, which I will get to later, but I think what distinguishes Archi's from most restaurants in Las Vegas is their interior. They have done a brilliant job transforming a strip mall space into a warm, clean and welcoming space. There is a coherent sense of design, which puts me at ease for some reason. Maybe it just makes me feel like Archi has a good handle on things. \n\nAnd he does! After being a little Thai adventurous and eating all around town, I can confidently say that when the food is good it is really good. Granted, they do suffer from inconsistency from time to time, and their spice scale baffles me. A 3 can be mind-blowingly hot despite the fact that the scale supposedly goes to 10. Consider yourself warned. \n\nDespite that, when I want curry or Pad Kee Mow or a very respectable eggplant dish, I am happy to visit Archi's. The tofu in their stir-fry and noodle dishes is not the most flavorful, but I was obsessed with their Pad Kee Mow for at least a month. I became a little frustrated when the vegetable selection kept changing. How hard is it to give a girl a solid helping of real vegetables (baby corn does not count) with her noodles? However, on my last visit, I told the waitress \"lots of yummy vegetables please\", and apparently that is the secret phrase to unlock garden delight because I got mega-veggies. Splendid!\n\nThe service has always been no-water-glass-empty amazing when I have visited. Food comes out quickly and hot. Servers are always nice.\n\nI was teetering between a 3 and a 4 for Archi's, but Archi, I am slapping a 4 on your establishment because although the food is a little inconsistent, I really really appreciate the atmosphere, cleanliness and service, and when the curry stars align, the food is definitely fan worthy."
        }, 
        {
            "index": 391, 
            "rating": 5, 
            "review": "Love this place so much. One of three restaurants that I crave on a multi-weekly basis. Everything is always fresh, service is superior, and ambiance is true to the classic Thai restaurant. \n\nDrinks are easy. They usually either crack open a young Thai coconut with a straw, or pour me an ice cold glass of Thai tea, depending on my mood. If I'm hungry enough for an appetizer, I go with the veggie egg rolls, and sometimes a cucumber salad with peanut sauce. For dinner, it is almost exclusively a beef salad with a request for lean beef (no, I don't like chewing on fat) and my absolute favorite, PANANG CURRY with chicken beast. I'm literally drooling while writing this. Panang curry is so creamy and spicy you'll want to order extra curry sauce, which I usually do. I've tried other things, that were admittedly delicious, but I can't not order panang. \n\nIf you're lucky enough to come in often, the hostesses/waitresses will likely remember you. This always adds to the experience, when they welcome me back and ask if I'd like my regular order. Nothing beats that feeling. \n\nAmazing service, amazing food. Get here."
        }, 
        {
            "index": 392, 
            "rating": 5, 
            "review": "I've dined here probably 15-20 times since my coworkers love this place, it's close to work, and they have good lunch specials. I'm happy with everything I've ordered except the fresh spring rolls with Chinese sausage. I would not order that again.\n\nTheir lunch specials all come with their soup of the day, a fried spring roll, and a fried wonton. I've finished their lunch specials except for their Pad Thai. It's a huge serving, enough for two or three people. I like to eat Pad Thai with jalapeños for an extra spicy kick. Spicy basil with ground beef or fried tofu is another favorite of mine.\n\nTheir non-lunch choices- Pad Prik King, Rad Nar, Panang curry, red curry are wonderful choices too.\n\nTip-They are closed on Tuesdays which I thought was a weird day to be closed."
        }, 
        {
            "index": 393, 
            "rating": 4, 
            "review": "If I have a Thai food craving and don't feel like driving to Lotus of Siam, Archi's satisfies the craving. You're not gonna find out of this world dishes, but the kind of dishes that have become staples of Thai food found in America. Service is always prompt and attentive and it's speedy when you're ordering takeout."
        }, 
        {
            "index": 394, 
            "rating": 5, 
            "review": "Their spice levels are out of this world! Make sure you get the lowest level of spice if you're like me and can't take spicy foods. If you love spice, this is the place for you! My friends ordered 7's and I spent the entire time sniffling and sweating. Let's just say it was a very uncomfortable meal for me.\n\nThe tom yum kah with flat noodle was nothing special. It was loaded with mushrooms and noodles. I wish there was more chicken in it. The spicy garlic chicken was vey garlicky and served atop a bed of cabbage and broccoli. Healthy dish that came with a side of rice. The Panang curry was probably my favorite dish here. Definitely a must try! Lastly, the pad see ew was also yummy but nothing memorable."
        }, 
        {
            "index": 395, 
            "rating": 4, 
            "review": "I would give this 5 starts but my order was wrong last time.  I asked for an 8 and 2 and I got a 10 and 8.  Needless to say, I couldn't eat it and lunch time was over I had to get something else.\n\nOn the positive side, their portions are nice sized and the food is very flavorful.  I used to go to the one on Flamingo and Rainbow and stopped going there because I found a hair in my food.\nOther than that I like this place."
        }, 
        {
            "index": 396, 
            "rating": 4, 
            "review": "I never knew I'd love eating catfish orr curry. I guess archi's has given me a reason to. It's called chu-chi here and it has both curry and catfish in one dish. I get it at level 7 cus I love the spices from Thai cuisine. We always have celebrations here or sometimes just roll deep for no reason. I'd say it's prolly the last great thing standing at village square, besides the movie theater next door."
        }, 
        {
            "index": 397, 
            "rating": 1, 
            "review": "They brought us water, the place  is NOT busy! Why can't someone take our order? I don't get it, they put us in the corner now no service! What a dump! On new years eve  when it's not busy customer service does not exist here!"
        }, 
        {
            "index": 398, 
            "rating": 4, 
            "review": "The food here is very good, one of my favorite Thai restaurant. Service is excellent. Foods came quick. I had pad thai spicy level 10, was not disappointed!"
        }, 
        {
            "index": 399, 
            "rating": 3, 
            "review": "This would be a 5 star if for the food alone.  It would be a 4 star if the only issue was the fact that the rice portion that comes with the red curry was too small. It became a three because the service we had wasn't very good. I admit I will give it another try in the future as I think every place can have an off night for some patrons."
        }, 
        {
            "index": 400, 
            "rating": 5, 
            "review": "Nice place to eat tasty food.service is good enough.prices are affordable.staff is fast and kind.will definitely come back to have a lunch or dinner.my review is not big enough.will update it later."
        }, 
        {
            "index": 401, 
            "rating": 4, 
            "review": "I love their curry which is all I ever get there. They have a few different kinds but they are all delicious! I usually come before going to the movies next door. It's not usually too busy and you don't really have to wait. They are a little slow with the service though. Worth checking out."
        }, 
        {
            "index": 402, 
            "rating": 5, 
            "review": "I just had dinner on Sahara location great place good food can't wait for next time ..."
        }, 
        {
            "index": 403, 
            "rating": 4, 
            "review": "Ok so I am from LA.  This is not LA thai...  It is very good.  We had the Tom Yum soup with shrimp...  Very nice.  We had the red curry.  Very nice...  Best I have had in Vegas..."
        }, 
        {
            "index": 404, 
            "rating": 4, 
            "review": "Archie's is one of the best Thai restaurants around Vegas. I always order the yellow curry with chicken and the pad Thai noodles. Both dishes are excellent. I don't usually order too many other items on the menu, but I have tried a few other dishes that were also very good. If you want to try a good Thai place, try Archie's. You won't be disappointed."
        }, 
        {
            "index": 405, 
            "rating": 4, 
            "review": "You can't beat great Thai food, and Archi's has just that. When we first moved here it was one of the first places we ventured to and has remained a favorite. Not only is it great tasting food, the service is also wonderful. They are very welcoming, attentive and the food comes out pretty quickly. I love their pan nang curry. I tend to stick to that dish while my husband ventures out and loves everything he gets. This is a great little, friendly place for quality food. They are closed on Tuesdays....which is when I crave them the most!"
        }, 
        {
            "index": 406, 
            "rating": 4, 
            "review": "solid penang curry. i ordered to go and it was delicious. had some leftovers and re-heated two days later, and it was still solid."
        }, 
        {
            "index": 407, 
            "rating": 5, 
            "review": "Nice place, plenty of space and clean.  Service was very quick and professional, drinks were kept filled.  Food was very fresh and tasty, came out fast and steaming hot.  Spice was good, but perhaps a little on the mild side when I ordered one dish at a \"9\", but I love spicy food.  We will definitely return."
        }, 
        {
            "index": 408, 
            "rating": 5, 
            "review": "My mouth is watering just thinking about this place. Best thai food around!! I've enjoyed every single meal I've ever eaten here, and I continue to crave it after I've left. The service isn't outstanding, but the food is the best part and will keep you coming back for more! You won't be disappointed if you love some good thai food. Highly recommend."
        }, 
        {
            "index": 409, 
            "rating": 4, 
            "review": "This place is great! \n\nThe food is fantastic, good menu selection and everything is always consistently tasty. The Pad See Ew, Pad Kapow, Pla Moo and Masaman Curry are all great choices. The waitstaff is cordial (enough), but if you go for dinner... be prepared to be a little patient, as you may have to wait a bit to get serviced. Although in my opinion, it's a good thing when a restaurant is busy like this. One of my fave spots for Thai!!"
        }, 
        {
            "index": 410, 
            "rating": 5, 
            "review": "Delicious!\n\nTheir walls are covered in awards, and every last one is well deserved. I'd post a picture of my food, but I ate it too fast.\n\nHighly recommend the pad see ew. I've had it at a lot of Thai restaurants, and theirs is the best. Lots of egg, wide noodles, and plenty of flavor!"
        }
    ]
}