{
    "category": "Las-Vegas", 
    "entity": "America", 
    "avg_rating_stars": 3.04, 
    "review_count": 400, 
    "reviews": [
        {
            "index": 1, 
            "rating": 1, 
            "review": "First, the service is horrible.  My friends and I had just arrived in Vegas and were tired from our early flight.  We found America at 10:30am and wanted to eat.  The hostess said that it was currently breakfast so we could not sit for lunch.  She told us to wait at the bar and she would come get us around 11.  She never did and we kept staring at her, but she wouldn't seat us.  Finally, we got up waited in line and she gave us a table!  I ordered the nachos and the veggie burger.  They were bland and not what we expected from a restaurant in Vegas.  The service was equally poor.  I asked for mayo and never got it because we had about 4 waiters."
        }, 
        {
            "index": 2, 
            "rating": 1, 
            "review": "Came down for dessert. Took us nearly 20 minutes to get a slice of cheesecake and a bowl of ice cream. Unbelievably slow service. The 2 servers were completely overwhelmed. Where was management? They should have been helping. Food wasn't bad and decor is cool.  Bad service seems to be a theme throughout the New York New York."
        }, 
        {
            "index": 3, 
            "rating": 2, 
            "review": "I ended up TWICE here in one night and didn't particularly like either experience, BUT was forced to come here because of one thing:  Every other restaurant in NY NY stops serving food late and I needed a snack (then my friends met me and needed some sustenance too) so my option was America orrrrrrrrrrrrrrrrrrrrr America.  So America it was.  The service late at night is awful, the bar drinks take FOR EV ER (and cost too much), the prices are crazy high for the quality of the food, and the overall vibe is kind of sucky too.  Everywhere else in NY NY has such a nice vibe (or at least A vibe), but America has a Denny's with a gargantuan map one.  It's a shame I spent so much money here.  In retrospect, I would've told my friends to suck it up and walk across the street to MGM to get something instead.  Now I know."
        }, 
        {
            "index": 4, 
            "rating": 3, 
            "review": "Pretty good. Nothing to shout about. Alright breakfast but it's not a restaurant you'd be clamouring for. It's decent"
        }, 
        {
            "index": 5, 
            "rating": 4, 
            "review": "This is where I eat Breakfast every morning when I'm in Las Vegas. Good prices and good food. I just grab some eggs and bacon since I'm gluten free and don't eat the toast. Had good service here when I was dining with friends, but when eating alone at the bar, the bar tender upgraded my order to something I didn't want and tried to charge me more for it. I turned away the extra food (containing gluten) and ate only what I ordered. (I know there is nothing about this place that says gluten free, but I'm willing to take a risk on bacon and eggs)."
        }, 
        {
            "index": 6, 
            "rating": 3, 
            "review": "Awesome service on a Sunday morning.  Food is slightly above average coffee shop type fare.  The theme has seen better days but for a quick bite, it's fine."
        }, 
        {
            "index": 7, 
            "rating": 4, 
            "review": "Cronut?! Yes please. Walked the strip for the first time in who knows how long and ended up at NY NY so some peeps could ride the roller coaster. As I was aimlessly walking around I remembered that there was a donut spot at NYNY I heard about and they had cronuts.\nStaff - one of them was clueless but luckily another came and rescued her. How hard of a question is, \"which donut do I need to try?\" You should have a favorite and if you don't you should have one that you can pretend is your favorite to answer questions just like that. I pretty much knew I was going to try a cronut but thought it was worth asking in case she was like \"OMG you have to try this one.\"\nCronut - this looked more like the original cronut than the one i had at PB Doughnuts. It was really good. I thoroughly enjoyed it but it still felt like it was missing something. I guess I'll never know until I try the original. Maybe this was a dead ringer but in that case I would wonder what the craze was all about.\nAnyway, didn't eat anything else here but awesome little selection of donuts and I'll probably be back when I decide to go back to NYNY sometime."
        }, 
        {
            "index": 8, 
            "rating": 1, 
            "review": "Umerica.\n\nYou see, when it comes to eating the day after a long night of drinking, there's not much you can do to fuck it up.  Unless of course you're \"dining\"  at New York, New York's very own bland-a-tron.  America, is a veritable cornucopia of bad food, cheesy decor and, get this, surprisingly good service.  Yeah, go figure. \n\nThere were 8 of us eating and the majority of us all had something to say about the pathetic dishes that were brought out.  My BLT looked like it was made with bread from the local 99 cent store.  My friend Ian, who also ordered the BLT and fries, received 7 french fries on his plate.  Yes, 7.  Needless to say, we complained and got the rest of the missing fries to join his sandwich.\n\nWhile the collective moans and groans at the table regarding the food were many, I found our waitress, Sigi, to be on top of her game.  It was almost as though she had a sixth sense regarding everything at the table.  Whether it was when we were placing the order or needing a refill, there she was, Joanna on the spot.\n\nBut , regardless of how good Sigi was, service only gets you so far.  So, when you're taking a break between between betting on black and rolling those dice, think twice about getting something to eat at America...it's a definite gamble.\n\nSee, what I did there?"
        }, 
        {
            "index": 9, 
            "rating": 1, 
            "review": "From the moment we were \"greeted\" by the hostess to the moment we left, this place sucked.\n\nNeeding a breakfast fix, wifey and I strolled up, after noticing that the room was at least 3/4 empty. \n\nFiguring that this place was a safe bet, we sat down for a quick bite. Shortly after we were seated, we saw that the NBA finals were on, but with no sound, and he big 'ol closed caption lines over the scoreboard.  So, we asked the waiter upon taking our orders to make them to go - we would be watching the game in our room.\n\nOur order - breakfast burrito and pancakes - took 25 goddam minutes. Even after the wait, being in generally good spirits, we were only mildly annoyed. All we had to do now was pay the bill and get out.\n\nHowever, that sentiment quickly turned, considering that after we received the food, our waiter didn't come back with the check. \n\n5 minutes pass... As I'm getting up to walk out with my free food, my wife grabs what appeared to be a manager, and asked him for our check. He brings the check, we provide our card, and he, too, decides not to come back. WTF?\n\nI ended up walking the check to the front so the manager could complete the transaction... then guess who decides to show up? The stupid goddam waiter! How've ya been, bud?\n\nHe approaches me as I'm walking back to our table and says, \"Is everything okay?\"\n\nNo, prick. I'm missing the finals.\n\nTo wrap it all up, the meal we had in our room was indicative on the \"wish it were mediocre\" service. Dry breakfast burrito, and pancakes that were crispy like waffles on the edges. \n\nSo yeah, this place sucks. If do come back, I'll be totally hammered so I can vomit on the tables after I eat."
        }, 
        {
            "index": 10, 
            "rating": 3, 
            "review": "I have been to this place many, many times but this is my first review.  This is a great place when you want food quickly and don't want to wait for a reservation at the many other dining options inside the casino.  America has the look and feel of a traditional diner. I love coming in here for breakfast.  They recently re-did their corn beef hash and eggs dish and it was very good.  Overall, for great value and good service you really can't go wrong here."
        }, 
        {
            "index": 11, 
            "rating": 3, 
            "review": "Food was okay but nothing great, Service was kind of slow, I think New New York has to step it up a notch in order to get the quality in great standing since Vegas is known for outstanding food and service!!!"
        }, 
        {
            "index": 12, 
            "rating": 3, 
            "review": "Every casino has a coffee shop/cafe, and this is NY NY's place.  A big restaurant and so far, I usually don't wait long to get a seat, unlike most of the other places.  I thought this is a bad sign, but was pleasantly surprised.  Nothing memorable here or to write home about, but the food is good and the menu is very adequate.  I would come back."
        }, 
        {
            "index": 13, 
            "rating": 3, 
            "review": "Average fair. Expensive prices.\nShould have stayed in the room for the room service.\nI wonder if the same place makes both??\nThey dont have ALASKA and HAWAII on their world 3D map!!\nOr i missed it?  Where did they put it.  If they dont have it, its messed up."
        }, 
        {
            "index": 14, 
            "rating": 4, 
            "review": "My family and I had breakfast here one morning around 10am. It was pretty busy being around the holidays, but the wait was only about 10 minutes or so. All of the employees were really friendly and helpful. We had an 8 yr old in our group and he loved the giant map of America. Both him and my sister ordered lemonade which came with little flag toothpicks on the lemon (so cute!) I ordered the breakfast burrito which was pretty good and super filling. We all enjoyed our meals. Chocolate chip pancakes and bagel breakfast sandwich were also really good. You MUST stop at the doughnut counter and get the croissant donut with honey. OMG its amazing."
        }, 
        {
            "index": 15, 
            "rating": 2, 
            "review": "my husband had an omelette that was good. i had a blt, a little on the small side for $10, but bacon was great. Our server was awesome!"
        }, 
        {
            "index": 16, 
            "rating": 2, 
            "review": "Our meal was mediocre at best. The steak was cooked well and not bad for the price considering it's Vegas but half of our party ate chicken dishes and ended up sick. We did not have food poisoning but the food did not sit well. To top it off the chicken Picata was terrible! A lemon flavor in a dish should be light, this tasted like the pasta was cooked in concentrated lemon juice... terrible! We told the server and she quickly brushed it off then ran off to get the check. She impatiently kept checking back for the bill while we finished our drinks. We will not be returning. Ever."
        }, 
        {
            "index": 17, 
            "rating": 2, 
            "review": "So, it's 4 a.m. and you're drunk and stuck inside the New York, New York Hotel. You're a 15.00+ cab ride away from your hotel down the strip and you have no cash, your friends are borderline vomits, you're wearing a $500 dress that's sopping wet from a naked hot tub party that seems like a distant memory (wait, naked? how was my dress wet?) and the only thing that's going to keep you alive is a cup of coffee and some buttered toast. Where do you go? You go to America, the only restaurant that will cater to your busted, drunk ass. \n\nWe ordered sausage, eggs and toast, a pot of coffee, chicken fingers and nachos. Someway or another, the grand total of the bill was $60, not  including tip. This is for crap I probably could have bought at 7-11 for $10.00 or less for the same quality. I guess when you're drunk and rambling, you have to pay extra for someone to try to decipher the shit coming out of your mouth. \n\nThe service here is terrible. It's because the people who work here hate their lives and it's evident in their lack of facial expression. Some may be suicidal, I mean, if I was working there at 4 am trying to talk to drunk people who have no idea what they're doing or saying, I'd probably think off-ing myself would be a good idea, too. \n\nThe only thing worth mentioning is that fucking gigantic map of the US. I've been to America a bunch of times, the most recent time being the basis of my review - but that shit is funny when you're sober, when you're drunk, when you're high, and I'm sure if I ever did shrooms or any sort of hallucinogen, I would want to come here and just stare at it. \n\nSo what I'm trying to say is, don't come here for the food - you come here when you've hit rock bottom with your partying and you need to chill the fuck out with some really greasy, crappy food. Expect to pay a fortune for food that some dog probably shit out a few hours earlier. That's all I really have to say."
        }, 
        {
            "index": 18, 
            "rating": 4, 
            "review": "The food was pretty good but it was a bit overpriced. Banana pancakes are delicious!"
        }, 
        {
            "index": 19, 
            "rating": 3, 
            "review": "Came to America following a 4 hour road trip and were still too early to check into our hotel. Luckily, it is literally right next to the check in desk, so we didn't have to stray too far.\n\nWe were drawn in by their fabulous display of donuts and desserts. After seeing that a no frills cake donut was $2.50, I decided against just dessert. The place was pretty dead at 3pm. There's a huge 3D map of the US with different landmarks, which I thought was pretty cool to look at.\n\nI was definitely hungry so I ordered some spicy wings. The wings were a little too bready for me and they had a weird after taste. Not great.\n\nThe husband ordered the brownie sundae which was ginormous! 'Murica! The vanilla ice cream tasted like some generic drug store brand, which was off putting. You know how sometimes you don't eat ice cream out of the carton for a long time and there's that thick chewy bit at the top? That's what it tasted like. Besides that, the brownie tasted moist without being mushy. \n\nThe server at the bar was super nice and friendly. \n\nFYI...there aren't any restrooms inside the restaurant, so you'll have to take a short walk in the casino to do your business."
        }, 
        {
            "index": 20, 
            "rating": 2, 
            "review": "The servings here are generous, the place is clean and the staff were attentive.\n\nThat's about all I got.\n\nThe food was pretty so-so. I ate here a few times during my stay and nothing wowed me. In fact, I sent back one of their \"freshly made\" donuts (that are sitting out all day and not behind a case or under glass to be kept fresh) because it was probably the worst doughnut I'd ever had--dry, flavorless and just YUCK.\n\nI ordered a fruit salad with cottage cheese for breakfast one day and it was really good--the fruit was fresh and everything tasted good. The next day I ordered the same thing and the fruit looked markedly different--wilted, definitely not as fresh and the cottage cheese tasted \"off\".\n\nI wouldn't waste my time ordering coffee here, so I got a latte made at Il Fornaio next door. Though they take a while and the line gets long, the coffee there looked much better than the coffee shop variety here. \n\nRather expensive for the quality, but they do serve you a hearty portion. \n\nI probably wouldn't have been back as many times as I was if I wasn't staying here and they serve breakfast foods all day, as opposed to Il Fornaio which stops serving breakfast at 10:30."
        }, 
        {
            "index": 21, 
            "rating": 5, 
            "review": "I liked the ambience of the place very reasonable. They  had broccoli & cheese AND Chili fries for $4.50 as sides yum. I have to try this place again and again. Very Americana.  I'd say this place is one dollar sign to me, it was over $10 a person. Great service."
        }, 
        {
            "index": 22, 
            "rating": 2, 
            "review": "Service was slow and it took forever for our food to come out. When we did get our food the Eggs Benedict and hash browns were cold. I ordered the Lox and bagel and had to put the sandwich together. \n\nThe map of the United States was cool and the donuts looked good."
        }, 
        {
            "index": 23, 
            "rating": 4, 
            "review": "I have a soft spot in my heart for America. This place has been in NYNY since it opened. It's a good option for a quick basic meal. Food quality is mediocre but the servic3 is always good. For the prices, i call it a fair deal.\nGo in with those expectations and you won't be disappointed."
        }, 
        {
            "index": 24, 
            "rating": 1, 
            "review": "6/20/16.  No photos.  Just a honest review of the food because that is what matters.  We came here because it was convenient so we would not brave the heatwave, over a 100 degrees and it was only 830am.  My friend sent his eggs back because they were cold.  I finished my simple breakfast of warm eggs and potatoes.  The first round of coffee was luke warm but the refill was hot.  My other friends steak was flavorless.  For 5 of us and a bill of $136.00 they should have refilled our water glasses.  Do yourselves a favor...stay away!  There are plenty of better restaurants in Vegas...even the low rated Denny's is better."
        }, 
        {
            "index": 25, 
            "rating": 4, 
            "review": "Disclaimer Alert:  This review is just on their donuts, not the main restuarant. That being said, by the looks of their menu, there's an extensive line of breakfast, lunch, and dinner. Prices look decent, especially since America is inside a casino.  We arrived around 7:30 AM and there wasn't much of a line.  So, I'm sure we'll be back one day for some real food. \n\nAs for my review...it's all about their donuts. I tried their maple bar with chocolate drizzle and some of their cronuts.  The maple bar wasn't as good as it looks.  The donut wasn't fresh, it was lacking any flavor, and for about $3, way to expensive.  However, I think America's has some of best cronuts that I've had in Las Vegas. I have my favorite out there, but America had a unique taste to their's.  Their cronuts were layered with the outside of each layer having a crunchiness to them.  It was moist inside each layer and as you get closer to the center of this hybrid donut, it's even softer.  There's a uniquie citrus taste to these cronuts which appeals to me.  America may have bad maple bars, but sure made a huge comeback with delicious cronuts. \n\nPS:  Additional photos of America's cronuts can be found here.  http://www.yelp.com/biz_photos/donut-crawl-ii-las-vegas?select=IWJfpUAAiQK3e4zSSwB2Wg#IWJfpUAAiQK3e4zSSwB2Wg\n\n\nYELP PERSONAL CHALLENGE - (057/366)"
        }, 
        {
            "index": 26, 
            "rating": 3, 
            "review": "It's ok for good ole American breakfast my buddy got sick off the chorizo plate"
        }, 
        {
            "index": 27, 
            "rating": 5, 
            "review": "Always excellent food and service! Ramon memorized my order perfectly! Thanks, Ramon!"
        }, 
        {
            "index": 28, 
            "rating": 4, 
            "review": "Solid place for breakfast inside New York New York Casino & Hotel, near the front desk.  I had the nutella banana pancakes, side of hashbrowns, and a hot pumpkin spice coffee alcoholic drink which was lovely!  Good for a hearty meal before taking on another day in Vegas."
        }, 
        {
            "index": 29, 
            "rating": 2, 
            "review": "I am very sad that I agreed to eat here.  The food was barely palatable and my drink came out COMPLETELY wrong twice.  Service was acceptable, but in the end we paid $40 for the pleasure of crappy food and a generally bad dining experience.  Blegh."
        }, 
        {
            "index": 30, 
            "rating": 4, 
            "review": "I was reading some of the other review, I honestly do not who severed them or what kind of food they received, but my experience was much different.  My service asked if I wanted something to drink within a few minutes of me sitting down to the table, she was friendly and helpful. She let me know what kind of drinks they had, of course ice tea was perfect for me, within the time she needed to get my drink I was able to look at the menu and decide what I wanted to eat, I decided on then chicken fried steak, I figured it would be hard to mess that one up.  \n\nDuring the time I had placed my order my server made sure I had refills and asked if she could bring me anything, I did not need anything, but I did have a question on the huge map on the ceiling and what was some of the items on the map, she did not know, but it was fun talking about what it could be.  \n\nWhen my food arrived, it was fresh, hot and tasty.  I know the food it not 5 stars Restarurant quality, but I was very happy with my meal, and the cost of the meal was reasonable for what I had.  If you are looking for good food without breaking the bank (guessing that is what the casino is for) then this is a good place to eat a good meal."
        }, 
        {
            "index": 31, 
            "rating": 2, 
            "review": ".strolling through the Casinos, \"America\" caught our eye and decided to have Sunday breakfast.  I wanted to order a healthy meal so I chose the \"eqq-white omelet with the vegetable fritatta\".  The omelet was fried in oil, but it wasn't greasy.  Serving size was medium (I estimate 3 eggs worth + 1 ounce of veggies).  My meal, to say the least was not memorable, and left me a bit hungry.  So I was glad that my meal came with a bowl of diced fruit.\n\nServers seemed so rushed, but apologetic for being harry. I really felt so rushed and that they just couldn't wait to turn the table. Put it this way, they practically started clearing the table before I was through with my fruit bowl.  So much so that, when I lifted my arm to take a serving of fruit from the bowl, that by time my fork hit the dish, they had wisked away the fruit bowl and my fork ended up scooping air from the table.\n\nAfter receiving the check, they immediately took the canteen of coffee away.  I guess that was our cue to leave.  On the way out, with our check in hand and headed to the register, we decided to admire the globe on the ceiling (which was the restaurant main feature and what drew us in). After gazing upwards for 20 seconds, the hostess snapped the check from our hand and said, \"i'll just ring you and if you can follow me, you can sign your bill\".   \n\nPrice for food/experience was not good.  My small meal + coffee + iced tea came to about 35 bux.  I would definitely NOT return and also NOT recommend to friends! There are better places to blow your money on."
        }, 
        {
            "index": 32, 
            "rating": 2, 
            "review": "I'm going to say the pluses of this place are the super cool map of the US.  I can never stop looking at it when i'm there, and the fact that it's 24 hours.  Other than that....the food is not great, and although the service is friendly, i kinda think they forget sometimes there are customers.  Only go for late night or desperate eating."
        }, 
        {
            "index": 33, 
            "rating": 5, 
            "review": "Great food and atmosphere! But what made our dinner tonight so special was our wonderful waitor Neverly! He was so professional and kind and took perfect care of us. He has such a pleasant personality and we really enjoyed being taken care of by him. He is truly a great employee, this restaurant is lucky to have him. Thank you Neverly!"
        }, 
        {
            "index": 34, 
            "rating": 5, 
            "review": "We always stay center strip but still constantly find ourselves walking to NYNY just to eat at America.  This last trip to Vegas we ate there 3 times.  Their food is amazing and their deserts are also top notch.  The service is always great but we have to give props to the server we had on Friday 2/21/2014, her name is Novak and she provided excellent service with a genuine smile!  We Highly recommend this restaurant when you are in Vegas!!"
        }, 
        {
            "index": 35, 
            "rating": 1, 
            "review": "Came here because we still had credit we HAD to use towards dinning. It was use it of Loose it. Oh how I wish we lost it.\n\nWalking in, you get the feel of Denny's meets Marie Calendars, meets Carrows. \n\nI ordered the Eggs Benedict, BF ordered an omelet, safe right? \n\nOmelet arrived, looked like a normal omelet\nEggs Benedict - hmm, hollandaise sauce was topped over the egg, but why did it not drizzle even a little down the egg? And what's this black stuff on the muffin, wait, they burned the muffin?! Can't be too bad since only ONE side was burnt. OK, I have this rule of taking back food, I TRY NOT to. I took one bite and seriously, all I tasted was the burnt of the toast. OK, take 2, can I get this fixed? \n\nTake 2- Manager comes out to apologize for the order. OK, muffin not burnt, but only a the tips of the crust seem to be a little charred. Bite- why is this muffin not toasted? hollandaise sauce was thick and gewey, tasted a bit mushy. Egg was a bit overcooked and hash browns were mushy on the outside. No amount of Ketchup could save them. Only hate 1/2 of one muffin.\n\nBF said his omelet was OK, but I guess his stomach didn't give the same reaction and suffered for 2 days after.\n\nService was sub par. At least my meal was  comped."
        }, 
        {
            "index": 36, 
            "rating": 4, 
            "review": "Service was very fast contrary to what people have been experiencing on Yelp. I came here for the first time during dinner and had their 14 oz steak. Was incredibly delicious and the price was just right around $14. My girlfriend had the Spaghetti and Meatballs. She loved it so much we actually came back a second time to dine here. I couldn't believe how attentive the waiters were during dinner. They must have came by like 5 times to check on us. Bonus points for the waiters. \n\nI believe we dined here 4 times during the course of our stay at New York New York. Twice for breakfast, once for lunch and dinner. The second time around I wasn't too impressed with the Philly Cheesesteak special. The bread felt very soggy and that ruined the taste.\n\nFor Breakfast, I had the New York State of Mind which is your traditional bacon, eggs, white toast with a side of fries. Their bacon strips are huge and I absolutely loved it. However they charged $5 for Orange Juice which I was not very pleased to see when the bill arrived. Very very overpriced for Orange Juice. Shame on you, 1 star off for trying to gouge the customer.\n\nModerately priced for all the other items on the menu and I would recommend giving this place a shot if you are looking for something traditional that you would find at most American diners like Dennys or IHOP."
        }, 
        {
            "index": 37, 
            "rating": 1, 
            "review": "WORST food I've had in a long time!! I would have never known about this place had it not been for a birthday dinner party for friends staying at NYNY. My friend and I split 2 meals, 4 cheese pizza and rueben wrap. The pizza was HORRIBLE! The worst pizza I've ever had, including frozen microwaveable pizzas and that's exactly what it was like. I could tell just by the look of it that it was not going to be good but then I took a bite. Cold, chewy spongy soft dough, the only thing fresh on the pizza was the parsley. I'm not exaggerating it was the worst meal, I'd rather have a happy meal at McDonalds! The Rueben wrap wasn't much better, rubbery fatty meat, smothered in sauce. It was bad but not as bad as the pizza. Save yourself the money and and frustration and don't eat here!"
        }, 
        {
            "index": 38, 
            "rating": 5, 
            "review": "THE GOOD: Perfect for the price! All the american favorites are on the menu. I liked that the environment, food, and service were a step above the average cafe. Not too snooty but not at all divey.  My steak was cooked perfectly and the rest of the food was amazing for a 3:00 am meal. The decor is wonderful and keeps the eyes entertained during the entire visit. The doughnut bar is wonderful and has excellent selections. They stay open 24 hours but the food taste much better than any 24 hour place I've been. Not to mention that in Vegas 24 hour spots are required knowledge. I've been twice and in both experiences the waitresses were excellent and patient.  Bonus:This cafe serves alcohol!\n\nTHE BAD: American food can be found a little cheaper elsewhere.  It's in a Hotel Casino and that may not suit all families. This also means you can't park out front so you'll have to walk from the hotel parking structure waaaay out back. They allow smoking indoors in Las Vegas. (I guess for some that could be good or bad).\n\nALL IN ALL:  I rated this place with 5 stars because to me it is the ultimate cafe in Vegas. It is above cafe scale in its entirety including the 24 hour service, on strip location, great hotel, great service, and great tasting food. I consider it a MUST for the Vegas traveler."
        }, 
        {
            "index": 39, 
            "rating": 5, 
            "review": "24 hour good shit.\n\nRib-eye...at 3am...and the shit ain't expensive. Plus there is some giant mock-up of....guess...AMERICA up in there. Sit at the bar and random people may start talking to you, as well as possible prostitutes. I was in there once and two prostitutes were having a crazy ass argument and then one said \"Do you know what you pu**y smells like?\" and I'm over here trying to eat a tasty assed omelette...AND I'M NOT EVEN MAKING THIS UP! Staff is super friendly, customers are friendly as well and kinda cute for a late night eatery. If you're at the south end of the strip roll up in there and get you some good stuff."
        }, 
        {
            "index": 40, 
            "rating": 4, 
            "review": "Like a few of the other Yelpers,  I was surprised this restaurant did not have higher ratings.  I noticed many of the unhappy Yelpers  complained about the breakfast service and food, so that may be why our experience was much better since we went during dinner on a weekday night.  Our server was Tha and he was very professional and made sure we were taken care of.  They had a kids menu complete with crayons which made our son very happy.  He brought out juice in a kids cup also which was a plus since we were inside a casino and have not found many places that catered to children during this trip.  The large 2-D map on the ceiling captured his interest for a long while too.  We ordered the kids cheeseburger and fries for our son, which came on a wheat bun and served with potato wedges.  The bf ordered a patty melt and fries.  I had the catch of the day, very fresh grilled salmon in a chili glaze with seasoned rice and fresh sauteed vegetables.  I was hungry and the portion was a bit small, so a cup of soup or salad included probably would have satisfied me.  The cousins ordered nachos and the steak and crab leg special which they did enjoy.  We were able to catch up with each other for over 2 hours without feeling rushed.  This is one of the few places we will return to when wanting to eat at a restaurant inside any casino.  The food is decently priced, fresh, and tastes decent.  When we used our comp to pay for our bill, Tha never bristled like a few of the servers at the other places did.  Since he provided excellent service, he received a large tip.  That is what servers need to realize, even though the meal is comped, if you provide good service, most people will still tip you, and leave much more than usual since they did not have to pay for the meal.  I used to be a server so I know this for a fact!  It is all about the attitude and service next to the food."
        }, 
        {
            "index": 41, 
            "rating": 3, 
            "review": "Has the pancakes and turkey sausage. Had to pay extra for blueberries though. Taste was fair. Service was a little slow but I'm satisfied."
        }, 
        {
            "index": 42, 
            "rating": 5, 
            "review": "Finally had my first Cronut!!!!! OMG YUM!!!!! Thank you America for these lovely pastries! We tried the original and the lemon and they were both delicious. And they better be for $3.50 a Cronut. I will most def be coming back for more."
        }, 
        {
            "index": 43, 
            "rating": 3, 
            "review": "I would never have thought of dining here unless I had to. In a recent scenario, I had to. Not that there is anything wrong with eating here at the America inside New York New York, but being in Vegas, there are so much other better dining experiences you can't get in your hometown. So why waste it on simple diner food? If I was a local then this would probably be a good place to just relax and dine at.\n\nBut if you have no choice, don't worry. I had the Prime Burger, which is a Half pound ground prime rib, Swiss cheese, red onion marmalade, demi glace and horseradish aïoli served with french fries. Everything tasted great and I had really no complaints. \n\nThe place is huge, but never got crowded. They have a cool map of the United States hanging above. It's like a 3D in your face map, so something cool to look at, or entertain your kids with as this would be a great place to dine with your family.\n\nThe menu is not overwhelming. There are times you hope the menu has so much stuff it overwhelms, then we complain. Then when it doesn't you have that feeling to still complain and wonder, \"thats it?\" There are plenty of selections, from salads, to soups, sandwhiches, entrees, etc. **YELP TIP** CHECK OUT THEIR WEBSITE FOR THE MENUS\n\nThere is a nice simple bar within the restaurant entrance if you want to get your drank on without being in a crowded place. It's INSIDE the NY NY, so you do have to go through the casino, but it is simple to find. \n\nWould I eat here again? Sure! However, would I actually go here again? Only if I had to.\n\nBTW, Great staff. Very friendly and not robotic in personality.\n\nOPEN 24HRS"
        }, 
        {
            "index": 44, 
            "rating": 1, 
            "review": "This was the worst restaurant I've eaten at in Vegas. The food was cold. We ordered potato skins that cost $9 and they brought out a plate with 4 of the smallest potatoes I've ever seen and up could tell they were pre-made and frozen because they were still cold on the inside. We will definitely not be eating here again. It was way to overpriced for the quality of food."
        }, 
        {
            "index": 45, 
            "rating": 2, 
            "review": "Bloody Marys: Amazing. Vegas is a city that knows how to do the Bloody Mary right. America was no exception and they spiced the glass rims for an extra kick. \n\nSteak and eggs: Decent. Then again, it's my go-to for hangover breakfasts (actually, all breakfasts) and the Bloody Mary stole the show, so I didn't pay too much attention to it. \n\nService: Sigi was our server. You know, I was, incidentally, at the same table as fellow reviewer Richard C. over here (we're crew - what's up punkass!) and I agree: Sigi was top-notch. Her hustle deserves a better forum in a better establishment. \n\nIan did indeed get six fries. It was embarrassing for everyone and I felt bad for the dude. And overall, the food was sub-par and America brought out the weirdness in everybody: Jeff - who is 6'5, was hungover and routinely eats like a garbage disposal - couldn't take more than a bite of his veggie sandwich. The bathroom was outside in the casino and it was weird with eight of us shuffling in and out of America for fifteen minutes at a time. The kitchen took too long to bring out our food. Even I grew a beard along with the rest of the man convention just sitting around waiting for our slop. \n\nAlso, I dropped a Benny on black at the roulette table afterward, and it went down the drain. I think it was because of America. Bad mojo."
        }, 
        {
            "index": 46, 
            "rating": 3, 
            "review": "Good for a very late night snack.  \n\nFood: 7/10 - For the late night menu it is good food.  Cooked properly.  Nothing to right home about but it get's the job done.  Eggs were cooked properly and the have some nice late night speicals.\n\nService: 6.5 / 10 - Service is friendly but slow late at night.  The place has a quiet feel to it late at night.  The server can disappear for 5-10 minutes at a clip.  If you need something you're kinda hosed waiting.  \n\nCleanliness: 8/10 - No visible problems here.\n\nParking: 5/10 - Parking is the lot for the New York, New York hotel.\n\nRestrooms: N/A - Didn't visit.\n\nOverall: 6.5 /10 - A safe bet for a basic meal.  If you are looking for a fine dining experience, this isn't the place to go.  Think \"diner\""
        }, 
        {
            "index": 47, 
            "rating": 2, 
            "review": "The star of the show was definitely the service! We had the best waiter and server! Travis was awesome! The food was mediocre, our Breakfast Burrito didn't have chorizo as stated in the description but was still ok. The Grown Up Grilled Cheese can be skipped completely as it is a greasy hot mess. The Sriracha Shrimp was basically tempura shrimp sprinkled with drops of Sriracha and marked up. The drinks were good, those were the only thing we did finish. Definitely not a place to return and not worth the almost $60+tip we spent on our meal."
        }, 
        {
            "index": 48, 
            "rating": 5, 
            "review": "With all the terrible reviews I read as I got seated it almost made me change my mind but the serviced I received from Manny was great! My water never got empty and always checked up on us. Thank you"
        }, 
        {
            "index": 49, 
            "rating": 3, 
            "review": "I debated on only 2 stars, but there are some redeaming qualities here.  Whether you like this place or not probably depends on what you order.  My wife got the dinner special which is an 8 oz. steak with 1/2 pound of crab legs, potato, veggies and a salad for $15.  Great value.  My wife liked her steak a lot and the crab legs were OK.  I got the vegetarian club which was not  that great but the fries were very good.  I got the mac and cheese before and I remember it being OK. \n\nThis place isn't expensive, but If you not getting the special then I can't really say its great value.  I can get a great vegi sandwich at the Cheesecake factory for a buck fifty more, plus this place charged $3.75 for crappy iced tea.\n\nThe only reason I gave this place 3 stars and not 2 was the good service.  My server was Neverly and he was very nice.  The hostess was very nice too.  The only reason I can see coming here is if you want the special or you are looking for a table service place where you don't have to wait.  I suppose it's a good place for kids too.  I actually wanted to eat at Nine Fine Irishmen but there was a 30 min. wait for two on a Tuesday."
        }, 
        {
            "index": 50, 
            "rating": 5, 
            "review": "A nice way to opt out of the over-the-top buffet frenzy and crowds in Vegas. \n\nEven when I've stayed at the Bellagio, I've walked to this place to grab a good old New York steak & eggs for breakfast ($14.95). It never disappoints - straight up just simple but consistently good. The lil blueberry muffin is an added token - spoiler alert: it has apple filling inside that lil thing. \n\nCoffee is a carafe - so, not the hottest.\n\nI ask for salsa to tame them bunch of hash browns and and picante kick to eggs~\n\nOJ seems fresh squeezed.\n\nLots of families with early teen kids. Very nice family ambience.\n\nChristmas music in background and Christmas decorations were added touch for the holidays - today is Xmas eve - and first day of Chanukah - and the place is busy but not crowded at all.\n\nNo particular discounts for M Life members (MGM Resorts loyalty program) but you can use your player's points if you have any. Also, you can charge the meal to your room at the Excalibur, even though America is located at NY NY, just a brisk walk across the bridge from the Excalibur\n\nFree NY NY wi-fi.\n\nFriendly service~"
        }, 
        {
            "index": 51, 
            "rating": 5, 
            "review": "We stopped in here for lunch on a Monday while in Vegas. They have daily lunch specials. I ordered the spaghetti and meatballs for $9.99. The meatballs were SO good, they were stuffed with cheese, and the pasta sauce was super light which is how I like my pasta sauce. My boyfriend built his own pizza and he said it was really good. Our server (can't remember her name) was great and the service overall was great. Would definitely come back and recommend! \n\nAlso, the donuts in the bakery in the front by the host stand look AMAZING but unfortunately we were full and did not try them."
        }, 
        {
            "index": 52, 
            "rating": 1, 
            "review": "I am not to sure how to begin on rating this place...I was not super excited about eating here in the first place but only agreed to because my daughters whole cheer team already planned a team dinner here. The first experience started off with saying they could only split up 4 different checks? We had 40 people with 13 different families? But oh well we decided to figure it out..the key here this place was dead as a door nail and not making an exception to this was totally ridiculous. \n\nWell we decided to jump into the ordering process which was another nightmare...which again for a totally dead restaurant why would you leave 1 waiter to help out such a huge party leaves a big question on who is managing this place? I can't put all the blame on our server because he really was trying to hustle his butt off but I think the lack of sheer disorganization lead to the ultimate melt down.\n\nHere we go food not coming out with everyone else's food...cold food...my wife's food never got ordered...mix ups with food...the mediocre food at best...then ultimate melt down; paying the bill. This literally took 30+ mins to get figured all because they couldn't put families groups together. In my opinion they brought this pain upon themselves and probably the reason why this restaurant had no customers in it...this was a once and done for me based on customer service, selection , and quality all the way around."
        }, 
        {
            "index": 53, 
            "rating": 3, 
            "review": "Giving this place 3 stars for ambiance, food was ok, service was slooooooooow. The place was almost empty and it took forever for the food to get to us, when it did eggs were hard on top from sitting out. The croissant donut was very good too. Other than that, I wouldn't go out of my way to come back here."
        }, 
        {
            "index": 54, 
            "rating": 3, 
            "review": "Great place for late night food when at NYNY.   Breakfast items and burgers are better than expected for a casino casual diner."
        }, 
        {
            "index": 55, 
            "rating": 3, 
            "review": "This is the greatest breakfast joint you'll ever eat at, but it is certainly one of the most convenient. At least if you are staying at New York New York. My boyfriend and I ended up eating here twice during our stay because it was right down the stairs from our room.\n\nOn our first visit, we ordered the BLT (applewood smoked bacon, lettuce and\ntomato on sourdough bread) and Corned Beef Hash & Eggs (slow cooked corned beef and shredded potatoes with onions and peppers, served with two eggs any style). Both were ok. The BLT was better than the corned beef. The corned beef was actually pretty bland, which was surprising because usually that type of dish is quite salty. On our second visit, we got the Breakfast Burrito (farm fresh eggs, black forest ham, bacon with chorizo sausage and pepper jack cheese, wrapped in a warm flour tortilla) and the King Club (roasted turkey breast, applewood smoked bacon, romaine lettuce and tomatoes on toasted sourdough). These two were a lot better than our first visit. They were good, but nothing too special about them.\n\nThe true stars of this place are the donuts. They are huge, sweet, and decadent. I mean, what isn't to love about a nice fresh donut? We got the Strawberry Shortcake (frosted strawberry icing with a vanilla & strawberry filling) and the Boston Cream (chocolate frosting and custard cream filling). I am usually not a fan of filled donuts, but these were so delicious.\n\nThe service was a little slow, but totally understandable because it was during the breakfast rush, but overall a pretty decent experience. I would go here again if I was staying in New York New York again."
        }, 
        {
            "index": 56, 
            "rating": 2, 
            "review": "It's kinda hard to find good 24 hour places in Vegas, as shocking as that is. Yet, America is not terrible. In Vegas terms it's more like a 2.5 but I just wasn't completely thrilled. The wait staff was nice but the food was meh. I ordered mashed potatoes with gravy and did not feel so hot afterwards. My friends' food was ok...the chicken wings were the standout among them. But hey, beats my last Vegas trip where I was too tired to go anywhere else for food in the wee hours than McDonald's. If you're on this end of The Strip, I'd say this is a solid late night option. During normal hours though...I wouldn't chance it."
        }, 
        {
            "index": 57, 
            "rating": 1, 
            "review": "My first (and I hope only) 1 star review. As  a New Yorker, I am offended. I have never tasted worse diner food and at real restaurant prices! And, on top of that, the service is horrible. My boyfriend and I were one of only two tables filled and yet they still didn't have time to come over and take our orders, bring us our drinks, and get our orders correct. Never again."
        }, 
        {
            "index": 58, 
            "rating": 1, 
            "review": "Oh God I forgot I ever dined here but I guess I just blocked it out. I came here with a group of 12 people. One thing in general about Vegas is that dining in large groups just screws everything up and I really feel that the service since they add gratuity automatically they feel they can just shut down quality service automatically. It took at least 20 minutes to get a seat on a fairly slow 11 am on a Monday. When we were finally seated we waited another 30 just to get our orders in. I understand that restaurants want to get the food out all at once. But, I really feel that if the food is done they should starting bringing it out. My whole crew ordered breakfast except me who ordered a club sandwich. The food no joke took almost an hour to come out and mine must of been finished first because the fries were ice cold and sandwich was soggy all the way through the bread. When it was time to pay we were not allowed to split up the check any less than 2 ways. The whole fiasco took over 2 hours and wasted a good chunk of the day for a group of my friends that were leaving that day. Never again and stay away."
        }, 
        {
            "index": 59, 
            "rating": 1, 
            "review": "Ack... really really not impressed. It was about 9pm on Friday night. The restaurant was only 1/3 full. We had to wait like 20mins for them to put 4 tables together for our group of 9. \n\nFinally got seated and took another 10mins before was had to flag down our waiter for water. Then had to flag him down again to take our order. Then another good 30 mins to get our food, which was a turkey club, 4 burgers, a fettucini alfredo, pepparoni pizza, and 2 chili cheese fries. \n\nNow I'm not usually a stickler about service and stuff... but considering the place was only 1/3 full, and we were the only table that was recently seated in the last 30 mins, I was surprised at how slow things were.\n\nAfter all the waiting, we were still underwhelmed by the food. The local Denny's is better then this place, and (depending on which Denny's) faster. The only thing that was on the good side was the chili cheese fries, but for me, it was still only so-so b/c I'm not the biggest fan of wedge fries, which is what they used. But it was decent since it was smothered with chili and you were weren't left with 1/2 a plate of plain fries and no chili in the end. \n\nI'd say pass unless there's nothing else. Maybe the breakfast food is better?"
        }, 
        {
            "index": 60, 
            "rating": 2, 
            "review": "The food was totally forgettable. The giant map of America in the main restaurant was the most interesting thing in the whole place."
        }, 
        {
            "index": 61, 
            "rating": 3, 
            "review": "Went here after a night out and the food was typical diner plates.  This was fine.  I enjoyed what I had: chocolate chip pancakes and a fruit plate.  I was irritated that their brunch menu was so limited.  What if I wanted waffles or french toast.  There were maybe 8 selections and not at all accommodating to someone who doesn't eat eggs or meat.  The ambiance was nice, the crowd was limited at the time I dined here and the waiter was attentive.  Overall, a decent place to catch a oversize meal after a night of drinking."
        }, 
        {
            "index": 62, 
            "rating": 4, 
            "review": "I was hanging out with some friends in town at New York New York, got a lil hungry from all the money we were losing :(\nTravis was our waiter....OMG he was so super sweet!  I ordered a burger w swiss, sautéed onions and bacon....YUMMMMMMM BACCOONN!  Nickie ordered the sirloin special for $14.99 which included a baked potato and veggies.  Bob ordered the grown up grilled cheese and a chicken Caesar salad.  \nEverything was sooo good with the exception that my bottom bun of the burger got soggy....oh well.  Id definitely recommend this place for sure if in NY NY!\nThey are open 24 hours, have pics of \"America\" all over the walls and have a cool piece of artwork of the US.  The food has a range of Italian and American!"
        }, 
        {
            "index": 63, 
            "rating": 4, 
            "review": "I was pleasantly surprised by America.  We were staying at NYNY and were out at the pool all day.  Someone ordered a quesadilla, which they get from America, and it was pretty darn good.  So we went for a little snack.  I just had a chicken salad, and it wasn't bad at all for a quick bite.  I can't remember what the husband ordered, but be enjoyed his food as well.  Then we had the cheesecake.  I'm not a dessert person, but it was delicious!    It's open 24 hours so we returned later for a club sandwich.  America will not blow your socks off, but it's dependable & the service is good."
        }, 
        {
            "index": 64, 
            "rating": 1, 
            "review": "This place went downhill FAST in the past 12 months.  I wish I would have read recent YELP! reviews prior to going.  \n\nHad this been a review for last year, it would have been 5 stars.  We went here last year for St. Patty's Day - they have a great menu of roasted potato soup, corn beef/cabbage/carrot/potato and creme brulee for dessert.  LAST YEAR we were served Guinness with green sugar rimmed glasses and the bartender gave us green beer (although they supposedly weren't allowed due to a mess on the bar the previous year).  Our waiter was GREAT!\n\nJump ahead exactly 12 months.  We returned for a repeat of the great time we had in 2010, however, we were met with HORRIBLE service and a bartender who REFUSED to add sugar to our Guinness!!  REFUSED!  I have NEVER been refused something so simple, plus they set precedence for it the previous year.  MARY was the bartender and BONNIE was our server - UGH!  NEVER AGAIN!  I even showed Bonnie a photo of my beer on my phone with the \"America\" napkin under it.  She really didn't care.  She also only checked on us once the entire 2 hours we were there, and we had to hunt down people to get us refills on drinks, and pay our bill.  The table next to ours agreed with the bad service when they had to yell for someone to take their bill, too.\n\nThe food was okay, the presentation of the corned beef/cabbage was much nicer last year.  And the dessert was blah.\n\nWe will be finding ourselves a new place to enjoy St. Patty's day and spend our money next year.  NYNY can kiss my Irish bootie!"
        }, 
        {
            "index": 65, 
            "rating": 5, 
            "review": "\"Good food, spacious restaurant\" I had the Shrimp Pasta and it was delicious! \"Chef Hernan really knows how to make some mean pasta!\""
        }, 
        {
            "index": 66, 
            "rating": 5, 
            "review": "This was the first place we ate at upon arriving at the hotel.  We were hungry and felt that the food was good.  The waitress was great and service was awesome. \nWe stopped in for breakfast the next day and also got great service.  All the waiters and waitresses seemed very nice.  We had no complaints at all and the place is open 24/7 so that is always a plus."
        }, 
        {
            "index": 67, 
            "rating": 4, 
            "review": "This was my second visit. I first visited a couple of weeks ago with my family for brunch. The breakfast was really good, but the service was a little slow. On my second visit, it was New Year's weekend and we decided to stop in for dinner while staying at New York New York. The place was pretty empty and we were seated promptly. Our waiter was extremely professional and very warm and friendly. He promptly brought our drinks and then took our order. The service was excellent and prompt. The food was brought out and we weren't disappointed. The portions are good sized. The food is American cuisine so nothing special on the menu, but the food is good. The service was above average and because of this, we will probably come back. From experience, we will most likely visit again when it is not so busy so that we can enjoy the great service. Three stars for the food. Four stars for the service. This place is a solid 3.5 stars."
        }, 
        {
            "index": 68, 
            "rating": 3, 
            "review": "We stayed at the New York-New York this last weekend for 2 nights.   Both nights we ended up seeking refuge at the America Diner at some ungodly hour, much like old travelers of yore would seek refuge at a Tavern to escape the icy snowstorm howling outside.   Except in our case it wasn't howling but it was the incessant sound of clinging coins, and it wasn't a snowstorm but utter mayhem on the Casino floor.   Lastly, it wasn't icy but it was an inconceivable amount of cheap booze that would leave us clutching ourselves in agony the next morning.  While the food pretty much sucked at America, I'm still pretty fucking glad the place was still open at 3 AM on Sunday morning.\n\nWhile my wife ordered the steak the first night, she opted for the pancakes the second night.   I went with the Macaroni & Cheese and a Spicy Chicken Sandwich the first night and the Macaroni & Cheese and Potato Skins the second night.    (Hey! Nothing like simple carbs to absorb an insane amount of alcohol lounging about in your stomach)\n\nThe first night, the Mac & Cheese tasted very much like I what I imagine a Salt Lick tastes like.   The Spicy Chicken Sandwich was anything but.  I'm guessing they ran out of Buffalo sauce and they figured I was too drunk to give a fuck.   While it's true I was too drunk to start an argument then & there, I knew I'd get these fuckers on Yelp sooner or later.    The Mac & Cheese the 2nd night was legit... not great but certainly better than the first night since I could actually glimpse the taste of cheese that time around.   My wife said the steak was completely fucked up and she's still having painful bowel movements some 48 hours later.   The pancakes were good, but then again how does one really fuck up pancakes now, right?\n\nIf this was the Bay Area, I'd probably give this place 1 star or 2 at the very most.   Seeing as they're open 24 hours a day though, I'm being generous and giving them 3 stars.   Besides, as drunk as we were, it's fascinating to realize that you're the most composed couple at 3 AM in here.   I feel bad for the waiters and waitresses here... They gotta deal with some seriously fucked up shit every day."
        }, 
        {
            "index": 69, 
            "rating": 3, 
            "review": "We stayed at the NY NY and just decided to eat here one night. There was no wait and it was near our rooms. It took awhile to get someone to notice us and take our order but after that everything was fine. I was feeling sick so I got some chicken noodle soup and it was actually really good! The bread they give you was nice & hot! I'm a bread fan so I enjoyed it. Got chicken tenders which were really good. Boyfriend stuffed rigatoni with a bolognese sauce - which he thought was just ok. \n\nThis place was okay - definitely not my favorite but not bad either.\n\nPretty sure the room service menu at NY NY is from this place as well."
        }, 
        {
            "index": 70, 
            "rating": 3, 
            "review": "We came here for a late breakfast. I loved how they have a breakfast menu all day. We ordered the Belgian waffle with strawberries, maple syrup, and whipped cream (all on the side). They give coffee with your own pitcher so you can refill on as much coffee you'd like. My husband is vegetarian so he ordered two eggs scrambled with hash browns, jalapeños, and pepper jack cheese. He asked for it to be extra crispy but it ended up being still soft. Regardless it was still pretty good. The eggs however were not. It did not taste like real eggs to us. He also got a tall glass of chocolate milk which made it up to my Hubby. They do let you order donuts to your table but I did not see a menu for that at the seats. We were too full to get one but there is always next time. \nThe ambience is great for large groups, families (the kids will love the huge 3D artwork of America), and for couples as well. There is also a bar seating with TVs if you'd like to watch news or sports."
        }, 
        {
            "index": 71, 
            "rating": 2, 
            "review": "For a midday snack, you're probably better off at a fast food joint in the food court area of NYNY.  Appetizers to hold one over before dinner were just awful.  Calamari, salad, even a baby order of ribs:  served lukewarm/cold and just plain bad.  It's really difficult to imagine any of the entrees here as redeeming.\n\nEarns extra star just for the interior styling -- the wall and the ceiling map are nice touches."
        }, 
        {
            "index": 72, 
            "rating": 3, 
            "review": "MERICA!\n\nAmerica is a cafe within the New York, New York hotel. This was the final stop after a night of gaming, dancing, and drinking. Oh yes, drinking. We stumbled in to get some food in our stomachs before the ride home. The waiter wasn't too surprised with our state. Some heads on the table while others were running back and forth from the bathroom. He brought us all out some water and well as the Mt. Dew I ordered. We took some time viewing the menu and had him come back a few times. I ordered the chipotle chicken wrap, I was drunk but still trying to be healthy. My super drunk friend decided to order the fettuccine alfredo. I felt like that was a really bad decision but we boxed and she had it the next day. Apparently it was good. My wrap was pretty good but it had a lot of lettuce. Pulled some of it out.. and put some pepper in that baby boy and we were good to go. It also came with potato wedges which were awesome!! I was excited because i didn't realize they came with that. Over all it was a mediocre cafe experience and it might not even be as good if i went sober."
        }, 
        {
            "index": 73, 
            "rating": 4, 
            "review": "This place is easy on the wallet and serves decent food when compared to most Las Vegas venues. The servers seem to be on the ball as well.\n\nI had a Western Omlette that was ok and a Cheesburger and nachos that were ok during my two visits.\n\nI will definately head back here if in the area during my next Las Vegas visit."
        }, 
        {
            "index": 74, 
            "rating": 3, 
            "review": "A decent joint for typical American food.  Good service.  Not awesome, but a good spot if you're craving food and in the neighborhood."
        }, 
        {
            "index": 75, 
            "rating": 3, 
            "review": "Better places for breakfast. Hash was not crispy and awash in grease. Atmosphere was fun with a giant map of the USA hanging from the ceiling."
        }, 
        {
            "index": 76, 
            "rating": 2, 
            "review": "This is not one of the better simple breakfast cafes in Vegas. Although the decorations inside are cute (huge USA map, etc.), it still has an odd feel to it inside. Not sure what it was - guess I thought that this place should have more people inside - especially considering every other place in Vegas is so packed.  \n\nThe service was friendly, but the food was just lacking. I say skip it and eat your breakfast elsewhere."
        }, 
        {
            "index": 77, 
            "rating": 1, 
            "review": "Vraiment horrible, mes pâtes étaient trop cuites, mon poulet caoutchouteux, à éviter... Et sans parler du service."
        }, 
        {
            "index": 78, 
            "rating": 1, 
            "review": "This is a great restaurant if you want \"ok\" food and you are willing to wait an hour after you place your order.   The map is cool....sort of. Stop in and take a photo then go eat somewhere else."
        }, 
        {
            "index": 79, 
            "rating": 5, 
            "review": "Food and service is always great every time me and my boyfriend have came here. Pancakes are delicious!"
        }, 
        {
            "index": 80, 
            "rating": 3, 
            "review": "First, I did not want to come here.  I'm very adventurous with my food choices, but the group I was with is not.  They are very basic with their food choices.  That being said; America is a safe choice when trying to accommodate several people.  We were here about 9pm on a Friday night, and it was a ghost town.  Seriously, a Friday night on the Strip, and there were only two other groups of people.  The service was slow.  Ridiculously slow.  The waitress so very nice and attentive so it was not her fault it took an extremely long time for our food.  I'm not sure what was going on it that kitchen.  Maybe the waitress was actually cooking also. Who knows?   For an appetizer we had the ahi tuna and watermelon, and I had fish and chips for my dinner.  Very basic dishes.  Nothing outstanding or beyond my expectations.  But the Canyon Rose cocktail I had was awesome as was the Kamikaze shot.  Waitress: great, Food: average, Speed of Delivery: horrible.  I will not return because they are many other restaurants on my list."
        }, 
        {
            "index": 81, 
            "rating": 4, 
            "review": "We hit here late after seeing a show. The prices are very reasonable for the strip. I had a trio of sliders. The burger was excellent, pulled pork was tender but a little sweet, fish taco was decent but fish didn't taste real fresh. My husband really liked the chicken wrap. With two beers it came to just $40.\n\nService was quick and very friendly. The one negative was they did not have their cronuts available at the late hour."
        }, 
        {
            "index": 82, 
            "rating": 3, 
            "review": "Was raining our first day in Vegas, who knew, so we did monorail and hopped from casino to casino.  Ended up at the New York New York around 3 and were hungry so decided to give this a try since we hadn't eaten here before.\n\nHigh ceilings, separate bar area with TVs where you can watch sports and a cool huge 3D map of the US on the wall.  Sort of fun to  look at while waiting.\n\nSince there were just a few folks eating at that time, service was pretty quick so I can't speak to what it is when there is a crowd.  Server was very pleasant although once our order was taken and we got our food, never saw the person again so if there had been a problem, too bad.\n\nHubby had a king club, he said it was good, not wonderful.  I had a stir fry chicken salad.  It tasted good but was the oddest salad.  I think the lettuce must have walked by the dish and a few leaves jumped in because it was primarily cold noodles, shrimp, the menu said there were veggies in it, couldn't find any and topped with fried rice noodles.  The dressing was a sesame vinaigrette which was pretty good.  \n\nThink probably the better choice for eating is breakfast.  That menu looked better."
        }, 
        {
            "index": 83, 
            "rating": 2, 
            "review": "The huge map of the U.S. is the best thing about this restaurant. The coffee is terrible & the food is outrageously over-priced - although, it is a casino restaurant so I shouldn't expect better. I ordered french toast (which was almost $10, just for two slices of french toast - no eggs, no bacon, no other food included) and it was absolutely terrible.  It was basically bread smothered in cinnamon.  If this meal wasn't being comped by the casino, I would have been very upset.  \n\nThe only upside about this restaurant is the service.  Our waitress was very nice & she is the only reason this place is getting two stars.  The price just isn't worth it.  We ended up paying $30 for two to eat breakfast (which was part of a $50 meal voucher we received from the casino for staying in the hotel) and then had to eat again afterwards because the food was so terrible.  Walk the 10 minutes to Denny's."
        }, 
        {
            "index": 84, 
            "rating": 1, 
            "review": "I literally was nauseous from the smell of my turkey burger w cheese. I just ate my fries..... Then threw up..... Also they said it comes with pickle spear...just slices...I love pickle spear"
        }, 
        {
            "index": 85, 
            "rating": 2, 
            "review": "The service was curt, the food was basically Denny's quality, the prices were double what they should have been. The map was fun to look at, but I won't be back."
        }, 
        {
            "index": 86, 
            "rating": 2, 
            "review": "My family and I were starving and there weren't that much restaurants opened at around 12am. This place looks so comfy, nice, clean, and looks like they have good food, but....\n\nThe service was horrible, we waited for around 15 minutes just to order our food. The waiters were lazy like they don't feel happy serving us. It was really terrible. The worst case scenario was that It took around 1 hour for us to wait for the food.\n\nI will definitely NOT come back to this place. Nice huge map on the ceiling though."
        }, 
        {
            "index": 87, 
            "rating": 2, 
            "review": "We were seated quick, the hostess was very polite, as well as our waitress. The place was not full, and we waited for our food for at least 30 min, we were about to walk out. Food wise my son didn't like the mac and cheese, it needed more flavor, other orders were a-okay."
        }, 
        {
            "index": 88, 
            "rating": 2, 
            "review": "Our last night in Vegas, out group of 10 needed to kill time before our red-eye flight so since we were already in New York New York gambling we decided to eat here (located right by the casino). The restaurant is huge and there is a giant map of the US on the ceiling with all of the famous things about each state.\n\nI got the salon entree with the spicy BBQ sauce on the side (I do not like BBQ sauce) and I gave that sauce to the boys which they loved and used it on their hash brown and steaks. The salmon was small and not the best tasting but the veggies that came with my plate was excellent! I even substitute my mashed potato's for them but the waitress forgot then realized it and brought me a side of veggies. The bf got the spaghetti and he didn't like it and had better. For both our entrees it cost us about $36...kind of pricey for okay food. Everyone else thought their food was okay but they did say that the jambalaya was spicy and delicious."
        }, 
        {
            "index": 89, 
            "rating": 5, 
            "review": "server : Denise\n\nDenise was extremely nice!!! If anyone from this restaurant every looks at these reviews please give Denise some appreciation because she was so nice to us and we most def enjoyed her!!! \n\nWe had a very long day and we wanted to eat before we took our road trip back to San Diego. We stopped by this place cause a friend discovered this place a couple of nights back. It wasn't too far from our hotel,Excalibur.\n\nThe only problem I had was with the host. They didn't seem approachable and I felt as if we ruined their day when we walked in.. So that was my only downfall for this place... \n\nFood was so good! Lots and Lots of comfort food! I love the macaroni and cheese! Their chicken fried steak was good but nothing out of the ordinary. Prices are reasonable..What do you expect though, its Vegas. Lol :)  \n\nWill most def come back again on my next vegas trip! :)"
        }, 
        {
            "index": 90, 
            "rating": 1, 
            "review": "I ordered a good 30mins ago and that was the last time I also saw my server. There are a lot of empty tables. \n\nRamon is our server. I'm not sure where he went. I'm thirsty but I'm more hungry. Another stops by and says our food will be out soon. Ramon, where are you?!\n\nRamon came with the food! I should have went to another place. The only thing that was sub-par was the fries. The food is just bland or maybe I drank too much from last night and my taste buds are gone....nope, the food is blah.\n\nJust order drinks...while playing the slots so you only tip."
        }, 
        {
            "index": 91, 
            "rating": 1, 
            "review": "Came to the restaurant by 8:00 pm., waited for the server for 7-10 minutes even thou restaurant had 4-6 tables occupied. Waitress by name Rowena came to take the order. I am not sure if it was language issue with her or it was late in the evening, but whatever we ordered, she mixed up a few time and we had to correct her order. Regarding drinks from the bar... it was the worst experience ever. Bartender did not know the names of the drinks and when I found recipe on Internet, he refused to make it. For suggestion on a mixed drink bartender turned way and finally when I asked for a strawberry margarita, he made a plane Daiquiri drink. When I told the waitress about it, she got mad at me. I got upset that service is awful. Bottom line the evening was ruined. If you wish to be in my shoes lol visit this place."
        }, 
        {
            "index": 92, 
            "rating": 5, 
            "review": "Breakfast was great! Had the chicken fried steak. Gravy was good. Highly recommended."
        }, 
        {
            "index": 93, 
            "rating": 2, 
            "review": "The food was good.\n\nFood delivery was extreamly slow.\n\nOur server was good.  But between our order and the delivery of our food we could have lost a grand inside the casino.\n\nThe food was good. But it is not worth the wait.\n\nPS: The restaurant was not busy at all."
        }, 
        {
            "index": 94, 
            "rating": 3, 
            "review": "Updating, since \"America\" went above and beyond to resolve my customer service issue of not receiving the 10 percent locals discount, I am happy to revise my rating.\nAlways good to see a business respond so positively regarding customer satisfaction."
        }, 
        {
            "index": 95, 
            "rating": 3, 
            "review": "Great place to have breakfast if you happen to sleep in from a night of partying!\n\nThis place is located in New York New York Casino.  The restaurant boost American food fare and the decor of the place reflects that and there are plenty of seating.\n\nWe both ordered the Chicken Fried Steak and Eggs.  Originally we were gonna order all you can eat pancakes but we missed it (last serving was at 11:30 am for the AYCE pancakes @ $7.95).\n\nOur food took awhile to be served but it was okay, the place was busy and we were busy admiring the decor of the place.  The food was good but I noticed it was a little overcooked.  Maybe it sat on food warmers before it was served to us because when they served us, they also served the other surrounding tables guests around us.  Maybe they need to hire more waiters and servers.  Now back to my train of thought, the food was overcooked, the hash browns was a little charred.  The scrambled eggs was perfect, nice and fluffy.  The other good thing was the gravy for the chicken fried steak, lots of flavor.   \n\nThe THREE STARS only minus one star for location (had to walk through smoked filled casino to find this place) and overcooking our food.\n\nFood           =    C\nStaff             =    B+\nDecor          =    A\nLocation     =    F"
        }, 
        {
            "index": 96, 
            "rating": 5, 
            "review": "Went after a concert around 2:30 am. Service was great. Wish I could remember his name. Super friendly made sure we had everything we needed multiple times. Went back again the next around the same time and our waitress was just as awesome! Thank you! Oh and the food is really good too!!!"
        }, 
        {
            "index": 97, 
            "rating": 2, 
            "review": "Arrived on the strip just in time on a Monday afternoon for lunch and walked from Mandalay Bay, ending up in New York. We (workmate and I) figured we would give it a try, so we ordered drinks, water, 1 iced tea and 1 beer, and it took a long time to get them. \n\nAfter about 20 minutes we finally got the attention of a passing wait person, who seemed to be a supervisor, and she made it apparent to the wait staff that we were waiting for drinks.  10 minutes later we finally got our drinks, ordered, and waited...waited...I took a picture of the cool huge US map for my Yelp review, and we waited...waited...waited...it must have been about 45 minutes later, finally got our food - two American burgers with fries.\n\nSo, the food was actually very good, and we were really hungry by that point so it went fast. We paid and left.\n\nIt's too bad we waited for so long, or I would have rated it a couple of more stars. I may go back if I need extra time to rest my feet ;)"
        }, 
        {
            "index": 98, 
            "rating": 2, 
            "review": "Food is OK, Service is below average and the music is probably the worst Music that America can produce."
        }, 
        {
            "index": 99, 
            "rating": 1, 
            "review": "The service was really bad. If you don't like working the late shift then don't work the late shift??? \nI requested them to toast the bread on my sandwich and the server said he could not?\nMy fries were overcooked or the fry oil needed to be changed. They were open 24 hours which makes me feel bad for all the other patrons.\nThe design of the place was really nice hence the 1 star."
        }, 
        {
            "index": 100, 
            "rating": 1, 
            "review": "Do not eat here.  The pancakes were old and cold - just run away"
        }, 
        {
            "index": 101, 
            "rating": 5, 
            "review": "Try the Corned Beef hash! Nice little family restaurant inside New York New York. As American as it gets. Kid friendly with a kids menu and plenty of breakfast choices for the adults. Service was great and the food tasted awesome. I had the corned beef hash and it tasted \"homemade.\" Definitely coming back."
        }, 
        {
            "index": 102, 
            "rating": 2, 
            "review": "Probably one of the most horrible places we've been to in Vegas. The only reason we came here was because we all drove 5 hours and were dying of starvation... literally!\n\nFirst off, the service was horrible. The place was vacant and probably had 15-20 customers max, so I thought we were going to be tended to promptly. Nope we were wrong. We had to hail the waitress from across the room after we waited 10 minutes of getting seated. Did I mention we were dying of starvation?\n\nThe food finally came and it kept going down hill from there. Here's a few of the dishes we tried:\n\n-Steak & Crab Legs: The Steak was so tough and gritty, it took my cousin almost 20 minutes to finish her steak. The Crab was still frozen. There were icicles still inside, inedible. \n\n-BBQ Ribs: Not bad, but not that great either. This was probably one of the mediocre dishes we had\n\n-Salads: We ended up getting a few of the salads (Asian Salad?). They were all horrible and had no taste what so ever. \n\n-Turkey Sandwich: How can you go wrong with a sandwich, it wasn't bad.\n\nOver all, this place deserves a 2 star rating entirely. We won't be back here again. I did like the fact that the manager did comp us some donuts , which were horrible also. BLAH!"
        }, 
        {
            "index": 103, 
            "rating": 4, 
            "review": "We learned about the Cronuts (a peculiar mix between a donut and a croissant) while reading a Las Vegas guide so we decided to try one. America is one of the few places serving it and I'm glad we decided to try it there. The Cronut itself was great, but also the bagel was absolutely tasty. Service was polite and friendly and very attentive. The atmosphere is of a huge diner and I love how the place is decorated, with that huge 3D USA map with every state represented by its own symbols."
        }, 
        {
            "index": 104, 
            "rating": 5, 
            "review": "I love to eat here when I'm in town.  They are open 24hours and have always had impeccable service and food.  The prices are reasonable and the restaurant is fairly quiet, with big booths to relax in, away from the hustle and bustle of the casino.  A couple things to try if you stop in here: their omelets and gigantic donuts.  Both are mouth-watering and hit the spot every time.  Did I mention how wonderful service is? The waiters and waitresses are attentive and nice.  A big plus in my book!"
        }, 
        {
            "index": 105, 
            "rating": 4, 
            "review": "Had breakfast here. The place was pretty much empty around 8 AM which is quite normal for Vegas I guess.\n\nGot a cronut...had to...love them. Got the one with lemon glaze. YUM.\n\nI built my own omelet. It came with rye bread which had caraway seeds in them, tasted pretty good with butter. Hubby got the brioche french toast and thoroughly enjoyed it. \n\nThe place was neat, prices nominal and the staff were attentive and friendly."
        }, 
        {
            "index": 106, 
            "rating": 3, 
            "review": "Came here this morning to get a donut and coffee for my girlfriend who was still in bed because she wasn't feeling good. I get here at 6:45am. I try and order coffee and a cronut and the girl there tells me they are still closed. The resteraunt is opened 24hr, but the donut shop section opens at 7am wtf??? Doesn't make sense. This is Vegas, a 24hr city and the donut shop opens and 7am. It don't make sense. \n\nThe girl agreed to sell me a cronut, but since she said her coffee wasn't ready, I went to Starbucks for the coffee, which by the way opens very early.\n\nYou might want to change your hours. I saw people walking in for coffee and being told they were closed. So they went down to Starbucks."
        }, 
        {
            "index": 107, 
            "rating": 1, 
            "review": "There's absolutely no reason to eat here unless it's the only place that's open...and even then you may want to rethink your options.\n\nService by the wait staff was fine...friendly and fairly attentive...service from the kitchen was quite slow.More importantly, the food was just plain 'blah'. And at $20 a head for breakfast it should be a lot better than 'blah'."
        }, 
        {
            "index": 108, 
            "rating": 4, 
            "review": "Went here for breakfast the first morning, was delicious and the service was great. Had the corned beef hash which was awesome. Giving 4 stars because their bloody Mary's are not that great."
        }, 
        {
            "index": 109, 
            "rating": 4, 
            "review": "Ok, the mac and cheese alone is worth five stars IMHO.  But there is a catch with this place.  Long wait times brings the whole experience down a notch.  But damn if the mac and cheese isn't good.  I've been here three times.  I've always pulled up a chair right at the bar.  You can avoid waiting in lines, which can tend to form at certain points in the day.  America is located inside the New York New York Hotel-Casino.  Above all the tables posted on the wall is a huge sculpture type deal of the United States.  All the menu items have some tie to a city in the U.S.  (mac & cheese = Austin, Texas)  Again, I've waited around a half-hour for my food sometimes.  That's my only gripe."
        }, 
        {
            "index": 110, 
            "rating": 1, 
            "review": "Cold eggs. Crappy sevice. Rude manager. NEVER AGAIN!!!!"
        }, 
        {
            "index": 111, 
            "rating": 1, 
            "review": "This place sucks.  First of all, their coffee is $4 and my husband thought it was awful.  Second, I really like businesses that put their customers first and their priority is to make sure that you are happy.  So when I ask to substitute a muffin for toast, and pay the $1 difference (the price difference if you order them a la carte), and this isn't okay, it makes me really wonder about where their brains went.  It is a little detail like that which is the difference between true hospitality and a restaurant that is just out to make a buck.  Also, I was really bummed about that muffin :)"
        }, 
        {
            "index": 112, 
            "rating": 5, 
            "review": "This place is getting 5 stars and even getting a review from me for one main reason... \n\n... RIch... the bartender... \n\nWe are making a 15 hour trek from CA to CO and our first stop is to blow some cash in Vegas... let's check out New York NY... \n\nSo 300.00 down the drain and down on our luck we are hungry... starving say the least... we walk around and find America. \n\nWe decide to sit at the bar ( some thing i rarely do).. watch some college football... and order up some grub. Rich comes over to take care of us.. and take care of us he does. Charming personality, and doesn't seem to get ruffled.... \n\nOne thing my friend and I love to do is watch people tip. We watched him serve up things great time after time, and never flinch when gathering up his tips.. be it the 50 cent change or 2.00 for a 3.00 beverage.. he smiled, checked on his entire client group ... along the bar... often. \n\nI like this place, good bar set up, nice sizable dining area.. and a great big map of the USA, with little symbols on each state.. probably a great place to take you kids.. should you have had to bring them to Vegas... and get a little education out of it. \n\nThe price is the price... what you would expect from a Vegas Restaurant... 2 bud light drafts, 1 Pepsi, 2 chicken sandwiches .. and edamame... oh yeah, and the food we extremely satisfying... \n\nLike I said, RIch is 2 of these stars alone. He was great with his co-workers.. his shift ended while we were there and we hurried up and cashed out and give him what we thought hopefully made up for the lower, unappreciative, prior tips!!"
        }, 
        {
            "index": 113, 
            "rating": 4, 
            "review": "boo hoo.....leaving NYNY and vegas, so we ate here for our last breakfast. it reminds me of America...pretty standard breakfast options, basic belly filling food. \n\nthe giant map of America is really cool. i had the veggie omlette and my wife had the veggie frittata. both were actually very good and easier on the wallet than alot of places. our server was perfectly friendly and made us feel welcome. kept the coffee and water coming. \n\ni'm glad we came here and would come back."
        }, 
        {
            "index": 114, 
            "rating": 5, 
            "review": "I really enjoyed this place for breakfast. We ordered a make your own omelet and the eggs Benedict, both were delicious. Service was good. The gourmet donuts are absolutely amazing. Highly recommended."
        }, 
        {
            "index": 115, 
            "rating": 4, 
            "review": "Late night eats is a big deal in Vegas and if you find a spot that serves something epic at 4am in the morning after a night out with the fellas, you may end up there two nights in a row like us.\nLocated inside New York New-York is a restaurant open 24 hours called America.  The theme is exactly that where there's a giant model of America floating above with states labeled according to specialty.  Our first visit was at 4am in the morning with only one other group in the restaurant.  There was a sign that advertised a 16oz Ribeye Steak Special for $12.99 from 12am-5am.\nAre you kidding me!  Forget the steak and eggs, get me the special!\nI ordered the Special, rare of course.  This steak was big!  It took up half the plate and was plump and juicy!  My steak was cooked perfectly!  A steak like this can easily go for $20-$25.  \nCheck it out!  You won't be disappointed."
        }, 
        {
            "index": 116, 
            "rating": 3, 
            "review": "Cheap for vegas. Quality is on level with dennys"
        }, 
        {
            "index": 117, 
            "rating": 4, 
            "review": "came here at 11:30 pm on a tuesday night and even though the ratings seemed a bit sketchy i decided to give it a try. my friend got the french toast and i got the steak special! 14oz rib eye w/ veggies and a baked potato for $14! crazy!!! \n\nthe service was a bit slow, but our waitress was as attentive as she could have been (she had A LOT of tables on her own)\n\nour food came out in 20 mins and the steak was surprisingly great! cooked to  perfect medium well! i couldn't even finish 1/2 of the steak...my friend had to come to the rescue lol.\n\nhonestly i would say if you're in the area give it a chance! and remember the steak special! 12 am-5am :D"
        }, 
        {
            "index": 118, 
            "rating": 4, 
            "review": "Ate here yesterday at around 1pm and my first impressions of this place as I really like the atmosphere they have replicas of each state and what it represents on the top wall I found that pretty interesting as for the service it's good the lady who was our server was nice and always refilled our drinks whenever we needed a refill the only negative is it took awhile to get the refills and the food and appetizers but I kind of understand since it was kind of busy and people were just starting to come in so it's kind of hard to keep up with that as for the food it was delicious I got the spaghetti and meatballs which was really good the sauce tasted really good as well and it comes with garlic bread which was okay at best nothing really to write home about overall the food is good they usually do have specials and the drinks were good it is kind of pricey especially if you have a party of 3 or 4 people but it's worth it just to try this place out for the first time and for the atmosphere."
        }, 
        {
            "index": 119, 
            "rating": 3, 
            "review": "My husband and I were walking around the NY NY when we saw amazing display of donuts. We immediately stopped what we were doing and stopped in to get a donut. We settled on sharing a maple bacon with 2 coffees. Honestly the donut was a little disappointing because I thought it was going to be cream filled. The donut frosting and bacon was delicious to it made up for it a little bit. It was a little bit pricey but again what can you expect in Vegas?"
        }, 
        {
            "index": 120, 
            "rating": 4, 
            "review": "Fun place to hangout at, and they have this really cool bridge.........lol"
        }, 
        {
            "index": 121, 
            "rating": 3, 
            "review": "Good place for six people to socialize loudly and have some cocktails! The service is typical Las Vegas.  Food is nothing special.\n\nPros: Interesting cocktails and a place to be loud\n\nCons: Price, service"
        }, 
        {
            "index": 122, 
            "rating": 4, 
            "review": "I liked this restaurant. The BF had ate here before and wanted me to see the huge map. It was cool. I got the spaghetti and meatballs but changed it to angelhair instead which they did with no problem. It was a good meal. Had an awesome waiter."
        }, 
        {
            "index": 123, 
            "rating": 2, 
            "review": "Breakfast service was good, prompt and friendly. This place offers your typical American breakfast fare at a price which is average for Vegas but more expensive that anywhere else in the USA. We had the corned beef hash with poached eggs. Nice. However table over from us had to send their breakfast steak back because it was gristly.\n\nI was tossing up to give this 3 stars. But the main thing that let it down was the $3.75 charge for brewed coffee.  The coffee was just terrible and I resented paying for it at any price."
        }, 
        {
            "index": 124, 
            "rating": 4, 
            "review": "Inside the New York New York Vegas Hotel & Casino, right next to the check in/check out counter. I only came here to get some donuts because they look really really heavenly. Got some Boston Creme, Glaze, and a Strawberry donuts. Those donuts were really big. They were heavenly delicious. High calories, but who cares you're in Las Vegas."
        }, 
        {
            "index": 125, 
            "rating": 3, 
            "review": "This place is OK. It was 1:00 AM on a Saturday night and we had just had a couple beers at Nine Fine Irishmen and wanted some food. We asked the concierge which restaurants were open this late inside the casino and she said America is open 24 hours and \"it's like Denny's, but better.\"\n\nNot sure about the better part but it's definitely like Denny's. Just your basic greasy diner that serves breakfast, lunch, and dinner all day long. I was craving breakfast foods so I got the eggs, sausage, hash browns, and toast. Honestly it wasn't the greatest but it was good and it satisfied my hunger. My friends also ordered the french toast, turkey burger, and BLT and everyone thought their food wasn't bad. Service was OK, nothing to complain about. The prices are a little high but typical for a casino/hotel like New York New York. I guess the best part is that it's open 24 hours so if you don't want to leave the building, you can always eat here."
        }, 
        {
            "index": 126, 
            "rating": 1, 
            "review": "The food was horrible all the way from the Pepsi to the fries. They don't give you regular fries, they are the wedges. We made a mistake and got dessert and even that was not good at all. I would\nNot recommend this place at least for dinner. Never been for breakfast though. The only reason it got a star was because our service was very nice and on top of things."
        }, 
        {
            "index": 127, 
            "rating": 4, 
            "review": "If you're like Rachel Ray on a $40 a day, America will fit that budget. \n\nI was surprised how generous the portions were here for breakfast with yesteryear's prices. My New York steak was surprisingly cooked quite nicely. Even my hash browns wasn't bad either.  They even serve fresh squeezed orange juice which tickled my fancy.  Coffee however was so-so but good service made up for it.  \n\nAlso, I like their funky decor with the USA map displayed when you look up at the ceilings.  Great conversation piece especially if you're having breakfast alone.  Hahaha!!\n\nDon't forget on your way out to purchase a few donuts.  Their vanilla old fashioned glaze was fantastic.  Best of all, they're open 24 hours. \n\nCheers!"
        }, 
        {
            "index": 128, 
            "rating": 3, 
            "review": "Decent food at a decent price. Not fabulous. Server was real good. Took longer than expected for food with a mostly empty restaurant."
        }, 
        {
            "index": 129, 
            "rating": 3, 
            "review": "Mid Juicy NYNY restaurant\n\nThis was our last dinner for 2012 before we kicked off the 2013 new year. I thought the map was cool on the ceiling. The decor wasn't bad for the holiday season. They  had some 2013 hats and headbands and trumpets. Overall the food was ok.\n\nWe got their special prime rib which was pretty good. The southern fried chicken was not good, it was dry and hard to eat. \n\nService was decent but not over the top. Food definitely was slow to come. \n\nIt's a decent place to eat when you have nowhere to go and you're staying at NYNY. I'ts definitely not a restaurant to visit on purpose."
        }, 
        {
            "index": 130, 
            "rating": 4, 
            "review": "In the 3 days I was in Vegas, I ate here 4 times.  I only discovered this place while staying at New York, New York Hotel and Casino.  It is the 24 hour restaurant right by the guest elevators.\n\nThey have a very expansive menu, all relatively priced!  I ate the chili fries, the breakfast platter(twice), chicken fingers, and nachos.  The chili fries were the best!\n\nThe only negative thing I would say is that the service was a little hit or miss."
        }, 
        {
            "index": 131, 
            "rating": 5, 
            "review": "I visited there around 1:00a.m. after a late night in Vegas.  The food was good but the SERVICE was amazing!  \n\n\nIf you go there late at night, ask for the waiter, James Bonds.  His attention to detail, friendliness, exceptional customer service and willingness to go the extra mile is absolutely amazing!\n\n He truly makes AMERICA shine!"
        }, 
        {
            "index": 132, 
            "rating": 2, 
            "review": "So here's the deal - the food may or may not be okay here, however the fact we had a Thanksgiving meal reservation here made us eager to find out.\n\nWe had reserved online several days in advance, and even called to confirm the Thanksgiving menu went all day.  We were told \"of course, why wouldn't it?\" which just sounded like an I don't know or don't care answer so we asked again and got \"yes, as we said the Thanksgiving menu runs through the entire day\".  Even though said with a \"now buzz off\" type tone, we at least we're now confident.\n\nSo we get there, show them the reservation and say we would like the Thanksgiving menu.  They said it did not start for 30 more minutes.  When we explained what we were told when we reserved, they said we could have the regular menu only and no we could not wait the extra few minutes to get what we had reserved for in the first place.\n\nPoor service.  So the food may or may not be good, but it wasn't like this was 10:15am or something.  We wanted what we had been told we could get  and went off to somewhere else where we had a 5 star Thanksgiving meal, even got in at rush time with no wait or reservation.\n\nBad service is one thing, and I'll often forgive - misrepresentation or just not knowing is poor business.  Management here need to train their staff.\n\nWe did not go back during our trip.  We had found other great places instead, the 2 stars is me giving the benefit of the doubt they can do better on non Hoildays."
        }, 
        {
            "index": 133, 
            "rating": 1, 
            "review": "We heard that you cannot go wrong with the restaurants in new York new York.  There were lines everywhere so we thought that we got lucky when they took us right in. We commented that the restaurant was so empty so perhaps that's not a good sign. WE WERE RIGHT. Not only was the service bad...took 55 min to get food, but our waitress was rude and no explanation given or apology when we asked about our food. Food was mediocre at best. But they really don't care because they get automatic tip. Waithelp were crowded by the bar a lot talking and laughing and a lot of empty, unbused tables around us as we ate. Quite unsightly.  Do not try this one!"
        }, 
        {
            "index": 134, 
            "rating": 3, 
            "review": "Decent food and cheap beer on happy hour/reverse happy hour. It was in our hotel, the NY NY, and after the Las Vegas Rock N Roll half marathon, I was not up for walking very far. Great place to grab a decent bite and some drinks.\n\nIt's large and more like a chain cafe/bistro/neighborhood bar and grill kind of place, but it was decent and had cold beer. If it were anywhere else, it would be pretty lame and get a lower rating. Staff was helpful/friendly and food was decently priced."
        }, 
        {
            "index": 135, 
            "rating": 3, 
            "review": "My wife and I were staying at the New York New York hotel, and we stopped in here for a quick no-reservations meal before going to a show that night.\n\nFood:  I had a burger, which was fine; there's only so many ways to screw up a burger, after all.  My wife ordered an advertised special, which was steak and crab legs.  She told me they were the best crab legs she'd ever had, and they certainly appeared fresh and well-prepared; I've never seen anyone have such an easy time getting huge hunks of crab meat out of the shell, especially with snow crab.  So, based purely on those crab legs, they'd get a positive review.\n\nService:  Here's where things fell apart.  Our server was apparently the slowest in the restaurant, which was not at all busy (we'd arrived just after 5, which is really early for dinner in Vegas).  We didn't get out of there until 6:45.  People who arrived after us got their drinks and meals before us, paid, and left before we even finished our meals.  It took him 25 minutes from the time we ordered it to bring dessert!  I mean, it's not like they had to bake the cheesecake or anything!  We really had to hustle to make it to our show, even though we felt we'd allowed plenty of time before we stopped for dinner.  Of course, when it came time to pay the check, he miraculously turned into Mr. Speedy.\n\nSo, three stars:  good food, slow service."
        }, 
        {
            "index": 136, 
            "rating": 3, 
            "review": "I'm reviewing the donut bakery not the restaurant. \n\nPresentation wise the donuts look so delicious.\nOn the 2nd day of my visit I got the 7 for $12 deal. Bacon Maple bars, cinnamon roll donut, bear claw & glazed donuts. \n\nThey were OK because they were cold and probably sitting out for awhile. I'm sure when they first come out they are delicious. I would suggest checking how fresh they are before purchasing."
        }, 
        {
            "index": 137, 
            "rating": 5, 
            "review": "\"America f**k yeah\" That's all I should really have to say. This place came in handy soooo many times on my last trip. They have some really good food options. Loved the quesadillas! But hated the tuna sandwich, and I was drunk when I ate it. So it has to be pretty bad. But really you can't go wrong, there is something for everyone on the menu. Also they have a special going on where it's $3 well drinks during happy hour and between the hours of 12am-5am M-F. \n\nI never physically ate in the restaurant since we ordered our food at the bar and took it up to our room so I really can't comment on the service or the hostess. But the bar staff were all really cool, once we were even reminded of the $3 special so we just had to order a drink."
        }, 
        {
            "index": 138, 
            "rating": 2, 
            "review": "Long wait for the food and the food didn't taste very good.  The only good thing about the restaurant is the huge United States art that is displayed in the dining room.  The kids enjoyed looked at the states."
        }, 
        {
            "index": 139, 
            "rating": 3, 
            "review": "ok, so the family decides to eat locally at the resort they are staying at.  America was the choice, I had the steak and eggs which was ok, i made it clear that i need my steak well done which was far from that, I ate the edges and corners and gave the rest of it to hubby. Duuuuude i made it clear i am prego and cannot have raw meat!!!!! really? u serve it bloody!!!  Hubby got the club sandwich which was good.  Its kinda hard to F up a club sandwich. Would not come back cause they had ok food and really bad service"
        }, 
        {
            "index": 140, 
            "rating": 3, 
            "review": "So my hubby and I was starving so came here.   Didn't like the decor.  I kept feeling like something was going to fall on me from the big map that was on the ceiling.   We ordered basic breakfast eggs, toast, hash browns, and steak.   It took forever to get our food.   They kept bringing us coffee that was horrible.   When the food finally came it was good.   Don't order anything fancy and you won't be disappointed.   they lose points because the food took to long."
        }, 
        {
            "index": 141, 
            "rating": 4, 
            "review": "This is normal diner food. I ate there twice for breakfast. One time I ordered an omelette and the other I ordered chicken fried steak. The omellette was okay, but it's an omelette. If you've had one you've had them all. The chicken fried steak was amazing though. \n\nIt's very quiet and has your standard american breakfast food. Good stuff."
        }, 
        {
            "index": 142, 
            "rating": 1, 
            "review": "Only thing open 24 at NY NY\n\nDecent service\nTerrible Food\nHigh prices\n\nWill not return"
        }, 
        {
            "index": 143, 
            "rating": 3, 
            "review": "This place is a typical diner.  We had breakfast here 2 days and it was ok - did the trick.  Our orders were incorrect and some of our eggs were a little runny.  But it was ok for breakfast."
        }, 
        {
            "index": 144, 
            "rating": 4, 
            "review": "Located in the New York New York hotel. Usually have breakfast here every morning when in Vegas. That huge map of the US hanging from the ceiling has been there for years. Have tried many of the breakfast items on the menu but my favorite is Bagel Mania, scrambled eggs, cheese and bacon between two halves of a bagel. Can be eaten like a sandwich. Lots of good hot coffee. Service is good. Order taken and out to the table very quickly. They have a really neat doughnut shop at the front of the restaurant. The doughnuts are excellent and really addictive. Usually buy a few for takeout and eat later as a snack."
        }, 
        {
            "index": 145, 
            "rating": 3, 
            "review": "I forgot I had done a review for this place. It's kind of become my (very) late-night spot after work. The food is still sturdy and the service is still nice, although it was a tiny bit slow last time I went. Plus, since Excalibur doesn't have 24 hour dining right now other than McDonald's, it's one of the better 24-hour options on the south end of the strip."
        }, 
        {
            "index": 146, 
            "rating": 1, 
            "review": "This review is for the \"Rib-Eye Special\" for $14.99. This steak was literally the worst steak I think I've ever eaten in my life. You needed to be a grizzly bear to get through this meat, and I advise all of you to either not eat here, or order something simple on the menu...  Maybe a hamburger, maybe chicken strips, -- do not order this steak. Be forewarned."
        }, 
        {
            "index": 147, 
            "rating": 2, 
            "review": "Walked by and couldn't resist a cinnamon sugar donut.  \n\nI should've passed... it wasn't that great - it wasn't fresh."
        }, 
        {
            "index": 148, 
            "rating": 3, 
            "review": "We came here for lunch yesterday. We ordered the prime burger for each of us and the burger came out tasty and good. The onion marmalade was very good, the patty was soft even when it is well done (it is ground prime rib). The patty is half pound. The burger came with baked potato. The size is big that I can't finish the whole burger, while my husband finished his whole plate including the baked potato. The only down side is that I wish they would put more horseradish aioli on it. \nThe service was good. The waiter was sincere and polite.\n\nAnother up side is that it opens 24 hours so it is very convenient while the price isn't crazy. The decoration was very interesting too as there is a half wall made into an american map, and there is different things pinned on each state. For example, there is an alligator figure on the Florida state, and there is an astronaut figure on Texas.\nThey have a 4-7pm rib eye special. We probably will try it next time."
        }, 
        {
            "index": 149, 
            "rating": 4, 
            "review": "I went to Vegas for my parents wedding. I was here in late March and I was excited because I knew how many people said that Vegas is a very good city for food. My dad wanted to stay at New York New York. I ate at about 5 restaurants there. I've been checking the reviews of America and other hotel restaurants and they were pretty critical. I went here twice. The first time was a Friday noon and I got the Margarita Pizza. Even though it was Vegas, it wasn't to sure about how good it was. It was actually deep dish style instead of the brick oven style. My step-mom's friend, Ann is from New Jersey and to her it was all about the crust. She liked it. To me, it was all about the toppings like the tomato sauce or the cheese. The pizza was excellent and when my dad tried it, he was in pizza heaven. The second time I tried it was was the morning we left on Sunday. I had French Toast with cinnamon and sugar. That was good also. The bread was soft, it melted in your mouth and the cinnamon and sugar made it sweet which made all those flavors work perfectly together."
        }, 
        {
            "index": 150, 
            "rating": 5, 
            "review": "If Albert is behind the bar you are in great hands! His humor and great personality sets the tone for a good time! Add in the great drinks and awesome food and you are set! One of my favorite spots to stop by while visiting Vegas."
        }, 
        {
            "index": 151, 
            "rating": 1, 
            "review": "OMG!  How can you messed up an egg omelet?  It is tasteless.\n\nCome here to look at the giant map not for the food.\n\nNote:  From order to food to table, it is longer than normal service."
        }, 
        {
            "index": 152, 
            "rating": 3, 
            "review": "THE essence of jekyl and hide, hit or miss, yin or yang.\n\nGood: pastrami sandwich (crrrrispy and toasted rye yum)\n            fries-like kfc's fries but crispier, lighter and not under a heater   for hours \n            fried chcken good\n            salads good\n           coolest wall inside with all 50 states\nterrrible: baby back ribs=disgusting orange-ish bbq sauce and lukewarm ribs awful\n                buffalo wings=so-so, arrived cold c'mon man. And nuthin buffalo about it, coating leaves a lot to be desired\n\n          they have steak and lobster 15 bucks special, after 3pm i was there at 2pm so assed out.\n\nIf you like roulette, you will love this russian-roulette-for-your-stomach-restaurant."
        }, 
        {
            "index": 153, 
            "rating": 2, 
            "review": "On the menu the food sounded really good. I ordered the prime rib dip sandwich and my husband the prime rib special. \n\nThe food took very long to come out waited about 25 minutes. There was hardly anyone in the place! When I came out it was cold. My prime rib sandwich bread was stale the meat and au jus had no flavor, the fries were dry, must have sat for a while. My husbands prime rib was over cooked and had a bad taste. He liked the green beans and mashed potatoes. \n\nI gave it two stars for the petite Caesar salad. The waiter could not even give back the right change, shorted us. I will never go back."
        }, 
        {
            "index": 154, 
            "rating": 4, 
            "review": "I have to say this place is great after a night of drinking. I mean \"Who isn't hungry after drinking?\". I loved the chicken noodle soup with the club sandwich. I got carry out and took it right to my hotel room inside NY NY. The service was quick and the food was awesome. Thanks America!"
        }, 
        {
            "index": 155, 
            "rating": 3, 
            "review": "This review is solely on the server/bartender Jenna \n\nI don't want to play the race card but I noticed she paid more attention to her Caucasian customers \n\n-horrible service \n-did not say one word to us but to place our order made no eye contact whatsoever \n-forgot our smoothie we ordered - had to ask another server\n-got our order super late\n-the Caucasian couple next to us that ordered the same thing got their order first when we were there first \n-and got my  order of omelet wrong it was on the menu just plus the sausage -___- \n-asked for our check and gave us attitude saying it was inside a cup in front of us when she never told us the check was there \n\nStill gave her a big tip bless her soul - the rest of the servers seemed nice."
        }, 
        {
            "index": 156, 
            "rating": 2, 
            "review": "Really disappointed with this place as Ive read about the cool celling of the map of the states, but it was just tiny and you have to be sat directly in the middle to see it as the place is huge. \nAs for the food we went for breakfast and we both got the Italian skillet which consisted of marina sauce and potato's and cheese lots of it and sausage and egg. Not bad tasting just wasn't great, but service was okay."
        }, 
        {
            "index": 157, 
            "rating": 4, 
            "review": "I've just got one thing that I want to mention about this place. The midnight Steak Special for $12.99. I came here after a late night out and the steak really hit the spot. It was steak house quality and the meat was tender and juicy. It came with a baked potato sour cream, chives and butter. \n\nIf you are not into steak I've also tried their Mac and Cheese which was really good. This had a nice creamy texture to it no clumps to be found here! The portions run big over here so you could easily share an entree."
        }, 
        {
            "index": 158, 
            "rating": 5, 
            "review": "Great variety of delicious food at reasonable prices (especially for the strip) ...this coming from a Vegas local!  Great service, very attentive!!!  Ask for Joe (bartender)"
        }, 
        {
            "index": 159, 
            "rating": 3, 
            "review": "Ahhhh nothing like breakfast food when you're drunk! After a night of dancing at XS we stumbled here from our hotel, the MGM which is across the street. This night was a little blurry for me, not sure how we heard of this place but thank goodness it was open 24/7!\n\nThe place was pretty empty and we were seated right away. I ordered the Empire State Plate which came with eggs (over easy), bacon, sausage, hash browns and toast. Our food came out pretty quick and I loved my runny eggs with the oh so buttery toast. The bacon was super crispy, just the way I like it. Keep in mind that I'm still a drunken mess but the food was good. I think the only thing I didn't finish were the hash browns, they were a little too mushy for me even in my state of mind.\n\nAfter we got our food, I think service was pretty slow. From what I remember when we got the bill we just put the money at the table left. In a sober state of mind, I probably wouldn't come here but this place filled my tummy and I was happy."
        }, 
        {
            "index": 160, 
            "rating": 3, 
            "review": "America was good for what it was. If you're expecting delicous diner food, then this is the place for it! \n\nWe stayed at the NY NY hotel, so this was convenient and we ended up eating there 3 times over the course of our stay. Each time we went the place wasn't very busy, but the service was pretty slow. Even so, all of our servers were very friendly and attentive.\n\nWe had the following dishes:\n\nHumongous Pretzel - This pretzel really is humongous. It could serve 2-3 people and came with French's Mustard and Cheddar Cheese Sauce. It was what you would expect any soft pretzel to be: soft and chewy and delicious.  \n\nPetite Caesar Salad - While it maybe \"petite\" it really was a generous serving. The house made croutons were huge (and my toddler loved chewing on them), and it was pretty tasty.\n\nABC Omelet and the Ham & Cheese Omelet - Pretty good. Generous amount of avocado on the ABC omelet, and lots of ham in the Ham & Cheese omelet. I thought it was interesting that the cheese wasn't inside the omelet, but rather melted on top. Both came with hash browns and choice of toast, and a delicious mini muffin.\n\nSteak and Eggs - Steak was a bit under cooked, but the rest was good. \n\nCorned Beef Hash & Eggs - A little greasy and kind of a small portion,but good nonetheless. \n\nAmerica is careful to prevent cross contamination if you have a gluten intolerance, which we really appreciated. They have several options that are GF and took the time to make sure everything came out as it should. The prices here were pretty decent, too.\n\nThey also have good coffee, which was a nice break from Starbucks. \n\nWe'd eat here again if we were in the area!"
        }, 
        {
            "index": 161, 
            "rating": 3, 
            "review": "Food was good but service somewhat slow. Good Bloody Mary's but they were missing pickles which is essential in my opinion. Not too expensive and fun open environment."
        }, 
        {
            "index": 162, 
            "rating": 3, 
            "review": "Had breakfast there twice during our stay. The food was great, especially the omelets (asparagus & feta omelet-DELISH but didn't quite match the menu-few if any green onions & minimal dill) (wild mushroom omelet could have used more mushroom varieties) & pancakes, but the service lacked. The hashbrowns that accompanied the meals were excellent. The food came out quick & hot, but we were missing part of our order the first visit, delivered by a bus-boy or kitchen attendant, not our server. Our toast was missing butter. We were missing a side of bacon. We couldn't correct the issue because our server didn't follow-up until he brought the bill. The second day, service was better but our table was missing silverware (like knives for spreading jam... Which conveniently was also missing this day, but at least the bacon arrived & toast was buttered, and service was more thorough). Overall satisfied with the quality of food (4 stars), but 3 stars for the execution & service."
        }, 
        {
            "index": 163, 
            "rating": 4, 
            "review": "it looks like a typical place i would NOT eat at... fake nostalgia?  BUT the donuts displayed in the window actually looked good and weren't a total rip off. the service lady was very friendly--like what you'd expect at a neighborhood donut joint. a bit sassy and cute (she was an older lady). she is almost all the caffeine anyone needs in the morning.\n\nbasic cronut--flaky and fresh--great execution. a very noble copy of the ansel version in nyc. all they need to do is set up a fake line of hipster mannequins (see urban outfitters) which we can cut like a kardashian--then the experience would be truly worth $4 per cronut!  (can you say social media picture opp?)\n\nalso, maple bacon bar--a delight of sweet and smoky/savory. \n\ni usually go to ronald's donuts on spring mountain--but i do enjoy america's donuts quite a bit (even if it was $6.98 for the two donuts--that's a dozen at ronald's!).\n\nthere are a lot of great eateries inside ny ny.  definitely way better than being stuck in caesars.  they mgm people are doing a great job of making this property very attractive with the many interesting food options that i actually go through the trouble of getting to."
        }, 
        {
            "index": 164, 
            "rating": 2, 
            "review": "There are some things that are a cardinal sin of a 24/7 Diner Restaurant...I can accept Farmer Brothers Coffee (or whatever your low grade Joe happens to be).  I cannot accept whatever java dung I was served with my all you can eat pancakes.  I'm sorry America this is a deal breaker.  I was good with your diner food  but what was poured in my coffee cup tasted like a dry roasted turd."
        }, 
        {
            "index": 165, 
            "rating": 2, 
            "review": "Let's be honest-- the food sucks. The menu offers typical diner food at higher prices than your local Denny's and is just as awful. \n\nBefore dinner, our waitress brought us soft dinner rolls with butter that my son really enjoyed. \n\nI ordered the pot roast dinner which consisted of mashed potatoes, onions, carrots, and roasted potatoes -smothered in gravy. Strangely enough, there was one thing missing-POT ROAST. In this bowl of slop, I did detect one piece of something that resembled meat..... I think. \n\nMy daughter and aunt ordered the brick oven pizza  The pizza was not bad---and is the only reason I didn't give this place one star.\n\nMy youngest daughter ordered the spaghetti and meatballs off of the kids menu. The sauce wasn't anything special- but the meatball was decent.  Service was mediocre, with several servers taking turns bringing out food at different times. \n\nI would not recommend this place to my enemies. There has to be better options than this crap hole."
        }, 
        {
            "index": 166, 
            "rating": 2, 
            "review": "Almost nothing I liked here , not sure why I even came here .arghgghhadderggghh....... \nWe ordered buffalo wings which were like stale as if were frozen n refried n served to us and what was irritating they forgot to put any sauce on it ... I was like WTF . We send it back , got second serving those came with sauce but equally crappy , RIDICULOUS !!! \nSalmon with wild rice was our second dish . Came with huge fillet that's one star but rest all was wild only as name suggest , it costed like $20 so we just finished it to get value of money .\nI ordered shrimp scampi ... No words ... I left the dish after eating 1/3 . No salt no garlic no herbs no seasoning no no no nothing was there . This place is total waste of money , never ever coming back . Second star for this place is for waitress who was trying to help with the crappiest dishes I ever had in Vegas ."
        }, 
        {
            "index": 167, 
            "rating": 1, 
            "review": "We ate here for dinner on our last day in Vegas.  We just wanted something light to eat.  Our server was very nice but everything took FOREVER.   From taking our order to getting our check and then the change.   The food was ok, nothing special at all.   Basic American diner fare, but not good diner good.  Just ok.  With All the choices, I would not come back or recommend eating here.  Ask for dressing on the side,  my salad had so much it was barely edible."
        }, 
        {
            "index": 168, 
            "rating": 4, 
            "review": "Hubs and I visited America around 10:30 AM on a weekday.  I love breakfast foods and he hates them, so we really liked that he was able to order lunch that early in the day. \n\nThe decor of this place is amazing.  There's a huge 3D map of the United States showing each state's claims to fame.  You really just need to see it.\n\nOur server was knowledgable and attentive without being overbearing.  \n\nMy parents own a small breakfast restaurant and I worked there until after I graduated college so I am a huge breakfast snob.  I mean, it takes A LOT for me to compliment a breakfast made in a restaurant, and let me tell you: that breakfast was GOOD. I ordered the eggs benedict which came with hash browns and a halved roasted tomato.  I don't even like tomatoes usually but that one tasted really good.  I don't think the hash browns were home made, which would be the only downside.  The coffee was really good."
        }, 
        {
            "index": 169, 
            "rating": 5, 
            "review": "OK, if I had read these reviews first I would likely have never eaten hear.  Seems too many of the other reviews are high maintenance snobs who expect everything in Las Vegas to be gourmet.  \n\nThis restaurant was a solid choice three times during my stay at NYNY.  The first time, we were so taken by the portions and freshly prepared food, that we came back twice in 3 days.  When my friend ordered the chicken fried steak and eggs, I expected a frozen patty drowned in gravy, instead he got a large TENDERIZED FRESHLY BREADED fried steak that covered 2/3 of the plate!  \n\nThe portions are enough to keep you from eating at pricier places while you take in the strip.  We dined here at noon and literally didn't eat again until 8pm.  \n\nThe staff was friendly and fun.  The manager visited the table and was genuinely interested in us and our experience.  Very refreshing, it wasn't a canned greeting, it was a conversation!\n\nConclusion, it's worth the stop for a filling and satisfying meal that will allows for a friendly atmosphere to unwind in before the action that is synonymous with Las Vegas.\n\nPS- The bloody mary's were a deliciously spicy start to the meal"
        }, 
        {
            "index": 170, 
            "rating": 1, 
            "review": "I came here a while ago and I was browsing for places on yelp for my next Vegas trip so I thought I'd write a review about my experience while I was looking. \n\nFirst off, I got sick eating here. That should be a red flag to people considering the place, but it honestly could have what I ordered. Wanting to be cheap I got the roast beef sandwich. The sandwich was served cold which was fine with me. But it tasted very strongly of horseradish to the point where the store bought roast beef and veggies were sort of overpowered. That was also fine. I thought it'd at least make the sandwich taste like SOMETHING, but not to long into my meal and I felt a strange gagging reflex and a rumbling in my tummy. The meat seemed to have gone bad and it was very well masked by the aforementioned horseradish. I spent the night with an upset stomach and a bit of heaving.\n\nJust do yourself a favor when you're in Vegas and choose your dining establishment with at least as much care as you would place on a table game."
        }, 
        {
            "index": 171, 
            "rating": 3, 
            "review": "This is a solid 24 hour casino coffee shop type place in NYNY, but it's not overwhelming.  I had breakfast one morning at the cafe, and service was very quick.  I ordered the bagel sandwich, which has eggs, bacon, ham, and cheddar cheese.  It comes with hash browns.  The only hot sauce America has is red Tabasco, which I don't care for by itself.  So, the waiter asked if I would like to try their salsa.  I said I would.  The salsa wasn't bad, it actually had a little spice.  It's thin, so it was hard to get on the sandwich, I basically had to dip.  I was annoyed when the bill arrived and I had a $1.50 charge for the salsa.  It's not that I care about paying $1.50, but he offered like he was doing me a favor and didn't mention it was an additional charge.  I would have still said yes, but I feel like you should give diners a heads up when there is a charge that's not on the menu directly in front of them.\n\nThe sandwich was large and did not stay together well.  The bagel was grilled, but not toasted.  I would have preferred it toasted for a more consistent result.  The shaved ham overwhelmed the sandwich, which is too bad because the bites I did get with bacon were very good.  The hash browns had a decent sear to them, they clearly were cooked well.  \n\nIt's not fantastic, but a decent value if you are in need of a quick and casual meal.  Also, the map of the USA around the restaurant is pretty cool."
        }, 
        {
            "index": 172, 
            "rating": 4, 
            "review": "I came here twice during my stay in June.  (This review is really late because I forgot to finish it because I started it on my phone!)\n\nActually three times if you count me ordering room service my first day and this being it..\n\nThe first time was excellent!  Service was fantastic, hostess was very sweet and talked to me as I came in.  She actually seemed interested in talking and listening when I told her about my stay so far.  Coffee was delicious, good food (although I didn't love the fried eggs).  The restaurant is huge inside so there was no waiting .  Loved it!\n\nI came the next morning and got a completely different experience.  It was actually BAD.  Waiter didn't seem concerned about getting me anything in a timely fashion.  Again, the restaurant wasn't too busy, so there was no excuse.  \nMy food was so bad and the eggs were so runny, that I had to send them back.  And I never send food back because I feel bad....\nAnyhow, I sent it back (after waiting forever to get the waiter's attention and instead I got the manager's attention).\nMy food came back a second time partially cooked more, but still runny.  I hate the runny white part in eggs over medium.  It was pretty gross.  I couldn't eat it and was starving by then, so I just ate the toast and bacon.\nMy toast was ice cold.  The butter wouldn't even melt on it.\nI was told there wasn't any creamer for the coffee, and instead they brought me a cup with milk in it.  I ended up not drinking my coffee at all.\n\nI was ready to rip this place apart....\n\nThen I asked the waiter for the bill since he didn't seem to get the hint that I had been sitting there forever waiting for it.  And he told me the manager covered it and not to worry about it.\n\nFortunately for me, I didn't have any cash and couldn't even leave him a tip.  Not that he deserved a dime.\n\nSo because the manager at least had the common courtesy to cover my breakfast, I didn't give them the 1 star I had planned....\nI'm not sure if I'd come here again.....I might try it once more...."
        }, 
        {
            "index": 173, 
            "rating": 4, 
            "review": "Here's the scenario:\nIt's 4am on a Monday and I just walked off the craps table at NyNy resort uber hungry. The food court is closed and the only place open within close proximity is this place. I instantly fear the abhorrent midnight mediocrity that is the standard for most late night casino eats however this place is a welcome surprise for late night eats. \n\nI ordered the 15.99 rib eye steak late night special; medium rare with a loads baked potato and the lady ordered the monte cristo sandwich. \n\nFood quality was very good. \nThe steak was a generous ribeye cut and it was actually cooked as requested. (I say that because you can't ask for the world when ordering late night steak specials) Needless to say, its probably the best steak I've had at 4am . \n\nThe lady's Monte Cristo was as awesome!\nThe French Toast was well cooked (meaning not runny eggs/sloppy or burnt ). It was the a great marriage between breakfast and lunch in your mouth at 4 am. \n\nAs expected the service and food came out slow. (This is expected when you are dining at 4am) however the server was very friendly and accommodating so it really was not an issue at all. \n\n\nI don't know if we lucked out but I can seem to understand how this place has so many bad reviews? This place is much better than most late night casino eats. \n\nI say eat with confidence; especially at  4am"
        }, 
        {
            "index": 174, 
            "rating": 3, 
            "review": "Since we stayed at NYNY during this trip, this was a convenient place to have breakfast. \n\nI love the HUGE map of USA that covers most of the large ceiling. Great piece of art and worth coming just to see it. \n\nWe ordered... \nCoffee \nOrange juice \nEggs Benedict \nCrab Cake Benedict \n\nMy Crab Cake Benedict was good and bad. Let me explain... \nThe Crab Cake was yummy but the egg was not runny. It was like a hard boiled egg (which I hate). The tomato hallondaise sauce was yummy. \n\nOur waiter Claudio was very nice and professional. Rest of the staff were equally pleasant. \n\nOverall not a bad experience but I doubt I'll be back."
        }, 
        {
            "index": 175, 
            "rating": 3, 
            "review": "First impression is something that really gets me and unfortunately mine was bad, I won't name her but the older hostess was quite rude. She does not seem to care about customers and won't even look at you while speaking. Other than her, the other staff were very nice. However I would not come back for the food, it's very easily compared to IHOP. I had chocolate milk, which I hated because it was pre-made. I prefer milk and chocolate stirred. I also ordered the chicken and waffles- like I said, comparable to IHOP. My dad got the steak and eggs and he liked it and it looked good so that is probably the not suggestable item. Might as well walk a bit and make the trip to pay a bit less. Overall experience was meh."
        }, 
        {
            "index": 176, 
            "rating": 4, 
            "review": "Nice doughnuts open super early. Croughnuts were the best. Im from newyork and i enjoyed them"
        }, 
        {
            "index": 177, 
            "rating": 3, 
            "review": "God bless America!!! Haha, but no, seriously... God bless the America restaurant at the New York New York Hotel & Casino. During my recent trip to Vegas, I was appalled to find that the only 24 hr dining options at Excalibur (where I was staying) and Luxor were McDonald's and Krispy Kreme. My wife and I were in search of late late night/early morning dining that was more substantial that doughnuts or a gut-bomb burger. We were perplexed and nearly gave up when we literally stumbled upon America. The food was average... nothing special. Large breakfast menu, some hot sandwiches and burger, and a small dinner menu (maybe they had more, but I may not have been given the \"dinner\" menu). Our waiter was awesome. He struck me as a little.... slow, but he was an amazing human being and a fantastic waiter! Our food took a little longer than I would expect for 0400, but beggars can't be choosers. I ordered a bacon cheeseburger with fries and my wife ordered The Empire State Plate (two eggs, sausage or bacon, hash browns, and toast). Sarah LOVED her meal... she thought the hash browns were amazing and so were the eggs. My burger was rather unremarkable, but I don't consider that a bad thing. The restaurant is great for that late night meal that you crave after hours of sitting at the casino tables and our waiter was amazing and got a big tip. Three stars for being open late night, but couldn't quite bring myself to give 4 because the food took a while to come out and I would compare it to Denny's quality."
        }, 
        {
            "index": 178, 
            "rating": 3, 
            "review": "We decided to look for a spot to eat in the wee hours of the night after a night of drinking and found this spot open 24 hours in the New York New York hotel and casino. I was easily drawn to the sign that had the post midnight special: a 16 oz. steak meal for only $11.99.  I'll take that please!\n\nWe came in and ordered fairly quickly as there were only a few people sitting in this enormous room filled with memorabilia from around the\nUnited States. I ordered the steak special which came with two sides. I ended up getting some coleslaw to substitute the vegetables and an order of the french fries.\n\nThe food came out in about 12 minutes or so, which is a good time to wait. The steak was decent. It was a litte tough to tell the truth, even though I had ordered it medium rare. Id say the steak was decent \nespecially for the price so theres nothing to complain about.  The \ncoleslaw was forgettable as were the fries. \n\nIf you're really hungry and in the area I'd say go for it, otherwise there's probably other better alternatives."
        }, 
        {
            "index": 179, 
            "rating": 4, 
            "review": "This is comparable to a Perkins or an upscale Denny's. This was not on my original list of restaurants to try but due it's convenient location by our hotel we decided to forgo a 15 min trek down to strip for breakfast food and selected America instead. We walked into the restaurant and the host was very gracious and genuine inquiring how our trip was. She was so grandmotherly!  I ordered the ABC OMELET which consisted of Fresh Avocado, Bacon and Wisconsin Cheddar and I ordered a side of bacon. When my entree arrived I was surprised to discover that the avocado was simply sliced up and garnished on top my omelette. My side bacon was not that great though. I specifically asked the waitress if the bacon was good there and she assured me that she would make sure it was cooked properly and it would crunchy. My bacon came out somewhat burnt and chewy. Overall, my omelette was satisfying and the grandmotherly hostess was the highlight."
        }, 
        {
            "index": 180, 
            "rating": 2, 
            "review": "It was just ok. I had the $15 surf and turf. What can you really expect for $15. You get what you pay for. The apps were the best part. I thought the bruschetta was good."
        }, 
        {
            "index": 181, 
            "rating": 2, 
            "review": "The décor is unique. It is bigger than a café. The waiter was not impressive at all. Not friendly, tossed our utensils on the table and one almost slid off the other side of the table. Never asked if we needed anything or refills on our drinks. My husband ordered the ABC Omelet. He said for the price it was very small portioned. But also the home fries you could barely taste some seasoning and the omelet was BLAH!! I got the buttermilk pancakes (3) with a side of sausage links. The pancakes covered my entire plate, golden brown and sure soaked up my maple syrup!! They were ok kinda dry. I don't like my pancakes swimming in syrup and they were not and I still needed more syrup to make them wet looking. My sausage links I did like the flavor and they were good. We then sat there for a good 20 min waiting for our check and someone else came and gave it to us not our waiter. For all we got it the cost was $32 and change!! Not impressed will not be coming back."
        }, 
        {
            "index": 182, 
            "rating": 5, 
            "review": "I was just here few weeks ago and I really liked this place.  I stayed at MGM but decided to eat here (they have a deal going on right now for $15 for 1 lb or crab legs or ribeye steak w/ choice of 2 sides).  I've been craving for crab legs and I really didn't want to go to a buffet and over stuff myself.  I really liked their crab legs.  My hubby got their steak, which was cooked very nicely.  We also had an appetizer, which was very good.  Our waiter was also very attentive as well....  I noticed this place wasn't very busy for dinner, seemed like they get more crowded for breakfast...\nI would definately go back here again!"
        }, 
        {
            "index": 183, 
            "rating": 1, 
            "review": "This was the worst restaurant by far I have ever been to.  Prices for dinner are ridiculous and the food quality is terrible. They get away with it because they are located in the N.Y. N.Y. Hotel and can charge high prices for low end food.  My friend and I had dinner there recently, I had the flat iron steak and my friend had the shrimp scampi dinner. It wasn't that impressive looking at it in the dish but we thought it tasted OK not great but OK.  Service was terrible, our waitress took the order and then never checked back to see if the food was to our liking. We had to call the manager for a minor problem. We saw the waitress when it was check time.  I tasted his food and he had some of mine and we agreed it wasn't worth the price.  When we left the restaurant we both got such tummy aches we had to literally RUN TO THE NEAREST RESTROOM, and everything we just ate immediately left our body. (need I say more). Apparently the food wasn't handled properly.  After we came back from the restroom we both felt fine.  I called the restaurant and complained and also filled out a report (why) I didn't say I had food poisoning, but this was their  practice, to cover themselves just in case.  I emailed the corporate office about our experience and received a phone call from their VP whose name was Paul and he told me \"it was baloney\" I couldn't possibly have gotten sick that quickly from their food.  His manners on the phone were horrible, very loud and didn't listen to what I was telling him.  Basically he said I couldn't have gotten sick from their food and I told him unless he ate the food out of my dish he shouldn't say that.  He wasn't there watching it being prepared nor did he eat it.  Since  we both had stomach aches and rushed to the restroom after leaving the America Restaurant  it was because of the improper handling of the food.  I expected an apology but what I got was a yapping Vice President who of course believes that the America restaurant is perfect.  Nothing is perfect and if a customer complains about a problem I would think good customer service would be to apologize for a terrible dining experience.  Not so here.  So BEWARE IF YOU DINE AT THIS RESTAURANT,  YOU WILL PROBABLY HAVE TO VISIT THE RESTROOM TOO."
        }, 
        {
            "index": 184, 
            "rating": 2, 
            "review": "Decided to try this place out after finding its menu online which had so much to offer. After getting there, the menu was completely different and missing more than half of what I saw online. I struggled to find anything worth getting and ended up settling for a Turkey Club, which was fine but really it would be pretty hard to screw up a turkey sandwich. On the way out I tried to get a Nutella Cronut, but of course there were none left. I would not eat here again and I wish I had the correct menu before stopping here."
        }, 
        {
            "index": 185, 
            "rating": 1, 
            "review": "Overcooked poached eggs, pallid rye bread (in a New York, NY restaurant!), and corned beef hash that tasted of nothing but onion.  The server was friendly when she had time to come around and see us, but I asked for a newspaper, which never came.  She came back to see if everything was okay when we'd already been finished eating what we could take of the food."
        }, 
        {
            "index": 186, 
            "rating": 5, 
            "review": "Eggs Benedict was delicious with perfectly poached eggs. The hashbrowns were crispy. Service was fast and friendly always refilling and checking up on our table. Easy to find in the casino. Known for their baked goods. Reasonably priced compared to other strip restaurants."
        }, 
        {
            "index": 187, 
            "rating": 4, 
            "review": "One of my friends amongst the group was craving breakfast with actual eggs and toast and etc. And we were somehow in NYNY at the time and couldn't find a buffet. So we were pointed in the direction of America.\n  The food quality was about the same as you'd get at IHOP or Denny's, and the prices about the same. So nothing to rave or complain about. My Chicken Fried Steak and Eggs was tasty, fatty, and delicious. Our waters were constantly refilled, and the decor and environment felt relaxing enough. What really stood out was...as I am asian..I MUST have soy sauce with my over easy eggs..Get that Ketchup and Salsa away from me. Our server said it'd be no problem, and she actually went all the way to neighboring restaurant Chin Chin to get me a bowl of soy sauce. Wow above and beyond the call of duty.\n  The only real reason I gave this four rather than five stars, was that our server disappeared for what seemed like ten minutes before we could pay our bill. Not a deal breaker, but a nuisance nonetheless.  Anyway if you're in NYNY and want some breakfast, it's worth a shot. Not to mention if you don't care about having eggs and hashbrowns etc. They have a great deal for all you can eat pancakes at like $6 (which were fluffy and delicious). One of my buds ordered that and helped feed the entire table (our server didn't mind at all)..which was cool.\n~G"
        }, 
        {
            "index": 188, 
            "rating": 4, 
            "review": "Don't sleep on America, y'all... I went last year and they had a great all you can eat pancake plate for cheap. This is also a place where you can get a steak and crab legs plate as well. I loved it for the price and corny \"Americana\" decor. It was fun and food was delish."
        }, 
        {
            "index": 189, 
            "rating": 5, 
            "review": "If I can recommend a great restaurant with excellent service, it was our own hotel, the AMERICA restaurant at the New York New York hotel. We ate the $11.99 ribeye steak and potato special, and OMG it was juicy, flavorful and the service was the best we had in Vegas. We didn't even need to use any A-1 sauce! SOOOOOOOOOO GOOD.\n\nJames was our waiter and he is THE BOMB! We tipped him almost half of our meal cost because we were SOOO pleased. He was very personable, gave us tips and offered a drink idea, the Fruity Booty which was DELICIOUS. He checked on us often, and made sure that he made us feel like we were the only people in the restaurant. We even had a few laughs with him. \n\nWho knew our own hotel's restaurant would be so good. We went back for breakfast this morning as we left for our flight back home, and once again, EXCELLENT service!"
        }, 
        {
            "index": 190, 
            "rating": 2, 
            "review": "This place has been going down hill. The food quality is getting worse and worse. The servers are trying to make it a better experience but the food is just disappointing. Skip this place if you can until they either fix with what's wrong in the kitchen."
        }, 
        {
            "index": 191, 
            "rating": 5, 
            "review": "Stopped by here for breakfast today and was really pleased with my breakfast. I went with the lox and bagel and it was sooo good. Especially if you like salmon, this an excellent choice! Fresh and tasty. My fiance had the American breakfast and he liked his' too. He said it was a lot of food and the bacon was super crispy. The pancakes were ok, nothing to die for though. Would recommend this place."
        }, 
        {
            "index": 192, 
            "rating": 4, 
            "review": "We stopped by here on our last day looking for a good breakfast spot that won't break the bank after a long weekend away. I have to say not a lot of breakfast places around in Vegas, everyone sleeps late, this was a definite plus. Upon entering we were greeted and seated right away. The menu was pretty standard American breakfasts, makes sense place is called America, and the prices inexpensive for Las Vegas. My husband ordered the all you can eat pancakes with a side of sausage and I got the ABC omelet but as a scramble. The portions were large and plentiful and we enjoyed it very much.\n\nThe best part was our server, Jesus, like the Christ. He was fantastic and dealt with all my obvious I am a tourist questions and was patient with me and my annoying ordering habits. He was absolutely wonderful and by far the best server I met while here. We called the manager over, Kim? Rosas and had to let her know how our experience was. She was really sweet and although a BIG Patriots fan (we can't all be perfect ) we felt she and the staff needed to know they were great all around."
        }, 
        {
            "index": 193, 
            "rating": 1, 
            "review": "A 1STAR this time around means mediocre food coupled with absolutely horrible service.  Really?  45 minutes to get us two sandwiches that weren't that good?  \n\nSave yourself the trouble and go to Jack In The Box."
        }, 
        {
            "index": 194, 
            "rating": 4, 
            "review": "Late night take out, spaghetti and meatballs. Not long of a wait,  little pricey at $13.95 but this is the strip. \n\nPretty good. They do rotate their menu so my \"usual\" the meatloaf is not on!"
        }, 
        {
            "index": 195, 
            "rating": 4, 
            "review": "The food was really good. I had a patty melt and was in love with it. The fries were also so delicious. I'd definitely recommend it if you're looking for a diner style meal. Really, really delicious food."
        }, 
        {
            "index": 196, 
            "rating": 5, 
            "review": "One of my favorite places on the strip. Great food. Awesome and unique atmosphere. The Steak and Eggs with a Side of Pancakes was made perfectly. Low priced compared to anything else on the strip (Around $15-20 per person)\n\nDefinitely going back."
        }, 
        {
            "index": 197, 
            "rating": 4, 
            "review": "I've eaten here three times in one week while staying at the New York New York. This prices at this place are very reasonable amongst the Wolfgang Puck's and the grandiose buffets. The food here is typical American food (burgers, salads, pancakes) but it taste very fresh. I had a virgin guava daiquri and it was delicious. If I come back to Vegas again, I'll be eating here."
        }, 
        {
            "index": 198, 
            "rating": 3, 
            "review": "This place is located within the New York - New York Hotel & Casino. My husband and I decided to try this place for breakfast/lunch on our last morning in Vegas. At first glance the menu looks good, but once we got the food it just wasn't that great. The service was pretty lacking too. \n\nI ordered an orange smoothie which I still hadn't received by the time we got the food, and when we reminded the server she brought a strawberry smoothie. I'll say that the smoothie was pretty good, even though it wasn't what I ordered. \n\nMy husband ordered a breakfast burrito which he seemed to like, but it looked like there were too many eggs inside it compared to other ingredients. I ordered the lump crab eggs benedict, and it just wasn't very flavorful. \n\nThe restaurant is open 24/7 so I'd probably go back for a late night meal, but it wouldn't be my first choice."
        }, 
        {
            "index": 199, 
            "rating": 3, 
            "review": "Staying at the NYNY hotel, we decided to try it out for breakfast.\n\nI had the crab cake eggs benedict. It was pretty good but nothing about it stood out nor was it bad. \n\nThe restaurant was decent and I would not make it any sort of a destination but wouldn't mind dropping in were I around in the vicinity."
        }, 
        {
            "index": 200, 
            "rating": 1, 
            "review": "America?????  I think not.  This place SUCKS!  The waitress was uber rude and uber slow.  I felt like I was doing her a favor by coming in there.  The food was mediocre at best too.  Eaters beware.  Don't be allured by the flashy faux USA on the ceiling.  You are being lured into a trap!\n\nRemember what the mosquito said right before he reached that bright light?.....ZAP!  I think you get my point now :)"
        }, 
        {
            "index": 201, 
            "rating": 2, 
            "review": "Wow service is slow here & they were not busy. \nThe waitress was nice, but she often forgot things, maybe becasue we had a larger group. \nThe inside of the restaurant was cool, all the places across america! Which is awesome. \nMy husband and I both had fish and chips. The portion was huge omg was it huge, we could have shared. Taste wise it was horrible, i hate tarter sauce and i had to drench the fish in to cover the taste. \nThey have a little bakery infront of the store, with a lot of tasty looking items. We got a cross between a donuts and a croissant, i wasnt a big fan, we got a maple one my brother got a regualr one and said it was pretty good."
        }, 
        {
            "index": 202, 
            "rating": 4, 
            "review": "What's with all the low ratings? I must have been to a different America restaurant because I certainly thought that the service and food was good.\n\nCame here on a weeknight around 12AM with a fairly large group (13 people). We were seated fairly quickly after a 10-minute wait. This place is huge and it was fairly empty at this time. The map of the US hanging from the ceiling is a nice touch and very educational.\n\nAlmost everyone in our group got the $12 rib-eye steak midnight special. My steak was delicious! and cooked to my liking. Although I had asked for my steak to be cooked medium, my gf noted that it wasn't medium and that it was missing the little plastic thing they stick on the meat to show how well it was cooked.\n\nMedium or not, I still enjoyed it. Must be my hunger taking over. I've also never heard of HP brand steak sauce until I came here. I usually pour A1 on my steak but after trying the HP sauce, I'm a convert! It had more zing and brought out the taste of the steak to the fullest.\n\nWe had a lava cake for dessert but I didn't like the ice cream that came with it. Toffee/coffee flavored. I prefer chocolate or vanilla next to my lava cake.\n\nMy only complaint was that I had ordered my steak with mash potatoes but instead it came with baked potato. I liked the baked potato enough so I didn't bother to have it exchanged. Also, I had to flag down the waiter a few times to remind him to bring/refill my gf's iced tea. He keeps on forgetting. I guess I can't blame him for serving a huge group on a graveyard shift.\n\nOther than that, I believe America is an ok place. It's not a fine dining establishment but I am somewhat surprised with all the one-two star ratings.\n\nI must be missing something."
        }, 
        {
            "index": 203, 
            "rating": 4, 
            "review": "We had a hearty hangover breakfast here. We both had steak and eggs, with hashbrowns. I had coffee, he had orange juice. The steaks were tasty but just a bit over cooked (we asked for medium rare and got medium, which was fine). 4/5 stars. \n\nThe morning after we got coffee and donuts. 5/5... Cinnamon sugar cronut was heavenly. Boston cream donut, delicious. \n\nService was slower that I would have liked, but not terrible. 4/5 stars.\n\nGigantic America on the ceiling was fun to look at.  We spent awhile discussing what it was made of. Styrofoam? Concrete? Paper mache?\n\nOverall pretty good. I would go back after a night of heavy drinking for breakfast steak and eggs!"
        }, 
        {
            "index": 204, 
            "rating": 1, 
            "review": "I am a proud american and do love this country so it brings my heart to have to say this but America Sucks! The restaraunt that is. Its loacted inside of new york new york from the outside you'd think it would be really good, a great place to have a hearty \"american\" meal you can but it is going to cost you 20 dollars for that meal. There a few items on the menu less than 10 dollars that don't provide a lot of food, what they do have though is all you can eat pancakes for 6.95. Now I can eat me some cakes so I decided to get this. You get your first plate of two nice bigs pancakes which are really thick, but beyond dry. Added a side of bacon which was 4 dollars for 3 strips and a coffee which was 3. The wait staff was rude and not very attentive at all. So stay away!"
        }, 
        {
            "index": 205, 
            "rating": 3, 
            "review": "This review is for the pool side food service that gets the food from America, according to the receipt.\n\nWe didn't eat breakfast and we went straight to our spa services which lasted for a few hours so by the time we got to the pool, it was around 2pm and we were starving.  Thank goodness for the not-so-friendly waitress walking around.\n\nQuesadilla - A little oily but not too bad.  It would have been better probably if we ate it at the restaurant so I'm not complaining too much.  The salsa was decent and the filling was significant.  Definitely an American style quesadilla.   Would try it again.\n\nBurger/Fries - Cooked MR and dressed appropriately.  It was a decent burger with no frills at all.  Definitely a $6 burger per Carl's Jr.   The fries were okay but I can't expect too much from pool side service fries.  \n\nNot bad but not great.   If service lady was a little nicer, it would have been a lot tastier I presume.  Who knows.  Anyway, I lived a little dangerously and went swimming 29 minutes after I ate."
        }, 
        {
            "index": 206, 
            "rating": 3, 
            "review": "This place literally screams out America.\n\nGinormous donuts/cronuts out front. Steak/ Meaty meals w/ late hour deals. Not to forget the option of adding protein to your smoothies.\n\nThis place isn't bad after coming back to the hotel at 3 in the morning and craving some cheap ribeye. \n\nThe steak benedict was like a cute steak sandwich covered with strong hollandaise sauce. If you like salty, its definitely the right thing for you. But I really wanted to wipe off all the hollandaise sauce so I can just have a steak slider. \n\nThe bacon on the other hand was some of the best I've ever had. It's better to just go simple here if you're craving a quick breakfast. Save your money for the rest of the casino."
        }, 
        {
            "index": 207, 
            "rating": 3, 
            "review": "Very cool interior. Not impressed with the donuts, they were very dry. Breakfast food was ok. Big portions, nothing extraordinary. The staff is very friendly."
        }, 
        {
            "index": 208, 
            "rating": 4, 
            "review": "Excellent place for breakfast and good value for money too. Absolutely no complaints."
        }, 
        {
            "index": 209, 
            "rating": 3, 
            "review": "For late night diner type fare after a long night in high heels at the club, this place is the old reliable.  If you don't feel like \"Moons Over My Hammie\" at Denny's, this place won't disappoint.  I've found myself here more than once in all my trips to Vegas.  \n\nThe service is usually friendly and fast.  The food is alright, but it's hard to find gourmet at 2 am."
        }, 
        {
            "index": 210, 
            "rating": 2, 
            "review": "hmmmm..  i dont think i should have expected too much, it was kind of like Zippys in Hawaii minus all the local food. The restaurant being in New York New York, I might have thought that all the restaurants are 5 star.. but perhaps i was wrong.\n\nDont get me wrong, if you just got up and need a bite to eat, America is probably the perfect place, they serve you breakfast and coffee.. what more do you need..\nHowever being in vegas and all... perhaps i should have stuck to brunch at a 5 star restaurant!"
        }, 
        {
            "index": 211, 
            "rating": 4, 
            "review": "While I didn't eat much here, I accompanied a friend who had just arrived in Vegas and snacked on a few of her fries. The fries, which were more like jojos, were delicious!\n\nBut the best part about this spot is that it was one of the few quiet places on the Strip to just sit back and enjoy talking to a friend. Nothing fancy but perfect for what we needed that night."
        }, 
        {
            "index": 212, 
            "rating": 2, 
            "review": "The food was mediocre! If someone asked for a place to eat in Vegas I probably wouldn't recommend this place unless you don't mind bland food and semi ok service."
        }, 
        {
            "index": 213, 
            "rating": 5, 
            "review": "They have a 14.99 steak special before 7pm. Not bad for the price and the steak was pretty damn good. I had it medium rare with a side of a1 sauce. There breakfast is yummy too as well. Waitress are attentive to our table and food comes out fast. Prices are fair i'd definitely come back again next time I visit Vegas."
        }, 
        {
            "index": 214, 
            "rating": 4, 
            "review": "I have to vote for that macaroni-and-cheese - woo! Our waiter was absolutely attentive, courteous and helpful. He impressed me.\n\nAmerica was the only restaurant we could find open that late at night, and I was glad to find someplace good. This is a diner two or three notches above a typical diner, but still with a diner feel and prices."
        }, 
        {
            "index": 215, 
            "rating": 2, 
            "review": "Well, there's not really much I can say about this place.  I came here with my friend for a late night eat.  We both ordered their $8.99 late night steak special.  Granted, at 1:30am with a empty stomach, the bland steaks did their job.  Probably won't eat here again though.  The menu didn't really appeal to me."
        }, 
        {
            "index": 216, 
            "rating": 1, 
            "review": "-Do you like mediocre food?  \n-Do you like crummy service?  \n-Do you like high prices?  \n\nWhat?  You don't?  Are you a terrorist?  Why do you hate America?\n\nThis establishment is just not a good place to choose to eat at.  Their food tastes like cafeteria food.  It is home of the \"Worst Country Fried Steak\" in the United States.  Now they won't openly advertise that, but I sure will....\n\nAvoid..."
        }, 
        {
            "index": 217, 
            "rating": 3, 
            "review": "I ate here on a previous trip to Vegas, but really didn't remember much about it. I found myself in there again a couple weeks ago. It was late, we were drunk, my companion wanted breakfast, and Denny's seemed a million miles away. There's nothing really special about this place unless you're into craning your neck to look at the giant map. Our server wasn't exceptionally friendly, but he wasn't bad either. He did seem quite disappointed when we didn't order drinks, though. You can't really go wrong with pancakes and omelets. . . so there's not much that can be said about the food. The only really negative thing that can be said is that our food came out incomplete. My toast was missing and my friend didn't have any butter or syrup for his pancakes. \n\nOh, and there is a full bar. . . despite what the majority are saying in the survey. Apparently the people who voted for \"none\" on alcohol were wearing blind folds as they were walking in. ;)"
        }, 
        {
            "index": 218, 
            "rating": 4, 
            "review": "I found a place that is health and serves affordable breakfast! I got the seasonal veggies and hash browns with which I made a scramble. Not overly salted either.\n\nThe decor is cheesy Americana but I like it! Interesting to look at the 50 states piece while you enjoy a meal (:"
        }, 
        {
            "index": 219, 
            "rating": 5, 
            "review": "Very tasty breakfast. Ham and broccoli omelet with wheat toast and hash brown was more than filling. My husband said his steak and eggs was perfectly seasoned. Great prices especially for being on the Strip"
        }, 
        {
            "index": 220, 
            "rating": 4, 
            "review": "We came here on Sunday night for the Rib Eye special and were pleasantly suprised. The steak was cooked perfectly and all the food was seasoned well. Our drinks were also tasty and reasonably priced. \n\nAlso, love the decor, it is a nice spacious restaurant and it is very nicely decorated. If we ever find ourselves in Vegas again, we will definitely check this place out again!"
        }, 
        {
            "index": 221, 
            "rating": 4, 
            "review": "Great 24 hour restaurant. Came for breakfast and left satisfied. I had their eggs Benedict and it was fabulous. The gashed browns that came with it were perfectly cooked - crunchy on the outside and tender on the inside. It also came with a mini banana nut muffin. Surprise! It comes filled with caramel. Nice to know a 24 hour restaurant can be so good."
        }, 
        {
            "index": 222, 
            "rating": 1, 
            "review": "please do not eat here!! seriously it's not good. service is slow, food is horrible and the prices are very high for the quality. I'm pretty sure I paid $8 bucks for a bowl of Campbell's chicken noodle soup."
        }, 
        {
            "index": 223, 
            "rating": 5, 
            "review": "Highly recommend this place for breakfast whenever in Las Vegas! Great food, reasonable prices and friendly staff.  The drinks are yummy and the yard glasses are fun to walk around with! Wish they had one in Phoenix!"
        }, 
        {
            "index": 224, 
            "rating": 4, 
            "review": "I don't know why this doesn't get better reviews, still a great breakfast especially considering the price.  My GF got one of their omelet creations and I got a Belgium waffle with strawberries, everything was very fresh and portions more than plentiful.  I think that the decor is a nice touch as well.\n\nDefinitely my fave breakfast joint in Vegas."
        }, 
        {
            "index": 225, 
            "rating": 1, 
            "review": "DO NOT EAT HERE!!! You will waste your money. This place is dreadful. My mom and I decided to eat here because we were staying at New York New York and we didn't want to walk the strip for breakfast and this was within the Hotel. We chose it because it was a traditional American breakfast and we were craving pancakes and french toast. Upon walking up the hostess was very rude. I asked if we could sit on the edge and not in the middle of the room, because we wanted a quieter spot than being smack in the middle of everyone. The hostess was rude and told us only one table was open and it was one in the middle. We sat and a few minutes later, low and behold, they started seating people on the edge, after I was told we couldn't have a table in those areas. Next, I ordered the croissant french toast. It was awful. Cold, hard, I couldn't even cut it with a fork. The french toast also had no flavor, very bland. My mom had the regular french toast, and her food was also pretty bad. Cold, no flavor and looked like her bread was smashed. It was so dreadful I called over a manager. The manager was a very nice lady. She apologized and comped our meal. The manager offered me to choose something different on the menu, but I honestly was so turned off by the whole experience I didn't even want to try anything else they had on their menu. The manager was nice and so was our waiter, other than that there is nothing good I can say about this place. Honestly, as a person who loves breakfast this is an honest review. I do not want people to waste their money here. There are so many yummy places to eat in Vegas, and the whole point of Vegas is to splurge and have fun. Skip this place and find something you will enjoy. :)"
        }, 
        {
            "index": 226, 
            "rating": 4, 
            "review": "We randomly came upon this place while walking thru New York New York. We decided to stop in for breakfast, the service and food were very good!  We had Chicken & Waffles with bourbon syrup, price was good and the taste was great!  Will make it a point to stop back by next time we are in LV!"
        }, 
        {
            "index": 227, 
            "rating": 4, 
            "review": "I know you'll think I'm crazy when I tell you that my 8 year old son and I went to Las Vegas. But, we did and we had a lot of fun.\nPart of the fun was going to America, a restaurant in the New York New York Hotel and Casino. It is in a quiet location, away from all the noise of the casino and the more boisterous tourists.\nThe service was very friendly, and the meal was great. We shared crab legs and steak, and we both walked away happy. And, the 3D map on the ceiling of the United States made for interesting conversation the whole time, too."
        }, 
        {
            "index": 228, 
            "rating": 4, 
            "review": "America is all about big portions of comfort food, served in a casual atmosphere 'round the clock.  It meets its goals.\n\nWe made a reservation and our table of four was seated immediately.  Our waiter, Rich, showed up right away and gave us a rundown of the alcohol menu.  I had a great cocktail and my friends shared a bottle of reasonably-priced wine.  \n\nWe were all pleased with our food.  We shared an order of edamame (dee-lish!) and a caprese salad (yum!).  The starters arrived promptly.\n\nFor my main course, the cobb salad did not disappoint.  The veggies were fresh and the bacon crisp.  It was a good cobb.  My sister had the cedar plank salmon, and it was perfectly cooked.  My friend had a salad with tuna, and she liked it.  My other friend devoured her cheeseburger in a matter of seconds, and had quite the smile on her face.\n\nThe four of us shared the hot-fudge brownie sundae for dessert.  Seriously THE BEST hot fudge brownie sundae I have ever tasted.  The brownie was moist, soft, chewy, with just a few nuts.  The fudge was thick and rich.  This sundae was AMAZING.  Just remember that the bottom of the ice cream dish is coated with hot fudge, so don't ignore the bottom of the bowl!\n\nI can't say enough about our waiter.  Rich is my newest crush.  Turns out he's so good at what he does that he's been promoted to bartender.  Plus, he looks like a young Kevin Bacon / Nick Nolte / Gary Busey (when he was young and handsome) hybrid, so we gave him a hard time all evening.\n\nWe enjoyed our dining experience here.  No frills, decent food, crazy portions and great service."
        }, 
        {
            "index": 229, 
            "rating": 3, 
            "review": "Yes this place is overpriced, yes this place is mediocre, and yes, this place in located in probably one of the worst hotels in Vegas (so sad because it was my favorite). However, they do have the ever so famous cronut, and I am now addicted. Having said that, I totally love this place!"
        }, 
        {
            "index": 230, 
            "rating": 4, 
            "review": "Great place for a late dinner or snack!!! I had a 16oz ribeye med rare and it was cooked prefect!! My friend had a tuna salad sandwich, I had a taste of that and its just like the deli I go to by my house!! Oh the chicken strips with the buffalo sauce is good too!"
        }, 
        {
            "index": 231, 
            "rating": 4, 
            "review": "The Cobb salad was really good. Loved the balsamic dressing. Ask for Daryl. Best waiter ever because he used to be a butler!!! He is finishing law school. Nice man."
        }, 
        {
            "index": 232, 
            "rating": 3, 
            "review": "Husband and I went here on 5/10/09 for breakfast.  We opted for the All-You-Can-Eat Pancakes for $6.95.  We loved the decor, which considered of those fun postcards for each state/city back-in-the-day and a huge map of the United states with mountains and fun things.  Our waiter was on top of things. Checked in on us appropriately.  The pancakes are huge and dense.  Neither of us were able to finish.  The manager even stopped by to see how everything was doing.  We asked how often it was that people would even go for seconds for the pancakes and she admitted herself that it was rare.  Pancakes good.  Coffee was expensive though, a cup for over $3! Yikes!"
        }, 
        {
            "index": 233, 
            "rating": 5, 
            "review": "Wonderful breakfasts and very friendly service!  They also make a huge variety of doughnuts, that are the best we've ever had."
        }, 
        {
            "index": 234, 
            "rating": 4, 
            "review": "Came in for breakfast, and had the corned beef and hash. While the poached eggs were over cooked...the rest was excellent. Fast and attentive wait staff, and interesting decor of the U.S."
        }, 
        {
            "index": 235, 
            "rating": 3, 
            "review": "Stopped by to eat with my wife and her nephew while staying at New York New York hotel and Casino.  We had walked past it a few times while either entering or leaving the hotel but it has closed the fire few times as it was after hours.  We came in to eat brunch, and the 3 of us were seated pretty quick.  Once seated my wife and her nephew went to use the restroom, and stayed behind.  Our server who took our drink order came back with only 2 sets of utensils instead of the 3.  We way looked at our menus (which I think were way too bland).\n\nAfter our orders were taken, the service got slow and I think if it wasn't for the 3 of us having our cell phones this wait would have been longer than we would have enjoyed...Thank you Interwebs!\n\nOur food finally had arrived and much like the menu, the taste was mediocre.  Nothing too way over the top to be memorable enough to be the best food ever and all.\n\nThe Donut stand was also mediocre.  Not that great tasting, but the options were still interesting."
        }, 
        {
            "index": 236, 
            "rating": 4, 
            "review": "We got to the hotel too early to check in so we decided to eat breakfast here. I asked about the corned beef hash and our waiter said it was his favorite so I ordered it. It was great. Very fresh amd a healthy portion. Could have had more veggies - my only complaint.  I would highly recommend  this place."
        }, 
        {
            "index": 237, 
            "rating": 1, 
            "review": "Oh please!  Why in the world did we come here?  There are so many great places to eat on the Las Vegas Strip and we ended up here??  I expected so much more from a restaurant in the New York New York casino...  never again!\n\nWe came for breakfast, not sure what the other food is like but maybe that's what keeps them going.  When we arrived, the bored, angry looking hostess looked at the four of us standing there (only people for miles) and said \"Two?\"  Lame!!  When I said four she gave a heavy sigh and rolled her eyes because she had to take one step backwards to grab two more menus!  Holy moly, we should have turned around right then and there!\n\nOur waitress was no better although at least she kind of maybe almost smiled once!  She too was tired and droopy and acted like it was a real chore to take our orders.  It's not like she did anything else so I'm not sure why she was so tired!\n\nThe food was absolutely horrible!  I got the ABC Omelet and it was dry with very chewy bacon bits, just a little avocado and no cheese to be found.  The hashbrowns were ridiculous to say the least and burnt just as bad as the toast.  My husbands Eggs Benedict was the biggest joke!!  There were no egg whites to speak of and the teaspoon of hollandaise sauce on each egg was pathetic.  His hashbrowns were a little better than mine but still, way over done and dry.  My daughter got the Red Velvet Pancakes and barely ate 1/3 of them!  They were dry no matter how much syrup she put on them (not sure how that happens) and basically just made your mouth stick together so you couldn't take another bite without taking a drink of something.\n\nSomething needs to be done about this place, seriously!  With such bad service and bad food it's hard to believe something hasn't been done already.  If you're smart, you'll either go somewhere else or grab donuts and coffee at the entrance and turn around and walk away!"
        }, 
        {
            "index": 238, 
            "rating": 2, 
            "review": "Poor service. In what other breakfast place do they seat you, then you wait for the waitress to show up 10 minutes later and then ask if you want coffee?  When the coffee comes 10 minutes later, it is weak.  I wished went to Denny's instead.  The food mind have not been any better but I'll bet the service would have been faster and the cost 1/3 of what we paid."
        }, 
        {
            "index": 239, 
            "rating": 1, 
            "review": "I took the family for Easter dinner and was very disappointed!  The service was very slow and somewhat rude. I had a chicken parm and it was very mediocre. The chicken breast was over-breaded and very thin and the pasta was so over cooked it was one big lump.  Other reviews talk of the big map\nbut when they seat you in the back next to the kitchen you aren't so impressed.  Of all the places in Vegas I have been this one is on the bottom of the list."
        }, 
        {
            "index": 240, 
            "rating": 3, 
            "review": "The America Café is located in the New York New York Hotel & Casino and is the only restaurant in the hotel that never closes.  It offers an extensive variety of diner/bar food that includes appetizers, salads, sandwiches, pastas, limited entrées, and a few breakfast items.  It has a big dining room with a large bar and the décor is unremarkable except for the huge map of the USA on its ceiling.\n \nMy wife and I stopped there around midnight after a late show for a light bite.  The place had few patrons and we sat at the bar.  Our female bartender was amicable and poured each of us a good drink.  My wife and I shared a triple-decker club sandwich and a side of French fries.  The sandwich was tasty and the fries were hot and flavorful.  The food and drinks hit the spot and nicely satisfied our late hour cravings. \n\nThe America Café is recommended for providing a convenient, simple meal at a late hour."
        }, 
        {
            "index": 241, 
            "rating": 5, 
            "review": "My wife and I had breakfast here on our stay in Vegas. Service was really good and the food was on point. Got the steak and eggs and I will definitely go back for it again! Its a solid spot for a meal and they have a cool map hanging above all tables. They also have a donut shop right when you come in but after eating a big meal, we had to pass on the donuts but will shoot for it next time! Good place!"
        }, 
        {
            "index": 242, 
            "rating": 4, 
            "review": "Food was plentiful!  The $7.95 all you can eat pancakes are three large to start and very good.   I had the breakfast bagel sandwich.  It was huge and had huge serving of hash browns.  Could have easily split meal with someone.  Kids pancakes are three fairly good sized as well. My kids only ate 1/2 and cold have easily split as well."
        }, 
        {
            "index": 243, 
            "rating": 2, 
            "review": "Low quality ingredients. Basic concept dishes. Nothing exciting but works in a pinch late at night."
        }, 
        {
            "index": 244, 
            "rating": 3, 
            "review": "Only my second time inside New York, New York, and right around dinnertime after riding the roller coaster. Seeing the restaurant America, we decided to give it a try with the cool huge map of the USA overhead.\n\nI ordered the Fish and Chips which was decent, while my wife had the Caesar Salad. But nothing was beyond average. Friendly wait staff but somewhat slow, with the place less then half full. We even ordered the Hot Fudge Brownie Sundae, on the recommendation of the manager who stopped by our table to check on us. The Brownie was way too gooey and gummy, and between the two of us sharing, way too much. On her return pass by, the manager greeted us again with the words, \"Isn't that just the best dessert you've ever had?\" Fortunately, she kept on walking past us because our response would have been NO!\n\nMaybe we'll give they're breakfast a try on a future visit, dinner was just ok average."
        }, 
        {
            "index": 245, 
            "rating": 3, 
            "review": "It's just kinda there and convenient, especially if you're staying at NY NY or if you're around at ungodly hours (which I suppose could be any hour in Vegas). Better than Denny's. I had a pretty good Turkey Reuben here. Came back for an okay omelette breakfast the next day, OJ is freshly squeezed here. Awesome giant map of America sculpture (can't miss it). And they have a bar--bonus!"
        }, 
        {
            "index": 246, 
            "rating": 3, 
            "review": "Cheap breakfast that felt like it should have been fast.  Except it wasn't, at all.  Worst service that I have encountered in quite some time, which is impressive if you read my reviews frequently since I am a fucking fly trap for piss poor service.\n\nOur food was FINE. It's basically IHOP with a better menu and a pretty low penalty cost for substitution.  \n\nThis place is huge though, so even with a line, you'll be seated within 10 minutes at almost any hour."
        }, 
        {
            "index": 247, 
            "rating": 3, 
            "review": "Typical diner food; not bad by any means but just an alternative to Denny's and the like. Grown up grilled cheese was good. The bakery in the front is the best part; the Cronut is definitely worth treating yourself to!"
        }, 
        {
            "index": 248, 
            "rating": 4, 
            "review": "The place is perfect for families looking for a fun place to eat on a budget. The food was great for the price and it had a great atmosphere. The staff was very attentive, kind, and friendly and that's all I ask for.\n\nThe restaurant doesn't WOW you strictly by the food, but overall it's a great place for a casual dinner in the New York, New York hotel. I would suggest this place to friends!"
        }, 
        {
            "index": 249, 
            "rating": 1, 
            "review": "On our last night in Vegas, we decided to have one last meal.  On our way back to our hotel (Excalibur) we passed through the NYNY.  Did a search on the restaurants in NYNY and found that America was the only non bar open at that time (1 am).  Menu looked decent, certainly appeared to be better than McDonalds.  Hostess was nice, we were seated right away.  Waiter comes and takes our order, and then we wait.  And wait.  And wait.  45 minutes passes, no food, and I haven't seen our waiter in at least 25 min.  I flag down the hostess, who says she will find out what is going on.  About 3 min later I see our waiter saunter in from out of the restaurant.  He goes to the back, and surprise surprise, our food is ready!\n\nI had ordered a burger, my wife the night's special, a sirloin steak, medium well.  The steak was burned to a crisp, definitely medium well.  My burger, while it did not appear burnt, tasted burnt.  The bun was soggy as well.  Not what we expected after waiting 45 min.  We contacted the manager who was very apologetic, and offered to get us some cold sandwiches from the menu.  We declined and he did not ask us to pay for the meals.  He said that he would be talking to the cook about it.\n\nWe will not be going into this restaurant on our next Vegas trip.  Seriously, you are better off going to Denny's or McDonalds if you are hungry late at night."
        }, 
        {
            "index": 250, 
            "rating": 3, 
            "review": "$12.95 ribeye from midnight to 5am!  I love my deals and I thought the ribeye was great for the price.  I came here late at night for dinner and shared the ribeye and chicken wings.  \n\nI surprisingly loved both.  The chicken wings were tender and of great flavor.  The 16 oz ribeye was pretty juicy and quite delicious!  Our waitress was really kind and attentive to our table.  I'd definitely come back here again for lunch/dinner or even late night grub."
        }, 
        {
            "index": 251, 
            "rating": 2, 
            "review": "Although this restaurant is open 24/7 and has decent food, i'm going to have to knock it.\n\nService was TERRIBLE and there were hardly any diners in the place.  It was far from crowded.  We asked our server for more water and a few lemons, and he forgot both, even after we reminded him.  We had to help ourselves from the lemons at the bar- LAME.  Then he made some comment like, \"I could have brought those to your table, you know,\" full of attitude.  \n\nWhen we finally got our bills (he also had major 'tude with giving us individual tabs), he had given us all of our change in quarters.  Some of us had more change than necessary and some of us were short-changed.  NONE of us had the correct change.  At this point I lost it and proceeded to go pretty much ape sh*t on our 45 year old server with a comb-over.  \"Excuse me, look- all of our change is completely um, how do i say this, NOT RIGHT. AT ALL.\"  He gives me a blank stare and then shrugs it off: \"Sorry, we don't have any other coins except quarters here.  We give change in quarters.\" Then he smiles sweetly and says, \"Would you like to speak to the manager, miss?\"  the rest is pretty ugly from there.\n\nNow, let me clear that i am not expecting the world's greatest meal OR service from America the restaurant inside a Vegas casino.  However, I do expect to get what i pay for and that includes getting the correct change back, NOT IN JUST QUARTERS. \n\nAs far as this restaurant goes, it's America the Shitty, and I would rather just roll to any other hotel's 24/7 cafe to eat.  They all have one.\n\nThe club sandwich was good though...Meh."
        }, 
        {
            "index": 252, 
            "rating": 3, 
            "review": "Yummy banana pancakes.  \n\nService is okay, the place is clean and convenient when you re staying at NY NY"
        }, 
        {
            "index": 253, 
            "rating": 3, 
            "review": "Had the chocolate chip pancakes as big as my HEAD! So good. Trust me, you do not even need syrup for these pancakes, but they are sweet enough with all of those chocolate chips. Had a side of bacon, but I hate it when my bacon is still \"oinking,\" so I asked for it to be well done. It was still undercooked for my tasted and it gave me a few snorts. Didn't dare to ask for them to throw it on the grill b/c the kitchen was a marathon away from our table and service was just a little slow. Slow, but very nice and appreciative that we were there. I give that a two thumbs up."
        }, 
        {
            "index": 254, 
            "rating": 4, 
            "review": "Jesus man. Finding a 24 hour cafe like in  a casino is like pulling teeth! But of course NYNY does not disappoint and we finally found America to curve our 3am cravings. I must say the prices were pretty good for Vegas too. They have a really cool large map sculpture of the United States on the ceiling. I had the Empire State Plate which is a breakfast plate with two eggs, hashbrowns, sausage, and toast. Everything was cooked just right. It was really good!!! My husband got a hamburger that he felt was just average. We had a great waiter who was kind and he always made sure we had what we needed. The only things that was slightly annoying was that the place was pretty dead and it took forever to get our food! I don't know what the hold up was considering there as not alot of other people in the restaurant. That is why I am deducting a star. Other than that is was a great place for late night eats with good competitive prices. I will go back."
        }, 
        {
            "index": 255, 
            "rating": 5, 
            "review": "What an awesome place to eat. Decently priced for a casino based restaurant. Food choices are kind of limited but still a good meal for the buck. Service was also very good and food got out quickly. I highly recommend it as a place to eat"
        }, 
        {
            "index": 256, 
            "rating": 5, 
            "review": "Amazing!!!!  Love this place. Great food and even better service.  Jenna, best bartender ever, is so kind, patient and accommodating as is all the staff at this restaurant.  The manager, Kelsey, was also very accommodating as she honored my order even though I made a huge mistake in the time it was being offered (their rib eye steak dinner).  \n\nI didn't stay at NYNY this trip but I will definitely stay there next time I visit Vegas just because the staff is so amazing.  There is much to be said of a company that hires and trains their employees to go above and beyond with their customers, even when the customer is wrong."
        }, 
        {
            "index": 257, 
            "rating": 1, 
            "review": "Servive was great, food was way overpriced, and below mediocre.  Coffee was $3.75 and blah.  Will not return."
        }, 
        {
            "index": 258, 
            "rating": 4, 
            "review": "Great service, nice large restaurant and bar area, and good food.\nMy cousin ordered his usual chicken fettucini alfredo. My boyfriend and I split the fish and chips. The ranch for fries and tarter sauce for fish, were on point. The beer was cold, and I'd return if staying at NYNY again."
        }, 
        {
            "index": 259, 
            "rating": 1, 
            "review": "It was 2am and I was too tried to leave the hotel. The server was really nice. He told us about the \"special\" (12 oz ribeye with mashed potatoes and veggies). It was the thinnest steak I've ever seen. It was extremely chewy. I could only take 4-5 bites and that was covered in A1. Ick. I still regret it this morning because I can remember how terrible it was. It was not steak. It was \"steak.\""
        }, 
        {
            "index": 260, 
            "rating": 4, 
            "review": "(Note, there are two listings for this same restaurant on Yelp - the other is listed as \"America Restaurant\" http://www.yelp.com/biz/america-restaurant-las-vegas-2#hrid:Jf3KrDuLYfIVeMXPEYZKEw/)\n\nItems sampled:\nCoffee\nFrosted Flake French Toast\nMonte Cristo - Black Forest Ham, Sliced Turkey, Gouda, Brioche\nApple Fritter\nBoston Cream - Chocolate Iced, Custard Cream Filled\nMonkey-See Monkey-Donut - Bananas Foster-Filled with Chocolate Icing, Toasted Nuts\nNutella Cronut\nCandy Cake - Chocolate Cake Donut, White Sprinkles, Chopped Reese's Peanut Butter Cups\n\nProbably not the first place on most Las Vegas gourmand agendas, the 24/7 \"America\" at New York-New York Casino had always interested me if only for its kitschy design plus one of the city's few Monte Cristo sandwiches, but it was not until I heard about the restaurant's in-house donut program that I finally committed to an early morning visit; the expansive restaurant largely unoccupied as servers joked around at the bar while \"American\" Top-40 played from speakers hidden by the enormous map of the good ol' USA.  Featuring a menu of expectedly American classics ranging from pancakes and waffles to country fried steaks and eggs it was with a bit of disdain that I arrived to find the Monte Cristo now relegated to the 'lunch' menu but happy to accommodate given the restaurant's 24-hour nature it was with a simple request that the sandwich was prepared and arriving on a covered plate alongside the Frosted Flake French Toast both dishes would prove competent , though nothing to write home about, with prices and portions both in line with other Las Vegas Boulevard breakfast joints thus leaving plenty of stomach space for a sampling of the restaurant's deep fried dough.  Featuring no less than a dozen different varieties with three cronuts plus fritters, crullers, filled, raised, cake, and fancy on display it was with a bit of indecision that I pondered my options and eventually settling on a few personal favorites plus those most interesting a quintet was selected at a total of $12.50 and aside from the lackluster, artificial banana flavor of \"Monkey See, Monkey Do-nut\" the results were very impressive indeed; the 'cronut' as close to Dominique Ansel's original in texture as I've found (a plus for those seeking authenticity, though I still prefer Coco's rendition to both,) the Boston Cream featuring surprising subtle custard inside a delicate yeasty pocket, and the apple fritter rife with fresh fruit beneath a delicate sugar crunch plus plenty of cinnamon rivaling some of the finest I've ever sampled; the best in Las Vegas by far."
        }, 
        {
            "index": 261, 
            "rating": 4, 
            "review": "Fantastic place for breakfast! They cook your food to order and their bloody Mary's are delicious. This place was everything we needed after staying up so late! I'd recommend the family farm eggs Benedict if you're trying to concur a hangover and take a nap afterwards. Yum!"
        }, 
        {
            "index": 262, 
            "rating": 3, 
            "review": "This is our second try on Christmas Day for breakfast. Last night, had late dinner. Overall, the restaurant is decent. We ordered over six adult entrees on each visit. The quality is inconsistent. From a rock hard bagel and ice cold dinner rolls to a great, seared rib eye and wonderful crab legs, we don't know what to think. The restaurant is huge on the inside which is deceiving because of the tiny entrance.  The wait staff are nice, but rarely checked on us.  They could be short staffed. The food took forever to arrive. For the price, there are better options on the strip."
        }, 
        {
            "index": 263, 
            "rating": 3, 
            "review": "Good Waitress and Fresh Jalapeno  Poppers made for a good experience.\nWe went in November, so unfortunately know I can not remember our waitresses name, but she was nice and knowledgeable.\n\nWe started with the Jalapeno poppers and it was nice to have them done the way they were originally intended, with fresh crispy peppers and not frozen from some bowling alley,\nWe shared the pork chop entree even thought it was only one.  She liked it and I thought it was just OK.\nOur nice lovely waitress whose name still escapes me, suggested a dessert instead of doughnuts and it was spot on.  I can't remember what the dessert was either.  Oh, did I mention that the drinks there were ok and flowing.  \nSorry for the gaps in the story, I would like to blame it on the booze, but its probably the on set of old age.  \nBah!"
        }, 
        {
            "index": 264, 
            "rating": 2, 
            "review": "Came here for breakfast on a Saturday. We got a table right away, that was the only fast thing about our meal. We waited probably close to an hour for our breakfast. I gobbled my meal up not because it was amazing but after that long wait- I was starving. In addition, the runner spilled the syrup on the pancakes and said he would be right back with fresh ones but never came back. The coffee was not tasty. I suggest you visit the host of other breakfast places in LV besides here."
        }, 
        {
            "index": 265, 
            "rating": 3, 
            "review": "I didn't love this place but then again, I didn't hate it. The husband and I were just walking around in NYNY trying to stay dry from the rain that weekend. We were hungry but not starving so we wanted to grab something quick to eat. We walked by the America Restaurant and the cronut's at the entrance basically welcomed us in. We were quickly offered a table to sit at. The place itself is interesting looking. There is a HUGE United States 3D map. Looks pretty cool and it is def something to stare at for a while. The restaurant is pretty big but to my surprise was pretty empty too. We decided to just order appetizers and our waiter took our order. We ordered the potato skins because it caught our attention being that it had chorrizo. Took quite some time before our order came out, too long for a place that was empty and for an appetizer. The potato skins were interesting and unfortunately a bit on the luke warm side rather than hot. It tasted like it had refried beans, chorizo and sour cream. The chorizo was pretty good and it made the plate worth it. The price was fair and service was alright. As far as going back, probably not. We decided to not get a cronut on the way out since the food was just ok, we didn't want to risk a disappointment. The restaurant is sort of like a diner so if you are looking for diner food, they have it here. I did see a couple next to us share a sandwich and fries and boy was that a large order."
        }, 
        {
            "index": 266, 
            "rating": 1, 
            "review": "If you want regular American food that tastes okay and is the same quality as Denny's, go here and pay 76 dollars for your meal.  All I ordered were chicken strips, a steak, and fried chicken.  And yes--it was 76 dollars. \n\nMediocre food doesn't deserve a good rating, and although edible and an interesting ambiance, it was not worth the money at all."
        }, 
        {
            "index": 267, 
            "rating": 2, 
            "review": "We had purchased tickets to see Zumanity and had to pick up the tickets at the box office one hour prior to showtime so we decided to grab dinner here. \n\nI went in prepared for some run of the mill, plain old, American food given that the name of the restaurant is AMERICA. We ordered steak with baked potatoes and grilled veggies. The grilled veggies were the highlight of my meal since the baked potato remained mostly undisturbed and my steak was salty. \n\nEveryone my age remembers where they were when Princess Diana died, when the Twin Towers fell and now where they were when they heard Bin Laden was killed... me?... I was watching coverage on Fox News while in an establishment called \"America\" inside a hotel called \"New York, New York\"!!!! TRUST ME... the irony of this was not lost on me... at all."
        }, 
        {
            "index": 268, 
            "rating": 5, 
            "review": "Albert was an exceptional waiter and bar tender!!! I would recommend anyone to have a late night snack and drink, great prices! Thanks Albert! :)"
        }, 
        {
            "index": 269, 
            "rating": 3, 
            "review": "Came here at 4am with the munchies. Their late night menu was showing on the electronic menu at the entrance and I decided on buffalo wings. You can order to-go at the bar. The bar was filled with security guys that probably got off their shifts and the bar tender this night was too busy flirting with them. We put our order in for buffalo wings but she said they weren't serving it right then, they only had the breakfast menu. We asked for the menu, she walked away back to the guys and we couldn't get her for another 5 mins. Finally ordered the foot long hot dog."
        }, 
        {
            "index": 270, 
            "rating": 1, 
            "review": "After walking around the strip with a 5 year old, we were starving and jumped into New York New York thinking that they had a nice cafe for lunch. Spotted America and thought it would be a good place to eat. The hostess seated us right away and even gave our daughter crayons and a place mat to draw on. It wasn't crowded. There were only 5 tables in use. There were 3 bus boys cleaning off tables. Oh wait! Make that two bus boys and one server cleaning off tables. We waited and waited and waited. After 15 minutes nobody came to even offer us water or something to drink. Really annoyed we got up and left. The hostess looked up surprised to see us leave and asked us what was wrong. We told her and she told another girl up front to get the manager, but we did not stay to see the fireworks. Took a cab back to Mandalay Bay and had a decent lunch at Raffles Cafe."
        }, 
        {
            "index": 271, 
            "rating": 3, 
            "review": "So, I notice that they have remodeled this place since last year. They added a ice cream parlor & donut shop and that's dessert on your way out the door. They always have great dinner and late night snack deals on a daily basis. It's open 24 hrs and I've always have good experiences here. Im a fan"
        }, 
        {
            "index": 272, 
            "rating": 1, 
            "review": "Mediocre food, bad service. At least our server was friendly, when he eventually came around. Wanted something quick, ended up with cold food that took too long to arrive."
        }, 
        {
            "index": 273, 
            "rating": 4, 
            "review": "Had a great lunch. Employees had a great sense of humor. Good service. Thank you to Ashley, Pepe and Kelly. We enjoyed our time in America."
        }, 
        {
            "index": 274, 
            "rating": 4, 
            "review": "The food was delicious, the service was perfect, & the restaurant is super cool. \n\nI had the (Deconstructed) Grilled Veggie Pita & the husband had the Monte Cristo. Both were absolutely delicious. The portions are spot on as well. Mine was just enough, while the husband ended up eating only half (it's a big sandwich).\n\nStarted with the Mozzarella & zucchini sticks. Very good!"
        }, 
        {
            "index": 275, 
            "rating": 3, 
            "review": "Open late for all the club stragglers. Nothing else was open, so we came across this place. Inexpensive steak and potato dinner and was pretty fulfilling. Worth what ya pay for. I mean I wouldn't go here if I had other options but it's not that bad for a Denny's-type restaurant."
        }, 
        {
            "index": 276, 
            "rating": 1, 
            "review": "The only reason I'm giving this restaurant one star is because of our waitress who went out of her way to make my mother's meal free. Other than that, I regret having ever ate at this place. Sure the big map of America is nice to look at, but out of the four of us only my boyfriend's mother liked her food...and she got mac & cheese which is hard to mess up. It took about 45 minutes for our food to come out and when it did it was luke warm. I got the buffalo chicken sandwich and it was gross and dry. I asked for more buffalo sauce and they brought me out a bowl of tasteless sauce that had been watered down one too many times. I definitely learned from my mistake and will not be returning here by choice."
        }, 
        {
            "index": 277, 
            "rating": 3, 
            "review": "Had a early morning breakfast with the family after waking up too early due to Jetlag. A decent breakfast where everyone of us managed to get more than full."
        }, 
        {
            "index": 278, 
            "rating": 5, 
            "review": "Skip the buffets and come here for breakfast! Delicious and reasonably priced! Eggs are fluffy (and REAL, unlike the buffets' powdered egg stuff), and the food's like homemade. Generous portions and friendly service too!"
        }, 
        {
            "index": 279, 
            "rating": 3, 
            "review": "Food here is expensive and not very good. It's a nice place to sit and sober up though which is why I give it 3 stars."
        }, 
        {
            "index": 280, 
            "rating": 2, 
            "review": "I thought this was just an ok restaurant.\n\nWe were staying at NYNY and decided to eat at America's (after much \"discussion\" among eleven people). Because of the time of day we arrived, we were given the breakfast menu.\n\nThe menu seemed like your typical diner food. The only disappointing thing is that they don't offer combo dishes. I ordered the cinnamon apple waffle but if I wanted it with a side of eggs and bacon, it was an additional charge (like $4 for each item!). But maybe I'm just used to the Dennys and IHOPs and whatnot.\n\nServers were polite but it took a while for our meals come out. We were told that they wanted to bring everyone's meal out at the same time (keep in mind we had eleven people). Unfortunately some meals weren't as warm as others.\n\nDespite that, food was ok. Everyone in the party seemed satisfied. The bagel and lox seemed like a popular dish amongst us.\n\nThe best thing about this experience: it was comped. Thank goodness for the gamblers in the group."
        }, 
        {
            "index": 281, 
            "rating": 3, 
            "review": "Food is basic American with decent portion sizes.  Decor is interesting although the place has been open for quite awhile now.  Food just decent, nothing special."
        }, 
        {
            "index": 282, 
            "rating": 2, 
            "review": "Came here for my cousin to get a cronut and for me to try some sort of fun, new donut. She wanted the chocolate cronut, but the man before us got the last one so she ended up with original. She hates lemon flavored a stuff, but sure enough, the glaze had a citrus tang to it. It also felt a bit dry in the mouth. \nI read that the Bavarian cream donuts were yummy on yelp so I was ready to get that. \n\nOnce I was there I saw several cream filled LOOKING donuts and asked the cashier how they were all different. She gave me a HORRIBLE answer. \"Umm, They're pretty much all the same.\" Me: \"So what's the difference between the donut labeled 'Bavarian Cream' and the one with the dollop of cream on top?\" Cashier \"That they  look different.\" I tried to laugh a little to ease the awkward rudeness and got the cute and supposedly cream filled donut. *insert annoying buzzer sound here* It wasn't filled! It was just the little dollop on top! \n\nThough the cream was delicious (as I read on yelp), the DOUGH of the DOUGHnut was dry as heck! I was very disappointed. And the customer service didn't help at all."
        }, 
        {
            "index": 283, 
            "rating": 2, 
            "review": "The best part of this restaurant was the awesome decor! There was a massive replica of the United States which was fun to look at! Other than that the food was sub-par. Our table ordered chicken noodle soup (which was good), a burger (that was overcooked, chicken tenders (that were more like chewy chicken nuggets), and biscuits and gravy that were okay but were luke warm. The service was bad. The location and lack of a wait time where a plus but we obviously know why there wasnt a wait time."
        }, 
        {
            "index": 284, 
            "rating": 4, 
            "review": "We came here two times during our stay.  Once when I was told that I had wait an hour to check in and the second time for breakfast.  For lunch we had a sampler platter and it was pretty good.  It had potato skins, chicken wings, quesadilla, and mozzarella triangles.  When we came for breakfast the next morning we had bacon, avocado omelets with hash browns.  WOW!!!  That omelet was one of the best I have ever had...and the hash browns were nice and crunchy!\n\nThe service that we received both times was great.  The decor of this restaurant is really unique with a huge map of the U.S. hanging up and matching tables and booths.  They also decorated for Christmas and it looked really nice.  Overall, a good experience on both my visits and I will be back again for sure!"
        }, 
        {
            "index": 285, 
            "rating": 4, 
            "review": "I came here twice, once for breakfast and the same night for dinner.\n\nI loved my breakfast. The service here is very very pleasant, they are a bit slow however, happened both morning and night. I had eggs, hashbrowns, toast and orange juice. I ate everything and found it delicious. My bf was not a fan of the stuffed french toast however. \n\nI came back for dinner because at breakfast I saw they have a $15 steak and crab leg dinner. The dinner was good for $15. It came with a baked potatoe, salad or soup and bread. The steak was average but good enough for the price. The crab legs were pretty decent not the best but good. The potato was great. The salad was average. The bread was amusing. We didnt get it right away and we asked the waitress about it and she said she doesnt bring it out unless someone asks for it because she figures it is enough food and we wont need it. Ummm, yeah give me my bread. The bread wasnt very good but my bf ate it to spite the waitress haha. \n\nDinner was cheaper than breakfast strangely."
        }, 
        {
            "index": 286, 
            "rating": 2, 
            "review": "Service wasn't that great. My friend ordered bacon with her breakfast and was charged for it, but got no bacon. After finally flagging down our waitress (the place wasn't busy at all), she adjusted it and even took off the required gratuity for our party of 8. That was pretty nice I guess.\n\nThe food was less than mediocre. Less tasty than your typical Denny's or IHOP.\n\nI believe this is the same place where NYNY's room service comes from...based on the similarity in menus and presentation. The food is acceptable when it's the middle of the night and you don't want to get out of bed, but if you're looking for a place to have lunch or dinner...go elsewhere.\n\nOne star for the very cool ginormous map of the USA that I wish I got a picture of!"
        }, 
        {
            "index": 287, 
            "rating": 4, 
            "review": "All around a good experience, service great, food very good, but nothing out of the ordinary. Still looking for places that are a 5- extraordinary, something to tell everyone about, etc... But when you get what you order in a timely manner and it tastes good, it's a 4..."
        }, 
        {
            "index": 288, 
            "rating": 3, 
            "review": "During my stay on Vegas I came here three time and in all honesty it was because I was too lazy to walk out of the hotel since it was cold.\n\n1st time - breakfast, overall it was descent price but the quality of food was ok.\n\n2nd time - late dinner, decent price for food and the steak was actually yummy and better than ok.\n\n3rd time - they hosted the Super Bowl party loved the bottomless drinks but was sick as a dog that I couldn't enjoy the drinking and the finger/game food they had sucked. Totally, not worth the cost we paid.\n\nFYI - I'd compare this place to something like Denny's."
        }, 
        {
            "index": 289, 
            "rating": 3, 
            "review": "It was the only decently quiet location in NY NY on a Thursday night at 1230 am, so it was exactly what I needed. I had two vodka sodas, and a turkey burger with fries. It was definitely edible, not the best thing known to man, but it served my needs at the time (returning from a flight and hungry)."
        }, 
        {
            "index": 290, 
            "rating": 3, 
            "review": "im thinking 3 stars for this place.   portions were huge, but nothing that was super delish... server was as expected for the atmosphere of the restaurant... we can keep this one short but sweet... I would return.. but definitely not on my list of a must return."
        }, 
        {
            "index": 291, 
            "rating": 5, 
            "review": "been coming here for 16 years.  Great food huge portions great staff.   Had a reunion there and all our meals were great had good drinks lots of laughs and they all said they were glad I took them there. One of the last remaining 24 hr cafe's on the strip and with  good prices."
        }, 
        {
            "index": 292, 
            "rating": 2, 
            "review": "The environment is good but the food is a bit disappointing. The steak is too small for its price. The pasta is really a mass, can't finish even a half."
        }, 
        {
            "index": 293, 
            "rating": 2, 
            "review": "A group of us [More than 25 people ] were looking for somethings that would accommodate everybody's budget. America's was suggested by one who lived in Las Vegas. The restaurant managed complied with the group , accommodating us in 2 large tables which was nice. We were in the back of the restaurant so we were secluded from the Casino and noise. \n\nThe service was a little slow , considering that were served by 3 people servers so the food was coming in a slow pace. However the food was preorder as shared plates , so they knew will ahead of the quantity and type of food. \n\nFood:\n\nAppetizers:\n\nPotato Fries - Garden Salads - Mozzarella fried Cheese.. Fried Chicken wings.. Noting spectacular. I would have expected more from a restaurant hotel. but but looking through the dated decor of the hotel in general and the restaurant in particular , I wasn't excepting much.\n\nMain Dishes: Salmon topped with a slab of Ketchup - Fried spaghetti and Lab chunks -- Again .. Oily and loaded with Salt.. Salmon with Ketchup === Seriously [ Not even a sauce from a can ] \n\nDesserts : Hard as a rock, brownies , Chocolate chip cakes- Cheesecakes  and fried small apple fritters.. Again .. Not Dessert worthy\n\nHigh Notes: Cheap !!! If you don't want a burger at night, go there, but I can guarantee that you will be more happy and satisfied with a burger from Mcdonalds than eating at this diner.\n\nLow notes: Risk Factor for High Blood Pressure"
        }, 
        {
            "index": 294, 
            "rating": 1, 
            "review": "I went for breakfast, and although the servers are perfectly friendly and helpful, the food was lukewarm, overpriced, and far from delicious. Honestly, if you're looking for diner food, you'll do much better at Dennys. I did."
        }, 
        {
            "index": 295, 
            "rating": 5, 
            "review": "No doubt about this place being a 50 star restaurant I love the whole 24 hour everything breakfast by far the best in las Vegas located in the new York new York hotel and casino very friendly staff"
        }, 
        {
            "index": 296, 
            "rating": 5, 
            "review": "We stay at NYNY when we come to Vegas. We have come to see George Strait for years now.\n\nThis is how America went above and beyond..\n\nWe came down from our room to meet the folks we were going to the George Strait concert with.\n\nWe had our hugs as our friends completed their meal.\n\nOff to the concert we go! My husband and I walked this trek to T Mobile Arena earlier in the day to get there fast.\n\nWell..we get to the gate and I realize I may have set our tickets maybe at America..last place we were at and I did indeed take the tickets out of my purse but totally thought I put them back in my purse..umm NO\n\nI go running back the fast way we can as our friends were in line at the venue \n\nI panicky talk to the Supervisor about what happened and literally they went into action! All were gloved up going though the trash in the back area. I had no words for how amazing this staff was!!\n\nA member of their staff clearing tables saw the tickets and set them aside!\n\nI got my tickets and I have to say I LOVE AMERICA AND NYNY! \n\nThe staff throughout our stay was awesome! The food was great and I have a fond  place in my heart for them as they go all out to satisfy!!"
        }, 
        {
            "index": 297, 
            "rating": 3, 
            "review": "On our first night getting into town, my buddy and I were pretty exhausted and didn't feel like venturing out to find food on the Strip, so we swung by America after getting out stuff up in the room. Not really too much to look at - typical diner-style restaurant with a lot of American maps and ethos painted on the walls. We came in pretty late when it was empty, so we just slipped onto a couple of the bar stools at the front. The beer selection is pretty standard, but not expensive, and the liquor selection is quite extensive. I ordered your standard breakfast - eggs, bacons, toast, etc. - as a late-night snack, and it came out pretty much as you'd expect. In all - a decent place to grab a bite within NY-NY, but nothing more than that."
        }, 
        {
            "index": 298, 
            "rating": 2, 
            "review": "Don't order the Chinese chicken salad!  Soggy and nasty.  I sent it back and got the Cobb salad instead.  They still charged me for  the salad even though everyone else in my party was halfway done with their food when my salad came.  \n\nIt took at least 25 minutes for the food to come the first time and then an extra 12 minutes for my replacement salad.  We were hoping that the convenient location in our hotel (NYNY) would provide us with a quick lunch on our way to the outlets for shopping.  That didn't happen.  Slow service and mediocre food.  Come on, New York New York..you can do so much better."
        }, 
        {
            "index": 299, 
            "rating": 2, 
            "review": "This restaurant is ok. My husband and I stopped in here for dinner before heading to a show. I ordered the macaroni and cheese and was disappointed, ultimately it tasted like Velveeta shells and cheese but the shells were a bit larger. Now don't get me wrong Velveeta shells and cheese is great but I can buy that at my local grocery store for $1.50 where as this plate cost $10.95. I suppose I just expected a little more out of it. My husband ordered the slider trio (which was a fish taco, pulled pork on a biscuit and a beef slider) which he wasn't blown away by either.\n\nPROS: Their decor is cute, they have a giant map of America on the wall that highlights each state with something they are known for, example: Michigan had cars for the motor city. \n\nCONS: There were maybe a dozen people in this restaurant when we went (which didn't even fill a quarter of the tables) yet we had to wait about 10 minutes to be seated. The hostess seemed frazzled so I can't imagine what it would be like if they were actually busy.\n\nTIPS: This city is filled with amazing restaurants, this restaurant is fine, but I personally would not go out of my way to eat here again :/"
        }, 
        {
            "index": 300, 
            "rating": 3, 
            "review": "After leaving Privé with my \"clubbing buddy\", we looked around for a place to grab a bite. Mostly everything was closed, but we eventually settled here. I have no idea why I tend to crave it, especially late at night, but I really wanted toast. I chose the Empire State plate *cues Jay-Z's \"Empire State of Mind\"*, which was basically eggs in whatever style you prefer and sausage or bacon. It also came with toast, so I was content. While waiting for my order to arrive, I proceeded to strike up a conversation with the guy while updating my friends on where I was, checking Facebook/Twitter, etc. Once I looked up, homeboy was totally knocked out. And I thought I had a lot to drink that night. I gave him a good nudge once our food got to the table. A little too good. I nearly toppled over my water. Oy! Anyway, it was a good meal, nothing extravagant. Although I gotta say the bacon was cooked perfectly. I could never cook bacon the way restaurants can for the life of me. Add a star for that."
        }, 
        {
            "index": 301, 
            "rating": 2, 
            "review": "We went here for breakfast when we first arrived in Vegas. Let me start by saying that the wait staff was extremely nice and attentive to our table. The breakfast is what you typically get at any 24 hour type of diner restaurant, nothing amazing. I ordered an omelet which had no flavor at all but it was a big portion and frankly I was starving after not eating for over 24 hours. My other breakfast mates weren't impressed either but hey we weren't upset about it we kinda figured it wasn't going to blow us away.\n\nI recommend going here if you don't want to spend a lot of money, want big portions and pretty great service. I never tried it for lunch or dinner so I can't comment on that."
        }, 
        {
            "index": 302, 
            "rating": 4, 
            "review": "Very nice spot. Above average breakfast, especially at very reasonable prices for this neighborhood. Also went to their Super Bowl party and had a good time. Very friendly staff."
        }, 
        {
            "index": 303, 
            "rating": 4, 
            "review": "I usually have breakfast here once a trip.  For a place right on the strip the prices are very reasonable.  Beyond that the food is good and the staff are friendly."
        }, 
        {
            "index": 304, 
            "rating": 2, 
            "review": "Butterfinger doughnut is amazing. 1 star +\n\nDeco in the restaurant is great. 1star+\n\nWe ordered omelette and all you can eat pancake.\n\nOmelette were fine. Especially when you are lazy, it's nice to have someone cook you omelette. Toast with butter I like the taste. Nom. \n\nAll you can eat pancake... came 3 in a plate. I shared with sister...and it becomes a single order instead of all you can eat. They said unless we pay double because we cannot share and still have all you can eat. Well if that's the case why didn't you bring it up front when we were ordering ? \"Shady\" comes up in my mind. \n\nOverall the pancake part is what disappoint us."
        }, 
        {
            "index": 305, 
            "rating": 3, 
            "review": "This place is a good drunken breakfast stop. Unfortunately we weren't drunk. The food was still decent but nothing to write home about. All around the service and food was a solid average.\n\nThe nice thing about the place was that it was so huge so it was good place to meet to start the day for our large group.\n\nAlso the donuts are a tasty option."
        }, 
        {
            "index": 306, 
            "rating": 5, 
            "review": "Become an ameriCAN citizen ! What  a great place ! If your a beer drinker and don't mind the CAN this is a must ! Tons of TVs around to watch the games going on and they also have giant Jenga and connect four and if you want they have beer pong  and of course corn hole . They have their own app that keeps track of the beers you have tried there and every 10 beers you get one free. Great atmosphere and the bartenders are really well versed in their beers . Download the app and check this place out. We didn't eat here so my review is just based on the bar it's self and they great time we had here"
        }, 
        {
            "index": 307, 
            "rating": 3, 
            "review": "How can you complain when you can get a steak and crab legs, salad, and baked potato for $14 in Las Vegas and leave super full? Its not the best quality food but, if you are looking for a filling meal..this is where its at. Shout out to Mono....your girls from VA are coming to see you soon!"
        }, 
        {
            "index": 308, 
            "rating": 3, 
            "review": "Somewhat frazzled from the hustle bustle and noise of The Strip, America seemed like a quiet oasis, perfect for a recharging lunch.  Midafternoon on a weekday, it wasn't busy and this was just what we needed, even though we didn't feel like a high-priced Vegas lunch bill.  \n\nBut weekdays from 1130 to 3 they have Daily Specials, two entrée choices available for $9.95.  On Thursday the Shrimp and Chips basket was one of the specials, and we both had that.  This was a good deal: lots of fried baby shrimp and fries in a generous size basket, and the quality was pretty good. \n\nA relaxing lunch location with good food and non-Strip prices!"
        }, 
        {
            "index": 309, 
            "rating": 3, 
            "review": "Convenient and better than some of the shady places in the other hotels.  I liked the crab cakes benedict for breakfast .  Service was kinda on the slow side,"
        }, 
        {
            "index": 310, 
            "rating": 1, 
            "review": "Slow service. Water ordered before food, and when food showed up, and the one time the server checked in on us, showed up at the same time as the check. Briosh French toast is made on wonderbread, not Briosh."
        }, 
        {
            "index": 311, 
            "rating": 4, 
            "review": "We went there during our first trip to Vegas. I had their Mac & Cheese and their Grown Up's Grilled Cheese (yes, it was a deliciously cheesy overload). The mac & cheese was creamy and flavorful. The grilled cheese was made with havarti, cheddar, and pepper jack cheese as well as with apple-wood smoked bacon and flame roasted pasilla peppers all on a telera roll."
        }, 
        {
            "index": 312, 
            "rating": 5, 
            "review": "Their 14.95 rib eye steak late night special hands down blew the $40 steak at a so called steakhouse out of the water. The steak was seasoned perfect, cooked to perfection. Medium rare just how I like it. And thats only talking about 1 meal. We came in here for breakfast because dinner was so good. Breakfast was A+++++. And to top off good food, they had great service. gloria was amazing, funny, attentive and on the money. Keep your high priced fancy restaraunt. Ill spend the money saved on the slots with a full belly."
        }, 
        {
            "index": 313, 
            "rating": 2, 
            "review": "Third time i have been here.  Will never go back.  Was excited to try a cronut.  I was disapointed.  Not much flavor.  Got the Eggs Benedict.  On the plus side the sauce was very good and plenty of it.  The eggs were the most perfectly poached eggs i have ever had.  On the bad side the muffins were burned, the hash browns were tiny and flavorless, and the ham for the Benedict was literally a single slice of deli ham that was thin enough to read through.  The menu stated that Ii was supposed to get toast so i asked for wheat toast which the waitress repeated back but i never got it.  When i asked he about it she said the muffin was the \"carb\".  I pointed out it was o the menu and she said the menu is a misprint.  The coffee was not good, but they do leave a full carafe of it and offer a to go cup.  The highlight of the dish was a single slice of grilled tomato which was very tasty.  Wish i had just gotten a dozen of those!"
        }, 
        {
            "index": 314, 
            "rating": 2, 
            "review": "Just checked into our room at New York New York and the wife and I were hungry.  This was the first place we saw, heres how we did....\n\nWhen we walk up there's a sign of some exotic looking women and the sign said that she was working.  This was quite a draw, this women was stunning.  Although we were there for the food, why not something to look at as well.  We get seated and order some drinks.  After looking at the menu we realized that this place was just a cafe.  And where is this exotic employee?  Nowhere to be found.  BS.  A shit hole of a restaurant and misleading pictures.  I ordered the quesadilla and the lovely wife ordered the wings.  Both tasted like bar food......only worse.  I'm sure glad I had $30 left on a visa gift card otherwise I would've complained about the shit food.  The reason it was 2 stars instead of 1 is because our service was good and I was eating with a beautiful women.....my wife!\n\nWill I again?...  most likely not. Tootles!"
        }, 
        {
            "index": 315, 
            "rating": 2, 
            "review": "Eh nothing special, I was definitely expecting more. I will say that the map inside of the restaurant is pretty impressive, however the food wasn't impressive at all. \n\nOur server was ok, nothing special. Never really came back to ask if we were ok or if we needed anything. The manager came over to us a couple of times to check on us but not the server, we thought that was very odd. The food was ok, nothing to write home about. \n\nWould I return? Probably not, there are other places in New York New York that I would rather go back to."
        }, 
        {
            "index": 316, 
            "rating": 3, 
            "review": "I can only vouch for their breakfast but it was good.  The eggs and bacon were cooked to order and the whole meal was generally far less greasy than what I've experienced at many diner type restaurants.  The coffee wasn't too bad.  Not horribly overpriced but keep in mind, this is Vegas.\n\nThat map is insane."
        }, 
        {
            "index": 317, 
            "rating": 4, 
            "review": "This place is still delicious. Breakfast runs a little slow but my steak and eggs was worth it. My waiter was super friendly. The only downfall is that it is no longer 24 hours.  The 24 hour place is the burger restaurant that you have to leave the hotel and enter in from the strip."
        }, 
        {
            "index": 318, 
            "rating": 3, 
            "review": "Huge portions for the price, but slow. Cocktails are alright. Serves a lot of beer, but their Fat Tire was inoperable when I went."
        }, 
        {
            "index": 319, 
            "rating": 4, 
            "review": "I went here because my boyfriend loves the ribeye deal. We went at 12:30am!!! I yelped the America before we got to NYNY and the reviews ranged from horrible to ok?!, egh, With a 3 star yelp rating. My rule is I wIll gIve It a try If rated 3 stars or more, so I was in!. Plus my boyfriend swore by the steak and its seasonings. \n\nAt he restaurant,  host greeted us with a smile and we were promptly sat. :-) we already new what we wanted. The rib eye!!! I got mine med/rare with xtra seasoning on the side and baked potato. Our server jaime was friendly, helpful and quick. My steak was cooked perfectly! Sooo good and for only $14!!! Local discount another 10% off. From reading the reviews, seems like you should only go with the steak. I really enjoyed I will be back!!!"
        }, 
        {
            "index": 320, 
            "rating": 4, 
            "review": "24 hr restaurant! great for get a snack after party. You should be patient at the time you order cause kitchen is really slow!"
        }, 
        {
            "index": 321, 
            "rating": 3, 
            "review": "I really don't need to write a book for this one. It's a reasonably priced (give the location) decent breakfast. If your looking to be wowed, go somewhere else. If your looking for good service and a satisfactory breakfast with basic American fare, than this is your place."
        }, 
        {
            "index": 322, 
            "rating": 2, 
            "review": "Grabbed breakfast food here.  Hash browns were burnt.  Scrambled eggs were a bit runny and bacon wasn't as crispy.  Mainly didn't like the service at the very end.  We had a flight to catch and needed to leave.  Another server printed out the check for us, and we paid our bill and left it at the table.  The server runs towards us and tells us we don't pay at the front and we have to pay her.  We pointed to the bill with all the cash and said it's there.  When she finally grabs the bill and sees the cash, her tone flips back to being nice.\n\nNo, I don't like it when a server thinks we want a free meal."
        }, 
        {
            "index": 323, 
            "rating": 5, 
            "review": "Great food and great service!!! Chris was our waiter and he is amazing. Great place to eat while on vacation!"
        }, 
        {
            "index": 324, 
            "rating": 3, 
            "review": "Don't go here expecting a lot. It's essentially an I-Hop but it's a decent breakfast for middle-of-the-road prices. I ordered French toast and coffee ad was satisfied."
        }, 
        {
            "index": 325, 
            "rating": 1, 
            "review": "Horrible service by Laura. There were only like 3 tables and it was like we weren't even there , she was rude and didn't even care that our orders were wrong. The only good thing was the salad! Thats it!"
        }, 
        {
            "index": 326, 
            "rating": 5, 
            "review": "Over 100 reviews later and this is my first 5* I'm giving for a breakfast place. I went here 4 times during my trip (all for breakfast) and was not let down by anything, not once. By the last day i was looking for something wrong with the place but was hard pressed to find it. \n\nEvery day the hostess was nice, even genuinely asked us how our morning was going on the way to the table. Our service was great. Even with our special requests, time constraints and what not. It was near flawless. We were always asked if we wanted a mimosa or bloody Mary even though it was like 8 or 9 am!\n\nNow the food. Oh yea, the food! In the 4 days i went, i had Steak and Eggs, A bagel with lox, omelet with lox and 2 eggs sunny side with bacon.  In general all was well above par and blows any Denny's or IHOP out of the water. \n\nThe steak n eggs was about $15 and tasted better then many \"dinner\" steaks I've had in chain restaurants. The bagel with lox was a tad overpriced at near $11, but was delicious. The omelet with lox was good, but the lox were cooked. I sort of expected it on the side (idk why). it just tasted like a fish omelet to me. Strange but good. \n\nIf I'm back in Vegas in this area, I'd eat here again and again."
        }, 
        {
            "index": 327, 
            "rating": 4, 
            "review": "Surprise Surprise!  This is the 24 hour behemoth inside New York New York.  These 24 hour diner style establishments I review as if I am forever comparing them to a Denny's.  When I arrived at America I was seated quickly and brought water and coffee quickly, which in Vegas is a great way to start any meal.  Big old carafe of weak coffee is plopped down on your table within a minute of sitting down, and although it isn't the finest quality it makes up for it in quantity.  They have this giant tilted sculpted map of America that hangs precariously over your head as you eat.  I was seated under Texas and this did not make me happy, but examining the map/art thing was a great way to pass the time until my food arrived.  The service was quick and prompt, although the waiter forgot my smoothie on the first trip but realized it himself and was back super quick with it.  My breakfast plater thing had a good amount of mediocre food, that looked like it had actual veggies in it.  Weird.  Also the bacon had some sort of thickness (it was NOT thick bacon), but when you compare it to the bacon at a Denny's it was pretty divine.  I am pretty sure they had some kind of all you can eat buttermilk pancakes for a pretty good price as a special, but a lot of basic pancakes just didn't special to me.  I overheard that this is the food that they serve as room service in New York New York, so hopefully that helps.\nThings I like : Decor, Lots of coffee, bacon, hash browns, service\nThings I dislike: Smoothie (tasted watered down and also pricey)\nin the end these 24 hour places with decent prices are how I usually survive in Vegas for at least part of my time there, and I would return to America when I am dangerously close to extinction."
        }, 
        {
            "index": 328, 
            "rating": 3, 
            "review": "We rolled into America at close to 4 a.m. hungry after a night of gambling and drinking. All we wanted was some good chow to put us to sleep. The 16 oz. Ribeye Steak for $12.99 was screaming my name and I took the bait. I'm so glad I did. It was a great steak, perfectly cooked medium rare and served with a baked potato and veggies. My two brothers-in-law had the same thing and were also satisfied."
        }, 
        {
            "index": 329, 
            "rating": 2, 
            "review": "Was here on a Saturday night, at around 9:00 after a day of gaming. We were greeted and seated promptly. The restaurant was clean, not crowded and was a welcome respite from the strip. The wife and I were fairly worn out, very hungry and just wanted a quick bite before heading to our hotel to collapse.\n\nOur friendly server made a few suggestions from the menu, none of them appealed to either of us. We each just wanted something simple, we weren't looking for or expecting a fine dining experience. A nice, juicy hamburger with fries would do the trick.\n\nThe orders came out promptly and looked delicious. The fries were hot and crispy but something was definitely not right with the hamburgers. The texture was odd, they had no flavor and after peeling back the bun, no grill marks to show they had ever touched a grill or flat top. I'm 99% certain they were precooked, (maybe even purchased frozen and pre cooked?) then heated in a microwave. The bun LOOKED great but, while not stale, had obviously been around a day or two. We each left 2/3 of our burgers untouched. Paid the bill and left.\n\nPossibly they had an off night, but a decent hamburger isn't hard to do is it? This was our only truly bad dining experience in Vegas during our stay. I see other reviewers have had good experiences here ordering breakfast, maybe that's your best bet."
        }, 
        {
            "index": 330, 
            "rating": 4, 
            "review": "Stumbled into the America around 4am after a night out which lead to morning at Marquee. I was staying at NYNY so finding a decent place to eat a real meal was key for me and my friend. We were seated right away... Of course, the restaurant was hardly busy. Only a few tables were occupied. Our waiter brought us water right away before we could ask so it was perfect. I'm sure he's seen it hundreds of times... The need to hydrate in Vegas is of the absolute importance. Ha!\n\nI opted for the bagel mania which is a grilled NY style bagel sandwich with bacon, eggs, ham and good ol' american cheese. It was delicious not only cause I was starving at the moment but the combination of ingredients was perfect. The cheese topped off the bacon, eggs and ham. And all those things were encapsulated in a perfectly crisp on the outside, soft on the inside grilled bagel. Delicious... It was just what i needed. It came with country style potatoes. That was pretty good too.\n\nMy friend got a rib eye steak and eggs. Loved it and scarfed it like it was the last meal on earth.... Satisfied customer.\n\nOur waiter was real cool. Bill was under $25 with tip. Yes, please... Thank you America, I luh you."
        }, 
        {
            "index": 331, 
            "rating": 5, 
            "review": "I have no idea why people are whining, but I'll jot my two cents down.\nIt was christmas day, late night, we were looking for a 24 hour restaurant to eat at in NY NY, and found this place. \nWe had the cheese pizza and the vegetable sandwich on rye that came with spiced potato wedges and couple of cocktails. The drinks were great, so was the pizza and the food. The service was impeccable, i mean good food at midnight? with good service? and reasonable prices? and we didn't need to leave the casino to find it..what more do you want? the pizza tastes like east coast pizzeria style which is something we NEVER find in cali....WE LOVED IT. totally worth a checkout."
        }, 
        {
            "index": 332, 
            "rating": 3, 
            "review": "There are a few locales that are referred to as a \"city that doesn't sleep\", with New York as the likely original, though it has been proven to me over time that few other places can really live up to this claim.\n\nI guess that for my first time back in Las Vegas as an Adult, I assumed that it would be easy as pie (specifically apple pie...read on) to find somewhere half-decent to eat late at night. \n\nAfter passing many unworthy eating establishments on our 2.5 HOUR trek down the entirety of the strip (complete with a stop to purchase Dr. Scholls shoe inserts after developing blisters), the BF and I reluctantly sat down in a semi-fancy restaurant at the MGM. I took a look at the multicultural, Californian, fusion menu that I would normally exalt in and said, \"...I kind of just want some American food.\"\n\nBF sighs. We forced our aching feet to carry us across the street to New York, New York, dedicated to a city we should have known we could depend on in the first place, and like a beacon in the night saw this place called flat-out \"AMERICA.\" Complete with textured map of the United States on the ceiling. If there is a god, she must know what it feels like to NEED a milkshake at 4am. \n\nThis is the first time that I have ever paid more for a salad ($14 for southwest-inspired chicken salad) than my BF paid for his steak and potatoes dinner ($12), but I was so happy to get that salad and malt milkshake into my stomach that I didn't mind. \n\nAmerica -- Fuck Yeah."
        }, 
        {
            "index": 333, 
            "rating": 4, 
            "review": "Went here twice for Breakfast with the family while staying at New York, New York. I felt the breakfast was above par. The eggs were on point and my favorite sourdough toast was fantastic. If they would have screwed up my toast I would have left America. Lol Breakfast was bomb. Viva America"
        }, 
        {
            "index": 334, 
            "rating": 4, 
            "review": "Thank goodness for this restaurant and New York New York for being open so late at night. After going through a hour long food hunt staying at Excalibur and nothing was open to eat at 2 in the morning we were told America was the only restaurant open in the area. After walking and ready to pass out from not eating we were seated and had the best service from James. We told him we were starving and he brought out the food right away. Great service James and not to bad food especially so late at night."
        }, 
        {
            "index": 335, 
            "rating": 5, 
            "review": "Wir waren im Juli 2016 in diesem Restaurant und waren begeistert. So begeistert, dass wir 2 Tage später noch einmal dort gegessen haben. Ich kann nur von meinem bzw. unserem Gericht ausgehen (wir hatten beide jeweils Scampi Schrimps auf Tagliatelle in Weißwein-Soße), und das war das beste Gericht dieser Art, dass wir je gegessen haben - da waren wir uns einig! Die Kellner waren zuvorkommend und freundlich, nicht aufdringlich. Das Preis-Leistung-Verhältnis ist vollkommen in Ordnung!"
        }, 
        {
            "index": 336, 
            "rating": 5, 
            "review": "This place was great! Me and my family were looking for a place to eat traditional food for a decent price and this restaurant hidden inside NYNY was perfect. \n\nOur bill for 5 people, came out to be about $60 and we were all so full afterwards. All of the food was cooked perfectly, from omelettes to waffles to eggs, there was a lot of options to choose from too. \n\nOur waitress, Grettel, was super friendly and nice - giving us recommendations and having conversation. \n\nWe loved this place!"
        }, 
        {
            "index": 337, 
            "rating": 4, 
            "review": "Cool decor...favorite place for breakfast when we stay at NYNY! Pancakes are great! Price of meals are decent prices for Vegas....good customer service as well! \nI have eaten here on several occasions since I first stayed at NYNY over 10 years ago! I almost always eat here when I visit Vegas!"
        }, 
        {
            "index": 338, 
            "rating": 5, 
            "review": "Una cafetería 100 % USA\nMuy buena carta, excelentes precios y el servicio no tan bueno, pero casi no importa. \nSi están hambrientos : Club Sandwich...súper enorme.\nAntes de las 400 pm hay descuento, así que vale la pena comer a como estamos acostumbrados en México.\nInteresante decoración, en la que sobresale el mapa de USA...monumental.\nTambién tienen buffet de pancakes (hot cakes) por $7.00 \nDefinitivo, si regreso a Las Vegas, regreso."
        }, 
        {
            "index": 339, 
            "rating": 3, 
            "review": "During our stay at New York, New York we decided to have breakfast at America since it looked interesting from walking past. We showed up about the 11 hour and where seated quickly but the service from that point on was pretty slow. I wasn't too impressed by the decor of America, I had heard they had a large scale map of America displayed and it looked more like a geography project my nephew did back in the 5th grade, also wasn't too impressed with the price of breakfast for 3 since the food was just okay.. I was expecting too much from my croissant french toast ( no sides included) and was sadly disappointed. \n\nSide note ( don't get fooled by the  name of the specialty donuts at America, nothing special either)"
        }, 
        {
            "index": 340, 
            "rating": 4, 
            "review": "I felt like i was getting rushed out so i had to look around to see how man available tables there were so i turned around and checked it out it was about 20empty seats so not sure why i was being rushed. But oh well next time ill ask!"
        }, 
        {
            "index": 341, 
            "rating": 1, 
            "review": "Came here looking for some inexpensive food and was it was very disappointing. The wait staff and hostess were very nice but the food lacks in taste. We ordered bbq platter and the chicken was engulfed with bbq sauce it was inedible. It was questionable if it was cooked throughly. Left hungry, don't waste your time or money!"
        }, 
        {
            "index": 342, 
            "rating": 2, 
            "review": "Might as well have just walked across the street to Denny's.  This was really kind of icky.  I ended up getting their fancy oatmeal with maple syrup, soy milk and some dried fruit.  Crazy chewy fruit and when I put the soy milk in my coffee it never mixed - it just sat on top of the drink.  Eew.  j\n\nBut if you don't feel like leaving the hotel and need some sustenance, I suppose it would do in a pinch.\n\nReally the only thing it has going for it is the artwork that feels like it could fall on you at any moment!"
        }, 
        {
            "index": 343, 
            "rating": 3, 
            "review": "This restaurant is inside NY NY Hotel & Casino..and it's ironic how they can't get my NEW YORK STEAK right.....medium rare please."
        }, 
        {
            "index": 344, 
            "rating": 2, 
            "review": "Came in for a quick bite with a group of seven. Food and prices were better than expected. Service was decent, but our server seemed overwhelmed. Not a bad choice when you're not interested in waiting or looking for anything specific."
        }, 
        {
            "index": 345, 
            "rating": 1, 
            "review": "This place fucking sucks don't waste your money even if you're starving. The food is VERY low quality and VERY over priced. Also they only do 4 separate checks which makes it very difficult with large groups in Vegas. Seriously, keep walking."
        }, 
        {
            "index": 346, 
            "rating": 3, 
            "review": "We went here for a late breakfast. I got a sirloin and eggs for breakfast. Partner got pancakes, eggs, hashbrowns, etc. Food was good. Wait service was prompt and attentive to our needs.\n\nWhen you walk in your see this awesome display of donuts and coffee. Upon being seated you see a full map of the US hanging from the ceiliing. Definitely keeps you occupied while awaiting your food. It is good for kids and big families. Doesn't seem too romantic of a place for a date though."
        }, 
        {
            "index": 347, 
            "rating": 1, 
            "review": "Yet another example of \"Check Yelp before eating here\"...after waiting thirty minutes to get our food and receiving a bagel sandwich that seemed to have been soaked in grease, I logged on to Yelp to check what others say about the place.  If only I had looked before!  Service was slow (when there was any service), and the food was awful. Do NOT bother with this place.  Walk on by...."
        }, 
        {
            "index": 348, 
            "rating": 2, 
            "review": "Where to start... We had a table for 4. My uncle wanted to have the frosted flakes French toast( reason we came) when we asked about it the waiters simply said I'm new and didn't even ask about it. The GM walked by so we asked her, she did let us know it was removed from the menu. We had 2 orders of country fried steak, an order of new French toast and a breakfast burrito. French toast was mediocre, breakfast burrito was horrible the steak wasn't to bad the eggs that came with both orders were cold as well has the English muffins and toast. We have no reason to come back to this place."
        }, 
        {
            "index": 349, 
            "rating": 3, 
            "review": "It reminds me somewhat of a Denny's in terms of its menu. What I like best about this place is that it's open 24/7, so if you're looking for a quick bite at 3:00am you can't go wrong here. Their burgers are pretty decent and their entrees are big enough to get me full. The fettucini alfredo was surprisingly good too. There's also a full bar so you're not limited to just beer and wine.The only thing that needs improvement is the wait time. We had to wait at least 20 minutes for our food, which happened on both occassions we ate here."
        }, 
        {
            "index": 350, 
            "rating": 4, 
            "review": "went to a great wedding earlier in the evening sub-par food. after the sugar high from the cake wore off, my fiance suggested grabbing a little bite to eat. at midnight, the only restaurant open at NYNY was America. had been here many years earlier after an MGM Grand concert and didn't have great memories after it. thankfully it's better now.\n\nwe decided to share a cajun chicken sandwich at the waiter's request. I really appreciated that they split the sandwich and fries onto two separate plates. also appreciated that even with the low bill we still got great service."
        }, 
        {
            "index": 351, 
            "rating": 4, 
            "review": "We came here for breakfast on a sunday but were seated right away. Love the large map of the US on the ceiling. Gave us something to look at since the food did take a bit to arrive. But when it came out the portions were enormous. We ordered 3 plates: steak and eggs, chicken fried steak with eggs, and a regular two eggs with bacon. All orders come with hash browns (yum!), choice of toast, and a petite apple muffin (so cute).  Food was good for what we expected, and prices were decent. Not sure if the steak was ribeye, but it was sooo tender and juicy. The chicken fried steak was perfectly seasoned and hash browns were crispy not greasy. I felt we got our money's worth. Service could've been a bit more attentive, but it was a busy sunday morning in vegas, when many people just want to eat and head out. They had so many varieties of donuts in the front counter that looked delicious, but we were too full to try any. Will definitely come back for breakfast if we're in the area."
        }, 
        {
            "index": 352, 
            "rating": 1, 
            "review": "It was late, as we'd flown in that night.  This seemed safe, in the way that you know you can always find something at a Denny's.  It may not be the best thing you've eaten, but it'll fill you up and you know what to expect.\n\nI'm sad I ate here.  We should've gone to the Irish pub place or something instead.\n\nFirst off, they pretty much scorched the outside of my \"medium\" burger, then managed to make the bun into mush.  The vegetable side tasted like someone took canned veggies and boiled the hell out of them.  We barely got service, despite it being dead in there.  Everything was just kind of frustrating.\n\nThat said, you might not be bad off if you attempt dessert or breakfast food or something.  Maybe getting something pre-prepped is the way to go.  I say this, because any excuse to sit and look at the giant map sculpture thing for 30 mins. or so is fine if it's not like punishment.  That's the one redeeming factor here.\n\nSeriously, how can you be a bastion of diner style food and jack up a freakin' hamburger?!  That's all I want to know.\n\n~EEE~"
        }, 
        {
            "index": 353, 
            "rating": 3, 
            "review": "This place is nothing fancy, but doesn't pretend to be. I think foreign visitors and families with children might get a bit more out of the decor and USA trivia on the menu, but the place is designed to be a diner and as such, it fits the bill just fine. The breakfast menu is ordinary (eggs, pancakes, etc), but executed just fine. The service was friendly and efficient. The prices were decent. \n\nIn short, good place to get a quick bite, but nothing for a foodie to drool over."
        }, 
        {
            "index": 354, 
            "rating": 4, 
            "review": "Have not had a donut here I didn't like. The latest I tried was the Boston Crème, Apple Fritter and Strawberry Custard Donuts. All were delicious. Bread is soft and fresh. Cream filling is plentiful and satisfying. Not cheap, but fancy donuts in a casino never are.\n\nThis cafe is located in NYNY Casino, downstairs near the restrooms, right in front of the America Restaurant."
        }, 
        {
            "index": 355, 
            "rating": 4, 
            "review": "Both times I've eaten here was in the wee hours of like 4-5am. The staff is very helpful and nice, and the food is good. I usually order breakfast. Love that it is open 24 hours and have good prices!"
        }, 
        {
            "index": 356, 
            "rating": 5, 
            "review": "Nice little place. Donuts are yummy and fresh. Coffee is good. They have a deal for a coffee and donut for $4.50. Cashier was really nice."
        }, 
        {
            "index": 357, 
            "rating": 5, 
            "review": "Be prepared to share the breakfast. Had the Belgian waffle, eggs, bacon, and juice definitely worth the $23 bucks. This place has super yummy turkey burgers. My favorite go to place at 3am. Our waitress here were always fast and checked on us constantly. Even with our large group didn't mess up a thing. Try the piña colada here!"
        }, 
        {
            "index": 358, 
            "rating": 5, 
            "review": "On our recent visit to Las Vegas we chose to eat a casual meal at America Restaurant located in New York New York casino. What made our meal so enjoyable was not only the food but the service we received by our server Manny, that we chose to eat there several more times before we left. We don't eat at the high priced restaurants so this option was just perfect. The menu has a variety of choices from  traditional breakfast items to your favorite sandwiches, salads and even some pasta dishes!  Sounds boring but trust me when I say everything we had was outstanding! I am Gluten Free for medical reasons and Manny took the time to explain my options and there were several! They even have Gluten Free bread for the sandwich choices!  He mentioned that he has only been a server for a short time, that he used to be a cook in the kitchen. Wow, what a waste of talent had he stayed in the back of the house. He was so upbeat, professional and a joy to be served by! We will definitely be returning and will ask for him every time. If you are looking for a casual place that is not expensive and has great food options that taste even better, ask for Manny and you will not be disappointed!"
        }, 
        {
            "index": 359, 
            "rating": 5, 
            "review": "let me say that this place rocks when it comes to food and service esp the waitres Tiffini..... we had a HORRIBLE experience at Senor Frogs were starving and just wanted a variety to choose from fresh and good and this is what we got. they lost our ticket and it took a bit long we did not even mention a word but they comped our entire bill and the food was GREAT!"
        }, 
        {
            "index": 360, 
            "rating": 3, 
            "review": "Not bad, not good! Reasonable prices. NY skillet was VERY greasy but not bad tasting.  Service is nice. Bloody Mary gets 5 stars...just upgrade the vodka. Enjoy!"
        }, 
        {
            "index": 361, 
            "rating": 2, 
            "review": "Service was great however the prices did not reflect the quality of the dish. The cocktails we ordered were good. We came here due to the convenience of being open 24 hours. The first time, I ordered a mushroom burger which was good. The second time we went, I ordered a fettuccine pasta, the chicken was overcooked and tasteless. I added so much pepper but that dish was helpless. Unfortunately it was the worst pasta I have had. Went again for the third time, fingers crossed, my Miami press sandwich was overwhelmingly salty. Thank goodness we're leaving today. The restaurants here are horrendous."
        }, 
        {
            "index": 362, 
            "rating": 5, 
            "review": "We were wandering around into the early morning when we found ourselves at NYNY.\n\nThis was open so we decided to check it out. We were seated immediately in the large dining area.\n\nPam was our server and she was AMAZING !\nDespite it being 730 am on the day after Thanksgiving, she was so very welcoming, friendly and helpful. She made our morning and experience one to remember.\n\nWe enjoyed a variety of beverages ( double gin ceaser, baileys and coffee, tequila coffee and a baileys and butter ripple shots.\n\nFor our meal I had a bagel with cheese,\nHam, bacon and egg on it. My husband had the scramble with added bacon and rye toast. \n\nThe portions were generous and tasted really great. The service was beyond excellent ! From the hostess to Pam to the food runner to the bus person all the way to the supervisor- all asked how we were and the answer was was always \"wonderful\"\nOne of the better meals we have had. \n\nWe would return for sure!"
        }, 
        {
            "index": 363, 
            "rating": 2, 
            "review": "I have been to NYNY several times and on several trips we've thought about eating here but we always end up going somewhere else b/c the prices seem kinda high for what they actually give you. If a side salad cost $7 - seems suspect when I can go to outback and order a real salad for $10.  anyway my bf was hungry and I didnt want the cranky to set in and we didnt want to go any farther than we already had at the hour. We probably couldve driven to Summerlin and been eating before out dinner came out here. \n\nSERVICE: ALARMINGLY SLOW. Couldnt believe it took SOOOO long. We got there around 645. It took over an HOUR to get our food. The place was kinda empty. I ordered a cobb salad and he ordered rice and shrimp. last time I ckd shrimp cooks really fast? so I dont knwo what took an hour other than poor communication. \nTheres someone to give you water, theres another person to give you your food, theres a differen person to take your order. We saw the water girl way more than we saw our server, which at this point we decided they jsut forgot to turn in the order and that must be why it took that long. the table in front of us had more people, sat down after us and ate and left and we still had yet to take our first bite. sad. \n\nFOOD: the plate was ok, not anythign I'd order again. THe bacon was good and crunchy which I like but oh so greasy. . to the point it made me sick. i wasnt alone... my bf felt fine till I gave him a bite of the bacon oops I mean grease with bacon. ah .. lets put it this way. the food @ Hard Rock Cafe was way better and we all know they arent known for great cuisine.  \nwould I come back? no I would not. Its a 24 hr place but so is walmart and mcdonald's."
        }, 
        {
            "index": 364, 
            "rating": 3, 
            "review": "We stopped in here to pick up much raved about Cronus. They're a cross between donut and croissant. This place offers different toppings like honey glaze, sugar, chocolate, and Butterfinger. We got two honey glazed cronuts and put a little bit of cinnamon on the second one. Both were good but so very sticky and messy. Worth trying once but that's about it."
        }, 
        {
            "index": 365, 
            "rating": 1, 
            "review": "Worst service ever!!!  The food was only good because we had to wait 45 mins and were starving on a slow morning with lots of staff walking around. We had a food allergy which I understand is not something I expect businesses to always be able to work with but it was CLEARLY stated on the menu that there were tons of GF options and the waiter couldn't even answer the simple questions about the food. Waiters and waitresses should at the very least be aware of the menu!!!!! I know not to expect a lot when dining out but this place was a joke. They even tried to argue with us about the amount of time it took to get our food. We had proof! The waiter continued to ignore us and avoided eye contact until we begged for the bill. If you hate your job don't work there!!!"
        }, 
        {
            "index": 366, 
            "rating": 4, 
            "review": "Very cute place. I love the hanging USA map thing. It makes the place look festive. The food was good and well portions. I got the chocolate chip pancakes and it was too much to finish. Service was great, no complains. :)"
        }, 
        {
            "index": 367, 
            "rating": 2, 
            "review": "The doughnuts are great, but I was not super impressed with the restaurant food. I had the French toast and it was extremely soggy- even after sending it back once. The scramble was just ok. I would come back for the pastries but not the other food."
        }, 
        {
            "index": 368, 
            "rating": 1, 
            "review": "We went to America because it was recommended by one of those \" Las Vegas with kids\" pages.\nDon't go. Bad. Really bad!\nIt was dirty, smelled like dirty wet rags, the servers were all over the place. They messed up my Hamburguer twice, served my kid cold Mac n cheese. \nSeriously, bad!"
        }, 
        {
            "index": 369, 
            "rating": 2, 
            "review": "Ugh.\n\nThe story that I can tell that sums this place up involves a group of us guys roaming in here at 6a (having been up the entire night) and in desperate need of food. They had an \"all you can eat\" pancake special going on, which at the time sounded fantastic. And then we got the pancakes - these were the driest things ever put together - more absorbent than a Sham-Wow. No amount of fake maple syrup could make these things palatable, which in our state is saying something. \n\nTerrible food. About the only thing that I've found on the menu that's any good is the bagel sandwich.\n\n(If you're wondering why I've gone back, well, it's the only 24-hour restaurant in the NYNY Casino, and sometimes convenience just wins out)"
        }, 
        {
            "index": 370, 
            "rating": 1, 
            "review": "Don't eat at this place. The decor and service was great but not enough to make up for the horrible food! Don't, and I mean don't order the country fried steak and eggs !! I only ate one bite and that was enough. Even the water left a bad taste in your mouth. Waste of time and money. Don't come here."
        }, 
        {
            "index": 371, 
            "rating": 5, 
            "review": "Awesome food and great customer service. Friendly atmosphere. Our ribeye steak dinner and chicken fettuccine was delicious."
        }, 
        {
            "index": 372, 
            "rating": 5, 
            "review": "Chris the bartender is amazing... He is very attentive and takes care of you... I will always recommend him and this restaurant."
        }, 
        {
            "index": 373, 
            "rating": 1, 
            "review": "I ordered fish and chips and I have to say the food SUCKED. the fish was terrible and the cole slaw had no flavor."
        }, 
        {
            "index": 374, 
            "rating": 2, 
            "review": "I don't know what happened to this place over the years but it was quite a disappointment coming back here recently and seeing the change. \n\nDo not come here unless you are desperate because everything else has closed within the hotel and you are too tired to go walking down the strip, like me! Also, don't come here unless you have at least an hour to waste while you are waiting with hunger pangs for your food. \n\nI came two times during my last trip because I had booked a stay within NY NY which happens to be my favorite hotel in Vegas. I have always liked the food at America and service was always decent.\n\nBoth times I came recently were just terrible. The first time we waited exactly 40 minutes for our food. Our waiter seemed to make jokes over the fact that he moved verrrrrrrrrrrrrry slooooowwww. Well he wasn't joking. It ended up being true. It was not busy as this was around 2am. \n\nAnother time we decided to try again for breakfast, hoping the first disaster was just a fluke. The waitress was not very friendly and she never came around. She didn't even serve us our food or give us refills. We had several other people come around to do her job. The thing is, she wasn't even busy. She only had two tables. The place was dead. There is no excuse for terrible service like this.\n\nAlso, there was a very obnoxious drunk girl yelling at the bar for the entire time we had to wait for our food to arrive. At first this all seemed slightly amusing, I mean it IS Vegas. However, after awhile it was annoying and none of the staff seemed to give a darn about her behavior. No one told her to pipe down. She just sat there putting on a drunken show for the entire place, cussing and showing undies and falling off the bar stool. I guess this is what keeps the staff awake at 2am. Who knows. \n\nThe food has also decreased in taste and quality. Too bad. I used to really look forward to this place back in the day for some great steak and eggs at 3am. Never again."
        }, 
        {
            "index": 375, 
            "rating": 1, 
            "review": "This place served the worst eggs benedict I've ever eaten (I didn't even eat most of the meal). The hashbrowns were burnt on one side and totally raw on the other. The coffee was bitter and old. The second order came with pancakes that were so hard I was only able to take one bite. As we attempted to eat the waiter looked over and could see we were not pleased then avoided us until a dishwasher came by to pick up our plates and asked if we were finished at which time I told him the food was bad. Shortly after this the waiter walked up with the check dropped it in the table and said, \" pay when your ready\". Never asking how the food was or anything, we ordered two meals and the bill came to $46!! I had to go ask for a manger where I stated what had happened, she was friendly but only took 1/2 the bill off. I then had to go spend $17 more to get food somewhere else to fill our tummies. Do not go to this place."
        }, 
        {
            "index": 376, 
            "rating": 4, 
            "review": "I guess you could say this is our new favorite spot in Vegas. Stayed for a week and came here 4 times lol. After midnight they have a steak and potatoes deal for $14.95. 12oz steak and hubby said that it was very good that's why we kept going back. I really liked their chicken soup and their New York breakfast was yummy. Nothing extraordinary but consistently good. \n\nA big shoutout to Gloria and James though. Two of the best servers we have ever encountered anywhere! You guys rock!!"
        }, 
        {
            "index": 377, 
            "rating": 3, 
            "review": "Service= friendly! \n\nFood = average and good if you really need to eat. I had the turkey burger which was decent but the potato wedges tasted half fried and half microwaved. \n\nGood coffee.\nOpen 24hrs."
        }, 
        {
            "index": 378, 
            "rating": 4, 
            "review": "I had way too much fun here! \n\nI was in Vegas on business, so a friend met me at the Monte Carlo and we walked over to New York, New York for a change of scenery and pace. We found America after wandering around the casino and hotel a bit, and we decided to give it a try. Between the two of us we split an appetizer and an order of fish and chips - and everything tasted great! We also came earlier in the night - comparatively! - so we didn't have much trouble with service, but I liked it a lot. I'd have wanted to try out some of the drinks, but again - unfortunately there on business. Maybe another time!"
        }, 
        {
            "index": 379, 
            "rating": 2, 
            "review": "Went for lunch with the fam-\nAmerican food, it was ok but I was expecting it to be better.\nIt took the waitress about 10 minutes minutes before taking our order, and we waited 30 minutes for our food to come out.\nIt wasn't crazy busy so idk what took so long, and our waitress was gone for a food while so we couldn't even ask her what was taking so long- there were a few other waters/waitress but they were across the room.\nFood came out- i ordered a Philly Cheese Steak Sandwich; the brad was not intact and the meat was falling out.\nThe taste wasn't great, it was ok but nothing I would go crazy about.\nFor our meal we paid $75- 4 meals w/sodas.\nI do not recommend this place as it took a long time for food to be ready, taste was average and customer service wasn't that great."
        }, 
        {
            "index": 380, 
            "rating": 4, 
            "review": "Really great food and service. The omlete and pancakes are amazing. Love the donut part and map. Would go again"
        }, 
        {
            "index": 381, 
            "rating": 4, 
            "review": "this place is just awesome. my family always eat here when we visit Vegas. even if we're not staying in NYNY."
        }, 
        {
            "index": 382, 
            "rating": 4, 
            "review": "We stopped here for breakfast one morning since we were staying at the New York, New York. The hubby got the all you can eat pancakes for $7.95. The first go around, they bring out a stack of three pancakes. After that, it comes in a stacks of twos. The hubby ate five pancakes in total. He said that the pancakes were light and fluffy.\n\nAfter reading so many articles about the famous croissant doughnut, I had to try it. This was the first time that I'd seen a Cronut in my life. It's truly the best pastry that I've had in a long time. Yes, it must be really bad for you and really fattening, but it's so good. It's hollow on the inside, which makes it light and airy. On the outside, it has a sugary glaze, and is flaky and crispy. It really doesn't get much better.\n\nI like the decor of this restaurant. While it's not fancy or sophisticated like fine dining, it's bright and clean. They have this piece of artwork that hangs from the ceiling. It's a map of the United States and has decorations of what each state is known for. Alaska and Hawaii is off to the side and have their own little section. At first when I didn't see Hawaii on the map, I was disappointed. I'm glad I looked over to the side and saw it."
        }, 
        {
            "index": 383, 
            "rating": 3, 
            "review": "This is a 24 hr diner that makes delicious home made donuts and has regular diner food.\nThey say Vegas and New York are the cities that never sleep.. but everything closes at 2 am. Except this diner.\nI ate breakfast here and it was ok.I would go back for the donuts which they only have during the day."
        }, 
        {
            "index": 384, 
            "rating": 2, 
            "review": "What can you expect from a restaurant entitled \"America\"?  The good is typical."
        }, 
        {
            "index": 385, 
            "rating": 2, 
            "review": "This is typical of the overpriced diner but with neato interior design in Las Vegas. Great for groups and drunk eating if that's your bag, baby."
        }, 
        {
            "index": 386, 
            "rating": 3, 
            "review": "Not bad at all.\n\nHad a fine breakfast here. Ordered the bacon and egg, it was perfectly cooked. The egg taste different thought, but its it taste good in its own uniqueness. They also got this classy atmosphere, its my first time here so the first impression last so I really liked their place.\n\nService was fine as hell, I love how the servers work here. Loved them all."
        }, 
        {
            "index": 387, 
            "rating": 1, 
            "review": "$20! for terrible food! Ugh!\n I was very disappointed with my experience at America. During long layover I'm Vegas I decided to go on the strip for a few hours. I needed to start with breakfast. I passed up 48TH and Crepes because the line was really long and there was no where to sit. My weariness led me to make the bad choice of choosing America.  I knew going on the food was overpriced for what they were serving but i was really tired after flight.\nI ordered the Chicken and Waffles and after waiting 20 min for my order, even though the place was slow, I saw my food and knew right away I was going to regret choosing this place. It came with 3 pieces of chicken which could have came fron a chick they were so tiny. I could tell the chicken was bought prepared and heated up. It had that familiar orangey color diner chicken has where the establishment is too lazy to flour chicken themselves. Lots of places actually serve this chicken and it's not bad tasting but it can easily be dry. Of course those tiny pieces were far from moist. The Waffles were crunchy on the outside and fluffy in the middle, nothing spectacular about the flavor. But my guess is that any place who doesn't take pride in preparing their own chicken, probably bought the waffle mix prepared as well.\nFunny that the restaurant is called America, pretty ironic. Lazy, no pride in your product, over charging customers, the buck you make is more important then the goods they are pedaling.  Is that what they are saying America is? \n The service was great, that's the only reason I gave them a star. Seriously how hard is it to make your own fried chicken?"
        }, 
        {
            "index": 388, 
            "rating": 2, 
            "review": "My donut stalking continues; however this experience was just disappointing .  I stopped by America on my way out of the NYNY for the day and grabbed a cup of Morning Blend coffee and a chocolate sprinkle donut .  The coffee was great but the donut.... Well, the donut wasn't fresh, like at all.  I wonder if the bake them the night before kinda fresh .  The donut was impressive in size and the $5 deal for coffee and a donut wasn't bad at all, but the donut was old and not flakey nor warm.\nI would stop in for a quick coffee again ."
        }, 
        {
            "index": 389, 
            "rating": 1, 
            "review": "Overpriced omelet that was wayyy too eggy. OK, I get that an omelet is made of eggs... duh. But with an omelet, you have to have the right proportions of toppings to omelet, and in mine, there was just too much egg. Get this -- I paid $19 (service charge tacked on for 4 people eating, wtf) for a bad omelet, toast and potatoes!\n\nService was slow. He was slow to bring the check, and never brought my water.\n\nThe one thing America has going for it is convenience, with its location in NY NY. Maybe I should have stuck with their doughnuts, those looked appealing..."
        }, 
        {
            "index": 390, 
            "rating": 3, 
            "review": "Your $3 gin and tonics during happy hour gave me a hang over by 7pm, leaving me nauseated for the rest of the night. Good thing or bad, you pick. Loved your \"4 cheese\" mac n' cheese even though it was probably velveeta. But whatevs, it was 5am and it was awwwesome."
        }, 
        {
            "index": 391, 
            "rating": 3, 
            "review": "Average food, good service. Ordered the America Breakfast. Portions were good. Hash Browns not well done and felt apart easily. Pancakes were decent though."
        }, 
        {
            "index": 392, 
            "rating": 3, 
            "review": "This is simple American diner food nothing special.  I only ate here because it's impossible to get an early breakfast in Vegas.  For a 24/7 town there's almost nowhere to eat between midnight & 7am which is more like 10am for east coasters.\n\nIt's reasonably priced breakfast for 2 for about $35.\n\nThe homemade donuts do look incredible."
        }, 
        {
            "index": 393, 
            "rating": 4, 
            "review": "I order my piña coladas here as they are the best in town. They are fresh blended and not a mix from a machine. Hot wings are a great late night snack. I wish they would bring the medallion steak salad back. They have made some changes and I feel maybe they are trying too hard to be upscale. It's the America bar and grill after all so shredded celery with hot wings is a bit over the top. Overall great place to eat just wish some of the old menu items were still available."
        }, 
        {
            "index": 394, 
            "rating": 5, 
            "review": "Last night in Vegas and my wife, our son and I decided to stay in our hotel (New York New York) and eat.  America was running a rib-eye steak special for $14.95.  We were pleasantly surprised by not just the taste but the size as well.  Well worth the money compared to other places on the strip.  I highly recommend giving it a try.  Ask for Chris if you do.  His service was outstanding despite being busy.  Manager also took the time to stop and ask how everything was."
        }, 
        {
            "index": 395, 
            "rating": 3, 
            "review": "Good food and it will satisfy your hunger.\n\nIt's a coffee shop and a good one at that. \nMy girlfriend had the  Mac and Cheese, it was huge and tasty and I had Bacon Avocado and cheese omelet was good too. \nA good play when you come in late like we did or justt want more then pizza before going to bed after a night of gaming."
        }, 
        {
            "index": 396, 
            "rating": 4, 
            "review": "$11.99 for a 16oz.ribeye dinner special.....definitely can't beat that.  I mean this was a pretty sweet deal especially when your luck is down.  (I was doing pretty good at the tables here)  Came here with my boys after spending hours at the tables.  They tried to get steak and eggs but for $13.99...ha no way.  I told them you might as well get the steak dinner and add eggs....overall you pay like a dollar more and you get a baked potato and veggies...I know I am so chinese.  The steak was not bad considering it was my 3rd one in a span of 24 hours....it was too big tho cuz I only ate half of it.  Great deal here...but its only from midnight to 5am I think."
        }, 
        {
            "index": 397, 
            "rating": 4, 
            "review": "Got to say that they have a great midnight - 5 am special for ribeye!! Everytime im drunk at 4am and ready to retire from the tables, America at NYNY delivers with a delicious steak!"
        }, 
        {
            "index": 398, 
            "rating": 3, 
            "review": "Came here for Late night snack. Starving from all the walking through the whole vegas strip. \n\nService:\nFood takes forever to arrive. Server was sweet though.\n\nAmbiance:\nInteresting decor. There is a huge decor of America in middle of room. High ceiling and huge place. There is a bar area where you can watch sports.\n\nFood:\nOne of the better chicken noodle soups I had where its not super salty to cover up the lack of chicken broth flavor. \nWe wanted sweet potato fries and our server recommended the brisket fries. Taste just like bbq meat on fries thats all it is. Its not bad though just nothing to rave about either. There is also way too many fat pieces on the meat i had to dig out. If you like all that juicy far, then this is for you.  \n\nCost: Fair"
        }, 
        {
            "index": 399, 
            "rating": 1, 
            "review": "The food was mediocre and the service was worst.  The waitress never stopped for more than a few seconds... Talking to us while walking away.  We had to ask for everything, including refills on drinks and our check twice!  There are many restaurants in Vegas to spend your hard earned money... Look elsewhere."
        }, 
        {
            "index": 400, 
            "rating": 3, 
            "review": "Anthony our waiter was the best part of our dining experience, food rating is 3 stars, Anthony who covered PePe's absence made everything a 5 star experience."
        }
    ]
}