{
    "category": "Las-Vegas", 
    "entity": "Todai-Restaurant", 
    "avg_rating_stars": 3.2615384615384615, 
    "review_count": 325, 
    "reviews": [
        {
            "index": 1, 
            "rating": 3, 
            "review": "Having been to a few Todai's on the west and east coast, I knew what I was going to get.  This one is located in the Miracle Mile Shops, but can be hidden if you don't walk down the hallway all the way to the end.  This particular Todai is one of the smaller ones I've been to, but like the other ones, has your typical fare, udon, ramen, tempura, but mostly sushi.  I judge sushi by the nigiri.  The selection was good but not great.  I've seen better. I been there several times, so I like it."
        }, 
        {
            "index": 2, 
            "rating": 4, 
            "review": "By far the best Todai I have ever been to. Love their poke. So fresh and the taste remained the same even after many months since I got to taste them again. Many different sushi to choose from and of course my favorite crab legs, that alone will definitely make me come back every time I am in Vegas.\n\nThere is a good selection of soups and dessert. Did I mention fresh made crepes where you can choose from fruits, chocolate, nuts and caramel stuffing or topping? Don't forget the green tea ice cream, and if you are not so much into the exotic flavor then there's vanilla.\n\nWhat's cool is you can walk off the calories after through the Miracle Mile shops."
        }, 
        {
            "index": 3, 
            "rating": 4, 
            "review": "Buffet sushi?  Doesn't sound like a good idea.  But this place convinced me otherwise.  \n\nTons of good sushi and other buffet items (crab legs, shrimp, teriyaki, salads, etc.) and I really tried my hardest to taste them all.  I don't think there was a single thing that disappointed, which in itself is pretty amazing.  \n\nFood:  5 stars\nService:  3.5 stars (quick to refill drinks and take plates, but took our soy sauce away as they were preparing to close about a half hour later.  Not cool.)\n\nThe one big issue I have with Todai that will probably impact my decision to return?  It's overpriced.  $35 for a dinner buffet?  C'mon.  Even for better-than-average food on the strip, it's still pushing the envelope at that price."
        }, 
        {
            "index": 4, 
            "rating": 2, 
            "review": "I had lunch at here. So no lobsters or oyster seafoods highlight. If you select specific foods, it is ok. I have to narrow down to following: \nIn sushi: salmon, eel, shrimp roll\nIn grill: yaki soba, shrimp tempura \nIn desert: green tea soft ice-cream, mocha cake, and of course fresh fruits\n\nI didn't try all but may be 80%.  Many others i cannot recommend unfortunately."
        }, 
        {
            "index": 5, 
            "rating": 4, 
            "review": "Atmosphere: very clean, very lively and well presented. Wait isn't too long and we can do reservations. \nFood: pretty good\nPrice: ok for a seafood buffet- slightly high."
        }, 
        {
            "index": 6, 
            "rating": 4, 
            "review": "I have only been to a few sushi buffets of decent caliber, but I would say this is probably one of the better restaurants for me thus far.   We went on a Wednesday night and it was pretty busy for a weeknight.  Good selection of hot and cold foods to choose from too!"
        }, 
        {
            "index": 7, 
            "rating": 4, 
            "review": "There was a serious sushi fest in my belly after leaving this place.  The buffet here was huge, with a great selection of sushi rolls, nigiri and sashimi.  Also had oysters, crab legs, and about a billion other things I didn't get to.  I did notice they had carved meat stations for people who like that sort of thing.  Dessert station was a bit small but they had a very good cheesecake and chocolate covered strawberries.  Sushi and chocolate covered strawberries in the same meal = Yum!"
        }, 
        {
            "index": 8, 
            "rating": 4, 
            "review": "Came here again w/ fiance on our second trip to Vegas. We managed to get line-skipping privileges at one of the buffets and almost forgot that we had purchased a coupon for dinner @ Todai from Tix4Tonight (highly recommended btw for cheaper show tickets). Dinner at Todai only runs until 9:30 on Sunday, and after 10 minutes of high-speed walking we managed to get there from Aria at 9:20 PM. The receptionist was surprisingly nice giving how late we were, and told us that we have 10 minutes to grab all the food we want since they're closing down in 10 minutes. No problem for us! We filled up 5 plates of delicious food with plenty of time to spare and had a delicious dinner. One of the waitresses grabbed an extra bowl for me later when she needed to take away the soysauce so I can pour some extra for myself. Despite the bad timing we got no dirty looks from any of the staff (which would have been quite understandable actualy), so I'm impressed! :)"
        }, 
        {
            "index": 9, 
            "rating": 3, 
            "review": "Par sushi ... the best thing about this place is all you can eat UDON!! Be creative ... and you can enjoy this place. Don't worry about all the rice they give you ... simply discard it ... or use it to make the table legs even and sturdy. They have lunch/dinner half off specials so buy your meal ticket elsewhere and save. You won't feel \"jipped\" by the thinly sliced fish, if you do."
        }, 
        {
            "index": 10, 
            "rating": 5, 
            "review": "Awesome buffet.  Sashimi was great, as was the dessert selection (highlights include chocolate covered strawberries and made-to-order crepes).  Service was fantastic.  Will definitely go back next time I'm in Vegas."
        }, 
        {
            "index": 11, 
            "rating": 4, 
            "review": "Remember people this is a buffet and not a fresh to order sushi place. Place can be pricey for dinner. You do get a good selection and tons of dessert. There is plenty of different things on the buffet even for non sushi lovers and the best part is the crepes for dessert. They will put out fresh sashimi style tuna and salmon, beware when the Unagi is put out. You will have to elbow your way through short Asian women visiting from Asia!!!!"
        }, 
        {
            "index": 12, 
            "rating": 2, 
            "review": "Seems like we eat at this Todai often when we come to Vegas. It's a tad better than the other locations I've visited but I am not crazy about their sushi. It just doesn't taste all the fresh to me. However, being that Vegas is buffet city I am sure I'll be a customer again in the future as it offers an alternative to the traditional buffets in town."
        }, 
        {
            "index": 13, 
            "rating": 1, 
            "review": "i love dining out at fancy restaurants and definitely spent a lot of money on food in vegas. \n\ntodai charged me $34 + tax & tips for really really bad food. sushi/sashimi wasnt fresh at all. everyone was like a hungry bear standing in line waiting for really bad quality oysters they would put out whenever they feel like (every 30 mins or so). crab legs had so much water in them because they were frozen for too long and were not well-handled. how could a normal/basic jap restaurant screw up a california roll? ASK TODAI. they sure know how to do it well.\n\nno wet naps. all buffet restaurants that serve craps and osyters and other food that require using hands would give wet naps. NOT this place. all the pictures of food they show you, you won't find any in the restaurants. i didn't expect it to be a 5-star restaurant, but at least be an average one for the price. if i wanted to go cheap, i would rather go to panda express.\n\nfor that price you pay at todai, pls go to Society Cafe at Encore or Bunchoun @ Venetian and you will be sooooo satisfied with about the price you pay for at todai."
        }, 
        {
            "index": 14, 
            "rating": 4, 
            "review": "This restaurant is located in the Planet Hollywood Hotel Casino. We went for the lunch buffet which was around 22 bucks per person not including drinks. They have a nice sushi selection and they tasted good and fresh. There was also a nice selection of Japanese cold salads and hot entrees. Do not miss the udon noodles bar. They also has a nice desserts selection and a made to order crepe station. I would definitely return here the next time I am back in Vegas"
        }, 
        {
            "index": 15, 
            "rating": 2, 
            "review": "Todai, Todai - well, this was not to die for, that's for sure. Wish I had read the Yelp reviews before going here instead of while eating here! That will teach me, but so it goes.\n\nHowever, needing to satisfy that raw fish urge that follows me everywhere I go now, we decided to eat here one evening while our carnivore friends did something else. Besides, we had a 10% off coupon and it was within walking distance. Sometimes that's how the choices are made.\n\nI was so excited! A seafood and sushi buffet! I just couldn't imagine what all-you-can-eat of my favorite things was going to be like. I thought it would be amazing for sure.\n\nThere were plenty of things I could've loved here. Unfortunately, no way to possibly try it all. I pretty much settled on sushi alone, and then added some tempura prawns and veggies towards the end.\n\nThe sushi was \"ok.\" So, now I'm becoming a connoisseur I see and can actually tell the difference! Ok, so perhaps this experience was a good thing. There was nothing wrong with it - it just didn't have the same wonderful wow factor that other sushi has given me. But, I persevered and tried almost everything they had set out. The nigiri was better than their rolls and got snapped up quickly by the predominantly Asian clientele  dining here. The tempura I had later on looked fabulous but did not really deliver in taste.\n\nHad I not just been to an all-you-can-eat crab fest last month, I'm sure I would've enjoyed the piles of Snow Crab legs served here, but I skipped those. Tons of other offerings, but little me just wanted raw and I can't consume much, so I didn't try the other choices of Korean BBQ, 3 kinds of soups, stir fry, and lots of cooked fishies. Desserts looked great and Larry had a plate full of those.\n\nService was fast and friendly with our waitress coming by constantly to keep my teacup full and clearing plates.\n\nIn the end, I felt the price had been somewhat high for the quality (around $28 per person to dine here with the discount) and then later on when I was back in our room, I found a 20% off coupon in the hotel magazine. Damn! Wouldn't have made much difference of course, but I hate it when that happens. \n\nI probably would try a different place the next time as I saw other sushi buffets mentioned that sounded better. I'd give 3 stars here but I just felt the price for quality wouldn't justify that."
        }, 
        {
            "index": 16, 
            "rating": 2, 
            "review": "I dined at this busy restaurant for lunch on Friday and was not super impressed. A friend had told me that I had to \"check it out\", so I did so without consulting the all-knowing Yelp.\n\nNothing special - that about sums it up. They were very stingy with the nigiri sushi and I had to make a request for tuna. The \"chef\" made me two pieces, but didn't refill the serving tray. I kept an eye on him with the plan of getting more, but he didn't during the next 30 minutes that we were there. \n\nOverall, I liked the shrimp tempura with a dipping sauce, salmon sushi, & the over-sized Sprite. Frankly, I was most thrilled that I didn't get the intestinal travel blues since we had tickets for Mystere that evening.\n\nThe $17.99 price isn't too bad if you have modest expectations and a cast iron stomach. =]"
        }, 
        {
            "index": 17, 
            "rating": 1, 
            "review": "If I could give this place no stars I would.  I understand that it is a buffet and so the quality of the food will not be optimal, but it was pretty horrible.\n\nThe food is bland and the sushi isn't very good.  Everything seems very low in quality and I suppose that this is due to the quantity.  I tried this place twice with a close friend and the second time I don't even know why I agreed to it.  I suppose it was because we were STARVING and really wanted sushi at this point...it seemed silly to have driven all the way to the strip just to drive back off and find a good sushi place.  I will NEVER go again.  It is a waste of money and quite a bit of money at that!"
        }, 
        {
            "index": 18, 
            "rating": 2, 
            "review": "todai in vegas is alright.. \nthey had few speciality rolls that i enjoyed.. not much sashimi available\nthe best part of dining in todai was making my own hwae dup bap (sashimi rice salad)  when i saw gochujang (korean hot pepper paste)\n i got a bowl of white rice and put salad and sashimi and gochujang all over! i had about 3 bowls and called it a day!"
        }, 
        {
            "index": 19, 
            "rating": 5, 
            "review": "It is a must if you bundle your show with lunch. Amazing food, all fresh. Awesome sushi, they use gloves and prepare and store food properly! Wait staff was amazing! My glass never hit bottom, they work together! I wish I could give them 10 stars, they put a cherry on top of my stay in Vegas! Thank you Aaron for your wonderful service and great food!"
        }, 
        {
            "index": 20, 
            "rating": 5, 
            "review": "Sushi was fresh and good.  Was much fresher than anticipated for a buffet."
        }, 
        {
            "index": 21, 
            "rating": 5, 
            "review": "Great experience\n+ sashimi was awesome\n+ udon\n+ crepe for dessert \n+ 10% entire bill when you have total rewards card. If you don't, get one it's free\n+ more sushi\n+ steak\n+ more on japanese food \n+ worth your money considering vegas buffet pricey\n+ we only paid $24 i think for weekend lunch time"
        }, 
        {
            "index": 22, 
            "rating": 1, 
            "review": "This place has horrible management. My husband loves this place and the only night we could fit it into our schedule was after a show one night. We got out of the show around 815 and made it there around 825. They actually tried to convince us not to come in because they close at 9. Hello this is VEGAS who closes at 9pm. We went in anyways and they were trying to rush us out the entire time. We got our bill before we even sat down with our first plate. I've even tried to talk my husband into going back when we have gone back to vegas and just go earlier but he won't because of how we were treated."
        }, 
        {
            "index": 23, 
            "rating": 4, 
            "review": "Was torn between giving them 3 or 4 stars.  Decided on 4 stars cause they are always clean.  We've been here 4 or 5 times for lunch.  The prices are reasonable and comparable to the more popular buffets at the hotels on the Strip at about $24 for lunch.\n\nThere is a plethora of sushi and other seafood to choose from.  If you don't like sushi, then there are plenty of hot entrees to choose from as well.  You're sure to find something you like.\n\nDon't forget to save room for dessert.  The crepes are made right there in front of you, and they taste delicious!  There are plenty of mini desserts to choose from and sample.  All of them are much better than the ones found in Chinese restaurant buffets.\n\nI recommend eating here rather than at Planet Hollywood's Spice Market buffet."
        }, 
        {
            "index": 24, 
            "rating": 2, 
            "review": "Really, Todai is totally overpriced and over hyped. It's not as great as people put it as. And it wasn't as great to match the price.\n\nI barely touched the sushi. It didn't feel or taste fresh. They take forever and a million more years to make ONE new roll. Geez!! I didn't dare try a lot of the raw stuff. Who knows how long it's been there. \n\nI basically stuck to everything else but the sushi. The dessert was delicious though. My favorite was the chocolate cheesecake.\n\nMy advice, you're in Vegas, and for about the same price, you can for sure go to a much much better restaurant. Try something that you don't normally see. I live in Northern California and Todai is around a lot.\n\nIt's too unnecessarily expensive to be honest."
        }, 
        {
            "index": 25, 
            "rating": 3, 
            "review": "Its a good buffet with a great selection of sushi, sashimi, and seafood.  I would say never go on the weekends.  It is just too busy and packed.  Everything has a long line and international tourists tend to ignore the lines."
        }, 
        {
            "index": 26, 
            "rating": 4, 
            "review": "Todai in the Miracle Mile shops is the only Todai restaurant that delivers the goods. Oysters were delicious but you need to get on top of them if you want a refill on your drink. Fresh sushi and sashimi as well as excellent poke. Be warned. If you arrive at tourist time you will be very unhappy. Pushy tourists of any background does not make the dining experience exceptional by any means. If you come midweek for dinner you will be pleased. They don't rush you and you'll have good value for the money. I've been to Todai in NYC and California and they both were terrible. Las Vegas is the only location where they do it right. Too bad no uni!"
        }, 
        {
            "index": 27, 
            "rating": 4, 
            "review": "For an AYCE situation, they offer some pretty High End offerings.  The salmon and tuna sashimi was my first form of attack.  Then a few specialty rolls, which were delish and constantly replenished, but I can't seem to remember at this time.  A cup of coffee and a tiny bite of my cheesecake and I off to accomplish more shopping, which makes this location so convenient."
        }, 
        {
            "index": 28, 
            "rating": 3, 
            "review": "I have been here a few times and the one in Oahu.  Let me first state i dropped a star because what seemed to be manager at hostess stand didnt really care somebody cracked there head open due to the fall of having a seizure outside his doors.  A patron ran in telling him to call 911 and he told the cashier to call somebody in the casino.  I said no you have to call 911.  The older woman was bleeding from her skull.  He just went about his business not skipping a beat.  Not once did he leave his stand to check or even see all the comotion.  Bad taste sir, bad taste.  Once inside its a free for all with pushy Asians literally running in to you as if they havent seen food in days.  95% of the patrons were Asians so I'm not making a racist remark by any means here.  The sushi is fresh.  The hot food always seemed low.  Soup is ok.. I just think i was put off by the whole scene."
        }, 
        {
            "index": 29, 
            "rating": 3, 
            "review": "went a long time ago, it was great with king crab legs for dinner.  \nwent last month - lunch, but was still good.  Udon was very good, no poke', no wait.  tempura - gotta catch it right from the fryer as it cools down quickly.   \n\nI would go again for lunch, with a coupon."
        }, 
        {
            "index": 30, 
            "rating": 1, 
            "review": "If you enjoy delicate sushi, don't come here. Actually, if you enjoy sushi at all then don't come here. It worst the worst sushi I have ever had. I went back to the sushi bar countless times trying everything, and it was all horrible. The yellow-tail was rough, the tuna had an unusually hard texture and the Sashimi salad mostly consisted of scarps, often with parts of the fish skin still attached. They even managed to mess up a vegetable chow mein. I thought I was finally in luck when I saw the chow mein filled hot off the pan in front of me, but I was wrong. There were loads of vegetables, but they were heavily doused in a thick-and-shiny, oily coat of what I presumed to be margarine. Why couldn't they have just cooked the vegetables in water, maybe add a touch of salt, some spices? It was so thick going down, a few bites stuck with me all the way back to the Bellagio, where I washed it down with whiskey.\n\nI really don't understand how people can enjoy the food here, or anything else here for that matter."
        }, 
        {
            "index": 31, 
            "rating": 4, 
            "review": "We come here each time we are in Vegas and it has always been consistent. Excellent lunch prices and so many varieties of fresh sushi and rolls, salad, fruit, and hot Japanese food such as tempura, teriyaki chicken, noodle bowls. The chefs work nonstop to make sushi. My favs are the soba noodles, rainbow salad, squid sushi, chef special hand rolls and many rolls. \nYum. Our family looks forward to eating here again."
        }, 
        {
            "index": 32, 
            "rating": 2, 
            "review": "I may not be the best to review this place since I didn't eat the sushi. The rice and teriyaki chicken were ok, but the rice had a weird taste to it. The tempura vegetables were bland and the desserts lacked flavor. I did enjoy the walnut tarts but that was the extent of what i really liked. Children should be free, especially since I have a child who decided 5 bites of dinner was enough. \nMy husband on the the other hand tried every single sushi roll they had because he liked them so much, so much so he got sick. \nit was my first and probably my last time there."
        }, 
        {
            "index": 33, 
            "rating": 4, 
            "review": "My wife and I visited the Miracle Mile Las Vegas location of this chain. This location only serves dinner starting at 5:30 PM. The price of $31/person seems to be the standard dinner buffet rate now in Las Vegas. \n\nThe sushi portion of the buffet is the most extensive I have seen and even included poke from the Hawaiian Islands. The crab legs seemed to be most popular, although I prefer the easier to eat peeled shrimp. Many other Asian dishes were included, but we both liked the Tephan Yaki made to order and brought to your table - my wife had the shrimp and I had the calamari. Wide range of desserts including made to order crepes and green tea ice cream."
        }, 
        {
            "index": 34, 
            "rating": 4, 
            "review": "You have to put this place into the proper perspective... it is a \"buffet\"; not a sit down high end sushi place, it's also not the \"Old Country Buffet\" of buffets either.  They had a pretty decent selection to try which was fun.  The quality of fish was still good, as it has to be somewhat OK since you can eat it raw.\n\nI thought for the price you really got a good deal, it may seem expensive but if you have ever eaten at a sit down sushi place $30 goes really fast.\n\nI thought it was a fun place to give a wide assortment of items a try but if I really wanted to go in for a top end meal of the same food it wouldn't be here; just like I wouldn't go to a dinner buffet for a really good steak.\n\nWith that said for what it is I think it is really good."
        }, 
        {
            "index": 35, 
            "rating": 3, 
            "review": "The restaurant is totally overpriced. The sushi is really nice and I would have preferred to just take from that one and not from the hot food. It felt like they had put all their effort on the buffé interior and nothing on the interior of the room which was a bit boring. \n\nBut as I wrote. If you are really in to sushi this is a Ok place with good location. It was a bit strange that we had to pay extra for a bad cup of coffe."
        }, 
        {
            "index": 36, 
            "rating": 1, 
            "review": "I love Todai's in Hawaii and Singapore this place was just not worth the price! Please remove the Todai name!"
        }, 
        {
            "index": 37, 
            "rating": 2, 
            "review": "Huge fan of Todai, so I dragged my woman to this one while we were in Sin City.\n\nBig Mistake...\n\nSushi sub par, atmosphere depressing, and hot food bleh.\n\nCompared to the Todais in California this is the Red headed step sister with freckles.\n\nSorry Todai of Las Vegas but Fail.\n\nPlease send a rep to Todai of Westminster and Steal that Mgr and bring her to this one. A la Patrick Swayze in \"Roadhouse.\""
        }, 
        {
            "index": 38, 
            "rating": 4, 
            "review": "Went on 9/10 around 8pm\nThe worst part was the walk from the strip to the restaurant :)\nPricey, but when you consider the prices of the other buffets on the strip it is not bad.\nStuck with water since this was already at the top of any budget I wanted to spend.\n\nI felt I needed to eat my money worth and set forth to do so.\n\nI enjoyed the sushi, especially since when it was really bad you didn't have to eat it and you didn't feel like you were wasting money by not eating it.\nWhen you found a sushi you like you would have to go up multiple times since there would only be a couple pieces on the buffet.  Not sure if this was because of the hour or it is how they always stock it up.\nWas it awesome sushi? Not really comparing it to a sit down restaurant paying by the roll, but it was awesome sushi for a buffet.\n\nThe hot food was decent, the fresh grilled octopus was delicious, the first batch had been there a while and was extremely tough.\n\nThe Udon soup was very flavorful and you can decide what you wanted in it.\n\nThey have a tappenyaki station which I never even visited, my daughter would be so mad at me :) \n\nI am not much of a dessert person, not that I needed it, but I tried the green tea ice cream which was pleasant.\n\nServer kept the table clear of empty dishes and was prompt refilling my water.\n\nGreat choice for someone wanting a major sushi fix and has friends that want something besides sushi.\n\nYou can get a discount for going on your birthday, the amount off depends on how many people are in your party. 15% off up to free."
        }, 
        {
            "index": 39, 
            "rating": 1, 
            "review": "I normally go to a Todai on someone's Birthday. One thing I love there is the custom crepes. Other items there are just so-so, including crabs for dinner.\n\nThis Todai got 1-star not for its food but for its attitude. It was a few years ago. We were planning to have a quick lunch there before we go to the airport. We arrived before it opened for lunch and there was a very long line before us, but we figured we could still make it. However, it was not opened as scheduled, although I saw waitresses inside chatting with each other to kill time. 15 minutes passed and still no one opened the door or just explain to the crowd what was happening and when the door would be opened.\n\nI can accept mediocre food for the price but this restaurant showed no respect for customers and I will never go there again."
        }, 
        {
            "index": 40, 
            "rating": 4, 
            "review": "Awesome and safe for a sushi buffet. Everything is prepared right behind the line and rotated appropriately."
        }, 
        {
            "index": 41, 
            "rating": 4, 
            "review": "We went back and had a much better experience.  We came about 9:00 pm, they close at 10 pm so keep that in mind if you are planning to come here.  The sushi was plentiful and fresh.  If you don't see something out, like sashimi, just ask and they will cut some for you.  The desert station was wiped out though, which was disappointing.  Our drinks were filled and plates were taken quickly.  They do stop making sushi about 15 minutes before they close, so pile up that plate and get what you want.  I definitely noticed a change since our last visit so yay for that!!"
        }, 
        {
            "index": 42, 
            "rating": 5, 
            "review": "I have to say that Todai is the Japanese Buffet that all others in this town should model. The service was great and the food plentiful.... more than plentiful. \n\nA Vegas Oasis"
        }, 
        {
            "index": 43, 
            "rating": 4, 
            "review": "In a buffet town Todai is the class of the class. Yes it is all you can eat sushi. No they don't complain if you don't eat your rice. They have sushi, tempura, edamame, sashimi, miso soup, pot stickers and more. This doesn't even touch on the fruit or dessert bar. Make your own crepe anyone???\n\nAnd that is just lunch. During dinner they up the ante with crab legs and peeled shrimp.\n\nJust remember to grab the $5 coupon out of the taxi cab guide.\n\nThis is a Vegas must for me."
        }, 
        {
            "index": 44, 
            "rating": 3, 
            "review": "I'm not going to pretend that the food here is particularly high quality.  It's not.  But when you're in Vegas, sometimes it's all about indulging - or overindulging, as the case may be - and on those days, Todai is there for you.  They offer a slew of sushi selections, some sashimi, crab legs (usually only at dinner time), a selection of hot Asian entrees, a selection of salads, some made-to-order noodle soups, and a variety of tastes-like-it-came-from-a-box desserts (one exception:  the made to order crepes are delicious).  \n\nI'm usually a quality hound when it comes to food, but there is nevertheless something truly delightful to me about all-you-can-eat sushi, even if it's a hair on the mediocre side.  I just love it so much and can never get enough of it - except at Todai.  Todai indulges that little girl within me who keeps saying, \"More, more, more!!!!\" even when the adult Michelle knows it was time to stop a while ago.\n\nIt does get crowded, so coming at off-peak hours is your ticket to not having to wait.  Also, check out the ubiquitous coupon books that you can get in the cabs and on the street in Vegas; they often carry coupons for a few bucks off at Todai.\n\nOh, and free meal on your birthday!  Gain five pounds in one sitting, courtesy of your friends at Todai."
        }, 
        {
            "index": 45, 
            "rating": 4, 
            "review": "Todai is probably the best Japanese sushi buffet I have ever had. Their food selection is pretty thorough. They have a salad bar, fruit bar, dessert bar, soups, taco (random), small American meats section, a wide selection of Japanese dishes (even suki yaki) and a huge sushi and nigiri selection. I was taken aback by the selection. I think it's worth the 21.95 if you like sushi. The Japanese hot dishes are decent, but the sushi was exXxcellentee!  Obviously it's not fine grade shite, but for a buffet, I was impressed. Also, I have to say, the salmon they used was very fresh. I'd totally come back to Todai the next time I'm in Vegas.        \n\nVisit Todai, today! ( har har har)"
        }, 
        {
            "index": 46, 
            "rating": 3, 
            "review": "Went for lunch. This place runs like clockwork. Tour bus load after tour bus load of Asian groups pile in for what I call, \"Disappointment That Is Still More Comforting Than American Food.\" It doesn't matter how bad the sushi, miso soup and rice are, it's still better than pizza, meat and potatoes, in the eyes of the Asian Persuasion. \n\nThat said, I did enjoy the tempura, tentsuyu (tenpura dipping soup), \"Hong Kong Style Eggplant\", orange chicken, and small crepe bar (Nutella, banana, whipped cream). And don't judge, but I skipped out on the sushi. \n\nWould I go back? Only if I bundled it with a show at the Saxe Theater. The price is $11 cheaper when you bundle (regular price for lunch: $26 | dinner: $38).We saw Vegas! The Show, and to call it a pleasant surprise would be a grave understatement. But that's for another review."
        }, 
        {
            "index": 47, 
            "rating": 2, 
            "review": "I haven't been a big fan of Todai in a while.\n\nI'm absolutely convinced that last Fall's bout of food poisoning I thought I was going to die from was a direct result of their oysters.  But the missus likes the place, and well, you know how that goes.  I just avoid the oysters like they are cursed.\n\nI'm generally okay with Todai as long as I make smart choices.  I've always thought it's a little pricey (when Yama Sushi has a much more fresh tasting menu for a cheaper price), but we went for lunch yesterday, and lunch is a cheaper meal.\n\nExcept for yesterday.\n\nWhat should have been a $20 dollar meal turned out to be $40 a person.  Why, you ask?  Mother's Day.  So let me get this straight: To celebrate the love and all of the wonderful things our Mothers have done for us throughout our lives, the restaurant decides to celebrate Mom by charging double their regular prices on the same meal selections they offer the other 364 days of the year?\n\nGod, I'm going to dread seeing how they decide to honor our Dads.\n\nSeriously, no balloons, flowers, nothing.  The server made no mention of the price doubling, though they maintained they had a sign out front.  And to their credit, they did... in a fairly discreet location that you could miss if you didn't go down the right walkway to get into the restaurant.\n\nThe people in front of us complained, as did we, and the manager very nicely apologized and gave us 20% off the meal's cost, though it was still more than what an average lunch would cost.  No incentives or unique items did not make it worth it.\n\nI imagine I'll be back as the missus loves this place, and well, you know how that goes.  I just felt it was sneaky to double the prices, make no real mention of it (even on the website), and offer nothing to justify the \"value\" of this upgrade. \n\nBad form, Todai.  Bad form."
        }, 
        {
            "index": 48, 
            "rating": 5, 
            "review": "I really love the restaurant, very clean open space, very good flavors, colorful displays,excellent staff service, they will pick up and clean right away, I also noticed one server changing all the sushi tongs and trays for clean ones.\nI am very pleased with price as well."
        }, 
        {
            "index": 49, 
            "rating": 1, 
            "review": "Las Vegas strip offers the best cuisines of the world... WRONG!!!!!\nBecause it's the best, it has to be very expensive.... CORRECT.\n\nTodai is definitely the exception to the first... for $35 a person... in Nov 2009.\n\nI love sashimi... it tasted old here. The variety of sushi and Maki was minimal. It's not the same Todai I remember from various cities such as Plano TX, Portland OR, Pleasant Hill CA, or Orange CA. Todai destroyed the only Sashimi buffet in Phoenix... like Wal-mart... conquered and gone.\n\nThinking about it still leaves me a bad taste as of today. My thought of Todai has gone down tremendously after another try in Chicago lately (see review). Luckily there are many competitors springing up in southern California and various cities.\n\nDiner beware. You will enjoy stale fish here... you may not get diarrhea."
        }, 
        {
            "index": 50, 
            "rating": 4, 
            "review": "Great price for all you can eat sushi! Quality is good but I do remember in years past a little more selection. I will go again!"
        }, 
        {
            "index": 51, 
            "rating": 1, 
            "review": "The food here is gross.  I bit into a baked and breaded shrimp and it was not even shelled.  I spit it out and put it on my plate.  All of the food has a greasiness to it.  It has a common taste to it, as if they cook everything in the same wok without washing it out.  I did not feel very well after eating here.  I mis read the price list. I thought it was $21 for dinner, but no it was $31 for dinner, and by the time you add sales tax it worked out to be $36.00,  Wow that is a lot of money!   There are a lot of great restaurants in Las Vegas, and in the $36 range, you can get some incredible food, just not here."
        }, 
        {
            "index": 52, 
            "rating": 4, 
            "review": "I visited this establishment for the first time last month when I attended a trade show / conference. I went to Todai's on a Monday evening, right when they opened for dinner.\n\nI went specifically for sushi and sashimi and there was quite a selection. There was also a huge selection of cooked foods and desserts, but I didn't bother with any of those.\n\nI'm sure there a lot of sushi addicts who will argue that the place is average, but I found this location to be easy to get to (10-15 minute walking distance from any major strip hotel) which is a huge plus for me (since I hate to drive around in LV and don't like to waste money on a cab if I'm sober).\n\nThe restaurant was clean and the waiters/staff were attentive. \n\nI'm not sure how this place would be on a Fri/Sat/Sun night, but my experience on a Monday evening was more than acceptable. A bit on the pricey side, but it's all you can eat."
        }, 
        {
            "index": 53, 
            "rating": 3, 
            "review": "Make sure you go to one of the information desks at Miracle Mile and ask for one of the coupon books they have since there's one for 10% off your entire party's cost for Todai!\n\nThe sushi is fresh and is made tinier than normal sushi-- ostensibly so that you can try all of the different types of sushi without getting super full, which is nice. I came here mostly for the udon. Warm noodle soup after a long night in Vegas? Yes please! I do think that there are better sushi buffets in Vegas (e.g. Makino), but Todai is not a bad option if you're looking for more general seafood/something more than just sushi.\n\nInside it's spacious and has the same decor as all Todai's. Oddly, even though there were plenty of open tables when my group of 8 stopped by, when we asked to switch to a table closer to a TV, it caused kind of a ruckus. Other than that, the staff was very nice.\n\nUnlike other buffets, you have to pay extra for drinks, which is kind of a pain. Also, beware-- they clear away the food after lunch, so even though they may let you sit in the restaurant for past the lunch hours, all the food is sadly gone.\n\ntl;dr: I don't really have anything against Todai. The food is good and plenty, but Todai is a chain, and I don't necessarily think you have to go to Vegas to enjoy it."
        }, 
        {
            "index": 54, 
            "rating": 4, 
            "review": "I had VERY high expectations, since I have never been in a buffet that charges over $30 for dinner.\n\nSure enough, there is LOTS of variety to choose, ranging from Japanese to steak and chicken. The sushi was better than most buffets I've been to, but much smaller. Nevertheless, quite tasty.\n\nThe lost star was split into two: Half of it is that it didn't feel it was worth the over $30 a head, and the other half is that they were very slow in clearing the dishes every time we're done one meal."
        }, 
        {
            "index": 55, 
            "rating": 5, 
            "review": "Walking by and seeing $32 for a buffet dinner was a little bit of a cost shock to me. Then again it's Las Vegas. I've been here before for lunch and know that the food here is PHENOMENAL. Still not sure I peaked inside, saw crab legs and knew that I was going to get my money's worth. I did it right tonight.\n\nYou'll find a nicely decorated restaurant. Pay attention when checking  out the place. A fruit bar, in the middle of the restaurant, is an octopus that comes from the ceiling. How fitting for a sushi joint. The restaurant is well lit, clean and has a hip and trendy yet casual look that fits nicely into Vegas. My guess is that this place gets more than just tourists like me. I'd bet that locals come here quite often.\n\nYou'll find all types of sushi: typical California rolls to octopus, to different variations of tuna and salmon rolls.  I had a very significant share of their sashimi. Easily $20 worth served in any sushi restaurant. Their crab legs were not only delicious but the crab meat came out just perfect to dip into their melted butter. I think I had eight raw oysters, an easy $15 in any restaurant back home in Virginia Beach. They even serve hot foods to cater those who are intimated by raw fish. I tried a small piece of their prime rib and really enjoyed their flavorful bacon wrapped asparagus.\n\nI finished off my fat kid adventure with an okay tasting green tea cheesecake. But what I really enjoyed was the strawberry-banana crepe offered in the dessert section made in front of me.\n\nThe best part of my trip here was my request for wet naps because of my sloppiness with my crab legs. I was expecting those stupid packaged wet naps you get at the store. Nope. We were given hot wet towels! Simple, but a short and awesome experience after a delicious dinner.\n\nOkay, so I'm not often interested in spending $32 on my any meal but I will certainly come back again...perhaps even on this trip."
        }, 
        {
            "index": 56, 
            "rating": 5, 
            "review": "This is seriously my favorite Japanese seafood buffet! Definitely worth the price! I love all their salad, sushi, sashimi, crepes, and Japanese dishes. Yummmmy oh and don't forget desert"
        }, 
        {
            "index": 57, 
            "rating": 4, 
            "review": "Let's get right to it since that's what buffets are all about, so here goes... $24 for lunch on a sunday,, on the strip!? Sure why not! I love a good buffet.\n\nMy friend was adamant that we go here since he said that they specialize in tempura and sushi. Specially at lunch time. They do have an awesome spread. One\nside is cooked food, and the other is rolls and sushi. Both separated by a salad spread. Then on the very back side of the restaurant is the desert spread.\n\nAnyways, it's a great buffet and fairly priced for it being right on the strip. They have chairs and tables for you to eat your awesome plates of amazing food. The service is great as well, our plates were cleared right after we've gotten up to retrieve our 2nd and 3rd helpings. Out waters were automatically replenished and life is super awesome. \n\nI can not find anything wrong with this restaurant. This is an awesome place to eat. So come on in and enjoy some good sushi. If lunch was that good,,, I can't wait to try them out for dinner one time. (\",)\n\nLife is amazing when the glass is half full.\n\nWeeeeeeeeeeee!"
        }, 
        {
            "index": 58, 
            "rating": 4, 
            "review": "I'm a huge sushi fan, and Todai delivered.  I've never been to a sushi buffet before, but this is what I imagined it would be.  For $30 you get a very fair variety of sushi, and a very relaxed atmosphere (compared to the rest of Vegas).  I'd definitely go back.\n\nPRO:\n+Very quick plate removal\n+Quality of the food is very high\n+Variety of cooked food and sushi is fairly robust\n+My coworker loved the oysters they served\n+Fairly large sashimi section\n\nCON:\n-It's hidden away inside the Planet Hollywood miracle mile.\n-There were a lot of California roll varieties and not a ton of true sushi rolls\n-Desert was lacking.  You could get ice cream, but you had to ask.  The other options were small and stale.  I'd skip that section next time."
        }, 
        {
            "index": 59, 
            "rating": 3, 
            "review": "Alright so Todai first off, opened late. I know servers need their meetings, but it's rude to keep hungry people waiting! I started off with the sushi and thought it was decent. Some pieces fell apart which made it hard to eat but it still tasted pretty good.  Then, I had chow mein. I LOVE chow mein so I'll pretty much eat it everywhere I go. It was definitely decent but not wow I need more ASAP. I also tried the Udon soup and I really enjoyed the broth.  The tofu they put in my bowl did not taste good with the broth though. I felt like the tofu had another taste that didn't fit well with the brother. The desserts were super cute! They're bite size and pretty good. I tried the flan and the chocolate piece of cake. It wasn't outta this world but I still ate it. After the server dropped off our check, she never came back. We got our waters refilled from a server who was refilling everyone's water. The service as well as food was satisfactory for paying about $23 each after tax. The atmosphere was the nicest part probably, more than the food. I say if you want to eat A LOT then it's worth it. I was wearing a slim dress so I could barely breathe after my 2nd full plate! The food is good enough where you can eat large amounts. I think I didn't eat enough because I didn't recognize some of the foods they had so I didn't try it. I would go here again, I just gotta make sure I'm ridiculously hungry the next time around to get my money's worth!"
        }, 
        {
            "index": 60, 
            "rating": 4, 
            "review": "After a somewhat long flight from Toronto to Vegas and arriving at the hotel at around 1 pm by my lonesome, I had no idea what to eat.  I'm not the biggest fan of traditional American food, so when I saw a Japanese and Chinese buffet, I was totally psyched.  \n\nThey had a huge sushi bar and I needed at least two trips to the sushi station to even get one roll of each.  In addition, there was also a teppanyaki station and a small assortment of Chinese/stir-fry foods.  I don't remember the price, but I think it was $20/person including a drink.\n\nWhile the sushi isn't top notch, it'll do for a Vegas experience, because Vegas is all about doing things bigger. Will visit next time I'm in Vegas again."
        }, 
        {
            "index": 61, 
            "rating": 4, 
            "review": "Last night in Vegas so we were tired of fighting crowds on the Strip and paying too much for food. We had terrific time at Todai. The price for the night-time buffet is reasonable and the selection is very good. Items were continuously restocked. The sushi was very fresh. The staff was friendly. The restaurant was super clean and the tablecloths were changed after each party finished."
        }, 
        {
            "index": 62, 
            "rating": 1, 
            "review": "If i could give a - star for them i would have , BAD FOOD BAD SERVICE AND BAD ATTITUDE well that just explains we went for Dinner of 7/2 and 8/18 i'm still pissed at them for the way the reacted , Variety of Sushi is a joke , i don't know how they have managed to stay in business being a LOCAL i definitely don't recommend this place"
        }, 
        {
            "index": 63, 
            "rating": 3, 
            "review": "The sushi was average, but good for a buffet.  There were select things that were very good.  I really enjoyed their galbi and poke tuna.  The service was decent.  The $40 price kept me from being too pleased with my meal."
        }, 
        {
            "index": 64, 
            "rating": 4, 
            "review": "This place brought me back many childhood memories when I used to live in San Jose, they used to have one by Eastridge mall or was it Valley Fair? Whichever it was, it was the place to go to and we celebrated our family member's birthday or just when my parents are lazy to cook.  Unfortunately, the one in SJ closed and they turned it into Tomi now? But I loved their different variety of seafood and desserts, especially the baked giant shrimp that they baked and sliced in half...mmmm.  My friend also had great childhood memories at Todai herself when she used to go Hawaii so she said we definitely have to hit this one up! We went for lunch like around 12:30pm, which was about $22 on a Saturday and it was still pretty slow so we got seated quickly.  I was so eager to see what they have for seafood but it wasn't much and they didn't have that baked shrimp I was dreading for but it fulfilled some of my seafood cravings, and luckily they have udon, which cured my hangover.  The sushi was good, very small which was a good thing so you wouldn't get too full and tired from eating the same roll and they had a crepe station as well!  They had dessert and they were all mini too, so cute! but the strawberry cheesecake was pretty dry so I had to pass on that and just got a crepe instead.  I think the Todai I had in SJ was great as far as I can remember.  Or maybe because I went during lunch but it won't stop me from coming back to the only place that brings back fun childhood memories!"
        }, 
        {
            "index": 65, 
            "rating": 4, 
            "review": "For a sushi buffet it was great. So many choices and whatever kind of sushi or sashimi you like, they have it. Tons of spicy tuna for those who love it including rolls, wrapped in seaweed, and placed over rice. The udon noodle station is awesome as well as the green tea ice cream. If you're looking for sushi on the strip, this is the place."
        }, 
        {
            "index": 66, 
            "rating": 2, 
            "review": "**Summary**\n       - Value - They buffet would be a really great $25 buffet, but charging $32-$34 for dinner seems a bit steep. For that much, Bellagio and Wynn is a much better bet.\n       - Sushi - Everything I enjoyed at this buffet aside from the salmon sashimi (which you have to fight for because everyone keeps taking it) was not sushi. For sushi, there are many better AYCE sushi places that aren't buffet style.\n       - Downhill - They use to mini lobster tails or baked prawns. Now they have tiny baked shrimp. It seems everything about this place has gone one notch down.\n       - Ghetto - They were using butcher paper to cover the tables that had tablecloths on them. Is it that hard to wash a tablecloth?\n       - Yummy - A lot of the non-sushi items are quite good, such as the crab and baked shrimp. However, for this price and the fact that this is a sushi buffet, I think they've missed their mark.\n**Price**\n       - $19.95 Lunch Weekday Buffet\n       - $21.95 Lunch Weekend Buffet\n       - $31.95 Dinner Weekday Buffet\n       - $33.95 Dinner Weekend Buffet (http://www.yelp.com/biz_photos/zkhBU5qW_zCy0q4OEtIrsA?select=6Svn8N_PGnbXqiXqoaYsBQ)\n**Ordered**\n       - Prime Rib and other meats - They were disappointingly dry and tasteless.\n       - Sushi - All of the rolls are generic and uninventive. (http://www.yelp.com/biz_photos/zkhBU5qW_zCy0q4OEtIrsA?select=QjFBUjv_lA4FBkM2VhjBog , http://www.yelp.com/biz_photos/zkhBU5qW_zCy0q4OEtIrsA?select=1ScG5oGsdKNFmbatM_JtRA , http://www.yelp.com/biz_photos/zkhBU5qW_zCy0q4OEtIrsA?select=jTAljakiUhHQ2kKxWDb_BQ)\n       - Sashimi - Salmon, Tuna, White Fish. The salmon was pretty fresh, but it was almost always empty.\n       - Oysters - Given it's June, I guess I can't blame them for not having fresh oysters. (http://www.yelp.com/biz_photos/zkhBU5qW_zCy0q4OEtIrsA?select=gb4eC0Vju4VCSxteiHs68Q)\n       - Baked Shrimp - A lot smaller than their baked prawns, but they're still pretty good. (http://www.yelp.com/biz_photos/zkhBU5qW_zCy0q4OEtIrsA?select=zy_n8EHfNnFGFItdxGnEmw)\n       - Cocktail Shrimp - A little small compared to other buffets at this price range. (http://www.yelp.com/biz_photos/zkhBU5qW_zCy0q4OEtIrsA?select=ZSdcQvt0oHJxr17HQLrJtQ)\n       - Crab Legs - Fresh with crisp shells. However, they lack flavor. (http://www.yelp.com/biz_photos/zkhBU5qW_zCy0q4OEtIrsA?select=zWgGzVKsrZPmVpuk8MyH1Q)\n       - Dessert - Their made to order crepes and creme brule are delicious. (http://www.yelp.com/biz_photos/zkhBU5qW_zCy0q4OEtIrsA?select=Q0HICJI4TvbJvZuN0diD2g)\n**Recommendations**\n       - I wouldn't recommend this place. The quality used to be so much better. However, it seems that they've since raised their prices and lowered the culinary bar."
        }, 
        {
            "index": 67, 
            "rating": 2, 
            "review": "Why would I go to Todai when there are so many other buffet options in Las Vegas? Well, because I had a free pass to go there.  Todai was actually a refreshing change of pace to the heavier fare that is common on the strip. Its Todai.  Lots of Asian food and lots of cheap sushi. It's not bad, but it's not good. I wouldn't go back if it wasn't free."
        }, 
        {
            "index": 68, 
            "rating": 5, 
            "review": "So nice that a buffet actually makes fresh Handrolls by request ! Super ono. Friendly servers, our drinks we're never empty. English save room for crepes and ice creams"
        }, 
        {
            "index": 69, 
            "rating": 1, 
            "review": "It was sooo different from the reputation I heard from my friend.\n\nIt seems one of their employees does not know about service. \n\nand overall sushi taste, side dishes and teppanyaki are not very good.\nI have been other sushi restaurant around the US. \nThis is the worst place I have ever been to, even though I was so hungry..\n\nI would never like to go there again."
        }, 
        {
            "index": 70, 
            "rating": 2, 
            "review": "6 years ago when I was a tourist in Vegas, I thought this was the best sushi buffet ever.  I went last week and totally thought it sucked.  Makino, Sushi Factory, Sushi Hana, Sandai...all better than this place.  The buffet was just a vast sea of mediocrity at best.\n\nOne funny story though when I was living in NYC and came here with a friend. We had eaten a ton for lunch and were stuffed to the gills BUT THEN my friend saw they made crepes in the back.  He loves crepes more than almost anything in the world.  SO...he went to the bathroom to puke so he could have some room for crepes!!!  RIDICULOUS!!"
        }, 
        {
            "index": 71, 
            "rating": 4, 
            "review": "I've been to Todai in Fairfax and i liked it a lot. When i heard thay they had Todai in Vegas, i was excited and finally decided to do something about my sushi roll addiction.\nWe were seated right away as it was lunch on a Thursday. To my surprise, the restaurant wasn't busy at all even compared to other restaurants inside the Planet Hollywood. All that aside, I rushed to grab my first plate. My first plate consisted of different kinds of rolls they had and some nigiri. They had your everyday california roll to spider roll, dragon roll, spicy tuna roll, caterpillar roll, and even 'chef's special' roll. All the rolls were good, although nothing special. I did like one of their rolls but I cannot remember what it was called. It was shrimp tempura stuffed with rice and something else, but it was pretty good. All the fish used for nigiri sushi was fresh and it wasn't too overloaded with rice which is very important in my opinion when it comes to sushi. \nFor my second plate, I got everything else they had besides rolls. They had several kinds of tempura (shrimp and vegetables), chicken and beef variations, fried rice and noodles, and, to my surprise, turkey (random). Their tempura was good, as it was crispy and not so greasy, just how I like them. They also had Teppanyaki station, but I didn't get to try because I was already stuffed. Now their udon is the good stuff. I don't expect much when eating udon at a buffet after trying udon at Makino at the Premium Outlet on Charleston (their soup for udon was terrible). Todai's udon was great! Their soup was very well flavored, without overusing artificial flavor (not sure about this but it didn't taste like artificial flavor loaded soup).\nTheir desserts are not bad. I had some green tea ice cream which was good and 2 dollar coffee with refills? not bad not bad.\nOverall, very satisfied. Food was great, service was good, and ambiance...not bad. I would like to go back in the near future."
        }, 
        {
            "index": 72, 
            "rating": 5, 
            "review": "My wife and I have been to most of the buffets in Vegas and Todai is still probably our favorite because of what you get for the money.  Stop by a Tix4Tonight booth on the strip and by yourself a $2 coupon and the buffet will cost you about $27, so about $29 total before tax and tip.   We went there on Wednesday night(10-9-13) and once again the Snow Crab legs were decent size, fresh, and delicious.  They're not already opened for you which some people may not like, but I prefer them this way as they're kept more fresh and don't dry out.  The sushi was again very good for a buffet, especially the sashimi.   Probably the best sashimi and overall sushi selection at a buffet in Vegas.  They have other hot foods also, but their seafood, sushi, and sashimi is the best bet and well worth the price of admission all by themselves.  Their prime rib was actually juicy and good also on this particular trip, but still not at the level of other pricier buffets.  The biggest surprise on this particular visit to Todai was the raw oysters.  I usually never eat more than 1 or 2 raw oysters at any buffet including Todai because they're typically not 'fresh', no matter how fancy the buffet is.  But this time the raw oysters were completely fresh with a perfect slightly salty taste and no strange after taste.  So I had about a dozen which was a rare treat.  The desert bar is fairly minimal, but my choices of chocolate-covered strawberries, pumpkin pie slices, and creme brulee were delicious and sufficient.   Overall, if you want all-u-can-eat good seafood and a solid selection of other foods and you don't care about having a fancy decor, you just can't beat this buffet for the price.   Friendly staff also.  We will continue to visit this buffet on every trip to Vegas."
        }, 
        {
            "index": 73, 
            "rating": 4, 
            "review": "Pros: Sushi Buffet\nCons: Too much selection??\n \nThoughts: This is one of the better buffets , in a sea of MANY in Vegas. I would probably put this next to the one at the Bellagio. In terms of buffet, maybe this is a healthier option, since it's without the grease... unless you go with all the fried stuff."
        }, 
        {
            "index": 74, 
            "rating": 4, 
            "review": "Good value for $35. Could have been better w more fish than rice in sushi pieces."
        }, 
        {
            "index": 75, 
            "rating": 2, 
            "review": "Before moving to Vegas years ago, I liked Todai.  Back in the Midwest, we didn't have Japanese buffets.  Simple ol' me from 6 years ago was content with their sushi, sashimi, tempura, desserts, etc.  It's called settling.\n\nThen when I moved to Vegas 6 years ago and started trying AYCE sushi restaurants, I was enlightened.  I started noticing things that I didn't before.  Loosely made rolls, dry sushi rice from sitting in the open too long, imperfectly cut sashimi (I'm hoping they don't use a butter knife to slice fish) -  all these details started to bother me.  That's the problem with chains - quality isn't there.\n\nThe location is good.  You can just do valet right outside Planet Hollywood (east side).  So, if you're a tourist or don't know any better, Todai might be ok until you try smaller AYCE sushi restaurants this city has to offer.\n\nYou can eat for free on your birthday.  They have a chocolate fountain and that's about it."
        }, 
        {
            "index": 76, 
            "rating": 3, 
            "review": "The food is good, but not worth the price.\n\nFor the same price, especially in Vegas, I can get pretty decent food. Eating california rolls or some other rolls really shouldn't cost that much..."
        }, 
        {
            "index": 77, 
            "rating": 3, 
            "review": "Came here on a Saturday night, about 6 pm, after a failed attempt to get into another seafood buffet, where a line wait was over one-and-a-half hours, and we were seated immediately at Todai.  We are sushi snobs, and love to enjoy and critique sushi roll innovations,  combinations, textures, etc ,etc etc.  Here, we came with expectations congruent to a better sushi buffet restaurant. \n\nThe sushi offerings were \"typical\" as found in better sushi buffets: plenty of rolls and nigiri, but here they also had sashimi, and a variety of hand rolls, as well as constantly replenished fresh oysters, crab legs and peeled shrimp.  The plentiful hot selections, as well as the teppanyaki and udon offerings make this a great destination for fans of the Japanese cuisine, who don't want to wait forever in line.  \n\nAnd of course - don't forget the desserts and drinks: we loved the Sho Chiku Bai Nigori unfiltered cold sake!  THREE-AND-A-HALF STARS"
        }, 
        {
            "index": 78, 
            "rating": 3, 
            "review": "Our party came here for lunch on our last day in Vegas and Todai has a vast sushi selection!  Their sushi and sashimi were very fresh. They also serve crab legs.  Teppan yaki and crepes were made to order.  Deserts weren't that great and tasted bland.  The place was very clean and the staff were very nice and accommodating.\nMy party of 9 left here very satisfied and stuffed!"
        }, 
        {
            "index": 79, 
            "rating": 1, 
            "review": "I came here because I thought it will be the same in SoCal. Food terrible and bad service. Won't come back."
        }, 
        {
            "index": 80, 
            "rating": 4, 
            "review": "Buffets should take a page out of Todai's book when it comes to assembling their dessert sections.  Todai's desserts are portioned into 1-3 bite sizes, which is perfect...since I usually sample 4-7 different desserts at any buffet I visit (I only wish I were kidding).\n\nThe jelly rolls are AWESOME!\n\nThere was also a GIANT bowl of Hawaiian Poke Salad which I would have devoured if it were socially acceptable.  Sashimi was surprisingly fresh and tasty.  The sushi rolls, however, were dry and inedible.\n\nWe saved $6 by purchasing our dinner passes from Tix 4 Tonite.\n\nDid I mention the jelly rolls??"
        }, 
        {
            "index": 81, 
            "rating": 3, 
            "review": "I love sushi and they have a wide selection on sushi. everything thing else the serve is great. \n\nThe service sucks. we waited at the door for a good ten minutes to be seated, when they were not even that busy. There were four of us that went to dinner and i asked to sit at a six top table because we wanted a little more room, and the hostess was like \"NO you only have four people\" and there were about 15 six tops open.\n\nSo when you go here to eat keep in mind that you are not going to have the best service."
        }, 
        {
            "index": 82, 
            "rating": 4, 
            "review": "This is the best Todai I've ever been to. I didn't know they serve different foods at different places. This place had the biggest selection of sushi from all the Todai's I've been to (I think I've been to 4 different ones). This place doesn't skimp on anything either. If you're hungry, happen to be around Planet Hollywood, and looking for some decent sushi in vegas... this could be it."
        }, 
        {
            "index": 83, 
            "rating": 4, 
            "review": "I'll start by saying that this would have been 5 stars if I had read the pricing right.  I thought it said $21/pp on the sign and it was actually $35/pp - for a family of 4, that is significant.  But, even with the increased price, when you have twin teenage boys and all-you-can-eat sushi, you'll probably come out above breaking even.\n\nThey had a wide variety, and even had Unagi, which is my boys' favorite - I think they ate they out of it.  They loved the Teppanyaki bar and had their fair share of salmon nigiri and squid.  I'm not a huge sushi fan, but they had plenty of selection for the non-raw food types, including yakisoba, dumplings and chicken teriyaki.  \n\nIf we had been in Vegas longer than a couple of days, we would have gone back for seconds!"
        }, 
        {
            "index": 84, 
            "rating": 3, 
            "review": "Standard all you can eat sushi buffet.  Nothing special but clean and good tasting.  $32/adult is a little pricey but not in vegas."
        }, 
        {
            "index": 85, 
            "rating": 3, 
            "review": "This used to be our birthday tradition. The first time that my husband and I came here together (I'd been coming for a few years prior.), we were here for a while. It's not that my husband hadn't had sushi before I came along, only that I actually broadened his food horizons. In addition to sushi (this is ok), there is a custom cooking section (good, but there is a slight wait time), hot foods like tempura (try the yams), stuffed shrimp (good), and teriyaki chicken (kind of fatty), a cold salad section like seaweed salad ( I love this salad) and a handful of others, the crab legs (better than most casino buffets- really favorful- we like to get a full plate of this) and full dessert section with ice cream, cheesecake bites, carrot cake bites, cookies, and candies (seriously you will want to try some of these delicious sweet things). Since there is a huge selection, it is hard not to find something for everyone.  \n\nSince I don't want to be sick and get rolled out of the restaurant, I pace myself. I only get what I really want and I save room for dessert- ice cream, of course! My rule is two plates of food. I want to be satisfied but I don't want to overdo it. I use the rule of moderation. \n\nThe service is excellent. The staff is very attentive and eager to please; filling drinks and taking the dirty dishes away. It's nice that there is a bathroom in the restaurant. There are numerous tvs all around and there is music playing (but you can't hear it if the place is pretty crowded).  Also, don't forget about the crab- it's really good. (We went to the one in Hawaii but were disappointed that it wasn't really all you can eat- there was a person handing out two pieces of crab legs.) In the beginning I wrote that this used to be our birthday tradtion- the birthday promotion used to be BOGO, but now, the promotion is BOGO, if there are six people in your party. In the AAA coupon book (AAA customers- you get this at the customer service desk, upon entering the center via the parking garage), there is a 10% off coupon and I believe that there is an ongoing Locals promotion, of 10% off.\n\nIn a world of mediocre casino buffets (Las Vegas, lets be honest), this is still better than many of the ones available (not worth the time or money). All things considered, it's also in a good location, the Miracle Mile Shops in the Planet Hollywood Casino."
        }, 
        {
            "index": 86, 
            "rating": 2, 
            "review": "Everything seemed so dry, and the color of the sushi looked a little pale in my opinion. So in other words, not fresh at all. I am not coming back, and will choose a different place."
        }, 
        {
            "index": 87, 
            "rating": 1, 
            "review": "I have seen the Todai in Vegas magazines and so I decided I would take my brother's and my family to Vegas and stop by to have Christmas dinner there.  I called about a month in advance and made a reservation for Dec 25th knowing that it probably would be busy on that day. We get there and the hostess tells me they don't have my reservation and quite RUDELY said that I must have made the reservation for the for Dec 26th.  I then told her why would I need to make a reservation for the Dec 26th? I then spoke with the manager and she was also bitchy and made it sound like I was lying about my reservation but I told her that whoever took the reservation probably f_cked up, no big deal, just seat us as soon as you can.  Well, the hostess and the manager both gave me an attitude.  I normally would've have just left but my brother's family had been looking forward to trying Todai so we ended up waiting over an hour.   Their sushi selection was just ok, I would say the sushi and sashimi was low quality.  I saw that there were people eating crab and lobster but Todai was very slow to bring out the lobster, seemed like only once in a while so you may or may not have a chance to eat it.  Their food is probably 2 maybe 3 stars but with their incredibly POOR CUSTOMER SERVICE, I have to give them 1 star and would not go back again or recommend to anyone.  My brother's family wasn't that impressed either."
        }, 
        {
            "index": 88, 
            "rating": 3, 
            "review": "We have been missing Todai for a couple of years when its Schaumburg location was closed. So when we came to Vegas and found todai we were very excited to dine here again. Well, the Todai is not the one in our memory, probably because we have been spoiled by other seafood buffet. \nAnyway, regarding the sushi, the rice wasn't cooked right. Sushi rice was way overcooked so it tasted sticky, similar to the batch produced sushi quality sold in Costco.\nThere's no sashimi, at least not for lunch. Soft drinks are for an extra fee. \nActually it makes me understand why the Schaumburg location was closed. The Royal buffet in the same area is way better.\nThe price is reasonable and a good deal in strip area in Vegas, in comparison with other buffet."
        }, 
        {
            "index": 89, 
            "rating": 3, 
            "review": "Very average sushi and rolls. I have eaten here several times and it does fill my sushi needs for a fair  price with an available coupon. They have several Chinese food options as well including making your own udon. Tempera was decent. I also tried the sausage and prime rib. Both were not bad, but not good either. Fruit selection nice, but I come here for sushi and rolls and while the sushi seems fresh the rolls are just missing something. They had a small amount of sashimi too that was pretty good. At dinner I believe they have crab legs. Service was attentive but its a bit strange that they do not provide a dipping dish for your soy sauce at the table. Grab a plastic cup by the prime rib. Overall I will go again, but only with a coupon or discount."
        }, 
        {
            "index": 90, 
            "rating": 4, 
            "review": "Went to dinner with a very close friend of mine who was visiting during the Memorial Day weekend.  I've been doing the research into Todai's/Makino's for months, but I really don't want to go to a buffet by myself.  (I guess I'm weird that way.)  Our eating habits: the only thing that consumes more than me is fire, so any place is fine with me; she is a vegetarian who eats fish, eggs and dairy products, so I am always careful and mindful of her dietary restrictions.  Since I haven't had sushi/Japanese cuisine for quite a while, we went here for dinner.\n\nI've only been to one other Japanese buffet (in the States), and that was Minado's in Framingham, MA.  That buffet was good; my mission there was to eat my fill of sushi (and other Japanese delicacies, but sushi primarily), and I went there two different times.  They had a nice selection of foods, and I was happy I went.\n\nTodai's is another beast altogether.  At least twice the amount of choices available (as compared to Minado's selection).  Some stuff I've heard about, but was never able to try (like the spicy Hawaiian poke). I seriously tried to take a sampling of everything, but to tell the truth, I was so hungry by the time we got there (last meal was dinner the night before) I knew I should have worn a bathrobe or a hospital gown.  My attempt to sample a wee bit of everything failed miserably; when I got back to my table with my plate, the waribashi was a blur from the plate to my face.  (I should have asked for a Diet Coke, ha ha ha.)  I do remember, after walking back to the Luxor and climbing into bed, we both had the sushi sweats.  I swear, when I find someone else to go with to Todai's the next time, I'll take it easy.  I really need to plan buffets a lot better in the future.\n\nOoh, the recommendation.  Yes, go to Todai, and bring your appetite.  Dudes:  let's cut through the fluff and just wear your sweatpants.  Ladies: I know you want to at least give the appearance of being ladylike, but indulge yourself.  And for you pre- and post-op gender reassignment patients:  well, I can't help you there."
        }, 
        {
            "index": 91, 
            "rating": 2, 
            "review": "I have been to Todia's in San Diego, Seattle and Las Vegas.  Each time I always get what I am looking for.....lots of sushi and sashimi for a decent price.  While I do not have expectations of super high quality I am always satisfied....until my last visit to the Las Vegas Todia in November 2012....the place was over crowded with long lines to get food and plenty of ignorant people that did not feel they needed to wait in line like everyone else.  These people sadly were all the same nationality and would just push in staring and not speaking english.  It made the entire experience frustrating and also seemed to reduce the selection of the \"good\" stuff.  Then the ultimate shock came after having to endure long lines and ignorant patrons we were dropped a bill that ended up being $47 each......seriously....I have not paid that for 2 at Todia in the past.....never again will I get burnt by them and I suggest you save yourself the pain....if there is one thing Vegas offers it is dining choices and I am certain you can find a much better sushi place for less money...."
        }, 
        {
            "index": 92, 
            "rating": 1, 
            "review": "I came here a while back with my husband (bf at the time) for dinner here.  Before we were allowed to go in, the hostess told us what the price was (assuming we can't afford it) and asked if we wanted to stay.  Upon hearing that, we should of just walked away but we didn't.  We told her that we wanted to check out the food first before we decide.  In the end, we decided to stay.  I totally regret doing this.  The quantity and selection of food was limited.  I was really unhappy throughout the night because of this. We will never come back to this place again."
        }, 
        {
            "index": 93, 
            "rating": 4, 
            "review": "Went on my birthday and they gave me my buffet 100%  off (cool). Based on comments from the three other people I was with, they all felt the sushi was decent 3.5 star sushi. Hey, it's a buffet not a hand crafted made for you sushi dinner.\n\nKudos on the vast selection, great service, free birthday meal and a solid 3.5 star meal."
        }, 
        {
            "index": 94, 
            "rating": 3, 
            "review": "Yummy everything is all i have to say. As much as I like it here, they need to open exactly on time and not 10 minutes later with hella people waiting. It is a little over $20 per person during lunch and I dont know how much it is during dinner time. \n\nWe started of at the sushi area which was okay given that its a buffet. Then went for the fried rice, chow mien, lettuce wraps,  fried shrimp, gyozas,....etc. everything we ate was tasted pretty generic, typical, replica, Asian food. what else can i say other than eating as much as i can for what I paid for. \n\nservices was OK from what i saw. it was bad enough that they opened late. we got seated and asked what drinks we wanted and practically didn't see the waitress after that. They refilled our drinks by carrying pitchers of the different soda, water, tea with them. They cleared out any empty plates on your table. They would show up with your receipt when they think your done eating. so with service is okay at a buffet place.\n\nWe went here friday when they opened and it started to get pretty crowded. my only advice is to come when they open so you can get pretty much everything you want to eat."
        }, 
        {
            "index": 95, 
            "rating": 3, 
            "review": "Ok, fine, 3.5 stars, but I'm not going to round it up. Although considering we are in the middle of a desert, having quality sushi and fresh seafood is asking for quite a bit.\n\nTheir maki qualities are A-Ok. Not great, but satisfying.\nTheir salmon sashimi, according ot my bf, are also satisfying.\nTheir hot foods are kinda meh.\nMy favourite is their clam soup, very seafoody goodness. I had many bowls.\n\nIt's pricey: $22 for lunch on a weekend. But what do you expect in Vegas right?\n\nAll I know is that my boyfriend, who loves sushi buffet, was happy, and that's enough for me to give it a pass."
        }, 
        {
            "index": 96, 
            "rating": 2, 
            "review": "Im on board with the low reviews lately. Buffett   & staff have gone down hill items out and never restocked also old and cold crab?? Also  huge meat area now!! is this the Brazilian steak house nextdoor ?....down hill."
        }, 
        {
            "index": 97, 
            "rating": 5, 
            "review": "What can I say, I love sushi and I love this place. I'm sure all the sushi snobs would disagree but you can't beat this place for the combination of variety and value. Went for lunch and was blown away by how fresh the sushi was. I tried so many types that I'd never tried before and was happy with just about all of it. I'm already planning on going again when I'm back in Vegas in September."
        }, 
        {
            "index": 98, 
            "rating": 1, 
            "review": "Foods are okay. Nothing is special. Seafood wide, I personally don't like it. It has a fishy smell to it and this Todai place doesn't have alot of variety. \n\nDessert is sad. Old cookie and brownie (none of them are good) \n\nStaffs are very rude. Maybe they are too busy or we caught them at the wrong time. I don't feel like I am in a restaurant at all. Instead of a fabric table clot, well they do have fabric table clot but they put a giant peice of paper on top of that (like a crawfish place). After each customer,  they only remove the paper. Again like i said i dont feel like I am in a  restaurant. ..\n\nPrice..very pricy for what they have offered \n\nRestaurant is not clean. I can see food on the floor (well understand it is a buffet but if other place can keep theirs clean, this place should too) \n\nOverall, will  not recommended and will never come back.."
        }, 
        {
            "index": 99, 
            "rating": 5, 
            "review": "I feel like a fat kid in a candy shop here! The food is soo yummy! Only thing I didn't like was the Caesar salad which is no big deal because I came for Asian cuisine. My only complaint is there is more food that I want to eat than my stomach will allow!! Even the dessert is better than most buffet places I've been to! My brother who isn't a seafood fan found plenty of other foods to eat. Highly recommend! I'm so pleased I'm doing this review sitting at the table waiting for more space in my stomach to open up hehehe xD. The music is on point too! Very happy :). Ps it's kinda expensive but not too bad. Around $145 for 4 people."
        }, 
        {
            "index": 100, 
            "rating": 3, 
            "review": "Since my dining companion only likes maki rolls and cooked stuff (and I'm paying her tab), we chose the lunch.  All in all, it is pretty good.  Everything was fresh.  There were many maki rolls, nigiri sushi, salads with sashimi, seaweed salad, tempura, rib-lets, udon...etc, etc.  Oh, and there is a whole length of dessert buffet I did not even touch cuz I was saving every cubic inch of stomach space for seafood.  The sashimi salad and seafood soup were my favorites.  \n\nTo a seasoned seafood lover such as myself: nothing was too exciting but everything was good.  Yes, the sushi buffet I had at Sumo in LA was way better, and the various tiny authentic sushi bars offered me more exotic choices.  but hey, I'm here in Vegas and this is a good giant buffet. \n\n One tip:  if you don't like sashimi or nigiri and consider multi-ingrediented maki rolls your favorite sushi;  save yourself about $10 pp and go for the lunch buffet."
        }, 
        {
            "index": 101, 
            "rating": 1, 
            "review": "We generally look forward to eating at Todai in Las Vegas.\n\n \n\nNo more.\n\n \n\nWe ate there on January 2, 2015.\n\n \n\nThings started out bad. They got worse.\n\n \n\nThe hostess walked us all over the restaurant looking for table (there were many available).\n\n \n\nThen, the wait staff did not provide us with any tableware.\n\n \n\nWe waited several minutes after getting our food before our drinks showed up.\n\n \n\nThey never refilled them.\n\n \n\nThe sushi was frozen.\n\n \n\nThe service was poor.\n\n\nWay to ruin my birthday.\n \n\nThere are many restaurant alternatives in Las Vegas.\n\n \n\nWe won't be back to Todai."
        }, 
        {
            "index": 102, 
            "rating": 2, 
            "review": "the only reason im giving this another star is that the place is clean.\nother than that the food sucks and makino is better for the price at least"
        }, 
        {
            "index": 103, 
            "rating": 4, 
            "review": "I have been hearing about Todai for sometime.  Granted it's a buffet, so quality is what it is, but as far as sushi buffet go, the quality is as good as I have seen.  The sushi section quality is unvrivaled in a buffet.  They also have a great selction of korean galbi.  The place is a bit \"mallish foodcourt\" in decor and clientele, but are you really going here for the ambience?!?!?"
        }, 
        {
            "index": 104, 
            "rating": 4, 
            "review": "For what it's worth, I'm all about tuna poke, and this place had a giant platter of the stuff. I probably ate three pounds worth, and while not the best I've ever had, it was certainly good enough to do the trick over and over again. Of course, I felt bad not trying anything else so I chose some really passable rolls from a large selection and some random items from the generous hot food section (like bacon-wrapped asparagus, which you wouldn't traditionally pair with poke, but each were god-given gifts). Even the desserts were numerous and delicious-- definitely the first time I've had crème brûlée at a sushi joint. You're not going to confuse this stuff for the best sushi of all time but if you're bringing a mean hunger and you're not too sushi-snobby, you'll fall in love upon filling your first plate."
        }, 
        {
            "index": 105, 
            "rating": 4, 
            "review": "You west coasties can discount my review as I'm a life-long Midwesterner, but this was one of the best sushi and seafood buffets I've ever been to!  We got the discounted dinner price by going to one of those cheap ticket booths prior to coming to the restaurant. All in all I think we saved ~$8-9 per person.\n\nThere was a great selection of sushi, sashimi, etc etc, and the sushi and sashimi were small and not over inflated with rice so you could actually try a little bit of everything.  The crab legs were plentiful but cold. (No drawn butter there!) There's enough food for the non-seafood eater to enjoy as well. (Also build your own stir-fry goodness, which I didn't try because I was there to eat sea creatures.) Salads were delicious and fresh.\n\nWhen I come back to Vegas, I will be coming back here. Yum!"
        }, 
        {
            "index": 106, 
            "rating": 3, 
            "review": "It was our third time to visit there in the past 4 years. The difference is we had lunch there this time. The lunch options is much less compared with their dinner. We felt very odd when the cater told us that they will do us a favor to waive the charge for our 1 year baby son."
        }, 
        {
            "index": 107, 
            "rating": 4, 
            "review": "Best sushi place I have ever been too. From Toronto and been to over a dozen sushi places around the city. Todai blew the others out of the water. Types of sushi I've never heard of, let alone tried. Probably would have given 5 stars if they had better customer service. Waitress seemed like she didn't really want to be there. Maybe she was having a bad day but I would definitely go again if I ever go back to Las Vegas."
        }, 
        {
            "index": 108, 
            "rating": 3, 
            "review": "It was good but not as good as I had hoped. The only reason I came here was because my friend who is from Chicago liked the Todai in Chicago and they had lobsters there. Unfortunately there is no lobster here. Also the selection of sushi and sashimi was not huge. I am sure there are better sushi buffets in San Francisco and NYC."
        }, 
        {
            "index": 109, 
            "rating": 2, 
            "review": "Well, it's better than Makino I guess but that's not saying much.  The bad thing about these kinda places is you just don't know how long that sushi's been sitting out there for, not to mention the people who prepare the sushi are nowhere near as experienced as real sushi chefs.  The upside is of course the variety of stuff you can choose from.  Crab legs, tempura, noodles, crepes, etc.  As far as the sushi goes though, there are much better places to go to."
        }, 
        {
            "index": 110, 
            "rating": 3, 
            "review": "My sister loves this place but maybe it's because she likes sashimi.. They have a huge selection but the tea is extra. A good place to have lunch but too much food for dinner."
        }, 
        {
            "index": 111, 
            "rating": 2, 
            "review": "The food was bland, and sometime tasteless. I went there a couple of time to check on both lunch and dinner but left unsatisfied. \n\nThe sushi was mediocre and the crab wasn't that fresh. \n\nGo some place else yelpers."
        }, 
        {
            "index": 112, 
            "rating": 5, 
            "review": "We were skeptical due to some reviews but this place was GREAT! Especially for the price! There was a large sushi collection, raw oysters, tempura and a great variety of Asian dishes. If you're looking for a \"Americanized\" buffet this is not your place."
        }, 
        {
            "index": 113, 
            "rating": 1, 
            "review": "Sushi rice was hard and fish was not fresh!  Very small pieces of sushi. All the cooked food was old and brown. Sevice was bad. Place was not busy ...had to keep asking for refills. Not worth 34.00."
        }, 
        {
            "index": 114, 
            "rating": 4, 
            "review": "Been to Todai in Chicago and Honolulu, and this one is the best of the three.  I always go here for lunch when I'm in Vegas.  It's about as good as you can expect for all you can eat sushi.  Good quality for the price.... they have all the standard stuff including unagi sushi, spicy tuna rolls, salmon sushi, teryaki chicken, salmon, shrimp tempura, miso soup, etc.  I can't vouch for dinner here though.  Lunch is under $20, so to me it's awesome, but for $35 I'd probably expect better ambiance and higher quality sushi."
        }, 
        {
            "index": 115, 
            "rating": 3, 
            "review": "Good selection and variety for a seafood buffet."
        }, 
        {
            "index": 116, 
            "rating": 4, 
            "review": "last time i went to vegas to see my buddy play in the VEGAS bowl \nGO WiLDCATS !!! lol\nand my family wanted to eat here for lunch. i said okay.\nthank god we did.\nthis place is soooooooo good !. \ni mean i know theres certain ways to eat sushi idk ..to get the freshness and blah blah ....\nwho cares im mexican !!! i just eat it , stuff it down my throat lol !\neverybodys so freakin proper. JUST EAT ! \ndef. recomend this place !"
        }, 
        {
            "index": 117, 
            "rating": 4, 
            "review": "I'm not usually a fan of all-you-can-eat Sushi, or all-you-can-eat anything. But this place was an interesting way to try a lot of different sushi that I would have never tried otherwise. I learned that I actually can stomach raw Kobe beef and that I love Eel sauce. I also discovered a lot of interesting desserts I was not familiar with. \n\nIt is spendy and it is usually crowded so the wait can be an hour or so. Trying to find parking is problematic, unless you valet. \n\nIf we go back it will be for lunch and we will valet. It's a fun place to take out-of-town guests."
        }, 
        {
            "index": 118, 
            "rating": 4, 
            "review": "Good quality and a large spread of sushi, seafood and some Chinese dishes. I went to town, but I have to admit that at $40 it was difficult to eat that much. But I gave it a really good shot.\n\nAssortment of sushi included maki rolls, sashimi and more traditional nigiri sushi. Cooked foods included baked and steamed fish, won tons, grilled calimari, and other nibbles. Dessert table was great with pecan tarts, key lime pie and more.\n\nEverything was very tidy and neatly organized. The tongs and spoons were clean and they did a good job of cleaning up the stuff that missed between heating table and plate.\n\nService was good. Getting refilled drinks required some interaction (they should see and refill empty glasses) and the check was slow. But the good food outweighed that."
        }, 
        {
            "index": 119, 
            "rating": 4, 
            "review": "If you like sushi, this is sushi heaven! So many options and all you can eat, you can't go wrong. Plus I love the dessert bar as well. Staff was friendly and helpful. Next time I visit Vegas, I will be coming back!"
        }, 
        {
            "index": 120, 
            "rating": 3, 
            "review": "All you can eat sashimi!  I am the plague of every sashimi buffet, because, if given enough time, I can eat my weight in fresh fish.  They had the standard types you usually find at buffet:  salmon, tuna, and snapper.  They also had a wide selection of rolls, and at least 2 types of deep fried roll.  I didn't venture too much into the hot foods, but I did try the other seafood, such as oyster and shrimp.  The shrimp was fresh, but I wasn't a big fan of the oyster.  It was not gritty, but it did taste somewhat pond-like, so I had to spit it out after the first few chews.  \n\nWe went here on a Thanksgiving holiday weekend.  The price for lunch?  $35 including drink.  I'm not sure what made the buffet so much more expensive for the holidays vs. a normal weekend, but I wouldn't go here again for the same price just for lunch."
        }, 
        {
            "index": 121, 
            "rating": 2, 
            "review": "This Todai didn't live up to the other Todai's I've been to. It didn't seem to have the variety of sushi that the others have, pretty standard selection. Some of the sushi were falling apart, amateurs... sub-par (just look at the pics). The tempura batter was dense, not light and crispy like it should be. Tell you the truth, I felt like I was  ripped-off when the bill came. I've been to better that's why it's 2 stars from me."
        }, 
        {
            "index": 122, 
            "rating": 4, 
            "review": "Just in town for spring break and was touring some friends who met us in Sin City.\n\nTo all those yelpers looking for quality sushi @ $20...it's called a buffet, not a high touch white glove restaurant. I don't understand how people complain about buffet's not having top quality? \n\nIf you are pushing HUNDREDS of sushi or sashimi/hot food/udon/dessert on the trays to some hungry convention goers, gamblers, and party goers then I would say that the quality would be somewhat sacrificed.\n\nThat being said, Todai is just as good as any other all you can eat Sushi-Sashimi place. The place is clean, food was what you expect from sushi buffet's (it ranks up there with Minado in Morristown NJ or Long Island) and the service was prompt and polite. \n\nWe went on a Monday night and the place was not mobbed. Can't comment on a Friday or Saturday but it was pretty awesome.\n\nThis will be our go to place for sushi pig out time!"
        }, 
        {
            "index": 123, 
            "rating": 5, 
            "review": "First off I would like to say the management at Todai Las Vegas has always been great to my family and I every time we come in. I was actually sitting next to the table today that  complained about the $5 bowl of rice that the elderly lady was going to be charged because she was eating. I understand that she is an elder but she was eating and Todai is a buffet. Buffets are a set price there are no exceptions anywhere. I don't understand the commotion the customers were making about this issue. Ethnicity has nothing to do with the situation and overhearing the conversation that since the management is \"Korean\" they should understand more for the elder. It's a business and why should one customer get treated any better than the next? The management wasn't trying to charge a full senior price because they understood she wasn't eating much. Which is why they were only charging her a to-go price for the rice. Only reason I'm writing this review is because the complaining customers caused a big yelling scene that interrupted my family's dining experience. If anything I feel bad for the management to put up with customers like Cindy. \nI will continue to bring my family to Todai Las Vegas for the great food and awesome customer service. The desserts and sushi here are amazing!!! You definitely get your money's worth!!! \nAnd to the management im sorry you guys have to deal with those rude customers during the holidays."
        }, 
        {
            "index": 124, 
            "rating": 4, 
            "review": "I was happy with their lunch deal. It's a little cheaper than dinner with a nice amount of choices. They had sushi, sashimi, salads, hot dishes, cold dishes, seafood and desserts. The customer service was good too as they cleared plates almost as fast as we emptied them. \n\nWe tried their salads and hot dishes first. All were flavorful and tasted fresh. The sushi selection was good and they had some spicy ones which I really appreciated. The place started to fill up after our first round through the buffet, which is usually a good sign. The crab, shrimp and mussels tasted really fresh, so I went back a few times for each. \n\nThey had green tea ice cream as well, so I was happy about that.  \n\nI would definitely recommend this place."
        }, 
        {
            "index": 125, 
            "rating": 1, 
            "review": "DO NOT COME HERE! \nI hate leaving bad reviews but I saw that there are a lot of good reviews and don't want fellow yelpers to be misled. My boyfriend and I ate here after purchasing the discount from Tix4tonight, and it only saved us 4$.. But that's not the bad part. The food was really really bad. Sushi was like gas station sushi, and also mislabeled. The fried rice tasted like an old cigarette butt. No joke. I got 3 plates of all different things hoping to find something I liked, but didn't find a single item. Our glass of water stayed empty for about 10-15 minutes. The fruit selection was dry and only had about 3 u appealing pieces to choose from. I say save your money and go somewhere else considering decent buffets at hotels are in the same price range and actually worth the money. We ended up leaving- still hungry and had to eat somewhere else.  I don't recommend it."
        }, 
        {
            "index": 126, 
            "rating": 4, 
            "review": "Nice variety of food.  I would wish they would open a little later for lunch instead of ending at 2:30 PM.  It would best to close at 3 PM.  Good sushi roll and hand rolls.  Good variety for dessert.  If you want a decent buffet of sushi, come and visit the restaurant. You will be please for the quality for a buffet.  The price is a little on the high side, but not too bad for the food prices charge on the main strip area. I am ranking this as a 4 star based on the food."
        }, 
        {
            "index": 127, 
            "rating": 4, 
            "review": "I have been to Todai at various locations, maybe four or five times. This was the only time I thought it was worth it. The rolls were all fresh - they had rainbow, spider, dragon -  the expensive ones., and they were well prepared. There were piles of jumbo grilled shrimp that looked more like langostines. and for dessert, giant strawberries dipped in chocolate, which you'd probably pay $2 a piece for if you bought them elsewhere."
        }, 
        {
            "index": 128, 
            "rating": 5, 
            "review": "If you love good sushi -then this is the place.  An all you can eat buffet of top end rolls, sashimi, nigiri, poke, and seafood salads for a very reasonable price.\n\nTodai also has a large selection of hot bar items and desserts, but I go specifically to eat sushi.....why - because if I went anywhere else, my bill would be a couple hundred dollars....here with everything included it's approx $37.00 not counting tip.  \n\nThe sushi is really good, they will make it in front of you and put it on line, and you can eat as much as you want.\n\nThere are other Todai restaurants spread throughout the United States and overseas, if you love sushi, this is the place for you."
        }, 
        {
            "index": 129, 
            "rating": 4, 
            "review": "This is where they unload the asian tourist buses in Vegas.  I hate all buffets except Todai, Wynn hotel and Bellagio hotel.  They actually have a good selection of sushi and a couple sashmi for the price.\n\nSide note:  Do not eat at any other Todai.  I have tried Honolulu, and a couple in Califonia.  They all suck compared to this one in Vegas."
        }, 
        {
            "index": 130, 
            "rating": 2, 
            "review": "As a local in Vegas the #1 thing that is given (not expected) is \"customer service;\" something that this location lacked today. Aside from being seated, we were constantly waiting: waiting to get our tables cleared off (from plates we were finished with) and refill of our drinks. Instead of our server coming to our table to check for our drinks, we had to raise our hands and ask for a refill, twice. We usually give 18-20% tip, but today we gave 10%. (Others would have gave nothing. Oh, food is okay about a 2/5."
        }, 
        {
            "index": 131, 
            "rating": 5, 
            "review": "This is by far one of my favorite spots to eat when in Vegas! All you can eat seafood and sushi!! I think I died and went to heaven, every time I get to go here. The price is minimal when you think of all the food you get, and believe me, I can eat A LOT of sushi! If you haven't tried this place, you definitely should give it shot, you'll thank me! :)"
        }, 
        {
            "index": 132, 
            "rating": 4, 
            "review": "Buffet \nAsian Theme\nSushi - Yes\nAmerican Asian foods - Yes\nWine and Beer - yes\n\nWhy do you eat at Todai?  They offer very decent fish with many options and you can consume as much as you will."
        }, 
        {
            "index": 133, 
            "rating": 5, 
            "review": "Came here once with my mom and husband on his bday so he got to eat for FREE.  YAY...well that's now why I gave them a 5 stars...the sushi was really fresh and service was pretty good/quick. I enjoyed my meal very much and so did my mother.  I would definately come back again...especially on someone's bdays if we happen to be in Vegas.  I can't say the same for the Todai's in the bay area though (sadly, it isnt as fresh)."
        }, 
        {
            "index": 134, 
            "rating": 3, 
            "review": "It was ok.  We tried a bit of everything.  The rolls were ok, nothing really stands out.  I was hoping for some really tasty rolls, maybe soft shelled crab and avocado.  Didn't see any of that.  Would I go here again?  NO.  Why?  We'll at 40 bucks each I just didn't think the value was there.  Of course that doesn't include drinks.  If I'm going to spend A hundred bucks for dinner, I want it to be really good.  Not just OK.  I would rather go somewhere and spend a hundred bucks and get four outstanding rolls."
        }, 
        {
            "index": 135, 
            "rating": 4, 
            "review": "I love Todai's mostly because I love sushi in general. I love all you can eat even more. Put those together and you have a great place to have a meal. If you like sushi, they have quite a few choices and they have a full Japanese buffet in addition to the sushi.\n\nThe only reason this doesn't get 5 stars is because you have to get up and walk back to the buffet line if you want napkins, so don't forget them. I think napkin holders would be a good investment because getting back up when you're ready to eat is inconvenient. \n\nThe waiters aren't very personable either. They don't say much, but that's not such a big deal. It cost $35 per person last time we went (about a month ago), so its not too hard on your wallet."
        }, 
        {
            "index": 136, 
            "rating": 3, 
            "review": "Decent food. Friendly staff.  I wish they a little more sushi choices.  Dessert was pretty good as well. The location was inside the Miracle Mile Mall ( Planet Hollywood Hotel)."
        }, 
        {
            "index": 137, 
            "rating": 5, 
            "review": "Omg. For the extreme sushi enthusiast, (which I def pride myself to be), its the only sushi place to hit in LV. They have it ALL here- sushi, sashimi, salads, soups and then chinese food and more seafood such as crab legs, all u can eat lobster, etc. Even if you dont have the half price discount, (available at Tix 4 Tonight) its still well worth the $23 pricetag. There was virtually no line for dinner seating and the food was fresh and amazing. I couldnt possibly eat as much as I wanted to, but boy did I try! Lol! Def something I would revisit on my next trip to Vegas. Enjoy!"
        }, 
        {
            "index": 138, 
            "rating": 4, 
            "review": "As the buffet becomes more and more expensive, I'm less and less enticed to come here. A $40 buffet may not be unheard of in Vegas, but anywhere else people would look at you like an alien if you invited them along to such a place. Regardless, the fish is fresh, as are the crab legs. They have a bunch of different kinds of salads that are great too. I don't really get involved in the rolls they have (which they have tons of) or the other food items (think hot meats/noodles/pizza/etc). They also offer a fruit station and a dessert station that is adorable with tiny little one bite desserts. A bottle of wine would run you around $30, though I've never done it since I'm a cheapskate. \n\nExpect to overeat and regret it for at least 48 hours."
        }, 
        {
            "index": 139, 
            "rating": 3, 
            "review": "We were hungry and craving sushi and so we came here.  Food here isn't bad for it being a buffet.  But it's really nothing special. It def stopped our hunger. haha"
        }, 
        {
            "index": 140, 
            "rating": 1, 
            "review": "Will never go again. Showed up 20 minutes before closing on a friday night, wouldn't let us in because they were \"closing early tonight.\" AND be aware that unlike the dozens of other buffets I have reviewed across the country, when they \"close\", that is also when Todai takes the food away. I've been to the Todai in Seattle, Redmond, WA and Portland, and I have never been impressed with their attitude. (Read my reviews. I rarely complain about attitude). NEVER AGAIN!\n\nAfter writing this, I was sent the following:\n\"If if makes you feel any better, the one in Seattle has gone out of business.  There are no longer any Todai branches in the Seattle area.  (There used to be one in Redmond too, but it went away as well.)\"\n\nYelpers know, CUSTOMER SERVICE COUNTS!"
        }, 
        {
            "index": 141, 
            "rating": 4, 
            "review": "I'm here for my daughter's college soccer showcase.  She's staying with her team and I got a room at HGVC.  My wife and I was looking for nice prime rib place but ended up here.\n\nIt was the best choice for the night.  We love sushi, sashimi, prime rib.  Todai had everything!  Even better was the bill.  It was like $39 compared to near $50 at some buffett.\n\nOnly trouble here was we ate too much. :)"
        }, 
        {
            "index": 142, 
            "rating": 2, 
            "review": "The buffet on Fridays and Saturdays is 35.99. They charged extra for soda at 2.95. This is way more than it's worth. \n\nI was here last year and had a better memory of it. I am not planning on going back because it's definitely not worth it to me. \n\nAlso, you even have to get your own knives, forks, and napkins. These are not even set up on the table. \n\nNothing is likely to wow you. Plus it's in the Miracle Mile mall, tucked away down a hallway. I enjoyed other casino-based buffets better."
        }, 
        {
            "index": 143, 
            "rating": 4, 
            "review": "Lots of variety and plenty of it.  No rush here.  Waiters are very attentive; keep the green iced tea coming.  I have been to this location twice, both times with discount coupons, so the cost was quite reasonable.  I felt that I got quality sushi, fresh and tasty and would definitely return for more, at this or another Todai location"
        }, 
        {
            "index": 144, 
            "rating": 2, 
            "review": "Good: \nCooked oysters, pineapple\n\nNot so good: \nsushi (all of it tasted about the same), most meats, deserts. \n\nThey should have much less variety, save money on the chefs and offer better quality. \nAnd they should offer fresh oysters for lunch (apparently they only have them for dinner)..."
        }, 
        {
            "index": 145, 
            "rating": 5, 
            "review": "Amazing sushi! Plenty of different kinds to chose from at this great buffet! Absolutely loved it :)"
        }, 
        {
            "index": 146, 
            "rating": 1, 
            "review": "Ok I never write reviews about restaurants, however I will about Todai sushi. After eating here the next day I felt like I was going To Die! \nLet me start from the beginning, the service was awful they never came back to refill my water. I had to wave someone down to come refill my drink and they never came to check on us during our meal. Not once! \nAlso the food was disgusting. Usually I can find one thing I like but no everything tastes nasty. Maybe it was because they had 2 hours until closing but still. Everything was cold and old. Even the miso soup was nasty. How do you mess that up?! Don't eat the crab legs what ever you do!!! I got really bad food poisoning and after reading others reviews I think it was from the crab. Or the combination of all the raw food sitting out for hours because all the sushi rolls looked old and not good. All in all I would never ever tell anyone to eat here ever! Not even my worst enemy. I got so sick I felt like I was going to die. I'm a local here in Vegas born and raised and my recommendation would be just to go off the strip and go to sushi mon or something way better. And it's not expensive. For what I paid at Todai I thought I'd at least get good service. But no I paid an arm and a leg to get food poisoning and rude servers. I highly don't recommend eating here! I'm just trying to save you some money and a belly ache.  I wish I could leave no stars but it doesn't allow that."
        }, 
        {
            "index": 147, 
            "rating": 4, 
            "review": "Amazing!! This place has the real stuff. From regular dishes to sushi sashimi,  everything tasted so good. Only thing I can think of that can improve is having more sashimi selection and warm crab legs instead of cold. Other than that, it's prefect. Definite 4.8"
        }, 
        {
            "index": 148, 
            "rating": 3, 
            "review": "My take on quantity vs quality....\n\nWaiter: How was your sirloin steak?\n\nArchie: Terrible, it was overcooked and dry.\n\nWaiter: I am sorry, how about I make it up to you by bringing you 10 more just like it?\n\nArchie: I dunno.\n\nWaiter: How about 12 more?\n\nArchie: DEAL!!!\n\n\nIn Todai's defense, it is pretty decent for all you can eat.  \n\nSure the piles of rice under the nigiri are like mini footballs designed to fill you up fast.\n\nSure you gotta beat down six groups of families just to get to the crab legs.\n\nBut all in all, not bad if you are hungover and starving which, oddly, I tend to be when in Vegas.\n\nCattle."
        }, 
        {
            "index": 149, 
            "rating": 4, 
            "review": "Note that my review is basically for the Sushi & Dessert table @TODAI:\n\nI have to preface with the fact that I am just not a buffet, or AYCE sushi girl because I just don't ever seem to be able to get my money's worth without making myself miserable. So..... MOSTLYY (yep meant to put that in there) I avoid these types of eating establishments. However, doing some entertaining with friends/family in town, and the BFF wanting to try this place for such a long time, I decided to suck it up and go. And not so surprisingly I was soooo miserable when I went home. However the food was very delish. The selection of Sushi that they had (for someone who really only likes a couple of different kinds of rolls) was a really nice selection covering several different likes (IMHO). \n\nAfter the sushi was done, it was time to check out some dessert (yes, even with as miserable as I was, I could not pass it up). There is a table at the far end of the buffet line that has mini desserts (which allows for tasting quite a few of their yummy desserts) a crepe station, and a ice cream machine that the lady behind the table has to serve you. It was sort of a bummer that the person waiting for a crepe was blocking the yumminess that could have gone on my ice cream but I just didn't want to be like 'dude, move along, she'll let you know when the crepe is done' but I didn't. I just got my plate of lotsa mini desserts, teeny bowl of ice cream and went back to my table to devour it all, and feel quite satiated from there.\n\nI am not sure when we will make it back. When we are back down in the neighborhood we might consider dropping in again. However I am new to Vegas mostly new anyways... and I have lots of places I would like to get around to :-)"
        }, 
        {
            "index": 150, 
            "rating": 4, 
            "review": "Food and service was great. The price is good for a Sushi buffet on the strip. The only knock I would give them is at the buffet the same tongs use to pick up shell fish are used on other things. Some people have shellfish allergies."
        }, 
        {
            "index": 151, 
            "rating": 3, 
            "review": "I've had better sushi buffets.  There was a lot of selection but not the best quality.  I was excited about the Oysters, but there tasted really strange.  The Udon was ok.  The Ice Cream and Creaps were small, but really good.  Crab legs were good, just wish they had butter sauce.  \n\nThe Hostess, Michiko was really cute and Hapa like me, too bad I can't really give a star for that.  Good price at lunch for $20 but too much for $36 at dinner."
        }, 
        {
            "index": 152, 
            "rating": 4, 
            "review": "This place is one of the reasons I look forward to coming to Vegas. Been coming here for the last 3-4 years. And each time I make sure to come here once or twice within a 9 day period.\n\nI mean the sushi is good, not as good as sushi in Japan of course but definitely good for a buffet. But the thing I really come for is the snow crab. I mean how can you beat a snow crab buffet!!! Of course these are not big snow crabs but it's a buffet so you can eat as much as you can. I am a bit bias since I love snow crabs. Still can't beat actual Hokaido snow crabs but beggars can't be choosers in this situation. =D\n\nFor a buffet this place is better than any other Japanese style buffet I've been in. \n\nBesides the seafood they also have short ribs which is ok but their selection of dessert is not bad and they have green tea ice cream! =D"
        }, 
        {
            "index": 153, 
            "rating": 3, 
            "review": "Todai does have a variety range of food but they all taste just ok.\n\nIf you are in the mood for QUANTITY & VARIETY, then go to Todai.\n\nIf you are the type that prefers quality sushi and rolls without minding small portions, spend the money somewhere else."
        }, 
        {
            "index": 154, 
            "rating": 4, 
            "review": "This is the best Todai I've ever been to - quality fish, tasty sushi...A much better idea than going to a $250-a-head steak dinner."
        }, 
        {
            "index": 155, 
            "rating": 1, 
            "review": "This place is the embodiment of every stereotypical all-you-can-eat buffet. Nothing here is unique, nothing here stands out. The only factor that stands out that is that they're selling their mediocre food at a higher price than the Bellagio (which is actually worth the $30 for dinner). \n\nThe sushi was just basic sushi that you can get anywhere probably for a cheaper price. The meats, prime rib, roast pork, were beyond dry. Yes, I understand that it comes with gravy and au jus, but when a meat has to rely that much on sauces for flavoring, then the chefs definitely ruined the meat. The udon center was a joke. The noodles were frozen noodles that you can get in any convenient store, and the miso broth tasted like they simply used ramen packets to flavor it. \n\nMy opinion, save your money and go to McDonalds."
        }, 
        {
            "index": 156, 
            "rating": 1, 
            "review": "Sushi was good but other than that the experience was terrible. Asked to speak to a manager regarding the quality of the meat and he avoided the issue. Had to approach the manager because he wouldn't come to our table. Advertisements outside were deceiving and no where near what is actually served.  If you want good service and food, avoid this place."
        }, 
        {
            "index": 157, 
            "rating": 3, 
            "review": "Let's be honest, you can really only give a buffet 3 stars max. As far as buffets go though, this one is pretty good. They have all you can eat sushi, cooked food, a dessert bar, fruit bar, you name it. My favorite thing here is the tuna poke and the seaweed salad. YUM!"
        }, 
        {
            "index": 158, 
            "rating": 3, 
            "review": "Its not the best, nor the cheapest but you do get a wide selection of sushi rolls, fish, crab, soups, a few meats (for the non sushi eaters in the group), seaweed and other salads, some cooked foods such as stuffed mushrooms, fried shrimp, and more.  There is also a selection of fruit (pineapple, melons) and a large dessert selection (puff pastries, pumpkin pie, tira misu, creme brulee, etc).  Overall its a good deal if you can eat a lot.  The comment about food being a bit bland is right on.  If you want flavorful sushi you might try a non-buffet"
        }, 
        {
            "index": 159, 
            "rating": 3, 
            "review": "For the sushi fan trying to binge this place is a must.  You can get a wide variety of sushi for a decent price.  Certain selections are not available during the lunch buffet and the price reflects that fact.  Of course, the sushi is not the highest grade but you get what you pay for.  We were there around 2 PM and they eventually started wrapping up for dinner so I would get there a little earlier to get your food while it is in abundance."
        }, 
        {
            "index": 160, 
            "rating": 2, 
            "review": "I think this will be the last time I come back and I've been eating here for 10 years.  It's now $33 a person.  For $150 for the four of us, I can find better places in Vegas for Sushi.  It's good, but not great.  when it was $20 a head, it was more \"appetizing\", now, not so much.  \n\nHeck, the Bellagio Buffet is cheaper now and they have King Crab legs!"
        }, 
        {
            "index": 161, 
            "rating": 3, 
            "review": "I haven't been to Todai's in about two years and after my return to this location on a recent trip, I really was left unimpressed. The sushi is better than the sushi buffets I had locally but if you really want to get your moneys worth, go some place else like at the Bellagio or Alladin buffets. Unless you are strictly only sushi then this place would be satisfying at least. They lack a wide selection of seafood items and they are claiming to have a good variety of it? The crab legs were small and all snapped up by the patrons in less than five minutes. Sushi was unimpressive with a lot of rice for one sushi roll. It was not as fresh and until the tray was completely empty, only then would they refill it with fresh sushi. The desserts are the only highlight for me with custom crepes, green tea cheesecake slices, and mango yogurt. I would only come here again if the prices were lower with an expanded selection and other menu items. You get what you pay for during lunch."
        }, 
        {
            "index": 162, 
            "rating": 3, 
            "review": "I have been here many times even though I'm not a resident of Vegas.  I come here to get my sushi fix whenever I'm in Vegas and coming here always leaves me satisfied.  I understand the frustrations of some reviewers that the buffet is a bit overpriced and I agree, but if you compare this place with all the other sushi restaurants all along the strip, it is a bargain.  The best thing about this place is that it places equal emphasis on the sushi, hot food, and the dessert. My only complaint about this place is that it's hard to find if you find yourself walking the Miracle Mile.  Getting there seems like a mile walk too!  Enjoy!"
        }, 
        {
            "index": 163, 
            "rating": 4, 
            "review": "I'm giving this place 4 stars because they had no line on a Saturday night. While this usually is a bad thing, we were in a rush and didn't want to wait for hours at any other place on the strip.\n\nThe food was exactly as expected for a Todai. A large selection of average sushi. This place had snow crabs and oysters, too!"
        }, 
        {
            "index": 164, 
            "rating": 3, 
            "review": "I would rather go to an a-la-carte Sushi Buffet, OFF the strip.....  This place seem like a Tourist Trap and not too much more than that.... I can't knock the food, it's solid, but nothing to write home about.... I also can't say that I won't go again (with all the friends that visit AND are on the strip, AND want a buffet, AND want Sushi, I guess this is about the only place I can think of to take them).  Yes there is a lot to choose from in terms of other food but COME ON, if your only gonna eat only the other things, why go to a Sushi Buffet?"
        }, 
        {
            "index": 165, 
            "rating": 1, 
            "review": "My wife and I ate here while in Las Vegas the food was very good however when I returned home I noticed that they charged my credit card twice. I am now disputing the charges with my bank. If I ever eat here again I will be sure to pay with cash."
        }, 
        {
            "index": 166, 
            "rating": 4, 
            "review": "So I've been to the Todai in the Bay Area - not that great. I was a little weary to try the one in Vegas. This one is located in the Miracle Mile Shops. Kinda hard to find. \n\nActually, I was pretty impressed with this location. \n\n+ tons of servers/workers\n+ fresh and a lot of variety\n+ good service\n+ relatively clean bathrooms\n\nEveryone was hitting up the crab legs and oysters. It was all good. I liked their sushi too. Well made sushi for a buffet. I was amazed that they had a crepe station. Yum!! Also, they had a variety of green tea flavored desserts. Yay!! \n\nIf you like seafood/Asian food this is a good buffet to go to. It's also good if you don't want to go to a super fancy buffet but still want AYCE. You can also fill up a box for to go!!"
        }, 
        {
            "index": 167, 
            "rating": 4, 
            "review": "A bit apprehensive going in after reason some past reviews but ended up pleasantly surprised. Katsu chicken was crispy outside, moist inside. Sushi tasted and looked fresh, especially the salmon nigiri (my fave!). Lunch was 20$ and was filling.  Would come here again."
        }, 
        {
            "index": 168, 
            "rating": 5, 
            "review": "This is the best Todai In Las Vegas. I alway eat here every time I visit Las Vegas. They have outstanding head sushi chef, excellent customer service, and friendly staffs. Thank you for great and friendly services. I really enjoy soft shell crab hand rolls here."
        }, 
        {
            "index": 169, 
            "rating": 5, 
            "review": "I really like sushi and this is my favorite place to get sushi.  The quality is very good.  They have Chinese dishes and an excellent dessert bar.  It's all-you-can eat.  The price is around $25 per person, which is a little pricey for me.  Its free on your birthday, so that is when I usually come here.  It is a franchise.  I'm sure real sushi connoisseurs would look down their nose at this place, but I don't care.  I think it is really good."
        }, 
        {
            "index": 170, 
            "rating": 3, 
            "review": "Sometimes you just go to a place for the atmosphere.  My friends and I go to Todai for our birthdays or every few weeks, whichever comes first.  Maybe a handful of times a year.  Anyway...\n\nThe sushi isn't that great.  In fact, of all the times I have been there I barely eat any sushi unless I ask for a specialty item like the uni nigeri (they only give you two at a time, but I mean...that's understandable.  I wouldn't want to waste loads of sea urchin of some nub who thought he'd like it and didn't).  I usually stick with the tuna and salmon sashimi, poki salad, and cucumber salad.  I've never eaten off the hot bar.\n\nAnd I eat the desserts, of course.  They offer a decent selection of petite desserts.  My favorite is the red bean paste cakes.\n\nBut back to the atmosphere--it is a nice place to hang out with a group friends if you don't mind paying a good deal for average food.  The restaurant is very open with fun decorations like octopus tentacles hanging from the ceiling and bright colors.  They don't impose a time limit like some all-you-can-stuff-in-your-pie-hole sushi places (one time, we were there for almost two hours..) or gripe if you leave rice on the plate.  I've never ordered drinks there, but I think they charge per glass on pop.  Water for the win.\n\nLunch runs around seventeen dollars I think and dinner goes around twenty eight."
        }, 
        {
            "index": 171, 
            "rating": 5, 
            "review": "I went there for my Japanese friend's farewell party. It was a good place for not only just a few people but also a group of people. Every sushi was so fresh and there were more various food than any other sushi buffet. Their quality is so nice and clean. I paid about $35 but it was worth to pay. There were not only fish dishes but also steak, asian soup, chicken etc. This Japanese restaurant also has Korean food section.  Waiters were so kind enough to take the ask for taking pictures for us and they take the plates as soon as the dishes are empty."
        }, 
        {
            "index": 172, 
            "rating": 4, 
            "review": "Got a voucher from Tix 4 Tonight that saved us $4 a person on dinner.  I really enjoyed my meal here.  It isn't high quality but they pump out a lot of food.  I wish I would have done the udon station.  I did get some prime rib, I was the only person I saw have any and it was good."
        }, 
        {
            "index": 173, 
            "rating": 4, 
            "review": "Yum! This Todai is one of the better ones in the country. It's pretty expensive, but there is a wide variety of choices. Besides, it's more of an \"upper-end\" buffet, so I guess the price is fairly reasonable. \n\nLocated in the Aladdin Hotel (now known as Planet Hollywood). The location is nice, and the place is kept clean. Tasty food."
        }, 
        {
            "index": 174, 
            "rating": 4, 
            "review": "My favorite sushi buffet in Vegas! The high price is the only issue but what can you say.. its inside the Miracle Shops. There are coupons you can find in the Las Vegas guide books which saves you 5 dollars. The sushi is always fresh with so many varieties.  I have never seen so many in one setting. Love it!"
        }, 
        {
            "index": 175, 
            "rating": 2, 
            "review": "There are certain things in this world that can't be mediocre: car brakes, contraceptives, and sushi are three such examples. Whether it is at a fancy NYC hibachi, or a Las Vegas buffet, I expect my sushi to be made with the most care and served with the utmost freshness.\n\nNot so fast...\n\nRemember, there are two type of buffets in Vegas. The good ones and the ones where there try to feed you as much mediocre food as humanly possible for a crazy price. This buffet, which is located at the back of the MIracle Mile Shops is no different.\n\nI've eaten so much sushi in my life that I was quite saddened by this experience. The pieces were small, not as fresh as they could be and the presentation was off. Wasn't terrible, but I am better off spending my money on a Chinese Buffet or Planet Hollywood's Spice Market.\n\nI think I ate here on a Sunday and so with tip my lunch was $28. Waaay too much. Even for Vegas. Trust me and eat elsewhere."
        }, 
        {
            "index": 176, 
            "rating": 3, 
            "review": "I'm not a local, so I don't know all the best places to go in Vegas, but Todai seemed decent enough.\n\nUpon arriving at this all-you-can-eat Sushi buffet, the hostess and waitresses were super nice and allowed to look around before deciding to stay. I find this to be indicative of high customer service.\n\nAfter we were seated, the service was amazing. Waitresses were friendly and constantly asking us if we needed anything.\n\nUnfortunately, the sushi itself was very mediocre. They do have straight up slabs of salmon and tuna, but their rolls are filled with crab salad and not real crab. While they do have other cooked foods at the buffet, sushi seemed to be their major item. You may want to save your money if you're not into seafood. \n\nWhile this place didn't impress me with food or style, it impressed me with service. And for $30, I couldn't complain."
        }, 
        {
            "index": 177, 
            "rating": 1, 
            "review": "This is hands down the worst sushi I have eaten. The selection is poor, and at any given time half the dishes are empty. I felt ill the rest of the day after eating here. Needless to say, my husband and I will not return. There are many other options in Vegas, do yourself a favor and skip this place!"
        }, 
        {
            "index": 178, 
            "rating": 2, 
            "review": "In the land where the buffets are boss, do people really still prefer Todai? Evidently the temptation of Japanese seafood is too powerful to resist as even I have been here on multiple occasions. Through it all, there are better Japanese AYCE spots in the city, but what it may boil down to for most is the warm comforts a chain can bring.\n\nThe Miracle Mile of Planet Hollywood is no stranger to franchised storefronts, after all its the back bone of so many Vegas entities from casinos to restaurants. Where this Todai comes into play is the fact its the only Japanese branded buffet on the strip, where as anything similar is usually a hodgepodge of Asian items. Todai isn't really uniquely Japanese per se, but it is a great place to burn some moolah for a heap of food.\n\nWhat should come as no surprise to anyone, Todai on the strip carries a semi-hefty price tag ($35 per person), especially during their dinner hour. I personally believe if anyone is going to throw down some bucks, let it be during dinner. Their full arsenal of \"the best stuff\" is likely to be on full display.\n\nWhile the array of sushi rolls are visually appealing, they seem to be heavier on the rice and decorations and just a tad too skimpy with the meat. The same idea applies with the nigiri sushi. While the crab legs are plentiful in numbers, the actual legs themselves don't have a lot of substance. I'm not too hot on the hot food (pun intended), but I will shoot for the occasional baked claim, even if its loaded with mayo and crappy spices. \n\nWhenever possible, shoot for the sashimi, which includes more than just salmon and tuna, but yellowtail, white tuna, and scallops. It may not be overly fresh (just sitting on a bed of ice), but it represents the best of their raw selection and is probably the only way to get one's moneys worth without having to shovel endless food in your mouth. Unfortunately, many others will be adopting this philosophy so the sashimi inventory gets cleaned out pretty quick.\n\nWhile everything noted has been generic and such, the two stars really comes from a lack of quality service. Sure, its a buffet and people are really serving themselves. But the service industry in Las Vegas is regarded as one of the best in the world, especially any establishment in any of the resorts or along the strip. I understand I'm holding Todai to what might be an impossible standard - but there is no excuse for being ignored for drinks or dirty plates almost every visit here.\n\nAt least their desserts rule."
        }, 
        {
            "index": 179, 
            "rating": 1, 
            "review": "For over 80$ before top this might be the WORST sushi/Asian buffet on earth. Do your self a favor and go to a legit sushi bar. Don't get scammed by this place! Run away while you still can!  \n\nI try to stay positive and have never given a negative review on yelp but this place sucks."
        }, 
        {
            "index": 180, 
            "rating": 5, 
            "review": "Although this place is on the strip, so it's instantly a tourist trap, this place was great! My family and I dined here on vacation and we enjoyed it.  Has a good variety of sushi, Japanese food and of course some seafood. Crab legs! What Asian doesn't enjoy an AYCE, especially with crab legs!lol"
        }, 
        {
            "index": 181, 
            "rating": 4, 
            "review": "We had a wonderful meal here last night. The shoe she was vamtastic. \n\nThe Tim poor ah shrimp was great.  \n\nThe sha shim ey was fresh and flavorful. \n\nThe only thing they need to work on is their desserts.  For that reason I gave them a four."
        }, 
        {
            "index": 182, 
            "rating": 3, 
            "review": "It would be unfair to describe this place as JUST a seafood buffet or JUST Japanese. For that matter, Todai has a little bit of everything and contrary to its advertising, it;s not just seafood. The bulk of the items are seafood - sushi, tempura, and a variety of Chinese, Japanese, and Korean dishes - but they also have things as random as smoked turkey with cranberry sauce, a decent desert table, udon, and salad. The price was about $23 (w/o drink), which is very fair for the area."
        }, 
        {
            "index": 183, 
            "rating": 1, 
            "review": "Possibly the worst restaurant in all of Las Vegas. It was overpriced (about $34 dinner plus tax, tip) for the utter lack of selection in the food. There were about 5 types of rolls and 2 types of sushi. There was no sashimi. They did have some \"tartare\" which had some sort of spicy dressing on top of it. My guess is to disguise the fact that the fish is not fresh. The crab legs were leaking water. There was more water in there than crab meat, showing that the legs have been frozen for a long time and was recently thawed.\n\nEventually I just parked myself near the oyster station and snatched those up as soon as they were prepared just so i could make the dinner somewhat worth the $34, although I would've had to eat a lot more oysters to get there.\n\nSave your money and go to McDonalds instead. I think everyone here who gave this place good reviews have never had real sushi."
        }, 
        {
            "index": 184, 
            "rating": 1, 
            "review": "I would have given this Todai two stars, but my e-mails were ignored.\n\nI didn't think to write a Yelp review until now.  I came here with my wife in November of 2011, expecting great things because the Todai in Chicago is fantastic.  I was more than happy to pay the $30+ a piece price for my wife and I.  Boy was I in for a shock.\n\nWhen I walked in, I was a little disappointed by their overall selection, it was a bit meek.  I wanted some crab, and they had a lot of it.  The crab was absolutely disgusting, it was inedible in fact.  I rarely take things out of my mouth, but I simply could not stomach it.  The few sushi selections they had were alright, which was what the two stars would be for.  When we were asked what we wanted to drink, I wanted green tea, as well as my wife.  It was $4 a piece for two TINY bags of tea and hot water, and the server never came back.  I couldn't believe I was being served tea bags of green tea, not freshly brewed green tea for the EXTRA price I was paying, and the server did not tell me this before I ordered it.  I figured most Vegas buffets include drinks in the price.\n\nThe fruit was fresh, so after the terrible experience at least we paid $70 for fruit.\n\nI contacted Todai corporate twice, both e-mails were ignored to the fullest extent, and I doubt they are remedying any of these situations.\n\nI felt robbed, and I would have rather dropped that cash on one hand of Blackjack to be honest and I would have been happier."
        }, 
        {
            "index": 185, 
            "rating": 4, 
            "review": "I actually came here back in 2007 around my birthday & since we told them we were there for the occasion, my meal was free.. food was great cause it had all different varieties."
        }, 
        {
            "index": 186, 
            "rating": 3, 
            "review": "Todai's wasn't as good this visit as it was 3 years ago, but I was still well-satisfied.  Will probably skip this place on my next trip, though.\n\nPros:  as much decent tuna and salmon sashimi as you want\nlots of rolls and nigiri to choose from\nThe sushi rolls have good flavor and seem fresh\nshrimp tempura\ncreme brulee\nchocolate covered strawberries\nactual Asians eat there (reassuring...)\n\nCons:\nmost of the rolls have fake crabmeat and/or cream cheese\nmost of the rolls do not have as much fish as I'd like\nCalamari -- I thought it was weird, but my husband liked it.\nplastic plates\nteensy little napkins\nhot tea was delivered to us in the form of hot water and a tea bag"
        }, 
        {
            "index": 187, 
            "rating": 5, 
            "review": "Kann das Restaurant nur empfehlen, ich glaube es sind so um die 20 verschiedenen Suhi sorten. Dazu kann man noch von vielen verschieden anderen Japanischen Spezialitäten auswählen."
        }, 
        {
            "index": 188, 
            "rating": 3, 
            "review": "I debated whether to give this 2.5 stars or 3, but I went with three.  I brought a friend here to experience sushi for the first time. I figured there's such a wide variety that she'd get a good idea of what its all about.\n\nTodai is definitely pricey- over $30 per person. Unfortunately, it was almost empty when we arrived, which meant the sushi was not being pumped out fresh. The ikura, my favorite, consisted of gummy roe that was definitely on the old side. Folks, there is nothing nastier than non-fresh salmon roe. GROSS.  Some of the other sushi had obviously been sitting for a while as well, leaving me deeply disappointed. It wasn't all awful, but for over $30 per person, old sushi is unacceptable.  \n\nI bumped my rating to three stars because I think during a more crowded period the sushi would be fresh and therefore more worth the price. Still, $30 isn't something I'll be paying any time soon for a visit to Todai."
        }, 
        {
            "index": 189, 
            "rating": 4, 
            "review": "Good sushi and all you can eat. Also other taste choices for anyone that doesn't like sushi as everyone else in the party . Make the trip every time family is in Vegas."
        }, 
        {
            "index": 190, 
            "rating": 5, 
            "review": "By far the best in Vegas...Sushi was fresh and delicious...You can get discount voucher from Tix 4 Tonite....."
        }, 
        {
            "index": 191, 
            "rating": 5, 
            "review": "I am a sushi lover and any place that has great sushi and is ayce? win.\n\nThe quality was great too. The service that I experienced was great. \n\nI went to another Todai in San Diego, it definitely wasn't up to par with this location."
        }, 
        {
            "index": 192, 
            "rating": 4, 
            "review": "Love the variety of japanese dishes on offer. My fav are the assortment of sushi rolls and the salad (especially the seaweed and rainbow salad). They also had amazing songs on haha i know all of them. The teriyaki was kind of strange though. Anyways the place is cool, if youre looking for some choices, variety and good japanese food you should try it out."
        }, 
        {
            "index": 193, 
            "rating": 1, 
            "review": "Been to a few other Todai's in southern California and Hawaii and this place was the worst.  I paid $32 for dinner and quickly noticed that they had no salmon?  They did serve yellowtail, which is unusual for Todai but no salmon.  I also love Uni but they did not have that either!  So I figured I would more than make up for the price by gorging on crab legs.  But the crab legs were old and chalky.  Yuk!  No flavor at all.\n\nI know what to expect at Todai but this particular one was very disappointing.  If you are ever in Honolulu, that Todai is the absolute best I've ever had."
        }, 
        {
            "index": 194, 
            "rating": 3, 
            "review": "It's pretty good, I'm just kind of mad I saw a piece of hair in my soup. I'm sur sit wasn't mine it was thick and short.."
        }, 
        {
            "index": 195, 
            "rating": 4, 
            "review": "As far as Las Vegas buffets go...I went to the Bellagio.  They had salmon sushi there; it's my favorite sushi.  I was disappointed with the texture and taste.  I came here today, and it was perfect.  Even the rice was enjoyable.  And of course, the price was a lot cheaper here.  Of course, there were other items on at the buffet...the highlights were the shrimp tempura, the green tea cakes, and the crepes.  I only wish I had more stomach space."
        }, 
        {
            "index": 196, 
            "rating": 3, 
            "review": "I enjoy coming here because the food is always good. Except this time I wasn't all that impressed. I love getting the poke because it's usually fresh but this time it tasted like it was still defrosting in the center of the poke. The muscles were over cooked so they were dry. The oysters were smaller than usual. And the green tea ice cream did not look like green tea ice cream. And to top that off- it didn't taste like it either. I will still go back but I was not impressed this time around."
        }, 
        {
            "index": 197, 
            "rating": 2, 
            "review": "The seafood was very boring and did not taste anything. Sushi was okay, but I've eaten better. Waiter was rude and probably hates his job. If you want to buffet in Vegas you should eat somewhere else."
        }, 
        {
            "index": 198, 
            "rating": 5, 
            "review": "Wow! Yum! This was the last place we had dinner through our Vegas stay.  We unknowingly saved the best for last. Service was good. No problems whatsoever. Everything on the buffet was outstanding.  The sushi & sashimi was very fresh tasting & well presented.  Then after we had an amazing dinner, they kept going with a equally amazing desert area including fresh made crepes! So great we will be back as soon as we are in the area!!!"
        }, 
        {
            "index": 199, 
            "rating": 1, 
            "review": "Disgusting un edible food and way overpriced. Better eat fast food or sit down restaurant and order from menu."
        }, 
        {
            "index": 200, 
            "rating": 4, 
            "review": "This place is great if you love sushi and they have many options to choose from. The only reason I did not give it 5 stars is the lack of other options. I always make it a point to visit here right after I arrive in Vegas."
        }, 
        {
            "index": 201, 
            "rating": 4, 
            "review": "\"So sad that the Todai in Arcadia, CA closed down & became BENIHANA...\"\n\nFOOD: Satisfied my salmon sashimi craving! Lot's of selection of food! Nice crepe section too; the kids were all lining up here :)\n\nSERVICE: Picked up the plates promptly, refilled my drinks a lot too!\n\nBIRTHDAY EXPERIENCE: I would love to go to TODAI on my birthday to get a little green tea ice cream made and a free coupon to come back on my next visit but, I guess those days are over...\n\n\"Would be back, back, back when in Vegas again!\" ;)"
        }, 
        {
            "index": 202, 
            "rating": 5, 
            "review": "Delicious and tasty, large seafood selection, staff are nice. Enjoyed my dinner here. Bought a coupon $2 at Tix4tonight and saved $7 bucks at the entrance. Raw Sake (salmon) sashimi, crab legs, fruits, great selection for desserts (chocolate coated strawberry, crepe, ice cream, etc) no lines, seems people are more crazy in casino buffets......"
        }, 
        {
            "index": 203, 
            "rating": 4, 
            "review": "For a buffet, the sushi is pretty good and there's plenty! For lunch its 24.95 a person!"
        }, 
        {
            "index": 204, 
            "rating": 3, 
            "review": "Todai Las Vegas - Variety here is pretty good. Todai is good EVERYWHERE. It's pretty expensive per person, but what Todai isn't? When I went, they did not have the mini lobsters but all the other great seafood made up for it.They have sushi rolls, sashimi's and all... My boyfriend really likes this buffet the good hot foods, including baked scallop! Yum!... better than Makinos. It is clean and they also offer valet parking.\n\nit is pretty Expensive, todai is everywhere, if ur an out of towner... spend your money on something that you don't have at home..."
        }, 
        {
            "index": 205, 
            "rating": 1, 
            "review": "packed packed packed w/ ppl. that's the reason why I guess the place is messy. food so so, again the buffet area is just a mess. tables use PAPER table cloth. servers all seem very rushed. overall I felt rushed, not relaxed eating there. :p (o and kids running around every where ~ use caution)"
        }, 
        {
            "index": 206, 
            "rating": 3, 
            "review": "Had a few that were great and some just okay. Crab mix was better than most buffet style sushi. Did not refill sections very quickly. Be prepared to take your time with lunch. Okay service. Would return but not immediately."
        }, 
        {
            "index": 207, 
            "rating": 4, 
            "review": "We enjoy this buffet every time we go.  There hasn't been a time when the service wasn't perfect, the sushi selection good and the Shrimp Tempura awesome.  I seriously think that when they see us walk in, they cringe...knowing we will clean out the tempura quickly.\n\nThey have a selection of probably 20 different sushi, 6-7 salads, lots of main dishes and a decent desert selection.  On a small buffet section off the main line, there is a wide selection of fruits and cheeses also.  \n\nDon't forget to show your local ID for a 10% discount."
        }, 
        {
            "index": 208, 
            "rating": 4, 
            "review": "Really great sushi. Lots of choices! Was the best buffet experience I had in Vegas for sure!!\n\nWent for lunch - I bet dinner is even better.\n\nRolls are really tasty and not too heavy with rice - great variety and flavor.\n\nYUM!"
        }, 
        {
            "index": 209, 
            "rating": 2, 
            "review": "Don't waste your precious buffet dollars here. Go anywhere else on the Strip for a wider selection."
        }, 
        {
            "index": 210, 
            "rating": 3, 
            "review": "Sushi Buffet.  I always make a trip to Todai whenever I vist Vegas.  I realized today that their sushi is very inconsistent.  That is why I gave them three stars...\nI have enjoyed most of my visits to Todai in the past, but today was very disappointing.  \nEvery time  I come here, it's always a flip of a coin to go to Todai or Makinos.  Unfortunately, Makinos is located away from the Strip.  Therefore, it is easier to make a trip to Todai instead of Makinos.  If Makinos was located along the Strip, I would always choose Makinos rather than Todai."
        }, 
        {
            "index": 211, 
            "rating": 3, 
            "review": "This Todai is slightly better than others I have been to. The higher traffic in Vegas probably resulted in fresher fish. Having said that, the quality of their sushi is still so-so. There are many better sushi buffet place if you are willing to venture away from the strip. The location is convenient though. For those without a car, this is still a good place to get some budget friendly sushi fix. Still better than the sushi counter at Wynn or Bellagio buffets."
        }, 
        {
            "index": 212, 
            "rating": 4, 
            "review": "Was just in Vegas after a 10 year absence! I used to love going to all the buffets when I visited Vegas as a child and young adult... after 10 years, I see that the buffets have gone down hill... \n\nMy friend and I decided on Todai because we wanted a combination of seafood and meat.. \n\nFood Selection: GREAT\n\nTaste: Awesome\n\nDecor: Simple, clean\n\nPrice: Too high for Dinner $33 dollars is a bit too much!! \n\nOver all our experience was good and we enjoyed the food but the PRICE can be worked on a bit."
        }, 
        {
            "index": 213, 
            "rating": 5, 
            "review": "I gave this 5 stars based on overall value.  We went for lunch, which gives you more time to recover versus dinner, LOL.\n\nI wasn't sure what to expect based on many average reviews.  But for the cost, and a coupon, it was what I was hoping for.  Plenty of sushi and helpful service.  It's a buffet!!  It's not Nobu or another high-end chic sushi place.  You can't possibly expect them to give you multiple $12 plates and stay in business.  Food courts on the Strip can easily cost you what we paid per person and still leave you hungry.  It was also nice to finally get some fruits and veggies in Vegas, since they can be hard to find or too costly to add.\n\nCustomer service was just fine.  We had no issues with plates stacking up or drinks not being filled.  All of the staff members were helpful and courteous.  Philly rolls were quickly snapped up and they made more, so no complaints.  Having the coupon savings translated to leaving a better tip, too.  We thought we'd be punished by using a coupon since many expect those customers to be cheap.  But the savings allowed us to pay it forward."
        }, 
        {
            "index": 214, 
            "rating": 1, 
            "review": "Omg!! Oyster is so fishy and the sushi was disgusting. Kitchen food was so bad. I cannot believe the food was not worth a penny. Gee!"
        }, 
        {
            "index": 215, 
            "rating": 1, 
            "review": "Terrible experience, poor service and terrible attitude. The food is substandard and the setting of the place is poorly done. Definitely not worth the money you are paying. Dirty utensils and cups."
        }, 
        {
            "index": 216, 
            "rating": 3, 
            "review": "Pros: all u can eat, crab legs were great. Awesome desserts. Make ur own crepes n udon noodle soup. Carving station. Good service. \n\nCons: regular food was half empty all the time. Not too much regular food variety. Tight dining area. Most sushi was raw. Yuck.  Fruit bar is off to the side near the front (kinda awkward)."
        }, 
        {
            "index": 217, 
            "rating": 5, 
            "review": "I absolutely love this place!! The seafood is always fresh and totally worth the money!! I make it a point to go here every time I'm in Vegas!!"
        }, 
        {
            "index": 218, 
            "rating": 3, 
            "review": "Good sushi and sashimi buffet but also hit food and tepanyaki! Price is 36 for dinners on weekend and 34 on weekdays. Service is good. Nice place!"
        }, 
        {
            "index": 219, 
            "rating": 1, 
            "review": "My wife and I are sushi buffs.  After reading several yelp reviews, we decided to try this place out.\n\nMan, were we disappointed.  I have to say that the ratings were probably by \"passing\" tourist. \n\nHere is the low-down.  The reason they have a high one star is because of decent service and nice layout.  \n\nThe food should be rated a zero or negative.  This place is called Todai Sushi and Seafood Buffet Restaurant.  Uhhh, if you come here for sushi, you are definitely at the wrong place.  Sushi dishes were awful.  God, it was PIT-I-FUL!!!!  The rice tasted bland and the seaweed wrap was like eating sandpaper.  It was gross... yuk yuk yuk\n\nAs for their other dishes, crablegs were cold and limited, steaks and prime rib were overcooked.  \n\nAnd, what, they charge 34.99??  Kinda pricey man!!!\n\nAgain, as a sushi fan in Vegas, I would not recommend this place.  There are so many other places with better sushi in town. Try Extreme Sushi in Henderson... great people, great food, and price is only $18.99 or so for AYCE.  Also, I would recommend Sushi-Mon in Henderson.  It is more pricey $26.99, but it is very good!!\n\nCheers!!"
        }, 
        {
            "index": 220, 
            "rating": 3, 
            "review": "Pure gluttony, but absolute bliss when you're in the mood for sushi and a myriad selection of Asian products.\n\nThey have a beautiful assortment of sushi, which is strangely made by Mexicans behind the counter. I am not sure how that jives with the Las Vegas crowds, but in the Northeast, usually sushi chefs are Japanese. Oh well, details.\n\nThey offer made-to-order plates, such as stir-fry lobster with noodles. I also really enjoyed their dessert selection. Green tea cheesecake is my favorite!"
        }, 
        {
            "index": 221, 
            "rating": 3, 
            "review": "Went for lunch at first we where a little skeptical but I have to say the selection was great and the food was very good for s 21.00 lunch \n\nWe enjoyed al the salads and the sushi rolls where big and fat sushi was fresh \n\nWe will go back for sure!!!"
        }, 
        {
            "index": 222, 
            "rating": 3, 
            "review": "The food was ok. We went at lunch I have been a fan since we lived in California and then when we moved to colorado ( they close that location). .. But I have to say that the quality of the sushi went down a bit. Maybe the dinner is better but we were not sure since the dinner was 30 so we were a little hesitant to try again. Good selection of rolls. And deserts and fried Chinese food. But this is not what you visit todie for... Charge a little more and have a greater menu of sushi...."
        }, 
        {
            "index": 223, 
            "rating": 1, 
            "review": "They should buy sushi robots (that prep little rice nuggets for nigirizushi or flat rice sheets for makizushi, http://bit.ly/6wfpaL) so their understaffed, languid crew can keep up. Empty sushi trays in a sushi buffet are an affront to paying customers.\n\nThe hot food area was no less meager and unkempt."
        }, 
        {
            "index": 224, 
            "rating": 4, 
            "review": "Every time when I am in Vegas, this is a much stop place for me. Love the food and the service.  Can't ask for more!! Yummy all you can eat sushi and Japanese food. The price is not bad at all."
        }, 
        {
            "index": 225, 
            "rating": 5, 
            "review": "Im a sushi expert and I can tell for me personally, this is the 2nd best place Ive ever eaten sushi!! lots of sushi to choose from and the crispy shrimp is very nice too. the price is maybe a little bit on the high side, but not to be much since its located in planet hollywood in the heart of Paradise."
        }, 
        {
            "index": 226, 
            "rating": 2, 
            "review": "Standard has gone down through the years. Maybe it was the busy season but they were slow in replacing trays that were empty and the crab legs were pathetically skinny and the oysters were tiny. The sashimi was badly cut too, kinda embarassing for a Japanese restaurant and not too fresh."
        }, 
        {
            "index": 227, 
            "rating": 2, 
            "review": "I remember coming to this place in the 90's. I grew up in CA, so I was excited to eat here again. Haven't had it in years. Udon station is something they are known for. Pretty good, not as good as I remember however.\nNow I visited this place twice now and the first time the sushi was not too bad, but this time around it was just gross. Most everything didn't taste fresh and at 1pm, there was nothing but scraps left. I brought a friend from out of town and it was a little embarrassing. Only reason I am not giving them one star is due to the nostalgic factor, and that the first time I came in it seemed like a difference place. Don't think I would consider coming back."
        }, 
        {
            "index": 228, 
            "rating": 1, 
            "review": "Terrible food. Service was good and severs were polite but, gosh the food was just not good. Certainly not worth the price of admission- $77 for two people. So many better places to eat when in Vegas. Don't happen upon this place like we did, you'll regret it."
        }, 
        {
            "index": 229, 
            "rating": 2, 
            "review": "Definitely not coming back ever. Though the sushi was good but you can find much better places around town for cheaper. Their servers are pretty bad and not attentive enough."
        }, 
        {
            "index": 230, 
            "rating": 3, 
            "review": "I liked this buffet because it offerd a lot of healthy options.  It's a Japanese buffet that included non-Japanese dishes.  They serve sushi (rolls, sashimi), salads, udon, chicken teryiyaki, tempura...\n\nThey had really good chocolate covered strawberries!  And they also have a crepe bar where you can have the chef put whatever you want into a crepe."
        }, 
        {
            "index": 231, 
            "rating": 5, 
            "review": "Great sushi and seafood buffet!  Plus my gf and I even found a good coupon for it at the tix for tonight place in the m&m store on Las Vegas Boulevard.  Fantastic food!  I'm happy that I live in a city that has another Todai since I only got a chance to hit the LV one once on my trip."
        }, 
        {
            "index": 232, 
            "rating": 1, 
            "review": "Hands down the worst sushi I have ever had, and incredibly overpriced.\n\nThe sushi wasn't always cut properly with me picking up strung together fish multiple times.  Salmon should not ever have the consistency of squid . . .\n\nThe rolls were very bland as was the sashimi making the unpleasant texture even more noticeable.\n\nI have been to a half dozen 'all you can eat' type of sushi bars, none of which tasted this terrible, and none of them were more expensive than $30.  the $40+ price for us to dine at Todai just made the whole experience that much more awful.\n\nMy advice: stick to one of the other strip buffets - Bellagio, Aria, etc.  You will still have a sushi option with the same price tag, but much better preparation."
        }, 
        {
            "index": 233, 
            "rating": 2, 
            "review": "This place is so expensive for what little sushi it offers and dinner will run you $35 per person. It's mostly rolls stuffed with more rice than fish, but the oysters, shrimp, king crab, and sashimi are decent. I stack my plate with yellowtail.\n\nThis places serves UNI (sea urchin) but you have to request it in person from the sushi chefs and each time you do, they will give you this dirty look as if you asked for their first born child and make you feel bad about yourself. I don't give a damn though and keep coming up for more because I paid a lot for my dinner. They'll even go so far as to say it'll take 20 MINUTES to prepare between orders even though we all know uni is raw, and pre-cut. All you need to do is slap a ball of rice on it and hand it over the glass counter.\n\nSeriously, just hand over the uni and nobody gets hurt. \n\nIf you're a local and you have a car, look up OYSHI RESTAURANT and eat there instead. It's $26 per person for all-you-can eat dinner, not $35, has a far larger selection (but it's all sushi and specialty rolls, no hot foods and American stuff but who cares?), and the service and quality is infinitely superior to Todai. You will thank me for this."
        }, 
        {
            "index": 234, 
            "rating": 3, 
            "review": "I came to Todai for lunch with my boyfriend since he was craving some Shrimp Tempura. Needless to say, he got plates and plates and more plates of Shrimp Tempura. \n\nFor $20 per person, there was a pretty good variety of food, mostly sushi rolls. There was also Salmon and Tuna Nigiri, salads, an udon station, and some desserts. Unfortunately, there was no crab during lunch. \n\nMy favorite part of the buffet would have to be the udon station. Just ring the bell, and someone will come out to make you a bowl. You can add fish cake, sweet tofu, green onions, and a few other things. As a warning, the broth is on the salty side, so I wouldn't drink it if I were you.\n\nWith the plethora of other buffets to choose from in Vegas, I don't think I would care to come back."
        }, 
        {
            "index": 235, 
            "rating": 1, 
            "review": "Food is not fresh, not much selection of food in the buffet. Utensils are not clean. I will not come back. So many other options in Vegas."
        }, 
        {
            "index": 236, 
            "rating": 4, 
            "review": "Can I just say I was pleasantly surprised? I mean this has got to be the best sushi buffet I've been to .. And it's todai! The fish was fresh. The rolls were amazin. The udon was so flavorful. All the other dishes were amazing. And... Their dessert bar was delicious and they served crepes! I wish every todai was this delicious. Whoot Whoot!"
        }, 
        {
            "index": 237, 
            "rating": 2, 
            "review": "Ok ... I'm a big crab leg snob! But I was super disappointed in waiting for dinner and paying more for iced soaked frozen tasteless crab legs. They didn't even try to hide the fact they were frozen by having the boxes of them next to the buffet. So I would recommend lunch only!\n\nOn the plus side, sushi selection and flavor was great. Probably had over 20 varieties of sushi to select from.  They also had \"okay\" customer service - nothing to write home about. \n\nOverall, glad I didn't pay full price for dinner. And probably wouldn't go back for dinner."
        }, 
        {
            "index": 238, 
            "rating": 4, 
            "review": "When I'm craving for seafood this is the place to go. It's better than Makino. I love their crab legs - not overly salty as the ones at Bellagio. Their selection is good for a seafood place. Sashimi, Sushi, Meat, Soups, Salads, Fruits and Desserts. What more do you want?\n\nPS: You can even get Uni. Just ask at the Sushi bar for it. They do not display it though since its expensive\n\nPPS: Locals get 10% discount. Just show your ID"
        }, 
        {
            "index": 239, 
            "rating": 4, 
            "review": "Good food. Wide variety.\nLoved the sushi, sashimi. \nA little bit expensive though.\nUdon is nice but it's just noodle plus the soup. \nWe need to pay for the drinks = a big thumb down. \nCute dessert but only had like 8 kinds."
        }, 
        {
            "index": 240, 
            "rating": 1, 
            "review": "$100 for two people and the fish slices fall off the rice. The sushi rice crumbles when it is picked up to be dipped in the wasbi sauce. The baked shrimp and mussels are swimming in mayo and Korean kalbi tasted like it was marinated for a week. The clam soup was disgusting. The crepe was rubbery and as for the roast beef, it was either the meat or the cutlery, but couldn't get it to our mouths without trying to shove the whole slab in, caveman style. Highlights of the meal was the udon and  mini creme brulee, however, at $50 pp, I would never go back to this Todai again."
        }, 
        {
            "index": 241, 
            "rating": 4, 
            "review": "Wasn't sure what to have for dinner, was walking through the Miracle Mile and came across Todai.  I was aloud to \"preview\" the food before I decided to sit down and eat.  The food selection was good.  From all types of sushi, crab legs, raw oysters, tempura, fried rice other asian cusine as well as the normal turkey and beef.  The sushi rolls were very good.  Several different tuna, salmon and specialty rolls.  The dessert section was vast also, crepes, cheese cake and chocolat covered strawberries.  For a buffet, Todai has good flavor and is worth going to, but bring your appetit.  At over $30 you want to be hungry."
        }, 
        {
            "index": 242, 
            "rating": 1, 
            "review": "If I could give it 0 stars I would... We came in 45 minutes before closing and received very poor service, was rushed to eat, took soy sauce off the table while we were using it so they could prep to leave. Then when it came time for the bill it took over 15 minutes to ring up! We love todai in San Diego but will never return to this location.\n\nAlso this one is independently run and operated so that maybe the reason it is so bad."
        }, 
        {
            "index": 243, 
            "rating": 4, 
            "review": "Ok so the food, in my opinion, was phenomenal!!! I'm from the East coast and our sushi selection is nowhere near as high quality as it may be on the West coast by any means --- don't get me wrong we have some pretty swanki and tasty sushi restaurants here but definintely not as commonly found asit would be in like San Fran or LA. \n\nOk so here it is ... this is not a fancy place at all!!! Not whatsoever (which is just fine with me)... I went her for LUNCH and I found the fish to be fresh and savory ... the other selections were delicious as well...really well put together hot entree samples and desserts. It was most definintely $20 worth ....  I don't think I would go there for dinner  ... but hey Sushi lunch for $20?? You really can't beat that especially when the sushi tastes soooooo darn good!!!! :) \n\nLots of variety in rolls and very colorful selections! I swing by every time I'm in Vegas ... :)"
        }, 
        {
            "index": 244, 
            "rating": 4, 
            "review": "Between 2002-2004 while residing at Phoenix Arizona, a friend of mine invited me for his graduation dinner party at Todia's at Phoenix Arizona.  OMG I love every single of it.  Once I found out they have one here in town, I had to go see it for myself.  I wasn't disappointed, great food and service is off the chain.  Then a few years ago, I traveled to San Francisco/Bay Area and I found out they have one over at that location, same great service and great food.  Only 4/5 stars because distance- have to drive quite a few miles to get to all locations."
        }, 
        {
            "index": 245, 
            "rating": 3, 
            "review": "I went there right before watching Ka. MISTAKE OF THE YEAR!!!!! 1. I ate too much. I am a seafood junkie and even though sometimes seafood buffets scare me, I think I have a stomach of steal (when I really don't) so yeah, I ate a lot. We chowed down and then paid for the bill which is bleh for Vegas cuz you can get a better buffet at Rio or Bellagio. Anywayz, thank gourd during the show I was okay, but after? AFTER?! Oww oysters, owwww."
        }, 
        {
            "index": 246, 
            "rating": 4, 
            "review": "Came here for my birthday and yay this birthday girl eats for free! Keep in mind though you need 3 paying adults with you to get the discount. If you love sushi, abundant sashimi and all the popular dishes one can have at any Japanese joint then splurge here. There meat carving station was pretty dry thus the 1 less star but I came for the sushi and it delivered! Like others mentioned crepes and chocolate covered strawberries..can't go wrong there!"
        }, 
        {
            "index": 247, 
            "rating": 3, 
            "review": "Unfortunately, since its inception many, many years ago Todai has gone down-hill. When I was younger I remember how good the sushi was. Now, I remember to not go again."
        }, 
        {
            "index": 248, 
            "rating": 4, 
            "review": "I only have good things to say about this buffet. It's a chain - there are locations in east Asia as well as California - but I think it stands up well against most of the buffets in Las Vegas.\n\nSure, the sushi isn't anything transformative (there aren't any visible sushi chefs), but so what? The fish plates, the desserts, the sides were all delicious, and I enjoyed trying samples of everything. A pitcher of Japanese beer - it's that sort of place - didn't hurt at all, either."
        }, 
        {
            "index": 249, 
            "rating": 3, 
            "review": "Came for my sister's coworker's birthday. For the price it definitely wasn't worth it. The sushi selection is rather weak in my opinion. You can go to a place like Makino's and get double the selection for half the price. Btw there was a fly stalking the sushi bar and one of the workers watched me swat the fly away at least 3 times and did nothing about it. And I'm pretty sure the fly landed when I walked away. Overall the food was good but something I would expect from a Buffet @ Asia or a China Star."
        }, 
        {
            "index": 250, 
            "rating": 4, 
            "review": "The food here is pretty good, not great, but it feels like you're getting you money's worth. The service is pretty efficient. They don't waste time on small talk and just do their job, i.e. take away plates, refill cups, etc. There are better buffets out there in Vegas but this one had a free pass for our group, so that was a plus."
        }, 
        {
            "index": 251, 
            "rating": 1, 
            "review": "Bad experience, rushed out, they usually close at 230 but they close earlier whenever they feel like it I guess. Usually like this place but won't be coming back. Not going to pay my money to be watched constantly and rushed out."
        }, 
        {
            "index": 252, 
            "rating": 3, 
            "review": "Decor = nice and clean.  tons of seating\n\nService = average service\n\nFood/Drinks = The food were better than the Todai in CA.  Sushi quality was better than I thought.  FYI - There dessert kinda suck.  PS - We were dying for water that nite after our meal... i guess there were plenty of MSG/Salt???  :)\n\nValue =  $25 (with coupon from halfprice tix)  pp before tax/tips  Average for a dinner buffet in LV. \n\nKid Friendly = Good\n\nRecommendation = After my 1st plate of sushi, I ran out of things to eat.  :(  For people who like sushi/rolls and not much into other things, this is a good place to go."
        }, 
        {
            "index": 253, 
            "rating": 4, 
            "review": "Todai is an independently owned and operated somewhat upscale Seafood buffet in the miracle mile mall. They feature many Asian salads, a hand rolling corner, crepe corner, noodle corner, carving station and micro mini fancy desserts. The sushi is middle of the road sushi, not high end but good and rolled very small the way it should be. Everything I tried was fresh and had mackerel , tuna and salmon sushi.I liked the kimchi here, it wasn't too sour. They had another salad that looked like kimchi but was spicy napa cabbage that was slightly sweet. My favorite salad was the green tea chasoba. The tempura was fresh and light. Beer, wine and sake are available.\n\nI would rate 4 stars for lunch during the week. (around $20)\n\nThe price is higher on the weekends and increases for dinner. (around $23 and $33)\nThere is a coupon in the Vegas magazine for $5 off\n\nFor around $20 for lunch during the week in Vegas it's a pretty good lunch."
        }, 
        {
            "index": 254, 
            "rating": 4, 
            "review": "I have never had sushi at a buffet, so I was skeptical.  But I was impressed.  While it is pricey, I thought all the food was good.  I even really liked their small desserts.  Besides the higher price, my only other con is the room is vast and not very intimate.  But I will return. I liked virtually everything I tried, which is often not the case at most buffets.  I tried the eel, clam soup, rainbow roll, salmon sashimi, mixed seafood tempura sushi, tempura veggies, baked salmon, shrimp, shrimp puff thingy, bacon wrapped asparagus, miso soup (eh), seaweed salad, mint white chocolate, key lime pie, crème brulee, and had a ginger ale.  Service was good also.  But I have come to expect that in most places in Vegas."
        }, 
        {
            "index": 255, 
            "rating": 5, 
            "review": "Im a big fan of this sushi resturant.  The best all you can eat Sushi buffet in Las Vegas.  It is supper clean, Laid out great, and the rotation of the sushi is quick and they keep it fresh.  They have awsome deserts and salad bar.  I highly suggest taking a your friends out for a fun night of sushi here.  It is located in the mircal mile shops at Planet Hollywood."
        }, 
        {
            "index": 256, 
            "rating": 4, 
            "review": "Sushi buffet was delicious. Hot foods were yummy. Overall very happy camper. I wish we had one of these back home."
        }, 
        {
            "index": 257, 
            "rating": 4, 
            "review": "Okay, let me preface this by saying that we had a coupon (coop-ins!) for what we thought was $5 off every person's meal. No, it was $5 off the whole ticket, and dinner is $35+ per person. So, with the thought in mind that I better be able to enjoy $35+ worth of food, we went in. \n\nI found the Sushi/Sashimi selection to be very good, and would only have like a little more description of what it was, but I know a little about what I won't eat (fish roe) and what I will (raw Tuna, Salmon, White Fish) to be able to get just what I want and try something new. \n\nI did try the hot bar because I was so hungry I wanted some rice and chicken to settle my stomach before the Sushi/Sashimi, and I thought it was good. Not great, but good.\n\nDesert was odd as I wasn't in the mood for green tea ice cream, so I tried the bite-sized cheesecake, mango cake, etc. It was all good, but it didn't mesh with the rest of the menu very well.\n\nOverall, I left full, but not uncomfortable, and was not hungry later the way I am with most Asian foods. I would definitely recommend Todai, but maybe for lunch, instead of dinner."
        }, 
        {
            "index": 258, 
            "rating": 3, 
            "review": "Great buffet! Our little vacation crew went here for lunch one of the days we were in town. The spread was good and there were many options for sushi and non sushi items. Desert - green tea ice cream please!"
        }, 
        {
            "index": 259, 
            "rating": 2, 
            "review": "Excellent service. Good Salads. If you not a sushi eater, you are Ok. But if you like sushi this place could not make proper sushi, if it hits them over the head \"silly\". I ate sushi there with sticky \"pasty\" rice that stuck to my teeth. Rice seasoning was not properly applied as well. Seaweed could not be chewed either. It was way  too hard. The raw tuna was bright red and salmon was falling apart. All pointing to the low quality of supply products. There are Mexican stuff making sushi which beside rolling do not know anything about it. Stay away. In Brooklyn this place would be closed in a month."
        }, 
        {
            "index": 260, 
            "rating": 5, 
            "review": "Amazing sushi bar! It's a buffet but by the quality of food you would never know it. They have a variety of Asian foods including some great Hawaiian Katsu. They must have 50 different types of sushi and all of it's very fresh. This place received 5 dumplings and is a must visit when in Vegas."
        }, 
        {
            "index": 261, 
            "rating": 4, 
            "review": "Everything here was phenomenal, so glad i found one in california. The sushi was actually good you expect something not so great since its a buffet but all the sushi was amazing i wasnt a real fan of the chinese food but i was there for the sushi. Stayin up late and drinking doesnt make me wana eat any fried food. I wanted somethin cold tasty and thats exactly what me and my husband got. \n\nDRINKS ARE NOT INCLUDED. Just saying i saw a table complaining about it so dont be surprised if your tab goes a lil up.  \n\nWe parked in planet hollywood but i read somewhere theres free valet parking. So theres no reason why you shouldnt go :)"
        }, 
        {
            "index": 262, 
            "rating": 4, 
            "review": "I have been here twice. I come here specifically to gorge on the salmon nigiri. I only eat the fish and leave the rice. The rolls are all pretty tasty. The other food is just ok. I have only come here for lunch. I recommend eating here for decent sushi at a decent price."
        }, 
        {
            "index": 263, 
            "rating": 4, 
            "review": "This Todai Buffet is located in the Miracle Mile Shops, right at Planet Hollywood.  Also, conveniently across the street from our Marriott Grand Chateau.  This was the best sushi and seafood buffet that I have had so far.  They have a huge selection when it comes to sushi.  Very clean and comfortable.  I see there is one in NY.  I will have to try that one.  I believe dinner was $36 a person.  A little high, but would go again."
        }, 
        {
            "index": 264, 
            "rating": 5, 
            "review": "Great buffet!! (if you like sushi) We came here for lunch and the sushi was fresh. There was a great selection of rolls. They didn't have sashimi but the nigiri were pretty big. They also have other dishes that you find at a normal Chinese buffet like fried rice, chicken teriyaki, and pot stickers. The tempura was pretty good. There was a meet carvings and made to order crepes but I didn't try any of that. They do have soft serve green tea ice cream which you never see at buffets. I think dinner has crab legs and prime rib. Definitely a must stop every time I come to Vegas. It's the best bang for your buck. We paid $2 at Tix4Tonight booth so dinner was only $16.95 as opposed to $21.95. Compared to other lunch buffets on the strip that will cost close to $30, this was definitely worth it."
        }, 
        {
            "index": 265, 
            "rating": 4, 
            "review": "I was in Vegas for G3 . One of my Posses annual traditions is hitting an AYCE Sushi Joint.  This is where Todai comes in . Some of the Posse had never been to one . \n\n So for a new experience we went to this one.  It was $33 per person ,not bad by Vegas pricing .\n\nThey kept the Sushi well stocked and it was fresh . They also had Pork Belly Yumm. The Prime Rib and Roast Lamb was on point . \n\nHad a very Cute and Attentive Waitress which was a Plus.\n\nI would return it was a Cool Dining Experience."
        }, 
        {
            "index": 266, 
            "rating": 1, 
            "review": "Yuck! It's generous to give this place one star! I love sushi, seafood and oysters, but right now the smell of the food in this place makes me want to vomit! Nothing tastes fresh, I thought the fried rice was safe, but even that tastes funky! Can't wait to get out of here, it's just unfortunate that I have to pay for it first!!"
        }, 
        {
            "index": 267, 
            "rating": 4, 
            "review": "I was just excited to see that this Todai is still open as many are closing in California.  Got to feast on some of my favorites; poke and sushi.  Didn't eat much hot food as it was 102 degrees."
        }, 
        {
            "index": 268, 
            "rating": 3, 
            "review": "For those of you who didn't grow up in California, Todai is  where sushi buffets originated- this  in the days prior to AYCE, of course. Most CA locations are closed now, so I've only heard the stories...\n\nEven when they open at 5:30 for dinner, there are people waiting. Staff is smiling and prompt,  the fresh and large buffet selection awaits. Service was attentive, but as others have pointed out, silverware and napkins are out on the floor and need to be picked up separately. Minor irritation that there are plastic cups available for condiments by the prime rib station, but not by the cocktain sauce or tempura sauce stations- odd and a little inconvenient. Not to mention the soy sauce on the tables but no cups for that, either.\n\nHighlights include the make your own udon and dessert crepe sections, the veggie tempura spread, and of course- the seafood. No, the quality isn't what you'll find at the nicer AYCE places off-Strip, but the fish is super fresh and there is a small selection of sashimi, and the quality IS better than your average buffet. \n\nI really liked that there were about 12 rolls out on display, with labels. No confusion about what random roll I was eating, and the pieces weren't packed with tons of rice. I rather enjoyed that the pieces were cut small, so that I could try a bit of each rather than just a few before filling up.\nIn addition to sushi and sashimi, I also filled up on poke and shrimp cocktail, my usual buffet stand-by. Crab legs are also available at weekday dinner, but I did not partake.\n\nEDIT; two months later, I'm subtracting a star for lack of consistency. Raved about this place to a fish-loving friend and visited for lunch just after picking him up from the airport. Got here just before 1PM and selection was limited, fish seemed questionably fresh, and overall experience was extremely underwhelming- I was embarrassed to bring someone here."
        }, 
        {
            "index": 269, 
            "rating": 4, 
            "review": "Good service... Meaning you could never make progress with your glass of water. \n\nBesides catching bits of shell in the clams and some bone fragments in the Korean ribs.... For 35 bucks a person after tax, it was a dozer after the fact! There's a decent variety of raw fish and Chinese food. \n\nEnjoyable. Good atmosphere. Walk it off on the strip. Careful not to burp it up on the dance floor."
        }, 
        {
            "index": 270, 
            "rating": 3, 
            "review": "$20 a head for lunch buffet is a little pricey for me, especially since I don't eat sashimi.  I can't say  much about the sushi, other than the california roll had a nice crunchy cucumber in it, and the rice was pretty decent.  The tempura was okay.  The shrimp was good, but the yam didn't have much flavor.  They have some pretty good ribs.  There was also pork belly, but I'm afraid of all that fat.  I can't imagine wanting to eat solid fat, I just can't.  They had some pretty tasty clams.  There were also some crab legs in there, but I was too lazy to eat crab.  After going to the Wynn buffet the day before, I didn't even look at their desserts.  Nothing could possibly compare...  They had some pretty sweet watermelon, canteloupe, and honeydew though.  (Don't eat the fruit cocktail when the fresh stuff is way better.)\n\nService was okay until we wanted to leave.  Then for some reason, we couldn't.  Took forever for them to get my check, and after about 15 minutes of sitting around and being told that someone would be around in a few, I finally got up and went to the cashier's desk to get my credit card back."
        }, 
        {
            "index": 271, 
            "rating": 3, 
            "review": "Overall the food is just so-so but there are usually a few really good\nitems. I love pigging out on sushi once in a while,even if it is sort of\nmedicore. The service is always good and it's FUN. I'll keep going \nto Todai every now and then but I can see the day will come when either the price will have to be $50 for dinner,or the quality will drastically decline. It's inevitable."
        }, 
        {
            "index": 272, 
            "rating": 4, 
            "review": "Excellent sushi buffet with hot items as well.  Not a date-night type atmosphere, just real good food.  We love it for lunch!  \nFYI, this is not like the sushi on a Chinese buffet.  This is high quality food that's really fresh.  Try it out1"
        }, 
        {
            "index": 273, 
            "rating": 5, 
            "review": "I'm so sad that this place only got three stars!  Whenever I come to Las Vegas, I go to this sushi buffet.  I've always loved the sushi selection here.  However, I'm not a picky person when it comes to sushi.  Heck, I love sushi boy!  \n\nThere are lots of tables here so I have never had to wait for a table.  The sushi is always refilled fast.  The non-sushi items are delicious too.  I can't think of a drawback to this place.  Oh, well, its a little pricey, but it's a buffet.  :)"
        }, 
        {
            "index": 274, 
            "rating": 4, 
            "review": "King crab legs 4 stars-Quality better than most of the hotels on the strip. Other selections ok! Big variety of OK sushi. They charge every drink except water!!!"
        }, 
        {
            "index": 275, 
            "rating": 2, 
            "review": "Overpriced for mediocre quality, but the variety is what you pay for. But if you know what to get, you might get your money's worth.\n\nOne dish you can't screw up that I always get is the udon. The noodles are sweet enough and you can add as much seaweed, fish cake, and spice as you'd like.\n\nI wouldn't recommend getting the sushi rolls because you can't tell what's in them anyways / their \"labels\" don't explain which is which. So instead go for the nigiri, it's not the most fresh sushi ever, but it still tastes better than piling on endless amounts of \"toppings\" and calling it some absurd roll like a 'cats paw roll'.\n\nLastly, I suggest you stock up on the tempura because it's something everyone loves and it's not very difficult to make / screw up.\n\nI also came on a Tuesday near the end of their lunch time, meaning it wasn't too packed but for some reason the service still took 'forever and a half' to help us... I'll always come here because it was my sisters favorite sushi place, but it definitely wasn't my favorite meal todai."
        }, 
        {
            "index": 276, 
            "rating": 5, 
            "review": "Of all the Todai's I've been too... I love the Las Vegas Todai the most. They have more selections and really friendly service. For some reason I didnt get sick off of this Todai.. hahahaha and the arcadia  one usually I get purty sick.. eWwww.. haahhaha"
        }, 
        {
            "index": 277, 
            "rating": 4, 
            "review": "When you're drunk and hungry from walking so much and also craving for seafood? Then try out this place. I'm a huge seafood person and not going to lie there are better places out there for seafood but first time here I really like their crab legs and sushi. I think its fresh ether that or I was too drunk to notice the difference haahha over all I'd come back here when I'm in town again. :)"
        }, 
        {
            "index": 278, 
            "rating": 5, 
            "review": "Food was delicious, good variety of sushi. They also have other asian staples. \nThey have pretty good desserts as well. Only complaint is that its pricey. It was worth to my friend & i"
        }, 
        {
            "index": 279, 
            "rating": 2, 
            "review": "I will be very generous and give it two stars.  I come from California and this just can't even compete on price, quality and variety. Lunch is 19.95 and for that you get miniature rolls, nigiri and salads.  The hot entrees were even worst.  Overall, it's the Asian version of Homestyle Buffet, Sizzler, or Golden Corral. So don't expect much."
        }, 
        {
            "index": 280, 
            "rating": 1, 
            "review": "Walked in here to eat dinner, pretty expensive for the quality $73 for 2 dinners and 2 cups of tea. I'm giving one star for the look of the buffet, cos it did look delicious, unfortunately zero stars for the taste. I know buffets don't always have the best quality and this one was no better. The sushi and sashimi were tasteless. The beef was cold and inedible, veg was soggy. Very disappointing. They did have some nice deserts, but stay away from the ice cream, very grainy. If you're looking for a good seafood buffet this is not the place for you."
        }, 
        {
            "index": 281, 
            "rating": 4, 
            "review": "One of my favorite spots to eat when in Vegas! All you can eat seafood and sushi!! Excellent selection of sushi and hot items. Everything is fresh and always looking so good. The price are pretty good when you think of all the food you get, and believe me, I can eat A LOT of sushi! If you haven't tried this place, you definitely should give it shot."
        }, 
        {
            "index": 282, 
            "rating": 4, 
            "review": "Well its been about my 4th time here now. So arrive 1:50pm. Was told they will close at 2:30pm to clean but we can stay while closed. We went ahead. I literally tried all there handrolls. Quality is good. Fresh taste. They had many variety of handrolls and fresh sushi. Many seafood items. Price have gone up. $23.95 for lunch now and that does not include soda. Anyways still worth the money since sushi is so expensive. Still the best sushi buffet i ever tried."
        }, 
        {
            "index": 283, 
            "rating": 5, 
            "review": "YUMMY YUMMY YUMMY\n\nIf this place was affordable I would eat here monthly. Lots of sushi choices and crab legs. The wine is $10 a glass so you have to pace yourself. It's too bad that the restaurant isn't as esthetically pleasing as the other restaurants in PH, but that doesn't hinder the food. They have a nice dessert selection, I enjoyed the cream puffs and mini creme brulee."
        }, 
        {
            "index": 284, 
            "rating": 5, 
            "review": "I understand if one has their doubts about AYCE sushi, but the quality of the food here is amazing! There's an incredibly wide variety of both sushi, hot foods (love the roast beef!), and desserts. I visit Todai every time I'm in Las Vegas, and I've never been disappointed!\n\nAlso, I haven't had a problem with service. I'm sure some people (as you might have read in one or two reviews) had a miss, but that will happen once in a while at ANY restaurant. Don't let that deter you from a great place to eat; in general, Todai service is very good! I recommend this to anyone planning to make a trip to LV!"
        }, 
        {
            "index": 285, 
            "rating": 4, 
            "review": "One of my favorite places to eat in Vegas! Great service and an excellent sushi selection. Well worth the price tag, especially because it includes sashimi. They also have a great poke salad. The service is good, especially for a buffet setting. The fish is always fresh and moves quickly so you don't have to worry about it sitting too long, and you can order custom rolls from the counter if there is something special you would like. The chefs are always very friendly and do their best to accommodate, even when it's busy. In addition to sushi there is a chocolate fountain with fresh fruit, some deserts, tiny cakes and tartes, Tephan Yaki, shrimp cocktail, crab legs, tempura, edamame and dumplings, as well as a few different kinds of salads. Get there early, this place does fill up and get quite busy."
        }, 
        {
            "index": 286, 
            "rating": 4, 
            "review": "Love Todai.\n\nAnd this was a perfect option for us because my boyfriend is not the biggest fan of raw fish and there were plenty of cooked options for him (and raw options for me) ;)\nThe food tasted really good and it was very enjoyable.\n\nI haven't been to one in a long time and so I can't really compare it to the times I went to Todai with my family in San Diego back in the good old days...(I haven't been to the San Diego Todai in years either)\n\nBut I do know that the atmosphere was not that interesting. I did like the decorations but as far as being a nice dining area, it's not really, I think the one in San Diego is more intimate. A woman interrupted us to take some pictures but I guess that's what comes along with being in Las Vegas. Oh, and we were located right next to a sidewalk and so we got front row seats to see and be seen by odd tourists and the ravers, who wore paint instead of clothes, that came for the weekend."
        }, 
        {
            "index": 287, 
            "rating": 1, 
            "review": "This place is so busted!!! So many other great sushi places just a hop skip and jump away!!"
        }, 
        {
            "index": 288, 
            "rating": 5, 
            "review": "I love this place...every time we are in Vegas...we must have one meal here...the food is soooo good.  I don't eat lunch, so I can chow down on their amazing food.  I love it."
        }, 
        {
            "index": 289, 
            "rating": 2, 
            "review": "Eh.. Came here because it looked like a nice place. A little expensive considering there wasnt much to offer. No crab legs, no shrimp, nothing but sushi. Oh wait there was 3 different types of mussels out. I left still hungry for more food unfortunately. I wouldnt recommend it."
        }, 
        {
            "index": 290, 
            "rating": 5, 
            "review": "Todai was awesome. My family and I got so full. \n\nI went all out on the sashimi and sushi. \nThere's a bunch of other Asian dishes too that are really good. \n\nThe desserts are awesome. They have delicious green tea ice cream and they make crepes however you like it right in front of you!\n\nExpensive place but definitely worth it to me.   The staff is very nice and their performance was outstanding."
        }, 
        {
            "index": 291, 
            "rating": 5, 
            "review": "The best sushi buffet I have ever been to. Endless variety, very fresh, very tasty, and wonderful atmosphere.\n\nFor some reason unbeknownst to me, there have been a fair amount of negative reviews of other Todai locations posted here. This has led to the closing of two of my favorites - studio city (LA) and Chicago. I was extremely sad when the Chicago todai closed, since that was the closest one to where I live (Indiana) and I had driven 3 hours just to eat there.\n\nPlease don't believe the negative reviews and please don't let this todai location go under too! It's too good. If you like sushi or seafood at all, give it a try. Every time I'm in las Vegas I eat here at least twice - and given the competition for seafood buffets in Vegas, that's saying something."
        }, 
        {
            "index": 292, 
            "rating": 2, 
            "review": "First, it is a sushi buffet, so the servings are smaller than you get in a respectable true sushi restaurant.  \n\nWhat I saw that summarizes this place:  I noticed them taking vacuum packed, labeled like retail sale, fish out of a refrigeration unit and cutting them open.  If you have ever gone to a true sushi place, the sushi chefs spend lunch/early afternoon filleting fish, doing the prep work\n\nIt does have a place and a function, and I didn't see anything that would make people ill - but \"Meh\" fits"
        }, 
        {
            "index": 293, 
            "rating": 5, 
            "review": "I love going to Todai everytime I visit Vegas. This year, I went with my mom and sis for dinner since we love sushi buffets. I stocked up on all the good stuff, of course... sashimi, the rolls with less rice (so I can eat more =P). All are excellent quality of course. Oh, and the chocolated covered strawberries are so freakin good! Finally, finish it off with crepes and you're set for the night!"
        }, 
        {
            "index": 294, 
            "rating": 3, 
            "review": "Decidedly average. Everything was good, but not exceptional. And lots of sugar in the dressings and sauces--not in tune with my taste."
        }, 
        {
            "index": 295, 
            "rating": 4, 
            "review": "My boyfriend and I visited Todai over President's Day weekend.  Coming from MN, it was the best seafood/sushi buffet we have ever been to. The seafood and sushi tasted fresh.  There was a large selection of sushi rolls.  The king crab legs were delicious.  The baked shrimp was really good too. My boyfriend and I were very impressed and will make a stop here on our next visit to Vegas!"
        }, 
        {
            "index": 296, 
            "rating": 1, 
            "review": "It's pretty low quality across the board.  Hoping I don't get sick. Nothing is as good as you want it to be. Everything mediocre at best.  Unless you have little experience with Japanese/Sushi... Avoid this place.  Pretty pricey too...."
        }, 
        {
            "index": 297, 
            "rating": 1, 
            "review": "The management here need more training, Kate and April. I came with my 100 year old grandmother, whom was asleep. She woke up and I gave her 1/2 bowl of rice to hold so she doesn't feel left out, the manager came over and wanted to charge us $5 for her holding the rice and taking 2 bites of the rice. Just a note: she went back to sleep after just a couple of minutes. We have been in Vegas for a whole week and many places that cost more than here I.e $50 a person ... Did not charge her and they actually celebrate her amazing age. She really doesn't eat at all. I am shocked at the attitude of the management here, especially Kate. I dont know if she has a grandmother, but, hope she can be more sympathetic to senior citizens, disabled people, and family with special needs. \n\nThere is always exception to the rules... Accompany the guests and Evaluate the situation next time. \n\n*** I would give a 0 star, except you have to give one star to post the review."
        }, 
        {
            "index": 298, 
            "rating": 5, 
            "review": "Absolutely a must go if your in Vegas and craving some all you can eat sushi and seafood. The food is good, pricing is reasonable. I don't see why people say its expensive is the same price as any other buffet. Definitely recommend this place"
        }, 
        {
            "index": 299, 
            "rating": 4, 
            "review": "Went here to eat lunch while in Vegas on a business trip.  I was a bit skeptical due to the other reviews, but still went.\n\nI think this place gets a bad rep from some of the other reviews. The food was really good for a buffet, at least during lunch."
        }, 
        {
            "index": 300, 
            "rating": 1, 
            "review": "bad experience at this todai. prob bc we came in right before they were closing. but still...some of the typical stuff like sushi wasn't that great. food was of course was cold or just seemed like it's been out.  it only takes one bad experience for me to just stay away from a place specially when you're spending like 50 a person. if you spend that much expect the food to be good even when they about to close. learn from my experience and don't come in like hour before they close."
        }, 
        {
            "index": 301, 
            "rating": 4, 
            "review": "I won! I apologize for causing the tuna and salmon shortage on the west coast. The sashimi salmon and poke alone was worth the price of admission for me. Everything else was just a bonus. I did stay away from the round eye stuff ie carved beef and turkey. It looked a bit dry and I didn't have anymore room after eating a whole fleet of fish. Yeah it is a bit pricey but when you spend $10 at fast food what do you expect for $30-40 now a days. I found this Todai much better than the one in Orange CA. Would have been 5 stars if the waitress remembered our drinks and brought us silverware."
        }, 
        {
            "index": 302, 
            "rating": 4, 
            "review": "For once, little tiny sushi made my life easier and I didn't feel like I was being ripped off.  A sushi bar is fun since I love stuffing my fat face with as much sushi as I can, but that can get pricey normally.  Throw in some soup and whatever the hell else I want and this place is a good deal for better-than-average sushi.  I'm glad we chose to stop here while on the strip."
        }, 
        {
            "index": 303, 
            "rating": 4, 
            "review": "This place is the best Japanese buffet I've eaten in Las Vegas. There a a lot of sushi places and a few other Japanese buffet areas, but this is the best place to me. They have the most varieties of sushi, Japanese food and desserts. The food here is delicious. They sometimes have sashimi and poki. If you're gonna eat here be ready to eat a lot of food. Come with an empty stomach because when you see the food you're gonna want to try them all."
        }, 
        {
            "index": 304, 
            "rating": 5, 
            "review": "Their all you can eat sashimi bar and the oyster bar was great. I have not seen all you can eat Fresh sashimi bar like this any where..."
        }, 
        {
            "index": 305, 
            "rating": 4, 
            "review": "Enjoy your food, every bite savor the layers of complexity.  The goal of this place is emotional as well as physiological.  The windows bring the sub in,as you sit at your own white-cloth covered table and individually experience every piece of seafood.  It's all your choice, either sushi of many varieties, oysters covered or not, and land creatures as well.  Experienced with someone, it's a carnal desire.  Is it worth the money?  Only you can answer that.  For me, it's as close as I can get to san Diego without Leaving Vegas."
        }, 
        {
            "index": 306, 
            "rating": 5, 
            "review": "This place is great. It has just about every type of Asian food. This is a must try place for folks that love seafood and Asian food, that also are on somewhat of a budget. It's become a staple for my wife and I when we travel to Las Vegas."
        }, 
        {
            "index": 307, 
            "rating": 4, 
            "review": "Having said that: I am a fan because I am only reviewing the early lunch.   I walk in, eat and walk out again.   This is not the place I visit for dinner, so I can't tell you what it's like later in the day.    Service: it's ok, it depends who is working, I guess.  Not that it should have anything to do with good service; not at all, so I'd say service is inconsistent in terms of friendliness.   Food: I think it's good value for money.  Is it the best sushi I have ever had in my life?  No, it's not.   But, for the price it's quite good \"bang for the buck\" as Americans say.   Sushi is good quality, the weakest spot would but the sushi rice which is not always consists (do we see a pattern here?).  However, the fish is good quality, the tempura is tasty, I don't do desserts but have tried a bit of almost everything just to be able to recommend.   I am visiting LV frequently and whenever I have the time and a craving for affordable sushi, I end up at this place."
        }, 
        {
            "index": 308, 
            "rating": 3, 
            "review": "This Todai doesn't have many food selections but the sushi quality is quite good. The sashimi is fresh and there are plenty of rolls to choose from. The hot food section and dessert bar are both decent. The udon noodles weren't that good, but I did enjoy the fresh teppanyaki. I didn't like the green tea ice cream, as it was cheap soft-serve rather than creamy ice cream like at other locations. I was surprised that they didn't have shrimp cocktail.\n\nThis is a good place to go if you're like me and only eat the sushi! Approx. $22 for lunch."
        }, 
        {
            "index": 309, 
            "rating": 4, 
            "review": "Todai is my favorite all-you-can-eat buffet! At least just try it once to experience what Todai is all about and why I love it so. If you don't like fish at all then by all means stay away.\n\nI am a fan and I have been here every time I have traveled to Las Vegas on an empty stomach. Although it may be a little expensive, I would pay it because it is worth it. Come on, as much sushi as you want until your heart explodes! Complete win for me!\n\nIt not only serves unlimited sushi (quite a variety, I might add) but also some unique side Asian salads, some classic Asian entrées (fried rice, chow mein, soba noodles, etc.), even some classic American favorites (mashed potatoes and gravy, roast beef, bbq chicken, etc.), and a very, very nicely done dessert area filled with the perfect sized treats that make it so you can eat more than one and not feel guilty. Some sweets that they have include: cheesecakes (a variety including green tea cheesecake), ice cream (including green tea flavor), chocolate/stawberry mousse, cookies, cakes (including green tea flavored), jello, and everybody's favorite: a fresh crêpe maker.\n\nDefinitely check out my photos of the food because it will give you a tenfold better idea of what this place is all about. I love it and who knows, you may be a fan just like me!"
        }, 
        {
            "index": 310, 
            "rating": 5, 
            "review": "Theeeee best seafood buffet on the strip! The Korean BBQ is amazing! Theres a great variety of fresh sushi and the crab legs are very big with plenty of meat!  A must go when your in vegas!"
        }, 
        {
            "index": 311, 
            "rating": 4, 
            "review": "Loved this place! Came here with my parents, who happened to be buffet fanatics, and flipped when they found out it was a sushi buffet. Words cannot describe how fresh, colorful, and diverse the sushi options were at this buffet. The buffet also contains non sushi items (like fried tempura, udon soup, desserts, etc.) also very children friendly!\n\nI think the important thing to remember sushi is how fresh the raw food is. The sanitation was also top notch. Our waitress was on top of her game and ready to take out finished plates out of our way. \n\nDon't forget to leave room for their green tea ice cream! Las Vegas would have not been the same for our Asian family if this buffet didn't exist!"
        }, 
        {
            "index": 312, 
            "rating": 3, 
            "review": "We went to Todai for lunch.  Out of all the Todai's that we've been to, I think this one's been the best.  Now this doesn't mean you're gonna find all kinds of sushi, rolls and other types of food here.  But maybe because we didn't expect it to be all that good it tasted better.  We went there for lunch right after we landed in Vegas and checked in to our hotel.  We were very hungry and I'm sure that added to the flavor.\n\nThe service there was very good and the food was better than expected.  If you go there expecting Todai food, you won't be disappointed.  Don't go there expecting anything else."
        }, 
        {
            "index": 313, 
            "rating": 4, 
            "review": "We were here for dinner on Christmas day and the place was packed.  We arrived at 5pm and waited a little over an hour.  The sushi and sashimi was pretty good, better than any of the other buffets in Vegas.  The crab legs had more meat than those in more expensive buffets.  The made to order udon was also good.  The desert was good too although i only had the crepes, cream brulee and the green tea soft ice cream.  After eating here, this will be our buffet of choice when in Vegas."
        }, 
        {
            "index": 314, 
            "rating": 1, 
            "review": "I normally don't want to give any bad rating like 1 star. But Todai in Miracle shop - Las Vegas is unacceptable. Am I too harsh? Consider Todai locates in one of a big shopping malls, in one of a significant Hotel & Resort, beside that Todai was a good brand name for a buffet restaurant chain. What would you hope to experience in such place with price $34/ ticket on a regular dinner (not at the weekend)?\nThey carries most kinds of food like any other asian buffets as you expected: sushi, crab legs, shrimps, salads, tempuras, stirred fried vegetable, fried noodle, fried rice, beef, sausage, dessert including crepe served by order, 2 flavors ice creams, cream brûlée, cakes, cookies. You can name it. BUT\n1. They place foods on the show cases just little, only bring some more when the foods almost run out. You might get a new hot dish if you have enough time and patience. \n2. Presentation of foods looks cheap. I had a feeling as they were afraid customers would eat too much. \n3. Table and chairs are as much standard as you might see at some affordable restaurants in a China Town. \n4. Restroom looks dirty, not well maintenance.\n  \nI admit they have good salads, veggie tempura, stirred fried crab. Beside that, I did not like anything else though my husband said some was ok, but nothing special.\nBefore the entrance of Todai, you go through a hallway with nice small restaurants on 2 sides. I did not try any of them (I wished I would), I recommend you stick right there. Don't go further."
        }, 
        {
            "index": 315, 
            "rating": 5, 
            "review": "If you love sushi, this simply is a must-go. Todai has a huge variety of sashimi, rolls, seafood, dessert, udon, and so much more! The food was delicious and my plates were cleared very quickly. If I lived in Las Vegas, I would no doubt dine here constantly!"
        }, 
        {
            "index": 316, 
            "rating": 4, 
            "review": "Sushi buffet!  Huge selection of rolls and raw fish.  You will also find a great selection of cook food.  Fast Drink service.  Great value for sushi lovers."
        }, 
        {
            "index": 317, 
            "rating": 2, 
            "review": "Avg food with bad, really bad service...\n\nI wasn't impressed during lunch hour due to lack of selection here.\nHowever, I gave it another shot due to its oyster bar during weekday dinner.\n\nWell... food was far better than lunch.\nOyster was good, but doesn't come to the station that often... \nNot that  much sashimi selection(salmon/tilapia only)\nSushi is somewhat average...\nUdon was ok...\nTeppanyaki- Shrimp is so so whereas beef quality was quite low.\n\nYeah, the problem happened when I used $25 restaurant.com voucher.\nMy 7 mth son started crying and he and my wife went outside immediately in order not to disturb other customers. \nI asked bill with voucher and waited for 20 minutes, yes, 20 minutes!!!\nFinally, my server came to me and said there was voucher validation problem... Ok, I understand, but can you please update me earlier rather than leaving me unattended for 20 minutes? what an excellent customer service! \nShe told me the bill reflects discount even though they couldn't validate it... haha what a joke...\nI gave her 15% tip, but really tempted to leave without tip.\n\nIt would be my last visit to Todai for sure.\nThere are simply too many other alternatives."
        }, 
        {
            "index": 318, 
            "rating": 4, 
            "review": "One thing I really love about Todai is the fried rice. It's not the fried rice you can buy down the street from your house unless you live near a hibachi joint. That's right, they make hibachi quality fried rice. A lot of their entree was decent but that is to be expected in Las Vegas. Dessert on the other hand was just eh.. I'll pass."
        }, 
        {
            "index": 319, 
            "rating": 2, 
            "review": "Wow.....I am taken aback by the number of high ratings for this restaurant as compared to my experience.   And here's MY bottom line up front:  if you are going here because you are a sushi lover, SAVE YOUR MONEY.  For the price of this dinner ($31.95/person for dinner Sun - Thurs) you can go to a very good sushi house and get your fill of really good sushi.  Folks, this is an all you can eat Chinese buffet with more sushi type offerings than most, but it is NOT great sushi at all.  I am giving this a \"2\" rating because it wasn't bad, it just wasn't good, nor do I think it lived up to its billing. \n\nAtmosphere:  Based the on line photos on on their website we assumed that this would be a somewhat upscale place.  We assumed wrong.  It was ..... an all you can eat Chinese buffet,complete with food on the floor, paper table covers, and located at the entrance, but inside the shops on the Miracle Mile at Planet Hollywood.  Dress ranged from cutoffs, muscle shirts, and flip flops to khakis with button down shirts and dresses.\n\nFood Presentation:  We arrived at 8:00 PM, and although the buffet continues to seat people until 9:30, we were surprised to see so many empty or close to empty trays on the buffet, and many weren't restocked while we were there so it is hard to say how good the buffet might have been if it was fully stocked.  \n\nSushi:  The sushi was okay, but was in no way close to really good sushi.  The pieces were small which was okay since you can have as many as you want.  They were not well put together, and most fell apart when you picked them up from the buffet line.  If they didn't fall apart there, they certainly did when you tried to eat them.  Several pieces were tasty, but most were very bland with little flavor.  The texture ranged from marginally chewy to almost grainy.  The salmon was by far the best piece we had.  \n\nRolls:  There were lots of different rolls available, but the labeling of the offerings was all messed up.  California rolls were marked as spicy tuna, and something labeled \"Shrimp Tempura Roll\" was ..... well I don't know what it was, but it was NOT shrimp tempura.\n\nSeafood:  For a place that bills itself as a \"Sushi and Seafood Buffet\" there wasn't much seafood beyond the sushi.  They advertise dungeness crab as a major offering, but the crab legs were only served cold, not hot.  And they were so salty that a salty food lover with us said that it was TOO salty even for her, so I didn't even try it.\n\nSalads:  The salads presented were also \"okay.\"  Frankly I wasn't very interested in eating too much salad in an all you can eat sushi and seafood buffet,.\n\nHot Food:  The hot food was \"okay\" as well, but again, it was NOT great.  There was a station presenting hand carved prime rib,  pork roast, and grilled sausage, except that there was no one manning it, so you couldn't have any.  I waited about five minutes at the station, making eye contact and waving to every employee running behind the station before I finally got someone to come over.  And it looked like these offerings had been under heat lamps for many hours and perhaps they were because the meat was very dried out.  There were several  trays of baked fish and other hot entrees that had only a very small amount of leftover food on them, and what was left there was dried out and very unappealing.  Perhaps they weren't going to refill these until someone took the last remnants, but looking at the dried up remnants on the corner of a large tray made me decide it wasn't worth trying.\n\nDessert:  This was both a high and low point.  There were a number of good offerings in the dessert line, the chocolate covered strawberries were really good.  there were also a couple cookies that were very tasty.  The low point here is that they offer a \"build your own crepe\" station which looked great.....except that they didn't have anyone manning it to make crepes, rendering it useless."
        }, 
        {
            "index": 320, 
            "rating": 1, 
            "review": "This was by far the WORST and I mean WORST dining experience of my life!!!  My wife and I wanted to try it last year during our vacation to Vegas, but ended up going this time around instead.  It was a complete waste of time and money.  I can't say enough bad things about this place.  My wife and I may be a little spoiled when it comes to food, so maybe that's part of the reason we hated this.  \n\nThe sushi was luke warm, much of it was mislabeled and just overall terrible.  My wife had some kind of \"tuna\" that she ended up spitting out because it was so bad.  I had a bunch of crab legs and those were simply \"ok.\"  I also tried a couple of the warm dishes such as the teriyaki chicken, which tasted like it came from Panda Express.  I'm not a huge fish person, but I've grown to like some rolls and sashimi.  This was worse than store bought boxed sushi.  With that said, I went for their \"prime beef,\" thinking there may be a glimmer of hope, but to no avail.  It was gritty and bland.  The potatoes were out of a box.  My wife had a $12.00 glass of plum wine that she couldn't even finish.  You definitely want to avoid a place where you can't even get a decent glass of wine.\n\nThe other patrons were rude and the lines for a crappy crab roll were insane.  People elbowing each other and physically pushing each other for some horrible seafood cevechi.\n\nUltimately, I felt like Clark Griswald in Vegas Vacation when Cousin Eddie takes him to that buffet place and loads a potato sack with rolls.  \"I'll have some of the yellow and don't get cheap on me,\" completely applies to this place.  There are plenty of other options in Vegas to waste $35 per person on food...\n\nBy the time we finished forcing our food down my wife and I both feared for food poisoning.  We were literally sick to our stomachs and grossed out by this dining experience.  Luckily we didn't get sick.  In the end, I probably should have complained to management, but that's not really my style.  I'm sure they wouldn't have done much.\n\nAnyway, AVOID THIS PLACE AT ALL COSTS!!"
        }, 
        {
            "index": 321, 
            "rating": 4, 
            "review": "Excellent sushi buffet. Many great choices of sushi and sashimi as well as other hot food items. A little pricey at about $40 a person, but well worth it."
        }, 
        {
            "index": 322, 
            "rating": 3, 
            "review": "The one thing this place has going is it's selection.  Theres so much to choose from.\nWe arrived just at the start time of dinner.   Everything was well stocked and seemingly fresh.   \nUpon tasting some of the items. their taste lead me to believe freshness was not quite what it seemed.   \nFor the price, I think I'd rather hit a real sushi restaurant and pay a bit more."
        }, 
        {
            "index": 323, 
            "rating": 5, 
            "review": "Super fresh and a super price for a quick un-fussy sushi dinner and much more.  The manager asked us to move... after just sitting us down and bought us drinks.....great service!  Rare for \"get em in and get em out\" Las vegas."
        }, 
        {
            "index": 324, 
            "rating": 4, 
            "review": "Best seafood buffet I have been to, yet!! I'm definitely going back when I go back to Vegas. The food was amazing!!"
        }, 
        {
            "index": 325, 
            "rating": 4, 
            "review": "So there was multiple conversions posted about AYCE crab legs. I had visitors in town who wanted AYCE crab legs and after finding out my to go spot for crab legs GVR feast buffet no longer served crab legs, and from the girl on the phone no stations buffet does any more, I felt disbelieving. Anyways we was already at Planet Hollywood for a show and stopped by after.\n\nFirst plate snow crabs yes. It was big and good but I don't like cold crab legs I need them hot with all the good seasoning like how Gvr  did them. \n\n2nd and 3rd plate shoyu ahi poke, loaded with sushi, sashimi, and oysters. There was snapper and there was ahi they looked similar to the average eye then that news article posting a while back came up.  If they switched the ahi and snapper ill just eat my moneys worth in oysters.\n\nThe next few plates come and went in a blur, I was already full and only took tiny plates to pace myself just to eat things I really real wanted. There was shrimp tempura, asparagus wrapped in bacon, baked salmon, stuffed mushrooms.\n\nThere was turkey and prime rib but all dry. Some soups and salads and other hot food but not even close to was the website listed. Wanted some blue crab\n\nGood choice in desserts. creme brulee, some fruit tarts and cakes, creeps and green tea ice cream but again not as.much as what the website listed.\n\nThey charge extra for drinks.\n\nMaybe they have a better selection on weekdays. \n\nNice and clean. Like the giant octopus above the fruits area.\n\nDon't like having to grab your own napkin from these dispensers at the buffet area. We had to keep going back up and piles of clean and used napkins took table real estate from food.\n\nSolid 3.5 rating. Because could've gotten almost the same choices at Buffet @Asia which is more than half the price"
        }
    ]
}