{
    "category": "Las-Vegas", 
    "entity": "Sushi-21", 
    "avg_rating_stars": 4.009541984732825, 
    "review_count": 524, 
    "reviews": [
        {
            "index": 1, 
            "rating": 5, 
            "review": "I've been back to Sushi 21 twice now in 3 days and both times the service has been excellent. Kudos to Johnny and his preparation and presentation of all menu items across the board. Highly recommended to anyone that enjoys a relaxed atmosphere and great service combined with a large selection of menu items that can be enjoyed at your leisure. Pat was our waiter the first time and Jaden took care of us the second time around and both were attentive and expedient in his delivery of everything that we ordered. We will return EVERY time we're in Las Vegas."
        }, 
        {
            "index": 2, 
            "rating": 4, 
            "review": "I tripped onto this place while running an errand on a recent visit to Vegas. Lucky me! It's tucked in the back corner of a shopping center, behind Walgreens, with a cozy sushi bar. I was skeptical at first, when a lot of the baked rolls had cream cheese in them, but I asked the sushi chef what he recommended for something spicy and cooked, and we tried their Heart Attack Roll.... we watched him make it, and I was still doubtful, but once I had it, it was soooo good, with a spicy kick from their jalapeno. Their unagi was delicious, bulgogi lunch combo was great too, and it was really inexpensive, compared to what we'd been used to on the Vegas strip. They're open until 1am, and I kept that in mind in case I wanted to make another trip here before my trip back home.  Definitely will make it a point to stop here to grab a bite again. I only gave it 4 stars because I'm used to a more diverse menu of sushi rolls without cream cheese, but I'm inclined to try it again next time."
        }, 
        {
            "index": 3, 
            "rating": 5, 
            "review": "Hot Kenny! This sushi chef was the man! He made me try some super spicy stuff and had my entire group laughing the whole time. I'll definitely bring my service here next time !"
        }, 
        {
            "index": 4, 
            "rating": 5, 
            "review": "I love their sushi especially sashimi. It comes with fresh ingredients and they have a big variety to chose"
        }, 
        {
            "index": 5, 
            "rating": 3, 
            "review": "This place is well decorated and the staff there are so nice and helpful. Foodwise, it is okay. Its definitely an American sushi place and for what it is it does it well."
        }, 
        {
            "index": 6, 
            "rating": 5, 
            "review": "Great atmosphere: clean, doesn't smell like fish (a very good sign), bathrooms are clean as well. We got all you can eat and they didn't skimp on the fish at all! Very good customer service. They were so sweet and offered to cancel some of the rolls we had on the way because we we so full! I highly recommend the cucumber wrapped rolls and the samurai roll! Good variety! Would recommend to friends!"
        }, 
        {
            "index": 7, 
            "rating": 5, 
            "review": "This is by far my favorite sushi place in Vegas! It's good and away from all the commotion of the strip"
        }, 
        {
            "index": 8, 
            "rating": 1, 
            "review": "Waiter did not understand seating. Our party came in first and they let another group sit before we did even though they did not have a reservation. They had tables and bar seats open for us but made it complicated. When we confronted them about why they let the other people sit first they just said they only had on table for us even though they clearly had more. Left disappointed"
        }, 
        {
            "index": 9, 
            "rating": 2, 
            "review": "we ordered a la carte, candy cane roll and tempura green tea ice cream for 23. july 4th.\n\n- MEDIOCRE sushi at best. I've never seen such a wimpy sushi roll that cost 13 in my life. The soft-shell crab that they use are the legs! not even the body. it was far from crunchy. The yellowtail was so cowardly, it made the sushi look worse. it looked like a roll from a GROCERY STORE. horrible presentation. \n- Tempura ice cream was good. They put sprinkles on it. It reminded me of a birthday cake. haha\n- slow service. Never asked for a refill once. Poor explanation of sushi and ice cream. Bad english. After eating at grimaldi's, then coming here, it puts this service to shame. \n- I'd rather lose $25 bucks at the casino than eat here again."
        }, 
        {
            "index": 10, 
            "rating": 4, 
            "review": "I have been coming here for years with my parents (my dad actually started coming here in 1998). As a youngin I always got the bento plates which are all amazing, great portions and flavor. As an adult I like to switch it up and either get lomein or AYCE, fish is always up if not higher than I expect it to be. The service is amazing and everyone is always on top of it (even the owner who is usually there). The chefs are a lot of fun with tons of energy and occasionally will have a on the house sake bomb! Definitely must check out especially if you're a local, hidden gem!"
        }, 
        {
            "index": 11, 
            "rating": 5, 
            "review": "Amazing service, yummy sushi, and a fun atmosphere. It's so refreshing to see a sushi place of this calibre in Vegas! Their menu has such a great selection to choose from,  even for the pickiest of eaters. I'll definitely be back!"
        }, 
        {
            "index": 12, 
            "rating": 5, 
            "review": "Friend took me for sushi on our lunch break. First time for me having sushi. Omg so fresh, service amazing, crazy choices.. I'm addicted... Will most definitely be back!!!"
        }, 
        {
            "index": 13, 
            "rating": 5, 
            "review": "This place is great for dinner!  Great appetizers, favorite was baked green mussels!  Great suchi, m great Something Wrong 69 rolls!!! For desert you gotta get mochi, any flavor will do it! Annabel is the best waiter, great service, personal, and really knows the dishes well, I wouldn't have gone for the All You Can Eat Sushi if it wasn't for her. Best part is its convenient  for anyone on the strip!"
        }, 
        {
            "index": 14, 
            "rating": 5, 
            "review": "Forget the long line at goymon. Eat here!!!!\nGreat customer service. Great food!!! GREAT EVERYTHING!"
        }, 
        {
            "index": 15, 
            "rating": 3, 
            "review": "I went here with my dad for dinner.  The prices are great for the buffet.  The \"all you can eat\" is a LOT of food.  I wasn't impressed with all of the rolls but a few were good.  The service was great.  The people were nice and friendly.  Fun atmosphere.  Great Nigori.  I did not have any sashimi.  We only ate rolls.  This is not my favorite sushi place but if you want to eat a good amount of decent sushi rolls in a fun environment, I would recommend.  If you are a sushi snob, I don't think this place is for you."
        }, 
        {
            "index": 16, 
            "rating": 5, 
            "review": "Absolutely awesome sushi place. Pretty quiet atmosphere and the owner is a nice lady. She makes sure that your happy with the sushi and always talks you up for a bit. The sushi is made great! They have a perfect versions of sushi and they all have a unique taste. It's my favorite sushi place in town."
        }, 
        {
            "index": 17, 
            "rating": 4, 
            "review": "The quality of the fish and size of the menu for AYCE was great. Service was quick and friendly as well. I will definitely come back next time I'm here."
        }, 
        {
            "index": 18, 
            "rating": 2, 
            "review": "My friends and I are here in Vegas working from out of town and were looking for a sushi dinner. We went on Yelp and found this place. The reviews seemed great so we tried it out. We sat down and ordered and the first thing I asked for was a side of yuzu sauce because I do not like/use soy sauce because of health reasons. They told me no that I couldn't have it because it's too expensive.  Too expensive I asked? Ok, so can you charge me for a side of it? They said no, but brought me a very small side of it, enough to dip three pieces of sushi in.  Not a normal amount like you would in a normal soy sauce dipping tray.  When I asked for more, they all of a sudden ran out.  We then ordered the yuzu yellowtail off the menu and lone behold more yuzu sauce appeared.  All of our sushi rolls came out, with the thinnest pieces of cut sushi I have personally ever had.  They were basically just rice rolls.  This is not what I call sushi. This restaurant should be called Rice Rolls 21 not Sushi 21. We should have just gone with our first Yelp review which was Sushi House Goyemon. They had awesome sushi and great service! Bummed we did not have a good experience."
        }, 
        {
            "index": 19, 
            "rating": 4, 
            "review": "I always wanted too try this Sushi 21 not only cause I LITERALLY pass it every time I go too the gym. Always looking too try something new.  I trust my fellow yelpers and my friend Shayda had only positive things too say about it. Cool. New tradition take my roommate out for his birthday some AYCE sushi. \n\nI never knew they had great HH prices half off rolls and all you can drink for $10 added charge only if you get the AYCE. Right off the bat talk about making great first impression with the specials. I like dam already have reason too come back again. \n\nTalk about small place not too many booths, the sushi bar has nice amount of seating (two nice widescreens that can watch sports; one got too be close too 50' right on the corner and another smaller widescreen slightly off the side) though, and of all things even have tiny koi pound (more like baby size ones or look like but YES actual fish in it) interesting. More in the back area they have a projection screen type playing music videos and feels little more like asian club cause can hear the music good in the restaurant. Lot of stuff going on comes too the decor for such small place. Honest I kind of fan breaks up the traditional sense of sushi restaurant. \n\nThe sushi ordered mostly nigiri that always given whenever I go AYCE style. I felt like ALL the fish I had was fresh, looked great, and tasted awesome. White Tuna, Hamachi, Albacore, Uni (not fresh; so took it for what is worth OK), scallops not what I expected or say am use too, Salmon, Cajon Albacore, and Unagi. My roommate birthday boy ordered two rolls tried both. Nothing wow factor so not remember what it was. I ordered spicy yellow tail hand roll. It was one of my favorite sushi the whole night. They don't really list hand roll on the menu more cut it up rolls. The sushi chef was great not problem at all. The only thing that feel like lack for five star is diversity comes too the menu. Unlike my only five star comes too sushi goyemon they offer more different cuts of fish, special menu with bunch of grill items, and diversity. \n\nThe service was fabulous! We were constantly being checked up on. Too drinks never even had chance too get half empty before asked if needed refill. The sushi chef was very friendly. Awesome! Nothing worst sitting at sushi bar the sushi chef stay all stuck up. Sushi 21 if want football (MNF style)  no worries about being packed getting your fill in. We sat front and center too the tv the whole game. Winnah! It always helps that not only is it so close too goyemon no worries about it being packed. But it always nice second option if line too long just being down the road. \n\nSushi 21 solid choice comes too AYCE sushi. I will be coming back again get some of that all you can drink in."
        }, 
        {
            "index": 20, 
            "rating": 5, 
            "review": "Goyemon is always so busy. When i starve myself so i can have AYCE in the evening I want to eat right away not an hour from the time i get to the establishment. \n\nWith that said Sushi 21 is pretty dang good. The eel was a little too soft for my liking, but everything else was spot on. The sushi chef was great. Even though the bar was full and he was in charge of the to-go orders our food was coming out faster then we can eat, and we eat fast. \n\nThe nigiri was fresh. The yellowtail came in big chunks. So yummy. The Salmon was real fresh too. \n\nThey have an extensive roll menu. LOVED the Jackpot. Nevada was good too. I even got the lobster roll. Its a California Roll with fried bits of lobster on top with eel sauce."
        }, 
        {
            "index": 21, 
            "rating": 5, 
            "review": "I love this place! Really good food, nice environment and really nice staff. They always kind and fast with our order. Overall a great place to eat!"
        }, 
        {
            "index": 22, 
            "rating": 2, 
            "review": "I want to start off by saying that this was my favorite sushi location up until last night. I just went a couple of weeks ago and had a great meal. I also told several friends to try this location. \n\nLast night my friend and I were downtown and we were craving the lobster roll. She called Sushi 21 and asked for the hours for all you can eat. The man who answered the phone said that the AYCE was until 2 and the restaurant was open until 3. We got there right before 2. When we came in we were told that we can only order takeout. My friend explained that she had called and was told the restaurant was open until 3. We were not told we could only order take out. The guy said we didn't call and that he's the only one who answered. Once she showed him the outgoing call in her phone, he changed his story. He didn't try to accommodate and wasn't polite about it at all. \n\nWe ended up going up the street to another sushi spot. Sushi 21 lost out on the $70 that we paid for sushi and tip at the other location. More so, I just don't like people who lie so I won't continue to tell other people about Sushi 21.  The food is great which is the only reason I gave two stars. Customer service deserves negative stars. \n\nUpdate: went back on 9/13 because I do like the food. My transaction was pending with my bank then disappeared. On 9/19, Sushi 21 charged me the actual $23 I approved plus an additional $23 duplicate transaction and both cleared the bank. That's one expensive all you can eat. I really wish people would learn how to do their jobs right."
        }, 
        {
            "index": 23, 
            "rating": 5, 
            "review": "Hands down one of my top two favorite sushi restaurants of all time! The service is always great, the AYCE is reasonably price and their rolls are DELICIOUS. They recently changed their menu as well so now they have some great appetizers that you can order when doing AYCE as well, so that's a plus (even though I end up stuffing myself on sushi anyway). My best friend and I are regulars here and we absolutely love it, I recommend it to any sushi fiends like myself."
        }, 
        {
            "index": 24, 
            "rating": 5, 
            "review": "The service was really great and the food was really good, especially the appetizers! \n\nI would definitely recommend the baked green mussels and shrimp tempura! \n\nDessert is also included and the options are delicious!"
        }, 
        {
            "index": 25, 
            "rating": 5, 
            "review": "Very good! Surprised by the quality as it is an all you can eat but it was wonderful!  The service was exceptional and the rolls came very fast! We are from Chicago, and I'm thrilled the quality is so great here!\n\nWell done!"
        }, 
        {
            "index": 26, 
            "rating": 4, 
            "review": "It was a nice venue to go where the locals hang out.  My friend comes here often for her brown rice avocado rolls.\n\nYum\n\nCan't do the sushi buffet...way too much food.\n\nI like the Korean Pop music videos"
        }, 
        {
            "index": 27, 
            "rating": 5, 
            "review": "This place was the most awesome surprise EVER!  It was SOOOO good. Usually when I hear \"all you can eat sushi\" I cringe. But my friend and I decided to try it anyway. And boy am I glad we did. I'm a couple thousand miles away from them now...darn it...and I still CRAVE their sushi!! \n\nBe sure you remember their \"ifs, ands or buts\" though. If you don't finish what you order, you will pay full price for it."
        }, 
        {
            "index": 28, 
            "rating": 5, 
            "review": "All you can eat dinner is worth the price. $26.95 dinner. Delicious flavors. Very different creations. And the appetizers and desert are included. Big menu. A lot to choose from."
        }, 
        {
            "index": 29, 
            "rating": 5, 
            "review": "I've always seen this place when I did work out at the 24hr Fitness. Didn't think to go in but my sister was meeting her friends there so I tagged along. Since then, been there 3x and I really like the food. More sashimi options than other AYCE sushi places.\n\nI'm also not a lover of mussels but dude, they are yummy!! I always order a few at a time. \n\nFish is fresh and the employees are very friendly. \n\nI'm definitely glad I tagged along as this is now my new favorite place for AYCE."
        }, 
        {
            "index": 30, 
            "rating": 5, 
            "review": "Been coming here and only here for years! Best part is Kenny the main chef making a baked lobster roll. Also the fact that we can come in after work and they stay open until 2am! Food is generally speaking out in a jiffy as well!"
        }, 
        {
            "index": 31, 
            "rating": 2, 
            "review": "The only reason I gave it two stars is because the sushi itself is actually good. So suggesting you do a Togo order instead of sitting. I'm generally a good tipper. My parents had money so they taught me when you want to eat out make sure you're ready to spend money. I've actually tipped people 50,60 even 75% of my check before. I work in restaurant. I know it can be a struggle sometimes. But with that being said. That means I also know what bad to excellent service is. This server was the worst. She seemed like she hated her life. Then towards the end I asked for the check and a Togo box. She says ok no problem , then proceeds to the food runner and he comes and tells us it's a charge to take the food Togo. That's not my issue. My issue is she didn't tell us and then she had him give us the bill. Had him pick up the bill. And drop my change off. I was highly offended that as my server she couldn't communicate with us. I felt she was scared of me for some reason and I was nice the whole time. But that's the 3rd time in spring valley they make me feel so unwelcomed. (Server / was either Hispanic or white with chubbie face and dark hair. Keep an eye out for her"
        }, 
        {
            "index": 32, 
            "rating": 3, 
            "review": "I dont really think the All you can eat is a great value unless your really hungry. I was medium hungry and Goyemon was slammed. I hate lines and being kind of a snot I refuse to wait very long. SO I hit this place down the street. I ordered three dishes that were all spicy, wasnt really impressed. It was okay but didnt taste like Tower or Goyemon to be honest and was less than impressed with the overall value. I will say the Calamari was really good but that was the only thing to make an impression except the really attractive and very nice waitress LOL. So I will hit it in a pinch but not overly impressed."
        }, 
        {
            "index": 33, 
            "rating": 5, 
            "review": "Nice environment. Got K Pop playing in the background! Sports playing on another tv, and Shark Tank on another tv!\nThe sushi tastes fresh, and they are very generous with their portions. We are very happy that Goyemon had an hour and a half wait!"
        }, 
        {
            "index": 34, 
            "rating": 5, 
            "review": "Favorite sushi spot in Vegas. They're super fast! I'm here every week. Sushi always tastes fresh & the service is great! ALSO, I never have to wait for a table."
        }, 
        {
            "index": 35, 
            "rating": 2, 
            "review": "There are so many better options close by for ayce sushi. The quality here was at best average, as was the service. The entire time we felt as though we were inconveniencing them by being there. It was several hrs before they closed and I don't believe we were being rude. \nWith Jjanga, Umiya, and Goyaman up the street in either direction you can easily pass this place up and be happy with your decision. These guys simply can't compete."
        }, 
        {
            "index": 36, 
            "rating": 2, 
            "review": "Disappointing experience, would not recommend.  Like others, ended up here after Goyemon could not accomodate.  \n\nCons:\nDisgustingly over-sauced rolls\nBS rules around AYCE - 1 hour limit, no sashimi, etc.\nPiss-poor sushi rice\n\nPros:\nFish quality was actually okay\nYung, our server, was very nice\nAYCE mochi!\n\nSushi 21 is the antithesis of what good sushi is all about - fresh, balanced, natural deliciousness.  The rolls were so poorly made, in a clear attempt to fill you up on bad sushi rice and rich sauces.  A travesty...."
        }, 
        {
            "index": 37, 
            "rating": 1, 
            "review": "Came in at 11:30pm and now it is 1:02am and still haven't received the 3rd roll. The glasses are very dirty . On top of that it took her 13 mins to bring wasabi. The waitresses are very nonchalant about the horrible service. Their statement was \"there is only one cheff\"!!. That's not my problem!! I will NEVER EVER COME BACK!!! There are only 12 customers in the whole place!!!"
        }, 
        {
            "index": 38, 
            "rating": 5, 
            "review": "It's my sixth year that I'm coming here. \nIt's the only sushi I'll recommend . The service is great . The kitchen clean and fast. And the sushi is amazing.  Seriously.  Love it.\nThe sushi chefs are great specially Sol that make us feel so welcome.  \nYou can find me there specially after midnight ...."
        }, 
        {
            "index": 39, 
            "rating": 5, 
            "review": "This was my first time eating here and I was very impressed. Johnny Roll is always one of my favorites, but this was by far the best I've ever had. Will definitely come back."
        }, 
        {
            "index": 40, 
            "rating": 1, 
            "review": "The worst service I have had. On Saturday night there were only 2 tables occupied so they were not busy at all and now I see why. Did not even offer water at the time we placed the order. The server only brought after we asked for it. Did not bring 2 items ordered. The rolls were just ok - there are better places out there. Will not come again and will not suggest to any of my friends."
        }, 
        {
            "index": 41, 
            "rating": 4, 
            "review": "The sushi was delicious but I thought the sauce was way to creamy but yummy. Ordered the all you can eat so we got to try several different ones. Staff was nice too."
        }, 
        {
            "index": 42, 
            "rating": 5, 
            "review": "I would 100% recommend this to any sushi lover \nThe service was amazing \nThe sushi was awesome.    \nAnd to finish it off \nThe dessert was really good as well \nMy favorite roll of the night was the Vegas lasagna roll \n\nI will be back  thank you sushi 21"
        }, 
        {
            "index": 43, 
            "rating": 4, 
            "review": "We ended up here because another down AYCE Sushi place down the street was 90 minute wait. And I am glad we did!\n\nThe service was awesome! And the sushi was great. We found the \"specialty\" rolls the best. LOVED the Sexy Girl! But be warned...she is spicy. Plain salmon roll was really fresh as well. Lots of great choices!\n\nAll garnished with a GAINT projection of Japanese girl band videos playing on the wall. What a fantastic spectacle that was! I had NO IDEA how much I would love this!\n\nAnd the best part, even though the price is only $26.99/ea for AYCA, you get another 10% off with a Yelp check in! Sweeeet!\n\nWere had a great time, and no wait!"
        }, 
        {
            "index": 44, 
            "rating": 3, 
            "review": "First off, I feel sorry for any sushi place that I visit when I was craving Goyemon but it was a 45 min wait and we had to catch a movie after grub. Sushi 21 was just down Decatur and had a 4 star rating on here so we decided to try it.\n\nThis place is pretty good. The appetizers and rolls with AYCE are amongst the better places in town. The server we had was back very frequently to check on us and the sushi chefs were engaging. One of them even made me a half roll at the end of our meal even though they don't usually allow it when doing AYCE. \n\nThe only complaint that I had is when I ordered my first round of yellowtail, super white tuna, tuna, salmon, and unagi. It came out and looked very fresh but it smelled as if it were treated with something to preserve the fish. There was a slight taste of vinegar or something as well. I couldn't really place it. But the cuts were very generous and once past the \"treated smell / taste\" it had a good taste. I base my sushi experience pretty solely on the freshness / taste of the nigiri / sashimi so they're gonna take a hit on this one.\n\nOverall, a nice substitute for my fave sushi place in town when I was on a tight time schedule. Not a place I'd visit again unless the same circumstances arise with better places close by."
        }, 
        {
            "index": 45, 
            "rating": 5, 
            "review": "Excellent customer service with my server Betty, the sushi rolls are good size  and best flavors.."
        }, 
        {
            "index": 46, 
            "rating": 3, 
            "review": "Sushi was fresh, rice was a bit heavy and for the garlic tuna and Cajun tuna the rice fell apart due to the sauces. I got the AYCE buffet and the pieces were tasty but on the smaller side. Overall, value is there. Would I go back for the life changing omakase? Probably not. There's much better sushi to be had."
        }, 
        {
            "index": 47, 
            "rating": 5, 
            "review": "This is my fav!!! Sushi spot in Vegas!!! There open late! It's al was so darn good!!! And I love the videos!!"
        }, 
        {
            "index": 48, 
            "rating": 5, 
            "review": "This place has great sushi and a good amount of portions! They do not skimp out on quality and SIZE, most sushi places I've been too either had some nasty wasabi or some small portions! Found my new spot!"
        }, 
        {
            "index": 49, 
            "rating": 5, 
            "review": "Nice place and delicious happy Birthday Bryan Bday Dinner And great staff Thanks Arlyn"
        }, 
        {
            "index": 50, 
            "rating": 2, 
            "review": "Came here simply because we were in a hurry to watch a show and the wait for Goyeman was too long. Turned out to be a mistake since Goyeman called us with our table ready the moment we sat down here....but I digress.\n\nThe service is literally the slowest....and I mean SLOWEST....of all time. Yes the waitress was nice, but she barely understood English and forgot half of our order every single time we asked for something. The rolls were not rolled firmly, as one can see by how the roll breaks apart by picking it up with chopsticks. Finally, we ordered sashimi which didn't come until an hour later...to top that off, the tuna was a strange off color. \n\nIf you do come here, however, they have drink specials and the sauces as well as the baked rolls are not too terrible taste wise if you can get over the fact that you might need a spoon to pick it up."
        }, 
        {
            "index": 51, 
            "rating": 2, 
            "review": "Was not impressed. I had higher hopes given their great ratings. The fish wasn't really fresh, even for the non-AYCE items. The restaurant was empty (on a Friday night) and we were seated right in front of the sushi bar. I felt like I was on watch the entire time. \n\nMenu items are priced to make AYCE a better deal. The sushi had more rice than fish. They don't have sashimi in their buffet menu and you're expected to eat all your rice. Many of the rolls were fried and/or drenched in sauce, disguising their low quality fish. Presentation was lacking. My maki rolls basically looked like kimbap with fish in it. My server wasn't really knowledgeable of the items and didn't know the answers to my questions. Not a big deal, assuming that he's new. Won't be coming back, given that there's plenty of other sushi restaurants in Vegas."
        }, 
        {
            "index": 52, 
            "rating": 5, 
            "review": "Best sushi we've had in a while and the AYCE makes it even better. Popcorn lobster, shrimp tempura, Vegas lasagna were all amazing. The food is fresh and delicious, we'll definitely be coming back. \n\nThe Japanese pop videos on the wall were a bonus"
        }, 
        {
            "index": 53, 
            "rating": 5, 
            "review": "Visiting from Bay Area. I highly recommend all you can eat. Fish are fresh, servers are very friendly."
        }, 
        {
            "index": 54, 
            "rating": 5, 
            "review": "It's been a year since i had sushi and I came to this place with my father and best friend for dinner and ever since I have been hooked. Now we try to come 1/2 times Month. I love the deep fried las Vegas roll and the calamari rings. The staff is always so friendly/welcoming as well."
        }, 
        {
            "index": 55, 
            "rating": 4, 
            "review": "The popcorn lobster roll did not disappoint. And it's a huge portion. It's a meal in and of itself! The yellowtail was very fresh. And they divide up the menu by fish - salmon lovers, tuna lovers, etc. Nice touch."
        }, 
        {
            "index": 56, 
            "rating": 3, 
            "review": "Met the lady and some friends here for sushi 5 plus 1 high chair in total. It was slow when I came in and they had already been sat service was prompt and the nigiri came out quickly as is to be expected of simple dishes. Rolls came out fast and were good the SWAT was my favorite since I'm a shrimp lover. Our friends grabbed single menu items and we both did AYCE which was alright up until our friends had to leave. The server brought everyone's check even though we weren't finished eating which wasn't a big deal at all until our server started not coming to our table. We made eye contact with her multiple times and it still took her about 5 minutes to come by and check on us. She cleared our table as well without asking if we had wanted anything else (hadn't even ordered our last rolls or dessert yet). She ended up coming back after seating a table behind us at which point we were 1 of four tables with two servers in the restaurant. When she asked if we wanted dessert we were relieved and put in our final order. The deep fried Oreo was amazing as was the mango mochi really all the dessert was good (we got 2 of each). \nAll in all good service at first that had a sheer cliff drop off after our friends. Sushi came out quickly but the nigiri was covered in some type of brown vinegar stuff that made it rather \"eh\". Rolls and dessert were great. More attentive service throughout the whole experience would've been nice instead of being placed into the \"I'm getting auto gratuity I don't need good service\" category. 3 star nigiri, 5 star rolls and dessert, 3 star service."
        }, 
        {
            "index": 57, 
            "rating": 5, 
            "review": "This place was great! Would definitely come again!\n\nWe ordered mushroom cap, wonton soup, AJ tuna sashimi, Cajun albacore Sashimi, and the Sashimi Chef choice for the appetizers!\nWe liked everything but the wonton soup.\n\nWe also ordered a lot of nigiri. They were all excellent but the Cajun flavored nigiri was just slightly more spicier than I expected. The Tuna Naruto and Johnny rolls were also good!\nWe did not like the chicken tempura roll."
        }, 
        {
            "index": 58, 
            "rating": 5, 
            "review": "I came here with my gf and 6 other coworkers and we each ordered \"all you can eat\" for $21.95-dinner. For the proportions per roll, this is very well priced. Quick and great service. Great food. Great atmosphere, I would recommend this place to anybody. \n\nNot even to mention, this just became my girlfriend's favorite sushi restaurant! \n\n5 stars."
        }, 
        {
            "index": 59, 
            "rating": 4, 
            "review": "Stumbled upon this place while driving home from work with an empty stomach. The boyfriend & I couldn't decide on where to eat and were on our way to Denny's as a last resort... but decided to try Sushi 21 on a whim. So glad we did!\n\nIt was 11:30pm on a Tuesday night and we were the only customers in there. Nothing too fancy inside. We decided to try our usual favorite, Cajun Albacore sashimi and a couple of rolls on the \"50% Off\" list - SWAT, Angela's & Heart Attack. Being half off, I expected them to be smaller rolls and even told our server that's what we'd \"start off with,\" but she assured us 3 would fill us up. She was right. Loved all the rolls, to my surprise. Especially Angela's. =)\n\nGlad I found this place. Now I know where to get my late night sushi fix after work at great prices - on nights where I'm not hungry enough for AYCE but don't want to spend $15 on just one roll."
        }, 
        {
            "index": 60, 
            "rating": 5, 
            "review": "The all you can eat special is good and def worth it. We were a party of 3. We ordered a bunch of everything. There were so many options and we were too full to try everything. Every time we are in Vegas we go here. Yums!"
        }, 
        {
            "index": 61, 
            "rating": 3, 
            "review": "AYCE Sushi for $26.99\n\nSeems reasonable. I came in with a few of my Vegas resident friends for dinner before the night got started. It's just a few miles from the strip on Tropicana. For AYCE, you can pretty much order off the entire menu. Their special rolls were decent, nothing spectacular, still good. I had the salmon and white tuna sushi. It wasn't as fresh as I'd like it to be. Not that it wasn't fresh though. I just prefer it to be slightly colder when I bite into my sushi's. The ahi poke salad appetizer was good. Had a bit of a kick to it. People that enjoy spicy food may like that.\n\nService was decent. Although, our friends told us that the serve indicated we would receive a sake shot with ordering AYCE after 8pm. Well, we did not receive it. When we had asked the server, she said because it was busy they had to move the time to 9pm. Really? With at least 5 tables still empty and still plenty of chairs available for the bar area, that was busy? I don't think a small order of sake would make any difference in how busy a restaurant is. Because of that, they weren't a favorite in my opinion. We asked for separate checks, 3 bills. The bill for 2 people with gratuity included came out to be $72! They added $11 in gratuity. There was only 5 people dining. I always thought gratuity gets added on for a party of 6 or more, something 8 or more. I definitely wasn't pleased about it.\n\nPaid my dues and left. I don't think I'll be making a stop here for sushi if I'm ever in the area."
        }, 
        {
            "index": 62, 
            "rating": 3, 
            "review": "Good waitstaff and fast service but the sushi doesn't quite taste right.  I've eaten here a few times for the convenience and never got sick so I don't think it's a freshness issue and instead is just really cheap quality.  I'll continue to go back when I crave sushi but Goyemon has a wait."
        }, 
        {
            "index": 63, 
            "rating": 4, 
            "review": "Service is better during the day but id your looking for a late night AYCE this is ur place. Laat call 2:15"
        }, 
        {
            "index": 64, 
            "rating": 3, 
            "review": "Let me start off by saying that there are a lot of sushi joints in town to visit -- this one just happens to be incredibly convenient and maybe a two minute drive from my apartment so I frequent it purely based on laziness. \n\nBefore going vegetarian and even after I'd rate this place based on service - cleanliness and decor as your run of the mill sushi joint. It's not anything to run home to mom about but nothing terrifyingly awful that I'd tell you to stay away. \n\nIt's just kind of there if you're hungry and it's open and available. \n\n\nAlthough -- the way they make the cucumber salad I must say is just very lazy. It's a pickled cucumber as opposed to the traditionally sliced and cut with dressing cucumber-- mucho disappoint."
        }, 
        {
            "index": 65, 
            "rating": 2, 
            "review": "We were looking for someplace fast and found Sushi 21.\n\nThe selection on the AYCE menu was huge, so we gave it a try.  Guess we should have waited for some of the other places to open.  \n\nNot \"bad\" sushi, just not on par with other places i've eaten sushi lately.  We'll be trying something else next time."
        }, 
        {
            "index": 66, 
            "rating": 5, 
            "review": "We picked Sushi 21 at random to have dinner! I was very impressed with the service and the food..you can't go wrong with the all you can eat/drink deal!"
        }, 
        {
            "index": 67, 
            "rating": 1, 
            "review": "I'll begin with saying my complaint has nothing to do with the prepared food. I met my wife here for lunch on the 6th. The part I cannot get over is when I watched the waitress sneeze all over a menu. She then proceeded to put the menu into the stand without cleaning it. After that, she wiped her nose on the back of her hand three different times without washing her hands. I watched her do that and then pick up my food from the sushi chef. In all of my life I have not seen this before. This is why people get sick. I recommend you eat somewhere else."
        }, 
        {
            "index": 68, 
            "rating": 5, 
            "review": "Excellent and delicious must have All You Can Eat It's The Best. I highly recommend it. Let aside the good customer service the food is delicious"
        }, 
        {
            "index": 69, 
            "rating": 5, 
            "review": "Good sushi in Vegas!!!!! Good service with a good price!!!!! You must try their baked lobster!!!!!"
        }, 
        {
            "index": 70, 
            "rating": 5, 
            "review": "I've come to this place about five times now and I'm never disappointed. I usually try something different each time but tonight's selection was by far my favorite: Megabox, Fire Fire, and spicy edamame, along with a beer. \n\nThe food is always fresh and prompt. We've never had to wait too long to receive our food. The staff is always very friendly and accommodating as well. My girlfriend and I love coming here for a quiet night out. My favorite memory at this place is the first time my girlfriend tried a sake bomb. They made an entire show of it haha, and got the whole bar involved. \"When I say sake, you say bomb!\" Such a fun crowd! I definitely recommend this place."
        }, 
        {
            "index": 71, 
            "rating": 2, 
            "review": "Horrible service !!!! Super slow and they never refill any water/hot tea without me asking. They don't offer half rolls. The two waitress are really rude and they kept reminding me that they charge for rice.... Omg I get it !"
        }, 
        {
            "index": 72, 
            "rating": 4, 
            "review": "Visited Sushi 21 on Christmas, quite busy but staffs were friendly and sushi are good. K-pop music video was good too. Portions are huge! Had hard time finishing it, order 1/2 order."
        }, 
        {
            "index": 73, 
            "rating": 2, 
            "review": "I asked for delivery. Ok, they did it with no problems and quick enough (30-40 mins). \nI chose just rolls. \nThe salmon one was pretty flat, no taste. Californias were ok-ish.\n\nWhen I gave money to the woman who delivered she took them and left without saying a goodbye or thank you\n\nMeh"
        }, 
        {
            "index": 74, 
            "rating": 5, 
            "review": "Love this place! Always make a stop here whenever I'm in town, great sushi, friendly service. No complaints"
        }, 
        {
            "index": 75, 
            "rating": 5, 
            "review": "Just tied Kiss of Fire and it was delicious  I will definitely be coming back to try their other specialty sushi. The prices are reasonable and staff are really friendly. I also liked the ambiance and music."
        }, 
        {
            "index": 76, 
            "rating": 5, 
            "review": "Generous portion! Friendly waiters :) it was close by to where we stayed. Can't wait to be back!"
        }, 
        {
            "index": 77, 
            "rating": 5, 
            "review": "We have been coming here for years. The service has always been horrible causing my past reviews to be at a max of 3 stars.\n\nWe where under the impression that they changed managed from the moment we sat down. This new team is AMAZING! Finally we can enjoy great food and good service.\n\nThe only thing that's changed is the mussels I couldn't get enough of them before this time around they didn't seem as good. They are using a new sauce the previous ones where better.\n\nSushi 21 has always been one of my favorite sushi spots but I would avoid it at all cost to avoid dealing with there service. We're happy to say we can be back to our regular visits."
        }, 
        {
            "index": 78, 
            "rating": 5, 
            "review": "Great sushi extremely fresh great service. Super awesome upbeat music great vibe. Great prices too! Would defiantly recommend it! 5 star!"
        }, 
        {
            "index": 79, 
            "rating": 2, 
            "review": "We decided to come here because another sushi restaurant down the street had a really long wait. There was no wait here which really should have been a warning sign. The food just wasn't that fresh, but maybe they just had an off night since they did seem to  have pretty good reviews in the past. But then again you have to show your review to the server if you want the 10% discount on your bill when checking in, so maybe people felt bad if they didn't give a good review. Who knows..."
        }, 
        {
            "index": 80, 
            "rating": 5, 
            "review": "Very good!! Service was fast and friendly... \nRolls were very well balanced. Great find!"
        }, 
        {
            "index": 81, 
            "rating": 5, 
            "review": "Had all u can eat sushi and it was truly all u can eat without feeling u up with rice like others do. What a great value, potions were normal sizes and rolls too. For 10$ more u can have all u can drink Japanese beer, that's crazy!!! Do u know what this beer costs? \nCustomer for life"
        }, 
        {
            "index": 82, 
            "rating": 3, 
            "review": "HATE  Nothing.\n\nDISLIKE  Kitchen closed before last call.\n\nLIKE  Friendly staff. Open late. Menu is organized into helpful sections. Location is close to home. Selection of rolls.\n\nLOVE  Nothing."
        }, 
        {
            "index": 83, 
            "rating": 5, 
            "review": "Been coming here for 8 years!!! Love the food and service!!! Bring my family every time they come to town guaranteed to be great."
        }, 
        {
            "index": 84, 
            "rating": 5, 
            "review": "We go here all the time....Best all you can eat sushi in town. We love the staff.  such awesome and good people.  We recommend this place to everyone we know"
        }, 
        {
            "index": 85, 
            "rating": 5, 
            "review": "Great customer service.! The food was amazing couldn't have been better. Not to pricey. Very clean and the workers were well groomed. Will return!"
        }, 
        {
            "index": 86, 
            "rating": 1, 
            "review": "I don't know how this place received such high rating. \nQuality of fish 1/5. Taste like frozen fish. Not fresh and fishy. \nService 3/5. Attentive nothing out of the norm. \nPrice 3/5. Typical AYCE price. \nWould NOT come back. Plenty of other better AYCE restaurants in Vegas. I believe they have a yelp checkin discount which probably gave them more stars. Wouldn't come here if you paid me. #justsaying."
        }, 
        {
            "index": 87, 
            "rating": 5, 
            "review": "Totally a great after hours spot! They're open until 2 am! Great service! Great beer! For sure try Sapporo!!!!!!!"
        }, 
        {
            "index": 88, 
            "rating": 5, 
            "review": "We love coming to sushi 21! They are awesome and accommodate exactly what you want. The staff is super kind and attentive. Thank you sushi 21!!"
        }, 
        {
            "index": 89, 
            "rating": 5, 
            "review": "came here and was happy to see smiles upon the faces of the servers right as I walked in. my whole meal i was talked to kindly and my glass never went empty, which im not used to in sushi joints because it seems once you're close to your time limit ending they seem to give you less and less attention to tell you to hit the road... overall a great place. pricing is average to other restaurants for sushi but the service can't be beat. will definitely be filling up my loyalty card for a free sushi meal here!"
        }, 
        {
            "index": 90, 
            "rating": 4, 
            "review": "I havent been here in a while...still the same great taste! Definitely try the popcorn lobster. One of my personal favorites! :)"
        }, 
        {
            "index": 91, 
            "rating": 5, 
            "review": "First time visiting here! Close to home so we decided to deviate from our usual sushi place. Absolutely loved it here! \n\nSushi and appetizers were fresh and delicious. Great variety of special rolls so it was easy to branch out and try new rolls that I normally wouldn't. Everything we tried today though, was spectacular! \n\nService was very quick and staff was nice and attentive. Made me feel very welcome and refilled our drinks and took our old plates before we could finish saying thanks! Very fast!\n\nAtmosphere in here was great too! Went during lunch so it was relatively quiet, though I'm sure they get very busy during dinner. There was a projection of k-pop music as we enjoyed our rolls. Fun music and inviting atmosphere.\n\n\nWe'll definitely come again! Great food, good prices for AYCE. If you're in the area, and you're hankering for some good sushi, come to Sushi 21!"
        }, 
        {
            "index": 92, 
            "rating": 5, 
            "review": "Great sushi, great service, great price!!! Got seated quickly and the food is amazing!! The biggest all you can eat menu I've ever seen!!"
        }, 
        {
            "index": 93, 
            "rating": 3, 
            "review": "A few hours of swimming at Temptations Pool Party at the Luxor, you work up an appetite. My boyfriend, his best friend, and I decided to check this place out after finding out the AYCE Chinese Buffet next door turned into a Dim Sum a la carte restaurant. The place was fairly cramped with the booths real close to your gut. It was almost like my man boobs were actually sitting on the table when we were done. We all decided to get the AYCE sushi dinner (1 hour time limit), which was fairly priced.\n\nThe service was fast and so was the sushi that came from the sushi bar for the first 15 rolls. Most of the flavors seemed to have originated from Korean style, Kim chee especially the ahi poke. 90% of the rolls that came to the table were drenched or overly sauced. When I go to a Japanese restaurant, I expect my sushi to come out fresh, with natural flavors. So all the sauces on these rolls today, is masking the low quality fish.\n\nThe last 5 orders depreciated the ratings of this place.  They should watch the quality of all their products, especially the \"mini beef platter\", the meat tasted past due. So guess who had the runs for the past day and a half? So I didn't know if the meat was actually meant to be on the fermented side, cause the whole Korean influence, or they were trying to sneak away with serving the meat til it was sold out so their food cost wouldn't be so high. There was a sushi roll that had corn and grilled onions on top of it, like who does that? With over powering, mayo based sauce drenching the rolls underneath, It would be awesome if all their rolls came with a description of what's inside or on top, My boyfriend is allergic to tomatoes, citrus, and onions. So then my ramen came out. I was thinking it would be a homemade ramen noodle, with a nice broth. Nope, top ramen, Kim chee flavored, with a sprig of green onion, dusted with more Kim chee seasoning!\n\nIf. It weren't for the e.coli infested beef tips, the drenched and soggy rolls, the mediocre tempura ice cream, and the southwestern, over kill on the onions on top of the sushi, or the imitation ramen, I'd given this whole in the wall a higher rating!"
        }, 
        {
            "index": 94, 
            "rating": 3, 
            "review": "Craving sushi on the quick and not willing to leave the house to go to our favorite sushi joint in town, Goyemon my fella made the executive decision to order some delivery from Sushi 21. I was reluctant, but let him have his way. \n\nWe called in our order and the food was delivered very quickly. Since I didn't dine in, I can't comment on the service but the food was ok. Nothing amazing, but definitely solid sushi for the price and convenience of delivery. We ordered rolls mainly and they were tasty. Definitely not the best sushi in town but definitely good for convenience. \n\nThey offer dine-in all you can eat options as well as all you can drink."
        }, 
        {
            "index": 95, 
            "rating": 5, 
            "review": "Really nice place. Good for Group. Really nice service. Food are really nice. Has a log of appetizer to eat."
        }, 
        {
            "index": 96, 
            "rating": 4, 
            "review": "We love the Japanese MTV on display. The kids got the bento box and loved the grilled salmon. The grown ups had the rolls and they were great.  Fresh and flavorful!"
        }, 
        {
            "index": 97, 
            "rating": 5, 
            "review": "Friendly staff and great food. Awesome music is also awesome.  Must come here. I love the Japanese lasagna here. Good quality fish and sushi rice. Great for a large group of friends."
        }, 
        {
            "index": 98, 
            "rating": 5, 
            "review": "This place is phenomenal! I eat here about once a week and have tried most of the menu. Love the \"Las Vegas\" roll... Haven't been able to find anything like it anywhere else! Service is great, the sushi is always fresh. I love the bento boxes, and great value for the price!"
        }, 
        {
            "index": 99, 
            "rating": 5, 
            "review": "I wouldn't have found this spot if my friend hadn't flaked on me.  We were supposed to eat oysters at the Orleans, but exhusband had to ruin our plans.  The good thing about this is that I was able to eat here at Sushi 21.  My favorite sushi chef was here and didn't realize it till I walked in.  They don't have the ALL YOU CAN EAT, thank God!  I think that defeats the purpose of appreciating the taste of sushi.\n\nI had started out with the Edemame and Soft Shell Crab.  An awesome choice as the crab was cooked just perfectly.  The sauce they combine it with is perfect.  The Edemame is good for two people.  One person couldn't eat all that unless they were eating for two.  I only had one roll of sushi called Route 21.  I forgot what was inside it, but I would order it again when I come back.  It didn't even need any wasabi or soy sauce or ginger for that matter.  \n\nService was great especially from the Sushi Chefs.  The ladies are very prompt with the drinks and what ever it is you need.  The food is prepared perfectly.  I am definitely gonna go back here again."
        }, 
        {
            "index": 100, 
            "rating": 5, 
            "review": "The service is very friendly. You'd think coming in at midnight people might be grumpy, but the service was very nice! Cute little spot with yummy options :)"
        }, 
        {
            "index": 101, 
            "rating": 3, 
            "review": "We mainly come here because the hubby knows one of the sushi chefs that work here & his name is Justin! He is absolutely halarious & great entertainment for the night. \n\nHONESTLY would have to say that is pretty much all that is really good about this place in my opinion... only because I am a definately picky sushi eater but you can't expect too much from an AYCE place I guess. \n\nWe always just let Justin prepare anything & we tell him which fishes we don't like. Presentation of the dishes are cute & fun.\n\n Service from the chefs seems to be a LOT quicker than the serving staff though. But it could have also been because maybe they thought the chefs would just do all the work.  One this that did kind of bother me visually was the employees that were eating & drinking at the sushi bar & the just strolling around the resteraunt in their pjs.... but maybe they could have been the owners who knows...\n\nOverall not really a place I would come back too often maybe once in a blue moon kinda place."
        }, 
        {
            "index": 102, 
            "rating": 4, 
            "review": "I dont like sushi. But this place had the best wonton soup ive ever had. Also, i had the broccoli chicken  and it did not disappoint. My friend ordered the shrimp fried rice and that  looked delicious."
        }, 
        {
            "index": 103, 
            "rating": 5, 
            "review": "The peach sangria is delish!!!! I'm glad we ordered the pitcher! The lunch buffet is $21.95 per person which is not bad at all considering they have like 30+++ rolls to choose from. We ordered the Johnny which was so refreshing as its all seafood wrapped in cucumber, dynamite which is wonderful and the bake call op which is overflowing with scallops omg. Also the jalapeño boom, shrimp tempura and baked mussel where our delicious appetizers. Getting the buffet is well worth it... did I mention they have like over 30+++ rolls?? Yes, that's a lot to choose from. By the way mochi is also included in te all you can!! Winning!!!"
        }, 
        {
            "index": 104, 
            "rating": 5, 
            "review": "Probably the best Sushi I ate whilst in Vegas. Proper Sushi, served correctly, delicious, very generous portion size, lovely friendly wait staff and loads of choice. We chose \" I Love My Ass\" Roll....delicious. \nAs my boyfriend was at a conference close by we had to reside in The Orleans Casino for the week...We were so sick of the bad food on site that we ventured further afield. A quick search on-line and we found this place a 5 min walk away. The in-house sushi restaurant in The Orleans is overpriced and not very good...How happy we were we found this place and so reasonable too. For those of you staying in The Orleans you are mad not to check this place out. I also commend Sushi 21 for their notice about fish sustainability...Bluefin Tuna will probably be extinct soon and they are actively promoting other varieties and not stocking Bluefin anymore. I'm not sure people really understand how much in peril the ocean fish stocks are. Hopefully Sushi 21 will raise awareness of this serious environmental issue."
        }, 
        {
            "index": 105, 
            "rating": 5, 
            "review": "We came here after seeing good reviews, had all you can eat, and were pleasantly surprised. Food was really good, orders came super fast and staff was great! Nice to see different options on the menu from typical ayce sushi places."
        }, 
        {
            "index": 106, 
            "rating": 5, 
            "review": "Sushi 21 is our favorite sushi spot in Vegas. Always fresh fish, always good flavor!"
        }, 
        {
            "index": 107, 
            "rating": 5, 
            "review": "Really good that was trashed the place is clean love the music the service is great best about all you can eat dessert yum"
        }, 
        {
            "index": 108, 
            "rating": 4, 
            "review": "So good, came to this place after my other go to sushi place caved. Lots to choose from appetizer wise and the rolls are a good size. They have quite a bit to choose from so bring a few friends so you don't fill up too fast....I make this mistake frequently....it's a great place and yes they do have drink specials!"
        }, 
        {
            "index": 109, 
            "rating": 5, 
            "review": "My boyfriend, best friend and I wanted to go to Yama sushi at first but it was a 30-45 min wait so we decided to go to Goyemon instead. Unfortunately for us, it also had a 30 min wait. Instead we opted for Sushi 21. My boyfriend has been here before but my best friend and I haven't. \n\nTheir AYCE sushi price is the usual price of $21 for lunch and $27 for dinner but for $10 extra, they also include an all you can drink for hot sake and beer. I haven't heard of any sushi joint doing all you can drink before! It was pretty cool. Their special rolls were alright. Nothing I tried really wow'd me so far but it wasn't bad either. That all you can drink menu though, is worth coming here!"
        }, 
        {
            "index": 110, 
            "rating": 5, 
            "review": "Came to Vegas for vacation and this was by far the best meal I had!! Service was fast and friendly, sushi was incredible!"
        }, 
        {
            "index": 111, 
            "rating": 4, 
            "review": "Excellent variety of good rolls with great service.  The fish is also very fresh.  There were 2 rounds instead of the usual 3 but  that can be compensated with an quick ordering game plan to get all you want.  There was also a good variety on the appetizer list."
        }, 
        {
            "index": 112, 
            "rating": 4, 
            "review": "We were looking for a restaurant open on Christmas Day. Sushi 21 was, and not only that, they were running a promotion for AYCE sushi: $10 for dinner for writing a Yelp review. Best deal ever!\n\nAs with a typical AYCE sushi place, they make the sushi on demand. They have a huge assortment of rolls, a subset of the traditional nigiri, and some other (mostly Korean) appetizers: bulgogi, ramen, and spicy pork.\n\nPart of this was an ordering error on our part, but most of the rolls ended up tasting the same despite having different sauces. The rice had a strange texture, probably an artifact of mass production. The fish was fresh but medium quality and sliced thinner than a traditional sushi restaurant would slice it.\n\nOn the up side, the servers were very prompt and friendly. They used preprinted sheets to take your order (like a dim sum place). Strangely they ran out of hot water to make tea but were able to heat some more in 10 minutes. Dishes were efficiently whisked away. One of the servers had a hard time understanding us and took plates we wanted to keep and didn't refill our tea when we asked.\n\nAll in all, we would be Grinch-like to complain about the super good deal we got. But if I were paying full price, I might try one of the more established players closer to the heart of Chinatown. So four stars for he Christmas special deal and maybe 3 stars if we were paying full price (as of Dec 2015, their prices were $21.95 for lunch and $26.95 for dinner)."
        }, 
        {
            "index": 113, 
            "rating": 5, 
            "review": "What a great place. The minute we sat down and started watching these upbeat Korean videos I was hooked.  Ordered AYCE... Everything was delicious. Popcorn Lobster was out of this world crazy good. Finished with tempura ice cream with whipped cream and sprinkles... Nice touch! Yummy!!!!!!"
        }, 
        {
            "index": 114, 
            "rating": 5, 
            "review": "Had a great dinner- good food, attentive service...may try the all you can eat next time--only $26 for dinner !  Will definitely go back when next in Vegas ."
        }, 
        {
            "index": 115, 
            "rating": 5, 
            "review": "We are from San Diego, but whenever we come to Vegas, this is the place we always have lunch. We can't complain about anything. The food is good. The server helped me choose the rolls,and I like them. I am happy that I trusted her. Thank you so much. We will definitely come back when we visit Vegas next time."
        }, 
        {
            "index": 116, 
            "rating": 5, 
            "review": "Such a great place to hang out and enjoy great sushi! They have Japanese music videos playing and a fun staff!"
        }, 
        {
            "index": 117, 
            "rating": 4, 
            "review": "Good all you can eat at a decent price! I especially like that you can sit at a table and still get all you can eat (rather than it only being at the bar). Large all you can eat menu with many items on it.\n\nGot a 10% off coupon upon check in here in Yelp!"
        }, 
        {
            "index": 118, 
            "rating": 5, 
            "review": "Wow, I live so close and just recently made a visit with the recommendation from a friend. We decided on the AYCE, and it was super yummy! We really sampled a lot of items which were all tasty and good quality. We selected some appetizers and rolls. The staff is great and they are on it with the ordering process! This is a very cute and comfortable spot. I am a fan and I will be back! A list of our favorite items we ordered I have listed below. \n\ncrab pockets\nedamame\nmiso soup\nshrimp tempura\ncalamari rings\npopcorn lobster\ncrunch lobster\nbaked salmon\nlas vegas roll"
        }, 
        {
            "index": 119, 
            "rating": 4, 
            "review": "Part of my Vegas routine is to head to this little strip mall on the corner of Tropicana and Decatur, grab a coffee at Starbucks, work out at the 24 Hour Fitness (I'm not about to pay $20 to use my strip hotel's \"spa\"!), and then go to Sushi 21 for a post-workout meal. While this isn't the best sushi around, it is still of good quality and reasonably priced, and I've yet to have a disappointing meal. \n\nI normally get either the chirashi sushi or its Korean equivalent, hye dup bap (I believe this place is Korean owned and operated), each of which is a great deal for around $12 (though they charge an extra $2.50 for miso soup, which typically comes with chirashi at most places)."
        }, 
        {
            "index": 120, 
            "rating": 4, 
            "review": "If you are anywhere in Vegas and want all you can eat sushi this is the place to visit. The price of the meal is very inexpensive and the sushi rolls are great! The atmosphere is great it's a nice restaurant with great customer attention. This is Must try."
        }, 
        {
            "index": 121, 
            "rating": 5, 
            "review": "Johnny works wonders! The sushi here was pleasantly surprising for an all-you-can-eat. The sashimi was sliced thin and the rice wasn't packed too thick on each roll. Fantastically filling and the service was excellent. They were all very attentive and friendly."
        }, 
        {
            "index": 122, 
            "rating": 4, 
            "review": "Really good spicy Hawaiian Tuna Poki Salad.  The Johnny and Nevada roll were very goo also.  My son ordered the Chicken Teriyaki Bento, which had a lot of food.  My only regret is not ordering the white meat like the server suggested. They offer all you can eat sushi but we didn't take advantage of it.  The service was a bit slow but not bad all!"
        }, 
        {
            "index": 123, 
            "rating": 5, 
            "review": "Great food and great service by Annabel and jaden! They were very friendly and served us very fast."
        }, 
        {
            "index": 124, 
            "rating": 3, 
            "review": "They have good sushi and edamame :) the Korean ramen looks and tastes kinda like top ramen so don't get that if you don't have to! The service was great! The servers were attentive and fast. Also, their green tea ice cream is the best I've ever had :)"
        }, 
        {
            "index": 125, 
            "rating": 5, 
            "review": "This has to be my new favorite sushi place...every thing was perfect...LOVE the popcorn lobster & incredible shrimp tempura! Very fun Korean music videos...can't wait to come back!!!"
        }, 
        {
            "index": 126, 
            "rating": 2, 
            "review": "I came here today for lunch with my friend.  I ordered the shrimp stir fry luncheon for 12.99. I was very disappointed with my shrimp stir fry.  The vegetables were very overdone and the shrimp was very small and still had the tail on them which I would have preferred if it wasn't on there.  It also came with a salad that had a few bad pieces of lettuce in it. The vegetable tempura and the California roll was the best part of the meal.  Also included your choice of either white rice or brown rice.  I chose brown.  After tax and trip it was $17.00 which I definitely don't think it was worth it for lunch. Overall, I've had much better."
        }, 
        {
            "index": 127, 
            "rating": 5, 
            "review": "Great service and food. Great pricing! We def come back next time we are in LV"
        }, 
        {
            "index": 128, 
            "rating": 5, 
            "review": "Sushi 21 is great! We come here every time we come to Las Vegas. It's only about 5-10 minutes from the strip depending on traffic. All you can eat lunch is 21.95 and dinner is 26.95. You can add all you can drink beer for $10 more. \n\nWe come to Vegas at least once a month and we have been here over a dozen times. We come back because the service is good/quick and the seafood quality is fresh. \n\nI definitely recommend taking the 10 minute drive up Tropicana to try Sushi 21!"
        }, 
        {
            "index": 129, 
            "rating": 5, 
            "review": "Great service ! Food came out super quick. Friendly staff. Music with projector. Sushi was delicious. All you can eat, never can go wrong with that! Johnny roll was great too!"
        }, 
        {
            "index": 130, 
            "rating": 5, 
            "review": "Great food, excellent service. We went on a Tuesday night and it was quiet and relaxing away from the bustle of the strip. We weren't familiar with ordering sushi from a new restaurant and the chef was more than helpful with our selections."
        }, 
        {
            "index": 131, 
            "rating": 4, 
            "review": "Service was outstanding very quick and servers were very pleasant. Sushi was delicious favorite ones were Super Mario,fire fire and sexy girl."
        }, 
        {
            "index": 132, 
            "rating": 2, 
            "review": "I was on the hunt for a good all you can eat sushi place this summer when I went to deal the World Series of poker.  This place, unfortunately, looked great but the flavor combinations seemed all wrong and quite strange.  In fairness, some of the sauces may have just been foreign to me, but neither me or my friend liked much of any of it.  As much as I love sushi, I ended up not even being able to eat much even though I was still hungry, because I just didn't enjoy the taste.  The service was great. They have a big flat pull down screen with Asian music videos which were fun to watch, and also a good drink selection."
        }, 
        {
            "index": 133, 
            "rating": 5, 
            "review": "Excellent service for our big family of 9. The food was delicious and the hot tea was at a perfect temperature. We'll definitely be back soon! :)"
        }, 
        {
            "index": 134, 
            "rating": 5, 
            "review": "With all the fancy Vegas buffets and such my wife and I drive a little way off the strip to come here every time we visit Vegas.\n\nTo start the sushi quality and freshness is what earns my repeated visits. Originally recommended by a friend that also drives off the strip every visit to Vegas this has also become a place I highly recommend to visitors.\n\nComing for Los Angeles my choices for sushi is far and beyond. At $26.95 a person for dinner the price may be a little steep but they offer it back in value that can't be beaten with a few one per person orders like Giant Clam, Uni, sweet shrimp, Fresh Oysters, and a lot more.\n\nThe place features fusion sushi rolls and many creations by the sushi chefs here. Things like Cherry Blossom which features spicy soft shell crab wrapped in avacado are just delicacies to crave and earn the right for another visit!\n\nIf you are a green mussel fan, my wife and i order 5-6 orders of 2 pieces each every time we come lol... And it's sad you'd think you get better food in LA but this place has it done right!\n\nThere is also fusion of Korean delights such as galbi and bugolgi.\n\nThe decor of the place is very izakaya friendly. They even have an area where you purchase and bring your own chopsticks and they will wash them and place it a area dedicated for you to use when you visit.\n\nThose of you that follow me know the amount of sushi I enjoy on a regular basis and this place has made it to my top 3 in value and variety of all time.\n\nI highly recommend the place and encourage you to give a chance."
        }, 
        {
            "index": 135, 
            "rating": 4, 
            "review": "The restraunt is sleek and has a nice atmosphere. The food and the presentation of the food itself are fantastic. The portions on the lunch specials were more than filling and the spicy pork was incredibly tasty and tangy. Our waitress was kind and very helpful in placing our order. Cool place for japanese food!"
        }, 
        {
            "index": 136, 
            "rating": 5, 
            "review": "Love the brown dragon Awesome! Always great service almost fell in love with the music videos they play but don't understand"
        }, 
        {
            "index": 137, 
            "rating": 5, 
            "review": "This is my boyfriend and my favorite place to go for AYCE sushi. There's never a line, parking is easy, your food comes out fast, it's always fresh, and there's a huge selection. The hours are great, too. My only complaints are that the staff could be a little bit more personable, and sometimes the music in there is very loud."
        }, 
        {
            "index": 138, 
            "rating": 5, 
            "review": "What a great place. Our first time here and the sushi was great. Very fresh and a great presentation!! The service was spot on and extremely courteous and friendly. She also helped us pick some of their more popular rolls which ended up being great picks!!!! Can't wait to come here for dinner!!! Would recommend to anyone!!!"
        }, 
        {
            "index": 139, 
            "rating": 3, 
            "review": "Really pricey for my fiance and I the bill was a little over $60 for the all you can eat. You only get 2 rounds of all you can eat."
        }, 
        {
            "index": 140, 
            "rating": 5, 
            "review": "I love this place! Such fresh fish. If you ever go it's worth it to pay for the all you can eat. Try the fried sushi it's the best:) also the fried Oreo dessert is amazing. All the servers are so nice and patient."
        }, 
        {
            "index": 141, 
            "rating": 2, 
            "review": "Very average food quality. The uni sushis were very stinking and looked old. Not fresh.  Go to somewhere else."
        }, 
        {
            "index": 142, 
            "rating": 5, 
            "review": "I have been to many sushi places in town, this place (sushi 21) is in the top 5 for sure!!! Great place, great food, and great people"
        }, 
        {
            "index": 143, 
            "rating": 3, 
            "review": "Had some rolls, a beef app, a salad and some sushi.  I wasn't impressed.  The $1 beer special would be my only incentive to return."
        }, 
        {
            "index": 144, 
            "rating": 4, 
            "review": "We were excited coming here to Sushi21 and super tummy-satisfied we did! The service was on-point, especially Calvin, who was our main server. Out of all the sushi rolls we tasted, our favorite was the Sushi21 because it had everything we liked all in one rolls. Out of the appetizers, our favorites were the Monkey Balls, baked muscles, and the fresh oysters! About to try this deep fried Oreo and it looks good. Looking forward in returning. Thanks."
        }, 
        {
            "index": 145, 
            "rating": 5, 
            "review": "This place was awesome! Totally had a great ayce experience with my fam bam and friends. The service was great. We especially loved the deep fried oreos, oh my yum!!! We will definitely be back soon!!!"
        }, 
        {
            "index": 146, 
            "rating": 2, 
            "review": "Last time I ate here, I saw roaches running around. And that was the last time I ate there, food was blah, service was blah, I'm surprised the roaches even stick around."
        }, 
        {
            "index": 147, 
            "rating": 1, 
            "review": "This place does NOT deserve the stars that it has! Worst customer service ever. The food is not even authentic. There are many sushi restaurants in Vegas where it's good and the customer service beats this place. Wouldn't come back here. EVER!!"
        }, 
        {
            "index": 148, 
            "rating": 5, 
            "review": "I've been here a few times and ALWAYS forget to check in for 15% off my bill but I don't really mind that too much because I've never had a single bad experience here. Ingredients are always fresh and vibrant and the staff is great."
        }, 
        {
            "index": 149, 
            "rating": 4, 
            "review": "Sushi here is tasty and of okay size. The rattlesnake is great I would highly recommend to any unagi lovers.\n\nSean and I love my ass rolls aren't too spicy for someone who is bad at taking spicy things. They are very very similar so I wouldn't recommend getting both in one visit. One is enough to satisfy your spicy tuna fix.\n\nThe chicken bowls are very large and filled with lots of vegetables for anyone looking for a good mix of meat to vegetable ratio."
        }, 
        {
            "index": 150, 
            "rating": 5, 
            "review": "Awesome often overlooked sushi buffet. Creative menu with lots of unique choices. Stay away from the flamingo roll thou...no bueno"
        }, 
        {
            "index": 151, 
            "rating": 5, 
            "review": "Love this place! Every time me or anyone in my family has a late night craving for sushi we just order for pick up and it's ALWAYS fresh and really good. Sometimes they throw in an extra roll on the house similar to the rolls we had already ordered and it seriously makes our night. Love coming and would recommend it to any of my friends Liz"
        }, 
        {
            "index": 152, 
            "rating": 4, 
            "review": "Great food and a very reasonable price. Highly recommend the spider, eel, and caterpillar rolls."
        }, 
        {
            "index": 153, 
            "rating": 2, 
            "review": "If you are a sushi snob then this is not your place.  Seriously I guess you get what you pay for being that it is AYCE $26.95 for dinner.  I'll pay more for good quality and selection.  Fyi our servers were Korean and didn't understand Japanese or what I was trying to order good thing I know a little Korean LOL!!  \n\nMy husband likes uni and mirugai fyi only one order of 2 pieces per person so if you are coming here thinking you can have ayce you will be out of luck.  I don't know what the hype is I didn't feel anything. Plus his uni didn't look buttery fresh.  It actually looked almost brown. \n\nOmg they had instant Korean ramen on the menu...  \n\nIf you know sushi and good quality fish and sushi you will not be happy here. I think this place is for people who think they know what real sushi and Japanese food is or maybe just trying to start to experience it.  Sorry if I am harsh but I have been to be honest and since I have eaten at some really high end places I don't want you to think you are getting that here. \n\nI let my husband pick a AYCE place I think I may need to take back the food decisions lol!!"
        }, 
        {
            "index": 154, 
            "rating": 5, 
            "review": "Came here for the second time. We got AYCE again. There's nothing disappointing about this place. Sushi chef Moon is the best. My favorite roll is a Philly roll. Not sure why, but I get it at every sushi restaurant. We got to talking and I told him that I like spicy sushi. He asked if I wanted to try a variation of a Philly roll that would add a little spice. I agreed and I'm so glad I did. He knows what he's doing. We will definitely be back again. :)"
        }, 
        {
            "index": 155, 
            "rating": 5, 
            "review": "What I love most was the service here. I was in a party of 7 (all of us AYCE) and the server was very attentive in refilling all our waters and made sure to check on us to see if we needed to order more items.  Great job! The rolls were very yummy (highly recommend the lobster roll) and the oysters were fresh.  All our dishes showed up as ordered. They have a pretty good red bean ice cream of you ever get the chance to try!"
        }, 
        {
            "index": 156, 
            "rating": 1, 
            "review": "This sushi restaurant is one of the worst if not the worst I have ever been to. Its surprising because Las Vegas is well known for amazing sushi.  The service was not inviting, the fish was dry and looked like it was sitting out all day. The salmon wasn't fresh. It tasted almost rotten. The rice was dry and had a salty after taste. It was so bad that even the dessert was horrible.  The green tea ice cream tasted artificial.  For the all you can eat option, well they made it uncomfortable to order by reminding us that they charge for leftovers.  This is not our first rodeo and we are very aware of that common policy for all u can eat sushi.  I guess im glad he did warn us because the food was appallingly disgusting.  Im not sure I would have finished my orders. Im sticking with Goyemon or Kaya. This place isnt worth the time and money."
        }, 
        {
            "index": 157, 
            "rating": 5, 
            "review": "Sushi night or day here is hands down still my favorite, I never leave here with any missed cravings and my taste buds are always satisfied! I've listed my favorites below \n\nFast service clean and the videos on the wall are adorable...\n\nHere was my top tastes!! \nGyoza.\nEdamame \nScreaming o salad \nWon ton soup\nMiso Soup \nCucumber salad  \nCalamari rings \nShrimp tempura \nCrab pockets \n\n46 Sexy girl \n65 Crunch lobster roll\n28 High Roller roll\n35 Double D roll         \n9 Popcorn lobster roll"
        }, 
        {
            "index": 158, 
            "rating": 2, 
            "review": "Qualifier: I didn't have the sushi.  I wasn't really in the mood for sushi so I had the Kalbi dinner special.  Price was reasonable ($12), but the food was mediocre at best.  As with most \"combo\" style dinners, you get soup, some salad, some California rolls, vegetable tempura, and the entree.  The salad was a small portion of iceberg lettuce with a splash of dressing.  The soup and tempura were average, but the tempura sauce really ruined the tempura.  It wasn't what I'm used to.  Kalbi was dry and really stringy.  Morale of the story: lots of variety with your combo dinner, except none of it was very good."
        }, 
        {
            "index": 159, 
            "rating": 5, 
            "review": "Love thr sevice and the good the price was great. Jaden wasalways on his a game and came and checked up on threw out the whole meal."
        }, 
        {
            "index": 160, 
            "rating": 1, 
            "review": "food taste bad and unfresh, still charge $10 for the leftover. i will never go there again"
        }, 
        {
            "index": 161, 
            "rating": 4, 
            "review": "First time eating here. The food is really good especially if you eat all you can eat, the food is really good quality. The lack of information on the menu like how many items each will contains would be more informative and restrictive of one dessert per order is minor. Overall very good restaurant and highly recommend it."
        }, 
        {
            "index": 162, 
            "rating": 5, 
            "review": "love it will always return for the great service, delicious sushi and addicting K-Pop videos"
        }, 
        {
            "index": 163, 
            "rating": 4, 
            "review": "They have a great fare and ambiance but be careful if you don't order all you can eat don't let them assume and charge you for it. Look at what is on the all you can eat and what is not like the rolls. Don't get me wrong the sushi is great just pay attention to your bill"
        }, 
        {
            "index": 164, 
            "rating": 1, 
            "review": "used to be my all time favorite until the last 3 visits i had the staff was extremely rude\ni was chard a gratuity of 18 for having small children with me who didnt eat 2 were in a car seat asleep on another occation my husband and I sat at the bar and were told to move because they were going to paint even though it was 11 pm and there was other customers sitting at the bar as well and they weren't told to move.Third time showed up with a large party and they sat us all down and took almost 30 minutes to take just our drink order haven't gone back since."
        }, 
        {
            "index": 165, 
            "rating": 5, 
            "review": "we have enjoyed this place for years. their orange chicken has ruined me for all others who try to make it haha. it is the best orange chicken i have ever had. the staff is also very friendly."
        }, 
        {
            "index": 166, 
            "rating": 3, 
            "review": "Sushi 21 ended up being a back up plan after a botched attempt to go to Sushi House Goyemon. We found that the wait was going to be an hour there. Seeing as though we were ravenous an hour wasn't going to cut it. This place was the exact opposite of Sushi House Goyemon with only a few patrons. At least I wasn't bored since the guy next to us was apparently a pimp trying to hire the girl he was with to his escort service. It was quite entertaining to hear him talk about his business as though it was a Fortune 500 company. I almost expected him to say, \"we offer all our ho's 401ks too\". Ok this was totally off topic but it was much more interesting than what Sushi 21 tried to offer in terms of food. The iced tea tasted like mop water but seeing as though I was tired and not in the mood to quibble with waitress, I tolerated it. We ordered the gyoza as an appetizer and it was decent but not special. I ordered the #4 Spicy Crabmeat Roll and the #20 Roxy Roll. The Spicy Crabmeat was very underwhelming and I left half of it on the plate. A sushi chef messing up something as simple as a crabmeat roll is like a pastry chef messing up a batch of cookies. The Roxy Roll was the complete opposite however. This delightful roll saves this place from a dubious 2 stars. One of the best speciality rolls I have had anywhere. I would definitely hit this roll up again. Despite the ho hum experience here I would be willing to go back but probably never will. Vegas simply has too many restaurants to visit for anyone to visit a 3 star place more than once."
        }, 
        {
            "index": 167, 
            "rating": 5, 
            "review": "On my visit to Vegas I passed by this place and decided to try it out, I got the AYCE. the price was good for dinner, I'm from los Angeles so prices are more higher for the quality of sushi I had here. the food itself is delicious full of flavor, fresh fish and large sushi pieces. the chef Kenny is awesome! we took sake bombs with him and I also tried his extra spicy sauce (beware its like habanero x 100000000000) in your mouth. anyway I highly recommend this place to anyone who loves and enjoys eating delicious fresh sushi, I've tried other places in Vegas and even more expensive places but this was better than any other"
        }, 
        {
            "index": 168, 
            "rating": 4, 
            "review": "Good food, better service. Our server Annabel was great :) Super personable and very quick to ask if we needed more water or drinks, and checks in with us frequently."
        }, 
        {
            "index": 169, 
            "rating": 2, 
            "review": "Don't we all hate to order food  \" to go\" and to discover while already at home that they missed something from your order?  Driving back there is not worth at this time ...."
        }, 
        {
            "index": 170, 
            "rating": 5, 
            "review": "Went here for a friends birthday. Great food and service!!! Definitely check it out if you are near the strip."
        }, 
        {
            "index": 171, 
            "rating": 5, 
            "review": "I went here a couple days ago and I enjoyed it! Most sushi places are the same with all-u-can-eat, but I liked the Swat sushi roll here, along with the Las Vegas roll and spicy tuna roll is a must. The Baked Lobster roll is interesting, with the sushi roll pieces layed out flat and the clawfish on top of  giving it a unique look."
        }, 
        {
            "index": 172, 
            "rating": 3, 
            "review": "Went last night with some friends and had the \"all you can eat\" option. The appetizers were better than the rolls in my opinion.  Saturday day night and we were the first table. The service to wait on us was slow but once ordered things were ready very quickly. An ok experience but nothing noteworthy."
        }, 
        {
            "index": 173, 
            "rating": 5, 
            "review": "Great sushi love this place , great people, super friendly, I love the ginger not to over powering, lots of selection well priced"
        }, 
        {
            "index": 174, 
            "rating": 4, 
            "review": "I've had sushi in more places than most people visit in a lifetime. Sushi 21 is excellent. The fish is always very fresh. The portions are perfect and the rice to fish ratio is even better. Their prices are what you'd expect. The staff is very friendly. I would give this place a 5 star, but they always forget to put in my order for green mussels. The have cool music playing too, great atmosphere."
        }, 
        {
            "index": 175, 
            "rating": 5, 
            "review": "This place never disapponts. Rolls are huge and delicious. With over 100 items to select from on their AYCE menu you can't go wrong. They have a great variety of fresh, baked and fried rolls that will please your palette to perfection. My favorite appetizer is the Crispy Rice w/ Spicy Tuna, it's the 1st thing I usually order. It's also close to the Strip, so if you're from out of town, give this place a try the next time you visit Las Vegas."
        }, 
        {
            "index": 176, 
            "rating": 4, 
            "review": "They have all you can eat but we decided to go a la carte. The fish was fresh and the sashimi was good portions.  The chefs have great knife skills and great roll combinations. We definitely would dine here again."
        }, 
        {
            "index": 177, 
            "rating": 3, 
            "review": "Sushi was great and came out in a decent time. Cooked food and bento boxes made it to table in an hour so my table has some ppl without food still. They comp'd us some sushi for waiting but that was already 30 mins waiting for some fried rice and noodle dishes."
        }, 
        {
            "index": 178, 
            "rating": 5, 
            "review": "I freaking love this place.\nI try to come here as often as possible.\nCome in and get the tuna poki salad.\nMake sure it's spicy."
        }, 
        {
            "index": 179, 
            "rating": 4, 
            "review": "I had a great experience at Sushi 21. The Sushi were really good. We did the \"all you can eat\" for $26/person. It was awesome and the atmosphere is nice.It felt like in japan. The server were good and fast. I recommend this place!"
        }, 
        {
            "index": 180, 
            "rating": 5, 
            "review": "This place is great; they gave us, a couple of dirty climbers, miso soup AND a house salad, even though the menu clearly said \"or\". This is our new spot in Vegas!\nMassive beers. \nMust see, must eat."
        }, 
        {
            "index": 181, 
            "rating": 5, 
            "review": "We got a large platter and added some rolls and it was pretty dank.  The service was excellent, quick, the environment was chill, the prices were fair, and the location is within decent proximity to the strip.  I had heard good things about this spot from some locals and their descriptions were spot on.  The place is not the best of the best, but it definitely is for their prices and location and food quality."
        }, 
        {
            "index": 182, 
            "rating": 5, 
            "review": "On of my favorite sushi places to eat every time I'm in Las Vegas. Also one of the better sushi restaurants I have eaten at in the country."
        }, 
        {
            "index": 183, 
            "rating": 5, 
            "review": "Nice Sushi & Desserts!!\nPrice is Nice! All You Can Eat!\nLunch $21.95\nDinner $26.95\n\nOreo Deep Fried is sooooo Good!\n\n\nラスベガスでちゃんとしたお寿司が美味しく食べられ、しかも食べ放題！\nシャリ小さめで女性でも沢山食べられます。\n日本から来た人も「下手な日本の回らないお寿司屋さんより美味しい！」と、太鼓判。自分も実際アメリカ人の友達から「すごく美味しい寿司屋教えてやるよ！」と、教えてもらいました。オススメです！"
        }, 
        {
            "index": 184, 
            "rating": 5, 
            "review": "When we arrived at Sushi 21..we were greeted n seated quickly. the customer service is excellent, n the staff is fun to be around. the food is delllllllllicious n the sushi chefs  are very seasoned. best one yet"
        }, 
        {
            "index": 185, 
            "rating": 5, 
            "review": "Excellent Sushi Place, I also go to Yama Sushi but this place is a lot better in my opinion especially is you like fried rolls. \nIf you're in the area its a must for any sushi lovers"
        }, 
        {
            "index": 186, 
            "rating": 5, 
            "review": "Love this place! Don't really enjoy sushi because I don't eat fish but they have a steak roll or chicken teriyaki roll for picky eaters like myself!! Very enjoyable and the deep fried oreos are great!!"
        }, 
        {
            "index": 187, 
            "rating": 4, 
            "review": "Such awesome sushi!  And not busy - I don't really wanna share because there might be a wait some day"
        }, 
        {
            "index": 188, 
            "rating": 2, 
            "review": "Really poor compared to the place around the corner but the same price. Noisy, no class and the quality was just not there"
        }, 
        {
            "index": 189, 
            "rating": 5, 
            "review": "The food and service was great, our waitress Anabel was amazing! The atmosphere is great"
        }, 
        {
            "index": 190, 
            "rating": 5, 
            "review": "I really enjoyed it here! Johnny is fast and the servers are attentive& nice. I really like the fact they open at 11. I got an early lunch today and my usual place opens later. I got ayce & im very happy about it. I will be coming again(:"
        }, 
        {
            "index": 191, 
            "rating": 5, 
            "review": "Even better than the first review, honestly this is my new favorite restaurant in the us :)and their spicy a adamame is amazing ... totally in love with this place"
        }, 
        {
            "index": 192, 
            "rating": 1, 
            "review": "Worst sushi EVER. Wtf is this!?\n\nCame here because Goyemon estimated us a one hour wait time (as soon as we started getting our food at Sushi 21, Goyemon called -.-.  \n\nThis is not sushi. This is garbage. STAY AWAY!  The quality is absolutely horrible. \nSomething that stood out was the uni.  This was THE worst sea urchin I have encountered in my life. It was faaaaar from fresh, and the consistency was disgusting.  I have eaten fresh uni in Tsukiji fish market in Japan, right out of the sea urchin, still moving... So I know exactly how fresh and good uni should taste.  I dont know what I was thinking expecting it from this restaurant.\n\nIt is Korean owned, and not authentic Japanese sushi.  The sushi \"chefs\" did not know the proper way to prepare the dishes or what sauces go with which.  They are also not very good at preparing sauces, as we had a roll that came out tasting exactly like a sour lemon... Ummm yikes!  Please wait the extra 20 minutes and go to Goyemon.  You'll thank me later."
        }, 
        {
            "index": 193, 
            "rating": 4, 
            "review": "love the japan pop videos they show...oh and the food is pretty decent too!"
        }, 
        {
            "index": 194, 
            "rating": 5, 
            "review": "Favorite spot boyfriend and I love going to. Popcorn lobster roll is amaze. Reasonable price and you get a ton off the menu."
        }, 
        {
            "index": 195, 
            "rating": 1, 
            "review": "The quality of fish really suffered. Uni was brown and it tasted nasty. The supposedly fresh oyster is not so fresh. Not a single item we ordered tasted good. Left the restaurant still hungry. Will not return. There are a lot of other good restaurants out there."
        }, 
        {
            "index": 196, 
            "rating": 5, 
            "review": "My first time here and their place looked trendy. Great updated look. The staff was very friendly and the service was great. Brown dragon was bomb and the sushi 21 too. We'd come here again and I'd definitely recommend this place."
        }, 
        {
            "index": 197, 
            "rating": 2, 
            "review": "Okay well this place has a sign that says to write them a review for 10% off so I wrote this review to get the 10% off but I'm not even sure if they took the 10% off on the bill.. Anyways ! The all you can eat sushi is like $26 a person and we were kinda iffy on it but then we took that gamble and the food quality was not as good as I hoped ): we were supposed to go to goyemon but the wait was literally an hour so we decided to go to sushi 21 since it was near by . We walked in and the restaurant was basically empty and so we sit and the waitress took our order . They forgot my baked mussels a couple of times that I asked and did I mention the quality of the food wasn't that good ? Idk it might be just me coming from Hawaii (with some of the freshest yummiest fish) to Vegas with some crappy not as fresh  quality fish but yeah the mussels tasted like over cooked really hard chewy mussles with some really bold sauce to cover it up . And the miso soup was SOO salty omg my mother couldn't even finish it because she said it was waaaay too salty for her . But the spicy poki was actually kinda good only cuz it was really spicy but to also add the fish was still extra chewy bleh . We also ordered a yum yum roll and that was pretty bland not as \"yum yum\" as I expected . The wonton soup though is good I'd recommend but the portion is SOO little you'll probably finish it in a couple of bites . Overall I wish I dined at goyemon tonight instead but it's always good to try new places and I can't say it was completely disgusting since it did fill me up so 2 stars because the customer service wasn't terrible but only 2 stars because $26 for a person for such low quality food is not agreeable to my standards"
        }, 
        {
            "index": 198, 
            "rating": 2, 
            "review": "I don't know if I just came on a bad day but their super white tuna gave me food poisoning. I ordered two orders of super white because I love it but after eating one piece, it tasted old and nowhere near fresh. all the other nigiri and rolls were aight. salmon was disappointing. I ended up feeling so sick I called out of work later that night. probably won't go back. \n\ngiving two stars because decor and server were nice. that's pretty much it."
        }, 
        {
            "index": 199, 
            "rating": 5, 
            "review": "Great late night sushi spot! The Washington roll and the kiss of fire are amazing! The servers were great and the rolls are fresh and smooth."
        }, 
        {
            "index": 200, 
            "rating": 5, 
            "review": "The eel roll are great. A have to try it your like it. yummy.Sushi 21 rocks!!"
        }, 
        {
            "index": 201, 
            "rating": 5, 
            "review": "I've came here numerous times and honestly don't understand why anyone would complain about this place. The service is great and I am always greeted promptly. Today I decided to order for pick up over the phone since my boyfriend and I are on a tight schedule . The first lady who answered the phone didn't understand me well and so she transferred someone over who spoke better english but I honestly wasn't upset at all. When I came in to pick it up she was apologetic and thought she was so sweet. I'm sure she gets a bunch of douchebags who give her a hard time but I assured her everything was okay. After I opened my bag they threw in a nice surprise of a roll on the house. It seems as they are extremely nice about taking care of everyone if anything were to happen but I just hope no one tries to take advantage of their amazing service. Definitely check this place out!"
        }, 
        {
            "index": 202, 
            "rating": 1, 
            "review": "The fish was not very fresh, but I can not expect too much since it is all you can eat. All the pieces of the rolls were literally falling apart. I will never come back. I will never reccommend this place either. The sushi rice tasted very sour like it was a few days old. I feel bad because the busser and server were nice, but the food is just unacceptable to me. I came with my brother and I feel for $50 I could have gone sonewhere else and leave satisfied."
        }, 
        {
            "index": 203, 
            "rating": 5, 
            "review": "The service here was amazing. The food was good and we were seated right away. Will be back soon"
        }, 
        {
            "index": 204, 
            "rating": 5, 
            "review": "Our first time here with my brother and sister. Food was super fresh! The rolls are to die for. Our waitress Su was phenomal and gave us excellent service. Highly recommend this place!!"
        }, 
        {
            "index": 205, 
            "rating": 1, 
            "review": "Hands down the worst sushi place I ever been to in the entire metro area and I have tried at least 7 other different ones.  Im not sure which was worse the food or the horrid service.  This is the only place that does not let you order half rolls.  Even though  that stipulation its not anywhere to be found on the menu under the rules   The waitress literally yelled at my party of four because we tried to order appetizers before she was finished getting our drinks.   There is a reason why they are never that busy. I will never come back even if the food was free.  Terrible terrible terrible place.  I am convinced every single good review is fake or a friend or relative of someone that works there.  Come here if you want grocery store quality sushi"
        }, 
        {
            "index": 206, 
            "rating": 5, 
            "review": "Good food good times great times love it here alway excited when I'm here ready to try new sushi"
        }, 
        {
            "index": 207, 
            "rating": 4, 
            "review": "Pretty good AYCE sushi restaurant. The Nigiri portions were small, but that gave me more room to try a variety. The tempura shrimp were cooked to perfection; not overly breaded and greasy like other places. The roll I always order at every sushi place is the eel with avocado and tempura shrimp (dragon roll?) It was very good here. I would come again."
        }, 
        {
            "index": 208, 
            "rating": 5, 
            "review": "Fast friendly service. Everything we had on the AYCES was amazing! Very impressed! The only down side is you can only order 2 half rolls per person.  I loved how they have lots of spicy roll options. They also have a selection of non fish rolls!"
        }, 
        {
            "index": 209, 
            "rating": 3, 
            "review": "They have various kinds of Susie's, but some of them are not very fresh, like sea urchin and salmon caviar."
        }, 
        {
            "index": 210, 
            "rating": 4, 
            "review": "I love that they play Japanese music videos here!! It's entertaining to watch. \nGood atmosphere and the sushi is delicious, my friend and I went here a month ago and I forgot to write a review.\nThe lobster covered California roll was way bigger that we thought and they didn't over charge us for the leftovers since we couldn't finish it.\nCheck it out! \nFresh, good sushi here."
        }, 
        {
            "index": 211, 
            "rating": 5, 
            "review": "Awesome!!! Everything was so good. We came in on a Fri night. Boyfriend and I ordered AYCE dinner and it exceeded our expectations. Had calamari, soft shell crab and vegetable tempura appetizers -- all were delicious. \n\nSushi: hamachi Yuuummmm! Huge fresh pieces of yellowtail\nSweet shrimp \nSea urchin\nAll were fresh and flavorful.\nRolls - Jackpot and White Dolphin - I posted pics on Yelp...they were all really really good. \n\nSake was buy one get one free for AYCE yaay! Everything was great, we will be back!"
        }, 
        {
            "index": 212, 
            "rating": 5, 
            "review": "I love this place the high roller sushi roll is the bomb make sure you get it! Me and my hubby come all the time and there music is good even though secant understand lol this a must. Come place"
        }, 
        {
            "index": 213, 
            "rating": 2, 
            "review": "I drive here 40 mins from my house because I hear how awesome the place is.. so far I've walked in and no greeting at all when I walk in. My friend and I get seated and they are totally avoiding us and we have to flag them down to order.  Once we ordered our food it was good. The drinks unfortunately were not replinished until 30mins later after asking for a refill. Maby they just don't give goood service to guys with muscle,  it's not like it was busy at all I don't get it I will try this again with my girl maby we will get better  service. They do have good food and they did say thanks you and good bye on the way out so I will give them 2 stars. Smh"
        }, 
        {
            "index": 214, 
            "rating": 5, 
            "review": "All you can eat sushi - nuff said. Sometimes those kind of places can be overrated, but not here. Highly recommend this place for any sushi lover!"
        }, 
        {
            "index": 215, 
            "rating": 5, 
            "review": "Best sushi in Vegas ..... Service is great . Would highly recommend it. Best rainbow roll ."
        }, 
        {
            "index": 216, 
            "rating": 5, 
            "review": "Great place! Food was delicious, staff were super attentive and very friendly! Highly recommended."
        }, 
        {
            "index": 217, 
            "rating": 5, 
            "review": "Sushi 21 does not disappoint.   This restaurant has a plethora of sushi, rolls, appetizers,  and desserts to choose from.  I recommend the all you can eat option so you can try a little bit of everything.   I definitely love coming here and recommend it to all my friends."
        }, 
        {
            "index": 218, 
            "rating": 1, 
            "review": "I know that for all-you-can-eat sushi you have to eat all the rice or get charged for it, but do you have to eat all the fish? ;)\n\n1.5 stars. I usually round up but here I'm rounding down for the dishonesty of their check-in scam.\n\nWe were craving sushi around 1am and this was the only AYCE we saw that was open past 2am.\n\nService was friendly and not inattentive though that may have had to do with the fact that we were the only ones there at 1am (despite their supposedly closing at 3am).\n\nLast call is posted in the window as 2:15 but when we sat down we were informed last call was at 1:45am. Did not contest the sign on the door. Maybe they changed their hours, but if that is the case then they needed to also change their signs.\n\nThe sushi rice was too sweet.\n\nFish across the board was not very fresh.\n\nUni was not great. The brighter the color, the better. Pale or brown uni has either a plasticky or seaweedy (and not in a good way) taste to it. These were pretty brown, but surprisingly not as awful as at JJANGA or Goyemon.\n\nOysters were far from the worst I'd ever had, but the freshness of a raw seafood item is still worryingly called into question when you feel the need to put lemon slices directly on it.\n\nSnow crab was so cloyingly sweet it was sweeter than the shaved ice we had at Chada St on Tuesday. It did not taste like crab at all, real *or* fake.\n\nWe asked for no sauce on anything but they only remembered to not put sauce on our shrimp tempura roll, which had surprise \"krab\" (fake crab) in it.\n\nWhich brings me to the rolls. Rolls on the special, baked, and fried rolls lists (basically everything that was not on the traditional roll list) were not very varied. Almost everything had fake crab in it even if it was not a listed ingredient. Everything that didn't have krab had spicy tuna and everything that didn't have spicy tuna had krab.\n\nWe ended up only getting a couple rolls because after they couldn't get \"no sauce\"\" right we were not confident they would be able to do \"no crab\" reliably and did not want to fill our stomachs with that sweet crud.\n\nDisappointed that they had run out of tempura green tea ice cream. I wasn't sure how they could still have green tea ice cream and still have tempura and not have tempura green tea ice cream (I had horrific thoughts of soggy, pre-tempura'd ice cream dancing rudely in my head, but the DH informed me that they have to super-freeze a ball of ice cream in order to tempura it without it melting, and that this takes 2 hours or more, so apparently that's how).\n\nDon't like the scam they're running for the check-in discount. Have encountered the whole \"write good review for a discount\" scam before, but never seen it attached to a check-in, or seen a place where they want the review up front. Makes no sense."
        }, 
        {
            "index": 219, 
            "rating": 4, 
            "review": "The fish was very fresh and tasty! Their all you can eat menu was very diverse and their staff is friendly and attentive!"
        }, 
        {
            "index": 220, 
            "rating": 5, 
            "review": "Another gem of a find on our family vacation! Nine rolls and not a one was a disappointment. The popcorn lobster was an unexpected treat, Vegas Lasagna was great (we usually don't care for baked) and don't pass on the Super Mario! Even better...the service was great! For those taking advantage of the Yelp discount...you don't have to write the review before you order, check in - and write it later. Save the discount, and your server will tap the \"use it now\" when she brings your bill!"
        }, 
        {
            "index": 221, 
            "rating": 2, 
            "review": "Okay so we tried it for the first time on a Sunday night because goyemon was an hour wait and we were starving. When we finally got here I thought to myself \"oh it looks okay\" you can see the sushi bar right when you enter the restaurant. The staff were nice so okay we gave it a shot. \n\nWe sat down and they gave us a sheet of paper where in you have the list of most of the items except for appetizer and just check which you wanted. I thought it was cool but at your second order they never gave the list so eh..\n\nSo we're done for the first round but still have a few rolls on our plate (angus and chicken teriyaki roll which didn't taste so good for me ) and I wanted some more seaweed salad and other things so I called the waitress, before I could even speak she already opened her mouth and told me \"you do know that we charge if you have any left overs \" and she was looking down at my plate. As if we were done eating and trying to get the check but no we were still going to order and that kind off loss my appetite for a little bit, I obviously know your policy cause it's in the menu, and we wanted to order more and obviously we will finish all what we ordered because we didn't want to be charged. \n\nI'm not sure if I will be going back here it just so happens that goyemon was too full, and there's nothing special about this place because what you get here you can get from other sushi places."
        }, 
        {
            "index": 222, 
            "rating": 4, 
            "review": "Here visiting.  Nice place with good food. All you can eat special.  Can't go wrong with that."
        }, 
        {
            "index": 223, 
            "rating": 3, 
            "review": "We came here because Goyemon had an 1.5 to 2 hour wait. Fried stuff is interesting. Lot of choices but taste similar. The batter on fried lobster and scallops on top of the rolls was too thick and ended up leaving a greasy feeling to the dishes. The sushi have a decent rice to fish ratio. We tried the tuna and  salmon sushi and thought they were good."
        }, 
        {
            "index": 224, 
            "rating": 5, 
            "review": "This place is Great! and FYI this Christmas Eve I'll be enjoying all you can eat for the low low price of $9.99"
        }, 
        {
            "index": 225, 
            "rating": 5, 
            "review": "I went today for a pick up service and the food is awesome. The service and decoration are great. The only thing better than the food is the waitress. She is just amazing, one of the most beautiful woman I have ever seen."
        }, 
        {
            "index": 226, 
            "rating": 4, 
            "review": "No wait, which was awesome.  Food was really good for the first few plates, but predictably quality went down for the last few plates. Can't blame them for that though.  We came here after we went to goyemon and the wait was 2 hours there... service was good and I'd recommend it. 26.95 for ayce."
        }, 
        {
            "index": 227, 
            "rating": 1, 
            "review": "WORST EVER!!!\n\nThis got to be my worst experience of AYCE sushi place ever in my life.\n\nThis place is own and run by Non-Japanese. \n\nSushi were terrible! Service were terrible! Prices are terrible!!!\n\nDon't go!!\n\nThere was seven of us that night. My friends was there first and told them that we wanted AYCE. I arrived 10 minutes later. We told them again. another 10 minutes later, we had to tell them one more times that we want AYCE. Finally 20 minutes later, this girl took the regular menu away and threw this paper to us and said \"just check mark next to the items we want\". \n\nOk, I guess it's self service.\n\nWe decided not to order too much sushi and everything we order was going to be 7 orders for each one of us. We gotten each order of sushi every 5 minutes. (You have to understand that one order of sushi is two bites, two bites every 5 minutes is annoying) \n\nHalf way through our orders, this rude younger girl came around again and asked us if we wanted anything else. We told her that we never got the rest of first round. She told us \"just wait\" and \"it's coming\". Ok....so we ordered a little more.\n\n10 minutes later, we got all of the second round(salmom, yellowtail, and eel for the second time), but still........ half of the first round was not here. \n\nMost of the first round items are the expensive items. Spider hand roll, sea urchin(uni), sweet shrimp , makerel (saba) and snow crab. \n\n10 minutes went by again, no first round. We asked and got the same answer. Then we decided to order shrimp tempura. And we got \"fried shrimp\". Very disappointing. The \"fried shrimp\" was breaded with PANKO. This is just unbelievable.\n\nAfter the shrimp disaster, we asked again about our first order. The rude girl finally tried to ask us what they were. By this time, it's almost one hour since we arrived. The kicker of the night is she elected to tell us that she is worried that we won't be able to finish and they are only going to give us the first round orders one at a time.\n\nThis is just MADNESS.\n\nAt the end, of course we did not get all of the food we want. We were too angry to deal with them, and we did not want them to spoil the night even futher. \n\nOf course they charged us mandatory 18% tip on the check after the sales tax. \n\nOf course the hot tea we have to beg for was not included. \n\nAnd of course nobody said \"thank you\" or \"goodbye\" to us after we just spent almost $40 a person for the wrost sushi ever."
        }, 
        {
            "index": 228, 
            "rating": 5, 
            "review": "Discovered this place with the absolute love of my life. Wonderful food and great customer service keeps us coming back!"
        }, 
        {
            "index": 229, 
            "rating": 4, 
            "review": "Went here the other night and it was so good. The only complaint is that I wanted strawberry tempura ice cream. They said they only had raspberry. Sounded good so I went with it. It had no taste of any fruit but only Chocolate. Other than that the sushi was on point and the staff amazing!"
        }, 
        {
            "index": 230, 
            "rating": 4, 
            "review": "This sushi restaurant has a wide variety of menu options. Their AYCE is only $21.95 for lunch!  Tasty rolls...try the Crunch Lobster baked roll, and the Green Valley!"
        }, 
        {
            "index": 231, 
            "rating": 4, 
            "review": "I met a friend for dinner here a few nights ago - some all you can eat and some Hockey on the provided TVs by the bar.  \n\nThe restaurant is nicely laid out.  The service is professional and well planned.  And the prices, with AYCE, are very decent.  The atmosphere was lively for a weeknight.\n\nThe popcorn lobster roll might just be the most beautiful thing I've found in a sushi bar in a very long time.  It will have me coming back for more of its delicious fried beautifulness.  I think this is something that this bar can call its own - that it has actually created something I'd never tasted before at a sushi bar.  And I think that says a fair amount. \n\nAlso, the fish was fresh and that is very, very important when you're looking to consume raw.  Good location and its definitely worth the walk in if you're in the mood for sushi."
        }, 
        {
            "index": 232, 
            "rating": 5, 
            "review": "I have been to a lot of sushi restaurant , but we dicided to try this place . Everything was so delicious . Friendly staff fast and efficient . For the price you pay for all you can eat is so worth it . So when in Vegas for sure to try sushi 21 and you won't be disappointed ."
        }, 
        {
            "index": 233, 
            "rating": 5, 
            "review": "AYCE sushi is probably the best i've had! Everything was really good. Service was great and they get your food to you quick!! They also deliver we discovered at work however not the AYCE. I recommend dine in of course but a nice perk.."
        }, 
        {
            "index": 234, 
            "rating": 5, 
            "review": "All you can eat sushi. In Las Vegas. \n\nI repeat. All you can eat. In Las Vegas. Sushi\n\nWhy wouldn't you come here??\n\nFood is delicious. And there's beer and there's 2 for one sake \n\nYou're still not there?\n\nWhat the hell are you doing"
        }, 
        {
            "index": 235, 
            "rating": 5, 
            "review": "Great service, great food! Rock n roll and orange blossom was a hit! We also ordered the screaming orgasm which lived up to its name! LOL"
        }, 
        {
            "index": 236, 
            "rating": 1, 
            "review": "Seems like this place has gotten a majority of their negative reviews very recently... \n\nWe ordered a teriyaki chicken dish, the middle pieces were literally raw... We show it the waiter, he agrees, takes the whole dish back. He comes back sometime later with the same dish with the same chicken cooked. The raw chicken was sitting on a bed of cabbage n he re-cooked the chicken and put it on the same used plate. Unbelievable! \n\nOtherwise none of the dishes were that great...\n\nWe ordered a \"Popcorn Lobster\"roll... It was almost $20 for this roll... Would be a fair price if we had actually gotten lobster, however, we got some nasty crawfish bites that were fried...\n\nOverall rating here should've negative 10 stars..."
        }, 
        {
            "index": 237, 
            "rating": 5, 
            "review": "First time here. All the food we ordered are bomb! Service is great. Staff are friendly. We are definitely coming back here"
        }, 
        {
            "index": 238, 
            "rating": 4, 
            "review": "We love coming to Sushi 21. Theyve remodeled inside, looks a little more fancy. Great service as always, wish they would stay open longer, since I get out late. Last call is 1:45am. But still, the fish is fresh and yummy."
        }, 
        {
            "index": 239, 
            "rating": 1, 
            "review": "My boyfriend and I love to check out new sushi spots and this place disappointed me starting off with the ice green tea (tasted over brewed)! We ordered 3 cut rolls and one of them came back as a hand roll. One of the rolls was drenched in sauce ( and there's nothing like a soggy roll). The second roll the fish did not seem fresh (my breath was kickin'). To top it off while finishing the last roll the chopsticks broke (not cool). \n\nNote: We were the only people there and our food took forever and maybe that's why our rolls were soggy. To add on the service was not that great either."
        }, 
        {
            "index": 240, 
            "rating": 5, 
            "review": "Big change!!! They have giant claim nigiri, fresh oysters, and big sweet shrimp!\n\nServer are friendly and welcoming. Be back soon~~~"
        }, 
        {
            "index": 241, 
            "rating": 5, 
            "review": "Wow this place is small and can be easily overlooked but it is a treasure! Friendly staff and delicious food!"
        }, 
        {
            "index": 242, 
            "rating": 5, 
            "review": "Sushi 21 is a great spot located centrally in las Vegas with friendly staff, great food and they are always running new and creative specials. For a sushi restaurant the prices are really good especially the lunch all you can eat menu. The restaurant is always clean and the service is phenomenal. Do yourself a favor and check it out for yourself. Two thumbs up for sure!"
        }, 
        {
            "index": 243, 
            "rating": 4, 
            "review": "I love sushi 21! Not only is it a great location, they offer great deals! Every 2 weeks they rotate their menu of....HALF PRICE ROLLS. Yes, full rolls, half price. We are talking  full size (8 piece) spicy tuna, philly, california rolls for $3! As well as some of the best seaweed salad & hot & sour soup around. They also do some kind of special on the weekends for FREE sake bombs! As well as being open until 3 am...Sushi 21 can not be touched by other sushi spots, especially not in Vegas."
        }, 
        {
            "index": 244, 
            "rating": 4, 
            "review": "Love these guys. We go here often. Almost every week. Kenny and John are pretty much the best people to sit at  the bar and have make your food. Kenny's always joking, and John loves to party!!\n\nWe always do the AYCE, and on fridays and saturdays they do free sake bombs! Err..well sometimes they forget but I'm not really gonna freak out about it, it's FREE. The table service is pretty inconsistent though. I have had AMAZING service (and make sure to let them know with a tip they did well) and then I've had some pretty awful service as well (sitting on an empty drink for 20 minutes, stacks of empty plates waiting to be taken away. I've even seen the chefs having to remind the waitresses to get the food and bring it to the table.) Soo....I gotta knock a star off for that. But I gotta say...as a loyal customer these guys treat us great. From random, \"Just try this, don't eat it if you don't like it\" rolls, to great recommendations on the AYCE menu. Never had a bad experience with the freshness or quality of the food sooo...not sure what some of the other reviews are talking about. :-\\\n\nAdvice? Be good to the chefs. If you take care of them, they'll take care of you."
        }, 
        {
            "index": 245, 
            "rating": 5, 
            "review": "I have been a fan of AYCE Sushi since I escaped Makino. I cannot speak bad about Makino seeing as that was the 1st place my best friend took me to that got me started enjoying it.  I will never go back because raw fish sitting out cannot be healthy!  Having said that, some people question these AYCE Sushi joints for the same thing, and I have seen some things that were not good. But I see things wrapped that aren't being used, food kept at excellent temperatures, and nothing is ever left out!  I have walked out of another place and left my stamp card behind to tell them I would NOT be returning. As a cabbie who actually cares about my riders,  and who happens to be a \"non-Strip\" food fanatic,  and who happens to be rather large,  I like taking guests to food havens and looking at the faces of full and happy customers.  21 does it very well. The fact that it's not in Chinatown makes it an easier drive (J/K). You can also have sashimi   at dinner.  BTW if you need a driver that 1. Speaks English 2. Is 100% Honest 100% of the time.  3. Has a personality and is funny.  4. Knows a lot about this crazy town (history and food. I may not know ALL the clubs because they change almost weekly ) 5. My #1 concern is the safety of my customers.  Both on the road and in situations where people get ripped off.  Vegas is a fun place but some people target good people who may make drunken choices.  Let me help you stay safe."
        }, 
        {
            "index": 246, 
            "rating": 4, 
            "review": "I've been here a few times. No matter what time I come here, it's never busy. I like that they have a lot of options and different types of sushi. Their baked lobster roll is heaven!  It's just soooooo good! The lobster on top of the cali roll with the sauce is just amazing!  They give you generous portions of fish on the sushi and the rolls are a good size too. I especially like that I can do half rolls!!  We don't ever eat there longer than an hour,  but I don't like that they have a time limit. It just makes me feel rushed. Some of the fish could be colder as well."
        }, 
        {
            "index": 247, 
            "rating": 5, 
            "review": "This is one of the best sushi places in vegas and for being New Years they are super quick and so damn fast! This is going to be my go to spot!"
        }, 
        {
            "index": 248, 
            "rating": 2, 
            "review": "Eh it wasn't the best. Based on the reviews I was hoping for a little better than I got. The only thing that was ok was my California roll. My edamame was mushy and the seaweed salad was meh. I doubt I will get food from here again."
        }, 
        {
            "index": 249, 
            "rating": 5, 
            "review": "We love everything we ordered here for our all you can eat dinner: albacore sashimi, salmon and tuna sashimi, oysters, garlic tuna, \"something wrong\" roll etc. The fishes are very fresh, the salmon cuts are thick. We will come back!"
        }, 
        {
            "index": 250, 
            "rating": 5, 
            "review": "This was a delightful place to happen upon!  I love sushi, especially salmon and yellow tail.  YUMM!  The rolls were great.  Everything was perfect.\nThe atmosphere was fun, the service EXCELLENT.  And the chef easy to work with and creative.  \n\nThank you Sushi 21!!!"
        }, 
        {
            "index": 251, 
            "rating": 4, 
            "review": "I order out from here at least once a week. Not the best sushi place I've ever eaten from, but still very delicious. I always get their Spicy Salmon Bowl and Hot and Sour Soup. Definitely worth trying out for anyone."
        }, 
        {
            "index": 252, 
            "rating": 4, 
            "review": "Came for AYCE and we got it!. GREAT ROLLS & GREAT SERVICE! Definitely coming again since it's down the road from our house especially!. THANKS SUSHI 21!."
        }, 
        {
            "index": 253, 
            "rating": 5, 
            "review": "The food is incredibly fresh and the service very attentive. Highly recommend. Best place I have been to in a while. Will definitely be back."
        }, 
        {
            "index": 254, 
            "rating": 5, 
            "review": "I live right up the street and they're rolls are so good, definitely my go to sushi spot. Who's your daddy and the spicy crabmeat rolls are amazing!!!!"
        }, 
        {
            "index": 255, 
            "rating": 5, 
            "review": "Best Sushi In Town, Baked Lobster and Im Your Mother Are Yummy. Its A Must Try Sushi Place"
        }, 
        {
            "index": 256, 
            "rating": 5, 
            "review": "Decided to visit a sushi spot in our new neighborhood and it was definitely the right decision. Great food, personable staff, great relaxed yet upbeat atmosphere! Actually all dishes were great! We let the chef surprise us and weren't disappointed! You must go?"
        }, 
        {
            "index": 257, 
            "rating": 5, 
            "review": "After reading some reviews on yelp, me and my wife gave this place a try. It was a great experience.  \nFoods. 4/5 \nWe had the Ayce, everything was very good, the only drawback was the sushi rice.  Normally sushi rice contained rice vinegar of some sort.   I couldn't taste it, either they didn't mix it in or with such a small amount.  Beside that it was great. \nServices 5/5 \nServices were awesome, friendly sushi chef, his name is Johnny.  Good server, attentive.\nOverall everything was good, we went for lunch, will be back for dinner in the future."
        }, 
        {
            "index": 258, 
            "rating": 5, 
            "review": "Our favorite sushi place in vegas! \n\nThey have an-all-you can eat option, but a-la-carte pricing is fine also.\n\nThey have bento boxes, the awesome deep-fried Las Vegas Roll, and are open late. \n \nThey have a projector playing Korean pop music for a night club ambience. \n\nAnd if you're a frequent customer they give you your own set of plastic chopsticks to use when you visit."
        }, 
        {
            "index": 259, 
            "rating": 3, 
            "review": "We showed up and the waited told us it was about a 20 min wait, so we sat down and waited. Then a group of people showed up and told the waiter they had a reservation and the waiter told them it would be about 15 mins... So I don't know if making a reservation here makes a difference or not... Either way... It was a busy night so getting our food took time in between servings. The staff is friendly and attentive and the place is really nice compared to other places I've been to. It's a small place but it feels comfortable and eating there is a delight! We had the AYCE sushi and the only disappointments were that the tiger roll, one of my favorite rolls was not on the AYCE menu and the regular ademame was very bland. You have a lot of options and even though the spicy garlic ademame is very different from other places, it was still a good treat.\nI would definitely come back to this place."
        }, 
        {
            "index": 260, 
            "rating": 4, 
            "review": "Found this place because Goyemon was too busy.  Happy I did.  Delicious food and good service. Would definitely come again since I was with ayce amateurs.  Lol."
        }, 
        {
            "index": 261, 
            "rating": 1, 
            "review": "I only came here because some friends of mine chose the sushi spot. I was not impressed at all. They overload the sushi with cream cheese and imitation crab, which over powered all the flavor. There was no creativity whatsoever in any of the rolls. It was just a bunch of variations of California rolls that are topped with different types of fish. When I pay all you can eat prices I don't want to get generic sushi. I could have just gone to 7/11 and got sushi to-go containers."
        }, 
        {
            "index": 262, 
            "rating": 3, 
            "review": "Came here after attempting to go to Goyemon only to be defeated by an hour+ wait. \n\nOk, overall - service was just ok despite there only being a couple of tables to wait on. The sushi menu is huge though, over 50 types of specialty rolls. We sampled the gyoza/edamame and both were quite good. I was lukewarm on my specialty roll - if it weren't swimming in ponzu I'd have probably liked it more. The spicy salmon roll was better, for me anyway.\n\nI'd come again to try some of their other funky rolls, but I wouldn't go out of my way to."
        }, 
        {
            "index": 263, 
            "rating": 5, 
            "review": "Just finished dinner at Sushi 21, it is hands down the ABSOLUTE BEST Sushi my wife and I have ever had. Better than any place in Maui, Hawaii where we went for our honeymoon.  You've gotta try it. The popcorn lobster roll and baked lobster roll are Divine! You will not be disappointed:)"
        }, 
        {
            "index": 264, 
            "rating": 1, 
            "review": "The sushi is not fresh and it was dry and very bad taste. Service was good. I have came here before and it is alway hit or miss, it was definitely a miss the last time."
        }, 
        {
            "index": 265, 
            "rating": 5, 
            "review": "In Las Vegas and i was looking for sushi for lunch and i found this place. It is one of the best all of you can eat sushi restaurants I've been to. And the service was fast."
        }, 
        {
            "index": 266, 
            "rating": 5, 
            "review": "My second time eating here I decided to try the all you can eat!  $25 and I ate more then I should have!  They say you can order as much as you want you just hate to eat it all!!!! Boy did I!  I am allergic to shellfish but wanted some of the rolls that had crab in it....they kindly took it out for me!  All you can eat came with appetizers, rolls and dessert!  The Mochi was so good!  Green Tea, chocolate, vanilla and coffee. They also had fried ice cream!  TO DIE FOR!  One of my favorite desserts!  The service was great, prompt and kind and explained everything to a T when we asked questions!  For the price I would go back any day!"
        }, 
        {
            "index": 267, 
            "rating": 5, 
            "review": "I drove by this place idk how many times and never stopped in here well tonight I decided to and WOW this place is a great little hole in the wall sushi place! Rolls are great size for the price the gyoza is amazing! My waitress was very nice and helpful. I will def be back and I live right down the street!"
        }, 
        {
            "index": 268, 
            "rating": 4, 
            "review": "This place is more authentic than you'd get in some other places. The rolls are good not amazing and same with the Nigiri and sashimi. However the guys behind the bar are so fun. Ask for Kenny because he will show you a great time! The food was good but the entertainment from the guys behind the bar was priceless."
        }, 
        {
            "index": 269, 
            "rating": 5, 
            "review": "Sushi is delicious!  Surprised that an AYCE could be this good. Small spot with a big selection. I live in cali but every time I come down to Vegas I make it a point to come here."
        }, 
        {
            "index": 270, 
            "rating": 4, 
            "review": "Service is great always accommodating our big group! Love the Kenny Roll, tried the Johnny no rice roll rolled with  cucumber omg sooo good! We have been here 3 times and each time the service got better, we had a birthday cake and forgot a knife they helped with that, they took pictures for us,  they speed or cake for us,  and all with a smile, rolls came out quick for a group of 15 we will be back for sure."
        }, 
        {
            "index": 271, 
            "rating": 5, 
            "review": "My first visit here, couldn't resist the all you can eat and oh man did I make the right decision! Every single roll I ordered was superb!! \n\nSuch friendly attentive and helpful servers too!! \n\nMost definitely my new fave spot!!"
        }, 
        {
            "index": 272, 
            "rating": 2, 
            "review": "My boss brought lunch two days in a row. Miso soup was great. He orded chicken dishes both time. The first day the I though the chicken was tough. the vegetables on both days were saturated in sauce. Dont think we'll be ordering from here again. However I will try the sushi one of these days."
        }, 
        {
            "index": 273, 
            "rating": 5, 
            "review": "Visiting Vegas from LA .. Was lucky enough to notice the lights on and it was late great  I checked out reviews and felt as though it was a safe chance to take.   I was very surprised at the options that they had available everything I wanted was included  I enjoyed meal more the I expected large menu with good selections for cooked and none cooked. The waitress where very attentive and nice as well as helped me with choosing .. I will have this in my bookmarks and will return on my next trip for sure !"
        }, 
        {
            "index": 274, 
            "rating": 5, 
            "review": "Really fast, really good, and friendly service :) everything tastes fresh. Will definitely be coming back. My top pick for AYCE!"
        }, 
        {
            "index": 275, 
            "rating": 4, 
            "review": "Came for lunch AYCE, price 21.95 (dinner 26.95). Take not that some items on the menu are only reserved for dinner. Fish was fresh, rolls were large & flavorful. If you are super sensitive to spicy items, make sure you tell them that you don't want anything spicy to include sauces on your selection. I ordered 2 items that didn't depict a hot flaming chile yet they were too spicy for me, lucky for me, my bf help me out. Even the baked rolls had an added kick that I had to inquire about so the next round didn't have it. \n\nEnjoy that appetizers come with & a dessert is an extra great bonus to top it off."
        }, 
        {
            "index": 276, 
            "rating": 5, 
            "review": "Love their food. Service is also good! I had the kamikaze and something wrong 69. I loved the kamikaze!! I'll for sure be back!!"
        }, 
        {
            "index": 277, 
            "rating": 3, 
            "review": "I ate here for lunch,\nI took the teriyaki chicken bento box\nI took white meat, the chicken was so so,too mushi.\nI took brown rice and the box comes with tempura vegetables and half a Philadelphia roll.\nNot sure if I'll take the chicken again, sushi seemed ok, I'll give the place one more chance.\nIn general great atmosphere and great service"
        }, 
        {
            "index": 278, 
            "rating": 1, 
            "review": "do not go to shushi 21 they will charge your card 2x and tell you to wait 1 week for their credit card to figure out the error !!!! \n\nim not rich so for them to just ignore the mistake they made really upsets me !!!\n\nthis restaurant was on dirty dining link is copied below. \n\n\nhttp://www.ktnv.com/news/dirty-dining/dirty-dining-thai-street-cafe-sushi-21-dollar-tree-and-more"
        }, 
        {
            "index": 279, 
            "rating": 1, 
            "review": "Cute and small. Nice and clean inside and modern.  I decided to get all you can eat sushi. Waiter was very nice and informative. I ordered uni sushi. The color of uni was brown with almost black edges. I'm used to mustard color uni.  It just didn't look appetizing at all. I asked the waiter to see if I can have little fresher uni. I was told that's all the uni they have. ???? Its a prime time for dinner and they don't have anymore uni???  I ended up sending it back. Very disappointed. I suppose its the sushi chef refused to change to fresher uni because wait staff was very nice. Having good customer service is just as important as having good foods. When I have bad customer service even good foods taste bad. \nThey charge for small white rice $1.75 and. Green tea is $1.50. Not included with all you can eat. Fish wasn't that fresh either. Very disappointed. Saw many good reviews for this place."
        }, 
        {
            "index": 280, 
            "rating": 5, 
            "review": "One of the best all you can eat places in Vegas. Every time we come here they never disappoint. The service is also amazing as well and everyone is always friendly."
        }, 
        {
            "index": 281, 
            "rating": 5, 
            "review": "Great place! The service was great. We had 8 people in our party & all fit nicely in their comfy booths. We didn't feel rushed or pressured. Amazing sushi! Highly recommend!"
        }, 
        {
            "index": 282, 
            "rating": 4, 
            "review": "Saw the menu looked fantastic, so we ordered All you can eat, then we were given the All you can eat, much less of a selection with the majority of the things I wanted not on it. The shrimp tempura roll had a pile of crunch and no avocado, not bad but different then every other place we go to. Everyone was very friendly."
        }, 
        {
            "index": 283, 
            "rating": 5, 
            "review": "Great place with good prices for the quality that you get. \n\nBeing that my husband and I came from a trip to Tokyo not that long ago it is the next best thing. In fact we came back the next day to eat more tuna nigiri and try their udon soups. It was as good as the first day.  If you want Japanese chef go to Japan where you might be surprised that not every sea urchin is fresh either.  One reviewer was taken by the sea urchin taste: when you are in the desert, what do you expect, a mini ocean in the back yard?\n\nQuality: fresh and what it should be. However they do not put wasabi right away in nigiri. Rice was warm and not hard, in a perfect proportion to the amount of fish.\n\nAtmosphere: it is not  a fancy restaurant but a pleasant one. Family, friends and dates  would feel comfortable there.\n\nPrice is fair for the quality provided."
        }, 
        {
            "index": 284, 
            "rating": 3, 
            "review": "Good place. Always order delivery. They are a little skimpy on sauces and they could pack it on ice like some other places. But overall decent"
        }, 
        {
            "index": 285, 
            "rating": 4, 
            "review": "Yelp didn't steer me wrong! The sushi was great! AYCE for $27 for dinner, well worth it. Good service as well!"
        }, 
        {
            "index": 286, 
            "rating": 5, 
            "review": "Wow! \n\nWe were down the street and were uninterested in a one hour wait so we pulled up Sushi 21 on the handy dandy Yelp app. \n\nThe food does not disappoint with a huge menu for appetizers, sushi, and rolls. \n\nThis place is definitely going to be my go-to spot from now on. \n\nSome standouts were the Cherry Blossom, Tropicana roll (BOMB), and Garlic Edamame. Please try the Fried Oreos for dessert. \n\nDon't be afraid to give them a try - this place is delicious! Sam, our server was amazing."
        }, 
        {
            "index": 287, 
            "rating": 2, 
            "review": "I definitely feel like this place has declined since my last visit. I think the higher star ratings were so that people could take advantage of the check in deal, 10% off the bill if you show them your review on Yelp. Seems a bit fishy (haha) if you ask me. \n\nThe reason why I came here was because I was craving a bento box. I chose the teriyaki chicken box and added a Japanese lasagna roll. The roll came out first, and it was meh. Japanese lasagna is my go-to roll at any sushi place. Many places fail to make it to my liking, this happened to be one of those places. Oh, before I go on, I ordered the iced green tea which sounded delicious and refreshing, but it tasted like fishy rice! Seriously, it tasted like a sushi roll. I thought I was trippin, but after a few sips I had to give it back. I quickly exchanged it for water and they told me they would take it off my tab which was nice. By the way my server was very nice and checked on me often, so I have no complaints about the service.\n\nAnyway the bento box is huge and you won't leave hungry. It comes with your entree (teriyaki chicken) with veggies, rice, 4 pieces of a California roll, salad, and veggie tempura. Everything was just okay, I didn't care for the dressing on the salad, and I didn't care for the teriyaki sauce that came with the chicken. I like the tempura veggies, zucchini and sweet potato, yum! And the Cali roll was pretty good also. I just don't see myself running back here anytime soon."
        }, 
        {
            "index": 288, 
            "rating": 5, 
            "review": "We enjoyed the AYCE sushi lunch very much! Excellent selection and very fast and friendly service. Our favorites were the Johnny, Yum Yum and Fire Fire (extra freaky spicy and delicious!)"
        }, 
        {
            "index": 289, 
            "rating": 4, 
            "review": "The service is pretty awesome and it's a legit chill place. Scenery is cool and the tunes def make the atmosphere."
        }, 
        {
            "index": 290, 
            "rating": 5, 
            "review": "We did the all you can eat dinner buffet for 26.95. We had about 5 or 6 different rolls, this place is great!  The all you can eat is a STEAL! It includes like 50 different rolls, appetizers, and dessert. It has your usual rolls but also house specials. The tempura ice cream is amazing and the sushi is wonderful. The service was also great. Trust me, missing out on this place would be a crisis for any sushi lover!!! I can't say enough good things about this place.  I will now need to be \"rolled\" out of here!"
        }, 
        {
            "index": 291, 
            "rating": 4, 
            "review": "The food at Sushi 21 was pretty much par for the course for AYCE sushi in Off-Strip Vegas.  Decent price, good quality sushi.  Similar to places like Sushi Mon and Geoymon which is just down the street.  We ended up going to Sushi 21 since Geoymon had over an 1 hour wait for our party of 8 which is way too long when you have places to go and people to see.  However, they didn't have oysters which was a real bummer since it was on the menu and something we expected to slurp on.  Lindsey was our server and I must say the service was excellent.  Very prompt and friendly.  Her excellent service made us miss the oysters a little less.  A potential for 5 stars if they had oysters."
        }, 
        {
            "index": 292, 
            "rating": 4, 
            "review": "inside a large strip mall towards the back stores...christmas lights hung around..kpop playing in the background...korean sushi restaurant...typical menu of bento, sushi and rolls...finding an ayce option of $21.95 lunch and $26.95 dinner...not necessary unless training for ifoce...portions are large and filling...taking the sushi combo b with choice of 3 fish $14.95...tempura, soup and salad included....standard miso soup good...nice sized bowl of salad in sweet and tangy dressing...vegetable tempura was excellent...light batter, crispy and sweet dipping sauce was delicious...selecting tuna, yellowtail and red snapper for the 3 choices...coming in pairs to make it 6 pieces...traditional sizing and presentation...not overly large and just a perfect bite...very good...4 pieces of california roll included too...rolled too tight, but good looking...sushi rice was bit dry and lacking...overall a good dinner under $20..."
        }, 
        {
            "index": 293, 
            "rating": 5, 
            "review": "They have the best dynamite in town, and their selection of rolls is a great variety. If you are a fan of mushrooms, you must try the Monkey Balls! The service is attentive. I have been to many AYCE sushi restaurants where you have to wait for a long time for the server to come. Drinks are never empty, and plates are cleared quickly. You also don't have to wait for your rolls, which is another bonus. I definitely recommend coming here. I keep coming back because they are so fantastic."
        }, 
        {
            "index": 294, 
            "rating": 3, 
            "review": "I love the quiet atmosphere here and how they would play kpop in the background (I think it was kpop). The servers are also nice and welcoming and they would sometimes talk to you while you wait for your takeout. Took 2 stars off because the quality of my sushi... it wasn't that great. The rice were falling off or the seaweed would fall apart. It was hard for me to eat so I had to use my hand instead of my chopsticks. I hope that doesn't happen again when I come back. Overall, I love the customer service and how the place is designed!"
        }, 
        {
            "index": 295, 
            "rating": 1, 
            "review": "Although the sushi rolls tasted great the service was less than spectacular, felt like we where a burden to the servers by having to ask for more water or to order more food, there was no constant checkins to see how we were doing."
        }, 
        {
            "index": 296, 
            "rating": 5, 
            "review": "Always great sushi and service! Plus 10% off when you check in! Really fresh and yummy fish too!"
        }, 
        {
            "index": 297, 
            "rating": 5, 
            "review": "Love this place!! AYCE was great tons of choice!!! Tried their bento box too for Bulgogi and it was good! They do half order sushi on AYCE but only 2 orders of those per person. I would come back again:)"
        }, 
        {
            "index": 298, 
            "rating": 5, 
            "review": "Visited the city for half marathon. The AYCE is worth it's price. the shrimp tempera is really good and we ordered three times. Will visit again for the next escape."
        }, 
        {
            "index": 299, 
            "rating": 5, 
            "review": "awesome place....!! so delicious! ! all you can it..! and very kindness service welcome everyone!!"
        }, 
        {
            "index": 300, 
            "rating": 5, 
            "review": "Ayce sushi for $22 lunch you can beat it, great service good sushi better than most of the sushi in buffets on the vegas trip I'm definitely coming back here!!!"
        }, 
        {
            "index": 301, 
            "rating": 5, 
            "review": "I like the delicious sushi here!!!!!\nVery clean and nice place.\nThank you\nIll come back."
        }, 
        {
            "index": 302, 
            "rating": 4, 
            "review": "I came here with my co worker before work at 5pm and we were starving. We sat at the bar and I got AYCE and my friend just got a sushi roll. The waitress gave us the menu and I put in a first order of a roll in their menu. The guy behind the bar just stared at me and said okay. He has another chef make it, Johnny, and when he hands it to me he said its not included in AYCE. I looked at the other guy and said \"I wish someone had told me.\" But I said I'll take the charge. \nIn my sushi rolls I like cream cheese, avacado, salmon or yellowtail. Our new chef now, Johnny, asked me what I like and I told him. He surprised us with sushi rolls and this roll with mushrooms and cream cheese and they were all really good! His great customer service made up for everything. And when we got our bill he had told the waitress to take that roll off that wasn't included on AYCE. \nI will only come back now because of his great customer service and the rolls are amazing."
        }, 
        {
            "index": 303, 
            "rating": 2, 
            "review": "This is one of the only AYCE places in town that give a discount if your kids are partaking in the AYCE experience too. We appreciate this and because of it, we've been coming back here.\n\nOver the last few months,  though, quality and service has steadily declined. As such, tonight may have been the last time we dine at Sushi 21. \n\nIt took us 10mins before I could flag down the two waiters working the near empty restaurant. I think they must've felt bad because after I got their attention, it was relatively smooth.\n\nDespite the service, I would be okay with the place if their food was something to write home about. This isn't the case. Fresh oysters were served at room temp; literally almost every piece of nigiri sushi was on top of a piece of lemon; the rice either had too much sushi su or something like yuzu. Almost seemed like they were hiding bad fish quality.  Even the cooked foods like the mini beef steak was off somehow. Best I can describe it the meat had a strange consistency with a slightly sour taste.\n\nTo top off this great dining experience, half the kitchen staff blanketed the entrance with cigarette smoke when we left.  I could've opened up my mouth to mask all the citrus I ate at dinner."
        }, 
        {
            "index": 304, 
            "rating": 4, 
            "review": "I'm big fan of this restaurant. This is definitely worth the trip off the strip if you are looking for sushi."
        }, 
        {
            "index": 305, 
            "rating": 5, 
            "review": "Really good sushi,  always fresh, & delicious! They have some of the most creative rolls and salads I've had.  The Popcorn Lobster roll and the salmon skin salad are my top 2 here.  Service is prompt and always friendly, also very good when your curious about a roll. The restrooms are Always clean and the restaurant ambiance is tranquil yet modern.  I know many don't put this in reviews but it's important to me.  This place is in my top 3 places for the best sushi, and I'm that one type of pickey person when it comes to my raw fish (sushi)"
        }, 
        {
            "index": 306, 
            "rating": 2, 
            "review": "Staff was friendly, but food was not all that great. Went in for the AYCE and the let me just say ice had better sushi. I went in because a friend of mine told me it was good, and came out regretting it. I'll stick to my regular sushi spot on Arvill and Flamingo... Never coming back here again, even though I live down the street. Not worth it. I don't recommend."
        }, 
        {
            "index": 307, 
            "rating": 5, 
            "review": "Great sushi! Our waitress was great and very friendly. We sat up at the sushi bar and I was thoroughly entertained watching the chefs make our dinner. All You Can Eat was ideal for my fiancé and brother cause they destroyed about 10 rolls!"
        }, 
        {
            "index": 308, 
            "rating": 4, 
            "review": "Went today for lunch. Ordered an assortment of sashimi, hand rolls and special rolls. The quality was excellent. The salmon skin hand roll was probably one of the best I've had. Something to note: their spicy tuna is actually spicy! Not like most other places where it's a gelatenous orange premaid clump. Sashimi portions were generous and very tasty. I had mackeral, octopus and salmon. All were excellent. Best of all was their iced green tea. They use gunpowder green tea which is very flavorful and not cheap tea leaves.\nI spent $102 for lunch for two people which obviously isn't cheap but I'm expensing it on the company so I didn't really care about price!\nThe cost is the only reason it didn't get 5 stars as it's not a great value. I wish they offered an all you can eat option to keep the expense down."
        }, 
        {
            "index": 309, 
            "rating": 1, 
            "review": "I used to come here before and I remember I was enjoying this place. Now I was close so my friend told me let's go to sushi 21.... It was the worst sushi ever. I order roll that's not to be spicy and it was very spicy. Also my order stayed 20 min on the bar waiting for the waiter to bring it to our table. Worst service ever."
        }, 
        {
            "index": 310, 
            "rating": 5, 
            "review": "I absolutely love this place. Everytime I'm craving sushi, I come to Sushi 21. If you come here often- you can request your own chopsticks, they put your name on them and wash them when you're done for your next visit. For the perfect AYCE dinner price of $27 you really can't go wrong here! Highly recommend you try it- at least once!"
        }, 
        {
            "index": 311, 
            "rating": 3, 
            "review": "Did not have a good experience at this restaurant.....after sitting down, ordering and receiving our food, we never received chopsticks or napkins. The towels they gave us were dirty and I wish they gave us napkins instead. The counter tops smelled liked dirty rags and we're extremely sticky, made me feel like the place was a bit unsanitary. While I was eating, there was a spider crawling around my table and freaked me out, making me lose my appetite. For appetizer, the Miso Soup is not too bad and the Golden Spoon is an interesting dish to try, but the Garden Salad was so tasteless and the greens weren't fresh. The raw sushi was decent in quality and freshness, my only critique is that the fish on nigiri was sliced too thin so it didn't satisfy me. The Ami Ebi (Sweet Shrimp) was actual really big in size compared to other restaurants and they at least serve Giant Clam, which many sushi restaurants having been serving lately. The Fresh Water Eel (Unagi) Nigiri was not made well, it was extremely cold when it's supposed to be warm, it was drenched in eel sauce, and there was a lot of rice. There were three people doing sushi at the bar and the sushi that came from the main chef was more impressive than the sushi made by the other two chefs who looked like young teenagers. At the end of my meal, I got to have Mochi Ice Cream which at least didn't disappoint me and actually satisfied my taste buds. I was not impressed by this restaurant, it was not worth the $26.99 for AYCE. The restaurant looks nice but the quality of food didn't live up to the name."
        }, 
        {
            "index": 312, 
            "rating": 4, 
            "review": "We've been here a few times now and are very happy, friendly service, good choices on food, and prices reasonable. Plus we get to watch the cutest music videos while we enjoy dinner. Beware my man asked for hotter sauce and they hooked him up. Don't go above a 5 on hotness lol  I think this place is just as good as Goyemon if not better. We Love it yummy!"
        }, 
        {
            "index": 313, 
            "rating": 5, 
            "review": "Great sushi great prices!!\nBuy 1 get 1 sake\nNot sure if that's a good or bad thing lol"
        }, 
        {
            "index": 314, 
            "rating": 1, 
            "review": "Probably the worst sushi place I've been to in Vegas we probably ordered like 8 different rolls and everything they brought us was crab mix with avocado and eel sauce on top ? Every roll ! And they were really rude, terrible customer service I will never go back especially when goyemon is right down the street and way better."
        }, 
        {
            "index": 315, 
            "rating": 5, 
            "review": "This place was AMAZING! It may even be a new favourite for me in terms of AYCE on the West Side (I live in Green Valley area) because the quality is phenomenal without overdoing it on the rice side.\n\nI always started out with seaweed salad and edamame. The salad was on the small side in terms of portion, but very sweet and delectable flavour so it did compensate. It leaves room for much more anyway! The edamame came out steaming which is great because nothing is worse than cold edamame as it tends to drop in temperature rapidly anyway.\n\nTheir menu has very unique items compared to most AYCE places. I tried the Screaming O Salad, which was three pieces of seared tuna with the sauce slathered over cabbage and lettuce. At first I expected it to taste bland due to the lack of colour but it was actually a very similar sauce compared to Ohjah's, which is a more expensive a la carte bistro in Summerlin- my only point of reference really. This was very close, and quite enjoyable for trying something new.\n\nTheir nigiri was just as comparable in quality to my favourite Henderson spot Sushiwa. The fish itself was a little smaller but at least not coupled with a snowball of rice and leaving you to order more. The salmon and tuna were both moist with flavour and I enjoyed the Pepper-Seared and Super White- both hit me with that va va voom melting effect.\n\nBUT if you want melting- then you WANT to ordered their baked rolls. I suggest a half-roll so that you don't have to be wheeled out of the joint, and it works if you're sharing so that you can try more. The two rolls that blew my mind were the Baked Salmon and Baked Lobster. Absolutely delectable, especially Lobster for me. \n\nAt this point, if you're still open to another order before getting dessert, I suggest another half-roll of something fresh like Philadelphia per my friend's suggestion or perhaps another simple roll. \n\nDespite bikini season approaching quite quickly, I knew I needed to experience their Deep-Fried Oreo. It was the first I'd seen in the desserts section of an AYCE before and it came out with a beautiful dollop of whipped cream, rainbow sprinkles, and deep fried chocolate. My waistline was happy it was only the size of 2 oreo cookies but my stomach was a little sad not to have more because the rich chocolate complemented the entire meal. Don't expect it to be creamy like the cookie though, and it's no complaint from me because I have a slight allergic reaction to anything too thick or frosty hitting my throat (no innuendo pun intended).\n\nWILL DEFINITELY BE HERE AGAIN! :)"
        }, 
        {
            "index": 316, 
            "rating": 4, 
            "review": "We we're going to go down the street but didn't want to wait an hour so we opted for Sushi 21. I was pleasantly surprised by the quality and taste. No wait, atmosphere was nice and sake was buy one, get one 50% off! Not bad at all."
        }, 
        {
            "index": 317, 
            "rating": 1, 
            "review": "Used to love this place until last night. I called before heading over to the complete opposite end of town, guy who answered said they served all you can eat up to 130-2am. So we drive all the way over there only to be told 1) I didn't really call there (the rude guy at door even made me show him my phone that I called there) and 2) they only serve take out. It was 138am. Guy was so damn rude, they have lost a few customers in me and my friends. I'll never be back. Don't say one thing and do differently when you have customers. There were two of us, we knew what we wanted before we sat down because we frequent this place.... never again will I step foot into this place or recommend it to ANYONE! Learn a little thing about customer service .. Rude a&& service!!"
        }, 
        {
            "index": 318, 
            "rating": 4, 
            "review": "The no rice rolls were pretty good! It was hard to grab though. The fish to rice ratio was also pretty good. We got here pretty late and the fish was still surprisingly fresh for 1am. The rolls were the highlight of the meal. We enjoyed all of the rolls we ordered. They were well presented and well made. We happened to order a lot of food and all of it came really fast. The waitresses were helpful when we asked what we're in the rolls and such. There is a lot of interesting things on the menu that we didn't get to try. Would recommend this place."
        }, 
        {
            "index": 319, 
            "rating": 4, 
            "review": "Yummmmmmm it was really good! First time for me boyfriend, great place to go for his first time. Very friendly staff !"
        }, 
        {
            "index": 320, 
            "rating": 5, 
            "review": "It's my first time to this sushi spot.  I had the \"all you can eat, dinner portion\"  \n\nThe servers were very helpful and attentive.  It's a little more but so worth it.    The sushi has been amazing!   I've eaten at other spots but this place has more choices on the menu.  Definitely will come back again."
        }, 
        {
            "index": 321, 
            "rating": 5, 
            "review": "Great spot for all you can eat. My go to sushi place in vegas. Staff super friendly, food tastes great."
        }, 
        {
            "index": 322, 
            "rating": 3, 
            "review": "At first, I'm so excited to try the new sushi restaurant. But when I put my butt into the chair. Boot not comfortable. Sushi meat is too thin and I can feel that it not fresh."
        }, 
        {
            "index": 323, 
            "rating": 5, 
            "review": "Great place for a lunch special near the strip! \nCame here after the gym and had their lunch sushi combo A special which comes with miso soup, salad, 4 pcs Cali roll and 4 pcs of your choice plus tempura!\nGreat customer service and no problems with parking."
        }, 
        {
            "index": 324, 
            "rating": 4, 
            "review": "Food was good, loved the mussels and sushi had a good fish to rice ratio. I like how it's a pretty big place so hardly have to wait for a table. Good ayce deal!! And 10% off with yelp checkin"
        }, 
        {
            "index": 325, 
            "rating": 4, 
            "review": "I love this place, I had my first sushi experience here & I was hooked ever since. I love the friendly staff and how well they treat their costumers. The only thing I'm not crazy about is their spicy adamame. It taste so bad & lacked flavor if they made any changes to that this place would be perfect . Other than that I love it."
        }, 
        {
            "index": 326, 
            "rating": 4, 
            "review": "I don't know whether the four stars is for the food, the service, or the bottle of soju that I drank by myself.  They were out of a few of the drinks that I wanted to try so I had to \"settle\" for a bottle of soju.  The waiter, a little astonished by the severity of my alcohol tolerence, i guess, made hand gestures to demonstrate the size of the bottle.  Having played this game before, I quickly smiled and blushed like an anime character and threw up the thumbs up sign, with both hands. The waiter quickly understood and I thought that I heard him proudly tell another waiter as he walked away, \" Errr, ohh thats a Meesta Amerika, Meesta Uuu Ess Aye!\" But that might have been the soju talking or maybe racism.  \nAnyway, the nigiri, which is always my favorite was acceptable.  It came out fast and I did not have to wait.  I had almost everything and all seemed reasonably fresh.  I had to order the AYCE dinner to get the uni, and as always in vegas it is never orange; it's always a little on the brown side, but it was delicious.\nWhat really gives this place four stars, at least for me, was the amount of made up quasi japanese fusion shit that is on their menu.  I had a japanese burrito.  It is basically like a california roll wrapped in a tortilla and deep fried.  I also had a monkey ball, which was like pork and california roll ingredients, breaded, sauced and deep fried.  It was weirdly awesome.\nReally, the little things on their menu, like crawfish, golden spoon, dynamite, the above and all the other things makes their AYCE well worth it.  I tried sooooo many things and was quite pleased by the end of the meal.\n\n\nOh Wait!!!\nTempura Oreo!!!!!! \nYeah, I did it, the only down fall was the canned whip cream that accompanied it.  But still, I had a deep fried oreo.  Was it all that tasty?  Any tastier than a non deep fried oreo?  Not really.  But sometimes it's just about the absurdity of the decadence.\nKanpai"
        }, 
        {
            "index": 327, 
            "rating": 3, 
            "review": "not bad...\nwide variety of American Specialty Sushi....\nit was really good...\nthe \"all you can eat\" is the best bet to get the most bang for your buck."
        }, 
        {
            "index": 328, 
            "rating": 4, 
            "review": "I enjoyed myself here. The food was pretty tasty; portions are excellent. Come here when you are SUPER hungry so you can get your money's worth for the  \"all you can eat\" :)"
        }, 
        {
            "index": 329, 
            "rating": 4, 
            "review": "Great, fast service. The AJ tuna and Cajun Albacore sashimi were really yummy. Dinner all you can eat is $26.95, a pretty good deal for all you can eat. The shrimp tempura was really yummy and fresh. Lots of varieties and great presentation"
        }, 
        {
            "index": 330, 
            "rating": 5, 
            "review": "Great place! They offer more eel than most places in town and have even better prices."
        }, 
        {
            "index": 331, 
            "rating": 5, 
            "review": "Second time I have been to Sushi 21 and another great experience. We came in and were told there was an hour wait but some tables were leaving and the got us right in. They're very accommodating (we have 2 small kids that come with us) and they make us feel so comfortable. Hip environment and friendly staff. But excellent sushi! If you are in the area and in the mood for some fish definitely stop by!"
        }, 
        {
            "index": 332, 
            "rating": 5, 
            "review": "Great service, knowledgable staff--wonderful food. Food came fast. And the music videos in the background were awesome. We'll come again! \n\nWish there was 6 stars to select."
        }, 
        {
            "index": 333, 
            "rating": 5, 
            "review": "We have been coming here for years and ALWAYS have wonderful food and wonderful service. Sushi 21 is always on our \"must stop\" list for our Vegas trips. The all you can eat sushi bar drew us in. We have come for dinner and lunch. The restaurant is always clean. \n\nOn our most recent trip my husband and I had lunch (not all you can eat). We each had a roll, which as always thrilled and delighted. Edemame was food (nothing to rave about, nothing wrong with it either). This time we both ordered the wonton soup....WOW. Literally the best I've ever had in my LIFE. What a gem. Can't wait to go back and have the wonton soup again."
        }, 
        {
            "index": 334, 
            "rating": 5, 
            "review": "AMAZING!!!! 5/5 stars!!!! excellent customer service. they even gave us a free roll!!! they have cute k pop music in the background. try the deep fried oreo dessert special!!!"
        }, 
        {
            "index": 335, 
            "rating": 5, 
            "review": "There aren't many spots in Las Vegas that offers fantastic food, quality entertainment and wonderful service! I went with a group of 8 people and our waitress was the best at serving us. The Korean music videos make the place have a pleasant atmosphere to be at. Whenever you get the chance order the pitcher of sangria! You'll get you money's worth unlike other places!"
        }, 
        {
            "index": 336, 
            "rating": 3, 
            "review": "Really friendly service. Good sushi. Drove 30 minutes for this place. Came here with the fam bam and they kept the sushi coming. Nothing was bad at all. I've had better"
        }, 
        {
            "index": 337, 
            "rating": 5, 
            "review": "We come here at least once a month! The lunch is a great price and dinner is always fun with a large group! Service is quick. They are very kind and attentive. Went here for many family birthdays! Definitely recommend for anyone who loves AYCE."
        }, 
        {
            "index": 338, 
            "rating": 5, 
            "review": "Great sushi place I will definitely be back. I have food allergies and they were extremely helpful with making sure I didn't get sick. Yuki rocks!!!"
        }, 
        {
            "index": 339, 
            "rating": 5, 
            "review": "Friendly service, awesome sushi. Definitely a great choice for sushi in Las Vegas! The sushi chefs were very nice, accommodating and had great senses of humor. A+++"
        }, 
        {
            "index": 340, 
            "rating": 5, 
            "review": "It's so yummy! Love how they have sake sangria and they cater to vegetarians ! I come here all the time with my friends ! They are open till 230am witch is amazing for Las Vegas! They have great service hey get your order out so quick! Will always be here !"
        }, 
        {
            "index": 341, 
            "rating": 5, 
            "review": "Yummy food attentive service nice atmosphere will definitely come back all you can eat sushi was really yummy !"
        }, 
        {
            "index": 342, 
            "rating": 5, 
            "review": "Best sushi in town, awesome service and delicious deserts, i recommend you to try the touchdown, and the baked lobster it is to die for."
        }, 
        {
            "index": 343, 
            "rating": 1, 
            "review": "Not good.  Shrimp tempura tasted terrible.  Orange chicken tasted stale, very stale.  Literally nothing tasted like it should.  Later found out it is a Korean owned sushi restaurant.  Nothing against Koreans but this place is awful.  Leave sushi to the Japanese.\n\nIf you have ever had any sushi in your life don't come here.  If you have never had any sushi before don't come here as it will ruin your idea of what it should actually taste like.\n\nDid i mention the service was atrocious?  Then since there were 5 of us this terrible service was forcibly rewarded with an automatic 18% gratuity.\n\nHeed the warnings of the low reviews.\n\nAvoid this place like the plague."
        }, 
        {
            "index": 344, 
            "rating": 5, 
            "review": "As soon as we walked in we got great service. We got seated and served right away. The Chicken Teriyaki Bento was delicious. The portion of food was good enough to fill up the tummy and the price was reasonable. I will definitely come back again."
        }, 
        {
            "index": 345, 
            "rating": 3, 
            "review": "I'll star by saying as soon as I got out of the car the bums started asking me for money. As for the restaurant the place is ok as is the sushi it's not the greatest but not the worst. \n\nWith so many other sushi places in town I don't think I would go back due to the fact of the location and again the sushi was ok."
        }, 
        {
            "index": 346, 
            "rating": 5, 
            "review": "We came to try the All You Can Eat Sushi. We have tried it at other sushi bars & weren't happy but Sushi 21 has such a huge menu to choose from that you can try tons of items. \n\nWe had salmon, yellowtail, red snapper and sweet shrimp nigiri. They were a perfect size for a big bite. We had fish, shrimp & vegetable tempuras, miso soup, cucumber salad, tuna poki. Udon baked green mussels and baked Lobster roll. \n\nFavorites were the cucumber salad, fish tempura (yum), sweet shrimp, baked green mussel (sauce is great), and baked lobster roll. \n\nThe coolest thing is they have half rolls so you can try many things without being stuffed! Ok, we were super stuffed but enjoyed every bite and had ice cream to finish off. I had red bean ice cream and hubby had the tempura ice cream. Both were a great way to end a meal!\n\nThe sushi staff and servers were friendly and greeted us as we entered-very welcoming. We will definitely be back again!"
        }, 
        {
            "index": 347, 
            "rating": 4, 
            "review": "Just had dinner at Sushi 21 and totally enjoyed this neighborhood spot! The waitresses were very helpful and as sweet as can be. The sashimi was so fresh and tasty , your taste buds exploded with delight.  The Rolls were extremely generous and the complimenting ingredients were amazing.\nThe crunchy lobster roll was superb , the sushi 21 roll was well worth ordering and than remembering to order it at your next visit.  We will be back next Vegas trip!!"
        }, 
        {
            "index": 348, 
            "rating": 2, 
            "review": "The only reason this place is getting two stars, is because the food didn't take forever to come out. So that was nice. Besides that, however, everything else was mediocre at best. The servers couldn't remember the names of the rolls. The food was nothing special. Not a lot of flavor besides the soy sauce and wasabi I used. \n\nI got the baked scallops, and as a baked scallops lover, I was extremely disappointed. For some reason, they shredded the scallops. I've never seen that before. Not to mention, it tasted more like crab meat than it did scallops. When I asked, the chef told me that it was a different recipe so they shred the scallops and that it was \"in there\". Probably means they had it in a mix. \n\nI really don't understand how this place had such good reviews."
        }, 
        {
            "index": 349, 
            "rating": 5, 
            "review": "When me and my wife feel the need for some sushi this is the place we go to. The service is real good and the food is great. If you ever go try the pop corn lobster roll."
        }, 
        {
            "index": 350, 
            "rating": 1, 
            "review": "Good afternoon,\n\nI have lived 2 blocks from Sushi21 for 10 years, and it has been my local restaurant. I have taken family and friends over the years and most have become regulars. \n\nFor me that ended 2 days ago.\n\nI was there with a friend, he has been going to Sushi21 for 5 years. We both order the \"All You Can Eat\" as it usually saves us a few dollars. My friend ordered a roll he couldn't eat, they charged him $10 on top of his AYCE price. \n\nNow I am not one of those people who expects discount because I have been going for years. I am however one of the people who continues to be loyal if the service is right and the food continues to be good.\n\nThis reflects a downgrade in service to me, and over the last 2 years the food has been going down. \n\nExample: there have been dishes that where supposed to be served hot that came to our table, well chilly... Normally the waitresses would have your green tea filled without you even having to ask. Lately you have to constantly remind them.\n\nI started going there as it was close, I kept going there for the service, food and value. \n\nNow they have none.... Can't see going back, my friend either.\n\n2 local customers lost."
        }, 
        {
            "index": 351, 
            "rating": 4, 
            "review": "Spent a week in Vegas and were all over the place - our last evening there we wanted to relax a bit so decided to come here based on Yelp reviews and its proximity to where we were staying.  \n\nThis place is awesome.  \n\nFresh fish, imaginative menu items, and friendly service.  A totally solid, surprisingly high quality spot to get FRESH sushi in the middle of the desert - at a REASONABLE price!  ;)\n\nThe ONLY reason I had to give it 4 stars instead of 5 was because the menus and table were kinda grimy/sticky.  Not really dirty - just seemed like maybe the sanitizer solution was a little old or heavy when the tables and menus were wiped so they weren't dry and were getting a little filmy.  I would only take half a star off for it if I could - it was a little ambiance lowering and kind of made me leery about how the food would be - but it was great!  \n\nWould definitely want to come back on a return trip to Vegas."
        }, 
        {
            "index": 352, 
            "rating": 4, 
            "review": "I don't like sushi, but my wife loves it. So i came here. I went to another sushi restaurant down the street but it was way too packed. So we came here with help from yelp, and I am glad we did. There wasn't many people at all. This place is a hidden gem. Service was great. I had teriyaki chicken and rice and i loved it. I am very picky and reserved when it comes to Asian food, but this place was good. I dug in and cleaned the plate. My wife liked her sushi and the price was right. Glad we went here instead of the other place."
        }, 
        {
            "index": 353, 
            "rating": 5, 
            "review": "I really miss sushi 21! I used to go to sushi 21 to have a time with my friends and family and i remember that they had a sake bomb which serves free beer with sake! And sushi man usually sing a song for shots!! I was so excited to do it! Foods are great quality and their spicy tuna hand roll is awesome!! \nStaffs are really nice and friendly! Love this place and if I visit in Las Vags, I will definately go this location!!!"
        }, 
        {
            "index": 354, 
            "rating": 2, 
            "review": "Gave this place a try because Goyeman was extremely busy. Had the all you can eat sushi for $27. Menu contained an extensive selection of appetizers/sushi.  Great presentation and portions were generous. \n\n However, we walked away extremely disappointed with our dining experience because the sushi consistently tasted like premade sushi that you find in the refrigerated section at the convenience store. \n\nThe quality and temperature of the rice is the reason for the 2 star rating. The rice was cold and hard in every dish ordered...hand roll, nigiri, specialty roll, and crispy rice/spicy tuna."
        }, 
        {
            "index": 355, 
            "rating": 5, 
            "review": "My wife and I decided to go to Sushi 21 for lunch as always the food was great the hostess met us with a  smile her name is Betty she makes you feel so comfortable and you walk through the door she makes you feel like she's part of your family it is a pleasure to be served by her thank you Sushi 21 for hiring great people Betty is the best wish that other restaurants wood  hire people with of the same caliber"
        }, 
        {
            "index": 356, 
            "rating": 5, 
            "review": "Great food & service. They had our rolls done super fast & we had a great time. I would highly recommend the deep fried Oreo for dessert , it tasted phenomenal"
        }, 
        {
            "index": 357, 
            "rating": 4, 
            "review": "Great service... I was asking for a specific roll that they didn't have and they still tried to put everything together so I could have a great experience regardless. \n\nThe taste on their roll selection was great, fresh and very well crafted. The only part that I would like to see a change in is that they should start serving half rolls. That gives a much better experience to the \"all you can eaters\" and that it's a big deal for me. The more I can taste, and the better experience I have, the more likely I am to return and become a regular. \n\nKeep it up and please start serving half rolls!"
        }, 
        {
            "index": 358, 
            "rating": 4, 
            "review": "So Good! Best Baked Scallop roll I've had in Vegas! The portions were really generous and the sushi was really fresh tasting. We chose to order a la carte but the all you can eat option is good, although the rolls available are limited. All of the eel rolls are great as well"
        }, 
        {
            "index": 359, 
            "rating": 5, 
            "review": "The service was great and the place was well decorated and very trendy!! I love the all you can eat sushi so brilliant!!!"
        }, 
        {
            "index": 360, 
            "rating": 5, 
            "review": "Excellent value, exceptional quality. Absolutely the best AYCE sushi in Las Vegas. We've tried the others, but nothing compares to S21!"
        }, 
        {
            "index": 361, 
            "rating": 5, 
            "review": "First time here did AYCE sushi was good fresh and service was fast accurate we ate alot of apps and nigiris which is wat we usually eat in ayce sushi joints only anhalf a mile away from goyemon but no lines! We'll be back!"
        }, 
        {
            "index": 362, 
            "rating": 5, 
            "review": "Our first time at sushi 21 and it was a great experience! Our server Jaden was really helpful and very friendly. Everything we ordered was delicious!"
        }, 
        {
            "index": 363, 
            "rating": 5, 
            "review": "Great food and atmosphere. I like how they do not put too much rice in their sushi. They have some korean dishes in their menu, not only Japanese sushi."
        }, 
        {
            "index": 364, 
            "rating": 5, 
            "review": "Very good ! Good music good food and sake, will definitely be coming back. Baked lobster is my favorite and their plum wine is fantastic!"
        }, 
        {
            "index": 365, 
            "rating": 4, 
            "review": "You'll have to go a ways off the strip to find this little gem in the city that never sleeps.  \n\nWith over 70 awesome rolls to choose from, you know you gotta go AYCE (and I did).\n\nNow, when going AYCE I typically stay away from appetizers.  DO NOT make that mistake by skipping the apps here!  The Dynamite appetizer is a soupy taste of the sea you just have to try.  Little bits of sea creatures in an onion, corn and mushroom soup make this funky bowl of sea goodness something you gotta try.  Second on the \"gotta do\" is the \"cherry blossom\" app: spring mix salad with a ball of avocado slices stuffed with spicy soft shell crab) and a sweet eel sauce.  It's an extremely good way to start the meal.  Oh, and I'll let you experience the \"Screaming Orgasm\" appetizer for yourself (trust me, you'll thank me for allowing you to do so).\n\nRolls you gotta do: popcorn lobster, fire fire and kiss of fire (I like hot and spicy, and the hottest on the menu is the \"fire fire\").  But look, you really can't go wrong with anything here. From the \"plain\" to the special stuff, it all tastes great!\n\nI ate til I almost exploded. Add in the AYCD(rink) option and you're in for quite the night. \n\nLas Vegas is no exception to the rule that the best food is found in places you're willing to seek out."
        }, 
        {
            "index": 366, 
            "rating": 5, 
            "review": "Wow!  So delicious. Maybe we ordered too much, but that is ok. Excellent friendly service and lively music keeps us entertained."
        }, 
        {
            "index": 367, 
            "rating": 5, 
            "review": "Top notch ayce sushi. Great food. Lovely service. Well worth a visit!\nWe had a great meal and they were really accommodating with allergies and specific foods we don't eat. \nThanks and see you soon!"
        }, 
        {
            "index": 368, 
            "rating": 5, 
            "review": "Sushi 21 is a fabulous sushi restaurant. Our group of five came in and did the AYCE and were blown away with the sushi and the quality if service. Our waiter Jaden was very attentive and was able to handle our chaos quite well!\nThe restaurant as a whole has a really nice feel too it and a j-pop sense of atmosphere.  \nOverall we had a great time!"
        }, 
        {
            "index": 369, 
            "rating": 5, 
            "review": "Such awesome service. An All You Can Eat that can't be beat. So friendly and their NEW menu rocks."
        }, 
        {
            "index": 370, 
            "rating": 5, 
            "review": "Whenever I'm in a mood for some sushi, I always go to Sushi 21. Not only do they have all you can eat, their a la carte menu is absolutely fabulous. If you aren't too hungry to eat all you can eat, go for their awesome choices in the a la carte menu.  Everyone who works there are friendly and helpful. I remember this one server attending to me often and answering even the smallest questions.  Kenney, the sushi chef, is very funny and engaging with the customers. If you haven't checked this place out yet, please do so!"
        }, 
        {
            "index": 371, 
            "rating": 1, 
            "review": "sad thing is, I didn't even get to eat the food...went there to try out because of good review, first thing I walked in is strong smell of bleach and bathroom, I walked around the room trying to find a spot that doesn't smell but can't find any place that doesn't smell bad...I immediately walk out, one of the very first thing restaurant should always keep in mind is maintain proper dining environment for the guest, an awful smell isn't just a good sign at all"
        }, 
        {
            "index": 372, 
            "rating": 3, 
            "review": "Sushi 21 is a decent place for lunch. I've had the AYCE Sushi here and it's quality is above average. I've gone here a few times for lunch, and for to go. \n\nThe inside is kind of pop-Japanese style with traditional elements mixed with LCD screens playing Japanese boy-band videos the whole time. A cool distraction. I've mostly eaten here in the middle of the day, as opposed to the evening. \n\nNone of the rolls really stand out in my mind, service is a little bit slow some night. The AYCE has a good sized menu, and some tasty standard treats, but for the price I have been to other places with Free Saki & Beer for almost the same price. \n\nWhenever I go for lunch I like the Bento Box the best. It's got a little bit of everything on it, Gyoza, Rice, Teriyaki Chicken, a Salad, Miso soup and 6 pcs of california rolls. Not bad.   I also enjoy the Shirmp Tempura and Calamari at this location. \n\nI've never had a bad experience at Sushi 21 like some of the other reviewers, but it has a long way to go to beat out other AYCE's scattered around Las Vegas."
        }, 
        {
            "index": 373, 
            "rating": 4, 
            "review": "We are visiting vegas for the evening and had some time to kill for a sit down dinner. \nWe are from out of state and HATE the business of the strip and casino restaurants. This place was easy to get to and had plenty of parking. A serious plus in our book!\nWe were seated and immediately brought our drinks. The waiter took around 10 minutes to make it around to our table but my food came out within 5 minutes of ordering!! So quick!\n\nI ordered the gyoza which came with a delicious dipping sauce. I wasn't hungry enough for the AYCE menu so I just got one roll. I chose the yum yum roll which was delicious! Super light and fresh. I ate the whole roll and appetizer and felt very satisfied. \n\nMy husband however was starving and chose the all you can eat option which was very reasonably priced at $26.95. (Each roll averages to about $11 dollars so this option made sense) \nHis order took a little longer to make, I had finished my whole meal before he got his. It would have been nice to maybe have at least one roll of his brought out with mine. \nHe chose the TNT, caterpillar, and the vegas lasagna roll. \n\nThe service was great overall, our waiter was attentive and checked back to let my husband know his rolls would be out soon. Sure enough they were brought within 3 minutes.  \n\nThe atmosphere is laid back and casual. We appreciated this after a long day of driving. \n\nThe price point was good; the AYCE made up for the lack of the \"half price sushi\" option. The restaurant was pretty spacious so it wasn't too loud. LOTS of booths. \n\nAll in all it was a perfect stop on our way through the city. Will definitely recommend and return!"
        }, 
        {
            "index": 374, 
            "rating": 1, 
            "review": "Looking for a place to eat we have stumbles upon a restaurant called \"Sushi 21\". Upon entering we were welcomed with a nice atmosphere. We were seated immediately, and got our drinks in a timely manner. Receiving our soup within 10 minutes and then our main course in 1 hour! Though upon receiving our meal it was over seasoned meat which is just too powering. The Sushi was adequate, and the calamari was appalling. Never have we ever been served sushi where an ant crawled out. After that my appetite was almost gone, but I had not eaten the whole day so I still went to eat my main course. Next the calamari looked like onion rings, and the taste and texture was the most bizarre feel and taste of calamari I had ever experienced; as it was extremely stretchy sort of like trying to eat gum. Arriving at 8:01 and recieving our food at 9:30 it was the longest i have ever had to wait for food in my whole entire life! I hope they acknowledge this and address this issue. As for now I wont be coming back, and will not be recommending to anyone to the disgusting sushi, rubbery calamari, and extremely slow kitchen service!"
        }, 
        {
            "index": 375, 
            "rating": 2, 
            "review": "Not that great.  Miso soup was way too salty.  Oysters were not very fresh.  Rolls are ok.  Crispy rice was good but not enough for me to come back. Service is what I called dead logs, you have to kick them and then they will move.  We had to ask for refills and when the last of our party came and sat with us for 20 min, we still have to ask for a place setting.  \n\nI do have to say popcorn lobster and seared salmon was the highlight of our meal.  majority of the rolls were stuffed with crabmeat as filler.  Definitely not better than Goyemon.  \n\nI do agree if you're a sushi snob this place is not for you.  Everything is just ok, not much of a wow factor."
        }, 
        {
            "index": 376, 
            "rating": 4, 
            "review": "The restaurant itself isn't very fancy inside, but they do have some up beat music playing and I could see it being a fun place to go with friends and indulge in some Sake. They have really good deals, each week they pick about 10 different rolls that are half off. I ordered Sean's roll which was delicious and half off. The salad they give you as a starter isn't very good due to the dressing that isn't very flavorful. Other than that I was super satisfied. Also we took a chance and tried the green mussels for an appetizer which ended up being very good. Needless to say, I'm going back today for lunch."
        }, 
        {
            "index": 377, 
            "rating": 4, 
            "review": "Tried this spot out and decided on the all you can eat. Huge selection and good quality. No complaints here."
        }, 
        {
            "index": 378, 
            "rating": 1, 
            "review": "I came in to the establishment loving it here fm another experience. However the latest experience was not so enjoyable. My friend and I ordered all u can eat and just ordered 4 rolls which extras rolls came out. When we addressed it they said it was okay and proceeded on talking shit. I am half Korean and black and them not realizing it called my friend and I black slanderous names. This racism has to stop. So I spoke to her in Korean letting her know I understood and then it all stopped. The management got so embarrassed off her actions she left the building. Never again"
        }, 
        {
            "index": 379, 
            "rating": 5, 
            "review": "First time coming here. Theyre super friendly and really quick. Something wrong 69 roll is my fave so good with a spicy kick. Nice little ambience and they even gave us a free roll !! Will definitely come back :)"
        }, 
        {
            "index": 380, 
            "rating": 4, 
            "review": "Came here with a bunch of my friends for our Christmas dinner for an AYCE sushi. Price: $27 dollars a person and if you write a review they give you 10 percent off your bill but you will also be charged 18% gratuity for party of 5 or more.\n\nFood: we really enjoyed food; however, the unit wasn't as fresh as we are used to to be considered as restaurants quality. We did enjoy the salmon, oyster, baked muscle, giant clams\n\nService: surprising for a holiday, the place is not crowded at all so our service was fast, and efficient"
        }, 
        {
            "index": 381, 
            "rating": 2, 
            "review": "I've been here multiple times and this is by far the worse experience I've ever had at any restaurant. I came here for my cousin's birthday dinner and we've been here for at least an hour and a half and I've gotten only 2 rolls. Service is tremendously slow. There's 2 waitress who do not communicate with each other and come to the table to ask us the same questions. I'm so annoyed that I am writing while I'm still at my table. I will never come back here and will recommend ppl avoid this place!!!"
        }, 
        {
            "index": 382, 
            "rating": 5, 
            "review": "Visited for lunch on a Saturday. The staff is very pleasant and helpful. We ordered the all-you-can-eat sushi and were very pleased. Won Ton soup, calamari and shrimp tempura appetizers were great. Orders come out quickly and the sushi is very good. We got about 8 rolls in total and several individual pieces of sushi. Lots of variety to choose from on the AYCE menu. Highly recommended."
        }, 
        {
            "index": 383, 
            "rating": 5, 
            "review": "One of the better sushi places i have gone to plus they have a customer's reward program buy 10 AYCE get one free"
        }, 
        {
            "index": 384, 
            "rating": 1, 
            "review": "The sushi wasn't bad when returned and made correctly. The sushi chef made almost all our rolls wrong on top of serving totally raw chicken. Ordered the rolls with the sauces on the side. Came back with sauce on all of them even wrong sauces on ones that didn't even belong on them. When we let them know the chicken was not cooked they took it back reheated it and throw it back on top of the vegetables that it was sitting on prior!!!!! Totally gross and health code violation!!!! I will not return."
        }, 
        {
            "index": 385, 
            "rating": 5, 
            "review": "Ok, so another sushi all you can eat sushi on my list! At sushi 21 you will find a traditional contemporary Japanese decoration with comfortable sits and a cool Japanese bar. Once you get in the restaurant don't let the size of the dining room intimidate you, they craft amazing sushi at that place!\n\nThey have an unbeatable price for lunch, while still being very competitive at diner time. They will provide you with wonderful appetizers and fresh looking nigiris!!! What I really enjoyed at Sushi 21 was the capability of the chef of craft icing custom Temakis and special orders of sushi depending on your desire!\n\nLocated at Tropicana Avenue near by the Strip, this restaurant is a great destination for you and friends to try it out. I would recommend going for their All you can eat special and then ordering some appetizers first, moving on to some salads and finally ordering your sushi!\n\nThe chef and servers were extremely friendly and willing to make sure that you get your sushi craving taken care of! This restaurant gets a 5 stars because they have really good sushi for an astonish price."
        }, 
        {
            "index": 386, 
            "rating": 4, 
            "review": "My first time to an AYCE in Las Vegas and I'm impressed. I opted for a la carte because I can never eat my money's worth at buffets but my folks went with AYCE. Their a la carte menu is quite extensive as is their AYCE menu. The fish was super fresh. My favorite was the super white tuna and my mom loved the uni. \n\nGood service too. The server was friendly and attentive and food came out very quickly! \n\nLunch AYCE is $21.95 and Dinner AYCE is $26.95. Not bad at all."
        }, 
        {
            "index": 387, 
            "rating": 4, 
            "review": "I needed my sushi fix and didn't want to leave the house. So I had my girl pull out her trusty Yelp app and find a place that would deliver. I went a little crazy and ordered way more than we needed. The food came quickly and was ok. It was no Goyemon, but it was good for what it was. I'd order from them again."
        }, 
        {
            "index": 388, 
            "rating": 1, 
            "review": "Were do i begin this place sucked I came in last night with a friend and it was horrible all of the fish is frozen watered down there \"chef sashimi\" is a joke all the apitizers had no flavor it was the worst place i have ever eatin at so far in las vegas will never return to this place again no wonder why on a saturday night there was no one in there waste of space,money,and time i should have went to goyoman down the street way better food and fresh fish!"
        }, 
        {
            "index": 389, 
            "rating": 4, 
            "review": "Many good menu that is same as Japanese!\nAnd good taste!"
        }, 
        {
            "index": 390, 
            "rating": 5, 
            "review": "I loved this place. We stumbled on it because we were staying in a nearby hotel. I told my daughter about it as she was staying in the same hotel. She ate at Sushi 21 twice during our trip.  I would definitely eat there again and would recommend it."
        }, 
        {
            "index": 391, 
            "rating": 5, 
            "review": "The employee are very friendly an nice... the food is grate... the price is grate too... I would recommend to my friends an family... can't wait to come again... :)"
        }, 
        {
            "index": 392, 
            "rating": 2, 
            "review": "We won't be back. After eating at Sushi Mon, Goyemon and Oyshi for years I shouldn't have wasted my time going to a place without a wait at 7:45pm on a Sunday night. My impatience and hunger cost me this time.\n\nI give 1 star for the something wrong 69 roll which is somewhat similar to my favorite pastel roll. I also give 1/2 a star for the busser who was quick to come and pick up our plates and refill our drinks. The last 1/2 star is for the deep fried Oreo. It doesn't compare to mermaids on Fremont street but it got rid of the sushi taste.\n\nThe servers are basic, no suggestions for 1st timers to their establishment and no small talk that generally increases tips. We had to say excuse me several times to order food (despite the 7 total seated tables) but at the end of the meal they became attentive. Oh and we ordered a few things that never came out but I'm thankful for the mistake since the nigiri pieces are thin, the rolls are drenched in one sauce or another so the rice is soggy and most of the hot food was over cooked (popcorn lobster & baked aka crispy mussels).  \n\nAs pictured I'd recommend that no presentation that includes fish should have any green sauce. Not cute. Not tasty. No thank you."
        }, 
        {
            "index": 393, 
            "rating": 4, 
            "review": "I always get AYCE for $26.95 and because I don't favor heavy carbs, I perfected my ordering to better utilize the sashimi limits. Food comes out freshly made to order and the staff is always kind."
        }, 
        {
            "index": 394, 
            "rating": 5, 
            "review": "I want to thank Goyemon for having a 45 minute wait today because it led us here!! I've been going to Goyemon for years and little did I know that this gem was less than half a mile away! Their menu has so many adventurous and DELICIOUS options!!! Their appetizer list for dinner is also very impressive! I recommend trying the monkey balls and the cajun albacore sashimi! The only thing I don't like is that they limit you to ordering two half orders per person, I'd like to be able to try different rolls without ordering full rolls! \nI'll definitely be coming back!!"
        }, 
        {
            "index": 395, 
            "rating": 4, 
            "review": "We needed an early dinner, we saw the sign and decided to give it a try. We're visitors to Las Vegas and don't know much about restaurants in the area. I'm not a sushi expert either, but I know what I like and this sushi was very good. My wife ordered the Caterpillar roll. It was fresh and delicious. I had I'm Your Mother. It was very tasty and fresh, but being a baked roll it lacked firmness and was hard to pick up with chopsticks.\n\nSome other reviewers have complained about poor service. Our waiter was polite and attentive and we have no complaints at all.\n\nWe're in town for another week and I'm pretty sure we'll be back."
        }, 
        {
            "index": 396, 
            "rating": 5, 
            "review": "Fresh fish great service check out johnny behind the sushi bar...good food good prices"
        }, 
        {
            "index": 397, 
            "rating": 3, 
            "review": "Food was fresh and service was so so.  The best roll we had was the Popcorn Lobster.   Beware....It is huge and so good.   We ordered the all you can eat and had to cancel two rolls because we knew we would have not finished them after that roll hit our table.  I would have given 4 stars but there was a service issue at the end.  There were four of us and had left 5 pieces of rolls from 5 different rolls and the server stated she was going to charge us $10 for not finishing.   Really???  1 1/4 piece of roll per person when we canceled the other rolls.  I would return only for that Popcorn Lobster.  There are too many great sushi places out there that are just as good or better."
        }, 
        {
            "index": 398, 
            "rating": 4, 
            "review": "I had given up on AUCE sushi. It's mother/daughter date night tho and Hunnie Bunnie wants Edamame! I decided on sushi. We drove by Goyemon but it looked too busy so we drove back to this spot.\n\nHunnie Bunnie got her Edamame and Japanese Udon Noodles which she enjoyed.\nThis is what I ordered:\n\nBaked Green Mussels - these were really good, whatever sauce/toppings they put on I really liked and they were served nice and warm.\n\nCalamari rings - crispy breading and served with a spicy dipping sauce. Not bad at all.\n\nSoft Shell Crab - small soft shell crab, split right in half. Good stuff. I love sscrab!\n\nLettuce Wraps - they were out of this item!!! I really wanted to try these cuz it involved pork belly :-( Next time!!\n\nTuna Poki Salad - this was aiight. I've definitely had better. It's some kind of different sauce they put on and I think the spiciness of the sauce overwhelms the flava\n\nScreaming Orgasm - not enough sashimi but lots of daikon\n\nYellowtail Jalapeno - they put sriracha on the jalapenos. I usually LOVE sriracha but i didnt care for it on this dish. And i wasnt really a fan of the sauce they used for this sashimi plate.\n\nTuna, Yellowtail, Salmon, Super White Tuna Nigiri - SO good! This fish tates SOOO fresh and melt in your mouth! Nicr size cut of fish and a small serving of rice accompanies it. REALLY REALLY GOOD! I had given up on AUCE sushi because the fish just didnt taste that good to me anymore but this place changed my mind! \n\nScallop: It's mixed with something, crab mix maybe, and not tasty at all.\n\nSweet Shrimp - I actually only ordered this so I could eat the fried shrimp heads. Nom. And to think I never ate them before... The shrimp itself wasnt very good but the heads were tasty!\n\nFour stars for the fish. Three stars for the apps."
        }, 
        {
            "index": 399, 
            "rating": 5, 
            "review": "Delicious sushi, great service, and great price. Definitely be back!!!\n\nI came with my husband and our friends and we had a great experience. \n\nThe specialty rolls are the best and the screaming o. Make sure to save room for red bean mochi!"
        }, 
        {
            "index": 400, 
            "rating": 5, 
            "review": "Sushi 21 is my number 1spot to come an resolve my sushi cravings. Great menu and service is great! Clean, decent and not to pricy! Love this place÷"
        }, 
        {
            "index": 401, 
            "rating": 4, 
            "review": "Excellent service, good Sake special, pet friendly, good prices. The location is right by my son's rugby field, Charlie Frias Park. Good spot to try again. The server's generosity with the pickled ginger was very appreciated, too."
        }, 
        {
            "index": 402, 
            "rating": 5, 
            "review": "I wanted to wait till I got home and in front of a computer to write this review. We've eaten at many sushi restaurants in Reno and other cities BUT, we have never eaten at a sushi house this good. \nYes, you do get 10% off if you write a Yelp review but, they didn't check to make sure we wrote a review. It must be a service Yelp offers or the pop up coupon you get when you check in on Yelp wouldn't work. That's fine anyway, Yelp is one of the best ways to advertise and I would write a review one way or another.  \nThere are instructions on the AYCE menu so pay attention. There are certain items on the menu you can only order one of per person, but I own a bookkeeping service and can tell you restaurants run on a pretty slim margin. You can't blame them for not wanting waste. Also, if you do not eat all of your meal you will be charged regular price for that roll. \n\nI'll try to keep this short even though I could go on for a while. We were a party of 5 and we were hungry!  We were looking for something close to the condo and Sushi 21 was there. \nWe were seated right away and ate easily over a dozen rolls and appetizers. We all agreed that every roll they brought was delicious. The edamami was hot, salted, and the freshest we've had. Yes, I know it was most likely frozen from the supplier BUT, the difference was that it didn't taste like it had been sitting in the steamer all day.\nSecond, the service was amazing. Never once did empty dishes sit on the table for longer than it took us to put the dish aside and start eating another roll. We asked for fresh wasabi which was brought out in short order and it was delicious! \nThe oysters on the half shell were fresh but, could have used a little more in the way of accoutrements, like horseradish and lemon but, was served properly cut away from the shell and excellent with a spot of sriracha sauce. \nThe tempura battered anything was delicious. The tempura was light, crispy, tasty, and we could tell the oil used was fresh. We had one order each of the ahi tuna, which was thin sliced served two ways.  There's mayonnaise sauce on each style but, one was spicier than the other and both ways were delicious.\nHave I said \"delicious\" enough? No. \nThis is a little gem off the strip, away from the tourist traps and we are so happy to have found it.  If only it was in Reno! \nThe servers are friendly, QUICK and attentive.  We didn't have to wait long for anything. \nOne thing I can say for sure, the sushi houses in Reno need to step it up.  Every sushi house we've eaten at, the tempura is either soggy, or tough, and tasteless and/or cooked in old oil. If the owners of Sushi 21 ever open a sushi house in Reno, we will have permanent reservations! This was the best sushi we have ever eaten.\nThis will be our first dinner stop next trip to Vegas! \nWhen in Las Vegas give Sushi 21 a try. I can't guarantee you will have as good of an experience as we had but, I'm pretty sure you will enjoy your meal."
        }, 
        {
            "index": 403, 
            "rating": 5, 
            "review": "1115pm, they're open, and the service has been good so already we were off to a good start... Everything came out in a timely fashion, looked fresh, and tasted good... I'll be back"
        }, 
        {
            "index": 404, 
            "rating": 5, 
            "review": "Went to Goyemon, hour and half wait (I'm sure it's great), but thankfully so we found Sushi 21.\n\nSincere smiles from a friendly staff, and fast service with an attention to quality in the delicious food we were served. We're definitely coming back; \"all you can eat\" next time for sure.  If you want to find your neighborhood sushi spot, look no further."
        }, 
        {
            "index": 405, 
            "rating": 3, 
            "review": "Tried to get into Goyemon with a large group & they were super unaccommodating. I called up Sushi 21 right down the street & they were very accommodating & got us right in immediately. Service was wonderful as the waitress was on top of all of our orders especially in the early feeding frenzy. Super White Tuna was awesome as well as salmon & all their nigri. I guess the rolls were ok but I wasn't that imporessed with them. I have started to venture away from rolls & eat just nigri these days. They do offer 3 slices of 1 fish of your choice sashimi style which was nice. Would go back if I am in the area."
        }, 
        {
            "index": 406, 
            "rating": 5, 
            "review": "Just finished eating these rolls Double D, Orleans, Jackpot and the Johnny which is refreshing being that it has no rice, rolled with Cucumbers. Green Tea Ice Cream as a finisher."
        }, 
        {
            "index": 407, 
            "rating": 4, 
            "review": "The sushi here is great! Very fresh and flavorful. The pieces did not fall apart when I went to pick them up; the roll was wrapped well. Presentation of the sushi was nice and they bring out the ginger and wasabi prior to receiving the sushi which I liked because I didn't have to worry about asking for it. Also the avocado and the cucumber was fresh. \nI'm only giving the restaurant four stars because there was gratuity added for a party of five."
        }, 
        {
            "index": 408, 
            "rating": 5, 
            "review": "The Mochi ice cream is soft and at the right temperature when it comes out... It just melts on your tongue as you bite down on it!!!!!! The eel is amazing as is the mackerel.... I love the all you can eat at this place...."
        }, 
        {
            "index": 409, 
            "rating": 4, 
            "review": "Went here on a date, but we did not do AYCE.  Instead we ordered a sashimi platter and a couple of rolls.  The sashimi tasted really fresh and delicious.  I'm one of those weird people though who need a little rice with her sushi, hence the rolls.  I was really craving some softshell crab, but the roll we ordered was just chopped up imitation crab, which I did not care for.  The other roll we ordered was a spicy tuna with other stuff and that was really good.  \n\nAll in all, it was a good experience.  The restaurant was a bit empty at 9:30pm, and the service was quick and friendly.  The prices are very reasonable too.  Definitely one of the better non-strip sushi places."
        }, 
        {
            "index": 410, 
            "rating": 5, 
            "review": "Sushi is so fresh and delicious been coming here for years. We moved and now travel over 25 miles one way just to eat at this place. The service is also really great. Really attentive staff. A+ service."
        }, 
        {
            "index": 411, 
            "rating": 4, 
            "review": "It's hard to find good sushi, and here tucked in the corner of this shopping center is great sushi. Awesome atmosphere, great service and your taste buds will thank you. From their All You Can Eat sushi to the cleaner greener rolls there is something for everyone. Down side to this place? Oh yeah, after you've eaten you only wish you hadn't so you can eat it all over again. If that stops you from coming in I suggest you get the All You Can Eat."
        }, 
        {
            "index": 412, 
            "rating": 4, 
            "review": "Quality sushi here.  Music is a bit loud and I'm never fond of places that have music videos projected up.  The layout is pretty dumpy looking compared to many places I go in Seattle, but this place served up very serviceable sushi in Las Vegas, which was a relief!  The service was very slow but wonderfully accommodating."
        }, 
        {
            "index": 413, 
            "rating": 1, 
            "review": "Sushi SOAKED with that stupid sour sauce and fish that aren't fresh.  Oysters are plain and tasteless.  How the F do they serve these crap to customer?  I can't imagine they would enjoy eating what they serve!!!!\n\nWhy do they get such good rating you ask?  Because they offer 10% off when checkin at yelp and write a review.  \n\nThe only reason they stay opened is because of the overflow from another better AYCE sushi nearby.\n\nService was great nevertheless, but don't come here, go get a burger instead!"
        }, 
        {
            "index": 414, 
            "rating": 5, 
            "review": "My favorite sushi place in Vegas. I'm addicted to the sun devil! I get it as soon as I fly in. It's tradition now"
        }, 
        {
            "index": 415, 
            "rating": 3, 
            "review": "I'm from LA and I had my share of sushi and I tried a few vegas AYCE sushi spots also so I know a thing or two.. In terms of value, it's great but the quality is not there. Sushi house is much better and worth the wait if you have patience. This place don't have a wait which is a plus. But in terms of sushi, it's decent at best. The Uni I got was suppose to be bright yellow. The ones I got was more like brown.... And it didn't taste fresh either. I order the \"something's wrong\" roll which describe having soft shell crab but when I got it, it was fake crab.... HUGE difference there buddy! I guess something was wrong! Not all was bad. Some of their other rolls are pretty decent. Don't get the mochi dessert. The dough has a funky texture. \n\nConclusion: I would not return unless I really crave for sushi and sushi house's waiting time is too long."
        }, 
        {
            "index": 416, 
            "rating": 5, 
            "review": "wow!!! let's start with the service:.... TOP NOTCH!!! from the greeting, to ordering, to check out! The whole staff is friends and very helpful. \nThe menu: You can order off an all you can eat menu for a really good price for lunch or dinner. They had great choices, but we chose the ala carte menu, which of course adds up to a lot more, but we wanted things specific that weren't on the all you can eat menu. \nThe food: really good!! the rolls are packed tightly and the baked rolls were perfect temperates. The sashimi was so very flavorful, but I personal would have preferred it more chilled than warm.  But the presentation was beautiful.\nThe only con - is the music videos???? They're a mix of strange asain pop and techno, and just odd and comical. \n\nOverall this is always a great place to go and we will continue to eat here as long as we are in town."
        }, 
        {
            "index": 417, 
            "rating": 1, 
            "review": "I went there a few days ago since I have not eaten anything all day and I was hungry.  when I stepped in there was only a few people in there.  \n\nI ordered the Agedashi tofu and Eel Bowl.\n\nWhen I got the agedashi tofu it was served with Ponzu and not the traditional dashi sauce.  When the sushi chef asked me if everything is ok I told him no and can I have some tempura sauce.  the server came to me and told me that it's supposed to be served with ponzu sauce.. Then i Replied \"no it's not.  The name of the dish tells you what it is.  It's called agedashi because age means to deep fry and Dashi is the sauce that it's served with\".  \n\nthe Eel bowl to my dismay was served on top of sushi rice and not regular steamed rice.  which is the traditional way.  \n\nLater i found out that it is a Korean run restaurant.  So I must say that they should learn to make food the right way or rename it to fit their serving ways.  don't call something one thing and then serve it a different way\n\nThen they asked me if I was japanese and I told them yes.  and asked if they wanted me to show them how to make it  the right way. and I paid for my uneaten food and left and went to mcdonald.."
        }, 
        {
            "index": 418, 
            "rating": 2, 
            "review": "Lots of selections and pretty innovative and creative foods. The food tastes good but nothing that sets it aside from the tons of Sushi places here in Vegas. The servers here though are a bit overwhelmed and are very forgetful on what you ordered. And if I ask for a refill on my soda, please fill it up all the way!"
        }, 
        {
            "index": 419, 
            "rating": 4, 
            "review": "Freshly made rolls with great variety - there's probably about 150+ different options and the rolls are pretty high quality for the most part. Sometimes the rice was a little too cold but overall it was a good dining experience and the servers were all very friendly."
        }, 
        {
            "index": 420, 
            "rating": 3, 
            "review": "I was supposed to go to Gyoemon tonight, but as always they had a long wait. So my friend decided to give Sushi 21 a try. The food was decent. Everyone was nice except for this one waitress who gave me this weird eye look when I asked for another ice cream.  What's up with the one eye look? Overall, the food was average and the service would have been 5 stars if she didn't gave me the pirate eye look."
        }, 
        {
            "index": 421, 
            "rating": 5, 
            "review": "This is my first time here. I had the Popcorn Lobster, Baked Lobster, Las Vegas roll, Gyoza, and Crab Pockets. All of my dishes were on par with most AYCE places I've been to. I'll return if I'm on this side of town again and in the mood for sushi."
        }, 
        {
            "index": 422, 
            "rating": 3, 
            "review": "So this WINDOW ruined my appetite !!! Good thing we were done eating first the guy in back stuck the sushi in the microwave for 5 min ! And then 20 min later he shoved a handful of food in his mouth from whatever he was cooking other than that sushi was good so ill give it 4 stars"
        }, 
        {
            "index": 423, 
            "rating": 2, 
            "review": "Really mediocre fish.  Service was friendly, but inattentive.  I usually attempt to be clever and fun in my reviews, but this place really doesn't deserve the time or effort.  Pass it and go to Makino down the street."
        }, 
        {
            "index": 424, 
            "rating": 5, 
            "review": "This place is always a must stop when we get to Vegas!  The all you can eat is a must. The sushi is fresh and delicious! They always have a buy one, get one hot sake!  Our server, Jay, was awesome! Really nice sweet guy!"
        }, 
        {
            "index": 425, 
            "rating": 4, 
            "review": "While there are a ton of AYCE sushi spots in Vegas, Sushi 21 is by far one of my favorites. They've got a pretty hefty menu of AYCE selections, so you aren't faced with too much repetition if you want to switch things up, and if you get bored with the menu, the chefs always have a little special item they can throw together for you. \n\nMy favorite specialty has seared salmon with kiwi - one of Kenny's awesome little creations. Just the thought of this delectable little dish makes me want to hop in the car and head over for an early dinner. \n\nMeanwhile, if you're going to stick to the menu, I would suggest the popcorn lobster roll - somehow the sweet of the eel sauce and spicy mayo mix with the coolness of the California roll and the heat of the deep fried lobster bites to form the perfect symphony of greatness. Seriously. Try it. \n\nThrow in a two for one deal on hot sake and you've got a pretty freakin amazing meal!"
        }, 
        {
            "index": 426, 
            "rating": 5, 
            "review": "Always incredible sushi oh soooo good! Definitely our favorite in Vegas. Always the freshest fish and the service is top notch!"
        }, 
        {
            "index": 427, 
            "rating": 5, 
            "review": "I came in on a wed night and it wasn't that busy but dang they killed me with service! Which we all love. The staff is friendly but the food has been top notch for 10yrs that I've been coming here... Me and my wife love this place. 2 thumbs up! You must try now!!!!!"
        }, 
        {
            "index": 428, 
            "rating": 1, 
            "review": "I can't even right a review except for the worst service ever. Lunch time 2 other tables couple of people at bar took our order in 1 hour time we are watching others get rolls after rolls while we drank our tea. Then the waitress ask if we can wait 1 more minute I don't think so. We got up and left."
        }, 
        {
            "index": 429, 
            "rating": 4, 
            "review": "Went here last night for the 100th time. LOL. always good sushi and the service is pretty good. Only bad thing is I love GARLIC TUNA but they only allow you to order 1 order per person. Not a big deal but i love my GARLIC TUNA,.,. Great place to go with a couple friends or just a night with your partner."
        }, 
        {
            "index": 430, 
            "rating": 5, 
            "review": "Oh, how I miss you, Sushi 21.   We were so close, once.  Geographically, yes, but gustatorially, as well.  \n\nI used to live a block (or so) away from this place, and ate here (or grabbed take out) sometimes three times a week.  Loved it. LOVED it!\n\nThe prices were fantastic, very affordable, especially given the quality of the food.  Damn good!\n\nThe service...always friendly, though communication was often limited.  There was the occasional cash register dilemma...usually with a new server who didn't quite have the hang of it...but whatever, i was gonna be waiting anyway, no worries.\n\nMy favorite sushi chef was a blonde-dyed guy who would only give his name as \"Josh.\"  That's cool, man.  My name was still Robert, and our high fives were many and heart-felt.  Your skills were finely honed, your humor genuine, and your creative flair MUCH appreciated by this humble diner.\n\nWhether I was there alone or with a lady, when seated at the sushi bar I was always treated like a prince.  Never failed to be gifted with some special sushi treat, a custom concoction from Josh.  Yeah, my generous tips may have had something to do with this, but hell...how many times do generous tips just get absorbed into the gelatinous maw of the self-important?  My man appreciated the money, no doubt, but probably not as much as I appreciated his craft and attitude.\n\nI had too many good meals here to go into specifics, and a lot of the rolls I had weren't even on the menu.  Suffice to say I never left disappointed, and even when doing take-out, everything was always very fresh and delicious."
        }, 
        {
            "index": 431, 
            "rating": 5, 
            "review": "I love all the unique sushi rolls, especially the Snow White. Best sushi I've ever had."
        }, 
        {
            "index": 432, 
            "rating": 5, 
            "review": "I walked in and was provided with exceptional service, and a plethora of selections. The sushi is top quality, and you certainly get what you pay for. For a traveler like myself, a must visit if you come to Las Vegas, and are in the mood for an All-You-Can-Eat sushi buffet!"
        }, 
        {
            "index": 433, 
            "rating": 5, 
            "review": "Wow, great fresh sushi and wonderful service. My husband and I ate there Fri for dinner and enjoyed it so much that we decided to take our adult son, daughter and children for Easter late lunch and it was just as good. I don't eat raw fish and they have a large variety of baked and deep fried choices. All the raw rolls my son ordered were very fresh and he said were excellent. Every roll we all ordered were large. We are in Vegas for 1 week and plan to eat there again before leaving!  The service is fast and they cleared our empty plates very quickly as we would finish each roll. The AYCE is worth it for the price which includes lots of appetizers, about 100 roll choices, and dessert. They are conveniently located only about 3 blocks from our timeshare unit at Diamonds Resort so could walk there."
        }, 
        {
            "index": 434, 
            "rating": 4, 
            "review": "We come here for the K-pop videos. No lie. Best place to watch hot Korean guys dance and sing on a big projector screen on the wall. Uggg! Why are Korean men so hot?????? Anyway- I find this to be a great distraction after a long day at work. Favorite rolls are the Johnny Roll and S.W.A.T Roll, plus their Yellowtail Kama and Vegetable Tempura are exceptionally delicious here!"
        }, 
        {
            "index": 435, 
            "rating": 5, 
            "review": "UGH. UGH. I was in Vegas for a business trip and picked this AYCE (26.95 dinner) over another 2 in the area and I am SO glad I did! This place is so good that I felt compelled to start this review while I'm still eating but probably won't finish since the food is that good. Haha. \n\nThe AYCE menu is pretty extensive and impressive.. With 45 appetizers, 27 nigiri selections, 15 classic rolls, 12 deep fried rolls, 52 special rolls, 9 baked rolls and some dessert options. \n\nWhat I ordered: \n\nNigiri; salmon, garlic tuna, white tuna, octopus, yum yum scallop. The nigiri here isn't buttery, melt-in-your-mouth goodness but for AYCE, it's definitely above average and I don't think you'd complain. \n\nSashimi chef choice: it was salmon and same as above. \n\nOysters: so big and good! Only one order per person though. \n\nCrawfish: this dish is so yummy. It's a bunch of crawfish cooked in a delicious sauce. It is a bit greasy though and for a fellow fatty like me to say that means a lot because I love grease. It does have a kick which is great.  \n\nBaby octopus: they're actually pretty big for being \"baby\" and I liked them but without the sauce, they're kinda bland. \n\nSeaweed salad: a must at every sushi restaurant for me and this one was great! \n\nOrleans roll: OMG. This is the best sushi roll I have EVER had. I love cream cheese in my rolls. If you do too and you love salmon and spicy mayo, get this roll. The spicy mayo is actually spicy which is so awesome. This roll makes me want to move to Vegas. Okay that's me being dramatic but seriously, it's just really good okay? \n\nI got the strawberry, green tea and red bean ice cream for dessert and both were good! \n\nThe waitress that was working was such a sweetheart too. She was so nice that when she told me they ran out of uni today, I didn't even get upset and if you know me, I NEED my uni. Hopefully I get to try it next time cause I definitely plan on returning someday!"
        }, 
        {
            "index": 436, 
            "rating": 5, 
            "review": "It was good. Yummy yummy sushi, they have a wide variety of rolls to choose from. Their ayce price is reasonable, and there's also quite a wide selection of appetizers to choose from. The service for us was quick. All the food came out in a matter of minutes from ordering. Would recommend for anyone looking for a sushi fix!"
        }, 
        {
            "index": 437, 
            "rating": 5, 
            "review": "I took a friend that was in town from Pakistan. It was late so we were limited on where we could go for all you can eat sushi but intent on finding a place open. This place is open until 3am on a Sunday!  First off we were greeted with big smiles right from the start.  The staff were all extremely friendly. Almost every roll we had was amazing.  The only one I didn't care for as much I don't remember the name of.  The service was excellent and delivery was very fast!  The Strawberry tempura ice cream was sooo good!  The atmosphere is quite pleasant and nicely lit.  The played Asian music videos on the big screen the entire time but I'm a sucker for those ;P   I would come back here again and tell friends about it! I already texted one of my sushi buddies and let him know the place is bomb!"
        }, 
        {
            "index": 438, 
            "rating": 5, 
            "review": "Never underestimate the power of YELP! Found this place leaving the Venetian and tried something new. Always nice to find an awesome ayce sushi spot. Will be back here soon"
        }, 
        {
            "index": 439, 
            "rating": 5, 
            "review": "Good service! Awesome food! Even my 5yr old daughter enjoyed her dinner. Will definitely come back here."
        }, 
        {
            "index": 440, 
            "rating": 3, 
            "review": "Sushi is pretty average here. Rolls were disappointment. Nothing super great. Ordered oysters, but they didn't have any. Not a big deal, just worth a mention. Variety of flavors (green tea, red bean, vanilla, etc) for desserts. Got deep fried oreos, mochi, and tempura. Pretty average desserts. \n\nService was great! Server was nice and attentive.\n\nOverall not the place for me."
        }, 
        {
            "index": 441, 
            "rating": 2, 
            "review": "The service is very good here and thats where all the good stuff ends.\n\nWe came around noon and paid for the $27 dollar menu all you can eat. The rolls and sashimi look right but don't taste right. The rice is cold and hard. The sashimi isn't fresh at all. I have to return two items for some weird taste.   I won't  come back again."
        }, 
        {
            "index": 442, 
            "rating": 5, 
            "review": "Outstanding food! Lobster roll was excellent. Best roll! Outstanding service, attentive waitresses. Come here and you will be happy! Lots of options on all you can eat."
        }, 
        {
            "index": 443, 
            "rating": 4, 
            "review": "I've been going here on and off for 5 years now. One of my favorites in near the core of las Vegas.  I wanted to review sushi 21 because they have received a lot of competition lately which has resulted in savings for us. As far as I can tell, the lady you see there all the time is the owner and she is always nice. Lots of times I'll see her talk to the service and see some extra edamame show up in front of us. She really is trying to take care of her customers and get them to come back.  It shows. Rock on sushi 21! \n\nFavorite roll there is the playboy roll"
        }, 
        {
            "index": 444, 
            "rating": 2, 
            "review": "The food is okay....but I had a bad experience with them last time and the food is not that good to go back there. \n\nI had a discount coupan from yelp for sushi 21 when I got there the waitress started making excuses and eventually said we only do this for people who eat here and yours is a take out. It was only a 2 dollar discount but they arguing and making up excuses for 2 dollars specially in a very rude manner was a bummer. I would not go back..specially it is very close to Goyemon sushi its so easy to switch."
        }, 
        {
            "index": 445, 
            "rating": 2, 
            "review": "Ordinary sushi joint. Nothing really stood out except for the following:\n\nThey don't serve soft shell crab (my favorite), hand rolls and their uni was definitely not fresh. \n\nThe uni was a brown pasty color that resembled beef, opposed to the bright yellow/orange. The chef claimed that the uni was bought that morning and can provide a receipt. The chef stated that the uni was brown due to \"the wind,\" aka oxidation. \n\nThe servers were nice and I was super impressed with their memory! They retained all of our orders verbally and did not take any notes. \n\nThe AYCE was about $27/person."
        }, 
        {
            "index": 446, 
            "rating": 4, 
            "review": "For a Sushi place off the strip. It's pretty damn good! Plus I've lagged on this review when they deserved it the day of.. or after. Whatnot.\n\nThey have lunch special rolls here. And I'll say.. its BOMBDOTCOM. Simply Delicious. Get the Salmon Roll and definitely the Lobster.\n\nLUNCH TIME. Remember. Also... these people are Korean not Japanese. Don't get confused.\n\nThey also have neat little names for their rolls... the \"Heart attack\" roll.. and \"kiss me\" haha.\n\nI can't say much other than.... EAT HERE! Its a pretty good price. And delicious.\n\n\nI feel like a fatty..."
        }, 
        {
            "index": 447, 
            "rating": 5, 
            "review": "Just finishing up dinner here for the first time and it was amazing!  All of the sushi rolls and the appetizers were so yummy!  Great service too.  We will definitely be back!"
        }, 
        {
            "index": 448, 
            "rating": 4, 
            "review": "Food was really good any of the lasagna orders you can't go wrong. I recommend the muscles and the lobster lasagna"
        }, 
        {
            "index": 449, 
            "rating": 5, 
            "review": "The sushi was delicious and if you're really hungry, the all you can eat sushi special cant be beat.  It's about as much as two full rolls, so if you're not eating more than that, then just order the rolls you want.\n\nI loved the Sushi 21 roll and the \"I Love My Ass\" roll too.  Just hearing the cute server say the name of that one was enough reason to order it, but it tasted really great too.  The prices were reasonable with most full size rolls between 9 and 13 dollars.\n\nThe service was very attentive and friendly, and the free refills on drinks were nice too.  I enjoyed it eating in and ordered it delivery the following day.  It was just as good the second time.  It's definitely my first choice for sushi."
        }, 
        {
            "index": 450, 
            "rating": 5, 
            "review": "Omg I LOVE this place!!! The whole staff John and Kenny everyone here is SO nice! The place is immaculately CLEAN and the sushi is to DIE FOR!! I come here at least once a week cuz I just can't get enough of Sushi 21!!!!"
        }, 
        {
            "index": 451, 
            "rating": 5, 
            "review": "Sushi 21 is one of my favorite sushi joints!\n\nEvery time I'm in that part of town I stop in. \n\nFamily owned business and great food!\n\nThe fried rice is the best!"
        }, 
        {
            "index": 452, 
            "rating": 5, 
            "review": "Great service, amazing food and a fun time. The All You Can Eat sushi is the best deal in town. The craftsmanship of the rolls is superb. We will be coming back in the near future. Sushi 22, Yaaaaassssss!!!"
        }, 
        {
            "index": 453, 
            "rating": 2, 
            "review": "I didn't like it.. Just tasted bland. Rolls were over sized. I don't like pieces that I can't just pop into my mouth and have explosions of flavors.\n\nHowever they had a great soft shell crab.. And that was about it\n\nService was just okay.. Girl was super nice not very attentive.."
        }, 
        {
            "index": 454, 
            "rating": 5, 
            "review": "This is our second time here and each visit has earned 5 stars! The food is amazing! Also, they offer an all you can eat sushi buffet for a great price ($21.95 for lunch and $26.95 for dinner), and they have over 80 different types of sushi to choose from. Service is absolutely wonderful. Owners take excellent care of thier customers also. Will be back again soon!"
        }, 
        {
            "index": 455, 
            "rating": 5, 
            "review": "I've eaten here a few times and I have no complaints! The variety of rolls is awesome and they have so many spicy choices! I also love the k-pop videos they play in the restaurant."
        }, 
        {
            "index": 456, 
            "rating": 5, 
            "review": "We came for the AYCE lunch, which is very reasonably priced considering you can get ALL THE SUSHI YOU CAN CONSUME. \n\nGreat variety of classic rolls, deep fried rolls and non-traditional rolls (I really liked the chicken teriyaki roll)\n\nVery happy with everything for my AYCE experience. \n\n5*****"
        }, 
        {
            "index": 457, 
            "rating": 3, 
            "review": "I love sushi. Saying that I am disappointed with this sushi place. \n\nFirst and foremost the menu. The menu was good the choices were plentiful and they even allowed you to get sashimi. The fish quality was good the salmon was fatty and the hamachi had great flavor and texture. \n\nBut the main problem I had was the rice. The rice is the most important counterpart to sushi and the rice here had no flavor. The more I ate the more I couldn't get over this. \n\nFinally, the fried food was over battered and hard to eat."
        }, 
        {
            "index": 458, 
            "rating": 5, 
            "review": "This place hit the spot for late lunch/early dinner...rolls we tried were the \"President, Double Yellowtail, King of Ocean and Kiss of Fire. ...too delicious. ..seafood salad was a good teaser,and that Golden spoon too delicious. ..So happy we came in for this treat..\nWe will be back again real soon since I don't eat meat on Fridays only seafood"
        }, 
        {
            "index": 459, 
            "rating": 5, 
            "review": "Came here twice for the all you can eat sushi and it's real good! They bring the food out fast and the service is nice and friendly. This is my new go to s"
        }, 
        {
            "index": 460, 
            "rating": 1, 
            "review": "If you love sushi then you know it is not cheap. Very disappointed that the service was terrible, the food was not authentic and it is way overpriced. There are many other places in Vegas that serve authentic delicious sushi. I will never visit this place again."
        }, 
        {
            "index": 461, 
            "rating": 5, 
            "review": "Great food!!   Great service.  Grilled yellow tail collar to die for.  Sushi very good"
        }, 
        {
            "index": 462, 
            "rating": 5, 
            "review": "The best! \nSeriously my favorite. My husband and I get sushi once a week and have tried almost every place in LV. This is the best. Easiest to order, less busy than goyumon, great selection and delicious fish. Highly recommended"
        }, 
        {
            "index": 463, 
            "rating": 1, 
            "review": "This was the most inconvenienced lunch I've ever had. I came in by myself for a quick lunch and it was the worst experience. The waitress tells me right when I walk in that I made it in time for the all you can eat lunch special for $21.95. So I thought okay cool I'll go ahead and order a couple of things. First of all, it was slow. Nobody was in the restaurant but myself and yet it took 20 minutes for a sushi roll. On top of that, they messed up my order. I asked for a spicy tuna hand roll and instead of what I asked for, I got some crab roll. I brought this to their attention and instead of helping, they just brushed it off like no big deal. I asked for my check, that took another 10 minutes, mind you I'm still the only one in the restaurant, and when I finally got it, it was wrong. THEY WERE TRYING TO CHARGE ME FOR THE DINNER PRICE! I asked the waitress why is it that I was told it was still lunch and yet I'm getting charged for dinner. She said it was because it was 3:02 when she put the order in and lunch ended at 3. WHAT? She was the one that specifically told me it was still lunch time. She went to go see if her manager can excuse it and give me the lunch price and he said fine I'll give you the lunch price but we're going to charge you the hand roll you didn't touch. Um. You messed up MY order and then expect me to eat it all? I was infuriated. Worst experience ever. I'm never coming back to this sushi place. There are so many other sushi places close by that are better than this one, and they have better service. Don't waste your time here."
        }, 
        {
            "index": 464, 
            "rating": 1, 
            "review": "FIRST OF ALL, THIS RESTAURANT IS RIDICULOUSLY MANAGED. HOW DO YOU EXPECT CUSTOMERS TO WRITE A REVIEW EVEN BEFORE YOU EAT THEIR FOOD AND EXPERIENCE THEIR SERVICE? THEY OFFER 10% DISCOUNT IF YOU WRITE A REVIEW AND YOU HAVE TO SHOW THEM THE REVIEW YOU WROTE. THATS JUST SO SKETCHY. SO I CAN ONLY ASSUME THAT THE HIGH RATING OF THIS PARTICULAR RESTAURANT IS BECAUSE EVERYONE REVIEWED FOR THE 10% DISCOUNT.\n\nI walked in the restaurant with the boyfriend and OH MY GOSH, I have never seen a waitress that look so rude and mean before in my life. She had hell of an attitude that just showed so clearly on her freaking face, the way she talked and handed our menu. YOU KNOW WHAT? IF YOURE GOING TO GIVE A DIRTY LOOK LIKE YOU DID, CAN YOU NOT WORK? NO CUSTOMERS WANT TO SEE YOUR FACE AND DINE THERE WITH THE CRAPPY SERVICE YOU 'THINK' IS SERVICE.\n\nSo you think I am overreacting? Oh hells no. I have to admit I am very sensitive about customer service. My boyfriend? He likes to keep it to himself and he always tries to stop me if I want to complain to the waiter/waitress. He was the FIRST one to tell me about that waitress. He immediately felt like he wanted to leave but we already stopped by 2 restaurants before this one and we were just SOOOOO HUNGRY to go elsewhere.\n\nSushi was so thin. PERIOD. Fish to rice ratio was so bad. Too much rice and fish was so thin that it was so TRANSPARENT. We didnt order much on our first batch and there were only one or two other tables besides us and it took FOREVER to get our order. We specifically asked no sauce on any of our nigiri and they forgot and put sauce on it. I told that rude waitress about it and she went to go tell the sushi chef and she comes back asking very ruthlessly, 'are you not going to eat that?' I wanted to freaking get up and tell her off because of her arrogant attitude. UGHHHHH. Miso soup was salty as hell. I took a sip and put it to aside.\n\nYou can only order two rounds compared to three at other restaurants. I dont know why this restaurant is still in business and not only that, they definitely need to re-hire the servers and get rid of the rude and arrogant ones. Also, fish meat has to be much more thicker. The sushi chefs need to be more professional. They curse and talk too much when making sushi. They walked out of restaurant with the apron on and came back inside and didnt see then washing hands EVEN THOUGH they wear gloves to make sushi.\n\nI wanted to go to Goyemon but their wait was way too long for two hungry stomachs. This restaurant was probably the worst one out of my Vegas trip this week. I didnt want to leave any tip for the waitress and I do not feel bad about not leaving tip because I have no reason to give her any. My boyfriend said to leave it for the other waitress that was slightly 'better' than the rude one.\n\nI am korean and I do go to Korean owned susbi restaurants because AYCE sushi is mostly ran by Koreans BUT!!! This place is missing every component of a good restaurant.\n\n1. Good food.\n2. Good service.\n3. Good portion.\n\nI am not sure IF this restaurant is affiliated with other Sushi 21 in California in cities like Oceanside and San Pedro but one of them is CLOSED and the other one is BARELY running. Their rating is so low. At least they didnt 'buy' the reviews from customers.\n\nAND NO I DONT NEED YOUR FREAKING 10% DISCOUNT. I HAVE ENOUGH MONEY TO AFFORD MY MEAL."
        }, 
        {
            "index": 465, 
            "rating": 5, 
            "review": "Good sushi and very clean good ayce prices are like most sushi places. Ayce $21.95 for lunch $26.95 for dinner good variety of different rolls"
        }, 
        {
            "index": 466, 
            "rating": 5, 
            "review": "Fantastic food, and great attention to detail. Definitely recommend coming here to get your sushi fix. The dessert options are amazing and always delicious."
        }, 
        {
            "index": 467, 
            "rating": 5, 
            "review": "Great service and great food!! Props to our waiters Betty and Jayden who were amazing. My friend and I got the AYCE lunch and it was delicious! We ordered and quickly received our food. The AYCE includes appetizers, sushi and even dessert. I would highly recommend this place :)"
        }, 
        {
            "index": 468, 
            "rating": 4, 
            "review": "Good fun, cool music, loved the vegetable rolls and the California  rolls were huge! Also the service was smiling and very attentive! Thank you!"
        }, 
        {
            "index": 469, 
            "rating": 1, 
            "review": "Ordered about a hundred dollars in sushi to be delivered, and was told less than a hour. An hour and half later I called and they told me the delivery person has already left. Then call thirty minutes later to talk to the manager, and they tell me Angela just left about 10 mins ago to deliver my food who is owner of Sushi  21 she shows at my house was extremely rude still wanting to charge me full price and takes the food and goes! I will never order from \nthis place ever again. They are dishonest and the ownership is extremely rude."
        }, 
        {
            "index": 470, 
            "rating": 1, 
            "review": "We arrived to Sushi 21 at 1:42am looking for some late night sushi. It's listed as being open until 3 am but don't expect to be able to order anything past 2! We were told right after seating that the kitchen had already been closed for the night and ayce ended at 1:30am. Fine, we were just wanting a few rolls and some miso anyways. As we finished our first roll and were just working into our second we decided to order another just before 2am....SORRY CHARLIE, try doing that and you're S.O.L.! The sushi chef had already closed up everything. Thanks for the \"last call\" notice! Not that we should be surprised, the waitress wasn't even sure what was in our rolls when asked, she had to grab a menu! I thought server knowledge was a requirement in a restaurant... guess not here. The food was good but the service was lackluster bordering on crappy. And for being the only 2 ppl in the place, you'd expect a little more attention and service. Don't think we'll be returning here."
        }, 
        {
            "index": 471, 
            "rating": 5, 
            "review": "We love this place. Been coming here since we moved to Las Vegas and we've never had a bad experience. Kenny John and Justin are the best. Its always fresh and the nigiri is always nice and cold. Plus the chefs love to have a good time just like us. :-)"
        }, 
        {
            "index": 472, 
            "rating": 5, 
            "review": "I love this place the service is always good and the sushi fresh i highly recommended this  place to anyone that wants excellent sushi"
        }, 
        {
            "index": 473, 
            "rating": 5, 
            "review": "Wir waren positiv überrascht, weil der Laden etwas außerhalb lag. \nSehr freundlich Personal und nie um einen Tipp verlegen. \nWer gerne mal was anderes, als Burger und den anderen Scheiß essen will kann hier gut essen!"
        }, 
        {
            "index": 474, 
            "rating": 4, 
            "review": "This place is a fun atmosphere amongst having sushi and appetizers soups and deserts.\nKorean pop music and sports playing on big screens.\nAll you can eat menu was delicious!\nFun place for a date or casual dinner."
        }, 
        {
            "index": 475, 
            "rating": 5, 
            "review": "Was super delicious with great service. Fish was fresh and very unique. I loved it ! I recommend the Mega Box and the Spicy Rainbow Roll. Thank you all again"
        }, 
        {
            "index": 476, 
            "rating": 5, 
            "review": "Everything was fresh and tasted great. Popcorn lobster roll was delicious.Service is fast and friendly. I will be coming back."
        }, 
        {
            "index": 477, 
            "rating": 5, 
            "review": "First time @ Sushi 21\nI typically stay away from AYCE ... If you do AYCE, do Sushi 21!\n\nThey also have a very reasonable AYCD(rink) for 10$. Super fair.\n\nBOGO on hot sake & the fish to rice ratio is great- you never have to ask for \"Easy Rice\"\n\nVery attentive servers and Chefs- you never have to wait to order\n\nCame on a Tues after 6pm\n\nWould recommend Sushi21 for the AYCE fans!"
        }, 
        {
            "index": 478, 
            "rating": 5, 
            "review": "This place never disappoints! Fresh food w/fast and friendly service.. .what more could you ask for?"
        }, 
        {
            "index": 479, 
            "rating": 5, 
            "review": "Great spicy tuna!!! Great, friendly service with amazing sushi! What else could you ask for?? Will be coming back!!!"
        }, 
        {
            "index": 480, 
            "rating": 2, 
            "review": "Forgivable.\n\nOverall the ambiance and the service from the staff was very nice, but the quality of the fish had left to be desire.\n\nThe 2 most basic staples in a sushi restaurant is Tuna and Salmon and I could not express my level of disappointment in the Sushi, the Salmon wasn't the freshest or the highest quality so it tasted like bland slabs of meat along with the fact that there was too much vinegar was used in the rice.\n\nThe rolls on the other hand were flavored very well, but if you're trying to cover up the taste of bland fish, you're going to have to use the right sauce.\n\nOverall this place forgivable, but I don't think I'll be plopping $68.00 (with tip) for 2 people for all you can eat of that quality."
        }, 
        {
            "index": 481, 
            "rating": 4, 
            "review": "Great spot! Love all the menu options.  Popcorn lobster is my favorite.  The service is great and the waiters are very friendly.  The location is okay, but it is easy to get to.  This is one of the best AYE sushi spots in Las Vegas.  I hope this was helpful!"
        }, 
        {
            "index": 482, 
            "rating": 5, 
            "review": "First time at Sushi 21 and I was satisfied. Service was very fast, I didn't have to wait long for my food. Popcorn Lobster and Sushi 21 are my favorites so far. I would recommend for people to try this place out!"
        }, 
        {
            "index": 483, 
            "rating": 5, 
            "review": "It was very good food. Fish is so fresh. All employees are very nice of me & delivery good customer servicr. Particularly, sushi chefs have good skill & very nice. I would like to recommand all my friends to eat at sushi 21."
        }, 
        {
            "index": 484, 
            "rating": 5, 
            "review": "5 stars for the super delicious Chicken Fried Rice. It's like.. Gingery sweet with a kick of black pepper OMG so good! Yes yes yes! No other fried rice can compare!"
        }, 
        {
            "index": 485, 
            "rating": 2, 
            "review": "I came here with four friends on a Monday night. A couple of friends just looking for some good AYCE. They made us wait 20 minutes before being seated when there was 5 seats available at the bar. Once we were seated they had good service though! Very friendly! The rolls were okay, lobster popcorn was good! Nigiri was not fresh. Yellow tail tasted like soap, UnI was not the right color. They were fast and friendly. They charge 18% for parties of 5 or more, dinner is 26.99. I didn't find it worth it"
        }, 
        {
            "index": 486, 
            "rating": 5, 
            "review": "Extremely delicious AYCE with great service.  We ended up researching online for hours only to end up a block from our house. My other favorites are umiya and oyshi."
        }, 
        {
            "index": 487, 
            "rating": 4, 
            "review": "I ordered takeout. Spicy rolls were very spicy, soup portion was really small as was the cucumber salad which is to die for. They deliver but expect to wait if you call during peak hours.\nI hate trying sushi when I'm away from home but I was more than satisfied with this restaurant. I recommend it to every friend who visits Vegas. Everyone must try the cucumber salad!"
        }, 
        {
            "index": 488, 
            "rating": 5, 
            "review": "Good food even got free stuff! I strongly recommend to try this place. They're located on Tropicana and Decatur"
        }, 
        {
            "index": 489, 
            "rating": 4, 
            "review": "Great AYCE place. Would definitely recommend super white an yum yum scallops. Heart attack roll was delicious if you like spicy rolls like me. Try this place and you won't be disappointed."
        }, 
        {
            "index": 490, 
            "rating": 2, 
            "review": "Stingy service! Decent food.\n\nI went with a group of 5 for a co-worker's birthday for the all-you-can-eat-and-drink menu ($36 per person - total of $46 including tax and mandatory 18% gratuity for group over 4 people).\n\nAfter an hour of happy devouring, my hungry co-workers (3 men and 1 girl) finally slowed down, with half a roll of tuna and baked salmon left on the plate. The waitress came by and urged us to cancel the rest of our order until we finish all our sushi, otherwise she said they would charge us. We figured the remaining sushi was equal to one more piece per person to finish, so we insisted on our order of 2-piece sweet shrimp nigiri anyway, because we were craving sweet shrimps. \n\nWe waited for another 15 minutes and asked the waitress twice, yet the sweet shrimp nigiri didn't come. Finally the waitress said that they \"ran out of shrimp and is waiting for shrimp to defrost\". That was when we realized that the waitress was counting on us not to finish our roll, and she was not going to bring out the sweet shrimp nigiri until we finish everything. \n\nSo we did clear our plate, and finally the sweet shrimp nigiri came. I know sweet shrimp is considered a more expensive item, but this behavior from the restaurant management just feels petty. Considered how much the cost was per person, and that our group was well-behaved and not rowdy, this is no way for a business to treat customers!"
        }, 
        {
            "index": 491, 
            "rating": 5, 
            "review": "Great menu selection for all you can eat sushi! Good customer service. Recommend the green mussels and pretty much all the nigiri they have. Portions are on the smaller side, but thats great to be able to try a variety of things!"
        }, 
        {
            "index": 492, 
            "rating": 5, 
            "review": "This place is great, never disappoints. Awesome selection of rolls and apps for AYCE, and everything I've had is delicious. Service is always very good as well. I'm so happy that they serve half-rolls so I can try several different things each time I come here. Some of my favorites are the Frozen Roll, Pink Roll, White Dolphin, and the Crispy Rice, they all rock :)"
        }, 
        {
            "index": 493, 
            "rating": 5, 
            "review": "First time here tonight!\n\nI've been to many sushi places , and I usually go to sushi Mon and the first thing that caught my attention was the smiles and the good service. \n\nSeri took me and my friend to the bar and we had Sol as our chef! \nGreat service from her  and Sol got our orders quick! \n\nFood was great! Get the dynamite if you like fried foods and the S.W.A.T. for a regular roll(s). Udon was nice and balanced. \n\nEat up!!"
        }, 
        {
            "index": 494, 
            "rating": 5, 
            "review": "Friendly customer service & great sushi with fresh fish! Tempura ice cream is a must try! Will be coming back!"
        }, 
        {
            "index": 495, 
            "rating": 3, 
            "review": "Mmm, sushi. My favorite thing to eat. This past weekend I introduced my friend/co-worker to the world of sushi, and she is already hooked... So we decided to get some take-out from Sushi 21 for lunch.\n\nSince my friend is still new to the world of sushi, we decided to stick to rolls, and mainly to ones she had tried already. So I called in and ordered a Philly roll, a Spicy Tuna roll, and a Las Vegas roll. I was told it would be ready in 10-15 minutes. \n\nThe rolls weren't ready when I arrived, I waited a good 5-10 minutes for them. Service was friendly though,  and the rolls were fairly inexpensive, the total was $22 and change.\n\nThe rolls were tasty although the Philly was a little loose, they kept falling apart on us...  Generous amount of tuna in the Spicy Tuna roll, and I appreciated that they gave us eel sauce on the side for the Las Vegas roll. \n\nWas this the best sushi ever? No, not even close. But it's inexpensive and close to work, so it's likely I will eat there again..."
        }, 
        {
            "index": 496, 
            "rating": 5, 
            "review": "Best sushi love the popcorn lobster and Philadelphia role. Been here 3 days in a row love it. Such great customer service. Number one in Vegas"
        }, 
        {
            "index": 497, 
            "rating": 5, 
            "review": "We workout next door and stumbled in. It was delicious! We will definitely be back again soon!"
        }, 
        {
            "index": 498, 
            "rating": 5, 
            "review": "The food is good and the service is even better! Plenty of appetizer options and special rolls on the all you can eat menu. Very clean and they play Kpop music videos!"
        }, 
        {
            "index": 499, 
            "rating": 3, 
            "review": "my review for this place is strictly for the food since i came here with a friend who knew the owner, so i have no idea how much everything actually cost...=)\n\nrolls - there are about 30 diff ones on the menu...the ones that i can remember the best were the \"coco roll\" (seared yellowtail with ponzu sauce over a spicy tuna roll(?)) and the sushi 21 roll (eel and tuna on top, cant remember the middle)...we also had a bunch of other ones floating around the table, which were all pretty good, but these 2 were my favorites\n\nnigiri - a little bit dry...liked that they didnt put too much rice, but some of the fish just didn't look too appetizing...\n\nappetizers - tried the edamame, seaweed salad, and gyoza which were all pretty good, but also pretty standard...\n\nif you have a car, it might be worth visiting, but if you have to cab it, i would try some place else since its about a $15 ride from the strip"
        }, 
        {
            "index": 500, 
            "rating": 5, 
            "review": "Very good food! Service was fast, the whole staff was on the ball. Great teamwork! Will come back and tell people about it"
        }, 
        {
            "index": 501, 
            "rating": 5, 
            "review": "I love Sushi 21! I've been coming here for about 6 years now. The food is fresh and the service is great!"
        }, 
        {
            "index": 502, 
            "rating": 1, 
            "review": "You've got to be kidding me; $10 for 6 pieces of mediocre sushi?!?!  Highway robbery..."
        }, 
        {
            "index": 503, 
            "rating": 1, 
            "review": "My husband, two friends and I went for their all you can eat. While the sushi was decent, the service was absolutely horrible. They give you a list to check off what you want, and we told them we wanted two lists, but they'd only give us one. They kept bringing out only what two of us ordered, and the other two wound up sitting and waiting, because we'd order stuff they didn't want. They only brought two rolls at a time, and we'd wait anywhere from 10-45 minutes for the next roll. We never got everything we ordered, and every time we'd tell a waitress we were still waiting on rolls, she'd just nod yes. There was a huge language barrier and when we asked to talk to the manager, she didn't understand what we were telling her. Everyone went home hungry and wound up eating at home. \n\nAlso when it came time to get the check? Somehow our 4 all you can eats, with 4 drinks totaled to $150, they totally overcharged us AND added an 18% gratuity for our table, nowhere in the establishment does it say that gratuity is charged for parties of 4."
        }, 
        {
            "index": 504, 
            "rating": 4, 
            "review": "Great sushi!!! Lots of sushi to choose from. Although Wait time for sushi to arrive was long. The staff are kind of slow but friendly."
        }, 
        {
            "index": 505, 
            "rating": 2, 
            "review": "I always like trying a new all you can eat sushi place especially when it's so close by a very popular one like goyemon.  So I figured let's see if they're giving goyemon a run for their money.  HAHAHAHAHA not even close.\n\nTuesday night, 6 pm and there were 3 people in there, and no one else came in there the hour that I was there.  That's a BAAAAAD sign.  Typically tuesday is when sushi restaurants get their fresh fish and deliveries. If I recall, the fish markets are closed on mondays and there are no shipments.  So Tuesday & Wednesdays are the best days to go.  \n\nWithout even asking, they brought me edamame and miso soup.  I don't particularly care for when someone brings me something that I didn't order.  Their miso soup was lacking flavor and only had 2 spoonfulls, their edamame was fine.\n\nOn an all you can eat place, portions should be small-medium.  I ordered the sashimi salad and it was in a large bowl (toooo much) and the taste was just ok, it tasted like they put their garlic sauce that they put on their sushi rolls, onto their salad.  Maybe some people like this, but I sure didn't.\n\nTheir sushi rolls were avg. I saw lots of rolls on their menu that were based on california rolls and to me that is a sign of cheapness.  Another typical bad sign is when you can't order directly from the chef. They use the paper order forms and quite frankly I HATE the paper order forms.  \n\nI ordered 2 sushi rolls and they were just ok\n\nand then I ordered some nigiri and this sealed the deal that this place is bad...\n\nI ordered 2 hamachi and 1 super white (both were good)\nI ordered 1 order each of snow crab, uni and amaebi (sweet shrimp)  I didn't get any of those orders. The show crab was still frozen (I saw him put the large frozen block of it into the fridge behind the counter), and then he apologized they are out of uni and sweet shrimp.  Guess what folks...  Sushi mon and Goyemon are never out of it.\n\nand that leads me back to what I wrote above. Everything is usually fresh/delivered on tuesdays.  So where's your fish at????? \n\nSorry but for being 2 min up the street from goyemon (even if their servers are slow, the food is fantastic) I'm goin there instead"
        }, 
        {
            "index": 506, 
            "rating": 5, 
            "review": "This by far my spot when ti comes to eat sushi. It never disappoints.Great spot to bring people that are new to sushi"
        }, 
        {
            "index": 507, 
            "rating": 4, 
            "review": "We ordered a sexy roll which was decent. First class roll was awesome. Great flavor. We ordered all of the sashimi plates and the seafood salad. These were awesome. The service was excellent and on top of everything. I would have given 5 stars, but some of the rolls were basic and didn't have the best flavor."
        }, 
        {
            "index": 508, 
            "rating": 1, 
            "review": "Didn't even bother ordering.\n\nThe dance music was too loud.  The video screens were an unnecessary distraction.  One had a baseball game, the other some Asian show showing a young couple in the process of sensual mutilation.\n\nWhile this may be fine for a 20-something after hours crowd, this was not OK for family dining at 7pm.\n\nWe won't be back."
        }, 
        {
            "index": 509, 
            "rating": 5, 
            "review": "I've gone here a few times with my coworkers after work and it's been amazing every single time. I love that their kitchen closes at 1am-2am with a 50% off menu that lasts ALL day and they change the items every week.\n\nAlthough not on the 50% off menu, the Cherry Blossom and Screaming Orgasm dishes are musts! I'm told the Cherry Blossom is presented different each time, but I'm not sure... either way, it was so pretty that I almost didn't want to eat it. The owner is always extremely nice and welcoming. Great service and great food."
        }, 
        {
            "index": 510, 
            "rating": 5, 
            "review": "I am still in a sushi coma from yesterday.  I stopped in for lunch and enjoyed everything here. Their list of rolls is extensive,  and each is pretty distinct. I've found at other restaurants, they sometimes have what sends to be a long list of available rolls, but in reality, most of then are very similar. \n\nSushi was delicious and fresh and service was attentive.  I will definitely be back soon."
        }, 
        {
            "index": 511, 
            "rating": 5, 
            "review": "We've been coming here for 2-3 years and we bring all of our friends who come to visit here. THE POPCORN LOBSTER roll is AMAZING! The fish is always fresh and the service is fantastic. If your looking for a sushi place away from the strip this is a must go! You definitely get your money's worth for the all you can eat!! :)"
        }, 
        {
            "index": 512, 
            "rating": 1, 
            "review": "I usually don't write reviews but this Sushi 21 place was by far the worst sushi I have ever had. We did the all you can eat so we were able to try a bunch of different items and every one of them was really bad. Nothing is made fresh. Everything is frozen and the result is no flavor, awkward unpleasant textures and very poor quality. Presentation was also weird. Even the pickled ginger was flavorless and harsh to eat. I can't think of anything positive about the experience and I felt like my money was completely wasted. It was completely empty which should have been our first sign to walk right out before even sitting down. I can't believe it is still in business. It makes me never want to stray away from Kaya again which does almost everything well."
        }, 
        {
            "index": 513, 
            "rating": 1, 
            "review": "I have been coming here for a long time...I brought a friend from out of state because I beleive they have a good sushi...the sushi is ordinary nothing extra ordinary about it but the service was horrible. The guy who called him self a manager was the one who was serving us we order appetizer and 5 sushi for 2 and when we were going to try the other he was like I am not serving u if u don't finish what you ordered...it might be acceptable if he puts it in nicer way but he was super super rude....... We didn't even order the second round when we lost our appetite and walk out thank you...I will never come or suggest this place again."
        }, 
        {
            "index": 514, 
            "rating": 5, 
            "review": "What an unexpected surprise!\n\nWe were headed to Goyemon and discovered the hostess was not friendly and the wait at 5:40 on a Friday night for a party 3 adults and 3 kids was going to be 1 1/2 hrs.  Seriously?  There was just one other couple waiting ahead of us.  \n\nWe yelped the nearest sushi restaurant with 4 or more stars.  And turns out this was literally just around the corner.  \n\n- AYCE was $27\n- Decent selection on the menu\n- Favs:  (rolls) Sexy girl, Heartache, Johnny, Snake (or rattle snake...snake is in the     name or something)  Anyway, we tried a lot of rolls and enjoyed them all but these were our favorites.\n- VERY kid friendly (customized kids chopsticks), owner brought out crayons and color pages, and topped it off with balloons.\n- Dessert:  MOCHI (strawberry) - delicious ice cream in the middle and a chewy sweet rice cake on the outside\n- Sake bombs on the house the night we went.  (Who doesn't like sake bombs, especially when they're on the house.)\n- Friendly and entertaining sushi chefs. \n\nWe honestly felt like we were truly welcomed and at home.  Food was good and personal customer service was excellent.  We have found another joint we'll be frequenting often."
        }, 
        {
            "index": 515, 
            "rating": 1, 
            "review": "The fish for the nigiri was not fresh and was bad enough to get my girlfriend sick before we even left the restaurant. We were the only two in the restaurant and their service was still extremely slow. Overall I would not recommend this place."
        }, 
        {
            "index": 516, 
            "rating": 5, 
            "review": "Yummy sushi at reasonable price. Loved the variety of the menu items. Server was attentive. Definitely coming back in the future."
        }, 
        {
            "index": 517, 
            "rating": 1, 
            "review": "Never going back here again. \n\nI came in at 2:15 AM, because I had a late night craving for a bento box. I've been here before and while the food is mediocre, it's the closest place to my house that has bento boxes. \n\nAs soon as I walked in, I was greeted by amused smiles from the sushi chefs as they told me they were closed. When I informed them that Yelp said they closed at three and the door was unlocked, they said last seat is at 1:45. Okay, great, but I'm here for take-out. They then said the kitchen was already closed. \n\nI'm sorry, but if you close the kitchen at 2:00 AM, make that your close time. Now I've wasted my time and you've got a customer never coming back for your C+ at best bento boxes."
        }, 
        {
            "index": 518, 
            "rating": 4, 
            "review": "Quaint sushi restaurant in Vegas.  Good food and great customer service!  Don't forget to ask for Annabel!!"
        }, 
        {
            "index": 519, 
            "rating": 1, 
            "review": "Came here because the wait at Goyemon was too long. Very underwhelmed to say the least. \n\nFish wasn't very fresh, rice was too warm when served so it stuck to the plate after cooling & service was terrible. The menu literally said we got soup, salad & vegetable tempura with our nigiri combo order, but our waiter mad us choose and acted like we were jerks for wanting what we should be getting. \n\nStick to Jjanga or Goyemon. This place isn't worth your time or $$$"
        }, 
        {
            "index": 520, 
            "rating": 5, 
            "review": "Wow!!! All-you-can-eat sushi??? What a place!!! Stumbled upon this place on vacation with friends. Not on the strip but close by... They have sports playing the whole time and music videos playing... Awesome place. Food was absolutely great and so much variety, I will definitely be back!!!"
        }, 
        {
            "index": 521, 
            "rating": 1, 
            "review": "DO NOT GO. I had the worst experience ever!!!!! Sushi was terrible. It was so dry and did not have any flavor at all. We told the waitress we were not going to eat the food because it looked and tasted bad. The sushi chef comes out, finds out about the situation and goes \"What the fuck!!!!!.\" He kept asking us why we couldn't eat the sushi and did not take \"Because it tastes terrible\" as an answer. After we were done paying, the same chef followed us all the way to the door and started yelling in his own language and started throwing salt all around us. I know in some Asian countries they use salt for purification purpose, and therefore by throwing the salt around us he was treating us as \"bad luck.\" I would be surprised if he still works there because no one would want to hire such a rude crazy chef like him."
        }, 
        {
            "index": 522, 
            "rating": 4, 
            "review": "The fish is very fresh and the selection is endless.  We ate oysters, spicy crawfish  and marinated beef in addition to the great selection of rolls- King of Ocean and Banzai were our favorites.  The service was great from the sushi chef, Johnny, and waitresses.  I will definitely come back on our next trip to Las Vegas.\n\nJeff H."
        }, 
        {
            "index": 523, 
            "rating": 2, 
            "review": "Exorbitant prices.  Heavy flavor.  Lots of rice.  Little meat.  Long service and wait times.  Smelly dark interior."
        }, 
        {
            "index": 524, 
            "rating": 5, 
            "review": "Sushi Chef Johnny is very experienced and efficient. Entire staff was attentive. Fish was quite palatable. I will be back. AYCE was a value at $22"
        }
    ]
}