{
    "category": "Las-Vegas", 
    "entity": "Mac-Shack-Spring-Valley", 
    "avg_rating_stars": 3.394179894179894, 
    "review_count": 378, 
    "reviews": [
        {
            "index": 1, 
            "rating": 4, 
            "review": "Ahhhh the Mac Shack, nothing but bad for ya goodness!! I have tried many of the specialty dishes here but the one I always go back to is the Crazy Alfredo. My second choice is always the Smokehouse. My wife and daughter love the one with the hot dogs mixed in, can't remember what its called because I won't eat it! haha \n\nCheck this place out when you're in the mood for pasta fast."
        }, 
        {
            "index": 2, 
            "rating": 4, 
            "review": "Okay so here is the low down on Mac Shacks Wednesday soft opening. Walking in was a little confusing, I thought i would need to give my name or something to Verify that I was on \" The List\" but that did not happen. So we approached the register where the very friendly staff greeted us and began to give us the rundown at our request. We ended up ordering the pepper-jack mac and the asiago blue mac with 2 salads. \n\nBy the time that we got our seat situated outside with the fellow yelpers and began to kick off the conversations the food was arriving. The salad was good, it is very hard to go wrong with a garden salad and the pepper-jack mac, well... That was quite good. This product really beats the blue box. Next time I would play chef and add some chopped up jalapeno into it. \n\nBecky ordered the Asiago mac and cheese and it was also very good. I am not a huge fan of bleu cheese but this had a great flavor and was well executed. \n\nThe atmosphere fits the food, it has the hustle bustle feel, not that may be due to the fact that they were quite busy but it seemed very fast paced in there. I really don't have any complaints, the only thing I found odd was the plates and the way that they serve the food. What is with the tin with the newspaper or whatever it is with a fake wood bowl in it.... That is my only, \" Meh\" moment. \n\nGood luck mac shack and thanks for having us. Also, I swear I really did RSVP."
        }, 
        {
            "index": 3, 
            "rating": 5, 
            "review": "OMG!!!!\nCauliflower gratin! You must get this. It is just a wonderful and yummy dish! The sauce is amazing! Cauliflower is wonderfully roasted! I also indulged with the Mac and cheese sandwich. Delish! This place has been here for years and we just found out about this place thanks to Groupon! We will be back! We will make this a regular stop anytime we are in Vegas!"
        }, 
        {
            "index": 4, 
            "rating": 4, 
            "review": "I already love mac n cheese...then you add smoked bacon and bbq sauce?! Major nums indeee!"
        }, 
        {
            "index": 5, 
            "rating": 3, 
            "review": "The food is really great. \n\nHaving said that, it's overpriced and they nickel and dime you on everything. Plus the portion sizes are really not big enough."
        }, 
        {
            "index": 6, 
            "rating": 4, 
            "review": "It's like the Chipotle of pasta, where you can build your own pasta dish.\n\nI came here for the first time on National Mac n' Cheese Day, and you think a place called Macaroni Shack would have a special for National Mac n' Cheese Day, but it didn't.\n\nI tried the \"Bottle Service\" which is penne in vodka sauce with sirloin and mushrooms. Very tasty, tasted fresh and decent quality, and for some reason it was rung up a dollar cheaper than the menu price.\n\nI'll try this place out again, but during lunch when it's cheaper and more worth it."
        }, 
        {
            "index": 7, 
            "rating": 4, 
            "review": "Great restaurant for choosing what kind of Mac you want, has lots of options. I had the smokehouse bacon Mac and it was delicious when I added some Frank's to it. I would definitely return as its a great concept and they have gluten free!!"
        }, 
        {
            "index": 8, 
            "rating": 1, 
            "review": "Overpriced for what you get.  Service not that good.  I can make salad and pasta at home for cheaper"
        }, 
        {
            "index": 9, 
            "rating": 3, 
            "review": "My favorite kind of places are those where you can make whatever the hell you want to match your heart's desire.  Which pretty much means that Mac Shack fits right into that profile.  Relatively affordable and hits the spot if you need a quick food fix!  Service is ok as well."
        }, 
        {
            "index": 10, 
            "rating": 5, 
            "review": "Love this place. Best gluten free pasta option I've found in Las Vegas.. so far anyway. My favorite item is the smokehouse mac... it's pretty amazeballs. Also, the mac shack in spring valley uses postmates to deliver which, if you live in Southwest Vegas, you know is a rarity."
        }, 
        {
            "index": 11, 
            "rating": 4, 
            "review": "Love the smokehouse mac! Bacon, incredible cheese, and some tasty sauce. Go nuts!"
        }, 
        {
            "index": 12, 
            "rating": 4, 
            "review": "Had a really great pasta dinner here last week... Price was a little high and I was surprised they do not offer free bread with the meal. I had to pay for some low budget garlic sticks. Either way, the food was very good. Very clean as well....."
        }, 
        {
            "index": 13, 
            "rating": 2, 
            "review": "My cousin and I were craving oooey gooey mac & cheese, so this had to be the place right? Wrong. That's not what we got. We would've been more satisfied at home if I'd made Velveeta shells and cheese out of the box! We ordered the cheddar mac and the truffle mac. Our first two bites were pretty good, but once the dishes cooled down, they tasted like very bland leftovers, not \"made to order\" at all! The two stars are for the friendly customer service."
        }, 
        {
            "index": 14, 
            "rating": 5, 
            "review": "baked rigatoni was amazing! I was craving cheesecake's factory four cheese pasta, and I was able to have baked rigatoni, which is delicious :) boyfriend created his own pasta and the vodka sauce was superb, especially with mushrooms and olives. on the day we went there were families, strollers, a real family oriented place. I like how you can see the chef cook, nothing to hide! I would love to come back, I love the power of customizing!"
        }, 
        {
            "index": 15, 
            "rating": 5, 
            "review": "YUM!!!!   Looking at the pictures some of their pastas look ok, others not so much, but its called Mac Shack.....Get Mac n Cheese!  I tried the truffle one and it was delicious!  Price was VERY fair, I would have expected to pay way more as I have here in Vegas for crap food, but quality and taste here was great!. I got a side of breadsticks, you cant mess those up, and also side of meatballs.  Pay extra for the ricotta, adds extra goodness to them.  Ill definitely be back to try their other mac's. oh, also very quick to put my take out order together."
        }, 
        {
            "index": 16, 
            "rating": 2, 
            "review": "This is a place for when you're in the mood to order \"fast food\" pasta.  \n\nI've been here three times now and have officially written it off.  It's like this place is where decent pasta goes to die.  Each time I go, I hope for the best, but am always let down.  \n\nI've respectively given this place two stars for their service, convenience of being able to order online and the fact that I didn't get food poisoning.  \n\nI understand that this is a place to grab quick pasta.  So, expecting the crème de la crème is asking for a wee bit too much.  However, most of the plates average about $9.00 - $10.00 a piece, and that's usually for the smaller plates.  I can spend $10.00 for a way better pasta plate at any legit Italian joint.   I always try to order the healthier stuff.  Gluten free noodles and I build my own pasta so that I can ensure what exactly will go into the plate.  Unfortunately, there are a lot of times my plates are missing certain ingredients that I clearly paid for, and it's like you make up for the missing ingredients with lots-o-oil.  Sucks.\n\nAnywho, the customer service is great here!  The people working are always friendly and quick.  You also get free garlic bread and a drink upon check in.  However, the garlic bread has always been kind of stale and flavorless.  The pasta is always super oily.  I understand how to make good pasta and oil is an active ingredient, however, there's always a ton of oil and grease leftover.  It's just too much.  After finishing a plate, I always feel like I just ate six orders of super-sized french fries at Micky D's.   I also feel the need to wash my face due to the overuse of oil.  It's that bad.  You just feel all-around crappy.  \n\nLastly, their Mac 'n' Cheese kind of sucks, too.  Almost as if it's doused in the worst cheese money can offer and a ton of oil.  It just doesn't work for me.  Like the pasta, I'm always left feeling AWFUL due to all the oil thrown into their dishes.  \n\nDon't waste your money.  Either, get a decent, quick plate at Noodles and Co. or make your own.  You'd be better off getting jarred marinara sauce and 99 cent noodles at the market.\n\nOwners/Staff:  Maybe using less oil in your dishes?  Or finding a way to funnel out some of the oil so that we're not left with a bowl full of oil.  It's similar to eating lucky charms and being left with the pink and sweet flavored milk.  Only difference being that the pink milk tastes good.  Also, when people build their own pasta...  Ensuring all ingredients are in said pasta and plenty of it as you charge 50 cents for each ingredient.  50 cents for basil?  Two words:  Rip-off."
        }, 
        {
            "index": 17, 
            "rating": 3, 
            "review": "So I was on POSTMATES looking for a quick delivery... Pretty quick. I saw this Buffalo chicken Mac as well as the Spinach and Artichoke Mac as well. The Spinach and artichoke was totally yummy.. But the Buffalo chicken however was not. The Mac was mixed with a blue cheese crumbles that I could not eat nor stand. It smelled yummy and I would have eaten it if the blue cheese wasn't in it. Other then that the breadsticks were good and so was the other pasta, just needed a little more flavor..."
        }, 
        {
            "index": 18, 
            "rating": 3, 
            "review": "IT was okay.  Cool experience for simple pasta dishes.  \n\nI did enjoy the mac and cheese"
        }, 
        {
            "index": 19, 
            "rating": 4, 
            "review": "We love mac shack!  We just wish there was one by us.  My favorite is the smokehouse.  My wife gets what she is in the mood for and has tried the blue cheese, cheesesteak, smokehouse, and create your own.  I would highly recommend upsizing your meal as this will more than likely give you leftovers!  The upsize is a steal for that reason alone.  The service is alway friendly and on the way out, grab a tootsie pop!"
        }, 
        {
            "index": 20, 
            "rating": 4, 
            "review": "I am was quite surprised here. I thought it would be pre cooked pastas with lots of old gross cheese. \n\nIn fact, the pasta was fresh and the sauces were great. \n\nI had angel hair with meat sauce. I know... Boring. But it was great. Fresh, meaty and yummy. \n\nWe also had pasta with garlic and oil. Then added shrimp for $.50. Only a few small shrimp were in the pasta (- 1 star)  \n\nService was friendly and helpful. Service with a smile!\n\nPricing was not bad. $17 for the both of us. I would definitely come back when on this side of town."
        }, 
        {
            "index": 21, 
            "rating": 2, 
            "review": "I'm torn about this place.  Its close for lunch and its nice to have as an option other than the typical choices.  \n\nThe food is decent, but not great.  The employees are well trained and seem to have had \"If you can lean, you can clean\" ingrained into them.\n\nThe one thing I definately don't like:  this is not BK ... and you can't have it your way.  The lunch special is a pretty good deal but when I specifically said I didn't want soup or salad I was told I HAD to take it.  What kind of restaurant forces you to take something you don't want?  I suggested another breadstick instead and was told no.   I guess they wanted to see a full bowl of soup (its 105* out .. I don't want soup) get thrown in the garbage instead.\n\nI was told this is Franks rule.  I think that was the owners name ... \n\nThe bottom line is that I don't need Mac Shacks food, but I imagine Mac Shack needs my business ..."
        }, 
        {
            "index": 22, 
            "rating": 3, 
            "review": "I've been here a few time since they've opened (we attended one of their tasting events or some sort of fundraiser?) and have enjoyed it. What really stands out to me are the number of choices and the vast combination possibilities. That's fantastic. Also, you get fresh pasta dishes and quickly. I LOVE that they offer Farro and Wheat pastas! I've had the Farro in one of their \"Favorties\" called THE VEGGIE and it was delicious. Simple, garlic-y, and the vegetables were fresh. I've had the CRAZY ALFREDO multiple times (usually with penne) and it's been delicious. The last time I visited though, the shrimp was not good and the sauce was just okay. Everything else that myself and my companions have tried has been tasty. I think the prices are decent for their portions, however, they may have changed that since the beginning. Next time, I'm definitely creating my own with some basil, ricotta, garlic & oil sauce, and a bunch of vegetables. That sounds good right now, haha! Anyway, it's a great place when you want pasta quick and relatively fresh, especially if you just don't want to cook."
        }, 
        {
            "index": 23, 
            "rating": 2, 
            "review": "Used to be very good, not great.\nWhen Robert was manager, we felt our business was important to Mac Shack\nNow they have changed the quality of the chicken that they use...\nso we stayed away for a while.\nRecently, we were compelled to try them again, we called to ask about the chicken to see if it was boneless skinless chicken... we were told yes... so we ordered to go...\nGot it home, skin all over what little chicken was actually in the meal...\nNot Good, they don't know the difference. We do"
        }, 
        {
            "index": 24, 
            "rating": 3, 
            "review": "It's an interesting concept. Pastas with your choice of toppings. And for the less creative or lazy soul, they've concocted some creations for you. The prices are not too steep....$8-$10 should get you a large portion with decent mix-ins and they give you a 20% discount for Meatless Mondays. Quite progressive for Las Vegas if I should say so. There is also \"Baby Bowls\" catered towards children but really, there's more than enough pasta in one for a full-grown human. \n\nThe pasta dishes I've had really haven't blown me away. I can make better pasta at home. With fresher ingredients. BUT....sometimes out of sheer lethargy and a massive carb craving, Mac Shack will do the trick. If I didn't work close to this restaurant I probably wouldn't bother with it. \n\nSummary: Palatable pastas, not-so-fresh ingredients, bordering on stinginess on quantities of toppings and decent service.\n\nIt's doable but do I really want to \"settle\" so often?"
        }, 
        {
            "index": 25, 
            "rating": 5, 
            "review": "Loved this place!! I love Mac n cheese and this place didn't disappoint!! I had the Spinach Artichoke Mac n Cheese! Delish!! They even give you a free Tootsie Roll lollipop as you walk out! Will be back very soon!!"
        }, 
        {
            "index": 26, 
            "rating": 3, 
            "review": "I'm going to go ahead and give this place an incomplete until I have tried even a small percentage of the menu. I went in with two friends for lunch and the place already seemed busy which is a good sign. The staff was very friendly and eager to explain the concept which is a pleasant surprise for fast food. I agree with Misti that it seems like a Chiptole style fast food joint that serves pasta.\n\nThe funny part about my order was that I stole it from one of the pre-made \"Mac favorites\" and saved myself a quarter. I got penne with the broccoli pesto and roasted garlic. My friends both ordered overloaded pasta with lots of toppings but both settled on more traditional sauces. Their dishes were both delicious but I ended up not enjoying my dish as much as I had hoped. The flavor was incredible but my pasta looked to be swimming. It appears the chef didn't realize I ordered pasta and not soup. If they had toned down the amount of sauce or added more pasta I think the result would've been a 4 star lunch.\n\nLike I mentioned above the jury is still out on this place until I can try a lot more combos. The fact that I enjoyed 2 out of 3 dishes and the 3rd could be saved with a bit of tweaking makes me think I'll be visiting this place semi-frequently. I'm glad I pestered my friends until they accompanied me. Hopefully I'll be able to bump the rating to 4 stars on my next visit. Mmm....Alfredo!"
        }, 
        {
            "index": 27, 
            "rating": 1, 
            "review": "I've been to this place twice. The first time I thought is was a fluke or perhaps bad timing,  because the pasta had the consistency that it had been sitting out. The sauce was ehhh at best. So a year later, I said let's try it again. I asked for the best dish they made. Now I understand that this is a loaded question, but I wanted to like this place. The clerk recommended the Buffalo pasta. It sucked. I'm flying out of the country soon and I hope I don't get sick. I'm usually not this critical, but save your $10 -$12 or go somewhere else. I'm not sure how they pay the rent."
        }, 
        {
            "index": 28, 
            "rating": 3, 
            "review": "This is an o.k. place to take your kids who probably will not apriciate great food anyway! As an adult with taste buds, the food doesn't make the grade! This sucks because I am a big fan of the Crazy Alfedo at Nora's! The ingredients at the Mac Shack are a far lower grade!"
        }, 
        {
            "index": 29, 
            "rating": 4, 
            "review": "This place was great!!  I loved the buffalo mac & cheese, delicious and its definitely got a kick.   Love the idea of this place, overall.. all kinds of mac & cheese flavors, appeals to both kids and adults -- it's a win win :)  The location & inside the building is really nice too, lots of windows and natural lightings. Unfortunately I'm not a LV resident, I was just visiting my sister who just moved there! :)"
        }, 
        {
            "index": 30, 
            "rating": 3, 
            "review": "Felt like it was only right to submit an update since apparently delivery has resumed to my neighborhood in Mountains Edge (or maybe it was never canceled and previous cashier was misinformed.) Food still the same and really wish they would stop overcooking their chicken and steak, hopefully they read this review and make some changes."
        }, 
        {
            "index": 31, 
            "rating": 5, 
            "review": "I've been here 3 times now and look forward to going back.\nThe food is always fresh, prices descent, and service good.\nI went here first with my girlfriend on a groupon, and loved it so much I've gone back and it's not close to my house at all...but worth the trip."
        }, 
        {
            "index": 32, 
            "rating": 4, 
            "review": "Ordered delivery. Pleasantly surprised. The lady on the phone was super friendly & helpful. Delivery was fast, hot and delicious. If you have a sweet tooth, highly suggest one of their yummy cupcakes."
        }, 
        {
            "index": 33, 
            "rating": 2, 
            "review": "We been going to this place since it 1st open....but lately service is really poor...it's not the same as before"
        }, 
        {
            "index": 34, 
            "rating": 4, 
            "review": "Lets be honest with a name like Mac Shack is there anyway this place this could live up to our overblown childhood expectations gone amok? To define Mac Shack, its a new and extremely well done pasta driven italian style restaurant.  I won't call it fast food but, from the time I ordered the food it was on my table within a few minutes and I was in and out of the place in about 45 min.\n\nThe menu varies from their combinations of food or you can get very adventurous and create your own meal.  When ordering there is a glass case with all the optional items for you to see and drool over.  The place even has descent selection of wine and beer.\n\nI ordered the asiago-blue mac and cheese and it was delicious.  You could taste the real cheese in every bite and the pasta was slightly al dente like I prefer. I went with a friend and he had the \"farm house\" which he described as tasty and well rounded.  I snuck a bite and will be ordering it next time.  \n\nI highly recommend this place just keep the inner child at bay, as its impossible to keep that little bugger happy!"
        }, 
        {
            "index": 35, 
            "rating": 4, 
            "review": "I've been back since writing this review and while I didn't get the pesto this time, it was overall a better experience.  \n\nThe boy got one of their suggested pasta mixtures with a cream sauce and he enjoyed it alot.  I think I had a penne with their red pepper sauce, spinach and sausage.  The ingredients are always fresh and service is quick.  We came when they were about to shut down and made us feel welcome to get a to go order.  The one criticism I had about flavors was my red pepper sauce was really a cream sauce with a light red pepper flavor.  I definitely wish it had been a little heavier on the red pepper.  \n\nI will say that after my last review I received a long letter from the owner saying he had tried the pasta I had and realized I was right and fixed the problem with the pesto.  I have extreme respect for owners who care so much about their business that they are willing to actually listen to reviews.  You would be amazed how rare this is.  So I would like to thank him and say I will continue to go to Mac Shack and I hope you will too."
        }, 
        {
            "index": 36, 
            "rating": 4, 
            "review": "If you love Mac and Cheese, you'll love this place. There are so many types to choose from where do you begin? With the bacon of course... I love the smokehouse Mac! It is a flavorful explosion of smokey bacon in every mouthful."
        }, 
        {
            "index": 37, 
            "rating": 5, 
            "review": "WOW! what a great suprise. I had heard great things about Mac Shack so I decided to take the kids out to lucnh. Great menu and very child friendly. I highly recommend the baked rigatoni. I will be back on a weekly basis."
        }, 
        {
            "index": 38, 
            "rating": 5, 
            "review": "I was really nervous going in here tonight because of the mixed reviews I saw here. However I decided to give it a shot. I ordered the spinach artichoke mac and a side green salad, my boyfriend got the antipasto salad and breadsticks. First off the mac n cheese portion was HUGE. My boyfriends salad was big too. The salad dressing, an Italian vinaigrette, was outstanding, and I am not a huge fan of Italian dressings but this was so good. As for the Mac n cheese, I was so impressed.  Not too much and not too little sauce. So so good. My boyfriend loved his salad as well, and the breadsticks were super fresh. So impressed, this will definitely be a repeat spot when I'm in the mood for Mac n cheese."
        }, 
        {
            "index": 39, 
            "rating": 1, 
            "review": "I ordered the Crazy Alfredo but instead of getting Alfredo sauce,I got a bowl of oil. Disgusting!"
        }, 
        {
            "index": 40, 
            "rating": 1, 
            "review": "An Atkins Dieter's Nightmare\n\nThe food is good. There's no doubt about that. However, I have two big, big problems that will keep me from ever returning. It's expensive if you don't get the lunch special.\n\nFirst, if you're waiting in line to order and get to the register AFTER the lunch special expires, well, they expect you to pay full price. That's a load of crap.\n\nSecond, if a company sends out a text message discount with no expiration date, THEN THEY ARE LEGALLY BOUND TO HONOR IT, but not according to the pimple faced kid behind the counter who said \"Oh, we don't do that one any more.\"\n\n\"Well, we don't patronize your restaurant any longer.\"\n\nIf you don't care about your customers, you deserve to go out of business. It's as simple as that."
        }, 
        {
            "index": 41, 
            "rating": 5, 
            "review": "Wish I lived closer to mac shack, but its probably better that I don't. I was in the area so met a friend for lunch. It was a busy Friday but the line moved quickly and the smell was incredible. My friend described it pretty accurately as a pasta version of chipotle - just meaning that its quick, reasonable and customizable. \nI decided on a special made up of mac and cheese made w Gouda, big pieces of bacon, a touch of tangy bbq sauce and I added chicken. I was a little hesitant about the bbq sauce but it was just like a bbq chicken pizza but in pasta form! Can't go wrong with that. \nIt was a huge portion for about $10 and they have a lot of great options to customize your pasta. Its not really a full service restaurant - you take a number and they bring your food when it's ready. Because of that, I was surprised that they had very good service. The manager (who was also the one who took my order) walked around making sure everyone was happy with their food. He brought me a to go box, cleared our dishes promptly. \nMac shack was a winning combo of good food, low prices and unexpectedly great customer service."
        }, 
        {
            "index": 42, 
            "rating": 2, 
            "review": "The only reason I'm giving two stars is because the staff was really great and the place was clean and had a cool relaxed theme and awesome artwork. The food was terrible. My friends and boyfriend had talked this place up to me so much and when I finally had a chance to try it, I kinda wished I hadn't. I got a pesto pasta, it was super bland and watery and pricey. I paid like $15 for a pasta I didn't even eat I took two bites and couldn't continue. It's too bad cuz this place is super close to my house."
        }, 
        {
            "index": 43, 
            "rating": 3, 
            "review": "2.5 stars- Mac Shack isn't horrible but it does the job if you're hungry and searching for a fast, casual establishment. IMO there's a lack of places to grab a quick bite to eat in the SW area by Rhodes Ranch. I don't do fast food so that limits the scope. \n\nI always get the 'Bottle Service' which is pasta in a vodka cream sauce with grilled steak, mushrooms and sun-dried tomatoes. I would give this dish 3 stars alone but the other items I've tried are 2 stars or lower. Baked ziti is meh and their alfredo has so much stuff in it, it takes away from the dish. I want to say it has chicken, shrimp, sausage and about 3 other veggies mixed with a very watery alfredo. Dishes have also been pretty inconsistent and I've only gone a few times here.\n\nOn the plus side, their prices are reasonable and decent portions enough for a 2nd meal. I like that they carry The Cupcakery cupcakes if you're hankering for a nice dessert and the complimentary lollipops are a nice touch for the kiddos. And the place is always super clean and inviting."
        }, 
        {
            "index": 44, 
            "rating": 4, 
            "review": "Update: a total turnaround! The young woman who helped me was extremely polite and professional and very nice. I guess they must have let the other one go perhaps... ? ;-/\n\nThe food was good and timely served. It has renewed my faith in the restaurant, which I was hoping would happen... It really is great food for a great price. I am glad that I can go there again now and expect excellent food and service. We should expect nothing less! Right? \nI think that's it."
        }, 
        {
            "index": 45, 
            "rating": 2, 
            "review": "Cheddar mac. I agree with the other users. The store was very firstly, floors unclean... Tables dirty... 5 people working and they seemed to be more interested in something other than service customers. My food was over cooked. Service wasn't bad, but not great either. I won't be going back."
        }, 
        {
            "index": 46, 
            "rating": 2, 
            "review": "so.... we have driven by the Mac Shack several times as we run our errands and thought we should eat there some time.  Well, the \"some time\" was last Sunday.\nBefore going to any restaurant,  I \"Yelp\" it  and also look up the restaurant website.  Because of their connection with Nora's Cuisine on Jones/Flamingo, we decided to give Mac Shack a try.\nYou order at the counter, take a number, get your own drink and sit at a table.  All the tables were not cleaned or wiped or they had the last patron's empty cups still sitting on the table.  We took the table with the empty cups, (there goes a star)\nWe ordered a Caesar's Salad to share with their homemade dressing.  The romaine lettuce insides were mostly used, (not the leafy middle sections), croutons were not crispy at all and the dressing was too mayonaisey...(bye bye to a star and a half...)  The roll was very good but no butter...\nHubby ordered the lasagna which was just okay...he didn't finish it... Hubby says, it's kind of mall  Food court food or fast food....(tata to another star and a half..)  His iced tea was very good.\nNow...on the other hand, my veggie pasta plus garlic was very good - pasta was not overcooked and the veggies were yummy! (brought a star back)\nThis was an okay place....hubby won't come back but I most likely will for carbo loading before my cycling or tri events.  In fact, they should advertise it to the sporting events around town.\nThey had some empty walls that should be used for at least 4 flat screens.  One guy looked so bored sitting there.\nIf we ordered the \"make your own\", dishes,  I don't know if the price would have been more expensive.  If it was, then it's probably over priced.\nCustomer service was so so....they didn't notice the empty cups until we told them to clear it off.\n(We should also be able to put half, (1/2) stars for the ratings.)"
        }, 
        {
            "index": 47, 
            "rating": 4, 
            "review": "My wife and I take our children here at least once a month. The pasta is always good and the best thing is that kids eat free on Sunday's. The staff is always nice and the place is clean. \n\nGood food, clean place and friendly staff."
        }, 
        {
            "index": 48, 
            "rating": 3, 
            "review": "I like this place, I love pasta, and the more the better.  It's in the boonies for me, but for the price point and the speed of service it was great.  I got the carbonara like dish, which I love carbonara, so it's hard to mess up for me.  My boyfriend did a alfredo pasta and my friends got the mac with the jalapenos.  We were all happy campers.  It's not EXTRAORDINARY, but I'd go because the service is quick and the servers are REALLY nice.\n\nYou get what you pay for."
        }, 
        {
            "index": 49, 
            "rating": 1, 
            "review": "We have visited here multiple times and had food delivered to our home. We tried to order for deliver at 11:30. At 12:30 we still had not heard anything so we called and were told it shouldn't be long, the delivery driver is on his way back to pick up our food. At 1:05 we called again because we still didn't hear anything and I was reassured the cashier would be talked to because she should have told us it would be a long wait time. An hour and a half??? There's no way our food would have been fresh or hot. I decided to cancel the order rather than keep waiting. Had I known it would be so long I would have gone/ordered elsewhere. Seriously unhappy with their lack of consideration for their customers time."
        }, 
        {
            "index": 50, 
            "rating": 4, 
            "review": "I'm gonna give this place 4 stars just to balance out the 2-star review from My lol.  For those of us that were on time, the service was great, and how can you beat a free meal.  I had the PepperJack Mac... I was eyeing it, and the girl at the counter said it was good, so I gave it a go.  It's not that it was meh... it was good, but just not knock me out of my chair good.  I mean, their thing is just macaroni, so it should be the best macaroni and cheese I've ever had, right?  Wrong.  I think Cracker Barrel's M&C is better.  Not bad at MacShack, but nothing worth going out of my way for.  Perhaps if I go here again I'll make my own and see how that goes."
        }, 
        {
            "index": 51, 
            "rating": 3, 
            "review": "Although this is not a place that I will go out of my way to come to, it is not bad. For those who love basic pasta and sauce, it is cheap at $7. To add protein will cost another $1.50. Don't go for the shrimp because there are only a few small ones throughout. Then additional ingredients will cost $0.50 each. If you enjoy a medley of vegetables then this will quickly add up. \n\nThe portions are large and can easily feed two, but I feel like I could make it at home. The spicy tomato sauce had quite a bit of flavor and delivered on it's promise of a bite. \n\nComing with friends and sitting outside on a nice night made for a great dinner. Even though I was not blown away by the food, the service was wonderful. The woman working at the register was approachable and struck up conversation with ease. The guy that runs the food was attentive and cleared our dishes promptly."
        }, 
        {
            "index": 52, 
            "rating": 1, 
            "review": "I used to realy like this place but it must have fallen on hard times. The time before last it seemed the prices were the same n their oasta meals but the portions got smaller. It was still good, but there was less of it. This time we discovered they now have two sizes firor their entrees and salads. Okay, so we opted for the larger of both. But my wife received what amounted to a small sized entees just in a bigger, more expensive to go container. We ordered 3 meatball, we got two. We ordered the big ceasar, we got a side salad that costs less than half as much, but we paid for the big one. Then my wife reminded me of what we though was an oversight the time before when they \"forgot\" our garlic bread. I couldn't help noticing the manager drving off with his meal in his late model Porsche Carrera. At least someone there got everything they paid for! I'd steer clear of To Go orders at the very least..."
        }, 
        {
            "index": 53, 
            "rating": 3, 
            "review": "I like the concept of the Mac Shack. I have some suggestions for improvement as well.\n\nI ordered the Crazy Alfredo. It was tasty and filling but I wouldn't say it was mind-blowing or anything like that. My meal came with a piece of bread that was good as well. Overall, the meal was heavy. I felt like I had eaten a stick of butter and a cup of cream.\n\nI do want to go back and try some of the other items before I write off this place.\n\nHere's my suggestion for the Mac Shack: fountain drinks don't cut it for your food. Heavy butter and cream does not go well with Coke Zero or Sprite. I think they need some specialty drinks that complement the food. Snapple, Orangina, fruit juice, something like that. Just a suggestion."
        }, 
        {
            "index": 54, 
            "rating": 4, 
            "review": "It's taken me a long time to get around to trying the Mac Shack, and I think a lot of the kinks people have complained about must have been worked out because I didn't run into any. \nFor instance, I added chicken and there was plenty. They were definitely not stingy with it. I got the Pepper-Jack Mac and it was good, but I enjoyed the Farm that my husband got better. The bowls were different than most of those pictured here, and we had real utensils. \nI really enjoyed it and look forward to trying new things on the menu! Plus they gave me a little bowl of totally plain noodles for my daughter. I don't care if they \"subtracted\" them from my dish (although I don't think they did) but any time a restaurant goes above and beyond like that they deserve a little extra credit!"
        }, 
        {
            "index": 55, 
            "rating": 3, 
            "review": "I went to the Mac Shack for two reasons: 1) This place has been yelped about like crazy...that is usually reason enough alone. 2) My wife and I have been trying like crazy to find place with this concept. We are both from a part of  the country that has the Noodles & Company chain, and love the idea of a create your own pasta dish restaurant. When I first walked in a I was struck on how similar it looks to a Noodles & Company. That may not be on purpose as the whole modern look is pretty in with restuarants. We were greeted right away, which was nice, and the menu was pretty self explanatory. I got the penne with pepper sauce, broccoli, onions and peppers, my wife got the fettuccine with pesto, sun-dried tomatoes and broccoli. I can't remember what my mother-in-law got, but my brother-in-law got the baked ziti. I really enjoyed my dish, full of flavor, well cooked pasta, and loads of veggies. My only complaint would be the size of the entree. For the price, I thought it could be a bit larger.  My family enjoyed their dishes as well.\nThe service was great, but I need to wait for my second visit to determine if its a 4 starer."
        }, 
        {
            "index": 56, 
            "rating": 5, 
            "review": "I have been wanting to try this place for quite some time and I am glad I did! I am now a fan and plan to return whenever I visit. It was ranked as one of the best places for mac&cheese on Haute Living Las Vegas site, and it most definitely is. At first I thought it was a bit pricey but when I saw the bowl they give you I was stunned. It is really good but no matter how delicious, it is hard to finish it all! You can save money and share with a friend (if neither person has a huge appetite), or save some for later. Either way it is totally worth the money and worth visiting to try the different combination options again and again."
        }, 
        {
            "index": 57, 
            "rating": 3, 
            "review": "I have a very love hate relationship with this place.\n\nI used to Love coming here. I love the concept,  it's quick, it's easy, and afordable. \n\nHowever, the past few times the sauces have been bland and pasta has been very over cooked.  I think it's safe to assume they've changed Ingredients.  Orders have been wrong and service is lackluster at best.\n\nToday went in and 2 girls were chatting behind the counter.  I was greeted when I walked in, but stood there waiting to order. I don't think I could have been much more obvious.. then a man (I assume manager) starts talking to them about someone who will be calling for him all while I'm standing there waiting to order.\n\nI got my order in literally 2 minutes. However,  while waiting I overhead the manager speaking to someone he just hired that he just hired about how his employees go out partying all night, etc. This wasn't like I was being nosy. I was sitting at the counter waiting for takeout 2 seats down. Very unprofessional. \n\nOn a prior visit, I had my work shirt on. The cook asked for help with his phone. I helped fix it. He asked for my number if he has additional questions. .. ummm no. Go to your carrier and ask. ( I work for a phone manufacturer. ) \n\nLong story short. I don't really care about poor service for takeout pasta. Food is decent, but if I was the business owner... I'd be upset my guests were experiencing this."
        }, 
        {
            "index": 58, 
            "rating": 3, 
            "review": "If I had written a review on one of the other three times we've gotten take out from here, I'd have given them 5 stars each time. This time however, I can only give 3. I always do the create your own pasta. I get to choose what I want without having to ask for things to be left out. The quality is always good, fresh and tasty. This time however I asked for a  double order of mushrooms and got maybe a half order. I was charged for 2 orders, but the money isn't the issue ($1?). I was just disappointed in a place that I had found consistent and tasty. I still plan to try them again. I don't want to sway anyone from trying this great little restaurant, I just hope they go back to what I had come to expect from them."
        }, 
        {
            "index": 59, 
            "rating": 3, 
            "review": "This is the 3rd time that I have been to this place for take out over the years.  I came here because I had a 2 for 1 coupon which was about to expire.  For a Saturday night, the business was quite slow.  I didn't have to wait to order and the food was made fresh within 5-10 mins. This time I think the portion size was very generous.  We got the normal sized pasta, but for $3 more you get the larger size with quite a bit more pasta and sauce.  I really like the concept of pick your pasta and sauce and picking what other toppings to mixed with pasta.  We ordered the linguini meat sauce with zucchini and mushrooms and also the broccoli pesto penne with chicken.  Both dishes didn't have enough sauce, so the pasta was on the dry side.  There was however plenty of meat in the meat sauce.  The flavour of both dishes also needs some improvement.  This place is okay, for a quick pasta fix when you don't feel like cooking.  I wouldn't go out of my way to come here, but because it's close to home, it's okay."
        }, 
        {
            "index": 60, 
            "rating": 1, 
            "review": "Absolutely upset with the service of this place. I had did a pick up order for lunch. By the time I got back to work and opened up my order. My order was completely wrong! I had called in and spoke to Rebecca. She apologized for the inconvenience and took down my name and said I come back in another day and they would replace my order. Just mention her name and i shouldnt run into any problems. So the day comes I want to pick up an order and they don't have my name listed down for the order, and there is nothing they could do for me. The person on the phone was completely rude about it, even after I had explained the situation. Highly disappointed. Rude & unorganized restaurant. Do not go here unless you want your order wrong & and rude service."
        }, 
        {
            "index": 61, 
            "rating": 3, 
            "review": "This concept is the wet dream of almost every girl I've ever known. A restaurant based around mac n cheese and pasta. (Plus they serve wine & beer.)\n\nIt's solid gold for a simple dinner date with a picky eater.\n\nBasically the idea is that there are numerous varieties of pastas including several alternative diet choices such as farro, wheat and gluten free pastas, and in a variety of styles from linguine and angel hair to bow tie and wagon wheel.\nYou choose your pasta type then you choose from 8-10 different sauces, then you can add items to it such as meats, veggies, or cheese.\n\nThen there's the Mac choices. They have several types of \"gourmet\" mac n cheese. My favorite is the pepper jack mac which is macaroni topped with monterey jack, pepper jack, and asiago cheeses and jalapenos.\nThe macs run from $6.95-$7.95 then I add Sausage ($1.50) and fresh tomatoes (.50c) and fresh spinach (.50c). \nMy date ordered the fettuccine noodles with alfredo sauce ($7) then added a double order of shrimp ($1.75 x 2)....yea...so everybody else has said it so I'll say it too. An order of shrimp is 2 shrimp! They are by no means small, but if feel like 3 would be a little more substantial.\n\nThe portions for both the pastas and the mac's are filling for me and I have a big appetite. She could only finish half the pasta.\nOur total was roughly $23 without drinks. \nSo the main problem here being that the 2 of us can go to olive garden and get something comparable to the above mentioned and also get salad and breadsticks for the same price, and feel just as satisfied, OR during lunch I can go to Maggiano's and get pasta, but lunch portion and it will be far better and as filling for less. \n\nI like the inside, but it basically screams \"I'm a yuppy!\" and \"Please Franchise Me!\" There's more hot soccer mom's ignoring their kids than an episode of The Real Housewives. \nAlthough I have to say both myself and my date loved the 3 large Peter Lik prints on the wall, and the deck is a nice little break in the spring and fall because there is almost nowhere in the Southwest to dine outside. \n\nThe Good:\nIf you have kids they will probably love it and they can find something to eat no matter what kind of insane diet you have them on.\nNice deck and dining area.\nThe Quality of the ingredients\nThe staff is very helpful and polite, and you can tell they truly want to answer any questions you have.\n\nThe not so Good:\nPrice\nThey are a perfect 7 for 7 on screwing up my order.(But to be fare I am throwing them a bit of a curve.)\nPortions of add ons could be a little more. you have to add several items to get any additional substance.\nIf you don't have kids you still might end up sitting by a party of the little cheese covered lunatics."
        }, 
        {
            "index": 62, 
            "rating": 2, 
            "review": "It's mac and cheese. Not much else to say except I won't be going again. Very over-priced for just mac n cheese and if you add any meat, holy cow it gets expensive.  The Mac n cheese isn't even that good, certainly not as good as most regular restaurants that offer it as a side dish. I suppose my expectations were too high, but seriously I don't understand the concept."
        }, 
        {
            "index": 63, 
            "rating": 4, 
            "review": "Food was excellent.  Hit the spot.  The smokehouse BBQ Mac is amazing.   The chicken salad was excellent.   We had an issue with our order where they missed ringing up 2 items, and the manager was amazing and gave us the replacement items for free.  Well done\n \n    The only reason I am not giving this place a 5, is because of the prices.  It is simply too expensive.  We got our bill and thought \"wow that was really expensive\"; but then after realizing they gave us $20 in free food, it was apparently REALLY expensive.  Unfortunately due to price and only price, I don't see being able to bring the family here often.\n   It's pasta!!!! $1 a pound at most!  How does it add up to $10-$12 for an item?\n\nThe only other observation I had is, we ordered the manga size on an item($4 more I believe for a larger portion) and it was not noticeably different from the non-super-sized version."
        }, 
        {
            "index": 64, 
            "rating": 4, 
            "review": "The portions are my sized. That means you'll need a to go box, you wuss. Their cesear dressing tastes like what Cesear intended! So I highly recommend at least a side of cesear salad if you like it a natural.\n\nThe price seems quite appropiate to their portion size. So with everything being rated I'd say it's 4 stars. If I was a little kid it might be 5."
        }, 
        {
            "index": 65, 
            "rating": 5, 
            "review": "Love this place - my favorite is the Baked Rigatoni (formerly the Ziti Bake) with meat sauce, ricotta, and melted goodness (cheese) on top :)\n\nAlfredo and pesto sauces are also great. Service is friendly, prices are decent, and I've never been disappointed by the taste :)"
        }, 
        {
            "index": 66, 
            "rating": 1, 
            "review": "I've been going to Mac Shack for nearly three years. It has been one of our favorite 'fast food' places with good comfort food. However I have been very unhappy with the service lately. Especially the online ordering & delivery process. What is the point in offering that service if it is slow and the orders are wrong? In addition, I paid extra for delivery and tip on my wrong order that took too long? Ridiculous. And when I tweeted at them, they feigned public interest in my concern and told me to DM, only to not follow up. Very unhappy and don't see myself returning soon.\n\nUpdated to add: the owner called us after this review was posted. Appreciated the personal touch and desire to make it better. Gave us his name & cell number & said our next meal is free. Bummed to share that when we went back to redeem the free meal, service was still less than stellar."
        }, 
        {
            "index": 67, 
            "rating": 4, 
            "review": "I like the concept of make your own pasta dish from fresh, organic and healthy products but man can the price add up if you decide to make your own or add extra ingredients. Personally I enjoy the pepper jack mac with chicken. The flavor of pepper jack just explodes in your mouth and adds a nice little zing to every bite. The good thing is that portion size makes up for the price you pay so as the saying goes, you get what you pay for. \n\nWord of advice - use the Yelp check-in and you receive a regular drink and free garlic bread sticks, totally worth it or else you're paying $13-$15 for a bowl of mac & cheese.\n\nI've come into Mac Shack at different times and one of the negative things is that the quality of the food is never consistent. My last trip here was fantastic which was during the day! The pasta actually had sauce on it where my previous visit (at night) my poor noodles were dry. It would be great if there was a little more cooking consistency. I gave them an extra star from last experience since the food tasted better than previous. As long as I can use the check-in, I'll be back."
        }, 
        {
            "index": 68, 
            "rating": 5, 
            "review": "so I know I already posted a bad review due to the customer service experience I had but I have now had a change of heart because of the owner Frank. When he saw my review he personal stepped up to make things right. and that is service. it is nice to see an owner care about his customers. he even came to my home to aplogize and gave me a gift card to come back and try them again and I sooo will. I love the food there and I now can say the service is way better too. thank you Frank. \nyou won my business back!!"
        }, 
        {
            "index": 69, 
            "rating": 4, 
            "review": "The food is amazing! You can basically create your own dish. You pick a basic pasta and you can add any extra garnishes and side dishes that your heart desires.  The prices aren't too steep so you don't have to worry about breaking the bank. They've also recently added cupcakes from the Cupcakery to their menu.  It's a great addition to an already outstanding repertoire."
        }, 
        {
            "index": 70, 
            "rating": 4, 
            "review": "Mac Shack is a great place to eat.  Basically it's create-a-pasta-dish, or choose one of their selections.\n\nThe portion size you get is good.  A bowl of pasta, and a breadstick was enough for me to have a little left over for the next day.  The variety of options you get for your pasta, sauce, and toppings are great.  In addition to all of that, are a few salads, some breadsticks, and they have wine as well.\n\nIf I had a complaint, it would be that it seems a tad bit overpriced, but only a little... not enough that I wouldn't go back."
        }, 
        {
            "index": 71, 
            "rating": 4, 
            "review": "Mac Shack has the awesome idea of any pasta, with any sauce, and whatever topping you want for a decent price! The taste is okay, and the atmosphere is nice, and if you finish all your food, they even offer you a free lollipop that is on the wall near the door. The service was nice and the food was delivered in good time. This is definitely a place for pasta lovers, and not a place for someone who just likes mac and cheese."
        }, 
        {
            "index": 72, 
            "rating": 1, 
            "review": "Very rarely do I consider a meal so bad I want my money back and want to yell at the management. One trip to this place did that for me. \n\nStarted by having the person at the counter took a phone call right when I was ordering, stayed on the phone, then had to go to the back to get whom ever for the call. once I ordered, got my beverage and sat down, food came in about 5 minutes. Server switched my food with another table, so it had to be redone. Once I got my new food, I then needed to ask for another fork. Once I got the fork and tried my food, I was so disappointed with all of it. Got the Asiago Blue Mac, with port mushrooms, roasted tomatoes, chicken and caramelized onions. The cheese sauce tasted nothing like asiago or blue cheese. It was very bland and watery. Portion was small. The chicken was tough, the onions not caramelized and the mushrooms tasted old. No manager to be seen anywhere I left my meal half finished on the table. Great concept with terrible execution. Stay away till they work out the food flavor and quality issues. If you go, don't say I didn't warn you."
        }, 
        {
            "index": 73, 
            "rating": 5, 
            "review": "Just might be my favorite place here in Vegas, and hands down my #1 Go-To for delivery from Postmates! \n\nMy favorites are the Bottle Service or Farm House. You also can't go without the side of Creamed Corn- to die for! \n\nI will recommend this place to anyone and everyone here in Las Vegas! :)"
        }, 
        {
            "index": 74, 
            "rating": 3, 
            "review": "I wasn't a huge fan at first. I guess I wasn't overwhelmed with the menu options. The first thing I ever got was some garlic pasta dish and it was alright, but when I decided to retry the place I made my own dish and started becoming a fan. It's quick easy and somewhat affordable."
        }, 
        {
            "index": 75, 
            "rating": 4, 
            "review": "PASTA GLUTTUN GALORE!\n\nWalked into this place because I always saw it & wanted to try it & after so many visits to skinnyfats I wanted to add something else to try as well. \n\nIt was lunch time & the parking lot was jammed pack! The inside of Mac Shack seems very spacious & lots of seats along with outside seating. The kitchen is open so you could see the cooks that are cooking your pasta & I always like open kitchens because you could see the cleanliness of the BOH where the food is being cooked. \n\nThe resteraunt was EMPTY & the only people sitting down eating seemed to be the employees. I was greeted right away & they were waiting for me to place my order. It took me a minute but came to the decision & ended up ordering 2 dishes. You could also build your own pasta as well.\n\nBAKED RIGATONI $8.75 - this was pretty good but a little bland on the marinara red sauce but eat it with the ricotta cheese backed on top & it is perfect goodness.\n\nMAKE TRUFFLE MAC & CHZ $10.25 - it is mac & cheese created for the adult kid that still loves mac & cheese but they made it suffisticated by adding truffle with some crunchy breaded crumbs on top! Every bite was cheesy goodness.\n\nI thought the portion amount was good for the price & it wasn't bad even taking it togo. They were fast & they came in a tin pasta container which kept it pretty hot till I got home."
        }, 
        {
            "index": 76, 
            "rating": 5, 
            "review": "Only thing I ever get from here is the mac and cheese sandwich. I could eat one of those every day.  So delicious!"
        }, 
        {
            "index": 77, 
            "rating": 5, 
            "review": "This was the best macaroni and cheese I ever had. I don't see how it could so delicious but it does! I also love that you can create your own dish and try something new every time you order."
        }, 
        {
            "index": 78, 
            "rating": 4, 
            "review": "We recently went to Mac Shack again after visiting in December.  This time the food was much better than our first visit.  I had the Asiago Blue mac and cheese.  I added mushrooms and olives to it.  It was very tasty.  Nice and creamy.  Not a strong blue cheese flavor but just enough.  My mom had rigatoni with meat sauce and the chicken soup.  The soup was really good.  Lots of veggies and pieces of chicken.  A bit spicy.  The rigatoni had a nice sauce.  And plenty for leftovers the next day."
        }, 
        {
            "index": 79, 
            "rating": 3, 
            "review": "I should begin by saying that I really like the food here, but there are certainly issues with cleanliness.  Last time I visited, it was between 2 and 3p, and whatever lunch crowd that had been there was gone.  Most every table was dirty on some level.  Eventually, when a young man came out to clean the tables, he used a napkin.  Really?  I'm in the service industry myself and it's standard practice to use a sanitizer solution when wiping down tables.  Sort of made me cringe...also each of the salt and pepper shakers were dirty and/or sticky.  These 2 situations can easily be fixed--looks to me to be a lack of management.  Other than that, really like Mac Shack.  Just wish they'd bone up on basic cleaning skills..."
        }, 
        {
            "index": 80, 
            "rating": 2, 
            "review": "I have a constant love/hate relationship with this place, because sometimes the food is great but most times it's very mediocre. Today I ordered the cheddar mac and it was very bland. I added steak to my pasta and the quality of meat was terrible. This place has absolutely gone downhill, I will most likely not be back to this location."
        }, 
        {
            "index": 81, 
            "rating": 5, 
            "review": "The service is always good and so is the food! Our cashier Tony was so friendly and helpful!  It's also a very short drive from my house! I come here often. For those of you with kids on Sunday they eat free!"
        }, 
        {
            "index": 82, 
            "rating": 4, 
            "review": "I went with my roommate right before they closed, but they were kind enough to get us whatever we wanted. I got fettuccine alfredo with meatballs and bread sticks. The food was actually really good. They had a crazy list of pastas, sauces, vegetables, and meat items you could add, so I'll definitely be sure to go back and try some other things they have to offer. I think the concept of build your own pasta is pretty freaking sweet and it's the only one of it's kind around. Give it a try.\n\nFor those confused on the concept, it's similar to Subway or Chipotle, but with pasta. Also a bit above fast food as far as status."
        }, 
        {
            "index": 83, 
            "rating": 4, 
            "review": "I love Nora's so I wasn't sure what to expect. I liked the feel of the place. I had the crazy Alfredo and it was crazy alright, but it was good food i would try again. I still love Nora's more, but for fast food pasta its a good change of pace."
        }, 
        {
            "index": 84, 
            "rating": 4, 
            "review": "i love all the places who get ideas that come after Chipotle... like Pieology, this is just like Chipotle - the settings, make your own, healthy, and yummy!\n\ni wish they have stores opening around S. CA soon... i'd go there often!"
        }, 
        {
            "index": 85, 
            "rating": 2, 
            "review": "I'm not a big fan of pick your ingredients type places.  I'm a crappy cook.  Whatever I come up with will almost certainly be sub-par.  I go out to eat so that professionals can do that part (and the cooking) for me.\n\nI had the Asiago Blue Mac and didn't care for it.  The fact that the menu only has a few pre-defined dishes would have made me believe they should be better thought out.\n\nFor a meal that cost over $10 I'm usually much happier.  I love Mac & Cheese at most places so I was all the more disappointed.  Despite my first experience, I'll likely go back for one more try."
        }, 
        {
            "index": 86, 
            "rating": 2, 
            "review": "Food was OK.. Not worth what I paid at all.. The chicken tasted weird and ended up not eating it... Mushroom and olives were fresh and very yummy... Bread was blah \n\nThe cashier did not give me my change or a receipt"
        }, 
        {
            "index": 87, 
            "rating": 2, 
            "review": "Prior to tonight, I'd had several great experiences at Mac Shack.  Tonight ruined any chance of my return to the restaurant.  The young lady working the register told me that the owner will not allow any substitutions or changes in their \"pre-packaged\" pasta dishes.  When I asked why, as I'd had it done before without any argument from the staff, she walked away and got another young man to come over and tell me that the owner used to allow it, but now really doesn't like it and they can't do it.  When I told them that I'd just find somewhere else to eat (and I did), NEITHER of them made any effort to retain my business.  It's not like I was asking to add ingredients to a dish without being charged or cheat the system - I just don't like shrimp or jalapenos in my pasta, but LOVE the rest of the dish.  I didn't think it would be too difficult to accommodate a simple request like substituting one vegetable for another, but hey, what do I know!?  I wouldn't be shocked if other loyal, regular customers find elsewhere to dine as well.  Disappointing, really."
        }, 
        {
            "index": 88, 
            "rating": 4, 
            "review": "felt like i was going to a pasta bar at a buffet. there are so many options as you can create your own combination or choose one of their pre-made options. feeling uber hungry, order the pepperjack mac and cheese, adding mushrooms and chicken and a side salad. If you check into yelp, you get a free drink and 2 garlic bread with it. The pasta came in a huuuge bowl so it definitely is shareable. for those light eaters, highly recommend a baby mac instead which comes in a smaller size. tried the baked rigatoni and that was good as well as the sauce wasn't too heavy as the ricotta cheese was just scooped int he middle for you to add versus having it all mixed together. great place to go for pasta variety but def not a diet friendly place"
        }, 
        {
            "index": 89, 
            "rating": 4, 
            "review": "***Make your own**** It's so good!!!  If you check in on Yelp there's a coupon. On Monday's if you order a meal without meat it's 20% off. I always get a side salad to start [just $2.00] eat half my pasta and take the other half home. My friend loves the blue cheese mac n cheese.  Everyone is very friendly and the place is extremely clean.  See my pix of the food."
        }, 
        {
            "index": 90, 
            "rating": 3, 
            "review": "The food here is reasonably priced and taste pretty good.  I had the lunch special and chose spaghetti with the roasted pepper sauce, meatballs, and ricotta.  I'll give it a 7.5/10.  My husband had linguini with pesto, shrimp, and mushrooms.  I'll rate his pasta a 7/10.  The pasta was a little bland but once I added a little bit of salt and parmesan, it was pretty delicious.  Service was friendly but I wish they would wipe the tables after bussing them.  Other than that, I will definitely come back to try other combos."
        }, 
        {
            "index": 91, 
            "rating": 3, 
            "review": "OK lunch of mac 'n cheese with a side Caesar.  Just over $10, but he dining area is clean, comfortable and the staff is wonderfully friendly and helpful.  Next time, I'll try a salad as a main dish.  Good in a pinch."
        }, 
        {
            "index": 92, 
            "rating": 5, 
            "review": "Let me start off by saying that I spent 10 days in Italy and I liked Americanized Italian food better. I eat everything, and Italian is my favorite by far, and this place is exquisite! The lady taking orders is so nice,and it had been my first time in and I overheard her telling the lady ordering in front of me some of the background on the owners of the restaurant. It was refreshing to see an employee genuinely interested and have all that knowledge about the establishment she worked in. I was up and told her it was my first time in and what did she recommend. She was very descriptive and helpful, and I decided on the Asiago Blue Mac. She recommended adding some ham in to give it more flavor and she was 100% correct. \n\nAsiago Blue Mac consist of Asiago, blue cheese, pecorino romano topped with blue cheese crumbles. \n\nIt is like a build your own pasta place also, which is fun to have the choice of adding a protein, or meat of some sort to your dish. I recomment bringing families in here, it is brightly colored and fun for kids as well."
        }, 
        {
            "index": 93, 
            "rating": 1, 
            "review": "Honestly, I had high hopes for this place. When you walk, the ambiance of the place was much different than what I imagined, and it actually made me enjoy it - at first. You get the choices of all the fancy shmancy pastas, and the different ways to make it. Then I saw the prices.. wow. Pretty steep for pasta, but I thought if it's good, who cares?\n\nI ordered the Crazy Alfredo. The cost came out to $12 for the pasta and a medium drink. I taste it, and it was decent but not great. The food came out in wood(?) bowls, and compared to the ambiance and price, it was a little tacky. My friend ordered a macaroni and he said it probably would have been better to buy Kraft Macaroni and Cheese and eat it at home.\n\nWhen I got home, I vowed never to go back. The food came right back out. It could be for other reasons as well, but I don't think I could ever go back after that horrible experience that night. I expected a lot, and despite it's upscale decor, it didn't meet up to even a quarter of my standards. I think I have a better chance going to a Pizza Hut and getting some pasta there."
        }, 
        {
            "index": 94, 
            "rating": 5, 
            "review": "I love the Philly cheese steak pasta!  The atmosphere is kid friendly and more importantly it's clean.  My kids really like going... I have a 6 year old that enjoys the farro and spinach salad and a 3 year old that loves mac & cheese. The price seems quite appropriate to the portion size."
        }, 
        {
            "index": 95, 
            "rating": 4, 
            "review": "Oh. My. Macgasm. (that's a mac and cheese orgasm)\n\nThis place is something different. I'm a huge fan of mac and cheese, I guess I never really grew up, but this place just makes it fun and unlike anything I've had before. Myself and a guest decided to check this place out since it's down the street from my place. Located on Warm Springs and Durango, this little shack has a lot around it. We walked in and were promptly greeted by the cashier. We were in the mood for fettuccine and wanted to try something popular. We considered getting a BYOB (build yo own bowl). This however included too many options for me. I mean bowties, penne, fettuccine, or elbows?!?! How could we decided!! Lucky we had an amazing cashier who let us try some the sauces just to give us a better idea of what we were getting. One of the sauces I tried was the pesto, which they had cold... So i was to imagine it warm.. I'm just gonna come back and try it. We decided to get the chicken alfredo and the cheddar mac sammich. Also while paying I realized I hadn't checked in yet. So, I checked in and received free bread sticks!! YUMM. We were gonna order a side anyways so it's nice that it was free. They gave us our numbers and we grab drinks and sat down. I was excited they have blue powerade. Most places just have the standar coke sprite and stuff. They have tables and chairs or booths. I wanted the booth side and made my friend take the chair side. HAHA, cushion for my butt!! After waiting maybe 10 minutes or so all of our food was out. I got right to it with a fork full of alfredo and chicken. The alfredo sauce was delicious, however I'm wasn't the hugest fan of the chicken slices. They were a little bland. I added some crushed peppers to spice it up, and we were back in action. We then move to the cheddar mac and cheese sammich. It was great. Nice toasted bread with cheddar mac.. Oh, ill be back for another round and hopefully soon. Cool part is when you clean your own plate you can grab a tootie pop at the door, mine are still sitting the in the car but it was a nice gesture. :)"
        }, 
        {
            "index": 96, 
            "rating": 3, 
            "review": "This place didn't WOW me but it wasn't bad!  The sauces aren't super flavorful and the salads could be way better.  It is a good deal if you are feeding a big group.  This place could be amazing because who doesn't love Mac and Cheese?"
        }, 
        {
            "index": 97, 
            "rating": 4, 
            "review": "After three visits, I'm confident in recommending this place. The selection is great. There are a couple dozen dishes with several side options. If you're creative, you have the option of creating your own dish. Choose your pasta type, choose you're sauce, and then choose all the other goodies you want to add and create your, one of a kind, pasta creation. \nMy average cost for my meals, including two main dishes, one side, and two drinks (not wine) was about $25. A little on the high side for pasta, but worth it for the quality. \nI did notice many business type adults with young children. I guess being able to get a great tasting pasta dish and still allow your child to get their Mac-n-Cheese is pretty appealing. \nMy only reasons for a 4 star instead of a 5:\n1. All three times, my breadsticks were hard and stale. \n2. Most employees were very nice and professional. A few (female) were less than pleasant. \n3. The climate was that of the Nordic. It was SO cold. We asked an employee about it and he said only the manager had the \"code\" to change the temperature. Bring a coat. \n\nI recommend the Taco Mac and a side of corn. Skip the breadstick."
        }, 
        {
            "index": 98, 
            "rating": 2, 
            "review": "I guess you can f' up pasta... I went with a group of friends and none of us had a flavorful meal. The meals were bland and were very small. My wife left hungry after finishing her meal. \n\nThe second star was for the complimentary tootsie pops as you leave the restaurant.\n\nNot recommended."
        }, 
        {
            "index": 99, 
            "rating": 4, 
            "review": "Hit the pre-opening Mac Shack event - i was the anti-social yelper sitting in the main dining area taking a brow beating from my roommate for reasons to annoying to share.  The ass-chewing did not slow my appetite and my tastings of the following:\n\nPepperjack Mac\nAsiago/Blue Mac\nPea Soup\nCaesar salad\nPasta with pesto , sundried tomato, mushroom and shrimp ( but shrimp was left off ) \nangel hair with garlic/olive oil shrimp ( yeah ! they inlcuded the shrimp this time )\n\nThe big winner was the angel hair with the garlic /olive oil - great flavor\nthe Mac n Cheese - decent flavor but i'm a baked m&c kinda guy - at least prep the m&c in the pan, then put some bread crumbs/cheese on top and put it under a broiler for a minute or so - just a personal preference.\n\nsoup - ok - bacon was a nice touch.\n\nsalad - in dire need of more dressing - ok\n\nI think the place has potential - the price seemed reasonable and i can see myself trying every now and then but not a \"destination\" \n\nwill add pics later ( actually bored to tears in a mediation in Reno as i type this  ! ) \n\n\nI'll try to be more sociable at the next gig !"
        }, 
        {
            "index": 100, 
            "rating": 2, 
            "review": "My first time here and I got the make your own, I wasn't really satisfied. i got Fettuccine Alfredo and its oily. honestly, I can cook my own Alfredo but Im just too lazy too cook so I went her and Alfredo should be a creamy sauce. But its just too oily and i can even finish it. Disappoint me a lot. But I would go back to try something new, since it was my first time here."
        }, 
        {
            "index": 101, 
            "rating": 3, 
            "review": "A unique dinning experience.  I want to come back and check out other dishes, but I had the fried BP&J sandwich.  It was surprisingly delicious!  I also got some bread sticks and a drink via the yelp coupon which kept the cost of the lunch extremely low.  The bread stick not as good as the olive garden's, but it would have pushed me up to a 5 star had it been soft and warm like the OGs.\n\nI would recommend you to check this place out at least once."
        }, 
        {
            "index": 102, 
            "rating": 5, 
            "review": "Came here for a vegetarian dinner for me and something for my boyfriends whole family to try and it was a hit!! Such good pasta, quick service and amazingly clean:)"
        }, 
        {
            "index": 103, 
            "rating": 4, 
            "review": "Mac Shack is a great place to get a quick bite. \n\nI've been here quite a few times and have enjoyed everything I've had here. Once you start adding toppings it starts getting a little expensive, but it's nice to have so many fresh options. \n\nI tend to lean towards the mac n cheeses since I'm not a huge pasta fanatic. Add a little chicken or some veggies and you've got a great meal. \n\nMake sure you sign up on their eNewsletter and you'll receive lots of discounts and a free meal on your birthday."
        }, 
        {
            "index": 104, 
            "rating": 5, 
            "review": "I always drive past this place but never went. Until my son was craving for some Mac 'n Cheese, we have too check this place out. \n\n... Son had a Mac 'n Cheese and ate the whole plate and wanting for seconds! Lol for $4.95+tax it was a good deal because it was so good and a good-sized serving.\n\n... BF had a spicy pasta.. And it's too spicy for me. Maybe a Level 8 out of 10\n\n... I had to try their Vodka Penne. It's the right amount of creaminess!! All in all good.\n\n... Cannoli and dips for dessert. It was still good after 3 days in the fridge but personally I like my cannoli rolled and stuffed, not to be dipped in cream. \n\nThis will be our new family restaurant!! You just can't go wrong with this place. Crew are so nice, prompt and friendly and the place is really clean and well-maintained!"
        }, 
        {
            "index": 105, 
            "rating": 2, 
            "review": "\"No problem\" is a problem because it is apparently replacing \"You are welcome!\" The service is forgettable, the food is forgettable... the price and stomach ache isn't.\n\nThis is a beautifully designed restaurant housing macaroni containers and beautiful scenic artwork on the walls. The restaurant was very clean. However, it was empty when I walked in and the cashier acted as though he did me the favor of taking my order. The cashier Patrick had no personality, but robotically said \"sure,\" and \"no problem\" several times with little or nothing more to say. \n\nThis was a to-go order. Overall, the Pepper Jack dish $8.65 with added sausage (6 small slices) for an additional $1.95 was nothing special. The sausage was flavorless. I honestly wondered if it was colored tofu. \n\nThe Spinach Artichoke Mac was reportedly good from a teenage standpoint - but he just got braces and was thankful to have something he could eat! My thought - $9.50 for a small bowl of cheesy macaroni is ludicrous. I could make a huge pot of goulash or macaroni with sausage for less - and I wouldn't have to hear \"no problem\" in the process.\n\nAfterwards, we both had stomach aches."
        }, 
        {
            "index": 106, 
            "rating": 4, 
            "review": "Much more than just macaroni :)\nThe selection is wide and probably will fit your need for anything in the \"Italian\" cravings section. Be sure to check-in and get your free breadstick!"
        }, 
        {
            "index": 107, 
            "rating": 3, 
            "review": "Oh, the Mac Shack. \n\nIt's the Chipotle of the pasta industry. You can build your own pasta or they have daily specials. They have several types of pasta, a variety of sauces, and about 50 or so ingredients you can add in to the mix.\n\nThe place is clean, the people behind the counter are alright. Not too friendly, but not rude. You order, they bring the food out to you, but you get your own drinks. \n\nIt's an okay spot for lunch. It isn't anything fancy and it isn't anything I would crave. It wasn't great, but it wasn't horrible."
        }, 
        {
            "index": 108, 
            "rating": 3, 
            "review": "I think the concept of the Mac Shack is rather cool. The place was clean and open. There was seating outside. I really loved the salad: Crunchy, green, and light on the dressing. Our sandwiches were eatable- the breadsticks-  not so much. I liked the open kitchen concept to see all the action. Prices seamed reasonable. Good ambiance music."
        }, 
        {
            "index": 109, 
            "rating": 3, 
            "review": "My daughter and I had dinner there yesterday  always went to the one in spring valley and it was good.  My dinner was okay but you could tell it had set on counter for awhile.  My daughter had the Mac n cheese truffle one.  It was so awful.  Tasted like they used smoked cheese as it had that after taste   We had ordered before and it was good  not sure what happened. Bothered me that employees were sitting in customer area eating food from other restaurants .  Not sure if I will go back."
        }, 
        {
            "index": 110, 
            "rating": 4, 
            "review": "Love this made to order comfort food restaurant. Order at the counter with quick, freshly prepared food served nice and hot. Will be back. When are you coming o Denver?"
        }, 
        {
            "index": 111, 
            "rating": 2, 
            "review": "Okay, so let me begin this review by saying that I am still at the restaurant after my meal and felt that since I was compelled to use the restroom immediately after eating, that it was only appropriate to write a review on the john. Let me make this simple and quick. The variety of the pastas, toppings and sauces is impressive, though the flavor wasn't much to write home about (but apparently enough to write Yelp about). I got the lunch special that came with a stale cold breadstick, cold and salty soup (corn chowder), and a \"create-your-own\" pasta. The soup was terrible, the breadstick was terrible, and the pasta was so so. We came here thinking this place would be a bit more upscale than it is, but it turns out that it is fairly \"fast food-ish\". I would have preferred to have eaten at Roberto's next door. The bathroom was very clean though, best part of the experience."
        }, 
        {
            "index": 112, 
            "rating": 1, 
            "review": "I ordered this from road runner food delivery service and did not eat at the restaurant and I'm wondering if they stopped somewhere else besides the Mac  Shack!  This was the first time trying it and I will never go again.  I'm wondering how people could eat this food.  I have been sick, so I was looking for a nice chicken noodle soup - but delivered because I'm sick.  I wouldn't even call this soup.  It was a mixture of half cooked carrots, celery, and peas along with hard stringy dry chicken pieces.  There was about a tablespoon of broth that had the flavor of water.  No salt, no pepper, no flavor at all.  My son who was not sick, agreed.  I figured macaroni and cheese would be the best ever since it is what they say they do.  Nope.  Flavorless and no seasoning.  How do they actually serve this crap and call it Mac and cheese?  \nAlso ordered baked rigatoni - had some flavor, but mushy and below average for sure.  \nDo yourself a favor and stop anywhere besides this place. Anywhere. Campbell's canned soup is better than theirs as is Kraft macaroni and cheese.  Unbelievable that anyone goes here."
        }, 
        {
            "index": 113, 
            "rating": 3, 
            "review": "Nice concept but my order left me thinking just OK.  Got a philly cheesesteak mac to go.  The item tasted pretty good by there were frugal in adding the beef.  It seemed like I just ate  macaroni and cheese and for the nearly $10 for fast food it just wasn't worth it."
        }, 
        {
            "index": 114, 
            "rating": 1, 
            "review": "This food is terrible. I went in expecting greatness and ended up leaving with a nearly full bowl getting dumped in the trash. If you are a mac n' cheese fan just stick to Kraft. I had the Philly Cheesesteak mac and it was so bland; even when i added salt and pepper there was no change in the taste. For a restaurant that specializes in creative mac dishes, they are failing horribly. I didn't even taste the cheese in my dish. Stay away if you value your money. Almost all of the specialty dishes (which are far from special) start at nearly $10. I won't ever be returning here when I'm in the area."
        }, 
        {
            "index": 115, 
            "rating": 2, 
            "review": "I honestly didn't see the hype with this place. My friend was ranting and raving how this place was good. When I stepped in , I enjoyed the decor , I thought it looked cool and very modern. I told the dirty blonde at the counter it was my first time and she kind of just gave me a dumbfounded like \"and?\" And I want to know what the funk this place about... Anyhow since the menu was a little intimidating and quite large, I just went with a chicken fettuccine with whatever pasta there was. I felt like this dish was something you can get off the olive garden kiddy menu. Anyhow, this review is a little late but I just thought I'd tell everyone about my experience because \"I'm sorry\" it sucked. We were staying on the strip and I have no idea why we ended up driving to a place 15 minutes from, where I'm pretty sure there are better italian spots in one of the hotels."
        }, 
        {
            "index": 116, 
            "rating": 3, 
            "review": "The service was very friendly and the staff were great. I usually don't like to yelp anything negative, I just don't go back to the place if I don't like the food. I ordered some Mac and cheese and a salad to go. When I got home the pasta was just too bland, it looked basically like cream added to soggy elbow pasta. I had to add salt, pepper, and Parmesan cheese at home to make it taste somewhat edible. The salad dressing was also bland. I did my best to try to eat it because I was so hungry but it was just not salvageable. The place is very clean and the staff were very friendly, it's just a pity I won't be back there:("
        }, 
        {
            "index": 117, 
            "rating": 3, 
            "review": "This place is an average to slightly-above-average pasta place.  The standard Mac and Cheese is a bit a bland, but getting the version with jalapeños in it improves the taste immensely.  The salads are always fresh (particularly the \"Green Machine\"), but the chicken that gets added is bland and dry.  The breadsticks are good, but nothing to write home about.\n\nThe bottom line is that you'll always leave full, and the meal will always be pretty good.  But it's nothing to write home about."
        }, 
        {
            "index": 118, 
            "rating": 3, 
            "review": "I used to love the Pepper Jack Mac, but it seems they changed the recipe, or how it is prepared, and I'm not a fan of it anymore... I tried the Broccoli Pesto instead with chicken. It was pretty good, but the chicken just was not cooked right. I still go to order the Green Machine Salad, which is delicious and pretty healthy (I think?)."
        }, 
        {
            "index": 119, 
            "rating": 4, 
            "review": "This place has made me believe that I'm the new Top Chef.  The ability to make your own pasta is such a simple but amazing idea at the same time.  I havent tried any of their menu pasta items yet but being able to make your own pasta allows you to isolate the flavors of the different sauces and add-ins.  \n\nThe staff is always exceptionally friendly and PATIENT...trying to make your own creation can take a second. \n\nThe dining area is always clean even on their busiest days and I enjoy the ability of being able to watch them bring my creation to life.\n\nThe only gripe I had was the bread. Which i can best describe as A failed attempt of copying Olive Garden.\n\nOther than that I've always had a phenomenal experience, even when taking my order to go.\n\nOh and don't forget your lollipop on the way out."
        }, 
        {
            "index": 120, 
            "rating": 4, 
            "review": "Amazing salads for sure plus good cocktails! The outside patio is a great place to set as well as you can bring your pets! That was a big plus. we like to stop and get sushi and then go to Mac Shack for salads and sit on the patio"
        }, 
        {
            "index": 121, 
            "rating": 3, 
            "review": "I have never ordered anything but their lunch special which is a bowl of pasta with your choice of sauce (meat is add'l), soup or salad and a drink for $6.99. It's a pretty reasonable price compared to their regular menu, which I don't really care for. I find the regular menu to be too expensive. \n\nMac Shack is convenient for me since it's right across from work. Besides that, I probably wouldn't visit. Just because pasta is something I can always whip up at home, but if I'm in a pasta kinda mood during my lunch break at work, I would head over here.\n\nI've done pretty much any combo you could imagine in their lunch special. My pasta has always been al-dente for the most part & I seriously have eaten here over 20+ times for the past few years I've worked at my workplace. I particularly like their meat sauce. Sometimes I add bacon or sausage for an add'l fee. Don't really care for their Tomato Soup but I do order it if I don't feel like eating a salad with my pasta. And about that salad, they're not consistent with it. Sometimes I'd get too much dressing or lack it. Too much croutons or I'd be lucky to have at least 4 in there.\n\nAnd the bread.. A year ago, I loved the garlic bread. Probably my favorite part of my meal. I'm not sure what they're doing now but they've changed it a couple times, perhaps experimenting which one would be the best type of bread. Honestly, if it ain't broke, don't fix it!\n\nAll in all, I suggest coming here for lunch for their lunch special. Good price for a complete meal. But if you can just cook your own pasta at home, I suggest just doing that."
        }, 
        {
            "index": 122, 
            "rating": 5, 
            "review": "I either get delivery or stop by to pick it up. But it is always wonderful! And the proportions are plenty! I also love that sometimes if I'm lazy, they could always deliver to me which they're usually right on time and the food is still hot. Don't forget that if you're there, make sure you check in! You'll get free breadsticks and a drink with an entree order! :)"
        }, 
        {
            "index": 123, 
            "rating": 1, 
            "review": "Everyone was telling me how awesome this place was. I ordered food online from here and everyone in my household's order was incorrect. Some were fine..not too bad of differences and some orders were just...complete messes! When someone had tried to contact me, they clearly could not read when I sent them a comment on their site for feedback. I cannot take calls while I am working. They left messages for me to callback during the most inconvenient times. Why give an option to be contacted via email if you do not do that? I've heard so many great things about this place, but I guess I should have dined in instead."
        }, 
        {
            "index": 124, 
            "rating": 4, 
            "review": "Do i love this place! \n\nSuch a great concept. a quick order restaurant with everything pasta has to offer. I always get the build your own with angel hair, vodka sauce, spinach, basil, sun dried tomatoes, shrimp/or chicken. It is absolutely delish! \nMy brother got the Mac & Cheese with cut up hot dogs and ruffles potato chips in it. Sounds odd but its surprisingly amazing. \nThey have an awesome selection of different pastas such as bow tie, rigatoni, and fettuccine. Also an array of toppings. Oh yea and you cant forget their side salad, it has a great house dressing.\nMac Shack also has the cutest decor and an amazing staff. Very friendly. Only bad experience Ive ever had is with a heavy accented manager. He was very rude and unaccommodating when the wrong order showed up via delivery. \nAnd if you decide to pop  in they have a row of Tootsie pops as you leave. very nice touch!"
        }, 
        {
            "index": 125, 
            "rating": 3, 
            "review": "Came here after service at Southern Hills Baptist Church courtesy of cousin and his family.\nCan't beat the \"kids eat free on sunday\"! Unlimited fountain drinks, affordability and good sized bowls. we had the Buffalo chicken mac and the Philly cheese mac. Macaroni was cooked just right. Both good but Buffalo beats  Philly =) I'll be sure to come back for another Sunday to try a different bowl. Thanks cousin again for the invite to your church and treating to Mac Shack! GOD BLESS and don't forget to P.R.A.Y. and the 7 day bible reading commitment :)"
        }, 
        {
            "index": 126, 
            "rating": 4, 
            "review": "I'm not sure why we went back. Laziness? Still being attracted to the concept? But I'm so glad we did. I guess this shows that every place can have an off day... or that restaurants can respond well to criticism and be worthy of a second chance.\n\nWe've been back a few times to Mac Shack since that underwhelming first try, and each time we've been treated with extreme courtesy, and each time the food has been delicious. \n\nThe protein and other chunky \"add-ons\" (like mushrooms) are now plentiful and easy to find in the bowl, unlike the first trip. The bread is hot, soft, and delicious - which I only know because it's free with a Yelp app check-in, along with a soda. I have to respect how savvy Mac Shack is to offer this to their (presumably) more opinionated customers. (And now my smartphone-less husband will be ordering his own on future visits and trying some of mine. Way to get us hooked!)\n\nI also appreciate that the company offers a discount if you order a meatless dish on a Monday. As a vegetarian living in 2011 (as opposed to the less enlightened days of endless baked potatoes and cheese pizza), it boggles my mind that people still ask, \"But-but-but, what do you EAT?\" Mac Shack is challenging its value-minded meat-eating customers to get creative while saving some money. (With a bonus of rewarding vegetarians plus getting more people to save some resources, but - shhh - no preaching.)\n\nOur return visits have been so satisfying that I'm tempted to give Mac Shack five stars. Only one thing - okay, two things - prevents this. First, and this is a total nitpick issue that I expect any sensible person to ignore, they've started selling really expensive (and not particularly impressive) cupcakes from a certain popular local bakery. Didn't I just mention that it's 2011? Why are they trying to jump on the Hipster Cupcake Wagon *now*? (And why with a subpar, overhyped product?)\n\nThe second thing, and this is the real reason I'm docking a star, is that you can't go half-n-half on the sauces at Mac Shack. If you want, say, alfredo and spicy red mixed together, you have to pay the full price for EACH sauce, even though you're only getting half of each. For a place that's all about designing your own pasta dish, this seems like a strange rule. (And one I don't encounter at live pasta stations at buffets, which work under a similar philosophy of choosing your own ingredients.) I'd understand if they were just trying to prevent a bad mix, but you *can* mix the sauces, you just have to pay twice as much. It's, like, a creativity tax, you could say. (Something you wouldn't expect from a place selling cupcakes topped in the emperor's new icing.)\n\nBut overall, I'm really pleased we gave Mac Shack another go. Solid fare, plenty of variety, and a pleasant, casual atmosphere."
        }, 
        {
            "index": 127, 
            "rating": 3, 
            "review": "Decent food, nothing special but great concept and very quick service. I thought the potion size was really large for the price."
        }, 
        {
            "index": 128, 
            "rating": 5, 
            "review": "Tried this place when my best friend and I were craving pasta.  We tried the make it your own pasta which turned out to be the best idea ever!!  We both got gluten free pasta; she got vodka sauce and I got Alfredo sauce.  We both added vegetables and chicken.  We got it to-go.  \nThe lady taking our order on the phone was so friendly and patient with us!  She was even nicer in person. Customer service is on point! Don't forget to grab a free lollipop on the way out too :)  inside is spacious, clean, amd with lots of seating (wooden chairs, tables). \nOur pasta ended up being good for two meals it was definitely fulfilling and worth the money to make your own unique pasta! I would come back here again for the make it your own pasta!"
        }, 
        {
            "index": 129, 
            "rating": 2, 
            "review": "I ordered this for dinner. The larder was getting bare and I have no transportation. My roomie was craving mac & cheese and we stumbled across the Mac Shack. She ordered the Philly mac & cheese. It definitely smelled like a Philly steak. She liked it but said she would have made it better herself. \n\nThat's how I felt about my mac and cheddar cheese. It wasn't terrible, but my mom's mac and cheese would bury this one. This struck me as cooked pasta with grated cheddar, placed in an oven and lightly seasoned (if at all). I prefer more of a cheese sauce that coats all of the pasta rather than grated pieces that clump together.\n\nI tried the meatballs (shame on me!). You get two medium-large meatballs with sauce. I really liked the tomato sauce! It tasted as if it had been cooked down over time, which allowed for a more intense flavor. \n\nThe garlic bread sticks were nothing special. \n\nWould I order from them again? Yes- but not for the mac and cheese!"
        }, 
        {
            "index": 130, 
            "rating": 4, 
            "review": "I have been to Mac shack a few times. Each time I have enjoyed my dish.\n\nLast time I got the wheat pasta with Alfredo sauce, mushrooms and shrimp. It was sooo good. To top it off I had the Groupon deal $3 for $5 worth of stuff. Not too bad\n\nThe reason why only 4 stars is despite the yummy food, the menu is a little pricey. I expected things to be a little cheaper. However, I would go back again."
        }, 
        {
            "index": 131, 
            "rating": 4, 
            "review": "My husband and I had been pretty damn psyched to try this place and I'm happy to report it lives up to expectations! \n\n*Atmosphere: Cute, clean, fresh. I would liken it to Create (atmosphere-wise).\n*Cost: 2 pasta dishes + 2 drinks set us back $18 with tax . I feel like this isn't a bad value, others may disagree.\n*They have COKE ZERO. Hell yes. My favorite soft drink EVER\n*They don't have rotini. WTF they have 3 types of tube pasta and even wagon wheels but no F-ing spiral pasta. Disappointed by that as a spiral pasta fan. \n*Service was fine. They forgot to put our rolls on the plate at first, but when I complained and made a sad face rolls were brought out immediately. They were delicious and worth complaining for, btw\n*Those that complain about the portion sizes are a bit too gluttonous. Sorry, it had to be said. These portions are more than enough for any reasonable sized appetite. My husband and I came VERY hungry and only finished about 3/4 of our food.\n\nSo onto the food!\n\n*Cheddar Mac and cheese with sirloin added. So I MUCH prefer baked mac and cheeses but I can understand why a sauce based approach would have to be used at this sort of establishment. The sirloin wasn't chopped up as much as we liked either (we asked them to cut it up for us). That being said it was quite delicious! Just not \"best mac and cheese in las vegas\" material. \n\n*The Farm. Ordered as described on menu (ham, proscuitto, peas, bowtie pasta, egg, white sauce). YUM! It was a cabonera inspired masterpiece and something that we will be ordering every time. SO freaking good and I did prefer this to the mac and cheese. \n\nBottom line: If you're searching for the best mac and cheese in Vegas, look elsewhere. If you're searching for an affordable pasta joint with tons of options this place is perfect."
        }, 
        {
            "index": 132, 
            "rating": 5, 
            "review": "One of my favorites.  With 2 kids that have very different tastes, it's difficult to find a restaurant we can go to and everyone is happy.  Mac Shack is one that works.  Because we can all customize our meal, even the pickiest eater is happy.  I've never been disappointed with anything I've ordered and I've made some pretty strange combos!   My toughest decision each time I come is what to create to eat this time."
        }, 
        {
            "index": 133, 
            "rating": 3, 
            "review": "Visited the Mac Shack recently with a friend for lunch.  Service was friendly and I was glad they had a whole wheat pasta option.  Large portion but it wasn't spectacular.   Not bad, but not someplace I'll go out of my way to visit again"
        }, 
        {
            "index": 134, 
            "rating": 3, 
            "review": "The Mac Shack has a menu that lets you have countless combos of pasta, sauces, meats, and veggies as well as regular menu items that they came up with. It's not fast food but you don't have to wait long for you order. They even bring it to the table for ya! \n\nI had the Crazy Alfredo. It had one jumbo shrimp, chicken, bell peppers, mushrooms and jalapenos. I opted to add roasted garlic for 50 cents more. All of the dishes come on a biodegradable plates made from banana leaves. I thought that was a nice touch being the eco-friendly person I am.  Every thing is prepared fresh when you order it. The kitchen is open for all to see whet the cook is doing.\nMy main gripe and the reason for only 3 stars is the cost to portion ratio. I could have eaten 2 meals but I really didn't want to take out a loan for it. The total bill for two people with two drinks was like 25 bucks. I never understood why pasta places charge so much for so little. But I don't run the store so I have no clue what the operating costs are.\n\nI recommend every one tries it at least once. I'll go back but I think it's a bit pricey for me to be a regular"
        }, 
        {
            "index": 135, 
            "rating": 5, 
            "review": "SO GOOD! The service is always fast & friendly. I like being able to call in my lunch order and have it ready quickly. The dining area is always clean and the prices are right. The Farm House is by far my favorite; the peas really make the dish for me."
        }, 
        {
            "index": 136, 
            "rating": 4, 
            "review": "Looking for a quick and easy way to do pasta without having to wait a half and hour sit down and eat at a chain restaurant? Well if so check out Mac Shack. Really easy to find and if your in the SW part of town it's probably a place you have driven by many times. Located on Warm Springs, across from Vons it has a very spacious inside with a Subway type of feel (in a good way) to ordering. \nThe menu is very simple to order off of and there are plenty of options to keep you coming back to try them all. The food overall is very good, just a little salty. I have tried a few different dish combinations with Alfredo sauce, meat sauce and a few different combinations of near add ons. Overall very nice place to grab a quick and easy pasta dish without having to go to a chain restaurant."
        }, 
        {
            "index": 137, 
            "rating": 2, 
            "review": "Wasn't impressed. The girl that took our order was apparantly hard of hearing because when ordering she kept repeating back items differently..then when we finally get the order right and we are waiting to get our food, she had put it as a take out order instead of dine in. As for the food, the vodka sauce was yummy with the penne pasta, but the shrimp scampi was such a disappointment. The noodles were al dente but more of a \"sitting around and dried out\" way. The shrimp were tiny and void of flavor.the breadsticks were stale and dry."
        }, 
        {
            "index": 138, 
            "rating": 4, 
            "review": "First time visit, many options to choose from and the food was delicious! Very friendly staff, a family friendly causal dining place when you want a good pasta meal."
        }, 
        {
            "index": 139, 
            "rating": 3, 
            "review": "I like this restaurant so much I drive 30 + minutes. It is good, huge portions, clean & friendly. I was very disappointed today. I ordered chicken. I paid then sat down. then they inform me that they do not have anymore chicken available. This is @ 3 pm on Saturday"
        }, 
        {
            "index": 140, 
            "rating": 2, 
            "review": "I just had this for lunch and I wasn't too pleased. They forgot my order of breadsticks that came with my order and although the food had a great taste it was drenched in oil and now my tummy isn't too happy. I don't think I will be eating here again :/"
        }, 
        {
            "index": 141, 
            "rating": 5, 
            "review": "For some reason, maybe it's because I almost always used to eat at Mac Shack Summerlin, but I feel like the Summerlin makes my mac slightly MORE delicious.  Maybe its in my head.  But I still LOVE this place, and eat here all of the time.  Fairly fast service, but not a fast food restaurant layout.  I'm a fan.  Taco Mac is delicious and they have one of those cool touch screen soda machines that let you choose like everything in the world.  However, I am easily amused - so maybe that's not that impressive.\n\nDelicious nonetheless."
        }, 
        {
            "index": 142, 
            "rating": 2, 
            "review": "We tried this place because my sister boyfriend said it was really good. I don't have the same opinion. The best thing I had was the cauliflower. The CAULIFLOWER!!! I wasn't impressed with the Mac and cheese. I got some barbecue.... That had bacon in it. Everything is good with bacon. I wasn't impressed to enough to remember what it was. \n\nMy wife got a philly cheese steak Mac and cheese. They brought out the wrong one and I think all they did was take it to the back and put some steak in it. Because it didn't taste like it was described. \n\nThe cauliflower was good. It was in some cheesy cream sauce with garlic and it was actually good. But this place is way overpriced. It's Mac N Cheese not a prime rib. \n\nThey get the extra star because of the cauliflower."
        }, 
        {
            "index": 143, 
            "rating": 5, 
            "review": "This place has THE BEST antipasto salad with creamy Italian dressing.  It's the best ever.  They also updated their food packages so that it's in a nice more sturdy bowl.  They also sell cupcakes that are super delicious, and they have good meals for kids.  My kids love going here and I never have any complaints!!!!"
        }, 
        {
            "index": 144, 
            "rating": 4, 
            "review": "I have only been here once and got it to-go, but I will definitely be back and eat in.  The ambiance was very light, clean and new with a few families and couples.  Here is why I will be back:\n\n1. I am a mac and cheese fanatic.  I didn't get a good idea of their classic mac since I waited an hour to eat it...\n2. It's not just mac and cheese, you build your own pasta, sauce, ingredients, whatever you want in it.\n3. The BREADSTICKS.  Yummm, I'm craving right now.\n4. Crushed ice.  So magical.\n5. They have outdoor seating, so I can bring the dogs sometime!\n\nExcited to check it out again!"
        }, 
        {
            "index": 145, 
            "rating": 4, 
            "review": "Have I had better pasta? Yes. Did I need to pay a pretty penny? Yes. With that being said Mac shack offers very good pasta and sauce variety for the price. The service was quick,  with a smile, just like how I like it. will return when I need a quick pasta fix."
        }, 
        {
            "index": 146, 
            "rating": 2, 
            "review": "Sometimes there's a place that has a lot of hype...everyone you know loves the place, and then you go there and well...it's not that good.\n\nThat's Mac Shack, don't get me wrong it's not bad, I like the concept, and the food was decent, but the portions were kind of small, the prices were fairly high, and there were some bugs on the Jalapenos.\n\nI think if this place hadn't been as hyped as it was it may have been a little better for me, but I went in expecting the greatest mac and cheese on earth and got a plate of average."
        }, 
        {
            "index": 147, 
            "rating": 4, 
            "review": "Crave this place. Pepper jack mac is great. Had bowties in roasted pepper sauce with two kinds of mushrooms. It was so memorable, profound flavor. Casual seat yourself, but i wish it wasn't. The other customers are too casual and gross me out during my meal. Good for lunch."
        }, 
        {
            "index": 148, 
            "rating": 5, 
            "review": "Let's start with my co-worker took me to an Italian place, and I'm lactose intolerant... I was scared. \n\nAfter getting to Mac Shack I found everything was made fresh, and the menu is 100% customizable !! Not just for me as an exception but for everyone. I had an entire filling and very satisfying meal all dairy free and most importantly hassle free, and no mistakes. I love this place and the staff is friendly and courteous, the restaurant is clean and tables are laid out really well, so no one is on top of each other even when it's busy. The portions are large and filling...I'll definitely recommend it to everyone and I'll be back over and over again!"
        }, 
        {
            "index": 149, 
            "rating": 3, 
            "review": "It's a safe solid place for pasta. It's a great value and the service is always great. I come here whenever I feel like changing things up for lunch.\n\nProtip: Get the kid's mac and meatball, it's practically the same size of an ordinary bowl and it's a few dollars cheaper. PLUS you get a soda and a fruit roll-up.\n\nWell, it says you get a fruit roll-up on the menu. But I have yet to receive one with my meal. I believe it's meant for children, but dammit it says it's included. I even had a server bring out the whole combo one day and she didn't hand me the fruit roll-up and I eyed it and she knew it, but refused to say anything. It was like she was waiting for me to make my move.\n\nI didn't say anything in an attempt to bluff her, she turned around and walked away with my fruit rollup. WHY!??!!  \n\nI've probably been screwed out of 12 fruit rollups. This injustice cannot be ignored, too many adults who don't like certain kind of cheeses get that damn fruit rollup. \n\nA man can dream"
        }, 
        {
            "index": 150, 
            "rating": 4, 
            "review": "Location - strip mall on Durango and Warm Springs, parking is limited , corner\n\nAtmosphere - theme suits the place , vibrant colors with an optional outdoor seating , family friendly\n\nService - create your own pasta or choose among their signature dishes , order at the counter and food is brought out , no complaints on service , food was prompt and fresh\n\nFood - yet to be disappointed , very easy flavors , tons to choose from , fresh and cook to order , sucker for anything Alfredo , they also offer \"healthy\" alternatives like wheat and gluten free\n\nFinal Thoughts - a little pricey especially if you decide to create your own , ingredients run around .75 cents each but portions are very filling and will leave you satisfied , they also deliver , only negative is that garlic bread doesn't come with it ... 4 stars"
        }, 
        {
            "index": 151, 
            "rating": 1, 
            "review": "My wife ate at noodle and co. In Colorado and she raved about for a few days. So I noticed someone said this place was like it so I thought hey let's give it a try. It was terrible!! I got the pesto chicken, wife got a veggie dish, and we got our daughter regular Mac and cheese. When we got the food is was so hot!! I mean unbearable hot. So after waiting a few minutes I tasted and it was undercooked noodles and a weird taste. I never leave food that I just purchased but this was BAD!!! An awkward worker came by and asked how it was and I told her \"this is terrible!\" I don't think she new how to react to this. She said I can take it back. I told her, really this dish was $8. If I was at a sit down restaurant then I would of had her take it back in a heartbeat, so I felt bad about trying to get my money back or another dish. I ended up eating half of my daughter's Mac and cheese. So just to sum up don't go to this place with high expectations. I was very disappointed!!"
        }, 
        {
            "index": 152, 
            "rating": 4, 
            "review": "Comfort food at its finest! If you're looking to get real full for real cheap, this is your spot. \n\nAt first I wasn't in a big rush to try out the Mac Shack simply because I'm not really a mac and cheese hound. Then I realized they make an assortment of pastas with almost any kind of sauce you can think of. Then it was on. I love pasta and who always has time to wait for that damn water to boil??! From basic red sauce to vodka sauce to alfredo, they do great specialty bowls as well as make your own combination.. \n\nThey also serve side salads, breadsticks...the usual pasta accompaniments. Mmm the breadsticks. Check in on Yelp when you get there and you get those bad boys for free! \n\nService is always great, the people are very friendly and patient with people like me who stare at the board for 20 mins. Grab a tootsie roll pop on your way out for free dessert!"
        }, 
        {
            "index": 153, 
            "rating": 2, 
            "review": "Not impressed.   Pasta was mushy very little chicken in my dish and even less broccoli.   Won't be going back."
        }, 
        {
            "index": 154, 
            "rating": 5, 
            "review": "my favofite combination: spaghetti, vodka sauce, sirloin, mushrooms, & sun dried tomatoes."
        }, 
        {
            "index": 155, 
            "rating": 5, 
            "review": "Second time visiting Mac Shack.  A+++++ totally delicious.  WHole wheat pasta with spinach, artichokes, peppers, mushrooms and red sauce.  Yum.   The portions are just right and the price is as cheap as taking a family to Mcd's.  Healthy, tasty.  Just one thing, can you build one closer to Summerlin already??"
        }, 
        {
            "index": 156, 
            "rating": 4, 
            "review": "We have been eagerly awaiting the opening of Mac Shack, and it was worth the wait. My boyfriend had the blue cheese mac and enjoyed it.  I had the build your own pasta and really enjoyed the vodka sauce and artichokes.  We'll be back!"
        }, 
        {
            "index": 157, 
            "rating": 3, 
            "review": "The food is decent. Overpriced but taste good. The service it just depends who you get. Most the time I end thinking I could just make the same thing at home for a quarter of the price. But they do make your food fresh to order so I'm sure that's part of the cost. Everything we've had was great except the *Gross Breadsticks* don't waste your money!"
        }, 
        {
            "index": 158, 
            "rating": 5, 
            "review": "As far a fast casual dining goes I Love this place.  I find myself ordering signature dishes togo despite the fact that I have a pantry filled with dried pasta.  I also bring my two year old twins here often as it is kid friendly and the children's pasta in broth is magical to them.  It also helps that they offer cupcakery cupcakes.  If you live in Las Vegas this is a must try spot!"
        }, 
        {
            "index": 159, 
            "rating": 5, 
            "review": "I got a groupon to go here so my boyfriend and I tried it out yesterday.  I was completely blown away.  This place is wonderful.  The atmosphere is great (can't go wrong with Peter Lik on the walls) and the employees were very friendly (helped with the menu and the owner even came by to ask how everything was).  \n\nMy bf and I ordered of the 'make your own' list.  He got penne with a spicy red sauce not on the list with broccoli and fresh tomatoes.  I got bowtie pasta with vodka sauce, artichokes, olives and button mushrooms.  My pasta was one of the best I have had in a long time (minus the Pasta Shoppe!). The pasta was cooked perfectly , the  ingredients were fresh and there was just the right amount of sauce.  My bf's was a little to spicy for me but he really liked it. There was enough food that we each took home leftovers.\n\nThe price was a little higher than we expected before we got our food (about $17 no drinks).  After eating our pasta we realized that it was much cheaper than what we would normally pay for pasta of this quality.  We are definitely going back there again soon and bringing friends!"
        }, 
        {
            "index": 160, 
            "rating": 2, 
            "review": "Where's the Beef??\n\nWe've been curious for sometime and today was the day.\n\nPeople have short attentions spans so I'll keep this review brief.\n\nUpon entering there was no line and we went straight to the register at 2:05pm on a Saturday afternoon. Our cashier later turned out to be the \"manager\" We told him this was our first visit and asked for a walk through. He pointed to the menu and explained \"I guess they call these the pastas\" he made no mention of their $7.99 lunch special, or their rewards program. -first time visitor-fail!\n\n$27 for two people eager to try out the goods. I ordered the philly Mac ($9.95) and added mushrooms for .65. See the photos for details, all proteins here are portioned out to 2.5 ounces. I paid $10 for the philly, and only received a drizzle of meat. What a joke.\n\nThe staff was busier singing along to Justin Beiber and playing with the stereo system than cleaning. The benches are torn and there's trash all over the floor. As I write this review 38 minutes after walking in the door they are finally making a half attempt to sweep.\n\n***training tip*** the worker who is sweeping also delivers orders to waiting tables. Please train her to keep her thumbs out of pasta and soup bowls. A minute ago she was sweeping trash, and now she's got her thumbs inside of food bowls. There was no hand washing in between, I watched!\n\nIt's an interesting concept, and the food wasn't awful, but the portions sizes are a joke (tons of Mac, a dribble of anything else) the staff is young and inexperienced and the facility is quickly going downhill.\n\nNext time I'll save my $27 and go elsewhere."
        }, 
        {
            "index": 161, 
            "rating": 2, 
            "review": "American/Italian macaroni and cheese is available as cheddar mac, pepper jack, mac or asiage blue mac yummy. Patrons also can choose a pasta 9 (gluten-free available) and a sauce and add ingrelients for 50 cent each and proteins for 1.50 each."
        }, 
        {
            "index": 162, 
            "rating": 4, 
            "review": "This was my first time at Mac Shack and I will be back! Quick, delicious food at great prices.  Plus the staff was very friendly."
        }, 
        {
            "index": 163, 
            "rating": 4, 
            "review": "This place is great!  I bought a couple Groupons to check this place out, and I'll definitely be back even though I've used both of them.  The whole wheat pasta with broccoli pesto sauce and zucchini, sundried tomatoes, and asparagus is hearty and delicious.  The service has been fine.  The food gets out very quickly.  My only issue is that I think the prices are a little high for the portion size."
        }, 
        {
            "index": 164, 
            "rating": 1, 
            "review": "Ok... so Mac Shack used to be great and I was super excited that there was a place in the southwest to get a good inexpensive bowl of pasta. Unfortunately, that is no longer true. They are totally nonchalant about deliveries of their over-rated pasta being 30+ minutes late (its ironic that the receipt says, \"now offering FAST delivery\") and if they get your order right --- well then lucky you.  I've gone back a few times hoping they would bring back the original feeling... but it is definitely gone."
        }, 
        {
            "index": 165, 
            "rating": 4, 
            "review": "It pays to go meatless on Mondays at the Mac Shack.  I ordered the regular Macaroni & Cheese (Cheddar) and it was 20% on Meatless Mondays.  I'm not a vegetarian but if I was that would be a major score.  It's still a major win for yours truly.  The other members of my party ordered the make-your-pasta and nothing disappointed.  The place was clean and organized and we were in and out quickly.  I know that I can come here for a quick bite and somedays that's all I have time for."
        }, 
        {
            "index": 166, 
            "rating": 5, 
            "review": "BOMB!!!!! This is the best fast food place ever! It's sit down so it's not fully fast food like a Burger King or Carls Jr. But it's still order at the counter, eat at your seat. It's basically \"create your own\" pasta. It's soooooooo good. I love it. Try the garlic and oil sauce. Super tasty. Add chicken. Can't go wrong!! Oh and kids eat free on Sunday. It's perfect"
        }, 
        {
            "index": 167, 
            "rating": 4, 
            "review": "I'm one of those people that atmosphere speaks to customers as well...Walking into the place there was three people in the front. One girl sitting on the counter, another gentleman talking to her, and the second gentleman that actually acknowledged us when we came in and took our order. We ordered, got our drinks and went to look for a table. There were 5 tables that still had dishes and trash sitting on them and a few more that the tops were dirty. The floor was dirty too. You would think since the people at the front had time to sit around and talk they could've cleaned their dining room. Not to appealing to sit around a bunch of dirty tables. The woman that brought our food finally came and cleaned all of it. The food was good and I would go back for take out but dine in probably not. Unless they pay better attention to the dining room and actually greet your customers with happy joyful attitudes. You gave me the impression that you didn't even like that place."
        }, 
        {
            "index": 168, 
            "rating": 2, 
            "review": "Do yourself a favor and go to the Charleston location. I ordered the lunch special. After asking about the side options I chose a Caesar Salad, but was later informed they were actually out of caesar dressing and I'd have to use ranch. How do they just run out of supplies? Also, this place just looks dirty and the food was not as good as the Charleston location. Ended up leaving half my lunch untouched."
        }, 
        {
            "index": 169, 
            "rating": 5, 
            "review": "This the kind of restaurant where you get a craving for it and you go so that your craving is settled, but you probably won't be going back until you get another craving.\n\nNow with that said, I love this place!  It's a great concept...crave pasta, get some pasta.  They pretty much make any variety you can imagine with the ingredients they have available.  I love the \"Pepperjack Mac.\"  Wow!  They also make a specific pasta with angelhair that's lightly sauced with sun dried tomatoes.  So good!  Also, I recommend their caesar salad, it's tossed perfectly with just enough dressing, cheese and croutons.\n\nI can't say enough good things about the staff at this restaurant.  I've been here several different times and been helped by different people each time.  They're all so nice and happy.  They are more than willing to change an order, even if it's already been made.  The customer service at this place is amazing and the manager should be very proud of the people they have operating this establishment.\n\nI completely and totally recommend this place...you won't be disappointed by the service or product!"
        }, 
        {
            "index": 170, 
            "rating": 4, 
            "review": "I go here for lunch at least once a week, then have the leftovers the next day, making it worth the extra cost. Good pasta with lots of options for sauces and toppings, from the truly decadent mac and cheeses to a light olive oil and garlic topping.\n\nOne thing I really appreciate is that they have no fewer than three unsweetened iced tea flavors. Nice!"
        }, 
        {
            "index": 171, 
            "rating": 4, 
            "review": "I have nothing but great things to say about the Mac Shack! High quality pasta, fresh vegetables, and a friendly staff! I ordered carry out this time and even after the drive home the food still had great flavor! \n\nGreat vegetarian options!"
        }, 
        {
            "index": 172, 
            "rating": 5, 
            "review": "!!! I LOVE MAC SHACK! They definitely are not kidding when they post that \"People on Yelp love us\" sticker on their door.  I probably come as often as I can. Carbs are my game and Pasta is my name! I do enjoy all the organic and healthy choices they have on the menu and how they have a make your own pasta. I'm already drooling..Not even going to get started about how addicted I am. I love the little coupons they have and punch cards along with Check-In offer via Yelp, of course. Here's the real after burner. Save your receipt form Mac Shack and bring it next door for a 20% discount from Golden Spoon Frozen Yogurt. And the best part is that the offer works both ways/vice-versa, if you're a desserts before dinner kind of person.  The pricing may seem a little bit high, but you do get what you paid for in noodles. oodles and oodles of it. Haaah, I can barely finish my bowl and I eat like a maniac. But overall, Mac Shack was a incredible experience for me. The friendly staff to the great food. Awesome.\n\nIf you're undecided on what to get. Make your own and go crazyyy! My personal fav'is the fettuccine noodles with vodka sauce and a little bacon goes a long way, plus some healthy choices like spinach and mushrooms. Delish and Yummy!"
        }, 
        {
            "index": 173, 
            "rating": 3, 
            "review": "Ahh Mac Shack. A little joint where you can get just about anything in your macaroni and cheese.\n\nMy boyfriend and I come once or twice a month.  It's good, affordable, and quick.\n\nWhen it comes to my mac and cheese, I am a plain jane.  I love traditional cheesy macaroni.  Usually I just get regular mac and cheese.  But lately I have been getting the chicken noodle soup (which is pretty good) and the grilled mac and cheese (seriously amazing!!).  My boyfriend took a bite of it and was extremely jealous.\n\nMy boyfriend gets the crazy alfredo (chicken, sausage, shimp, red peppers, sun dried tomatoes, mushrooms, jalapenos, alfredo sauce) and absolutely loves it.  We also get the garlic bread, which in all honestly needs a little salt and should be cooked longer.\n\nService here is (usually) really good."
        }, 
        {
            "index": 174, 
            "rating": 4, 
            "review": "Actually I think it's not a bad place :) \n\nFree lunch + great service ( My, their lunch time service is much better than dinner time )... and of course great food ( I upload couple pix, check it out... )\n\nBut I don't like their tomato soup that much and their backgroup music.. and their price are not cheap even at lunch!"
        }, 
        {
            "index": 175, 
            "rating": 4, 
            "review": "Our second time trying this place. The Baked Truffle Mac was the best item we order. A must have! The cashier was very friendly as well."
        }, 
        {
            "index": 176, 
            "rating": 1, 
            "review": "Great concept. Pretty tasty.\n\nPortions are tiny. \n\nDon't be deceived by ordering \"meatballs\", they give you 'a' meatball the size of a golf ball.\n\nI was charged 50 cents for them sprinkle basil on top of my dish. 50 more for a pinch of sundried tomatoes, etc...\n\nFor about half the price of my pasta I could have ordered a pasta dish at the Macaroni Grill with about 3 times as much food.\n\nThis place will not last. Most people will try it once and never go back to pay $10 for a side portion of mac and cheese with 'a' shrimp.\n\nI went home hungry and made myself a sandwich."
        }, 
        {
            "index": 177, 
            "rating": 1, 
            "review": "Mediocre food.\nMy pasta was very salty and I had to send it back. The workers didn't apologize, they just took it recoiled it and threw it back out.\nThe 2nd time was still salty but not as bad.\nWe didn't get offered the lunch special so we ordered everything separately and it came out to a lot. \nI was very disappointed because so many of my friends raved about this place."
        }, 
        {
            "index": 178, 
            "rating": 4, 
            "review": "This is one of my favorite places for a quick pasta fix. It's cheap, good and the portions are pretty big. The place is very clean and the staff is really friendly and nice. I love that you can create your own pasta. Good place for casual Italian."
        }, 
        {
            "index": 179, 
            "rating": 5, 
            "review": "Oh! Oh! Mac Shack is Awesome!\n\ni went here last night great meal great service! The food is fresh and light and you can never go wrong with any combination.  Most importantly the staff couldn't be more courteous and friendly and generally all-around cool.  \n\nNot super expensive and the food is worth every penny. \n\nHuge fan of the Rigatoni D!"
        }, 
        {
            "index": 180, 
            "rating": 3, 
            "review": "Good food, dogs in a restaurant, not so much.called and asked that they ask the dog owner to remove the animal and employees did nothing"
        }, 
        {
            "index": 181, 
            "rating": 3, 
            "review": "Was very excited at first to try out a DIY Pasta restaurant, but there really isn't anything special to their pastas. Just so-so..\nAlthough their ingredients are quite fresh and choices are endless, you could make the same pasta with Ragu sauce at home for much less. Not too much worth the price unless you're really craving pasta you are in a rush.\nOn the other hand, really quick service and clean and open dining area."
        }, 
        {
            "index": 182, 
            "rating": 5, 
            "review": "On a recent visit I just discovered the grilled sandwich selection.  WOW! The Peanut Butter & Jelly Grilled Sandwich is so delicious.  5/5 Cooked to perfection--Recommended--Must Try"
        }, 
        {
            "index": 183, 
            "rating": 4, 
            "review": "My friend and I went to Mac Shack for lunch and we both loved the concept of \"create your own\" pasta.  I was informed that the restaurant is owned by the same folks who own Nora's and that they're considering franchising Mac Shack's.  \n\nAll of the ingredients were extremely fresh and tasty.  I enjoy I had the special, which was linguine with pesto, portobello mushrooms, green peppers and shrimp.  My friend had whole wheat pasta with vodka sauce, eggplant, broccoli and olives.  I thought her pasta tasted much better than the whole wheat pasta I normally buy in a box at the supermarket.  Neither of us could finish the whole portion, which included a small roll.  There are take home boxes available next to the soda station.\n\nThis is a nice, inexpensive place to go with anyone, especially a bunch of picky eaters... they can make their food to their own liking.  You can specify to \"go light on the sauce\" if you want.  The decor is actually really attractive with Peter Lik photos throughout.  Beer and wine is available - yay! - and the patio looks like a nice place to enjoy dinner when it's not over 100 degrees!"
        }, 
        {
            "index": 184, 
            "rating": 5, 
            "review": "Love having fast and convenient Italian food in SW Vegas! The food is relatively high quality and made when your order. Highly recommended if you like Italian with out always having to sit down for a long meal."
        }, 
        {
            "index": 185, 
            "rating": 4, 
            "review": "Food: I am picky and they had choices where I didn't have to worry about there being too much going on. I got the build my own pasta and a tomato soup, both of which were good. My friend got the cannoli chips which she loved. I'm not into cannolis, so I trust her opinion. But she also raved about the taco Mac.\n\nAtmosphere: great music! It interrupted our conversation because we kept wanting to sing along.\n\nI think it is overall a great place."
        }, 
        {
            "index": 186, 
            "rating": 3, 
            "review": "We were heading to a concert and needed a quick bite before meeting friends who live in the area so we grabbed Mac Shack for everyone.\n\nBasically, it's a quick order place for pasta that have specialties or you make your own. It's an answer to Chipotle for pasta. \n\nThe BF and I shared - \n\nFarmHouse - this was OK. I liked the sauce, but I could have honestly done without the toppings as the ham was salty for me and the peas were fine. There was no egg, though it says on the menu there is. \n\nBottle service - I liked their vodka sauce and mushrooms, but it was skimpy on beef. It didn't really need it. \n\nPortions I think were good as we were both pretty full sharing and had a few bites we couldn't finish. \n\nI did a checkin for a free order of breadsticks (2pc). It was standard, but good. \n\nIt seems the way to go here really is meat free. I feel like once the meat is added its slightly much for order up food and it didn't really add much to the dish. I will make my own and stick to veggies. They do a pretty decent lunch special for $6.99, but I did not catch the timeframe it runs and if it is daily. \n\nI will probably be back, but it's not a spot I would be running back to. For a quick bite though, I would definitely order something with the vodka sauce again."
        }, 
        {
            "index": 187, 
            "rating": 1, 
            "review": "Ordered gluten free pasta with shrimp, asparagus,  mushrooms and spinach. Got a bowl of pasta. 5 baby shrimp and no asparagus tips. Very disappointed to pay extra for nothing. 2 kids mac n cheese orders were half of what they normally are. My daughters left hungry and I left unhappy. Transaction 271528"
        }, 
        {
            "index": 188, 
            "rating": 1, 
            "review": "I was craving pasta and I wanted a quick fix, so I decided to come here. Biggest mistake ever. \n\nI ordered the Broccoli Pesto with angel hair pasta. Absolutely disgusting. It tasted like I was just taking bites out of raw garlic cloves. The garlic was so strong, it literally made my eyes water. \n\nThe pasta was cooked fine and the chicken was okay, if only I was able to actually taste the broccoli pesto, and not just clumps of garlic.\n\nThis hasn't been my first time here. I've order a few other times, and everything else that I've ordered in the past has always been bland, dry, and tasteless. \n\nAfter this experience, I probably will never go back...Unless my pasta craving is a do or die situation. I'll just have to learn how to be patient and cook my own pasta from now on."
        }, 
        {
            "index": 189, 
            "rating": 4, 
            "review": "Fun place to try. We had the artichoke Mac and cheese and it was really good. My daughter ordered the chicken noodle soup and it was awful. The only redeeming quality about it was the big chunks of real chicken. Other than that, it was basically watery broth with celery and onions. There weren't even real noodles in it. We found about 6 smal elbow pastas in there. We were pretty disappointed after the first bite so I took it to the counter and asked if we could get something different. I was nervous because I've never done that before. The manager was super nice and didn't even hesitate to give us something else. We ordered a kids Mac with added ham. It was delicious and my daughter loved it! I would go back just for that. I ordered a salad and it tasted fresh and clean. So other than the soup, the food was delicious. Service was better. Will return."
        }, 
        {
            "index": 190, 
            "rating": 1, 
            "review": "I didn't know it was possible to mess up macaroni and cheese. Mac Shack has proven me wrong. Twice."
        }, 
        {
            "index": 191, 
            "rating": 5, 
            "review": "Crazy Alfredo whaaaaaaaaaaa??? Tons of meat and tons a favorable sauces. I was impressed. I never really thought pasta could be impressive but this place is a must!  really nice staff and if you don't like what they have already set in place on the menu, you can build your owns which is always good"
        }, 
        {
            "index": 192, 
            "rating": 3, 
            "review": "Did I really just pay $25.00 for two bowels of Mac n Cheese? Sadly and a very disappointed yes, yes I did. Even more disappointing is that I received a free bread stick and drink and it still cost me $25 for two people.\n\nI ordered their philly cheese steak bowl and it had alright flavor and was a healthy portion size but didn't have enough meat or vegetables to really be considered a \"philly\" The Daughter ordered the crazy Alfredo and all I could get her to say about it was \"it tastes alright but its nothing special\"\n\nI guess that is really the best line to sum up our entire experience. It tastes alright but its nothing special. Not sure what I was expecting but I wanted some cheesy, gooey, max and cheese that would bind me up for a few days. I seriously doubt I will have that problem tomorrow."
        }, 
        {
            "index": 193, 
            "rating": 1, 
            "review": "This place is just plain OVERRATED. They wouldn't even trade out meat in a dish for something else without  charging me extra, that or the lady taking my order just plain didn't understand. Still, waste of your money. Go in and see the ideas they have for the specialty dishes and then go home and make it yourself."
        }, 
        {
            "index": 194, 
            "rating": 2, 
            "review": "I'm giving Mac Shack only two stars because in the last few months they have really gone downhill.  I live close enough to walk here but only go when I'm really, really tired and it's the last resort.  The people behind the counter taking your order either don't listen or don't care what you order because it typically comes out wrong.  The portions are not consistant.  sometimes your pasta bowl is full and sometimes its not.  The last time I had wheat pasta with chicken and zucchinni.  There were 4 pieces of zucchinni and 5 pieces of chicken, all very small.  The server who brought out our food was dressed like a pig and had several stitches in his forehead, NOT COVERED.  It was disgusting.  At least have the decency to cover that dirty crap up so the customers don't have to look at it!"
        }, 
        {
            "index": 195, 
            "rating": 4, 
            "review": "I'm really glad this place opened around the corner from me. Its a great place to feed my family quickly, while not breaking the bank. I have ordered from here on multiple occasions for dine in and take out and have not been dissapointed yet. \n\nThe Atomosphere is clean with a modern yet cozy feeling to the decor. Good place to take the kids out to eat, without going through the whole sit down restaurant wait.\n\nIf you can't tell this place is obvisouly all about the pasta. My wife and I particularly like the Asiago Blue Mac. The Farm House and Veggie have also been good. Portions sizes are good to fill ya and maybe have a bit for left overs. (I don't but my wife does, I think it tastes to good to stop)"
        }, 
        {
            "index": 196, 
            "rating": 3, 
            "review": "So I tried this place with my friend because we both live near by and it was a convenient meeting place.    Had the BBQ mac and cheese, and it was fine, but nothing special.  The portion was large, so I felt like I got my money's worth, but honestly, for mac n' cheese, I was expecting a bit more flavor.  The only flavorful thing on in my mac was the bacon, even the cheddar flavor was surprisingly weak.  I'm hoping that the next time I go and try a different Mac it'll be a bit cheesier.  Service was very good and the food came out quickly which was a plus though."
        }, 
        {
            "index": 197, 
            "rating": 2, 
            "review": "Please! Please! Check your food before you leave if your gonna take this home. Let's see I ordered 2 kids meals one with a Meatball one without  the first was $4.95 this should include pasta with sauce + meatball + drink + fruit roll up. I only got the pasta with sauce No meatball No Drink No fruit roll up. The second  $4.50 this should include pasta with sauce + drink + fruit roll up. I only got the pasta with sauce No Drink No fruit roll up."
        }, 
        {
            "index": 198, 
            "rating": 3, 
            "review": "Just, eh. I had heard great things from other people...and it wasn't horrible, but it also wasn't amazing Mac n cheese. I got the base Mac n cheese with chicken, bacon and broccoli. It was good (make sure you really stir it up), but I wanted a bit more of something special! The first garlic stick I had was great. It tasted like it was made with real garlic. The second one was stale (signs that I shouldn't have had a second I suppose!)."
        }, 
        {
            "index": 199, 
            "rating": 3, 
            "review": "Some dishes like Asiago Blue Mac and Roasted pepper sauce knock it out of the park but others disappoint like the shrimp scampi has no flavor. I love that you can upgrade to the larger \"manga\" size but it's disappointing that the other ingredients don't increase with the portion size. Always double check your order before you leave. They have delivery that I tried for the first time on Sunday so that was pretty convenient."
        }, 
        {
            "index": 200, 
            "rating": 3, 
            "review": "I've been craving pasta like crazy but didn't want Olive Garden, so my boyfriend suggested this restaurant. When you walk in, you look at a menu from the wall and you order standing up like at a fast food place, then they give you a number card and you place it on your table.This place reminds me of a place called nothing but noodles in El Paso, TX before it closed down, except that place sold a bunch of noodles and pasta and this Mac shack sells pastas, salads, wine, beer, cannoli and cupcakes.\n\nFood came out really quickly and hot. I ordered the broccoli pesto pasta and my boyfriend got the create your own pasta with bow tie pasta, fettuccine sauce, chicken and peas. The cool thing is, you can create your own pasta from a variety of pastas, add ons and sauce. The starting price is $7.95 and I think each additional add in is $1.99. Breadsticks aren't included but they are pretty crispy and delicious with a hit of garlic. Breadsticks are sold in a pair for $1.98.\n\nAll in all, I think I will come back when I have a pasta craving. I feel like this place cooks the pasta a lot better than Olive Garden, it's not too soft or too al dente, it's just right. Can't wait to try something else on the menu!"
        }, 
        {
            "index": 201, 
            "rating": 3, 
            "review": "They do have gluten free options but for only 10% of the menu. As much GF pasta as there is available in the marketplace why limit it? The toppings are the biggest factor. so what if my GF noodles aren't the right shape for the topping like the wheat ones? I ordered meatballs n gf pasta. Tasted quite plain. I've had better jar sauce from the grocery store. They also forgot to put Bacon on my friends order. Do they know people get shot over forgotten bacon?. The vanilla cupcake (wheat) was on the dry side but ganache filling was delicious! \nAs it is a basic chain, I will not be returning. Lots of other tastier options out there."
        }, 
        {
            "index": 202, 
            "rating": 4, 
            "review": "I was pleasantly surprised. Really cool concept. Nice decor. Reasonably priced. Food was pretty good. And lots of cool little touches like nice napkins and real silverware. Definately worth checking out!\n\nYou can also sign up for their email list which alerts you to beer/wine tastings paired which thier pasta creations...events are weekly/monthly-ish."
        }, 
        {
            "index": 203, 
            "rating": 3, 
            "review": "Mac Shack is an interesting concept which happens to be close to my house in Mountains Edge.  Picking all sorts of Macaroni and sauce with neat add-ins.  This place isn't the cheapest, although I've used a coupon once or twice and the portions are decent.\n\nI'm still searching for that \"perfect\" combination that makes me really crave this place.  But it's always a top suggestion to my friends in the Durango/Warm Springs area."
        }, 
        {
            "index": 204, 
            "rating": 2, 
            "review": "When a friend of ours finally revealed to us that Mac Shack was not a trendy place to have creepy computer networking parties while enjoying overpriced coffee, my wife and I decided that a mac and cheese based restaurant sounded cool. After we discovered that Mac Shack was being brought to us by the genius culinary artists of Nora's, we couldn't wait to try it out. Spoiler alert...this place makes food that Nora was making in an Easy Bake Oven 45 years ago, and I recommend that if you want a similar quality of food for over half the price, go up the street to Fazoli's. \n \nSo, my first indication that Mac Shack was a terrible experience was the typo on the door sign. If you are going to throw obscene amounts of money into your pursuit of being the next Chipotle, learn how to use apostrophes (i.e. \"pasta's).\n\nThe menu was put together nicely. I was a little weirded out by the TV on the side showing off-menu items and specials. It felt a little too-cool-for-school to use a TV to show off specials, but maybe I am old school in that way. I like the blackboard and chalk approach way more. Anyhow, we settled on some tasty sounding menu items. I ordered the Pepper Jack Mac, my wife got the Red Rigatoni, and we ordered the Baby Mac and Cheese for our son. We also ordered a house side salad, a Caesar side salad, and bread sticks. I kind of freaked out when our bill was 40 dollars. Were we at Nora's or a place called Mac Shack? We should have gone to Nora's. \n\nThe food took a while to come out, but it wasn't too bad of a wait. The food came, and it was hot enough to fry an egg on top of our pastas. Literally, steam was racing off the top of my son's \"Baby Mac and Cheese.\" He waited 20 minutes to eat. This is always a pleasant experience with a 3-year-old who loves mac and cheese.\n\nSo we ate bread sticks and salad. I think the bread they serve here may come from a bag. They were chewy and the crust wasn't crispy, warm, or buttery. If they are homemade, I am solidifying my theory that they are using easybake ovens in the kitchen. \n\nThe house salad was really good. I can say that the best thing we had was the garden salad. Dressing was good and the greens were fresh and interesting. The Caesar was really bad. The dressing tasted like i was shoving anchovy paste in my mouth. It was too much fish. It could work in some restaurants, but really not a good idea for Chipotle gone pasta. \n\nOnce the food cooled down, it was very boring. By the end of the meal, we were thinking how we could make all this at home for a quarter of the price. We discovered that this place makes a great meatball (The meatball and house salad are the only reason I would rate this place two stars), but everything else was just mediocre. The serving sizes don't jive with the prices, and they were not exciting presentations. The Pepper Jack Mac comes with \"fried jalepenos\" but when it came, it had 3 razor thin slices of raw jalepenos. Not very exciting. The red rigatoni was saved by the meatball, but everything else about it was sad. The sauce was bland, the chicken sausage had little flavor and the pasta was overcooked. My son's pasta was a step up from Kraft. Except I would never bring pasta that hot to a kid. \n\nAt the end of the meal, my son had a Fruit Roll-Up to look forward to. I am just thinking here....and if I were developing a cool, trendy pasta place with innovative and exciting dishes that I was trying to market to foodies....I would probably serve kids meals with Fruit Roll-Ups. This was the perfect end to a perfectly disastrous meal. I don't like giving my kid Fruit Roll-ups, and I have to wonder about a restaurant that does. McDonalds even has fresh fruit these days. But they could have even done a cookie or ice cream. Why on earth would they serve something that you could buy prepackaged at Smiths? \n\nIn closing, this place has all of their attention focused on making this a franchise-worthy experiment. But you cannot be the next Chipotle when you have ordinary food. I don't even think they should try to be the next Chipotle, but it is clear that is their main goal with Mac Shack. In the end, I don't even think the first restaurant will succeed if they cannot figure out how to make better food at a more appropriate price. But based on some of the yuppies giving this place 5 stars, maybe I have no idea what good food is. \n\nNext time we are looking for good \"pasta's\" we will not dine at Mac Shack. Hopefully nobody that reads this review will make the same mistake we did."
        }, 
        {
            "index": 205, 
            "rating": 4, 
            "review": "I ordered for take out. They were pretty busy for a week night but it was still pretty quick. Staff was very friendly in spite of how busy they were. Food was really good -especially liked the cauliflower sunday gratin."
        }, 
        {
            "index": 206, 
            "rating": 2, 
            "review": "I've been to this location numerous times and I always get the same thing.  The \"bottle service\" dish.  I used to get a heaping serving of steak and mushroom and now as of lately I'm lucky to get 2 pieces of steak.  Maybe the different location is different?"
        }, 
        {
            "index": 207, 
            "rating": 2, 
            "review": "Bland boring noodle place. I was hoping this would be like the chain Noodles & Company. Nope. The feel of the place is nice. The pesto pasta dish I received had no flavor to it. It was very bland for pesto."
        }, 
        {
            "index": 208, 
            "rating": 1, 
            "review": "I had a craving for pasta one night and thought it was a brilliant idea take a trip down the road from my house to Mac Shack. \n\nI was wrong. \n\nThis place is seriously overpriced. I paid about $30 including tip for my boyfriend and myself for watery pasta covered in bleh (flavorless) sauce with skimpy portions of toppings. We ordered the alfredo and the rigatoni with some toppings. Certainly not impressed. The portions were not that impressive either. For the same price, I'd rather go to Olive Garden and have something tastier. \n\nPerhaps I didn't do a good job of building my own pasta there. But I swear I am - I can build a mean tasting pasta at home with some Ragu and store bought pasta with toppings lying around the house for half the price."
        }, 
        {
            "index": 209, 
            "rating": 5, 
            "review": "Love this place! I crave bottle service, mmmmmm. Great service, wonderful food and free tootsie pop on you way out, love it!"
        }, 
        {
            "index": 210, 
            "rating": 4, 
            "review": "Had the baked rigatoni which wasn't too bad. The chicken noodle sou was waaaay too salty though and couldn't eat it. But a cool place to eat and relax for about $10."
        }, 
        {
            "index": 211, 
            "rating": 5, 
            "review": "Super delicious Alfredo pasta!! A guy named Calvin served me my food, and he was really sweet and helpful (and not to mention cute!) I would definitely recommend this place to any one of my friends!!"
        }, 
        {
            "index": 212, 
            "rating": 4, 
            "review": "Several months ago, after our first visit to Mac Shack, I wasn't sure how to write a review. The food was OK, but I suspected some of the issues I had were more to do with me ordering poorly for my tastes as well as being the result of some miscommunications as a result of differing accents.\n\nWe've just returned from our third go at Mac Shack and I think I've got my order \"down\" enough to write a review and decide I really do like the place.  I think it's neat the way you can customise your own pasta dishes, as well as order from a set list of creations. It's sort of like Cold Stone Creamery meets The Olive Garden. The bread sticks are fresh and tasty and the restaurant is really low pressure without feeling like something you'd find in a food court.  Something else I appreciated greatly was the absence of loud, blasting music, that has become a fact of life in so many dining establishments - here it's pleasantly muted.\n\nOne think I feel could really improve the options here would be the ability to mix sauces. I like the roasted pepper sauce, particularly as I enjoy a creamy sauce, but it's a little bland and mixing it with a dash of the spicy read sauce would really make it a winner for me - alas, you can't mix sauces without paying the full price for a second sauce, even though you'd only be using half as much of each. This seems a bit silly to me.\n\nOverall, the food here is very good for the price. I love the casual atmosphere and the options. A little more ability to configure my dishes to my own taste would really make this a winner."
        }, 
        {
            "index": 213, 
            "rating": 5, 
            "review": "Veggie Mac is awesome! I wasn't a huge fan of the garlic bread but my son was ( he's 11). Lots of garlic in the veggie Mac. Loved it."
        }, 
        {
            "index": 214, 
            "rating": 5, 
            "review": "Mac Shack was voted Best of Las Vegas for meals under $10. This cleverly named restaurant serves not just macaroni, but other types of pasta as well. You can make your own pasta creation from the type of pasta, sauce, and toppings. There's also premade recipes to choose from, creating a variety of options.\n\nThere is even grilled cheese that has macaroni and cheese instead of your typical melted cheese. Add bacon or ham to switch it up. I've been here several times and have ordered a different entree each time. Each one was enjoyable and it is perfect for a quick lunch during lunch hour or order to go for the family after work. I recommend this place for it's delicious eats at reasonable prices! There's a reason why Mac Shack has been voted Best of Las Vegas!"
        }, 
        {
            "index": 215, 
            "rating": 3, 
            "review": "Due to the cashier missing my order & us not noticing until the food was delivered... We Split an order of broccoli chicken pesto penne and a side of artichokes. Everything was good. Best pesto I've ever had (I don't like pesto normally) chicken was moist and penne al dente. Artichokes were quite good I didn't notice, but my lunch date thought they were heavy on lemon. A bit expensive overall but we will try again on a Monday when meatless meals are 20% off."
        }, 
        {
            "index": 216, 
            "rating": 2, 
            "review": "Had two different kinds of Mac and cheese.  Over priced and expected much more from a place that specializes in it. Won't be going back"
        }, 
        {
            "index": 217, 
            "rating": 5, 
            "review": "YUMMY is all I have to say.  First time here and we will DEFINITELY be back  when we are on this side of town.\n\nCANNOT A WAIT to try a new flavor. \n\nI had the Spinach Asperges Mac and Cheese\n\nHubby had the Truffle and added steak \n\nOur 12 year old daughter the Philly.. With no peppers. .\n\nThe 1 and ONLY complaint was there wasn't enough meat on her M&C.. Maybe 4 or 5  little pieces \n\nThis place would do great in Eugene Or.\n\nStaff was helpful and nice"
        }, 
        {
            "index": 218, 
            "rating": 1, 
            "review": "I visit the Mac Shack on a regular basis as it is right around the corner for me.  As other reviews have stated, its solid as a \"Chipotle for Pasta\" type experience, but its nothing to write home about.  They do continue to stiff you on whatever protein you order with your pasta.  Don't expect any more than two pieces of chicken, shrimp, etc. when you order.  But those complaints have never been enough to keep me from going.  \n\nHere's what is...\n\nRobert, I don't know if you're the manager or owner or just a shift manager or something but your customer service is awful.  Awful enough to make me write a Yelp review.  You are aloof and rude every single time I've had the displeasure of dealing with you.  You have screwed up my order on three separate occasions.  I come in for to-go orders on a regular basis.  On one evening you stood next to the girl on the register while the line continued to build.  Having food management experience myself, I assumed you were training her.  But after a 15 minute wait, I finally got to the front of the line and it became clear that no, this was an experienced employee and you were just...well, what exactly WERE you doing?  You then decided to inform me that I \"should know better\" that I don't have to wait for to-go orders.  Here's an idea, get on the other register and get the line moving faster and it wouldn't have mattered.  Today, I came in around noon with no one in front of me, but I had to wait for you to finish your conversation with a staff member before I was greeted and allowed to place my order; an order that I discovered you ONCE AGAIN screwed up because you were clearly more interested in whatever your conversation was than giving me, the customer, your attention.  \n\nThe food and the environment were good enough, not great, but good enough to make me a regular in the past, but I think my days of visiting the Mac Shack are over thanks to one employee.  So thank you Robert.\n\nUpdate:  After writing the above review I was contact by both Robert and one of the owners.  They apologized for the poor service and expressed a desire to do better if I gave them another chance.  \n\nI appreciated their effort and their desire to make things right.  I do not know if I'll ever be in a mood to visit the Mac Shack again, but if I do and their service standards change, I will update the review again."
        }, 
        {
            "index": 219, 
            "rating": 4, 
            "review": "Great place to pick up dinner. Their macaroni and cheese is the best I've had.  I love adding in veggies to go with it. Meatless Monday is a good timeto go because you get a discount on orders with no meat. Their other pastas are great as well. Really love this place."
        }, 
        {
            "index": 220, 
            "rating": 5, 
            "review": "The best place for when you're craving pasta, it's customizable and very nice sized portions. Perfect for kids. So happy I discovered this place."
        }, 
        {
            "index": 221, 
            "rating": 5, 
            "review": "I came across Mac Shack this evening as I was being lazy on a Saturday evening and not wanting to cook or go out to eat so I searched yelp for delivery within 5 miles, \"open now\".  I filled out the info for them to deliver and realized they were about to close for the evening. I called them and they took my order for pickup, which wasn't exactly what I wanted, but it beat going out to eat.\n\nI ordered a custom pasta with whole wheat noodles, Alfredo sauce, broccoli, mushrooms, asparagus, jalapeños and sun dried tomatoes. I wanted a salad to go with it so the guy recommended a Green Machine side salad.  $12.97 including tax, not bad for a large custom pasta order + salad. \n\nI arrived a few minutes before they closed and forgot I had transferred my credit card to my gym bag, so all I had was a bunch of change at the bottom of my purse. Uh oh. I walked in and scraped together 1's and all of the coins in my purse and i had just enough!  Phew!  The guy was really nice and patient while I was annoyingly scraping up my change for him. Lol.  He was very nice. \n\nI brought my pasta home and opened my pasta...smells so good!  It was delicious!  The jalapeños were cut perfectly so even if I are one in a bite, it didn't overwhelm the flavors of everything else. It was great for the price, I have to say!  The Green Machine was different but WOW so delicious!!  The dressing is what really makes that salad pop. Loved it! \n\nGreat service, great food, amazing value. I'll be back very very soon. Glad I finally tried this place!"
        }, 
        {
            "index": 222, 
            "rating": 4, 
            "review": "Loved this place.  I ordered the Cheddar Mac.  It didn't look like much for almost $8, but it was a struggle to finish the whole bowl, as it was very filling.  It tasted great and they didn't try to do too much with it, like some pasta places do.  it's a very simple mac and cheese, the way i like it.  The service was quick and friendly and it was very clean and a nice environment.  I was very pleased."
        }, 
        {
            "index": 223, 
            "rating": 3, 
            "review": "I usually try to give places the benefit of the doubt with yelp ratings and try them anyways. The rating here is spot on. This review is based on the buffalo and philly mac. They weren't bad, but definitely weren't good either. Maybe some of their other selections may be a bit better."
        }, 
        {
            "index": 224, 
            "rating": 4, 
            "review": "1st timer and got the crazy alfredo-- delicious! Decently priced and easy to order. Clean & green atmosphere and definitely kid-friendly (kids get free lollipops if they finish their meals :)) Liked that kids eat here for free on Sundays."
        }, 
        {
            "index": 225, 
            "rating": 5, 
            "review": "We have been to the Mac Shack a couple of times now and really enjoy the restaurant.  The pasta dishes that we have ordered have been wonderful and fresh.  Now you can choose sizes either the normal or big size.  The bigger size is $3 more but it makes my husband happy since he has a big appetite. \n\nThe employees are very pleasant, helpful and knowledgeable.  They greet you as soon as you walk in the door with a smile."
        }, 
        {
            "index": 226, 
            "rating": 5, 
            "review": "I LOVE this place! The menu is very cool! You can pick from their specialty pasta dishes or create your own! I got Asiago Blue Mac which was a big bowl of asiago, pecorino, and blue cheeses with elbow macaroni. It was perfectly cooked and well balanced blend of cheese! I love how casual and easy the place is with great service as well. This is a great place for lunch, dinner, snack and families!"
        }, 
        {
            "index": 227, 
            "rating": 4, 
            "review": "I learned that a bowl of warm and gooey mac and cheese is just as satisfying as a bowl of chicken noodle soup on a cold day.  After playing in the snow on Mount Charleston, had the mac and cheese with hot dogs and potato chips crumbled on top.  Kids had regular mac and cheese.  It was a fine meal indeed.  Lots of other choices for a pasta-based meal so don't be tricked by the name of the place.  Will definitely return and try the other versions of mac and cheese...but only when it's cold.  I know, silly, but that's me."
        }, 
        {
            "index": 228, 
            "rating": 1, 
            "review": "not good at all! and expensive for a not good food. I wonder why they're still on business! I ordered mac and cheese and they charged me additional 1.50 for extra sauce.. why?? it's just a sauce and I don't even like it. my first time here and my last! don't come here there's other places to eat real good food! no star for me"
        }, 
        {
            "index": 229, 
            "rating": 4, 
            "review": "Quick, hearty meal full of carbs and protein!! Sometimes it's a good thing to indulge and this place is a great place for it with their custom orders!!"
        }, 
        {
            "index": 230, 
            "rating": 5, 
            "review": "The last couple of times I came here, my experiences progressively got better. Maybe they are getting better at what they do.\n\nLike many Las Vegans, I used my groupon. I actually had two. So, when I came in with my Mom, the cashier told me that I can't use two groupons for two people (per the fine print). BUT, he did say that if we ordered separately, then it would work.\n\nI love it when the staff is friendly enough to bend the policy to suit the customers needs without causing any harm to the venue. This is good customer service.\n\nI ordered the Pepper Jack Mac and it was divine. Mac and Cheese with PepperJack. Phenom. Also, topped off with FRESH (not canned) jalapenos. Also ordered the basic salad. Also fantastic.\n\nMy food came out rather quick. It was hot. Tasty. And everything I come to expect from the Mac Shack.\n\nOne thing I'd love to see (not a criticism) is \"dish of the month\" or newer pasta combinations. These can help inspire customers to create their own pastas from the menu.\n\nLast note for this trip. Bathrooms are ridiculous. And awesome. The hand-dryer is the Xclerator...you know...the one that blows air at jet speeds to the point where you see the skin on your hand fold up into little waves. Awesome sauce."
        }, 
        {
            "index": 231, 
            "rating": 3, 
            "review": "Nothing special. I have been here several times in hopes of it being better. Have had the steak Mac with balsamic, the pesto , jalapeno, and kids. Kids is the best. Chicken noodle soup is great. Maybe just not my thing."
        }, 
        {
            "index": 232, 
            "rating": 4, 
            "review": "a sister place to Noras. not as fancy, but the food is good. You can choose from different Pastas, and sauces and create  your own dish, or choose one of theirs. My favorite is the Crazy Alfredo. fettucine Alfredo piled with chicken, sausage,\njumbo shrimp, porcini mushrooms, domestic mushrooms, roasted bell peppers,\nsun-dried tomatoes and jalapeños!"
        }, 
        {
            "index": 233, 
            "rating": 5, 
            "review": "I wasn't really sure what to think when my bff Justin suggested we hit the Mac Shack after work. \nI made my way up to Durango and Warm Springs and sat in the parking lot waiting for him . Once he got there we both walked inside and I began to peruse the menu... \nWay to many choices for me ! lol I couldn't decide , did I want baked rigatoni? or the pepper jack mac and cheese? and then ... Shrimp Scampi linguine won out. \nJustin got the baked rigatoni.\nWe headed to the soft drink machine and I was totally excited that they had the super crushed ice. My favorite!\nOur meal came and I took a bite of the baked rigatoni .. Oh my gosh ... SO  good. Meat Sauce- Ricotta cheese ... mozzarella .. umm YUM!\nI have to say that I was totally happy with my decision. The shrimp scampi linguine , was delicious it wasn't over-sauced and the noodles were the perfect texture.\nI confess ... I ate it ALL I didn't even leave ONE bite. and did I share even one bite with justin.. yeah .. NO i didn't.\nWe have decided to make a standing Tuesday dinner date :) \nI say that works just fine for me!"
        }, 
        {
            "index": 234, 
            "rating": 5, 
            "review": "Probably the coolest restaurant I've ever been to. My wife always gets the chicken Alfredo which is divine. I always get spaghetti with spinach and meatballs. Delicious."
        }, 
        {
            "index": 235, 
            "rating": 3, 
            "review": "I wanted to be excited about this place. I had a crazy pasta craving and this was my solution. I'm hoping I just picked the wrong one because the smokehouse mac was underwhelming, but I loved the spinach salad and the cauliflower gratin. Not bad for a quick service spot, but for a place based on mac and cheese I expected more."
        }, 
        {
            "index": 236, 
            "rating": 4, 
            "review": "I usually get the \"create your own\" because I'm a control freak! I usually get rigatoni with the roasted pepper sauce and some veggies. The portion size is perfect if you're really hungry and enough to take some with you for the next day if you're not. Kids eat free on Sundays and wine is half off on Wednesdays. They need to put those two together to make a perfect family dinner!"
        }, 
        {
            "index": 237, 
            "rating": 2, 
            "review": "Am I missing something here?? Some pretty positive reviews for this place but it's average at best. For a place that specializes in pasta, you'd expect that to be top notch. I gave it a try since I pass by it everyday. Got an order of the red rigatoni and a baked ziti. The pasta for both dishes were overcooked and the sauce was nothing special. The baked ziti had globs of ricotta so if you weren't careful you'd get a mouthful of it. I seriously can get better sauce from a jar. I know a lot of folks have commented on the picking your ingredients part. Well that's available elsewhere too. It's called grocery shopping people. You could make better stuff at home.  If my kitchen burned down and I really wanted some pasta maybe I would stop by just because it's close to my house. Even then I would still prefer Buca di Beppo or even Olive Garden."
        }, 
        {
            "index": 238, 
            "rating": 3, 
            "review": "Love the MacShack. The have wheat and gluten free pasta as well. Yum yum yum"
        }, 
        {
            "index": 239, 
            "rating": 5, 
            "review": "LOVED IT!!! \n\nI had whole wheat penne pasta with garlic and oil, roasted red peppers and mushrooms. DELISH!!!  Portion was so big I had to take some home. Music playing in the background was \"Bye Bye Miss American Pie\". I loved that I had to choice to get any pasta, any sauce and any ingredients from lists.  They also had huge bowls of salads like Greek, spinach, chef.  There were examples in the bowls shown at the cash register.  The presentation on the salads is beautiful.  \n\nThe menu has something for adults and kids and some gluten free items too.  Take the family and enjoy grilled macaroni and cheese sandwiches."
        }, 
        {
            "index": 240, 
            "rating": 3, 
            "review": "My husband and I are new to the area and are busy trying local places.  We 1st visited The Mac Shack a few weeks ago and it was an amazing experience for us. I ordered the shrimp scampi which I felt was perfect.  The portion and flavors matched in every way.  I was told by the cashier that they delivered too, which was great for me since I am limited physically, and driving is difficult for me right now.  I was very disappointed when I called to order lunch one day and the woman on the phone was very \"Matter of fact\" when she said we will not deliver to you because you are 1 block over the 3 mile delivery area.  1 block??? My husband took me again a week ago and I ordered the same thing..The shrimp scampe.  This time there was less shrimp, it was way watered down and the lemon garlic flavor just wasnt there.  It may have been just a different cook??? I advised that anyone just over the 3 miles, offer to charge a delivery fee, like maybe two dollars for the extra block... I would pay it to get a meal.  The gentleman just said he would mention it to management. My husband and I will go there again, hoping the 3rd visit will be better for me than the last one. I already put a great review on their facebook page."
        }, 
        {
            "index": 241, 
            "rating": 5, 
            "review": "Variety of pastas with different combinations. Highly recommend this place to anyone who is a pasta lover. Great customer service. Clean and relax environment. Wish I had a closer location to my house."
        }, 
        {
            "index": 242, 
            "rating": 3, 
            "review": "The food is a bit expensive for strip mall pasta food, but it is restaurant quality food cooked with a wide variety of ingredients that you get to select yourself! The portions provided from this restaurant are good enough for a meal. And I have to say, no matter what odd combinations I found myself coming up with on my visits to this place, they would find a good way of cooking it up and making it taste great!\n\nAdditionally for those who have Caeliac disease they provide gluten-free pasta as well for not additional charge, and my friend said their glutenless pasta was great.\n\nOverall, it's an interesting concept, but not one I could find myself driving out of the way for often. But if you're in the neighborhood and in the mood for pasta, it is a great treat."
        }, 
        {
            "index": 243, 
            "rating": 1, 
            "review": "I want to give this place a higher rating but can't due to the customer service of their General Manager Robert Rust. \n\nI wanted to use the Yelp check-in special, as I am pulling it up on my phone I order my 2 main meals. Still trying to pull it up on my phone, Robert the GM just stands and stares at me. A pop up said yelp couldn't be loaded and to try again later. I handed my phone to him and asked if I can still get the drink even though yelp was down and couldn't check in. He said no, he needed to see that I checked in. Okay whatever, a drink costs 2 bucks. I will pay for the drink. Good customer service especially coming from a General Manager should of just honored it. My total was about 20 bucks, paid him the money, sat down and waited for my order. Both dishes came cold. I went back up to tell him and he asks for my receipt so he can give me my money back. I told him that he didn't give me a receipt. He says he can't give me my money back without one. Hello I was just up there 5 minutes ago why can't you give me my money back? He finally gives in and gives me 6 dollars back!!!!!!! 6 dollars???!!!!  I told him each one of my dishes were 7 dollars. He says yes, but I gave you a 20% discount for meatless Monday. Um ok that still doesn't equal 6 dollars. After I explain this to him he tells me \"oh well you don't have your receipt to prove how much you paid for anything.\"\n\nWhat a joke. How is this guy a General Manager???  I was so mad I left without getting my money back. I will not be back here until he is gone. If you do go, check out his name badge. His name is written out with a sharpie marker and General Manager is spelled wrong. LOL glad to see how important he is."
        }, 
        {
            "index": 244, 
            "rating": 4, 
            "review": "You gotta love Mac Shack! There's quite a bit of selection and variation on the menu. Truffle Mac is just decadent. Bottle Service is a must. Always terrific service and a solid loyalty program. Average dining atmosphere but you can dine outside when it's not trip-dig."
        }, 
        {
            "index": 245, 
            "rating": 2, 
            "review": "Everything on the menu looked so good but were disappointing. everything was very bland and didn't quite turn out how we expected it to. \n\nSides that were tried:\n\nCauliflower grati: kinda mushy and couldn't really taste the cheese in the sauce. \n\ngnocchi: Sauce chosen to go with this was the broccoli pesto. I wanted to try something different and have never had a broccoli pesto before. I didn't like it. It as blank the gnocchi was over cooke because again it was mushy. Might have been pre-prepared because the tops of the dumplings were dry. \n\nPasta dishes that we ordered:\nbroccoli pesto: bland and not satisfying. Had to add salt and some other ingredients to make it through the meal \n\nfarm house\n\nthe bottle service pasta: probably the best one that we tried out of the three. Still bland and not quite as flavorful as described in their description. \n\nYou go in your order they give you a number and the food is  brought to you. \n\na great idea but needs work in the flavor department. Checked in on yelp and got a coupon for free breadsticks. Those also were not amazing. Olive garden beats their breadsticks."
        }, 
        {
            "index": 246, 
            "rating": 3, 
            "review": "Cool vibe, cool idea, cool bowls... But just not as good as I had hoped. After trying a wide variety of the pasta bowls, I'm just not impressed. Worth a trip but nothing is flavor filled."
        }, 
        {
            "index": 247, 
            "rating": 2, 
            "review": "Friends recommended this place so I though I'd check it out. I ordered the Smokehouse Mac, because who doesn't love bacon and smoked gouda? My girlfriend ordered rigatoni with meat sauce and ricotta. I also ordered a side Caesar and garlic bread.\n\nThe salads didn't find their way to our table until a few minutes after our pasta. They had a strong fishy flavor and lacked the salty garlic taste I expect in a Caesar salad. The mac and cheese had a strange sweetness to it, possibly from the barbecue sauce they put in it. If you order this dish ask them to leave it out. Better yet, don't order it. There was very little smoky flavor other than in the bacon itself. Some red pepper flake (in a shaker on the table) helped a bit, but I didn't finish more than a few bites.\n\nThe rigatoni was OK but the meat sauce was a bit short on meat. And again, basic seasoning was lacking.\n\nWhat they call garlic bread is actually breadsticks. Honestly, Olive Garden does them better. I get an order free on my next visit thanks to my Yelp check-in, but I don't think there will be a next visit."
        }, 
        {
            "index": 248, 
            "rating": 3, 
            "review": "Since I'm lactose intolerant, I had to avoid the Mac N Cheese. but I was pleasantly surprised to find a few healthy options.  Mac Shack has three salads and two soups to choose from and a build your own pasta option that all combine to meet the demands of even the pickiest of eaters.\n\nI opted for the Spinach Salad that comes with walnuts, thinly sliced red onions and pears, not the greatest for your breath but certainly the right blend of crisp and crunchy.  It even comes with a mini-muffin that was both soft and buttery.  As for my pasta I went with the Red Rigatoni that was topped off with meatballs, sausage, and roasted red peppers.  I did enjoy the meatballs and sausage where were more than I expected with such an affordable dish.  \n\nThis is a great place if you have a hankering for some quick pasta and maybe a salad but are crunched for time.  The service was friendly and attentive and the food came out fast and tasty.  I'll give it three stars for you can enjoy yourself and even add a glass of wine with fast food Italian, but it certainly isn't the place to go if you're seeking a gourmet Italian experience."
        }, 
        {
            "index": 249, 
            "rating": 4, 
            "review": "I really like the Mac Shak's wagon wheel and fettuccini dish. So delicious. And you can add whatever add-ins you want. Kids eat free on Sundays. Their tomato soup is very good. We enjoy their lunch specials too.  I didn't give them 5 stars because it did take me a little while to find what I really liked. A few times I didn't particularly like my dish ( I think it was regular macaroni and a plain cheese sauce). But some pastas and sauces are better than others so you have to find the one that is right for you :)"
        }, 
        {
            "index": 250, 
            "rating": 3, 
            "review": "I have been coming to Mac shack since its opening.   It was one of my favorite places. \n\nNot sure if they changed management or ownership but the last few months it has really been disappointing. \n\nI was a huge fan of their vodka sauce. Well it does not taste the same. It appears they changed their product.  \n\nI also don't like how there portions are inconsistent. One day it's a lot of pasta and on other days its a small portion. \n\nI hope they change it back to the place I once loved."
        }, 
        {
            "index": 251, 
            "rating": 2, 
            "review": "Such a shame that the apparent lead cook acts like such a dick. He was complaining in Spanish to the cashier that I a) added on to the original order and b) used a Groupon then called me a fat cow to her. Let's see if the food is worth it."
        }, 
        {
            "index": 252, 
            "rating": 3, 
            "review": "I won't lie... I did go in with high expectations, so that might be why this place is only resulting in a three star rating for me, but I just wasn't wow-ed.  I LOVE mac n' cheese...it's basically a passion of mine.  I will say I loved all the different options and flavors they offer!  Definitely some interesting mac n' cheese concoctions.  A friend and I were so fired up that we decided to get four different options and then taste test from them all.  We got the truffle mac, the smokehouse mac, the spinach artichoke mac, and we created our own pasta that was a penne pesto with mozzarella.  Of all of the options, the truffle mac was the only one that I'd really kill for.  But, I am biased because I am a FIEND for anything truffle!  Otherwise, all the others were \"eh.\"  I don't know if my expectations killed the dream, but I just wasn't amazed.  \n\nThey do sell beer and wine which is nice!  AND, they DELIVER.  Which is definitely nice to know.  If I'm ever sitting home and don't feel like throwing together some mac n' cheese it's a great option.  I just don't know if I'll be dying to go back unless I'm really, really, really craving some mac n' cheese."
        }, 
        {
            "index": 253, 
            "rating": 3, 
            "review": "They advertise \"kids eat free\" on Sundays which is a lie. They take $4.50 off per kid but the cheapest meal for kids is $4.95. I am not really hung up on the $1.45 I spent for my kids to eat (they only drank water so drinks aren't a consideration, but they were supposedly included anyway.  I just dislike dishonesty. \n\nAside from that, the food was good and the kids enjoyed it. I had crazy Alfredo which was fantastic.  The garlic bread was, to me, cold and undercooked."
        }, 
        {
            "index": 254, 
            "rating": 5, 
            "review": "Let me just talk to you about the day dreams I have had about this joint ever since my first visit (just yesterday). \n\nIf you are interested in fresh ingredients (of your choosing), delicious flavor AND the benefits of eating off of echo friendly plateware..TRY THE MAC SHACK! \n\nIt's a little out of the way but definitely worth the drive. From fresh veggies, to homemade sauces, the Mac Shack has taken the \"create your own entree\" to a whole new level. \n\nI created a traditional \"Kim\" style pasta dish with the following ingredients: \n\nChicken, vodka sauce, mozzarella and ricotta cheese, rigatoni pasta, and..oooh I don't know sheer deliciousness! \n\nTRY IT, and if it sucks (in your opinion) you've created your own dish and it's all your fault for improper use of ingredient combinations ;)"
        }, 
        {
            "index": 255, 
            "rating": 4, 
            "review": "This is my favorite spot!! Of all time! Although there is only ONE Mac shack all over las vegas, I'm glad that if is located near me. I came in with the family ad everything was perfect. Timmy the server was very helpful and patient with our indecisiveness and he helped us find a choice. He was also very funny and helped my mom come up with a choice (in the end she went with the kids meal which was the mac and meatball even though she cooked us spaghetti the night before) I would suggest the shrimp scampi which is my favorite! Enough shrimp and just right scamp in scampi! If you love cheese try the asiago blue Mac. It's loaded with cheese! It has asiago blue cheese, Romano, and blue cheese crumbles on top. I had it with chicken which Balances the meal with the cheeses. It's not too tangy or thick in texture to make you feel easily filled. I had that smokehouse BBQ one also and the pesto one. Those are just as good too! Definitely have to try the BBQ at least once. It's life changing.\n\nThe decor is fabulous and especially since they feature Peter lik artwork! So the artwork changes it's time of day depending on the lighting!!! Free wifi and a wide wide wide selection in soda and tea! Score! I love soda selections! It's the best thing to have choices so you can experiment with combinations!!!! Then then then! To top it all off...you leave and see this beautiful wooden box filled with flavorful tootsie pops to go! (that you angels from above!!!!) best meal of my life and left me feeling good about my meal. Life changing I tell you.\n\nDo check in to get the garlic bread and drink. It's worth it!!!!"
        }, 
        {
            "index": 256, 
            "rating": 5, 
            "review": "The food was different but tasty. The staff were inviting and accommodating. Overall a good experience and I wouldn't mind returning in the future."
        }, 
        {
            "index": 257, 
            "rating": 5, 
            "review": "Mac shack is a great spot ! Went there last week and the food was incredible. I am health conscious about my my pasta intake but here they cater to the option of gluten free meals, and all fresh ingredients that you can see them prepare. It's perfect for the picky eaters because you have your choice of any pasta, sauce, and ingredient. Its priced accordingly and I highly recommend it! Love me some Mac shack!!!"
        }, 
        {
            "index": 258, 
            "rating": 2, 
            "review": "The food is ok and it feels more like cafeteria food.  To make it worst the food did not go well with my stomach, at all!!"
        }, 
        {
            "index": 259, 
            "rating": 4, 
            "review": "If you like italian food and fast service this is the place to go! Pasta comes out in 5 minutes and is very good."
        }, 
        {
            "index": 260, 
            "rating": 5, 
            "review": "Must try!!!! The crazy Alfredo is my all time favorite and the customer service is AMAZING!!!! Their pasta servings are enough for two people. Their store is very clean, very fast service, and the cashiers are always very helpful! Don't forget to try their cannoli and dip for dessert, seriously so tasty. They also sell cupcakes from the cupcakery."
        }, 
        {
            "index": 261, 
            "rating": 4, 
            "review": "Stopped in for lunch and ordered up the Philly pasta.  There were no problems using the Yelp coupon when I checked in.  The chow was tasty and the portion just enough that I left neither stuffed nor hungry."
        }, 
        {
            "index": 262, 
            "rating": 3, 
            "review": "Oh how I wanted to love you Mac Shack. My fiancé loved the food but it was just okay in my book. The service was super friendly but I was wanting more from the food. \n\nI ordered the chicken noodle soup and spinach artichoke Mac. The chicken noodle soup was pretty plain. Not a lot of chicken, noodles or vegetables. More broth than anything. The spinach artichoke Mac was okay. Nothing special but there wasn't a single artichoke on my plate. Trust me I looked real hard for one but there was nothing. Not sure if they forgot it or what but I noticed also that in my fiancé's taco Mac that they skimped on the amount ground beef on the plate as well. \n\nOverall, I'd say great service and mediocre food."
        }, 
        {
            "index": 263, 
            "rating": 5, 
            "review": "One of our favorite quick eats. Especially for pasta! Everything is prepared fresh and made to order. Inspired by Nora's cuisine this place will not disappoint. They also have great lunch specials mon-fri \n11am-3pm. Oh and be sure to grab a cupcake!"
        }, 
        {
            "index": 264, 
            "rating": 5, 
            "review": "Absolutely love this place! Best lunch special ever--- pasta, salad or soup, breadstick, and drink for like $8. Try the baked rigatoni it's awesome"
        }, 
        {
            "index": 265, 
            "rating": 2, 
            "review": "I was dissapointed in my experience at this eatery. I went in ordered my pasta with a friend and sat down. A couple minutes had gone by and my friend got her meal.. it wasnt until i had complained twice and my friend was almost half done that i recieved mine. When i got it the sauce was starting to harden and it was a bit cold.When I complained the staff was rude in explaining it got to me as fast as it could.  I didnt end up eating it but my friend claimed her pasta was amazing... she can go back there alone for more! ha"
        }, 
        {
            "index": 266, 
            "rating": 4, 
            "review": "This place is great. It's simple, yet satisfying. My favorite sauce is the Alfredo sauce, with its perfect taste. It's affordable, prices start at 7.99 and 9.99 for a little more. My daughter loves the mac and cheese for kids and my son (very picky eater) fell in love with the mushroom soup. I always order pick up, so I get to interact with the staff and are always friendly."
        }, 
        {
            "index": 267, 
            "rating": 2, 
            "review": "Good idea, poor execution. Everything on the menu sounded great, but my smile turned into a frown as soon as my dish came out. Portion was waaaaay smaller than what I thought it'd be, considering I paid $9 for noodles and vegetables only. Then I thought fine, maybe they'd make it up in tasty goodness. Not so much. The angel hair was super greasy and not in a good way (I had an italian roommate so I  understand yummy grease). Furthermore, ingredient flavors did not mesh well (this was their own recommended creation, I didn't pick the ingredients). I ate less than half and went home still hungry. I really tried to like this place, but was disappointed overall. The food wasn't horrible, but I very much doubt I'll go back."
        }, 
        {
            "index": 268, 
            "rating": 3, 
            "review": "Let me start by saying it is a good concept. The overall options are limited, however by making custom dishes from the ingredients listed you can come up with your own favorite. The dining area is simple but comfortable. Prices are fair to expensive depending on how you order. Maybe not quite up to the hype, but a good casual dining choice anyway."
        }, 
        {
            "index": 269, 
            "rating": 3, 
            "review": "So we set out for a quick meal, as a family, Sunday night.  We had seen the place and never stoped.  What better place than a restaurant based around the almighty mac and cheese.\n\nMy wife had the pepper jack mac which was amazing.  We shared an order of meatballs with red pepper sauce, it was ok. My daughter had the bow tie pasta with tomato sauce which she ate all of it. ( now that is amazing)\n\nHere is why they recived three stars and not higher.  I ordered the angle hair with garlic oil, roasted tomatoes, bacon and basil.  It was delish.  UNTIL i saw the piece of hair in my bowl.  This was just disgusting and made me not eat all my food.\n\nThe restaurant was clean and this mishap may not make me stay away, but it will be a minute before I return."
        }, 
        {
            "index": 270, 
            "rating": 2, 
            "review": "Mac Shack isn't a computer store, it's a cafeteria-style restaurant that serves pasta dishes and soups. I had the \"Philly Cheese Steak Mac\" ($10/$13) and pureed corn chowder ($4). Total bill came to $40 for two large pasta dishes, two soups, and two large soft drinks. The soup was out of this world, maybe consider serving this or other soups cold (as I write this it's 110 F degrees in Las Vegas). The mac and cheese was well seasoned, the amount of beef was underwhelming. \n\nAlthough the atmosphere is light and airy, we were beset by houseflies, having to swat them away the entire time. I've lived in Las Vegas for three years and I've never seen a housefly here, anywhere. I swear this place had flies like the outhouse at Grandpa's farm. What this tells me is that 1) there is a sourcepile of nourishment for them that 2) doesn't get cleaned up. According to the signage your restaurant is sustainable! natural! etc. etc. so maybe a couple of Venus fly trap plants would be in order."
        }, 
        {
            "index": 271, 
            "rating": 3, 
            "review": "Came here for dinner for the first time with 2 friends. Cashier was funny and sweet. I was told to get the $7.95 create your own pasta. I added 3 items, garlic bread and a drink and my bill went to $20! I paid and ate the food. Although the food was good, I was amazed at the price jump. You are better off sticking with their specialty dishes that are priced or else you'll pay and arm and a leg for pasta! Also there is 1 bathroom for men and 1 for women with no additional stalls which bites as I had to wait almost 10 minutes to use. Id definitely like to give the place another shot and will post and updated review soon."
        }, 
        {
            "index": 272, 
            "rating": 4, 
            "review": "I must say this place was very good. Just heard about it from my sister in law last nite and me n my husband were very intrigued to try it!!! I will definately come back!!! My kids loved it!!!"
        }, 
        {
            "index": 273, 
            "rating": 1, 
            "review": "Not really all that it's cack up to be....\n\nI created my own pasta...the noodles tasted nasty! At first, I has a hard time trying to pin point what it tasted like then it dawned on me it tasted like noodles from chicken noodle soup! The meat sauce wasn't that great either...no flavor at all.\n\nI would suggest eating at Olive Garden or Macaroni Grill..."
        }, 
        {
            "index": 274, 
            "rating": 5, 
            "review": "Oh how I love Mac Shack, let me count the ways.  Clean restaurant, friendly staff, and wonderfully yummy pasta dishes.\n\nLast week I wasn't feeling well, and needed some delicious, comforting food in my belly.  Of course, Mac Shack popped in my head.  It's somewhat-on-the-way-home from work, so I decided to do takeout for the first time.  Still just as scrumptious as if they had plated it in the restaurant.  And quick, too!  \n\nThe only reason I don't eat here more often is the price.  I always order a special menu item (Smokehouse BBQ mac, mmmmm), but still: 13 dollars for mac and cheese?  Using Groupon or the Yelp discount helps me feel like I got a better value, though. \n\nI also love that Mac Shack sells alcohol, and has recently added specialty cupcakes to their menu (from a 3rd party bakery).  Plus, I always choose from the Tootsie Pop wall on my way out the door.  Thank you!"
        }, 
        {
            "index": 275, 
            "rating": 4, 
            "review": "We ate here for the first time with our two daughters who are 2 and 9.  Great food for everyone, even the kiddos!  Found out that they also offer \"kids eat free\" on Sundays, so we will definately be headed to the \"Shack\" again soon!!  I felt that the prices were reasonable for the portion sizes.  Definately a better option than fast food if you aren't looking to spend $50 for a meal.  Our total was $30 for 4 meals and 4 drinks, not bad and about the same price as Schlotzsky's, Jersey Mikes, Rubios, Smash Burger or Baja Fresh- which are all better than \"standard\" fast food joints.  Give this place a try, they were fast, fresh, friendly and good!"
        }, 
        {
            "index": 276, 
            "rating": 3, 
            "review": "Not the best pasta ever but a great quick place to get your pasta fix and build to your exact tastes... you can pick one of their creations or build your own.  I've tried both and have been pleased with almost everything.  Only thing I didn't like was when oli ordered shrimp... it was really salty, and just tasted off :-/  but... i loved their baked rigatoni and their Alfredo was pretty tasty too. My favorite is adding ricotta cheese to anything. .. they throw huge scoops right on top, yum! I have yet to try a mac and cheese but that will be next."
        }, 
        {
            "index": 277, 
            "rating": 5, 
            "review": "This place is really good. I'm not a big pasta person but this place allows you to create your own ( genius). Staff is friendly and the owner frank is always working and  greeting customers. It's quick, cheap and totally worth it."
        }, 
        {
            "index": 278, 
            "rating": 1, 
            "review": "Ordered pasta with white sauce. Sauce was mediocre and the pasta has already been forgotten or simply blocked out of memory like a traumatic experience. Two of the diners in our party became sick as a result of the red sauce they consumed with their meals. One diner actually vomited in the parking lot immediately after walking out and the other later on that day; both as a result of the red sauce most likely tainted by cross contamination or an expired batch."
        }, 
        {
            "index": 279, 
            "rating": 2, 
            "review": "Poor customer service. I paid for my to-go order, tipped the man at the register, and then I said 'thank you. His reply: 'no problem'. Of course it wasn't a problem! I paid you AND tipped you to place one Chicken Alfredo order... can I get a small 'thank you'? No one smiled and the man who handed me my order was stone-faced. I said, 'thank you' as he handed me my bag... no response. \n\nThe Chicken Alfredo was fair at best. It contained four very dry pieces of chicken and 3 small pieces of broccoli... for which I paid extra. The noodles were good and the flavor decent but overall... not impressed. \n\nSkinny Fats and Roberto's are in the same plaza... the food is better and employees muuuuch nicer!"
        }, 
        {
            "index": 280, 
            "rating": 4, 
            "review": "First time was here was very pleasant. The woman that greeted me and took my order was friendly and extremely helpful.(this was my first time here). I created two pasta dishes and they were very good. Food came out quickly and it was a very good portion size. I realized I didn't want to cook the next day so I ordered another dish to go. Overall it was a good experience. This isn't amazing Italian food but it is quite tasty. Just add a little salt and pepper and your good to go."
        }, 
        {
            "index": 281, 
            "rating": 3, 
            "review": "I've heard such great things about this place, so I was excited to try it out for myself. I ordered the Philly Mac and it was just okay. Nothing special about it that I'd remember or crave for after this visit. Service was great and dining area was very clean! Maybe ill try something different next time."
        }, 
        {
            "index": 282, 
            "rating": 2, 
            "review": "ive been here a few times. every time ive tried something different and always seems to be a bit salty. the last time i was there, they seemed to have mistaken me ordering capers instead of basil and got home to a nasty surprise. and they put a tone of those nasty little things in my pasta and really ruined it for me."
        }, 
        {
            "index": 283, 
            "rating": 4, 
            "review": "Went here for lunch today. I had the the blue cheese mac with chicken and eggplant and a large drink. It was $12 for mine, and it was excellent quality and a decent size. \n\nMy friend enjoyed the Farm, and he mentioned the peas were really tasty.\n\nEverything was clean, and some rockin' 60's music gave it a comfortable atmosphere. They even have rice pasta, for the gluten challenged Yelpers.\n\nThey had lots of add-ins, and I think that if you get the \"pre-mades\", you're slacking in your creativity. The real genius of this place is using a comfort dish while allowing you to be adventurous, with their wide selection of  pastas, cheese and ingredients. \n\nAlso, they have wine and beer."
        }, 
        {
            "index": 284, 
            "rating": 4, 
            "review": "The food was good, but inconsistent.  I ordered and dined in, but also took an order to go.  I don't know if they were cooked by different people, but they were prepared with a hugely different amount of ingredients.  It has been several months since my last visit, but I am almost sure the price went up and that they used to include a bread stick.  \n\nThe staff was very friendly and the facility clean."
        }, 
        {
            "index": 285, 
            "rating": 4, 
            "review": "We got a rigatoni bolegnase and taco Mac.   The rigatoni was okay.  There was nothing wrong with it but it just wasn't that good.    The taco one was delicious! Me and my husband finshed it off easily!    It really tasted like a taco."
        }, 
        {
            "index": 286, 
            "rating": 2, 
            "review": "Had been wanting to go here with my wife for a while . The price for the food wasn't bad but it came out cold and not fresh at all . I would not recommend it to anyone ."
        }, 
        {
            "index": 287, 
            "rating": 2, 
            "review": "4th time in a row that they screwed up the order. Waited 20 min for them to figure it out and get our food!"
        }, 
        {
            "index": 288, 
            "rating": 4, 
            "review": "Great pasta bar... I hope they open some more locations... like in Summerlin (hint hint)...  Their proteins are a little bland, to be honest.  Their italian sausage is not very good.  The chicken and meatballs are just so-so.  But their sauces and pastas are really tasty.  If they can get some better meats, this place will go viral."
        }, 
        {
            "index": 289, 
            "rating": 1, 
            "review": "All I can say is their food is just MeH.. I had bowtie pasta with pesto and garlic. 1 star because I like pesto. Other than that, nothing too special."
        }, 
        {
            "index": 290, 
            "rating": 5, 
            "review": "Mac Shack  you are great\nAlways my hangover cure\nAnd gluten-free? Yes!\n\nThat was my fantastic haiku.  Thank you, thank you, I'll be here all night.  Don't forget to tip your server.  \n\nOkay now seriously.  Mac Shack is amazing.  I love that you can pretty much come up with your own concoctions.  I also love that they offer gluten-free pasta (as mentioned earlier).  One favorite is the cheddar mac with tomato and bacon.  Comfort food to the max. \n  \nOh, and their vodka sauce is one of the best I've ever had!"
        }, 
        {
            "index": 291, 
            "rating": 4, 
            "review": "I came in for lunch last week and a young lady by the name of Melissa was very helpful. It was my first time there and she made me feel very welcomed and even sugested some great items. The crazy alfredo was so delicious. Definitely recommend it!"
        }, 
        {
            "index": 292, 
            "rating": 4, 
            "review": "They have totally corrected the problem with the orders not coming out right!  They are getting it right and we love coming here.  It's quick, tasty, and kids eat free on Sunday :)"
        }, 
        {
            "index": 293, 
            "rating": 3, 
            "review": "Mac Shack is quick and delish - however, it is a little pricey for what you get. I recently had the farro with pesto and mozzarella, which was very satisfying. \n\nI would probably eat there more often if there were better deals or prices."
        }, 
        {
            "index": 294, 
            "rating": 5, 
            "review": "This place rocks. I was a bit apprehensive about coming here. Many places say they have gluten free choices, but when you're actually at the restaurant many servers and employees look at you like you're speaking another language. I was so relieved when coming to the Mac Shack. The manager, Robert, was so knowledgeable about food allergies/sensitivities that I was able to enjoy my food without worrying about having a reaction. \n\nThis restaurant is pretty big and has a open feel. It felt like I was getting a gourmet meal without having to get dolled up, parking etc. Place your order at the counter and they bring it out to you. Perfect. Done. You choose your pasta, sauce and toppings. All orders are cooked to order, which helps decrease the chances of cross contamination. They also have salads and their own creations available. \n\nI ordered the gluten free pasta with garlic-oil sauce, sun-dried tomatoes, porcini mushrooms and cheese. It was heaven and a great combination. Pasta was cooked perfectly, which is an art with gluten free pasta. My friends tasted it and they loved my combination and said they would have never known it was gluten free pasta. In fact, they had to help me finish my food because the portion was fairly large for me. They did not hesitate. \n\nOne of my friends had the asiago mac n cheese and the other made her own combination w/meatballs. They both loved their dishes too. \n\nThis is now one of my favorite restaurants off of the strip and will return when loading up on carbs for the Vegas 1/2 in December."
        }, 
        {
            "index": 295, 
            "rating": 3, 
            "review": "Finally tried Mac Shack which is perfectly located in my neighborhood.  I liked the food in a lazy day, let's just create our own pasta and dictate to Mac Shack way!\n\nOur creation was spaghetti with meatballs, fra diavolo sauce, zucchini, portobello mushrooms and extra garlic! Viola! \n\nThe only thing that I didn't like is one of the staff that packed up the food into the bags. He was very slow and kept mixing the orders with another order into different bags."
        }, 
        {
            "index": 296, 
            "rating": 4, 
            "review": "Super patient staff with not knowing what I wanted to order. Not the greatest seating area though. Amazing food too."
        }, 
        {
            "index": 297, 
            "rating": 5, 
            "review": "This place is excellent! Exactly what I was looking for and awesome customer service!!!"
        }, 
        {
            "index": 298, 
            "rating": 3, 
            "review": "Cool concept I agree with a lot of the people that were complaining about the lack of flavor."
        }, 
        {
            "index": 299, 
            "rating": 4, 
            "review": "I feel my review of the Mac Shack has taken far too long.  Luckily, I was fortunate to experience the wonder of the shack!  I agree 100% with Misti that from the moment you walk inside you think to yourself: Chipotle.\n\nThe Shack is nothing like a shack.  It's presented clean, neat, well organized, and simple.  You have a plethora of menu items including the do-it yourself Pasta section.  There is wine and beer available and veggie options as well as sirloin, shrimp, bacon, ham, and more cheese!  I found myself in love with all the menu choices.\n\nI chose the PepperJack Mac and my date selected the Blue Cheese Mac.  When the entrees were brought to the table they were switched around and tasted a little off.  After one bite we knew we would be sending them back.  Adam, the Mac Shack server/buser was very kind and quickly had are orders redone and made correctly.  I will never downgrade a rating for making a wrong order; we're all human.  It's what the restaurant does after that tells me if they care. \n\nAdam brought our new orders of Mac and they tasted delicious.  I'm a fan of Mac Shack and plan on a return visit very soon.  Thanks again Adam!"
        }, 
        {
            "index": 300, 
            "rating": 4, 
            "review": "Really loved the build your own option.  G.reat casual place.  Oh, and the best part - you can take a Tootsie Pop with you when you leave."
        }, 
        {
            "index": 301, 
            "rating": 3, 
            "review": "So I just tried this place because I figured it was only a matter of time.  I created a pasta primavera of my own with whole wheat pasta, tomato sauce and various veggies. \n\nThe good thing was there were tons of fresh veggies, proteins, pasta and cheeses to choose from.\n\nIt's almost as if you're in a buffet line with all macaroni except there isn't a little kid in front of you that wipes his nose and innocently handpicks his favorite french fry *germaphobe\n\nThe only thing I didn't like was that I specifically asked for no cheese and when I got home I found Parmesan sprinkled all over my pasta\n\nI agree with the \"nothing to write home about\" comment: however, I do give them an A for an innovative concept.\n\nI imagine for the cheese lovers, you can get your fix here!"
        }, 
        {
            "index": 302, 
            "rating": 1, 
            "review": "The place looks clean and well organized. It is fast food mac and cheese that you can see them creating the dish. They have some really exciting choices on the menu, but unfortunately the execution is poor. Let's just say that three of us ate there and the food went down easily and came out easily, less than 2 hours later and had us curled up in a little ball until the next morning. I won't be going back to Mac Shack, ever."
        }, 
        {
            "index": 303, 
            "rating": 5, 
            "review": "I love Mac Shack! Although it's a bit pricey, I love that they have so many choices of toppings, sauces, and noodles!\n\nThe portions are hefty, whether you're building your own, or one of their specials. They don't skimp on the toppings, which is nice.\n\nThe service is always quick, and everyone is friendly. I love this place!"
        }, 
        {
            "index": 304, 
            "rating": 3, 
            "review": "I give 3 stars  because I'm a huge mac n cheese fan and the dish I had,  which was  the asiago blue mac, taste okay and wasn't what I'd expected, considering the name of the place. But it's just another restaurant, don't expect it to compare to good ole mom's mac n cheese"
        }, 
        {
            "index": 305, 
            "rating": 5, 
            "review": "I am sooooooo happy ... For the first time in w long time ... You see yo me.. Mac shack is a hit or miss .. So that's why I don't give up on them. And then THIS ... This lovely truffle Mac. I had it before .... Never was it THIS good. Thanks to Angel she made sure I got it EXACTLY how it's suppose to be. I added chicken  ((let me tell you is delish ))  all in all this is my NEW favorite dish .... And you guys need to have more employees like the staff tonight. The restaurant was clean and Angel was VERY informative and patient. ((I was asking dumb questions lol)) anyway we WILL return"
        }, 
        {
            "index": 306, 
            "rating": 3, 
            "review": "On my last visit I was somewhat disappointed - the flavor was lacking...\n \nThe Mac N Cheese was still cheesy good but the Angel Hair pasta with veggies and pesto sauce was lacking flavor alot- I mean like no flavor at all..\nWhen I told the waitress she just suggested that I add salt- Ugh, I don't pay at a restrauant to flavor my food- The waitress then asked me to get up and talk to the chef - so even though I thought the Chef should come to me - I went to him and he was willing to add some cream and salt - After the fact my pasta was still OK - I just remember really liking it before on a previous visit....\n\nThe BF's Spicy Red Sauce with Penne Pasta was OK once we got an extra side of sauce cause initially the pasta was pretty dry.\n\nThe salad and the garlic bread were pretty standard - nothing special.\nI still like the inside of this place- always clean and the free tootsie roll lollipops are cute. The wall decor is enjoyable to look at and the Mac Shack sign on  the wall is Very Veags.... \n\nFunny thing about the free tootsie roll lollipops - I suggested to my daughter to take a picture of the tootsie rolls to post on her instagram cause it was cute and colorful. Well, as we were taking the picture the guy behind the counter yelled \" Don't steal my idea\"  WTF was that about??? \n\nWould I come back?? Hmm... The jury's out on that one-"
        }, 
        {
            "index": 307, 
            "rating": 4, 
            "review": "Mac Shack, Mac Shack, Mac Shack...\n\nYou got me mackin' over some pasta =) If you're a pasta lover like myself, you will appreciate this place. I love that it's located right around the corner from my place.\n\nAnyways, my review will be based solely on my to-go experience and the shrimp scampi I ordered. I am not one to discriminate against pastas; I love and adore all equally, but have recently grown an obsession for shrimp scampi. I've made it myself before, but on days when I want pasta and don't feel like putting the minimum effort in cooking I will invest in to-go pasta. I truly believe the shrimp scampi is for pasta lovers that do NOT like creamy pasta sauces. The wine sauce is a good amount for this dish and they are giving with the shrimp and pasta. I must say that the garlic bread isn't that great which can explain the 4 stars. It just wasn't \"garlic-y\" enough and not soft enough for my liking.\n\nThe place itself is very spacious and has a warm light to it. The cashier counter have a nice display of \"fake\" pasta and dishes they make. I enjoyed the staff as well since they were very friendly. \n\nI will be back to a dine-in experience, so my review will be updated.. HOWEVER, for now I say I am a Mac Shack fan!"
        }, 
        {
            "index": 308, 
            "rating": 3, 
            "review": "Second time there.  The food is still just \"OK\".  The pricing isn't that bad for what you get.  Ordered a baked spaghetti to go.  By the time I got hom the meat sauce on the top had dried out and all the water was on the bottom.  The lasagne was so so.  Unfortunately the benchmark for lasagne is Stouffers, at least for me it is.  I'll probably go back again, but it's not a place that's in the regular rotation at this point."
        }, 
        {
            "index": 309, 
            "rating": 5, 
            "review": "Great place for some delicious pasta just the way you like it. I usually order the 'Crazy Alfredo' or the 'Red Rigatoni.' As for the other reviews that don't know what to order 'cause it's make-your-own, choose one of the favorite dishes already designed and swap out for stuff/ favorite noodles you like. And for those that thought this place was expensive, get real, this is NOT fast food 99 cent burgers. The ingredients are fresh and made when you order. I would go here over Macaroni Grill any day; a great inexpensive meal ($6-9) and delicious pasta how you want it made."
        }, 
        {
            "index": 310, 
            "rating": 5, 
            "review": "The first time I came i didn't LOVE this place.  However, it's close to my house and so we returned a few times....Then I guess I just started to order the right stuff and now I can't get enough of it!  The lunch special is such a great deal.  But if you are not getting the lunch special, you must try the smokehouse mac and cheese.  It's AMAZING!!"
        }, 
        {
            "index": 311, 
            "rating": 3, 
            "review": "This is actually 3.5 stars...this place is good BUT can be pricey.  Tonight I had the wheat pasta with meatballs and was charged $3 rather than $1.50 that is shows on menu. I added ricotta and mushrooms....so this dish turned out to be $11! We also got pesto pasta and a kids Mac n meatballs....checked in for free garlic bread and drink and still bill came out to $27.  Was satisfied with taste and portion size was pretty good. We will def return but I wish they'd have combo deals and also sides/appetizers like calamari with marinara...would be nice."
        }, 
        {
            "index": 312, 
            "rating": 4, 
            "review": "Used to come here after a hard days work.  The name says it all, go with the classic mac and cheese, its well worth it.  They use quality cheese and have nice portions aswell.  Nice for take home too.  3.7 stars."
        }, 
        {
            "index": 313, 
            "rating": 4, 
            "review": "When i worked down the street from here, this was lunch a few times a week. And when the lady wanted to eat here it was dinner. I love the ambience of the of the restaurant. Its very open and welcoming. The ability to make your own combinations of mac is awesome. Even the pre made concoctions are really good. If you are looking for good pasta on the quick and reasonably priced, try here you won't be disappointed."
        }, 
        {
            "index": 314, 
            "rating": 2, 
            "review": "Two years ago we loved this place and went all the time. But the quality has slipped a lot and at this point the cost is too high for what you get. The Crazy Alfredo used to rock. Big tail-on shrimp and fresh sliced mushrooms. Now? Tiny bay shrimp and canned mushrooms. There is so little cheese in the Chedder mac that you have to order it with double cheese just to it is not a bowl of pasta and béchamel sauce. Which of course, drives the price even higher.  Again, they are close by and we used to go all the time and we loved the place. But I have gone maybe four times in the last 18 months and it just doesn't get any better. Mac Shack doesn't suck. It's clean and the service tends to be competent and mostly friendly. But the quality of the ingredients used has gone way downhill and does not appear to be coming back up anytime soon."
        }, 
        {
            "index": 315, 
            "rating": 5, 
            "review": "Love the Caesar salad and the service was great. \nVery friendly staff, clean dining.  Don't forget your sucker on the way out. \nLove it here. \nFITZ CREW"
        }, 
        {
            "index": 316, 
            "rating": 5, 
            "review": "Absolutely love Mac Shack! Strongly recommend their crazy Alfredo..... Delicious!"
        }, 
        {
            "index": 317, 
            "rating": 4, 
            "review": "i really like the \"everything\" pasta with shrimp, chicken, and everything, because it just taste that good.  BF also likes his Chicken Parm and Pesto pasta too.  A little gem of a place in my new neighborhood."
        }, 
        {
            "index": 318, 
            "rating": 5, 
            "review": "Seriously my favorite place to grab lunch/dinner! I live pretty close by so I can always call and place an order for pick up and grab it before I head home. The staff is amazing as well. My favorite dish is the Spinach & Artichoke Mac but all the dishes are really delicious and well-made. Props to the cooks!"
        }, 
        {
            "index": 319, 
            "rating": 5, 
            "review": "This place is amazing. It's a bummer this is the only one in town but lucky for me I live close by."
        }, 
        {
            "index": 320, 
            "rating": 5, 
            "review": "This location is way better than the other one in Summerlin. Everyone is very friendly and the food is always correct and piping hot. Keep up the good work however management needs to rethink what's going on at the location in summerlin"
        }, 
        {
            "index": 321, 
            "rating": 3, 
            "review": "I enjoyed my meal, but couldn't get over how expensive it was. $17 for two pasta dishes and two waters!? We could eat at Olive Garden for a little more, AND get free bread sticks and salad!\n\nThe restaurant is cute, nice decor. Friendly staff. There are great options as far as pastas, veggies and sauces go. The Garlic and Oil sauce was really tasty. I enjoyed my Asiago Blue Mac and Cheese with broccoli and asparagus. I was worried it'd be too blue cheesy, but I thought it was perfect. I thought the portions were a good size.. filling. \n\nAlthough I liked the food, I don't think I'll go back often because of the prices. Maybe I need to sign up for their coupons.."
        }, 
        {
            "index": 322, 
            "rating": 5, 
            "review": "Great service and great food! Would like to give a shout out to the young man working the cashier today, he was very polite and answered our questions. All cashiers should be like him! Will definitely be back"
        }, 
        {
            "index": 323, 
            "rating": 2, 
            "review": "I placed my order over the phone. 2 kids call me and cheese. Server informed that it came with a cup cake and drink. When I was done placing my order the girl on the other line did not even ask for my name or number. I had to call back to confirm my order. When I got there and I received my order there was no cupcakes for dessert! I got freaking roll ups!!!! Seriously??? I paid almost 8 for each kids meal and you give my kids a freakish roll up? I have those at home. Then the server asked me what kind of drink I wanted with the kids meal. He gave me choices and one of the choices was apple juice I said ok that's fine. He came back with no ape juice. He said that I was not included in the kids meal?? Really???? I\nI was really looking forward to enjoy their food but it just gave me a horrible headache!"
        }, 
        {
            "index": 324, 
            "rating": 5, 
            "review": "Wow. This place is awesome!i love it and. I don't even like Mac n Cheese lol \nThe restaurant is like half fast food and half normal restaurant. \nThey have modern music playing in the back ground, very chill, very relaxing. It has a really good vibe to it. \nIt's super clean, the staffs are very friendly, everything is very organized. \nThe portion they gave us was enormous, you can order one order for two normal size people. We ordered one each and didn't finish but hey, I love left overs lol \nWe had the buffalo chicken Mac, which was AMAZING! It was so so delicious, it tastes like you're eating an actually buffalo chicken wing and it even has carrots and celery! Haha it was so good. \nThe other order we ordered was the smokehouse Mac. It wasn't my fav but it wasn't the worst thing in the world, my bro in love loves it just as much as the buffalo. When you eat it you can taste the smokiness flavor in the Gouda cheese. Oh yeah, they have different cheese for each kind of Mac. \nAnyway, it was a very pleasant visit. \nI wouldn't mind coming back. :p"
        }, 
        {
            "index": 325, 
            "rating": 1, 
            "review": "I have been to the Summerlin location and have enjoyed their pasta. I always order the bottle service. This location however is a joke. I ordered philly cheesesteak mac and bottle service and for both the pasta was undercooked. I wouldn't even call it al dente... way undercooked is more like it. The philly mac came with very little meat on it while the sirloin beef in the bottle service was definitely not sirloin, more like a week old meat was used. Meat was very tough and tasted horrible and definitely not fresh. This Mac Shack location is a huge let down and I will never be back. So sad since I just moved in this area. Parking is also horrible on a friday around 1pm. I must have circled 3x before I was able to park and wasted 20 bucks on inedible pasta."
        }, 
        {
            "index": 326, 
            "rating": 3, 
            "review": "This place was ok. Nothing really amazing though. I had the Red Rigatoni ( if I remember correctly). The portion looked small but was actually quite filling. It wouldnt hurt if they gave more bread with the meal but I suppose this isnt that kinda place anyway. The prices were not bad either and the service was good. I wouldnt mind going back to try out another dish."
        }, 
        {
            "index": 327, 
            "rating": 4, 
            "review": "One of my favorite places to eat in the city? If you havent been there and like pasta its a much try!! You get to build you own pasta dish from the noodle\nUp to the sauce!! AMAZING"
        }, 
        {
            "index": 328, 
            "rating": 1, 
            "review": "We pondered over the menu, all the options are a bit overwhelming. There are a dozen pastas and ten different sauces to choose from, then you chose veggies, cheeses and proteins to be added. We thought we'd go with one of \"Mac's Favs\" the Broccoli Pesto ($7.50) and we'd also try the Pepperjack Mac ($6.25). \n\nThe broccoli pesto is served over penne with chicken and sauteed garlic. It was dreadful. The pasta was underdone and overdone, depending on the bite. It was bad news. The chicken was so dry I could have easily mistaken them for breadcrumbs. The pesto was overpowered by garlic only a slight bitterness shined through.\n\nThe pepperjack mac also has monterey jack and asiago cheeses.  It was better than the broccoli pesto. The noodles were cooked evenly and it had a little kick. The jalapenos on top were just terrible, like they were dehydrated or something. Very odd. Otherwise, the first few bites were decent. Then the mac cooled. It quickly became grainy and gross. I grew tired of it in a hurry."
        }, 
        {
            "index": 329, 
            "rating": 5, 
            "review": "I am giving this place 5 stars just because I thought it was extremely creative and the staff was very nice. There are not many food places I find that are just completely different. But this place surprised me I was able to make my own creation and that was good for me. I would suggest a few more meat options since I was carb loaded but cant blame them since they are called mac shack. Would suggest trying especially if you like mac and cheese."
        }, 
        {
            "index": 330, 
            "rating": 1, 
            "review": "If your coming because you love Mac and cheese, this place will disappoint you.  The taste was plain and I would have been better off getting some Velveeta.  1 star for crushed ice"
        }, 
        {
            "index": 331, 
            "rating": 4, 
            "review": "I come here several times each week... love it. Always consistently good."
        }, 
        {
            "index": 332, 
            "rating": 2, 
            "review": "We usually eat here once a week and prior till today everything has been great. We place our orders online and have had no problems. \n\nTonight we placed our usual order at 6:30 pm for pick up at 7pm. My husband went in and stood by the phone/internet order line like normal but today the cashier continued to take everyone in the regular line. After finishing the orders for about 4 other families that arrived after him, she then asked if my husband needed something. He said we made an online order and she said ok I have it right here on the counter and will now place the order. Why was it not placed when it came through? We didn't receive our order that was placed at 6:30 until 7:30 because it was not placed by the cashier properly. We are assuming she was new and did not know the process but please correct this so it doesn't occur again. Thank you!"
        }, 
        {
            "index": 333, 
            "rating": 4, 
            "review": "This place is a perfect place to go when everyone is ready for a carb-loading type of dinner the night before an intense workout or marathon! Lol \n\nThe food here are freshly made.  Pomodoro Fresco with capers and shrimp is such a good combo !!!!  When you order something with shrimp, it's actually fresh raw shrimp that they grill up  not frozen and heated up.  \n\nAfter your meal there's a Golden Spoon you can hit up for dessert :P"
        }, 
        {
            "index": 334, 
            "rating": 4, 
            "review": "Wow. This place is very good for a chain restaurant. I had their soup and macaroni and cheese, along with one of the most frequently ordered pastas (I don't recall the name but it has tomatoes, potatoes, and what looks like chicken). All I can say is, YUM. The pastas were cooked perfectly. Portions are huge, too. \n\nThe store is very bright and clean.\n\nThe only problem is that it's pretty steep financially for a place like this. I've grown accustomed to paying for $18 pasta dishes at TCF or other gourmet places, but in a Chipotle-style environment? Plus, the furniture is pretty cheap.\n\nAnyway, it was still pretty good."
        }, 
        {
            "index": 335, 
            "rating": 1, 
            "review": "I ordered delivery at 5:10 pm. She called me back to verify my address at 5:12 pm. I called at 6:00 pm and asked where my food was. She replied with we haven't had 1 single delivery order all day. I said that's impossible and told her the above story. She then asked me if I ordered from another location.  I told her I'm calling the number in which one of the associates called me from. Placed on hold. Then when she got back on phone  she told me her new cashier didn't put the order in the computer so she'll comp one of the items. \n\nYes. 1 item.  \n\nFood gets here the total is 23.00 I give him 30.00 and what do you know... The driver doesn't have change. \n\nI ordered 3 items. 2 hot pastas and 1 salad. The salad was on the bottom of the Luke warm pastas. \n\nThe food ...  Had little to no flavor and paired well with a warm soggy salad. \n\nOh btw you also can't use your free breadsticks coupon for delivery."
        }, 
        {
            "index": 336, 
            "rating": 3, 
            "review": "I probably would have eaten here months ago if I hadn't assumed it was an unauthorized Apple retailer. Silly me, I guess.  But uninspired name aside, I thought this place was pretty good.\n\nYou get a sense of the hip, bistro vibe a lot of places go for these days, with the walls reminding you in giant letters that their food is locally sourced and sustainable. The crew was all young, but friendly enough and seemed to know what they were doing. \n\nThe menu was large, but I think the macaroni dishes were too few and simple for a place with Mac in the title, but that may not be such a bad thing. There were also traditional Italian pasta selections, as well as some interesting creations that seemed worth trying out.\n\nThe create-your-own pasta feature is a great idea but it seems kinda broken. It's 7.25 for your choice of pasta and sauce to start, 1.95 for a meat choice, and .65 for each additional toppings (from a list of enticing toppings of which you will want many). By the time you've set up a basic dish with only one meat and one topping it's an almost $10 pasta. Meanwhile, the most expensive plates on the menu, with multiple meats and toppings included are only around $11.  This is all a long way of saying that it's a much better value just to pick regular menu item and substitute any toppings you don't like for ones you do.\n\nI got the crazy Alfredo (10.50) : fettuccini pasta with chicken breast, shrimp, Italian sausage, roasted peppers, sun dried tomatoes, mushrooms, and jalapeños.  The sauce was a little light on flavor and the shrimp were small and not the best quality, but the dish was very large, the ingredients fresh, and overall, quite enjoyable. For the price, I can definitely recommend it.\n\nMy wife got pepper jack Mac and cheese and added bacon. I was kind of jealous. It was a generous portion of elbow pasta, cheese, jalapeños, and flavorful bacon. I will probably stick to their Mac dishes from now on.\n\nMac Shack is a great place if you feel like eating Italian food, but don't want to spend a lot of money or tip. They have a diverse menu that should offer something for everyone, and service is quick. \n\nPretty solid little pasta joint!"
        }, 
        {
            "index": 337, 
            "rating": 4, 
            "review": "Kids eat free on sunday...but you have to dine in.  And you can't use the check in offer if you are using another offer/special....like kids eat free.  \n\nI've been here four times and they always have great food.  Shrimp Scampi is great, so is the Crazy Alfredo.  Smokehouse Mac and Cheese is a little too sweet for me; it has BBQ sauce in it.  This time around, I had ordered something with steak and it was way overcooked.  Too chewy.  My cousin got the larger size and it just comes with more pasta and sauce.  I've always been pleased but this time around not so much."
        }, 
        {
            "index": 338, 
            "rating": 3, 
            "review": "1st time I was here I was so excited and I tried their mac and cheese, soup, and another creamy pasta. I got a little sick and bogged down because it was too heavy. The flavors and portion size were decent. \n\nThe next couple times I came back it was inconsistent. The special would be good one day and not the next. The service is also the same, one day the counter person would not know anything, the next, they would be helpful and informative. \n\nThe ingredients look fresh and I've watch them cook. It's quite mesmerizing watching the chef cook up so many pasta plates. \n\nI like this place and will go back, but there's nothing exciting about the flavors. It's a good place to grab a quick bite."
        }, 
        {
            "index": 339, 
            "rating": 1, 
            "review": "Not sure why everyone seems to be raving about this place. I order the shrimp scampi, nothing special. My daughter got the Mac and cheese, it's was also okay. My husband got the bottle service pasta, only had 2 pieces of sirloin beef in it.The only good thing is, they served wine. I guess with wine everything will taste decent. Not coming back."
        }, 
        {
            "index": 340, 
            "rating": 2, 
            "review": "I was in the mood for pasta so we popped in.  My husband only gets alfredo where every we go, and Mac Shacks tasted like Kraft Mac n Cheese White Cheddar.  He liked it but he's a very plain palate.  Yes, I married Mr. Meat and Fries.  I had angel hair with olive oil, roasted garlic, spinach, mushrooms and shrimp.  I ONLY GOT TWO SHRIMP!  Really?  And maybe 10 mushrooms, 10 pieces of spinach, and 4 cloves of roasted garlic.  I have heard from others that they \"load you up\" on toppings but I did not receive that!  I was very disappointed in the \"bang for your buck\" of this place.  It did take care of my craving though...and got rid of that $25 that was just taking up space in my wallet........ :("
        }, 
        {
            "index": 341, 
            "rating": 3, 
            "review": "I still think it is a good spot for a bite when you're in the mood for pasta, don't want to cook and want sustenance quickly! I love the concept, and they do offer one whole grain pasta, which is a positive. On my last visit, there were just some things that disappointed me. The salad wasn't a baby green salad this time. I am not sure if they ran out that day, but what I was served was mostly iceberg. The spicy red sauce was also a tad disappointing, as the flavor was pretty one dimensional. And, my add ons of broccoli and roasted garlic were a little less generous than I would have liked. Overall, my repeat visit wouldn't lead me to go out of my way to dine again, but if I am nearby, I will definitely keep it on my list of solid eats."
        }, 
        {
            "index": 342, 
            "rating": 3, 
            "review": "i love the fact that when im in the mood for some pasta i dont have to go to olive garden or carrabas to get it.  they make pasta that you would enjoy here. now keep in mind that you still get what you pay for. and its fast youre in and out in like 10 minutes. dont forget to grab a tootsie pop on the way out"
        }, 
        {
            "index": 343, 
            "rating": 4, 
            "review": "This place is really fun and friendly.  The food is very different from any other place.  If you can afford the calories, you can go nuts but also, if you are watching your diet, you have all sorts of healthy options.\n\nI had a great time.\n\nLoved the music"
        }, 
        {
            "index": 344, 
            "rating": 2, 
            "review": "I had the shrimp scampi pasta dish and my wife had a baked mac dish that was missing the cracker topping when we ordered it. The shrimp scampi had a total of 4 of the small tiny frozen shrimp that was overcooked to the point of rubber. The scampi sauce was ok. Pasta was over cooked not at all al dente. This place was a let down but I do think they some decent drink  specials if your coming just for that. My advice seek pasta else where if you want taste!"
        }, 
        {
            "index": 345, 
            "rating": 2, 
            "review": "I just wasn't all that impressed with the Mac Shack. I have had a couple of people just give glowing endorsements to this place and, on paper, it sounded so good. I have to say it was a bit of a let down.\n\nLocated on the northwest corner of Warm Springs and Durango, it was easy to find. Mac Shack is actually located in the same strip mall as SkinnyFats, which is another place I have had bookmarked for a while.\n\nFor my first go round I ordered the Cheddar Mac ($7.75) and the Philly Cheese Mac ($9.95).  The portion sizes don't look like all that much, but they were actually quite filling. I guess my biggest complaint with this place is the consistency of the actual mac and cheese. It is very watery and almost feels like badly made blue box mac and cheese. I think of good mac and cheese, I think of thick, creamy, cheesy, gooey mac and cheese! What I got yesterday was nowhere close to that. After taxes, for almost $20 for 2 portions of mac and cheese, I better be impressed....and I just wasn't.\n\nThe place was very clean and service was fast and friendly, so certainly no complaints as far as all that goes.\n\nI just wasn't feeling it.\n\nMeh. I've experienced better.\n\n2 stars."
        }, 
        {
            "index": 346, 
            "rating": 4, 
            "review": "I have always said that if I could only eat one thing for the rest of my life, it would be pasta. I love pasta so much, and this spot totally caters to all my pasta needs. There are a few options on what to order here. You can choose a dish that is already put together from the menu, pasta-less items, or you can make your own pasta! I decided to go with the make your own pasta option because I felt like having some fun that day.\n\nI decided to order the wagon wheel pasta with a spicy red sauce topped with olives, onions, and basil. All together my order remained under $10, and I received a free breadstick and drink just for checking in on yelp for my very first time! I shared the pasta with my boyfriend, and we were still pretty full! The spicy red sauce wasn't as spicy as I thought it would be, but it still had a little kick. The basil was chopped into small pieces and complemented the sauce nicely. \n\nOverall, I would have to say the pasta here is pretty good, but it isn't the most amazing pasta I have had in my life (sadly I'm still searching for that..). Would I come here again? Yeah probably. It's cheap and filling, and most of the time that's what I search for when wanting a quick meal."
        }, 
        {
            "index": 347, 
            "rating": 1, 
            "review": "Just went to Mac Shack.  Food was good until a buddy saw a cockroach in his pasta. He took it to the manager and was offered another pasta.  Who would want to eat after seeing a roach in the food. The manager didn't offer a refund after refusal of food."
        }, 
        {
            "index": 348, 
            "rating": 3, 
            "review": "We've only gone here once and if we go again I will update. We loved the concept but the food that we had was very bland. My husband had a caprese sandwich and it was better than my Mac and Cheese. It's a good place to go with kids. I will try again but I'm hoping for a better experience."
        }, 
        {
            "index": 349, 
            "rating": 3, 
            "review": "This place is starting to lose their touch. I love cheese and pasta but this is the second time I get food from this place and its just not as good as I remember. I always end up throwing half of it away. This never happened before so I know something was changed by management."
        }, 
        {
            "index": 350, 
            "rating": 4, 
            "review": "I was really missing Noodle and Co. from back in the midwest when I found Mac Shack - a perfect replacement! Any kind of pasta you can think of and create is perfect for this carb lover! My imagaination has not let me down and I've enjoyed all the pasta dishes I \"created.\" The only drawback is that you cannot substitute any of the items from the house specialties (ie. regular tomatoes instead of sun - dried tomatoes) and have to pay extra. It can get pricey if you like a lot of ingredients. Check in and get a free breadstick and drink."
        }, 
        {
            "index": 351, 
            "rating": 3, 
            "review": "Mac Shack is a solid place to get a quick pasta meal in, but definitely not comparable to a full flavored restaurant. \n\nMost of the items on the menu are well made. The cheddar mac and cheese is pretty decent, you just need to season it yourself. The shrimp scampi was delicious, however do not expect medium or large shrimp, you'll get very small pieces. The pesto sauce is severely lacking flavor, and is the most watery pesto I've ever had. Soup and salad is average, but the tomato soup is a bit oily. \n\nThe customer service is great. The staff is very friendly and accommodating. The inside is very clean and nicely set up. You can watch the pasta cook prepare your food, and the other employees preparing your salad. What really strikes me as amazing is the blackberry green tea and the lemon water the serve, delicious. \n\nBuild your own pasta is the best way to go, and the lunch special with a soup/salad and breadstick isn't bad at all! \n\nAll in all, solid food, decent flavor, good value for what you pay for."
        }, 
        {
            "index": 352, 
            "rating": 4, 
            "review": "I've been here a few times, and the chefs do not disappoint. The Crazy Alfredo is my style of a dish, but they have others to choose from. Each dish is made on the spot, and always Al Dente!!!"
        }, 
        {
            "index": 353, 
            "rating": 4, 
            "review": "Good quick food! Always greeted when you walk in. Never ate in, but inside is very inviting. Guys in the back are visible while making your bowl. Nice selection even thought i always get the same thing."
        }, 
        {
            "index": 354, 
            "rating": 3, 
            "review": "The pasta was still good but the tomato basil soup and the garlic bread changed, it's not as delicious as it was before :("
        }, 
        {
            "index": 355, 
            "rating": 1, 
            "review": "The mack shack was bland both our dishes the crazy alfredo and schrimp scampi were bland.com @macshack hey do better!"
        }, 
        {
            "index": 356, 
            "rating": 5, 
            "review": "I can never get enough of the combination of great flavors for pasta, creating my own and I'm a fan of my vegetables. Great atmosphere and beautiful art work hanging in the establishment, courtesy team working. If I could I would eat 4 times a week. Although I do really miss the wonderful  grilled peanut butter and jelly sandwich. But other than that wonderful and great place for children"
        }, 
        {
            "index": 357, 
            "rating": 5, 
            "review": "I know that there is a God because my prayers were answered in the form of the Mac Shack! They should change their name to Mac and Cheezus because I had a religious experience when I ate their delicious Gluten Free offerings. \n\nFirst, the staff is amazingly nice and professional and the atmosphere is clean and inviting.\n\nSecond, they will make any of their dishes with gluten free pasta...can I get an amen?\n\nHere is what we ordered:\n\nAsiago Blue Mac ($6.95) Asiago, blue cheese, and pecorino romano in a luscious creamy sauce over perfectly cooked (and this is very difficult to do) gluten free pasta. Wow, this was so good. The sauce was perfectly balanced and the portion was hearty.\n\nCheddar Mac ($5.95) Wisconsin cheddar, aged white cheddar, and monterey jack cheese once again in a creamy sauce over GF pasta. This was great too!\n\nYou can also create your own pasta dish from a selection of sauces, pastas and other ingredients. \n\nI was so impressed by the great, friendly service, their ability to properly cook GF pasta, and their willingness to create great food for the gluten challenged. \n\nThank you Mac and Cheezus, um I mean Mac Shack, for answering my gluten free prayers!"
        }, 
        {
            "index": 358, 
            "rating": 1, 
            "review": "I got chicken alfredo, and the cheese was so overwhelming and gloppy that I honestly am left with such a bad taste in my mouth that I can't stomach ever having it again. It was thick and disgusting and completely overpowered the whole dish. I am allergic to gluten, and while Mac Shack is one of the few pasta places with a gluten-free menu, when I went, I found regular pasta mixed in with the gluten-free pasta in my dish. When I told the people up front about it, they were quick to make me a new bowl, but it's hard to say where the cross-contamination occurred, and it's unlikely I would ever come back again with staff so untrained about food allergies. This was a horrific dining experience."
        }, 
        {
            "index": 359, 
            "rating": 4, 
            "review": "Had the smokehouse Mac and cheese. Omg... bacon... omg... bacon!! Garlic bread was meh. But omg bacon!!! YUMMY!!"
        }, 
        {
            "index": 360, 
            "rating": 4, 
            "review": "I had the Smokehouse, very good.  The service is great, the food is hot and good flavor. I'll come back."
        }, 
        {
            "index": 361, 
            "rating": 5, 
            "review": "The Mac n cheese is delicious and so is the Cesar's salad. If you haven't been here you should check this place out. Build your own pasta dish. Yummy."
        }, 
        {
            "index": 362, 
            "rating": 1, 
            "review": "Precooked meats and pasta, thrown together and reheated... It's like your mom used to do with leftovers in the fridge at the end of the week only she called it \"casserole surprise\"... Unfortunately, unlike at your mothers house there is no family dog willing to relieve you of the burden of cleaning your plate... I love Mac and cheese, but this is not the place to get it, do yourself and your stomach a favor and take a pass..."
        }, 
        {
            "index": 363, 
            "rating": 5, 
            "review": "My entire family loves this place. Everyone gets to create their own dinner for a reasonable price. And of course on the way out everyone gets a Tootsie Pop cause their food is so good everyone cleans their plates."
        }, 
        {
            "index": 364, 
            "rating": 4, 
            "review": "It's has been awhile since I've found a place where I can let my inner carb monster out to truly grub away without guilt. I normally abscond from heavy carb loading if I'm not competing in a tennis tournament, but, I have to say that I have the biggest weakness for Mac and cheese! Needless to say, I was excited to give this place a shot. With this said it was very difficult for me to keep my hunger pangs at bay, as soon as I entered the establishment! I'm met with the aroma of what I can only call...HEAVENLY...Based on my pleasant experience with the dashing and unusually handsome staff, this place served it up and boy do they know how to do it with quantity in those well proportioned bowls! (^_^) Portions placed on the side however, Mac Shack's  scrumptious menu selection offerings does fall a little more on the bland side. Maybe making their sauces cheesier or flavorful might help because based on what I had, the Philly mac and cheese, I often found myself wishing that I had stowed away some cheese slices from home before walking into mac shack and adding it inconspicuously to my bowl for more cheesy goodness. No one plans for these things and I could've easily asked for more sauce but I had an epiphany. AHA!!! I don't know if it's for health reasons, but perhaps adding less sauce gives you that option of \"having your cake and eating it too\". Overall, the Mac Shack manages to fulfill pasta cravings and then some. If you can look past the bland tastes and less cheesier iterations of your comfort food, you will certainly keep coming back for more of this guilty pleasure. But then again keep in mind that maybe they skimp out on over cheesing so as to offer comfort food in a way that doesn't make you the legendary lake mead beached walrus!"
        }, 
        {
            "index": 365, 
            "rating": 5, 
            "review": "Bottle Service and Shrimp Scampi are my two favorites lately.\n\nI try a new dish every couple times I eat here and the food is ALWAYS amazing and I ALWAYS leave stuffed!! \n\nYou can create your own combination of all your favorite ingredients, trust me they have them ALL. But the dishes on their menu are WAY better than anything \"I've\" ever put together. So I've made my way through about three fourths of their dishes even with the new ones they've added and I've been pleased EVERY time."
        }, 
        {
            "index": 366, 
            "rating": 1, 
            "review": "Protein portion size is a deal-breaker for me.\n\nJust got takeout for lunch. Ordered a Spinach Salad with add-on shrimp. Discovered the policy for an add-on protein is ONE LARGE SHRIMP. Very disappointed. The manager told me their shrimp costs about $1.10 each. EACH. (That seems to be pretty high-priced shrimp, especially for a one-dollar-sign restaurant on Yelp.) The manager offered, if i returned, to \"give me another shrimp\", as that, evidently, is a non-add-on portion of shrimp. Still disappointed.\n\nThe manager was nice, the service was pleasant, the food was fairly good and quick. (I found the shrimp to be nicely cooked, a little under-seasoned. The spinach salad was nothing to write home about, and the balsamic vinaigrette was not very punchy. My fiance loved his baked wheat pasta with meat sauce, which was well-seasoned and rich) \n\nMore info from the manager. Add-on portion of chicken is 3 oz (6 for entree). Add-on for meatballs is 2 balls. So I guess when you order the create-you-own pasta dish, you get less protein than when you order one of their \"classics\".\n\nBeing a new restaurant, I was told \"they are still working out the kinks\". Well, this is a HUGE kink for me, and I imagine it will be a kink for others. I hope that the policy changes, because the food is good, and I wish the company success (I would love to have quick/cheap Nora's around the corner when I want pasta!)\n\nUPDATE: I also went to their website and submitted a complaint. I received an email the same day from the founder/owner saying \"Thank you so much for your interest in us and I assure you the shrimp policy will be changed first thing in the morning!! I'm sure you know that this was only our second day being open, and we are trying really hard to offer a top quality quick serve pasta concept.\"\n\nSo they get another star from me, for being cool and understanding. I WILL go back now to see if that really happened, and if so, then they may get another star!\n\nUpdate 2: it seems they have NOT changed their protein sizes. so their owner lied. not cool."
        }, 
        {
            "index": 367, 
            "rating": 4, 
            "review": "I missed the Yelp party here! Nooooo!\n\nBeen here a couple of times... it's the Chipotle of Pasta. Easiest, best way to describe it.\n\nSolid lunch spot. Make your own pasta dishes... what else can you say about it? if you love pasta, this is your place. Service with a smile, everything was cooked to order, it's turning into a nice little regular spot for us."
        }, 
        {
            "index": 368, 
            "rating": 2, 
            "review": "It's ok. I mean, it's pasta/spaghetti.\nI love pasta and all but, this is the kinda stuff I can do myself. And frankly, I'M NOT A COOK; so that already says alot!\n\nOne great part of their menu was that their mac and cheese. It was pretty delish. Cheesy and crispy (from the baked topping). \nI wish wish WISH they served garlic bread/toast/something with the pasta. Instead was some sweet roll. WEIRD.\n\nOther than the menu, the ambiance was nice. Pretty classy with great panoramic pictures of farms (ala wheat ala pasta).\n\nIf there was one major suggestion I could make to the owner, it would be to: INVEST IN REAL UTENSILS!!!!!!!!! \n----- Please, someone, tell the owners this!!!!!!!!!!!!!!!!!!\n\nIt was odd to be drinking wine and eating $8 pasta with a plastic fork and knife. Classy place with plastic utensils...LIKE, REALLY???!!!!???!"
        }, 
        {
            "index": 369, 
            "rating": 5, 
            "review": "Any place that makes the world of \"what-if's\" come true.. Is definitely worthy to be on my list! Just the name Mac Shack is strong and very straight forward.\n\nOne night me and the BF were looking for salad for our resolution diet. We've been passing by Mac Shack and finally decide to try it. It was around 820pm and mind you they close at 9pm. So, I was worried they'd deny us of service. But the moment we walked in.. First things first they greeted us. In other words, the didn't mind at all to serve us for their last remaining minutes.\n\nCool thing was the menu was pretty \"self-explanatory\". They had a section of create-your-own pasta and a section of creations of their own.\n\nI created my own. Bow tie pasta with spicy red sauce. The spice was perfect. I added ricotta cheese, sun-dried tomatoes, mushrooms and zucchini. Cool thing is, if you're not sure what any of those ingredients look like.. They have physical samples right underneath a glass, which is conveniently the cash register table. It's great for the visual learners :). I'm not a big wine fan but they do serve it. And afterwards they have tootsie pops on your way out.\n\nThe seating is plenty. There's even outdoor seating, although it's been too cold lately, I'd love to sit next to the orange tree. But the inside art work is gunna do for now. Parking is also plenty. \n\nOnce again, another place of many possibilities specifically with pasta."
        }, 
        {
            "index": 370, 
            "rating": 5, 
            "review": "Excellent service. Thanks to the cashier for the recommendation of the spinach and artichoke with chicken. Delicious!!!"
        }, 
        {
            "index": 371, 
            "rating": 5, 
            "review": "I travel a quite a bit for work and this is one of the places that lets me know I'm home.  I ordered using the website tonight, there was a glitch in the matrix and my Crazy Alfredo was not ready on arrival.  The staff was extremely accommodating with multiple staff members apologizing for the mistake.  I was offered a fountain soda to ease the pain and a noticeably quick meal.  \n\nLove the service, love the food, fresh ingredients, elegantly executed concept."
        }, 
        {
            "index": 372, 
            "rating": 3, 
            "review": "A-OK. Nothing special. I felt like eating Mac and Cheese, and a co-worker told me there's this place nearby. I went there, ordered the shrimp mac and cheese. It was good, again nothing special. If you feel like not making krafts mac and cheese @ home and just want someone else to make it for you, then come here"
        }, 
        {
            "index": 373, 
            "rating": 2, 
            "review": "So brought two small children here and they really liked it so a plus (but the kids portion's are freaking huge!!! I thought America was trying to win the obesity epidemic). I expected a waitress type deal. To me it was very hectic trying to stand in line looking at a vast menu with little to no picture's people waiting in line behind you)!!! I ordered my own creation and it was very good (love anything with capers and bacon) hubby got the Philly cheese steak mac and well it was bland and far from tasting like the amazing Philly sandwich. But I do have to say it was very clean and the staff was very nice. Other then that I think this was just another notch in the food belt."
        }, 
        {
            "index": 374, 
            "rating": 5, 
            "review": "Really enjoyed this place. We were in the mood for something different. We need one of these in Tucson"
        }, 
        {
            "index": 375, 
            "rating": 3, 
            "review": "Was driving around with my son trying to find something different. He wanted a burger and I wanted a burrito and we could not agree on a restaurant. We headed up Warm Springs towards Durango and saw this place. My kid is crazy about noodles, being part Korean I can't blame him, so we decided to check out this pasta joint the Mac Shack. Service was easy and quick and portions were large, neither of us could finish our meals, luckily we live left overs!\nHe ordered the smokehouse Mac and I the Taco Mac. We swapped a few times and I think he liked the taco and I the smokehouse. We will definitely be back.\nYou will not get your veggies here but if you need a good carbohydrate push this is your place!"
        }, 
        {
            "index": 376, 
            "rating": 3, 
            "review": "I like this place enough to return but I would't call it great, confusing menu layout and having to order at the counter with the stress of holding up everyone behind you makes dinning here a little stressful for the first timer."
        }, 
        {
            "index": 377, 
            "rating": 3, 
            "review": "the chicken noodle soup was delicious, it had noodles, veggies, chicken, and not overly salty.\n\nthe baked rigatoni took longer than expected to get. \n\nIf it was just a tad cheaper It would have gotten 4 stars."
        }, 
        {
            "index": 378, 
            "rating": 4, 
            "review": "Nice clean restaurant and really really fresh food.  everything is made to order from when you order, and brought out to your table.  there is no waiter service, it's walk up, order and delivery to the table.\n\nI'll go back."
        }
    ]
}